[
  {
    "username": "Jasonlin778",
    "rating": 1.0,
    "comment": "來源：鐘樓怪人\n我只是想讓大家知道這是糞game",
    "timestamp": 1759356000
  },
  {
    "username": "QueenOfBread",
    "rating": 1.0,
    "comment": "CGE supports transphobia.",
    "timestamp": 1758060000
  },
  {
    "username": "Mandurang",
    "rating": 1.0,
    "comment": "Suffers from no player interaction. Just a solitaire game with others on the table. Research board is a separate mini-game which does not help gameplay. I would rather not play anything instead of playing Arnak, so I will give it the lowest possible rating.",
    "timestamp": 1757109600
  },
  {
    "username": "Scifi66",
    "rating": 1.0,
    "comment": "Light-medium weight Euro optimiser with a dash of deck building, worker placement and hand management at 20-30 minutes per player. Inoffensive best targeted at family/casual gamers.\n– Decision space isn't deep or wide enough\n– Low interaction only minor blocking or buying items others want\n– Replay won't hold up",
    "timestamp": 1753135200
  },
  {
    "username": "rajonrondo9",
    "rating": 1.0,
    "comment": "very pathetic balance",
    "timestamp": 1753048800
  },
  {
    "username": "lililililil",
    "rating": 1.0,
    "comment": "Automata",
    "timestamp": 1747432800
  },
  {
    "username": "cotomel",
    "rating": 1.0,
    "comment": "Horrible hodgepodge of mechanics, no interaction \"modern\" euro. Basic trend chasing abomination.",
    "timestamp": 1732748400
  },
  {
    "username": "Bauldric",
    "rating": 1.0,
    "comment": "For me it is far too much luck in the game.",
    "timestamp": 1725141600
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "Better build our decks so that we can properly sweep these ruins of all their treasure!",
    "timestamp": 1723759200
  },
  {
    "username": "Daotar",
    "rating": 1.0,
    "comment": "One of the blandest games I've ever played with very shallow mechanics. The theme is fun, but far too lightly applied and doesn't make any sense with the mechanics, especially the whole \"exploring temples\" part. The deck building is pathetic, you only end up adding 2-3 cards to your \"deck\" the whole game, and the fact that the item row is intentionally designed to seize up is incomprehensible to me.",
    "timestamp": 1720735200
  },
  {
    "username": "rainyl",
    "rating": 1.0,
    "comment": "原版9分，是我2021年Top10第一名。游戏性吹爆。\n中文版0分，从众筹到发货等了1年多，发货的产品存在着无法用正常逻辑解释清楚的版本问题且至今没有售后解决方案。我作为一个买家，花了多出几倍的钱要买的是正版的桌游，不是一堆生产问题且来路不明的版本。在出现可以自圆其说的解释，且得到满意的解决方案之前，不会再购买一刻馆任何一款产品，哪怕是阿纳克，哪怕是灵迹岛。\n\n-----------\n\n玩起来非常舒服的DBG+工放，对比某一款刚刚出中文的同样是DBG+工放玩法的游戏强了很多，爽感和操作感都很强。\n\n无论是版图上不同的交通移动方式还是每过一轮月光权杖的移动使得购牌堆神器越来越多补给越来越少，都模拟出了秘境探险的感觉。探索、战斗、研究几条路线相辅相成，主要行动和快速行动互相搭配，给了玩家各种小操作的可能性和博弈的空间。\n\n比较明显的问题大概就是牌列类DBG共通的翻牌随机性了，但构筑牌库带来的爽感可以掩盖掉这一问题带来的负面体验。",
    "timestamp": 1678748400
  },
  {
    "username": "big stone",
    "rating": 1.0,
    "comment": "a fake DBG",
    "timestamp": 1665957600
  },
  {
    "username": "ultimoratio",
    "rating": 1.0,
    "comment": "oh boy. Highly uninteresting game. Leans so hard on tactical play that the game hinders you on doing any forward planning beyond a few turns. Strategic plays sullied by arbitrary decisions at tactical level.",
    "timestamp": 1646262000
  },
  {
    "username": "rexhaha",
    "rating": 1.0,
    "comment": "A meh game with over produced components",
    "timestamp": 1642201200
  },
  {
    "username": "suelensgrs",
    "rating": 1.0,
    "comment": "unbalanced",
    "timestamp": 1626300000
  },
  {
    "username": "GaiaHero",
    "rating": 1.0,
    "comment": "Awful engine builder that sucks the life out any drop of theme present, one of the worst first time experiences I have had what the hell went wrong here...?",
    "timestamp": 1623794400
  },
  {
    "username": "mdean",
    "rating": 1.0,
    "comment": "This is the exact sort of thing I don't care for or understand so I have only myself to blame",
    "timestamp": 1619647200
  },
  {
    "username": "Speedwaysupporter",
    "rating": 1.0,
    "comment": "....look at the video of \"Ralph L\", and everything is said (albeit in German)!\n\nWhen played with my wife her 1st reaction afterwards was: \"What was that? Anything new or special? Everything seen and played - What a ridiculous hype! Boooring...!\"\n\nI couldn't agree more!!!",
    "timestamp": 1610751600
  },
  {
    "username": "Schr0dinger85",
    "rating": 2.0,
    "comment": "I like elegant designs — games that excel at what they do. This is the opposite: a hodgepodge of poorly implemented mechanics in a boring game. Huge balance issues, too — you just need to run through the temple to grab relics, or whatever it’s called.",
    "timestamp": 1762124400
  },
  {
    "username": "larienna",
    "rating": 2.0,
    "comment": "This game is horribly complicated and convoluted. Its a resource transfiguration mayhem that is fortunately playable solo. The game is a combination of deck building and worker placement, I do not dislike the combination. But that game specifically does it wrong from my point of view despite it's high rating.\n\nFirst, its a combination of 2 mechanism, but it does not do any of those right. You only have 2 workers and you will never get more. And there is a bit of deck building but its also not the focus of the game, so both mechanics are underused.\n\nSecond, in many games its easy to know when you are done. You played all your cards or placed all your workers, then you are done. In this game, you also have resources in you camp that allows you to do actions. So you never really know when there is nothing more you can do.\n\nAlso, one syndrome I encountered, that could be a good or a bad thing, is that its hard to forward plan ahead, there is so many things you can do and ways to achieve your goal that you might get new ideas you never thought in the middle of the turn and change your orientation. And of course other players can screw you up. So I end up in a situation, I have workers, but I have no idea what I want. What do I try to achieve.\n\nGetting resources is very complex and the building up on the tech track is very expensive (OK, we played with the expansion track since appanretly in the original game, going on this track was the only way to win). Still, we did not end up reaching the end of the board or start buying point tiles. Unless the rest of the expansion brings more ways to get resources to compensate, I think the track was too hard. Also the spyglass gave more points than the notebook, so there is little reason to boost the note book.\n\nLike Copycat, this game has a serious resource flow issue. Everything gives and do everything. I need gold, I can play a card from my deck, I can place a worker, I can upgrade a technology, I can spend a monster I defeated, I can spend an artifact that I found, I can use a character that I hired, etc. So when you try to analyze the game, if you need gold to do something, it's not always clear how can you actually collect gold. Sometimes 2 different methods could give you the gold you want, but you need to compare what you need to spent for each method before determining which to use. It is very painful to analyze.\n\nAlso the game is short in nb of turns, not time (our game took 3 hours with newbies), if it was less convoluted, there could more turn to buy cards and buildup your deck. There is no upgraded version of the basic cards. You start with 2 gold and 2 explore cards, but there is no card that yield 2 or 3 exploration points that you could add to your deck.\n\nThe cards are also very confusing. Some cards are usable as an action, you play the card and perform what ever indicated. Some cards are used as resources, so you can play them when doing other actions. Some cards requires you to spend tablets, a special resources, that you must have previously collected. Is this supposed to be a deck building game or what.\n\nIt feels so much clunky, it does not have card flow of a deck building game. Its like if you played a game where some cards are played by resolving its text, other cards take effects by throwing them on the wall and seeing how far they can bounce, and another portion of the cards must be slotted on your clothes as decoration.\n\nHaving a better streamlined game that flows well could have given good results. The Indiana Jones style of theme is really interesting. I have nothing against what the players are actually trying to achieve thematically in this game.",
    "timestamp": 1760824800
  },
  {
    "username": "destinyawaits",
    "rating": 2.0,
    "comment": "Hard to accomplish enough in 5 rounds time alloted. Overcomplicated to the extreme. Took an hour and a half just to set up. Vague rules.",
    "timestamp": 1756504800
  },
  {
    "username": "ravn1ca",
    "rating": 2.0,
    "comment": "Average",
    "timestamp": 1752357600
  },
  {
    "username": "Nodens",
    "rating": 2.0,
    "comment": "Looks nice in that 'I ate 2 pounds of cardboard and puked on the table' way of older FFG titles - except there is no map, only areas to put stuff. The VP track is basically your shopping list, spelling the whole game out for you: which resources you will need at what time to advance. Also no interaction, naturally. The most emotional moment was when I wanted to draw a certain card and didn't, that was slightly annoying.",
    "timestamp": 1749592800
  },
  {
    "username": "GarfieldKlon",
    "rating": 2.0,
    "comment": "Boring gather resource, change resources for other resources to get some VPs.\n\n\nTheme:           Weak theme\nGameplay:        Nah\nInteraction:     No\nArtwork:         Nice\nLuck:           can't remember\nStrategy:        Not much possibilities\nComponents:      Very good\nPlay duration:   A little bit too long\nEasy to teach:   A lot to teach\nRules quality:  not read\nSetup time:     can't remember\nNo downtime:    can't remember\nReplay value:    Not much I can think of",
    "timestamp": 1741993200
  },
  {
    "username": "Amraam555",
    "rating": 2.0,
    "comment": "Most overrated game I own. Sadly disappointed given the positive reviews. Hybrid worker placement deck building that seems underdeveloped and not engaging. Pluses are it is cheap and good production value.",
    "timestamp": 1736550000
  },
  {
    "username": "TranMBao",
    "rating": 2.0,
    "comment": "Low interaction, even playing chess is more fun. Sometime you’re out of move and choose to pass, and watch your opponent play for 10 minutes alone for his stupid win.",
    "timestamp": 1734649200
  },
  {
    "username": "stray_stoat",
    "rating": 2.0,
    "comment": "A boring game in which at first you can't do anything, and then you don't want to do anything at all. It's just turning resources into victory points without any theme, meaning, or fun. I've played twice, I've won twice, I'll never play this game again.",
    "timestamp": 1732921200
  },
  {
    "username": "dtmoney75",
    "rating": 2.0,
    "comment": "1 Play\n\nPlayed at: 3",
    "timestamp": 1729548000
  },
  {
    "username": "greedygold",
    "rating": 2.0,
    "comment": "Average",
    "timestamp": 1714428000
  },
  {
    "username": "iplaybgnaked",
    "rating": 2.0,
    "comment": "Aggressively boring deck building plus worker placement amalgam where neither mechanic is enough interesting on its own nor is the sum greater than its parts. The card play lacks any compelling decisions as playing them for the ability vs the icon is always obvious and the random market combined with the lack of any thought provoking card synergies does not engage me enough to discover what other potential strategies there are. The worker placement is shallow with little reason to snipe valuable spots for other players which made more dull by the exploration spots being both random and mild upgrades to what is on the board. While not scripted, the early game certainly is linear as there are clear sequences of optimal moves that the only deciding factor for which set you play is determined by where you are in turn order or if another player opts to not play them, meanwhile the mid and late game fails to offer any variety or shake up the status quo as players become entrenched in cranking their engine for value. Just a forgettable experience.",
    "timestamp": 1710284400
  },
  {
    "username": "NightinGale4",
    "rating": 2.0,
    "comment": "Played on BGA. A bit too convoluted for me and the separate elements and mechanisms don't come together enough as a whole, in my experience. After all the hype and waiting so long to finally try it, it didn't live up to my expectations, unfortunately.",
    "timestamp": 1684533600
  },
  {
    "username": "kratyloss",
    "rating": 2.0,
    "comment": "banalna mechanicznei gra - ciagle do przodu wiece kart wiece jsurowców wiecej wszystkiego\nefekt kuli snieznej jak jeden grac odjedzie nie ma szans go dogonic\nzero strategi rożnych drog do zwycięstwa itp... zagralem raz i niegdy wiecej nie zagram w ta gre",
    "timestamp": 1676156400
  },
  {
    "username": "Bazzisbazz",
    "rating": 2.0,
    "comment": "Mweh, tried on BGA because of the hype, but man I really don't enjoy those new style, MPS, optimisation puzzle euros. I get the appeal, everything is woven smartly into each other, but the gameplay is just plain boring, there is no tension arc, once again the other players might as well not be there. Would always play El Dorado over this, which might thematically be a bit looser, but is actually fun to play.",
    "timestamp": 1653948000
  },
  {
    "username": "lazzaret",
    "rating": 2.0,
    "comment": "Looks great but if you mess up your first round almost impossible to get back to a good position. The pass of your turn is the most awful part of the game. If you finished the first in thr round there is nothing you can do other than wait for the others to finish their round. Disappointed as the game looks good.",
    "timestamp": 1653429600
  },
  {
    "username": "disposable.superhero",
    "rating": 2.0,
    "comment": "Initial 2 plays were positive (one play my game, one play on Jordon’s)\n\nSold because I just didn’t enjoy it.",
    "timestamp": 1652306400
  },
  {
    "username": "floatingnose",
    "rating": 2.0,
    "comment": "Tried to love it but can't. I hate the mix of mechanics and especially the limited deck building market and advancement track.",
    "timestamp": 1643756400
  },
  {
    "username": "Krnngg",
    "rating": 3.0,
    "comment": "efficiency puzzle. i tried so hard to like this game. i bought sleeves organizers all expansions before even start the game. thats how much i was hyped. after single good play, i didnt liked it, i push my self to play 10-15 more games i wanted to believe im missing something... no this game is not my cup of tea.\n\nif you like low to no interaction games this can be your cup of tea, if you like high interaction games, just forget this game and save your time.",
    "timestamp": 1755208800
  },
  {
    "username": "Valcurdra",
    "rating": 3.0,
    "comment": "I finally found something worse than a boring, dry, soulless euro and that is the above masquerading as an innovative thematic experience.\n\nClassic CGE production, top notch art and components and theme comes through, base game is ridiculously dry and boring, the expansion characters add a little flavour and at least make the game playable, but regardless an underwhelming experience.\n\nI cannot believe Endless Winter lost the battle of the 3 Deck Building/WP placement games to this and Dune Imperium, Endless Winter shits on this game.\n\nArnak is all flash no substance, you initially think there is a lot to explore, racing deck building, WP, but its all utterly boring. After round 1 and a bit of exploring, you have the most open WP game of all time, 0 tension. You then have a deck builder where your deck barely cycles, buying cards after round 3 will likely result in them never being seen again. Plus you have all the downsides of Deck building as well. All the luck of a card market and luck of the draw, you might draw your stronger cards 2 times only or 4 depending on pure luck, terrible.\n\nThe temple track, is simply awful, it's basically just a boring resource conversion race, I also really didn't like that is 100% the focus of the game, you must move up to the top to have any chance of scoring a winning score and you are heavily incentivised to do this ASAP, nothing else you do really matters as much. You also score a significant amount, 30-50%, of your score just resource dumping at the end of the game and it's extremely anticlimactic.\n\nSetup and breakdown are rough in this game, putting it on BGA masks this and a lot of high ratings will be based on this. Setup is a billion little tokens to distribute breakdown is classic deck building resorting annoyance. Absolutely tiresome.\n\nI had an interesting arc with this game, I initially rated it a 9, thinking all the elements would get more interesting as I played more, But in fact the opposite is true, with each play my rating went down. I would play this again if you twisted my arm, but only with the expansion and I would be pretty bored.",
    "timestamp": 1754172000
  },
  {
    "username": "makermonty",
    "rating": 3.0,
    "comment": "The production quality is great. I love the art on the cards and the different resource tokens. And that is about it.\nLost Ruins of Arnak promised to be a deck builder and a worker placement game and it doesn't really do either well.\nThe worker placement aspect is not really given importance as most of the time you are just trying to get specific resources to buy cards and race up the research track instead of placing workers to explore. And the deck building aspect is hardly deck building. It is like you are building a slightly better hand for a future round where you get to use the cards you bought maybe once or twice more.\nThis game was a massive disappointment. I know that many of these issues have been addressed with the leaders expansion but as far as the base game goes I am not sure why it gets so much praise. It is a bland resource conversion game that doesn't do a good job at implementing either of its two main mechanics.",
    "timestamp": 1750802400
  },
  {
    "username": "Zapata",
    "rating": 3.0,
    "comment": "The only thing I remember about this game is that I found it slow and boring. But it's just my taste...",
    "timestamp": 1747260000
  },
  {
    "username": "Blix",
    "rating": 3.0,
    "comment": "Mechanically clean but emotionally flat. Every game feels like a calm puzzle, not a desperate adventure. The theme is pasted on – Arnak’s exploration and discovery feel mechanical—you “discover” tiles by flipping random rewards. This game is a point salad machine dressed in jungle gear. You optimize sequences—not survive real pressure.No real tension or danger. No emergent narrative. Arnak is the same arc every time: build your engine, climb the track, score points. Low player interaction. Arnak is multiplayer solitaire with tiny bits of passive blocking.",
    "timestamp": 1745704800
  },
  {
    "username": "purplecow55",
    "rating": 3.0,
    "comment": "A light hybrid mashup of deck building and worker placement where players are trying to score the most points. On their turn players take turns until all players pass. After 5 rounds, the game ends. Actions available are playing a card, moving up the tech track, placing a worker, among other free actions. Major paths/loops here are moving up the tech track and/or exploring the middle of the board to expand worker placement spots in the game.",
    "timestamp": 1741906800
  },
  {
    "username": "BoardGamingCouple",
    "rating": 3.0,
    "comment": "3/5\n\nThis was okay, but nothing crazy awesome. There are several different paths to take which is nice, but there are also several fiddly components to setup.",
    "timestamp": 1735254000
  },
  {
    "username": "junglebutterfly4",
    "rating": 3.0,
    "comment": "Unpopular opinion: Couldn't stand this game...",
    "timestamp": 1732662000
  },
  {
    "username": "quietcorn",
    "rating": 3.0,
    "comment": "Tracks and minor deckbuilding. This game is mechanically similar to Alma Mater, but with more unpleasant surprises. It's tough work going up the track to get to the end where the major VP is, but it's not very satisfying when you do manage to accomplish your goals. Similarly, needing specific movement cards/tokens to get to the various action points is a neat idea, but it's more tiresome than fun in practice.",
    "timestamp": 1731020400
  },
  {
    "username": "Zaungast",
    "rating": 3.0,
    "comment": "Silly resource conversion with monster tiles reminding me of beer mats.",
    "timestamp": 1729029600
  },
  {
    "username": "kilianbognar",
    "rating": 3.0,
    "comment": "You are doing a fair amount of euro-y things in this game but it is just really really random. The components are really nice though, so I wish there was a game I enjoy underneath.",
    "timestamp": 1727733600
  },
  {
    "username": "dukane",
    "rating": 3.0,
    "comment": "Neither the individual mechanisms are interesting, nor are their sum. A long, tedious, and repetitive game that gets worse as you go with AP and Min-maxing prone players.",
    "timestamp": 1724796000
  },
  {
    "username": "Adam Parker",
    "rating": 3.0,
    "comment": "Today, as I was about to set up Arnak for game 8 solo, I took a close look at its empty board and finally realised there is no thematic game here—just a set of procedures that score points over a pretty vista.",
    "timestamp": 1721167200
  },
  {
    "username": "gengar1205",
    "rating": 3.0,
    "comment": "too much things going on",
    "timestamp": 1715896800
  },
  {
    "username": "rcog",
    "rating": 3.0,
    "comment": "Resource conversion euro, except the resource conversion is driven more by tactical reaction to ongoing chaos than actual strategy. Meh.",
    "timestamp": 1715637600
  },
  {
    "username": "theatog",
    "rating": 3.0,
    "comment": "Imo, the game designed is stale and uninspired. It pretends to be a deck building game but you barely cycle through your deck twice. Its worker placement portion is as basic as it gets, following the same path beatened to death. Some options are mere illusions or choice or straight up distraction. Linear game play.",
    "timestamp": 1714773600
  },
  {
    "username": "Auntnan",
    "rating": 3.0,
    "comment": "We played it once months ago and it was hard to get thru. Finally decided to give it another go and quit after round 2. There was too much going on for us and we kept having to check the rulebook during each turn. We usually love deck building games and concepts like this.",
    "timestamp": 1710630000
  },
  {
    "username": "TumbleSteak",
    "rating": 3.0,
    "comment": "What you do with your deck and assistants is just so boring. Perform resource conversion to climb a track. Snoozefest for my tastes.",
    "timestamp": 1708038000
  },
  {
    "username": "galchri",
    "rating": 4.0,
    "comment": "Low interaction modern Euro.",
    "timestamp": 1762038000
  },
  {
    "username": "GypoNolan",
    "rating": 4.0,
    "comment": "Meh euro conversions game.",
    "timestamp": 1759528800
  },
  {
    "username": "joanmoreno",
    "rating": 4.0,
    "comment": "Iba sin demasiadas expectativas y aún así me ha decepcionado. Tiene demasiados detalles que no me convencen. El 90% del juego consiste en obtener recursos aquí para obtener o usar recursos allá. El ritmo de la partida es raro, siendo tan pocas rondas las primeras vuelan y las últimas son un festival de AP debido a las opciones que se abren.\n\nEl deckbuilding es muy básico y los efectos de las cartas, losetas y sobretodo los guardianes (pegote total) son muy genéricos y no están especialmente integrados con el tema. El aspecto es una pasada pero el juego me parece bastante flojo.",
    "timestamp": 1759010400
  },
  {
    "username": "familygaming",
    "rating": 4.0,
    "comment": "That’s it?\n\nClank meets Stone Age. Middling resource conversion euro. Having said that, if you like Res Arcana, or Century/Golem series, or other streamlined resource euros, the gorgeous artwork variability through cards could work well for me.\n\nFor me? Too light, too random (rewards), too samey (literally everything in the game is some minor variation of “trade X things for X+1 slightly better things”), boring non-variable research track.",
    "timestamp": 1758405600
  },
  {
    "username": "saoneal",
    "rating": 4.0,
    "comment": "Tightly designed game with an interesting tech tree and little twists on the worker placement board, but it's just not for me. Never feels like my deck/engine is all that much more efficient or powerful at the end than I was when I started, which is what I'm looking for in games like this. Feels a bit like you just can't go wrong no matter what you do - I prefer games where you're free to either completely screw up or make outrageous combos that shoot you ahead. This game's progression is aggressively guide-railed, and I just don't find it exciting.",
    "timestamp": 1757628000
  },
  {
    "username": "pitonowie",
    "rating": 4.0,
    "comment": "Solo, combo, optimalization puzzle game - totaly meh.\nMake something - solo - to get more points, Dull and lack of excitement.\n\nGame as many modern euros, but this time it has paste up adventure theme. I don't believe I had admired games, like that, someday...\n\nDesire to play - null.",
    "timestamp": 1757368800
  },
  {
    "username": "pluviometer",
    "rating": 4.0,
    "comment": "I find it hard to get excited about an Indiana Jones-y exploration theme, and I've never loved having to manage various currency types.",
    "timestamp": 1756936800
  },
  {
    "username": "seb_48784",
    "rating": 4.0,
    "comment": "After 1 game IRL: I’m just not a fan of mechanically and coldly competing to optimize points. I miss something warm-hearted or cheerful in this game. From the start, the theme bothered me. Grave robbers? Come on. From a post-colonialism perspective, no one should honestly still think that’s a good idea.",
    "timestamp": 1754690400
  },
  {
    "username": "tyrroo",
    "rating": 4.0,
    "comment": "Played the expansion version at Rockwood in Fall '24 and it sucks imo, was way too difficult and too many moving parts; not only don't want to buy, but also don't want to play ever again.",
    "timestamp": 1753999200
  },
  {
    "username": "VictorZavala",
    "rating": 4.0,
    "comment": "It's trying to do a lot of things... and does them in a somewhat interesting way, but doesn't excel at anything. But it doesn't scratch any itch.",
    "timestamp": 1752357600
  },
  {
    "username": "SpidermanGeek",
    "rating": 4.0,
    "comment": "Uninspired and dry. After a dozen plays of the base game, it never grew on me. There's nothing ultimately satisfying about any choices made during the game. Feels inconsequential and restrictive. A grind with no payoff.",
    "timestamp": 1751925600
  },
  {
    "username": "Shane_BigBox",
    "rating": 4.0,
    "comment": "3 games and that is it. Cannot see the point of the game, nor the fuss!",
    "timestamp": 1750370400
  },
  {
    "username": "IceBearchen",
    "rating": 4.0,
    "comment": "I tried this game several times solo and I just don't see what others like in the game. It feels so limiting. You try to do as much as possible but the bot and the blocked spaces make it way too difficult to do anything. Not for me.",
    "timestamp": 1749160800
  },
  {
    "username": "secondofthenew",
    "rating": 4.0,
    "comment": "Not a particularly interesting worker placement game, and an even less interesting of a deck builder. But boy can you move up a track!",
    "timestamp": 1748556000
  },
  {
    "username": "MatroidX",
    "rating": 4.0,
    "comment": "Well-designed (I like the auto-adjust of the card market, magnifying glass + notebook also kind of neat), but it's just not appealing to me much after 5 plays.\n\nIt seems to play similarly. I do feel over-constrained (only 2 explorers throughout, few starting resources) and that things end kind of early (in 2p games, half the board is unexplored).\n\nI obviously have more to learn (scored 63 initially, now in high 70s), but just not interested in more plays.",
    "timestamp": 1746914400
  },
  {
    "username": "speter22",
    "rating": 4.0,
    "comment": "So the game is just... whoever goes up the research track the fastest wins? That's certainly what it felt like in my play, which means that it's just an exercise in efficient resource conversion & optimization, and a relatively static and uninteresting one at that. Still has some fun medium-weight euro juice in it though, so it was decent enough, but I don't think it's worth seeking out again. I can see why it was such a hit at first, but I'm confused by its longevity.",
    "timestamp": 1746655200
  },
  {
    "username": "Avid_Equinox",
    "rating": 4.0,
    "comment": "Worker placement/deckbuilder/resource management mashup game\n\n+ Multi use cards add more decisions\n\n- It combines a lot of mechanics, but it doesn't seem to do any of these mechanics particularly well/convincingly compared to standout games of their respective genres (better to just play a REALLY GOOD deckbuilder/worker placement instead of a game that does both to an average standard)\n\n- spreadsheet-like/unexciting gameplay\n- not particularly tense - there is minor blocking but it almost never gets an emotional response when it happens - there's enough going on here that you can recalculate a way around any inconveniences",
    "timestamp": 1744927200
  },
  {
    "username": "Scaaat",
    "rating": 4.0,
    "comment": "First game I learned, second game I enjoyed, third game I was bored, it won't go beyond that. This game having such a high rating is mind boggling to me.\n\nFun theme though",
    "timestamp": 1744322400
  },
  {
    "username": "darquil",
    "rating": 5.0,
    "comment": "Components: Great art. The resource tokens are fantastic.\n\nExperience: I think perhaps I just don't like games with lots of different types of resources. This felt like pushing resources around for two hours; converting A to B so I could get C. Unfortunately that got in the way of the theme; I didn't feel like I was exploring or adventuring. Each turn has a lot of actions I could take, and it was interesting to try to choose the best action, but it wasn't particularly fun.\n\nLast Played: 2025-09-19\nPlays (1):\n4 players: 1",
    "timestamp": 1758319200
  },
  {
    "username": "Griffted",
    "rating": 5.0,
    "comment": "No sharp edges, no grit - hard to distinguish from any other euro released 2020 and after, makes me long for Caylus.",
    "timestamp": 1757628000
  },
  {
    "username": "Drrabbits",
    "rating": 5.0,
    "comment": "Meh. The deckbuilding isn't very satifying, the worker placement is restrictive and the theme is wafer thin. much rather play dune or endless winter.",
    "timestamp": 1756850400
  },
  {
    "username": "TheGoddamnDuke",
    "rating": 5.0,
    "comment": "Mediocre game, the mixing of mechanics is not a good thing. Get this game out of my face.",
    "timestamp": 1756764000
  },
  {
    "username": "JY_Liu",
    "rating": 5.0,
    "comment": "Not as good as my expectations. It’s looks like an adventure game, but actually it is a resource exchanging game. When you defeat a monster, you pay so much to win 5 points, but it is more valuable to research, which is “buying points”. The most attractive method is not lead you to win.",
    "timestamp": 1755727200
  },
  {
    "username": "pralat",
    "rating": 5.0,
    "comment": "Over-engineered deck-building point salad. Quite pretty though.",
    "timestamp": 1755381600
  },
  {
    "username": "Knothyelf",
    "rating": 5.0,
    "comment": "too much work.\nthe art sets great expectations for adventure,\nbut the game feels more like a slog, tbh",
    "timestamp": 1754604000
  },
  {
    "username": "IsolatedPawn",
    "rating": 5.0,
    "comment": "Heavy on resource conversion, and specifically ordering those conversions properly, which just isn't an interesting puzzle to me. I don't really understand what it offers, gameplay wise, to be so popular in such a populated genre.",
    "timestamp": 1753999200
  },
  {
    "username": "Yshaaa",
    "rating": 5.0,
    "comment": "Lost Ruins of Arnak is an easy game to learn, and the playtime is relatively short for a game that mixes deck-building and worker placement so well.\n\nHowever, after a few plays, the game starts to feel a bit repetitive. The paths to victory can begin to feel similar, and the replayability doesn’t hold up as much as I’d hoped.\n\nAs someone who enjoys heavier, more strategic games: 5.5/10",
    "timestamp": 1751925600
  },
  {
    "username": "NVRAM",
    "rating": 5.0,
    "comment": "TL;DR: It's not a bad game, but it seems over-hyped for what is an uninspired race track with a mess of different mechanisms.\n\nI've played both IRL (with the long setup) and online, though I've never played solo or at 2P.\n\nWinning requires racing up the \"research\" track, either first or at least the farthest. It feels like a plodding swap of resources for VP (and other stuff), with a math problem trying to maximize the payback.\n\nThe dig site (worker placement) portion is kind of interesting, although the risk/payback can be pretty random. Deck building portion is also not too bad, but since the focus is on the \"race\" the cards are often mostly useful for resources.",
    "timestamp": 1750024800
  },
  {
    "username": "Trigonomical",
    "rating": 5.0,
    "comment": "It was a bit of a basic game. Played twice and never felt the need to return as it felt like everything to be learned was accomplished. A shallow experience. Honestly, I don't get the hype at all.",
    "timestamp": 1747692000
  },
  {
    "username": "UnluckyMaki",
    "rating": 5.0,
    "comment": "IRL + TTS",
    "timestamp": 1745186400
  },
  {
    "username": "darkfinale",
    "rating": 5.0,
    "comment": "end-November '23 Top 60 Games [#35/60]\n\nExciting to begin with. However with time passing the excitement of deck building runs low. The setup is also tedious. Better played on BGA. Not as interested in this theme. Might get too random and card dependent after a while.",
    "timestamp": 1744495200
  },
  {
    "username": "N219",
    "rating": 5.0,
    "comment": "From Half Price Books for 40$. Played a single game, there are too many tokens, setup and cleanup took a while. Sold through BGG",
    "timestamp": 1743631200
  },
  {
    "username": "FuttererJ",
    "rating": 5.0,
    "comment": "Game is okay but is CLEARLY overrated.\n\nTheme is just artwork (painted on theme)!",
    "timestamp": 1743544800
  },
  {
    "username": "Beastly_Venturer",
    "rating": 5.0,
    "comment": "This one seems too mashed together. I mean it is fine but definitely not worth the praise it has been garnering. Feels like each core mechanism (tech/temple track, deckbuilding and worker placement) is half baked.",
    "timestamp": 1740783600
  },
  {
    "username": "RedHotBandit",
    "rating": 5.0,
    "comment": "It’s ok once you get the hang of all the nuances, but it’s a chore by the end. Like Everdell, you spend a good portion of your time keeping track of all the interrelations between your cards, locations and loot types, so it only gets worse the more stuff you have. I counted about 25 types of spendable items or loot types to juggle, and some of them have nuances that are not so obvious. The last round is an exercise in patience while each player takes turns to maximize their advancement in the research track portion of the game. The game itself is quite simple. The only thing adding difficulty is the amount spendable items. In the end, it’s another algorithm game where the theme is completely detached from the mechanics, but the archeology theme is nice.",
    "timestamp": 1739660400
  },
  {
    "username": "Geekishgamer",
    "rating": 5.0,
    "comment": "This one was a bit of a miss for me. There just didn't seem to be allot of variation to the game. It felt the same every time we played. We gave it 4 playthroughs, and I ended up getting rid of it. It looks cool, but the gameplay just wasn't there for me.",
    "timestamp": 1739487600
  },
  {
    "username": "Pura_Vida",
    "rating": 5.0,
    "comment": "Arnak is not so much of a deck builder or worker placement game as it is a huge exchange office in the jungle. Easy gameplay, nice balance but a bit disappointing on strategic options. Solo is fine and without any overhead. Sold it because it doesn't get played any longer.",
    "timestamp": 1739487600
  },
  {
    "username": "Third_Era",
    "rating": 5.0,
    "comment": "",
    "timestamp": 1738710000
  },
  {
    "username": "sambalamaento",
    "rating": 5.0,
    "comment": "overrated\nA resource conversion game with a large luck element\nI am not satisfied with the size of the board and the quality of the components.",
    "timestamp": 1737846000
  },
  {
    "username": "buzzlife",
    "rating": 5.0,
    "comment": "I really don't get the love for this game. I played it on BGA, and maybe I just didn't understand what I was doing, but I didn't really enjoy the play at all.",
    "timestamp": 1737241200
  },
  {
    "username": "jdvanwijk",
    "rating": 5.0,
    "comment": "Fun for the 45 minutes or so. After that it drags quite a bit. Tries a lot of different things, doesn't do anything particularly well.",
    "timestamp": 1737154800
  },
  {
    "username": "Oppo28",
    "rating": 5.4,
    "comment": "(++) Excellent art and setting\n(+) Plays very quickly -- ~35-45 min or so for a 2p game\n(+) Lot of different things you can do\n(+) Snappy turns\n(+) Just fun to play\n\n(=) Kind of a kitchen sink/mashup euro design. That may work for you or not\n(=) Often feels like it ends too early- which is typically a better problem than the opposite so flagging as neutral\n\n(--) Setup and teardown are WAY too long for a game this brief. 15-20 min total setup and teardown for a 35-45 min 2p game is a bad ratio. For comparison, it probably takes me about as long to set this up as it does something like Terra Mystica (at least ballpark)\n(-) Nothing inherently compelling or unique. The system sort of works but other games do everything here better. Nothing really 'magical' about it\n(-) Never feel like you can really get off the ground with any kind engine. Not enough time for true deck building, you only get 10 total worker placements in the whole game, etc.\n\nThis game has a fantastic presence and some smooth gameplay; if I were a developer for it I would find a way to axe at least half of the largely-ancillary components to allow for a much better ratio of setup/cleanup to play time. That would be more appropriate for a game of this weight. For example, would you really lose that much strategic depth by removing the top-of-research-track extra research tiles? Perhaps, I don't know, but I don't think you can make the same 'necessary' argument for every single semi-ancillary mechanic or component in the game. So *something* should have been peeled back given the weight of the game.\n\nOverall, I think its a fairly well-crafted game that will have broad appeal-- I certainly enjoy playing it at least and I think many/most others will too. But it doesn't bring anything new and ultimately won't stay in my collection forever.",
    "timestamp": 1736031600
  },
  {
    "username": "uncle_trogman",
    "rating": 5.0,
    "comment": "No doubt great production and well designed game. But it didn't feel exciting for me. Maybe I wasn't a patient person that could stand a long setup. I am not a fan of Dune Imperium either, but at least that game is easy to setup and play.",
    "timestamp": 1736031600
  },
  {
    "username": "SolemnVeil",
    "rating": 5.0,
    "comment": "The more I have played it the less I like it, a mess of mechanics without any individual depth. To little to do in the beginning and ends as soon as it's getting started. Mostly feels decided by your luck with cards and guardians in the first turn and the rest of the game is simply going through the motion converting things into points for your victory or loss. The advanced research track is slightly better but still gets old fast. At least it's nicely produced with nice art and theme.",
    "timestamp": 1735426800
  },
  {
    "username": "ubRtstcl",
    "rating": 5.0,
    "comment": "Beautiful artwork and great theme. An okay resource-churning puzzle, but most aspects of the game feel like filler, especially with all the interspersed randomness.",
    "timestamp": 1735254000
  },
  {
    "username": "eurofun",
    "rating": 5.0,
    "comment": "You don’t get to use the cards that you acquire very much which limits engine building. This pushes the game into the same play too much (research track mostly).\nThe Professor character pushes you to get artifact cards, but you only see them one time or none. This sucks.",
    "timestamp": 1735254000
  },
  {
    "username": "tectactoe",
    "rating": 5.0,
    "comment": "+Base Game [5.0] Combines little bits of worker placement, deck building, resource conversion, and track advancement in a way that I've found to be more satisfying and enjoyably puzzling than any other (similar-ish) euro game in recent memory. People who complain about the thinness of the deck building are sort of missing the point - it's \\supposed\\ to be lean and somewhat limited, and as the game progresses and the cards become devalued, the artifacts become more important and plentiful. Some might find the randomness of the exploration tiles and guardians to be a bugaboo as well (and generally I might, too), but therein lies some of the risk/reward management the player must do.\n\n+Lost Ruins of Arnak: Expedition Leaders [4.0] Adds an element of asymmetry to a game that previously had none. Had fun exploring some of these new leader abilities, but cannot comment on how balanced they may or may not be, as that would require many more plays than I'm willing to put in. Not because I think the expansion is bad - it's certainly not - but because it doesn't explicitly improve upon any of the base game's deficits (of which there are not many, to be sure).",
    "timestamp": 1734217200
  },
  {
    "username": "Mitty9",
    "rating": 5.0,
    "comment": "I know I am in the minority here but I really did not find this game to be that fun. It has a lot of different mechanics however I found that all of the really interesting things were not the focus of the game. It is essentially a research track and everything else is just a means to that end.",
    "timestamp": 1734217200
  },
  {
    "username": "tolhs",
    "rating": 5.2,
    "comment": "2024:+1",
    "timestamp": 1733958000
  },
  {
    "username": "Desigual",
    "rating": 5.0,
    "comment": "My review is based on the core game along with the expansion.",
    "timestamp": 1732575600
  },
  {
    "username": "timori",
    "rating": 5.0,
    "comment": "BGA. Tight resource conversion game that combines worker placement and deckbuilding. It's two mechanics I love in a brain crunchy game that ultimately plays a bit too solitaire for my taste. For a little more effort, there's some more interactive games out there that suits my tastes better. I think the deck building aspect also makes the game a bit too tactical, (i.e. random in the worst case scenario) which sours the mood considering the amount of planning required in the game. The scores can be so tight together that it's also hard to tell how well you really did against your opponent, or dissect afterwards where your mistakes may have been, or if it was just luck.\n\nIt's a fantastic game, just not for me. Might play again when I feel like it.",
    "timestamp": 1731452400
  },
  {
    "username": "gabdewulf",
    "rating": 5.0,
    "comment": "Worker placement game with a weak engine",
    "timestamp": 1729375200
  },
  {
    "username": "LincolnjCrockett",
    "rating": 5.0,
    "comment": "Didn't find this one particularly compelling, there was too much going on and the scoring didn't feel intuitively connected to the things I wanted to accomplish in the game. The deckbuilding also felt a little sluggish to me.",
    "timestamp": 1726610400
  },
  {
    "username": "m4p3t",
    "rating": 5.0,
    "comment": "BGA; repetitive strategy, weak theme-mechanics connection",
    "timestamp": 1725660000
  },
  {
    "username": "Verling86",
    "rating": 6.0,
    "comment": "Played Only.",
    "timestamp": 1762124400
  },
  {
    "username": "elggun",
    "rating": 6.0,
    "comment": "It's definitely one of the games.",
    "timestamp": 1761778800
  },
  {
    "username": "tokkinho",
    "rating": 6.0,
    "comment": "combination of worker placement, deck building, resource management/conversion and tech tree (of sorts). getting the combination of the different mechanics and actions right seems key. while the mechanics work well together and game flow is good, some actions/mechanics seem dominant (i am looking at you, research track), while others feel under-developed. especially deckbuilding is too dependent on luck and provides too little options for strategic planning. yet, a game that is quite forgiving and very accessible for new players.",
    "timestamp": 1761692400
  },
  {
    "username": "Jorerbor",
    "rating": 6.0,
    "comment": "Not all that enticing. It functions well and the monsters are exciting, but the decisions, strategy, and theme don't have much synergy",
    "timestamp": 1761084000
  },
  {
    "username": "DevOpsProDude",
    "rating": 6.0,
    "comment": "63x88 - 165\n64x89 - 110\n80x120 - 42\n115x160 - 4\n\nPlayed on board game night and BGA.",
    "timestamp": 1760047200
  },
  {
    "username": "BarFightBill",
    "rating": 6.0,
    "comment": "Best: 2-3\nOwner: Adam A",
    "timestamp": 1759874400
  },
  {
    "username": "worador",
    "rating": 6.0,
    "comment": "only for people that like to turn things into things to get things without much player interaction. science track seemed overpowered.",
    "timestamp": 1759615200
  },
  {
    "username": "ofcbrooks",
    "rating": 6.0,
    "comment": "",
    "timestamp": 1759269600
  },
  {
    "username": "Kwaszanka",
    "rating": 6.0,
    "comment": "148 zł\nGandalf 03/23",
    "timestamp": 1758837600
  },
  {
    "username": "Mersion",
    "rating": 6.0,
    "comment": "Best Player Count: 3",
    "timestamp": 1758751200
  },
  {
    "username": "enavico",
    "rating": 6.0,
    "comment": "+ Nice integration of worker placement and deck-building\n+ Scales well, has a good solo mode\n+ Top notch components\n+ The randomized setup, the double faced board, the cards decks and the assistants give the game a lot of variability\n\n- The guardians are annoyingly random\n- The fear cards are not a real threat for your deck\n- Too short to let the deck building element shine... unsatisfying on this side\n- Too light to be a great mid-weight game, a little too heavy to be an entry level",
    "timestamp": 1758492000
  },
  {
    "username": "arildoaim",
    "rating": 6.0,
    "comment": "Great production value dripping with theme. Superb variability with expansion. Game feels very euro-y though. Would happily try again, but never suggest. Vindication did more for me as a high-variability-and-theme worker placement.",
    "timestamp": 1758405600
  },
  {
    "username": "Illotus",
    "rating": 6.0,
    "comment": "I've played this bit in Yucata and BGA mostly. This is pretty nice mediumish game, no great passion either way. Would be nice if there are some expansions that maybe add something, but I doubt I'm getting this for my collection.",
    "timestamp": 1758232800
  },
  {
    "username": "Beefy79",
    "rating": 6.0,
    "comment": "Played Mike's Copy",
    "timestamp": 1758146400
  },
  {
    "username": "PiecesOfToast",
    "rating": 5.5,
    "comment": "Hot take: A little overrated since its the \"tries to do all, but succeeds at none\" type game. However, if you like the idea of combining Deck Building, Worker Placement, and Opponent Racing, then you will like this game",
    "timestamp": 1758146400
  },
  {
    "username": "bigbenmeaige",
    "rating": 6.0,
    "comment": "The game was fun, not so complex once you get started, but there is a lot to explain to new players, and I am not sure the juice was worth the squeeze. I would definitely play more, but wouldn't want to have to teach this to new players. It leads to a lot of analysis paralysis which can make it unfun to sit through. Also, there is a huge disadvantage depending on where your start. It would be great if taking the starting player was an option.",
    "timestamp": 1757455200
  },
  {
    "username": "dreamer1789",
    "rating": 6.0,
    "comment": "Was very excited to play this one. Theme is neat, it looks fantastic on the table. The whole battling the guardians idea was cool (though I'm not a dungeon crawler person).\nBUT in the end (talking about the base game here), it felt very: 'I'll collect item A, exchange it for items B and/or C', rinse and repeat. Came away from couple of games with the overwhelming feeling of 'meh'.",
    "timestamp": 1756072800
  },
  {
    "username": "DoctorPhil",
    "rating": 6.4,
    "comment": "Criteria (out of 5)\nRules complexity 4\nPlaytime/complexity ratio 3\nStrategic avenues 3\nMechanism strength 4\nThematic integration 2\nVariability 4\nReplayability 3\nFun factor 3\nSolo mode\nPlayer interaction 3\nElement of mastery 3\n\nOverall 6.4 out of 10",
    "timestamp": 1756072800
  },
  {
    "username": "doctoryes0",
    "rating": 6.0,
    "comment": "I love the theme and art so much I was thinking about buying a physical copy. Playing on BGA I couldn't get close to a win so I checked some strategy threads.\n\nUnfortunately it seems you can't ignore the least interesting part of the game, the research track. In fact, if you aren't fighting to be first one up and getting the bonuses, you can't win.\n\nUltimately that track is just a different way of visualizing one of my least favorite board game mechanisms: the public contract set collection race.\n\nThe best part of the game for me is exploring and flipping guardians, but according to top players you should avoid that until t3 or so.\n\nDeck thinning and grooming is also comparatively unimportant.\n\nNot saying it's a bad game, just that I can't play it the way I want to and not get wrecked.",
    "timestamp": 1754690400
  },
  {
    "username": "SynapticAcid",
    "rating": 6.0,
    "comment": "Received from 2021 Secret Santa",
    "timestamp": 1754344800
  },
  {
    "username": "Antch007",
    "rating": 6.0,
    "comment": "Something like Dune imperium for dummies.\nBarely any tension or influence from what the other players do, solitaire",
    "timestamp": 1754258400
  },
  {
    "username": "Jutsus",
    "rating": 6.0,
    "comment": "Played once, if I am in the mood for playing an easy game with the family, this is a good choice.\nQuite simple game.",
    "timestamp": 1754085600
  },
  {
    "username": "TharsisRoverPets",
    "rating": 6.0,
    "comment": "It gets a bit too messy for my tastes.",
    "timestamp": 1753480800
  },
  {
    "username": "LionPacifique",
    "rating": 6.0,
    "comment": "After a bunch of players of Arnak, my conclusion is that it's a good, but not great, game. I honestly don't understand the hype. The deckbuilding is... fine. Not bad, but hardly exciting. The worker placement is... far less interesting than an abundance of well-known worker placement games. There is the art, I suppose, which is lovely, as is the presentation overall.\n\nI've seen people arguing about the cruciality of proceeding up the research track for victory. Frankly, who cares? The problem is not the balance of this or that strategy, but rather that there just aren't many compelling decisions in the game. Get a card, open up a new space, overcome a monster (by trading in some goods?), move up the research track. It amounts to \"get this, swap it for this better thing, and repeat.\" This kind of engine building and resource conversion can be great (see Furnace, for example), but it seems rather lacklustre here.\n\nTo be fair, the game is optimised well, with each player turn building slightly on the last until the last round sees players capitalising on the engines they've built up to that point. This is perhaps the appeal of Arnak to so many gamers.\n\nAlso, I haven't played the expansion, so maybe that would add something. But I can't see myself wanting to put in more plays. If somebody wanted to play Arnak, I'd happily oblige, but I won't be suggesting it.\n\nArnak and Dune: Imperium have been constantly compared to one another. For me, Dune: Imperium — a tense race replete with fierce player interaction — wins hands down.",
    "timestamp": 1753221600
  },
  {
    "username": "Mark_of_Heresy",
    "rating": 6.0,
    "comment": "I like the theme and the artwork but the game play didn't meet the expectations",
    "timestamp": 1753135200
  },
  {
    "username": "Harveymcglenn",
    "rating": 5.5,
    "comment": "Easy to play point salad game. Probably good to bring out for causal players",
    "timestamp": 1753048800
  },
  {
    "username": "kivi2004",
    "rating": 6.0,
    "comment": "All cards Sleeved",
    "timestamp": 1752962400
  },
  {
    "username": "astroglide",
    "rating": 6.0,
    "comment": "Hard to assess the various paths after a single 2P play. I thought it played well at that count, and I think the design is nearly guaranteed to leave players feeling like they could have done more — not a bad thing in my book. I'd play again.",
    "timestamp": 1752530400
  },
  {
    "username": "tobytoast",
    "rating": 6.0,
    "comment": "Felt a bit like fast food for me ... great elements, but no real flavour.",
    "timestamp": 1752444000
  },
  {
    "username": "TheSlov",
    "rating": 6.0,
    "comment": "My review is more from jumping in the deep end and figuring it out.\nI dislike that the cards you buy are more for next round, unless some spots with random draw effects pop up (research/tiles/random idols). The resources are tight, and costs for things are varied and usually require 2-3/4 resources, this is another case for me where you need to do a bit of everything vs 2-3 things well that work together and synergize. Probably makes for a better balanced game, but I prefer everything to be \"broken\" that way the illusion is that it feels balanced as all actions/decisions seem like good options. Hope that makes sense?\nDisliked the symbology, wasn't super intuitive, even our other teacher asked 3-4 times about the \"play another card\" symbol.\nI know there are lots of different characters but they dont change much, some of the characters just seem to give you an avenue to get bonus resources rather than really changing the base game in some manner, or tweaking a core mechanic or giving you some alternative goal or scoring method. It really felt like they were reinventing the wheel rather than focusing on say originality. Compared to Scythe where all factions seem super unique and have their own identity, the differences where sort of...uninteresting. i guess my issue is that say my Journalist vs Dan's Eagle-Trainer did similar things, he had to build his \"eagle meter\" and then use it to get resource X. My journalist collected a unique newspaper resource that one else could get that I could use to also get resource X. They both have the same end result but different paths.\nThe constant resource conversion/gathering and paying for things that give other resources (either research track/new locations/fighting Guardians/etc) just eventually led me to apathy, it's like one of those complicated manual marble machines where a marble rolls and it goes down a track and knocks over stuff that leads to another marble to roll into a container that is lowered on a balloon that deflates and pushes over something that makes something else happen (know what I mean?). I guess that's interesting combos, but I didn't find it ultimately appealing or interesting.\nI can see it appealing to those who want a euro with mixed mechanisms that don't really jive well together. It's not really a deckbuilder, it's not entirely a work placement, it's for sure a resource management and sort of research track game.\n\nTo quote one of the best reviews of this game, \"Who won? Who lost? Who cares, I was lost in the Ruins of Arnak\".",
    "timestamp": 1752184800
  },
  {
    "username": "Desiderata",
    "rating": 5.5,
    "comment": "My first few plays were fun, but I am kind of done with it, I think. The technology path is just too critical, and defines the winner too much. It's an okay game, but another one that has very little player interaction, and it's all about who can get their engine maximized and most optimal. And this kind of low player interaction puzzle doesn't interest me. Collect resources, figure out the best path to upgrade those resources by combining some worker placement (2 workers only) with some deckbuilding, and then converting those resources to vp in the form of pushing your two markers up a track, earning you more resources along the way and rewarding the first player to reach those spaces. The end game drags as players over analyze in order to best utilize their precious resources to eek out the most vp.",
    "timestamp": 1751839200
  },
  {
    "username": "franagor80",
    "rating": 6.0,
    "comment": "De grosse tuiles et un graphisme qui ne m’ont pas beaucoup séduit\nsouvent l’impression de ne pas avoir le choix et de faire la seule action possible",
    "timestamp": 1751752800
  },
  {
    "username": "limplict",
    "rating": 6.0,
    "comment": "Quite an average deck-building Euro that pulls through with its art I suspect.",
    "timestamp": 1751580000
  },
  {
    "username": "Metteintopf mit Feta",
    "rating": 6.0,
    "comment": "Really nice theme and feel, but these monstrous combo-turns and resource exchanges make it impossible to think through a turn before you resolve it, causing very deep analysis paralysis.",
    "timestamp": 1751407200
  },
  {
    "username": "Danielka7",
    "rating": 6.0,
    "comment": "Fine gameplay, amazing artwork.\nWorker placement is tad random with discovering random sites and revealing random guardians. Enjoyable deckbuilding with small deck where you can easily draw and use all your cards. I would maybe appreciate bigger card market to have more to choose from. Heart of the game is a resource management which is not my favourite mechanism, but it is OK.\nExpansions add asymmetrical leaders which don't change the game itself but increase the variability a lot.",
    "timestamp": 1750802400
  },
  {
    "username": "Kreha6",
    "rating": 6.0,
    "comment": "Used to be an 8 but the fact that first round is basically always the same started bothering us. We could use maybe 2 rounds more to this",
    "timestamp": 1750716000
  },
  {
    "username": "CarsonChandler",
    "rating": 7.0,
    "comment": "I enjoy this on BGA, but I'm not convinced it would be fun enough in person to overcome the complexity and AP barriers for my game group.",
    "timestamp": 1762652760
  },
  {
    "username": "piko80",
    "rating": 7.0,
    "comment": "Good game! Minus points for level of randomness and very messy instructions.",
    "timestamp": 1762470000
  },
  {
    "username": "FrancoisX",
    "rating": 7.0,
    "comment": "Not so keen on it personally. The game always ends just as your engine gets going and I am not a big fan of that concept. Nice realisation though and very tight design but ultimately a bit boring.",
    "timestamp": 1762470000
  },
  {
    "username": "Stavros79",
    "rating": 6.5,
    "comment": "Beautiful, table presence. Decent theme if it wasn't let down by the underwhelming mechanical track climbing. Resource exchanging for resourcing exchanging sake. It's ok and would play somebody else's copy.",
    "timestamp": 1762297200
  },
  {
    "username": "deepskyblue",
    "rating": 7.0,
    "comment": "Mish-mash of deckbuilding, worker placement, and track movement. Good optimization puzzle, but not great on theme or player interaction.",
    "timestamp": 1762038000
  },
  {
    "username": "TheBiggestBoss4",
    "rating": 7.0,
    "comment": "I think base game is just okay. The exploration and deckbuilding is fun, but the temples are really boring and they do a lot of points, so a big part being the most boring one makes it drop a ton for me.\nI was also missing better interaction between players.\nI'll try it with expansions, but I don't see why this is top 30.",
    "timestamp": 1762038000
  },
  {
    "username": "Gippydwndrsqrl",
    "rating": 7.0,
    "comment": "I like it. It’s an interesting puzzle and my non gaming friend seemed to enjoy it.",
    "timestamp": 1762038000
  },
  {
    "username": "drewgang",
    "rating": 7.0,
    "comment": "KFD’s game",
    "timestamp": 1761951600
  },
  {
    "username": "Final_Meeple",
    "rating": 7.0,
    "comment": "Top 50 Games of 2021 - #21\nTop 50 Games of 2022 - #32\nTop 50 Games of 2023 - #44\n\n(Top 50 Games of 2024 - #92)",
    "timestamp": 1761865200
  },
  {
    "username": "matdav",
    "rating": 7.0,
    "comment": "Expedition Leaders\nMissing Expedition\nBig Box & Twisted Paths",
    "timestamp": 1761606000
  },
  {
    "username": "julia_gulia",
    "rating": 7.0,
    "comment": "Mild trade interest",
    "timestamp": 1761606000
  },
  {
    "username": "CplTrim",
    "rating": 7.0,
    "comment": "This takes so long to set up, for a relatively short game! I haven't found the core of its appeal yet, but I like the principle of wrapping up goods conversion in a swashbuckling theme.",
    "timestamp": 1761606000
  },
  {
    "username": "Valkyre",
    "rating": 7.0,
    "comment": "Preproduction copy",
    "timestamp": 1761606000
  },
  {
    "username": "BrutusA",
    "rating": 7.0,
    "comment": "Aesthetic: 2\nMechanism: 1\nInvolvement/length/fluid: 2\nReplayability: 2\nOther: 0",
    "timestamp": 1761519600
  },
  {
    "username": "Elwenion",
    "rating": 7.0,
    "comment": "@Budapest",
    "timestamp": 1761343200
  },
  {
    "username": "Felwin",
    "rating": 7.0,
    "comment": "LANG -- 2:30 Stunden -- Komplexität 3+\nOkay @ 2-4 -- Good @ 2-4 -- Best @ 2-3\nLetztes Spiel 03/2025",
    "timestamp": 1761084000
  },
  {
    "username": "Username2024",
    "rating": 7.0,
    "comment": "The theme is nice, the components are cool and all in all it's a good worker placement game.\nBut I don't like the mechanic where one player pass and then has to wait for the rest to pass in order to do new things.\nAnd I wouldn't play this with more than 3 players, too much time between turns",
    "timestamp": 1761084000
  },
  {
    "username": "Manzarak",
    "rating": 7.0,
    "comment": "AS Insert\nMEEPLESTICKERS",
    "timestamp": 1760997600
  },
  {
    "username": "AlexPotc",
    "rating": 8.0,
    "comment": "*CAJA(INSERTO + DISEÑO)= 10\n*INSTRUCCIONES (EXPLICACIÓN + MANUAL)= 8.5\n*CONTENIDO= 10\n*MECÁNICAS (PERSONAS FUNCIONALES Y JUGABILIDAD)=8.25",
    "timestamp": 1762693440
  },
  {
    "username": "Bethobrien",
    "rating": 8.0,
    "comment": "Game category: worker placement\n\nVery good game!",
    "timestamp": 1762639800
  },
  {
    "username": "lady_k",
    "rating": 8.0,
    "comment": "Only played it once at a friend's. It is definitely a bit more involved than most of the games we play. It felt very exhausting afterwards; not sure how replayable it would be if we owned one.",
    "timestamp": 1762612440
  },
  {
    "username": "thelastofme",
    "rating": 7.5,
    "comment": "+ Expedition leaders\n+ The missing expedition\n+ Twisted paths\n+ Adventure chest\n+ Sax and Rat promos",
    "timestamp": 1762470000
  },
  {
    "username": "GusiX",
    "rating": 7.9,
    "comment": "- Base -",
    "timestamp": 1762038000
  },
  {
    "username": "screwy81",
    "rating": 8.0,
    "comment": "Nominee\nGame of the Year 2021",
    "timestamp": 1761951600
  },
  {
    "username": "Kater_Inna",
    "rating": 8.0,
    "comment": "3",
    "timestamp": 1761778800
  },
  {
    "username": "Alien3000",
    "rating": 8.2,
    "comment": "+ Lost Ruins of Arnak: Expedition Leaders (2021)\n\n+ Lost Ruins of Arnak: The Missing Expedition (2023)\n\n+ Lost Ruins of Arnak: Twisted Paths (2025) (Big Box)",
    "timestamp": 1761778800
  },
  {
    "username": "Tbirdmg",
    "rating": 7.5,
    "comment": "Solid worker placement and deck building race game, but loses points for the fact that it's inherently sequential multiplayer solitaire with only the barest of interaction at the WP sites, research track, and card market. You can try to impede and block competitors' progress, but only by risking your own strategy. Good art, good theme, multiple paths to victory, but mostly dependent on ascending the research track...and quickly. . Fast turns. Easily 90 min for 4p.\nThe only innovative feature is the card market's balance between two item categories: simple, smart.",
    "timestamp": 1761692400
  },
  {
    "username": "Lemonstew",
    "rating": 7.5,
    "comment": "긱 웨이트 3점대를 가기 전 반드시 거치게 하는 게임",
    "timestamp": 1761519600
  },
  {
    "username": "rsolmes",
    "rating": 8.0,
    "comment": "Worker placement, action selection, a bit o' deck building, Big rewarding turns. Adventure map is compelling and fun but not all that important for scoring and the research track is less fun but essential for success. So your pushed to do the actions that are less fun in an effort to compete. It's good though and I want to play with expansions. UPDATE: I thought the asymmetry of the leaders was a welcome addition but the research track is still disproportionately valued over the more compelling exploration actions.",
    "timestamp": 1761519600
  },
  {
    "username": "tjbizzle",
    "rating": 8.0,
    "comment": "I traded for this game with one of my friends that didn't want it anymore because I really enjoy this game system. It's the perfect game length and I love the innovative way that it uses deckbuilding. I'd still almost always want to play Dune:Imperium-Uprising instead, but this game is easer to teach, faster and cuter.",
    "timestamp": 1761519600
  },
  {
    "username": "Nilauro",
    "rating": 8.0,
    "comment": "$145 with expedition leaders and the missing expedition, all in the adventure chest,",
    "timestamp": 1761429600
  },
  {
    "username": "Vain_Melody",
    "rating": 8.0,
    "comment": "Excellent depth and doesn’t play too long.",
    "timestamp": 1761343200
  },
  {
    "username": "Drausqo",
    "rating": 7.5,
    "comment": "Game",
    "timestamp": 1761343200
  },
  {
    "username": "grayzilla",
    "rating": 8.0,
    "comment": "Interested in combining this game with another to trade, but overall desire to trade is low.",
    "timestamp": 1761170400
  },
  {
    "username": "PBandJellyfish",
    "rating": 8.0,
    "comment": "@SC",
    "timestamp": 1761170400
  },
  {
    "username": "Dozwa2902",
    "rating": 8.0,
    "comment": "played",
    "timestamp": 1761084000
  },
  {
    "username": "Wyte Cell",
    "rating": 9.0,
    "comment": "Fun w/well-meshed mechanics",
    "timestamp": 1762618200
  },
  {
    "username": "smriera",
    "rating": 8.5,
    "comment": "Juegazo a 2 y 3. Con inserto 3D para sacar y guardar más fácilmente. A ver si este verano le echamos más partidas",
    "timestamp": 1762470000
  },
  {
    "username": "theHoppel",
    "rating": 9.0,
    "comment": "04 -",
    "timestamp": 1762470000
  },
  {
    "username": "ThePatmos",
    "rating": 9.0,
    "comment": "STRATEGY\n1-2-3-4:TRES\nSOLO\n#\nSGOYT'23 n.16 / '24 n.16",
    "timestamp": 1762383600
  },
  {
    "username": "dr.morton",
    "rating": 9.0,
    "comment": "Grew on me after some more plays.\n\n+ Plays quickly\n+ mechanically solid\n+ Nice artwork and components\n\n- theme is tacked on\n- needs expansion to really shine\n- base game has limited deployability",
    "timestamp": 1762210800
  },
  {
    "username": "danimal88",
    "rating": 9.0,
    "comment": "Contains all content and expansions in Adventure Chest (Expedition Leaders, Lost Expedition and Twisted Paths expansions)",
    "timestamp": 1762210800
  },
  {
    "username": "thinkingamer",
    "rating": 9.2,
    "comment": "I'm writing this to say something: One of the silliest things you can say about this game is saying that the research track is much stronger than the defeating guardian option. That's totally wrong!!! This only kind of applies IF you are still a new player; if you are playing correctly, AT MINIMUM it is REQUIRED to put your both of your exploration and research tokens on top of your research track IF you want to do WELL in this game. The REAL options are choosing between: 1) trying to get a high guardian score vs 2) taking a ton of artifact and item cards to get more points vs 3) having lots of research tiles vs 4) diversifying all those things (most people choose this option).\n\nNot reaching the top (or pretty close to the top) of the research track usually means that the player didn't play that particular game well (or most of the cards and assistants that appeared in that game were absolutely terrible). LASTLY, you need to count both IDOLS points AND GUARDIAN capture points; when those points are combined, they are usually pretty similar to your research track score points.\n\n*UPDATE*\nSometimes luck can be too much; if a player gets two good assistants by chance then that player gets to have a significant advantage over others.\n\nWhen a good item appears abruptly, the player who ends up getting it, especially during the early stages of the game (because it was only available during his/her turn), that player gains a huge advantage.\n\nOne way to partially remedy this problem is to balance out the power of artifact-item cards and assistants (sometimes I remove all the bad assistants, BUT also remove overpowered cards like the pick and the airplane).\n\nStill, this is an awesome game despite the obvious balance flaw.\n*END UPDATE*\n\n\nThis is a very accessible, fun, and highly repayable light-mid euro game. It has resource management, deck-building, worker placement mechanics among others, but seamlessly combines all those elements into a distinct unique game of its own. The components and the game presence of this game makes Arnak one of the best looking board game out there, specially for its price.\n\nOn the negative side, a lot of the game mechanics are be highly randomized, which leads to inconsistent scoring (I've had as high as 90+ points game, also lower than 60 points game). Secondly, the Western/European explorer in an exotic jungle setting is somewhat awkward in 21st century culture/view/perspective, although there is nothing really wrong or offensive here when observed in detail.\n\nFinally, I think this is a very versatile game that pleases both casual (family) and serious gamers, and I would also strongly recommend this game to first time euro board game learners.",
    "timestamp": 1762124400
  },
  {
    "username": "lbar_430",
    "rating": 9.0,
    "comment": "Assosiation",
    "timestamp": 1762038000
  },
  {
    "username": "reswob",
    "rating": 8.9,
    "comment": "Nice Balance between Deckbuilding & Worker-Placement. Pleasent complexity level.",
    "timestamp": 1762038000
  },
  {
    "username": "Ultra_Sama",
    "rating": 9.0,
    "comment": "Great! We love it",
    "timestamp": 1761865200
  },
  {
    "username": "SuperMentality",
    "rating": 9.0,
    "comment": "My most played game this year. I play this any chance I get on BGA. It's interesting and getting points is really fun. Not the easiest game to teach but very rewarding with its gameplay, art style and theme of exploration.",
    "timestamp": 1761778800
  },
  {
    "username": "fmestevez2804",
    "rating": 9.0,
    "comment": "x",
    "timestamp": 1761778800
  },
  {
    "username": "pappydag",
    "rating": 8.5,
    "comment": "We were doubtful at first about this game, but only because it took a long time to figure out how to play. But after 3 hours of troubleshooting and starting over like 3 times, we figured out how to play and it becomes pretty intuitive. Lots of choices to make. Worker placement, deck building, multiple resources. Very thematic and as you explore and progress through the game it is pretty satisfying.\n\nMy wife and I weren't sold on the theme at first, but we borrowed the game from a friend and tried it out, and we both had to admit that the game was very good, and very fun - it really does get better with each play because the exploration aspect and trying different strategies, the potential combos are endless and we've never felt trapped by a certain set of cards. Only played 5x at 2p so far, but it plays really well at 2p and we score really close to each other. (There's also no \"take that\" component, which is really nice.)\n\nTakes forever to set up, tho.",
    "timestamp": 1761692400
  },
  {
    "username": "FoxRageQc",
    "rating": 9.0,
    "comment": "K Played",
    "timestamp": 1761692400
  },
  {
    "username": "sharkboy666",
    "rating": 9.0,
    "comment": "+Expedition Leaders Expansion\n+The Missing Expedition Expansion\n+Adventure Chest\n+BGG Coins and Compasses",
    "timestamp": 1761692400
  },
  {
    "username": "ditterio",
    "rating": 9.0,
    "comment": "LOST RUINS OF ARNAK (1-4 players)\nEXPEDITION LEADERS (1-4 players)\nTHE MISSING EXPEDITION (1-4 players)\n\nComplete compact rules with both expansions: https://boardgamegeek.com/filepage/215018/action-andy-lost-r...\n\nStrategy guide: https://boardgamegeek.com/filepage/238908/strategy-guide-for...\n\nI've won with:\n\nBaroness\nCaptain\nExplorer\nFalconer\nMechanic\nMystic\nProfessor\n\nI have yet to win with:\n\nJournalist\n\nGreat euro game!",
    "timestamp": 1761692400
  },
  {
    "username": "cs4b4",
    "rating": 9.0,
    "comment": "Kártyavédőzve (110 db 63,5 X 88)\n3 db promo card (kártyvédőzve 63,5 X 88)\n\n1-4 player",
    "timestamp": 1761606000
  },
  {
    "username": "Seb399",
    "rating": 8.7,
    "comment": "Mais quel jeu extraordinaire de combos et d'anticipation avec une thématique et des composantes de jeu superbes. Un jeu magnifique qui nous fait penser au plus célèbre archéologue au monde Indiana Jones. Une montée en puissance dans ce deck building, pose d'aventuriers épique",
    "timestamp": 1761429600
  },
  {
    "username": "RainCar",
    "rating": 10.0,
    "comment": "1000 plays, still fun.",
    "timestamp": 1762690440
  },
  {
    "username": "TheMiddleAgedGamer",
    "rating": 10.0,
    "comment": "Really fun!",
    "timestamp": 1762623900
  },
  {
    "username": "Papinek",
    "rating": 9.7,
    "comment": "Certainly the Spiel des Jahres 2020 for me !\nThe most beautiful artwork and game material ! The box is not the best ! I have never seen extensions with that quality !\nYou have put two barrels of love in this game ! Thanks Min & Elven",
    "timestamp": 1762598160
  },
  {
    "username": "HugoCruzVilla",
    "rating": 10.0,
    "comment": "+ Lost Ruins of Arnak: Expedition Leaders = 3 plays\n+ Lost Ruins of Arnak: The Missing Expedition = 2 plays",
    "timestamp": 1762470000
  },
  {
    "username": "clawp1995",
    "rating": 10.0,
    "comment": "Gamegenic Sleeves 66 x 91 Value Pack (200 pack)",
    "timestamp": 1762470000
  },
  {
    "username": "madtimmy",
    "rating": 9.5,
    "comment": "Broken Token Insert\nsleeved",
    "timestamp": 1762383600
  },
  {
    "username": "Raffaelo",
    "rating": 10.0,
    "comment": "Just Awesome!",
    "timestamp": 1762297200
  },
  {
    "username": "BionicBeaver",
    "rating": 10.0,
    "comment": "I have Expedition Leaders: It is a must include.\n\nArguably Dune Imperium's equal, and so it is rated the same. I would play either interchangeably.\n\nPlays great at 2+.",
    "timestamp": 1762210800
  },
  {
    "username": "rywoods",
    "rating": 10.0,
    "comment": "Quite possibly my favorite euro. A really enjoyable central loop of advancing of the (variable!!!) temple tracks with a lot of tactical non-determinism built around it.",
    "timestamp": 1761778800
  },
  {
    "username": "CatnipTheGrey",
    "rating": 10.0,
    "comment": "Love it in solo and multi. Must try with the leaders expansion.",
    "timestamp": 1761692400
  },
  {
    "username": "Bateyes",
    "rating": 10.0,
    "comment": "Ich habe:\n- Basisspiel.\n- Die Expeditionsleiter (Erweiterung).\n- Die verschollene Expedition (Erweiterung).\n- Abenteuerkiste (Big Box mit Erweiterung) (Erweiterung), mit:\n--- 2x Spielbrett Separat (2. zusätzlich erhalten, da einige Spielbretter eine Fehlproduktion hatten).\n- 5x Alicorn (Promo).\n- 5x Saxofon (Promo).\n- 4x Runensteine (Promo).\n- 1x Ratte (Vorbesteller-Bonus bei der Abenteuerkiste) (in Arnak-Basisbox) (Promo).\n- Wertungsblock (Zusätzlich) (Addon).\n- 1x QR-Code-Werbekarte \"Steam version\" (Englisch, lag am CGS-Stand auf der Spiel 2025 herum, nicht zum Spielen gedacht) (Zusatz).\n\nGeholt auf Spiel 2025 im BGG-Stand:\n- Base Set: GeekUp Bit Set (ersetzt einige Basisspiel-Cardboard-Komponenten durch Kunststoff) (gelagert hinter der Abenteuer-Kiste) (Addon).\n- Expedition Leaders: GeekUp Bit Set (ersetzt einige Erweiterungs-Cardboard-Komponenten aus \"Die Expeditionsleiter\" durch Kunststoff) (gelagert hinter der Abenteuer-Kiste) (Addon).\n- Coins and Compasses GeekUp Bit Set (ersetzt Münzen durch Metall und Kompasse durch Kunststoff) (gelagert hinter der Abenteuer-Kiste) (Addon).",
    "timestamp": 1761606000
  },
  {
    "username": "jakoozzi",
    "rating": 10.0,
    "comment": "Love the components, the exploration theme",
    "timestamp": 1761519600
  },
  {
    "username": "jak23xf",
    "rating": 9.6,
    "comment": "solo high score: 96",
    "timestamp": 1761429600
  },
  {
    "username": "rkfan",
    "rating": 10.0,
    "comment": "Played 2025.",
    "timestamp": 1761343200
  },
  {
    "username": "Kayne02",
    "rating": 9.5,
    "comment": "In 2p it feels a bit too restrictive and so little locations are discovered. It seems like this game glows just in 4p. I'll try with 3p more.",
    "timestamp": 1760997600
  },
  {
    "username": "mmc chuck",
    "rating": 10.0,
    "comment": "Great game with no weakness. I also have all the expansions, but did thoroughly enjoy the base game.",
    "timestamp": 1760824800
  },
  {
    "username": "vitortrino",
    "rating": 10.0,
    "comment": "10/10",
    "timestamp": 1760824800
  },
  {
    "username": "bdavid0127",
    "rating": 10.0,
    "comment": "H",
    "timestamp": 1760738400
  }
]