[
  {
    "username": "ultimoratio",
    "rating": 1.0,
    "comment": "Update:  This game is getting into me (in a bad way) like most Euros do. Base game only is even worse\n\n====================\n\nStill good and strategic, but the downtime and its solitaire design is now getting into me. For its game length, there are other Euros and non-Euros I prefer playing.\n\n-----------------\n\nFantastic Euro game where you pick up workers from your bag, which you continuously build up. I prefer this with the Trade & Intrigue expansion over base Altiplano. Orleans is also more generous as you get rewards on every action you do.\n\nRated this with the Trade & Intrigue expansion",
    "timestamp": 1734649200
  },
  {
    "username": "bernstein82",
    "rating": 1.0,
    "comment": "Maybe Keep This? No Interaction / Multiplayer Solitaire",
    "timestamp": 1729720800
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "I guess the box art is accurate for how this game is a horrifying reflection of popular trends.",
    "timestamp": 1722463200
  },
  {
    "username": "NvidiaJunkie",
    "rating": 1.0,
    "comment": "The mechanics weren't bad from what I could remember, but I just absolutely hate the theme. I personally cannot handle the aesthetics.",
    "timestamp": 1689976800
  },
  {
    "username": "UniversalWaite",
    "rating": 1.0,
    "comment": "\"Orleans\" is a horrible experience of unbearable length, briefly punctuated by three or four amusing moments. One of these involves a knight humping the leg of a cheese wheel. Such are the meager joys. If you want to save yourself the box price, go into the kitchen, cue up a male choir singing the music of hell, and get a kid to start banging pots and pans together. Then close your eyes and use your imagination.\nThe plot is incomprehensible. The dialog of the Farmers®, Merchants® and Othermeeples® is meaningless word flap. Their accents are Brooklyese, British and hip-hop, as befits a race from the distant France. Their appearance looks like woodyard throw-up. They are dumb as a log. They share the film with human characters who are much more interesting, and that is very faint praise indeed.\n\nThe game has been signed by Reiner Stockhausen This is the same man who directed Altiplano. Now he has made \"Orleans.\" Faust made a better deal. This isn't a film so much as a bag tie-in. Children holding a Scholar Meeple in their hand can invest it with wonder and magic, imagining it doing brave deeds and remaining always their friend. I knew a little boy once who lost his blue toy truck at the movies, and cried as if his heart would break. Such a child might regard \"Orleans\" with fear and dismay.\nThe human players are in a witless sitcom part of the time, and lot of the rest of their time is spent playing in slo-mo away from any interesting decision, although--hello!--you can't outrun a crappy bag pull. The pieces, including lots of monks, try to pry you out of boredom, although never in the history of board games has a monk piece ever inspired.\nThere are many great-looking boatmen in the film, who are made up to a flawless perfection and look just like real boatmen, if you are a junior fanboy whose experience of the gender is limited to boatmen magazines. The two most inexplicable characters are the craftsmen who Mephistopheles threw in to sweeten the deal.\n\nThe gameplay is bewildering. A meeple makes no visual sense anyway, but two or three tangled up together create an incomprehensible confusion. I find it amusing that meeples that can unfold out of a clothiers purse do most of their actions with...fists. Like I say, dumber than a box of staples. They have tiny little heads, although monks must be made of older models, since he has a wooden beard.\nAware that this game opened in Australia several hours before Chicago time and the morning papers would be on the streets, after writing the above I looked up the first reviews as a reality check. I was reassured: \"Like watching paint dry while getting hit over the head with a frying pan!\" (Someone, Guardian); \"Sums up everything that is most tedious, crass and despicable about modern board gaming!\" (Other dude, Daily Mail); \"A giant, lumbering idiot of a game!\" (Me, Daily Mirror). The first American review, Tom Vassel of my nightmares, reported that Stock Hausen’s \"ambition runs a mile long and an inch deep,\" but, in a spirited defense, says \"this must be the most game I have ever experienced.\" He is bullish on the distribution: it \"feels destined to be the biggest game of all time.\" It's certainly the biggest something of all time.\nFootnote 6/24: Does it strike you as a lapse of Medieval castle security that no one notices a track ripping off Feld? Not anyone watching on the live EuroCam? Not even Pegasusspiel?",
    "timestamp": 1663624800
  },
  {
    "username": "GaiaHero",
    "rating": 1.0,
    "comment": "Looks like it was made in the 70s disgusting components, boring game.",
    "timestamp": 1624744800
  },
  {
    "username": "ogunil",
    "rating": 1.0,
    "comment": "developing not completed",
    "timestamp": 1602799200
  },
  {
    "username": "Frozen Flesh",
    "rating": 1.0,
    "comment": "I came here, because of all the people rating mature themed games like KD:M or Hate with a 1, just because of their mature theme.\nThis games theme is boring!",
    "timestamp": 1547074800
  },
  {
    "username": "RobGuilliman",
    "rating": 1.0,
    "comment": "Played it twice.",
    "timestamp": 1541890800
  },
  {
    "username": "sgosaric",
    "rating": 1.0,
    "comment": "Q: What do you get if you cross a cube pushing engine building euro with a Dominion - an engine building deck builder?\nA: A box chock full of cardboard chits and wooden pieces and stuff.\n\nOrleans a.k.a. Dominion the boardgame, reminds you that cards were there for a reason (making the game cheaper and smaller). Basically you're buying people tokens, throwing them in a bag and pulling them out, and you need 2-3 of a specific kind to make an action. From there on it's pretty much a type of restricted Dominion - in the first part you're building an engine, later you're trying to get points; restriction of possible options allows for a few different takes on building the whole bag drawing thingy. There's no interaction and after an adding points exercise somebody wins.\n\nSo, if you thought Dominion is too streamlined, elegant and too reminiscent of CCGs, here's it's done in an old school euro vibe with one of the drabbest visuals ever (worse than Concordia). There are progression spread sheet charts filling the board, there's a lot of stuff arranged in neat lines, waiting to be picked up, and somewhere in the air there hovers at least an impression of many choices - as is the trend in dreary euros these days. The game has one thing going for it - it is more strategic than all tactical VPS games coming out these days, even if shares certain piece galore symptoms with them.\n\nOn one hand it's refreshing too see a more strategic oriented euro, on the other hand it's got all the symptoms of boring old school euros. Yawn. I must say there's a serious lack of a frowny eurodude on the cover.",
    "timestamp": 1541545200
  },
  {
    "username": "familygaming",
    "rating": 2.0,
    "comment": "The bag-building sounds interesting on the surface, but by the end of my second play, this revealed itself to me as a salad roll - rice-paper thin theme with a helping of point-salad. Runs too long for what it is, set-up is too long, and decisions about where to send workers are uninteresting.\n\nWife's opinion: Loved first play. At end of her second play, she felt it was already getting samey.\n\nRating history: 8|6|4|2\n\nAfter 3 plays... ORLEANS ended up being a bit of a disappointment. The first play was fun enough (I tend to be a sucker for novelty), but half-way through my second play, I felt like I was essentially doing the same thing all over again. I get that there is a sandbox element to the game, and I need to try new things, but I don't find the different ways to pursue points to be that interesting (I usually find this a problem with point-salad games).\n\nMaybe it's the 2p game that does work as well for me, but the more I think about it, the more I think that it's the gameplay itself. I like analyzing the map and racing for the high-quality points, but Broom Service does that better as a main part of gameplay, and nothing else in Orleans really grabs me.\n\n2019 Update\nI kept giving this game chances, and finally ponied up for the Invasion expansion because of how much everyone else seems to like this game. Invasion made the game much better, but it still couldn't save it. The game is still too long for what it is, set-up is still too long, and the actual buildings and disk placement are still uninteresting.\n\n2025 Update\nTaught to a friend and my opinion when down further. Decisions are too limited, results too uninteresting, and the game is WAY too long for what it offers.",
    "timestamp": 1743458400
  },
  {
    "username": "tectactoe",
    "rating": 2.0,
    "comment": "Easy to get stuck in a cycle of sameness. Some buildings feel clearly better than others. Some opening maneuvers strike me as almost necessary. Yet there's something about the building of one's bag that I still find fascinating and clever. Much of that lies within knowing how many workers to cull, which ones to cull, and when to cull them. Keeping a \"lean\" bag is essential. But how lean? And comprised of what types of tokens? That depends on several things, of course. Need to explore this one further - will be more than happy to do so.\n\nUpdate: Waning a bit on this after several more plays. Continues to feel like I'm chasing after more or less the exact same stuff each game. Racing my opponent(s) toward the same goals, up the same tracks, bag building starts to become distressingly similar, yet again certain actions/buildings/paths prove to be unequivocally stronger/better than others. Starting to think the real options you have at winning here are more limited than they once appeared.",
    "timestamp": 1736204400
  },
  {
    "username": "iplaybgnaked",
    "rating": 2.0,
    "comment": "Fun bag builder that's interesting until you discover the various zero luck strategies, after which the game becomes incredibly boring and samey on repeated plays. Expansion fails to address these issues and reinvigorate any interest in playing it again.",
    "timestamp": 1732143600
  },
  {
    "username": "NormandyWept",
    "rating": 2.0,
    "comment": "Tedious and uninteresting puzzle with insufficient interaction and none of the magic that makes e.g. Dominion a great game.\n\nPresumably the appeal is in the tactility of handling wooden pieces in a bag, but why bother when you can much of the same experience in a better game anyway, or just play a dexterity game instead?",
    "timestamp": 1642719600
  },
  {
    "username": "Fragasnap",
    "rating": 2.0,
    "comment": "The farmer track, development track, and the goods strewn across the shared guild-house map still do not amount for much competition with only 2-players. While the problem could be resolved with scaling, player interaction is otherwise so limited that bogging the game down with 3+ players is simply not worthwhile.",
    "timestamp": 1633730400
  },
  {
    "username": "bilbo20033",
    "rating": 2.0,
    "comment": "Trop trop de hasard dans ce jeu. De plus, une seule stratégie est viable pour gagner. Peu d'intérêt. Il faudrait revoir la méthode de calcul des points de victoire.",
    "timestamp": 1599861600
  },
  {
    "username": "datefruit",
    "rating": 2.0,
    "comment": "simultaneous",
    "timestamp": 1538344800
  },
  {
    "username": "Revangavator",
    "rating": 2.0,
    "comment": "This game has 0 replayability. In four games that I played I have always used same strategy, and won 3 times. Nothing changes from game to game, nothing forces you change you strategy. You always try to spread on map as much as possible and maximaze your main score track. Amd thats it. Boring!",
    "timestamp": 1527199200
  },
  {
    "username": "LeHavreFanatic99",
    "rating": 2.0,
    "comment": "I am honestly shocked this continues to rocket up the charts.\n\nI found it incredibly dull, tedious, and unenjoyable. The bagbuilding idea is fun initially but there seemed to be no interesting decisions on what to actually do with the game itself.\n\nFound it entirely too long. Tried to play a second game and quit.\n\nWould never play again.",
    "timestamp": 1483657200
  },
  {
    "username": "Capashin",
    "rating": 2.0,
    "comment": "Little to no player interaction and the gameplay is quite boring.",
    "timestamp": 1455404400
  },
  {
    "username": "Scifi66",
    "rating": 3.0,
    "comment": "Not a fan of bag builders but it was at least solid enough as it did have some luck mitigation. Some competition for various things including resources/track bonuses but mostly a turn by turn optimisation puzzle. Gave me Feld vibes.",
    "timestamp": 1748815200
  },
  {
    "username": "mouthytim",
    "rating": 3.0,
    "comment": "The coin to VP ratio feels so outdated, game was okay but meh.",
    "timestamp": 1741906800
  },
  {
    "username": "PrintandPlayPirate",
    "rating": 3.0,
    "comment": "Terribly imbalanced",
    "timestamp": 1739487600
  },
  {
    "username": "kareds",
    "rating": 3.0,
    "comment": "Pretty uninteresting: you do things to do more things. At least Quacks is funny.",
    "timestamp": 1739401200
  },
  {
    "username": "Alyssa Oolacile",
    "rating": 3.0,
    "comment": "Green player components missing.",
    "timestamp": 1705359600
  },
  {
    "username": "Citery",
    "rating": 3.0,
    "comment": "It's clear that a lot of people have found something to love in here, but I can't see it: it was all just so intensely dull. It's almost offensive in how dedicated it is to being inoffensive.",
    "timestamp": 1693864800
  },
  {
    "username": "Thatsnotme",
    "rating": 3.4,
    "comment": "Geekup bits",
    "timestamp": 1684965600
  },
  {
    "username": "oldskoolgeek999",
    "rating": 3.0,
    "comment": "Overrated. Very dry and abstracted yet quite simple and 'solvable'.",
    "timestamp": 1678230000
  },
  {
    "username": "Nurk",
    "rating": 3.0,
    "comment": "I do not like the game mechanic of a very unstable beginning that gets a lot more stable as it progresses. A few lucky or bad draws in the beginning decide the game.",
    "timestamp": 1670972400
  },
  {
    "username": "Good_Wood",
    "rating": 3.0,
    "comment": "The set up takes so long and the game is so repetitive. There's little player interaction. Everything you do gets different resources that amount to points but in no interesting way. I just couldn't understand the hype for this game?",
    "timestamp": 1662156000
  },
  {
    "username": "JammyDodger3579",
    "rating": 4.0,
    "comment": "Eh? It didn't leave any impression on me from my one and only play. The theming is drab, the mechanics are kinda cool but I prefer sleeker more streamlined experiences",
    "timestamp": 1762124400
  },
  {
    "username": "Legomancer",
    "rating": 4.0,
    "comment": "A \"classic\" I somehow had never played before. I have played its South American cousin a couple of times and honestly, I prefer that one, not because of the way it cycles your chips, but because there are fewer things I need to juggle. This one has tracks (of course), goods that I never figured out what they do except score points, a place you can send guys to (among other things) build a cathedral (of course), and a map. There are also events each round that I'm going to be honest, I completely ignored. The tracks also did some things, I think. It's way too much, especially on BGA, and the end result is just another standard named-after-a-European-city affair that I'll eventually confuse with something else.",
    "timestamp": 1758578400
  },
  {
    "username": "shawnmackay1593",
    "rating": 4.0,
    "comment": "Didn't like this at all mainly because of the events which affected players very differently during my play. Setup is also an absolute beast. The actual game play is interesting and my family likes the co-op version (which requires an expansion). But as a competitive game, the sometimes brutal events completely suck the fun out in my opinion.",
    "timestamp": 1758232800
  },
  {
    "username": "selvalabelva",
    "rating": 4.0,
    "comment": "Brainburn         Longevity    \nLuck impact       Rules/Setup  \nInteraction       Involvement  \n\nAftertaste           Enthusiasm   \n\n Played at 2+4 player count\n Rated base game w/o additional modules\n Expansions would probably fix base game flaws\n Confrontation: multiplayer solitaire",
    "timestamp": 1751320800
  },
  {
    "username": "spencyrrh",
    "rating": 4.0,
    "comment": "2025-04-09 | 1 play at 3 | dlp 2014 e | OlSw teaching:  4 \n\nYou draw tokens of varying colour representing kinds of worker from your bag and play them to your board in slots demanding specific combinations in order to achieve outcomes like 'buy this worker and go up a track'; 'buy THIS worker and go up a track'; or 'put a house down for area majority scoring'. By managing your bag, moving on tracks, adding exotic slots to your board, and placing permanent 'automation' space-fillers in your slots, you build an engine to deliver points over 18 rounds.\n\nA nadir of 2010s Eurogames for me: a midweight game with six rounds, three tracks and two boards too many. A humourless puzzle missing opportunities for colour: a map of France abstracted to a geometric map with tiny cursive names, and an afterthought in-game, yet takes up half the table; 'great accomplishments' with no illustration or text, just another zone for workers; and mechanisms which speak of monk slaughter or robot-drawn wagons, drily considered rather than laughed about by friends. Interaction feels low even for the genre. On its own terms, I'd call it an admirably restrained and gently classic-feeling 120-min engine-builder. I think it runs too long, leaving an aggressive, space-hogging early strategy unviable against long-term investors, but the latter have many paths. Please play Quacks instead.\n\nI love how it looks. Franz has illustrated games whose look I dislike but he perfectly suits this arid, calm mock-medieval style. Everything takes up too much space, and players feel disconnected, but I can hardly blame the production.\n\nI found the rules butter-smooth. As you plan simultaneously and only feel bitter after the fact if your action got taken, 2-4p would feel similar. You might find tracking everyone's planning onerous at 5p.\n======\n2025-05-21 | 2nd play on BGA\n\nI played again. The previous setting harmed my experience unduly. No, fair enough: a fine puzzle with nice art. You will have to adjust to what other players do, to a fair extent for a game of this genre. It runs too long. A good advert for always playing a second time. I still don't like it.",
    "timestamp": 1750543200
  },
  {
    "username": "tursel",
    "rating": 4.0,
    "comment": "I did like the game earlier. Orleans overstays it's welcome. Last four rounds can be very boring. Expansion can make the game even easier.",
    "timestamp": 1750370400
  },
  {
    "username": "sup3rdan",
    "rating": 4.0,
    "comment": "Pretty run of the mill Euro with repetitive gameplay. Appreciate the bag building innovation but doesn't do much with the concept.",
    "timestamp": 1735426800
  },
  {
    "username": "FreeArt",
    "rating": 4.0,
    "comment": "I think really hate the mechanics where you need to race to get one valuable thing on a track but get absolutely nothing if someone grab it before you. It feels like your investment has been wasted, which can push you even futher behind in the VP race. There are also other things I don't like but basically the mix of high randomness and the very punishing scoring race piss me off way too much.\nThe art and bag building are cool however, but that's not enough to save this game... I've no desire to play it again.",
    "timestamp": 1734994800
  },
  {
    "username": "JasonSaastad",
    "rating": 4.0,
    "comment": "strategic contest\nmoderate skill:moderate luck\nmain course\n\n Aesthetically Archaic\n several strategies\n diminished downtime\n\n incidental interaction\n\n\nFair maiden: How do you make a knight?\n\nCleric: Well, when a farmer, and a boatsman, and a merchant REEEALLY love each other...\n\nPuzzle Strike > Orléans\n\nI could be convinced to play if using the Trade & Intrigue Beneficial Deeds board which increases player interaction.",
    "timestamp": 1729548000
  },
  {
    "username": "vejrum",
    "rating": 4.0,
    "comment": "Just yet another very multi-player solitaire, resource conversion Euro game.\n\nAs interactive as your dog taking a dump in the woods and someone else accidentally stepping in it next day while shuffling for something in their handbag.\n\nApparently, the expansion adds solitaire and co-op - well, that can not have taken much time and effort to add.",
    "timestamp": 1724450400
  },
  {
    "username": "LeCuttyFlam",
    "rating": 5.0,
    "comment": "Excellent jeu. Mais l'édition de Matagot est vraiment mauvaise (la qualité des sacs...). Et l'installation du jeu est horrible. (compté les tokens en fonction du nombre de joueurs, merci mais non merci).\nCa manque d'une modernité généralisée.",
    "timestamp": 1750629600
  },
  {
    "username": "lewix",
    "rating": 5.0,
    "comment": "엄청나게 나온지 오래되어서 이제 해 보았다.\n\n전략적인 깊이는 낮지만 알려진대로 뽑기를 활용한 전략적 게임으로의 발전은 놀라웠다.\n\n전반적으로 빌딩 기반 확대 전략하는 게임이라 점구 부분이 초반 잘 보이지 않는 부분이 있어 집중하지 못하면 애매한 상황이 되게 된다.",
    "timestamp": 1747692000
  },
  {
    "username": "tscox87",
    "rating": 5.0,
    "comment": "Not for me",
    "timestamp": 1746741600
  },
  {
    "username": "Generalkhun",
    "rating": 5.0,
    "comment": "This game is good until it introduce one thing that I hate, the buildings. It sound like this is a love-hate things in the strategy game. The more you dump these kinds of variabilities in to the game (like all the options in stuffs in something like tech in kemet, and buildings in purto rico, le harve), the more the player (like me) suffered from the optimization infeasibility because its too much to swallow.\n\nThe bag building is somehow comfort to play. Resource conversion plus those building is some how again, \"Multiplayer solitaire\" style.",
    "timestamp": 1736377200
  },
  {
    "username": "bggmatje",
    "rating": 5.0,
    "comment": "[February 2022]\nStrategy game that involves luck that can be mitigated. I was looking forward to this one, but it left me disappointed. Although I don't mind luck in games, I think I didn't like it here in combination with the euro strategy. Also, you will most likely have turns where you can't do anything useful, which is not very satisfying.",
    "timestamp": 1736290800
  },
  {
    "username": "aaj94",
    "rating": 5.0,
    "comment": "Always blends in my head with Troyes (same publisher, I guess?) Bag-building was sort of interesting but you are just using the bag-building to go up different tracks. Central board element seemed quite under-utilized.\n\nSep '19: Rated 6\nDec '24: Rated 5",
    "timestamp": 1734562800
  },
  {
    "username": "escaldada",
    "rating": 5.0,
    "comment": "4411￥+3700￥(Trade and Intrigue)\n\nTheme: France Middle Age\nComplexity: Heavy\nPlayer Interaction: Low\nPlaying Time: 2h00\nPlayer count:2-5\nBest Player Count: 2\n\nOrléans looks cool. The bag building mechanic is well implemented, of course there is some luck in drawing but they are many ways to select what you want to put it in the bag and thinning the bag that the bag luck factor never bothered me. What bother me is that each game feels the same. And the fact that the last few turns of the game is about doing the same action every time. The expansions help for replayabilty, but still the game feels samey. The setup is tedious and surprisingly long when played at 3 players, the game lasts forever. I really like it but I certainly don't want to play it again and again because it's repetitive, I'm also afraid it takes too much time to play for what it is.\n\nPoints of interest:\n-Bag Building\n-Worker Placement",
    "timestamp": 1729807200
  },
  {
    "username": "atmpoison",
    "rating": 5.0,
    "comment": "Se me hizo eterno. Que la puntuación consista en avanzar en tracks y no en obtener determinadas combinaciones me hace sentir que las decisiones sean poco interesantes tras unas partidas.",
    "timestamp": 1727301600
  },
  {
    "username": "Pkolt",
    "rating": 5.0,
    "comment": "I didn't play this game a lot before passing it on to a friend who liked it way more than I did. I couldn't wrap my head around the strategy, and felt as though getting a few lucky bag draws in the beginning allowed some players to start snowballing early with little opportunity for others to catch up. This problem is probably easier to mitigate for experienced players, but as someone still learning playing a hopeless catch up race was a rather dry and tedious couple of hours to get through.",
    "timestamp": 1725055200
  },
  {
    "username": "HBGlover",
    "rating": 5.0,
    "comment": "3 plays in, I'm not liking the balance here... Getting those yellow guys seems to be the main thing, and everything else is a sideshow.\n4 plays in, I think I'm done with it. Close to being a good game, but not close enough.",
    "timestamp": 1717020000
  },
  {
    "username": "mectron",
    "rating": 5.0,
    "comment": "Boring. Theme completely irrelevant and could without problems be substituted for another.",
    "timestamp": 1715637600
  },
  {
    "username": "sykano",
    "rating": 5.0,
    "comment": "bag building game\ndry theme, looks complicated\nnot much player interaction\nnot appealing to me\na bit expensive\n\nodd gameplay problem of who reveals first what he will do in tense situations ?",
    "timestamp": 1710716400
  },
  {
    "username": "hiimjosh",
    "rating": 5.0,
    "comment": "A neat but dry pool-building game that has a strong optimization feel to it. I picked this up after hearing that the expansion will have a cooperative scenario since there aren't many heavier cooperative games out there. Played it with three first and then with two and definitely prefer it with more due to there being more competition for things. Solid game overall, but I wish there was more here. This is sandboxy and I prefer games that smack you in the mouth instead.",
    "timestamp": 1703718000
  },
  {
    "username": "faizali",
    "rating": 5.0,
    "comment": "One of those games that you feel absolutely nothing about.",
    "timestamp": 1698966000
  },
  {
    "username": "duodora",
    "rating": 5.0,
    "comment": "I know this game is a classic/favorite for a lot of folks, and it is objectively excellent! I should probably give this one another shot - my rating is almost certainly depressed because I've only ever played it with folks who know the game VERY well (translation: I've never played this game and not gotten crushed). It's so dry though.",
    "timestamp": 1694556000
  },
  {
    "username": "Vantastic",
    "rating": 5.0,
    "comment": "Turns out that bag building is better than deckbuilding which is better than dicebuilding. However, the fact that everyone can almost always take their turns simultaneously without meaningfully affecting the other players tells me it probably wasn't designed for me.\n\nPerhaps it was just bad luck but since you are drawing from almost your entire bag contents every turn I found it was easier than I anticipated to get hosed by the draw (at least in the early game).",
    "timestamp": 1693519200
  },
  {
    "username": "CowStriker",
    "rating": 5.0,
    "comment": "I like the bag building aspect but ultimately between the art, components and the overly long gameplay time for what is essentially simple gameplay, I kind of bounced off this one.",
    "timestamp": 1688767200
  },
  {
    "username": "treyalsup",
    "rating": 5.0,
    "comment": "My thought have really turned against this game.\n\nDo not play at 5 players. (there has been an expansion)",
    "timestamp": 1684274400
  },
  {
    "username": "rynelf",
    "rating": 4.5,
    "comment": "--Feb2016-- Quite cool, all things considered. I liked the game dynamics; found the endgame surprising; and was more than occasionally annoyed by the token draw from the bag. Fortunately, one can do better with both of those last ones (though the final one will likely never be perfect!) A fine game, but more random than things I prefer. (And a bit better on 2nd play; though I'm still not convinced it's something I want to play often.)",
    "timestamp": 1680559200
  },
  {
    "username": "Ardsami",
    "rating": 5.0,
    "comment": "Tried it twice, nothing in this game felt fun.",
    "timestamp": 1680472800
  },
  {
    "username": "TristanGeeraert",
    "rating": 6.0,
    "comment": "Review based on 15 plays (20/08/2025)\nIncluding:\n- Invasion\n- Trade & Intrigue\n- The Plague\n- Promo Tiles\n\nInitially I liked Orléans quite a lot. It was my first bag building game and I liked that mechanic immediately. However on repeated plays my excitement withered. Playing on the research track to gain as much multipliers as possible seemed almost mandatory and resulted in a gameplay loop that felt too similar.\n\nThe Trade & Intrigue expansion added some good additions and the new \"Beneficial Deeds\" board spiced things up again. Also the orders (which require you to collect certain goods and bring them to a certain city) make the movement on the central map feel less dull. In the base game, you usually just went for the route that offered you the most valuable good, so the orders seem like a necessary addition. Nonetheless, this expansion reignited my interest only for a couple of games. I just don't feel enticed enough to bring Orléans to the table. The Invasion expansion didn't add much for me as I don't like to play it co-op and the Plague expansion, while also interesting, doesn't allow much overlap with the Trade & Intrigue expansion.\n\nSo ultimately, I sold my Orléans collection. The game got me excited for bag building (which I still am), but Orléans in itself could not keep me engaged in the end. Also, I do find the artwork terrible. While highly subjective, I think it was the most unappealing game in my collection.",
    "timestamp": 1762124400
  },
  {
    "username": "artman_russian",
    "rating": 6.0,
    "comment": "1 партия. Оценка предварительная.",
    "timestamp": 1761606000
  },
  {
    "username": "meuxy",
    "rating": 6.0,
    "comment": "Classic European bag builder game. Very outdated art and a huge initial buildup in rules to explain, but has a fair amount of depth in comparison to similar style games.",
    "timestamp": 1760392800
  },
  {
    "username": "logopolys",
    "rating": 6.0,
    "comment": "Bag-building game. It's interesting as a concept, but I'm not sure what it adds over a standard deck-builder apart from economy of space. The actual engine aspects of the game are good, but can be punishing if you neglect getting colors soon enough.",
    "timestamp": 1759096800
  },
  {
    "username": "rutherford82",
    "rating": 6.3,
    "comment": "A cute little bag builder.",
    "timestamp": 1757023200
  },
  {
    "username": "marsman57",
    "rating": 6.0,
    "comment": "I played this with friends in Poland. It was an interesting game, but I felt it was kind of long. It definitely went beyond the 90 minute stated play time by probably an hour. Maybe we were just slow as we were playing in a social situation, but I was ready for it to be over when it ended.\n\nI would try it again though.",
    "timestamp": 1755813600
  },
  {
    "username": "watoop",
    "rating": 6.0,
    "comment": "Maybe 6 is a bit harsh. Would play again but just didn't excite me that much. Hyperborea is a better bag builder.",
    "timestamp": 1753653600
  },
  {
    "username": "Callomac",
    "rating": 6.0,
    "comment": "I fail to understand why this game is as well regarded as it is. All you do is draw tokens to move up tracks. Dull.",
    "timestamp": 1752012000
  },
  {
    "username": "willbeplayin",
    "rating": 6.0,
    "comment": "Much better with the Trade expansion board, it's a must have with the new events and the Trade board.\n\nAs time went on, we're both cooled on the game and it's going to the sale pile. The book track is too powerful, especially in 2-3p games where the citizens can be acquired in a larger amount vs. buildings.",
    "timestamp": 1751839200
  },
  {
    "username": "zedeemia",
    "rating": 6.0,
    "comment": "The core mechanic is really interesting and fun but there is only one path to victory, even though you may walk that path a bit differently. The result is that it just gets too repetitive after several plays.",
    "timestamp": 1749074400
  },
  {
    "username": "jesberpen",
    "rating": 6.0,
    "comment": "Interesting eurogame. The worker building bag is quite a cool feature of the game. Setup is very long and found the rest of the gameplay a bit boring.",
    "timestamp": 1748815200
  },
  {
    "username": "rcog",
    "rating": 6.0,
    "comment": "Bag building was supposed to make this one original, but in the end, there is only one way to deal with randomness. Kind of overly complex for a \"push your luck\" game. Some building are strong, others completely uninteresting.",
    "timestamp": 1744149600
  },
  {
    "username": "joanmoreno",
    "rating": 6.0,
    "comment": "Euro con curiosa mecánica de bag-building, entretenido pero algo flojo y desequilibrado en algunos apartados (trabajadores azules muy flojitos, tablero de acciones benéficas sosete, etc.). La expansión \"Comercio e Intriga\" arregla algunos de estos fallos del base y, para mí, pasa de ser un juego correcto a un juego notable.\n\nPor cierto, es un juego muy dado a despistes, rectificaciones y trampitas, sobretodo en la fase simultánea de colocación de fichas en los tableros personales (\"Ay, espera, si tú te pones ahí entonces yo me pongo aquí... ah, ¿no? pues entonces me pongo en otro sitio...\" etc.",
    "timestamp": 1744063200
  },
  {
    "username": "frankmal",
    "rating": 6.0,
    "comment": "Its ok, but it is not very deep and easily solved. Not enough ways to win, not very fun once you set your engine up",
    "timestamp": 1740351600
  },
  {
    "username": "bockhaus",
    "rating": 6.0,
    "comment": "Expansion: Invasion\nExpansion: Trade & Intrigue",
    "timestamp": 1739660400
  },
  {
    "username": "graybeard76",
    "rating": 6.0,
    "comment": "Game got a bit tedious in the middle, but finished well.",
    "timestamp": 1739574000
  },
  {
    "username": "KvdBergh",
    "rating": 6.0,
    "comment": "A very solid game with good rules and good components. I love a good bagbuilder, however I have a big problem with the game. That is the static setup of the game. I feel like I am playing the exact same game every time I am playing it.",
    "timestamp": 1739487600
  },
  {
    "username": "jmsmith2434",
    "rating": 6.0,
    "comment": "Includes GeekUp Bit Set from BGG Store and Invasion expansion.",
    "timestamp": 1739228400
  },
  {
    "username": "Fuzzel",
    "rating": 6.0,
    "comment": "⛔Worker Placement Bag Builder. Wenig Interaktion. Noch weniger bei nur 2 P...\n\n⏩ Concordia, Tzolkin, Agricola, Targi",
    "timestamp": 1737846000
  },
  {
    "username": "BoomDooger",
    "rating": 6.0,
    "comment": "Chels: 6\nAnt: 6\n\nHaving started bag-building with Quacks of Quedlinburg, it's great to see a euro implementation of the mechanism - the different workers being pulled for action recipes makes for a dynamic economy, as well as the considerations you need to take to ensure the right tokens are arriving. On a first play, we're a bit unsure on how much variance there is - though we took differing paths, it narrowed into a similar end game, and without too much player interaction (which may increase with more players), it might feel repetitive.",
    "timestamp": 1737327600
  },
  {
    "username": "dimproark",
    "rating": 7.0,
    "comment": "2023\nОдна из тех настолок, к которой у меня нет абсолютно никаких претензий. Я даже не могу придумать какие то минусы. Может быть немного суховато и почти нет взаимодействия, но для веселья и взаимодействия есть и другие игры. Рандома почти нет, в нее интересно учиться играть, и она не перегружена мусором. Единственное, что я заметил, это долгая подготовка к партии. Необходимость раскладывать эти мелкие жетоны товаров на карту удручает. В целом же впечатления только положительные. И еще мне пришлось докупить капсулы для монет, чтобы положить в них жетоны подданных.",
    "timestamp": 1762038000
  },
  {
    "username": "DoctorPhil",
    "rating": 6.8,
    "comment": "Criteria (out of 5)\nRules complexity 4\nPlaytime/complexity ratio 4\nStrategic avenues 4\nMechanism strength 4\nThematic integration 3\nVariability 3\nReplayability 3\nFun factor 3\nSolo mode\nPlayer interaction 3\nElement of mastery 3\n\nOverall 6.8 out of 10",
    "timestamp": 1759356000
  },
  {
    "username": "jecabreradc",
    "rating": 7.0,
    "comment": "Wish they sold an upgrade to it and not force you to buy the whole game and expansions to have access to the box and resources.",
    "timestamp": 1758751200
  },
  {
    "username": "wanne",
    "rating": 7.0,
    "comment": "bei Stefan gespielt",
    "timestamp": 1758751200
  },
  {
    "username": "Dice Mage",
    "rating": 7.0,
    "comment": "1",
    "timestamp": 1758578400
  },
  {
    "username": "atlas64gaming",
    "rating": 7.0,
    "comment": "AUGUST 2025: 79TH\nFEBRUARY 2025: 58TH",
    "timestamp": 1758492000
  },
  {
    "username": "blaklyte",
    "rating": 7.0,
    "comment": "Expansion:\n- Trade & Intrigue",
    "timestamp": 1757887200
  },
  {
    "username": "Killi",
    "rating": 7.0,
    "comment": "Cool bag builder. Will play again!",
    "timestamp": 1756504800
  },
  {
    "username": "Lowengrin",
    "rating": 7.0,
    "comment": "Orléans is one of 2014's crop of bag-builder games. At it's heart, it's an worker placement game that uses chits and a bag in the same way a deck-builder uses a deck. As workers are drawn at random from the player's bag, it's in the best interest of the player to hire workers that support his/her strategy. And there's also a mechanism to retire workers to thin one's deck. All in all, an interesting game that seems to have multiple strategies to explore.",
    "timestamp": 1756418400
  },
  {
    "username": "Mersion",
    "rating": 7.0,
    "comment": "With 5th player expansion, Meeples, BGG Upgrades, 3D Insert, and Metal Coins.",
    "timestamp": 1755813600
  },
  {
    "username": "dylarson",
    "rating": 8.0,
    "comment": "I played this once a few years ago and have really been wanting to get my hands on a copy of my own.",
    "timestamp": 1762470000
  },
  {
    "username": "clemosteo",
    "rating": 7.9,
    "comment": "PARFAIT (extension peste?)",
    "timestamp": 1762297200
  },
  {
    "username": "SgtTackleberry",
    "rating": 8.0,
    "comment": "Good but get the intrigue expansion as many others stated.\nReminds me a lot of Paladins of west kingdom. Just with a bag building twist.",
    "timestamp": 1762297200
  },
  {
    "username": "jann1",
    "rating": 8.0,
    "comment": "I like the bag management. You need luck but you can manipulate luck. This one I never tire of",
    "timestamp": 1762210800
  },
  {
    "username": "Eugeniosaracino",
    "rating": 7.5,
    "comment": "Esp) Muy buen euro de la vieja escuela. A dos jugadores no llega brillar todo lo que debería. Pero de todas formas es un buen juego.",
    "timestamp": 1761778800
  },
  {
    "username": "Kater_Inna",
    "rating": 8.0,
    "comment": "3",
    "timestamp": 1761778800
  },
  {
    "username": "DragonShiq",
    "rating": 8.0,
    "comment": "included in Orléans: Big Box (2024)",
    "timestamp": 1761692400
  },
  {
    "username": "BoardgameBriBri",
    "rating": 7.5,
    "comment": "PERSONAL LIKES\nCategory: Medieval\nMechanism: Bag building, kill steal, simultaneous action selection, variable set-up, worker placement (different worker types)",
    "timestamp": 1761519600
  },
  {
    "username": "thankyou4notsmoking",
    "rating": 8.0,
    "comment": "+Trade & Intrigue\n+Invasion\n+Plague",
    "timestamp": 1761429600
  },
  {
    "username": "PBandJellyfish",
    "rating": 7.9,
    "comment": "@TX",
    "timestamp": 1761170400
  },
  {
    "username": "Strewth78",
    "rating": 9.1,
    "comment": "3.0",
    "timestamp": 1762589520
  },
  {
    "username": "ditterio",
    "rating": 9.0,
    "comment": "ORLEANS (2-4 players)\nORLEANS INVASION (1-5 players)\n\nRules base game: https://boardgamegeek.com/filepage/107664/english-rules\n\nRules Invasion: https://boardgamegeek.com/filepage/121864/invasion-rules-eng...\n\nNew official variant events: https://boardgamegeek.com/thread/1373002/new-official-varian...\n\nPlain and simple guide Orleans with Invasion coop scenario: https://boardgamegeek.com/filepage/137148/orleans-invasion-c...",
    "timestamp": 1762297200
  },
  {
    "username": "Derianhorgen",
    "rating": 9.0,
    "comment": "SpielboxRating 8-9, av. 8,25",
    "timestamp": 1761951600
  },
  {
    "username": "Zedronar",
    "rating": 8.5,
    "comment": "BGA, TTS",
    "timestamp": 1761519600
  },
  {
    "username": "happyjosiah",
    "rating": 9.0,
    "comment": "Orleans was on my \"to try\" list for quite some time. When I finally got to play it, I was so enamored of that I immediately purchased it, along with some upgraded components and an expansion I'd never even played.\n\nI love deck-builders and bag-builders, so perhaps it's not shocking I found this game appealing, but even I was pleasantly surprised by how well-integrated that mechanic was into what is ultimately a lovely middleweight euro. While Orleans also includes elements of action selection, racing, and pick-up-and-deliver, these elements work seamlessly together to create a complex tapestry of strategic decisions comprised of really simple individual mechanics.\n\nEach turn, players will draw a set number of tokens out of their bags. Each of these tokens represents a different role. Most actions you can take involve two or three of these different roles teaming up to execute an action. So right off the bat, deciding how to allocate your worker tokens can create deliciously difficult decisions. One of the most common actions you can take allows you to add another token to your bag. Not all roles even appear in your bag at the start, so taking actions that require these roles is a multi-turn process. But in the meantime, other players may begin traveling around the village, picking up and delivering goods and building buildings. Once a good is picked up, it's gone, and once a location has a building, no more can be added, so being first to these locations is crucial as well. Still other actions allow you to permanently reduce costs of your actions, get new action options only you can take, and many more as well. There is strong tension in sequencing your actions, being aware of other the other players' progress, and monitoring the ever-dwindling resources.\n\nYou might think that with so many interlocking systems that the scoring would be one of those \"point salad\" affairs where the last 5 minutes of the game are spent doing arithmetic. Not so! Orleans is remarkably simple in your goals. None of the tokens you add to your bag contribute to scoring in any way; they are simply a means to an end. Your buildings are each worth the number you progressed to on the development track, then this score is simply added to your money and trade goods. The end.\n\nOrleans is easy to grasp, but tremendously difficult to play well. Nevertheless, it doesn't feel punishing or mean-spirited. My favorite new-to-me game of 2021 and the second best game of 2014 behind only Xia.",
    "timestamp": 1761084000
  },
  {
    "username": "Nylo",
    "rating": 8.5,
    "comment": "+ Revised Event Tiles for base game\n+ Invasion\n+ Trade & Intrigue\n+ Fan-Kit\n+ Neue Ortskarten N° 1,2,3,4\n+ Promo Ortskarten N° 1,2,3,4,5,6\n+ L'évêché de Tours promo tile\n+ Drawbridge promo tile\n+ Prairie promo tile\n+ Christmas Market promo tile\n+ Die Reise nach Tours solo scenario",
    "timestamp": 1761084000
  },
  {
    "username": "petchd",
    "rating": 9.0,
    "comment": "Lent to Guy",
    "timestamp": 1760911200
  },
  {
    "username": "louisj2016",
    "rating": 8.5,
    "comment": "Expert+",
    "timestamp": 1760824800
  },
  {
    "username": "yxd20250823",
    "rating": 9.0,
    "comment": "放置不同追随者到自己版图上，最后算分，规则不难，很好上手",
    "timestamp": 1760824800
  },
  {
    "username": "fazermozg",
    "rating": 8.5,
    "comment": "+",
    "timestamp": 1760652000
  },
  {
    "username": "malediq",
    "rating": 9.5,
    "comment": "+1.0 Orléans: Invasion expansion\n+0.5 Orléans: Plague expansion",
    "timestamp": 1762470000
  },
  {
    "username": "cs2eye",
    "rating": 10.0,
    "comment": "All expansions (Plague, Trade Intrigue, 5th Player, Invasion), geek bits, Etsy goods (cloth, wheat, wine...), and many of the expansion place tiles (10+)",
    "timestamp": 1762297200
  },
  {
    "username": "juanmanuca",
    "rating": 9.7,
    "comment": "VENDIDO CON TODO 135",
    "timestamp": 1761692400
  },
  {
    "username": "Napattack",
    "rating": 9.5,
    "comment": "3.03\n2-4\nBest at 4\n90 (1,170)\n#27",
    "timestamp": 1761692400
  },
  {
    "username": "quetzal513",
    "rating": 9.7,
    "comment": "P: 2-4, T: 90 min, KenSdJ-N\nEngine building, worker placement, 'bag/pool-building', medium heavy Euro. Similar to deck building, but here your recruited workers go into a grab bag (fairly unique). Resource Scarcity! Various strategies and options to explore. Low player interaction, 2 hour optimization puzzle. Multi track/mechanic boards (map - route building, 'good deeds' - a la cult track Terra Mystica, progress tracks)\n\n-Theme irrelevant, long set up time, no variable set up (same puzzle each time). Lacking English components (original edition, check carefully). Fiddly end game scoring. Can be AP prone, turns get longer as game progresses (game can slow down and may overstay its welcome), player skill/familiarity will produce some lopsided scores.",
    "timestamp": 1761519600
  },
  {
    "username": "adamphipps11",
    "rating": 10.0,
    "comment": "2-4 Players\nBest: 4",
    "timestamp": 1761519600
  },
  {
    "username": "hockeyjones",
    "rating": 9.8,
    "comment": "10\n\n\nPlayed in 2025\n\nSC: 427",
    "timestamp": 1761256800
  },
  {
    "username": "el_crosso",
    "rating": 9.9,
    "comment": "Still, my favorite bag builder out there and surely deserves more plays. It's of course euro as euro can be, set in France and as yellow as those golden oldies, but the gameplay is pheeeeenomenal!",
    "timestamp": 1761084000
  },
  {
    "username": "mattbain31",
    "rating": 10.0,
    "comment": "One of Feld's best offerings, of the 12+ i've played",
    "timestamp": 1759528800
  },
  {
    "username": "Pelle0809",
    "rating": 10.0,
    "comment": "So much fun. For a euro that has a few things going on, it's remarkably easy to teach. Amazing game.",
    "timestamp": 1759356000
  }
]