[
  {
    "username": "WolfieRue",
    "rating": 1.0,
    "comment": "Puts me to sleep. Other games do worker placement soooo much better.",
    "timestamp": 1747000800
  },
  {
    "username": "KarenLGBTQIA",
    "rating": 1.0,
    "comment": "I think this game is homophobic and is poorly designed to not include all sexualitys. It is fucked up that you can only get bonus points from pairing a husband with a wife. I played the game with a wife (as a female) and got no bonus points. Never playing again, one star ? ?",
    "timestamp": 1746828000
  },
  {
    "username": "parpari",
    "rating": 1.1,
    "comment": "Extremely bad mimic of Stonemaier games like Viticulture and Wingspan. Those games are MS games and very luck dependent but Everdell is completely theme less, luckfest and way more over produce of the game. Such waste of all these beautiful art.",
    "timestamp": 1737500400
  },
  {
    "username": "Feverdell",
    "rating": 1.0,
    "comment": "They need to get new people to write the directions",
    "timestamp": 1737154800
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "My sister got this for me as a gift. She was so lifeless and bored after 1 game.\n\nOoh, another anecdote. Someone new to gaming wanted to play something, so an experienced gamer got this out (without asking). Before setup was even finished, she was too intimidated and bowed out.",
    "timestamp": 1732057200
  },
  {
    "username": "EugeneLiu49",
    "rating": 1.0,
    "comment": "I do not enjoy the game play . I only play the base game twice. The work placement aspect is very weak . the cards are cute but not interesting.\nsold it after my second play.",
    "timestamp": 1726610400
  },
  {
    "username": "clairewestfall",
    "rating": 1.0,
    "comment": "sold after two plays . The worker placement is weak, card draw is too luck dependent . the tree is hella annoying . never wanna play this again.",
    "timestamp": 1726524000
  },
  {
    "username": "Nilssonius",
    "rating": 1.0,
    "comment": "Husband and Wife was removed from latest third edition and replaced with ugly cards.\nGet second-hand 1st/2nd ed.",
    "timestamp": 1712872800
  },
  {
    "username": "Laszlo_Jamf",
    "rating": 1.0,
    "comment": "This game is so pretty to look at, the components are very nice, the tree is nice (but absolutely unnecessary). In the gameplay, everyone plays the game for themselves and collects a few cards, here and there a combination is created for more points, sometimes someone snatches a card from you or occupies a space that you would have needed for your next combination... this is not player interaction, by the way. Since I discovered 18xx games, I know what player interaction means, it's moments where you want to go for the other player's throat at the same time and get a high five because his action was so brilliant, where you have to react to the other player's move, who in turn has to counteract it, and you have to react again yourself and so on.\n\nGames like Everdell and alike, I get so bored of these types of games. Of course you can have a good time while you're playing it, but it's not the kind of thing where after a board game evening I think, wow that was a great evening, we learned a lot during the game and we'll have to find a new date for the next one soon!\n\nI don't think it's a gatewaygame either that you could make appealing to non-players or players who don't play much, because it's too overloaded for that.",
    "timestamp": 1707087600
  },
  {
    "username": "dantherenman",
    "rating": 1.0,
    "comment": "Rules are incomplete.",
    "timestamp": 1703545200
  },
  {
    "username": "Ehrendil",
    "rating": 1.0,
    "comment": "Worst game I have ever played, the tempo is incredible disguting when you can't have the only one action you need, and that everybody before you takes... then it's the end of the game. I really don't understand how this is that much loved, i think it is my worst board game experience",
    "timestamp": 1696802400
  },
  {
    "username": "MorelliBuendia",
    "rating": 1.0,
    "comment": "What a piece of shit. Another game in the vein of Wingspan, of making obvious combos with zero decisions. The huge tree makes zero sense, too.",
    "timestamp": 1689112800
  },
  {
    "username": "Shadenium",
    "rating": 1.0,
    "comment": "I have to stand and sit down so many times it feels like a physical exercise, not a board game. Looking at the text of the cards in the middle of the board is pain in the ass. The game is a table hog with 0,0001 interaction between players. The only fair selling point is that girls around me are screaming from how much they like the artwork.\n\nThe balance between experienced players and new players is non-existent. 3 of us were on the third season while the owner of the game was still doing millions of actions in a chain fashion in season one.\n\nWith some expansions there are still games that have more elements on the board in a base versions that you still keep track on, whilst here I don't care and don't pay attention to 50% of elements on the board. It just happens.",
    "timestamp": 1686693600
  },
  {
    "username": "noobyNerd",
    "rating": 1.0,
    "comment": "If the game did not look so beautiful, the average rating would probably be below 5.\n\nGreat artwork and great quality of ressources but terrbile gameplay.\n\nEverdell is complicated but not complex and the random factor is too high.\nThe game is not a strategy game as many claim, it is frustrating, the cards have too much text and its not interactive.",
    "timestamp": 1685829600
  },
  {
    "username": "giorgiopaco",
    "rating": 1.0,
    "comment": "Too much text on the cards. Impossible to follow the text of the opponents' cards and try to react accordingly. It's not my game",
    "timestamp": 1676847600
  },
  {
    "username": "Ryanchowdhry",
    "rating": 1.0,
    "comment": "I don't get what people love about this game.",
    "timestamp": 1675292400
  },
  {
    "username": "ultimoratio",
    "rating": 1.0,
    "comment": "It has a tight resource management that I really like. However, the combo of critters and their locations are so luck dependent, especially with the bloated deck.\n\nIndeed, Seasons and other highly rated card tableaus like Race for the Galaxy or Imperial Settlers would be my first choice.",
    "timestamp": 1672009200
  },
  {
    "username": "CJE1111",
    "rating": 1.0,
    "comment": "Anthropomorphic animals rarely brings any value and usually only unnatural sentiments.",
    "timestamp": 1667775600
  },
  {
    "username": "funnytortoise",
    "rating": 1.0,
    "comment": "Unacceptable changes in presentation",
    "timestamp": 1659045600
  },
  {
    "username": "marcelvdpol",
    "rating": 1.0,
    "comment": "Luck fest galore. Game revolves around card combo's to accelerate your economy; if you draw them that is. Exploding Kittens is a better game.",
    "timestamp": 1654552800
  },
  {
    "username": "Errand Boy",
    "rating": 1.0,
    "comment": "What's all fuss? Resources conversion? That's it? Fancy parts mask a typical game. No true innovations.",
    "timestamp": 1643670000
  },
  {
    "username": "TroyNyne",
    "rating": 1.0,
    "comment": "This game is junk - it is all visual.\n\nThe game has so many weird design choices - like why put the goal cards on the tree when they are so small no one can read them? I played one four player game and felt that I saw everything the game had to offer -what great value!\n\nVery disappointed with this one. Goes to show how visuals trump gameplay for most people.",
    "timestamp": 1628114400
  },
  {
    "username": "thereck",
    "rating": 1.0,
    "comment": "Who threatens to sue Etsy shop owners? Honestly game salute, you’re the worst.",
    "timestamp": 1608678000
  },
  {
    "username": "kkkkkkkkkaad",
    "rating": 1.0,
    "comment": "One of the worst economic game I've ever played",
    "timestamp": 1608246000
  },
  {
    "username": "GregDarcy",
    "rating": 1.0,
    "comment": "Dan Yarrington. If I need to say more: Game Salute: A Cautionary Tale",
    "timestamp": 1607641200
  },
  {
    "username": "egg_timer",
    "rating": 1.0,
    "comment": "Took over two hours to read the rules and set up the game. At that point any interest in actually playing had evaporated.",
    "timestamp": 1590098400
  },
  {
    "username": "MisplacedWorker",
    "rating": 1.0,
    "comment": "Bad publisher. Google Game Salute",
    "timestamp": 1587679200
  },
  {
    "username": "Cangam",
    "rating": 1.0,
    "comment": "Needs to come with a magnifying glass so u can read the text on the cards. Crap game. Better games out there",
    "timestamp": 1585864800
  },
  {
    "username": "aircastle",
    "rating": 1.0,
    "comment": "Wendyjo73 told me that this game is the worst game she's ever played. Just a cheap rip off of better worker placement games.\n\nJust so everyone knows. Starlight Games is a imprint of Game Salute/Dan Yarrington:\n\nLook them up on BGG and you'll be pretty alarmed. From lawsuits to missing game boxes, etc.",
    "timestamp": 1568757600
  },
  {
    "username": "Nomorepiratedgame",
    "rating": 1.0,
    "comment": "For working with Yoka, a company known for its plagiarism of Bang!",
    "timestamp": 1564092000
  },
  {
    "username": "yiorgolas",
    "rating": 1.0,
    "comment": "A game for Age 13+ should be followed from equivalent art. If it was for 8+ i could tolerate it but not this game.",
    "timestamp": 1545174000
  },
  {
    "username": "Schr0dinger85",
    "rating": 2.0,
    "comment": "Multiplayer solitaire with cute animals. It was super boring, heavily luck-dependent, and at the end I had to just sit there doing nothing while another player finished. Terrible.",
    "timestamp": 1762124400
  },
  {
    "username": "khepriq",
    "rating": 2.0,
    "comment": "\"Unofficial\" Everdell™ comment",
    "timestamp": 1760652000
  },
  {
    "username": "douvaria",
    "rating": 2.0,
    "comment": "Some players still waiting to get some descent cards to their hands to enjoy this game. Very bad game design.",
    "timestamp": 1759010400
  },
  {
    "username": "ppsacco",
    "rating": 2.0,
    "comment": "NOT on my play list. Wanna play a real war game? NOT THIS~",
    "timestamp": 1757455200
  },
  {
    "username": "jyhuh35",
    "rating": 2.0,
    "comment": "엔진빌딩게임도 아니고, 일꾼놓기라기에도 애매하다. 그림예쁜게 전부인데, 카드 밸런스도 엉망이다.\n\n다시 해 봐야 할 필요는 느끼지만 손이 안간다",
    "timestamp": 1739660400
  },
  {
    "username": "CatContentCreator",
    "rating": 2.0,
    "comment": "Mir war von Anfang an klar, daß Everdell – rein mechanisch – das schlechteste meiner Kennerspiele ist. Ich behielt es, weil es, selbst bei Anfängern, sehr bekannt ist: Und diese, aufgrund der niedlichen Optik, schnell zu begeistern waren. Und dann waren da ja noch die ganzen Erweiterungen, die das Spiel, theoretisch, auch für mich attraktiver machen konnten.\n\nNun ist es aber endgültig Zeit, getrennte Wege zu gehen: Ständig nur darauf zu achten, ob man ein passendes Paar Karten hat, nervt genauso, wie das Auszählen der Punkte am Ende. Viele Texte sind zu klein, um am Tisch ergonomisch angeordnet zu werden. Wenn man es nicht regelmäßig spielt, muß man immer wieder irgendwelche Details in den Regeln nachlesen – und ohne Spirecrest will ich es eigentlich gar nicht mehr spielen, mit aber auch nicht (mehr dort).\n\nAuch viele meiner Neulinge mussten letztlich einsehen, daß das Spiel zu schwer für Anfänger ist und auch längst nicht so gut, wie die hübsche Aufmachung verspricht.",
    "timestamp": 1734994800
  },
  {
    "username": "avinadiviri",
    "rating": 2.0,
    "comment": "A generic worker placement game. It was kind of boring. The art is amazing though.",
    "timestamp": 1732057200
  },
  {
    "username": "Fragasnap",
    "rating": 2.0,
    "comment": "A simple resource-conversion card-based engine-builder, very text-heavy, very heads-down. Your ability to perform is wildly throttled by card-search space, especially emphasized by constructions which each grant a stipend of 4 to 6 Berries (a fairly expensive resource) with which to build a specific Critter card. The intrinsic combos implied by these production chains and further special VP Events that are earned by building specific cards make the entire game feel more on-rails than most games of the sort.\n\nBeing that card-search is so important, the moving supply of cards available to all players makes winning on the flop incredibly common. Worker placement feels pidgin, with forest spaces and meadow spaces providing so many replacements that the interaction never feels meaningful.",
    "timestamp": 1730674800
  },
  {
    "username": "Beuzbugz",
    "rating": 2.0,
    "comment": "This game falls into the category of numerous worker placement games without offering anything new.\nPretty but dull.",
    "timestamp": 1729980000
  },
  {
    "username": "Carlcast",
    "rating": 2.0,
    "comment": "Juego de construcción de motor y colocación de trabajadores precioso, componentes muy buenos.\n\nLo malo es el resto:\n- Juego demasiado largo para lo que ofrece.\n- La visualizacion de las cartas de los demas jugadores para poder poner tus trabajadores es dificultosa y tediosa.\n- Demasiado azar en el mercado (1° parte) Hay cartas que sobresalen sobre otras y pueden determinar quién gana la partida.\n- Demasiado azar en el mercado (2° parte) para \"combear\" parejas de animalitos...esa carta que nunca sale.\n- No es recomendable jugar a 2 ya que el mercado se estanca porque no hay suficiente movimiento en el mercado.\n\nEs preferible el juego Mi pequeño Everdell ya que quita todos los puntos negativos incluyendo la duración y el azar del mercado dejando una esencia similar.",
    "timestamp": 1722463200
  },
  {
    "username": "MikeReb",
    "rating": 2.0,
    "comment": "Not playable for two players.\n\nYou MUST reduce your deck - there is article on BGG forum how to do that. For two players I also recommend to acquire Everdell: Bellfaire expansion. But then, this game becomes quite expensive vs. what it can offer. It doesn't offer anything you can get with other, cheaper and better playable games.\n\nOverall, there are many better games to play, perhaps not as good looking as Everdell, but much better for play in a group of two and providing much more fun than this crap.\n\nIt has a group of fans, but be careful with their biased recommendations...",
    "timestamp": 1708815600
  },
  {
    "username": "Polgara",
    "rating": 2.0,
    "comment": "Not for me.\n\nThe graphic design and the tree don't work for me. What I was doing in the game was a bit boring but worked ok. Really dislike the mechanism where my next season doesn't start at the same time as yours. Going to the next season early felt like a disadvantage when I'm already not doing great. I never felt like I might want to switch seasons earlier to get something out of it. Also, the last part of fall was pretty much useless, I had stuff, but couldn't do anything with it anymore.",
    "timestamp": 1706310000
  },
  {
    "username": "Entropology",
    "rating": 2.0,
    "comment": "This is probably the best game that has made the worst first impression ever. One: tree is obnoxious, we had to cram onto half the table. Two: some of the text is so small I literally didn't notice it and ran the monastery a half dozen times (it's limited and I basically ruined the game scoring). Three: Didn't know there were 'attack' cards that fill up your city. Had a plan and when about to fill last space with a great card, friend swooped in and ended my game at the start of my 3rd round. So I sat out the last half of the game with nothing to do. Why the #$%$# are there attack cards in this sort game? So a 'no interaction game' unless they just randomly screw your game. It doesn't even help them, solely pain to ONE other person. And only TWO in the deck? That makes it worse, small odds with devastating results. BLAH! The berries/art are the only reasons this isn't a 1.",
    "timestamp": 1704409200
  },
  {
    "username": "A_Tad_Strange",
    "rating": 2.0,
    "comment": "Really could not get into this game, I’m not sure why \nVery sad as I had high hopes.",
    "timestamp": 1704322800
  },
  {
    "username": "Keahaw",
    "rating": 2.0,
    "comment": "Bad production that gets in the way of playing.\n\nThe game itself is largely solo, your opponents just exist to refill the market occasionally. Ultimately, like most of these things, you should just play race for the galaxy instead.\n\nEdit: I’ll try not to rant about too much more but I had very similar complaints. Some of it might also have been down to playing it between Santiago and Roll for the Galaxy (one is my favourite games and the other actually understands what engine building games should be).\n\n1) overall production: stupid useless tree that literally just gets in the way. Super small text + hard to read fonts + a game that almost entirely depends on reading the text. One component literally rolls away!\n\n2) the game is aggressively solitaire. Our only interaction was either accidental (“oh you took that card but I needed it because it randomly combos with a card I drew on turn one!”) or one player reminding another player it was their turn.\n\n3) it’s all just about converting resources into points by building randomly drawn cards or from claiming random bonuses that are tied to the random cards. The entire strategy seemed to be get good cards in your opening hand and then get good cards randomly from the market. The actual worker placement gaining resource system seemed almost pointless.\n\n4) maybe if this game was ranked in the 800s I wouldn’t care but this thing is one of the best games of all time?! And people bought a giant expensive big box edition?! Absolutely ridiculous!",
    "timestamp": 1688248800
  },
  {
    "username": "Slimhunk",
    "rating": 2.0,
    "comment": "Solitaire in a group, hate it",
    "timestamp": 1687989600
  },
  {
    "username": "Bazzisbazz",
    "rating": 2.0,
    "comment": "Played it once, and I hope I never have to again. I get why some people like this, but the art/cuteness factor definitely plays a big part in this (and I'm also not fond of the art/production value) gameplaywise it is plain boring. No interesting decisions, everything comes down to getting the right cards and knowing which combo's there are. The fact that you play asynchronous while in real life shows what a MPS this is, the other players might as well not be there. 'But there is blocking of the worker placement spots'. Incidental blocking doesn't count as real interaction, it is clearly not incentivised by the game and the differences in the resources you get from one spot or another are neglectable.",
    "timestamp": 1686088800
  },
  {
    "username": "TikyCharn",
    "rating": 2.0,
    "comment": "Probably the worst popular game I've ever played. There's nothing good about this game except for components and artwork. Game is extremely unbalanced, boring, with no chances for comeback. It brings nothing new and uses popular game mechanics like worker placement and deck building in the worst way possible. I wouldn't recommend this game to my worst enemy!",
    "timestamp": 1676674800
  },
  {
    "username": "Veracruza",
    "rating": 2.0,
    "comment": "An awful game that looks amazing. Extremely luck driven, if someone gets and builds a card that gives him resources back after building anything else in the first round, then other players are pretty much done for. If not for the art I bet nobody would think about playing this game again.",
    "timestamp": 1676156400
  },
  {
    "username": "fanatek",
    "rating": 2.0,
    "comment": "So boring, no interaction. Good luck to make combos (find 1/150 cards)",
    "timestamp": 1675206000
  },
  {
    "username": "Phuntom",
    "rating": 2.0,
    "comment": "Not good. Nice art.",
    "timestamp": 1675119600
  },
  {
    "username": "Neemz_",
    "rating": 2.0,
    "comment": "Had a terrible experience playing this game. Is it complicated, easy to fall behind, and encourages other players being spiteful to one another.",
    "timestamp": 1672873200
  },
  {
    "username": "noddingoff",
    "rating": 2.0,
    "comment": "Would win any Overrated Game of the Century Award.\n\nLargely pedestrian game that might have been ok if not for the shamefully bad graphic design. The tree? Are you kidding me.",
    "timestamp": 1666389600
  },
  {
    "username": "Elisa1301",
    "rating": 2.0,
    "comment": "Sprzedane",
    "timestamp": 1657490400
  },
  {
    "username": "jaydiepie",
    "rating": 2.0,
    "comment": "Meh",
    "timestamp": 1653602400
  },
  {
    "username": "lermi",
    "rating": 2.0,
    "comment": "wtf",
    "timestamp": 1638658800
  },
  {
    "username": "eddy_sterckx",
    "rating": 2.0,
    "comment": "2019-02-12 : First game. Worker placement + tableau building card combination game. Looks like a kiddy game, but has some teeth. I liked how each player plays the game at his own pace, you can even already start the next round, there's no waiting for players to end their round. What irked me is that in a game that's so dependent on card combinations, they've done it again : font size 2 text that you're then supposed to be able to read across the table.\n2019-02-22 : Another couple of games and the main weakness of the game becomes more clear : it's all about the card combinations and if you don't get them, you'll lose. In other words : between equally competent players luck of the draw will be the deciding factor. Rating slides from \"8\" to \"6\"\n2021-10-03 : Dan Yarrington & Etsy : I've just ceased and desisted rating this game a \"6\", it's now a \"2\"",
    "timestamp": 1633212000
  },
  {
    "username": "Fanotomenos",
    "rating": 2.0,
    "comment": "Don't get all the love for this one...",
    "timestamp": 1631052000
  },
  {
    "username": "GarfieldKlon",
    "rating": 2.0,
    "comment": "What did I miss? The tree is totally useless and doesn't make it better regarding the theme. There is not much theme in this game. There is so much luck, especially the starting hand. We were 3 players, 2 of us had bad luck with the starting hand (no combos), the other player had luck and could make many combos and played much longer in the first phase than the other 2 did. So it was already clear who will win even before we entered spring phase...\n\nThe main thing is about to get cards which will get you ressources and matching buildings with creatures. If you can't get those you're out. No chance against other who can build such combos. And building those is pure luck.\n\nThe cards look nice, but that doesn't make a good game. And it's a multiplayer solitaire par excellence! Nobody cares what the other do.\n\n\n\nTheme:           Very little\nGameplay:        Gathering ressources to buy more cards\nInteraction:     Multiplayer solitaire\nArtwork:         Nice\nLuck:            A lot of random cards\nStrategy:        Very little\nComponents:      Ok, totally useless huge tree\nPlay duration:   Very good\nEasy to teach:   Ok\nRules quality:  not read\nSetup time:      Ok\nNo downtime:     Can be played very quick (depending on combos)\nReplay value:    Random cards...",
    "timestamp": 1623880800
  },
  {
    "username": "Laadevil",
    "rating": 2.0,
    "comment": "One of the first games I got rid of (I am strict keeper).\nToo random, not enjoyblae in 2 players, veeeery long and boring (huge amount of AP) in 3 and 4 players. Sometimes, there are nice possible combos, but in majority thanks to luck, not players' skill. Amazing visual, but overhyped as hell.\nMy biggest disappointment of 2020.",
    "timestamp": 1613516400
  },
  {
    "username": "Tespis",
    "rating": 2.0,
    "comment": "Overproduced, too simple, not very original, too random and the illustrations are very childish, some argue that they are very beautiful, I do not see depth or artistic interest. The tree is the worst component I have ever seen in a board game: unnecessary, it deteriorates easily and makes it difficult to see cards. The game lacks depth, rhythm, and is anti-climactic. In the opinion of other users, the expansions are expensive and unnecessary. I honestly do not understand the success of this game, perhaps it is due to that \"Oh, it's so beautiful\" that many argue. I don't see interest in it either as a family game (there are many better ones), or as a starter game or as a filler or as a party. An opportunistic game that thanks to copying mechanics, simplicity and childish aesthetics has managed to convince many casual players. Finally, comment that the history included in the rulebook is up to the game, that is, stupid and not very elaborate.",
    "timestamp": 1610406000
  },
  {
    "username": "Ephorus",
    "rating": 3.0,
    "comment": "What I like:\n- Very cute theme.\n- Finding and playing cards that work well together can be satisfying.\n\nWhat I dislike:\n- MPS hell. No meaningful player interaction at all besides snatching cards from the middle.",
    "timestamp": 1762038000
  },
  {
    "username": "btasam",
    "rating": 3.0,
    "comment": "A exercise of doing what's available (usually free) with overly specific cards, but doing it in such a way that extends the length of the game for as long as possible.",
    "timestamp": 1759183200
  },
  {
    "username": "jdtaylor",
    "rating": 3.0,
    "comment": "This is like Splendor if it was much, much more annoying.\n\nAs in Splendor, the core gameplay is you sit in pensive silence, taking turns to draft resources from a pool and then put those resources back to purchase cards. The cards grant you additional resources/discounts for future card purchases, as well as victory points.\n\nHere are Everdell's innovations:\n- All the cards have unique text on them to read, evaluate, and consider, and you'll often be studying 16 of them at once (8 in your closed hand, 8 in the open shared area).\n- In addition, there are 22 worker placement spots on the board alone, and more will be added around the table in players' card tableaus (accessible by walking around the table and peering over people's shoulders). The ponderousness of the decision space will delight anyone who enjoys a lot of downtime between their turns.\n- Players don't reach the end of the game at the same time, so some of them will have to wait for the others to finish. \"I'm going to the bathroom or something,\" you'll say, getting up and pulling out your phone as the other players continue dragging out their turns, which never involved you anyway. \"Call me back over when it's time to fill out the big spreadsheet.\"\n- You find out who wins not with a nail-biting cross of the finish line, but by filling out a big spreadsheet.\n- Instead of tidy stacks of poker chips, the resources are messy piles of plastic toys.\n\nIf a game's gonna be multiplayer solitaire busywork, it'd be nice it was at least elegant.",
    "timestamp": 1755727200
  },
  {
    "username": "R_J_",
    "rating": 3.0,
    "comment": "Too much luck to feel like decisions matter, and a long play time. I find I really don't care who wins, and wish the game had taken 1 - 2 hours less. The open card market combined with the heavy imbalance between the power of certain cards compared to others really just ruins the game. Ability of players to deny overpowered cards in the market is very limited - so it just feels like the decisions are obvious and the game plays itself. Really boring!\nNice components, shame about the heavy luck for me, I just can't see the point in playing.\nPlay instead: terraforming mars or dune imperium.",
    "timestamp": 1753740000
  },
  {
    "username": "selvalabelva",
    "rating": 3.0,
    "comment": "Brainburn         Longevity    \nLuck impact       Rules/Setup  \nInteraction       Involvement  \n\nAftertaste           Enthusiasm   \n\n Played at 6 player count only\n Confrontation: multiplayer solitaire\n\n Satisfying tactile and visual presence",
    "timestamp": 1751320800
  },
  {
    "username": "gildedrain",
    "rating": 3.0,
    "comment": "[ SEE MY UPDATE! ] I don't understand why they designed it so that players can proceed on different timelines. One player can remove themself from the game early and this sets the bar for how many points the other players have to beat in order to win. They get to watch for potentially quite awhile as other people play, with them having nothing to do except watch and wait. If this isn't bad enough, a game about forest critters where they don't scurry around doing a ton of stuff in each season. In Spring and Summer they do 2 and 3 things. That's.... not scurrying. That's not busy. We expected each season to be substantial. Instead Spring is over in 5 minutes, Summer in 10, Autumn in 30?, and Winter can really drag on as the game increases in complexity as each player builds their village and gains more of an engine / options to consider. Aesthetics: perfect. Game Design: all three of us hated it. We kept checking the rules to see if we were missing something. The rulebook isn't great either. But no, this one is not for us.\n\nUPDATE: We played this a second time a year later, on Tabletopia. I was convinced I must have played it wrong. We didn't. We just ALL got TERRIBLE hands of cards that really ruined our first impression of the game, crippling us entirely and spoiling the game. In this second play we all got fantastic combos in our first hand of cards, and we were able to build upon that at a steady and methodical pace through the seasons, chaining combo after combo after combo together. After 2 hours we were all convinced it's a game we should own and keep in our regular game night rotation. What a swing, from a D to an A in one play. Geez. So glad we gave it a second chance!\n\n[UPDATE AGAIN] Oh man... this game is swingy. We've played it twice more and in both of those games 1-2 players got really unlucky card draws, and 1-2 players got incredibly lucky card draws. How one player's experience with a game can swing so drastically from one play session to another through no mistake of their own seems really off-putting to me. In our last two plays, 1-2 players finished early and had to wait 20 minutes or so for the game to wrap up. I spent the entirety of the last two games frustrated that I couldn't get an engine going, my resources were always sparse, and being able to see across the table at \"The Joneses\" living it up just made me feel like I was destined for a bad time and they were blessed by the Evertree. In the end, the scores were all within a few points of each other, which almost makes it worse? All of their apparent success (and FUN during the game!) didn't actually translate into points, where my lack of fun somehow worked out almost as well? With a great hand of cards, this game sings. With a mediocre hand, few resources, no combos, few workers, ...it's a real slog. I'm going back to a negative opinion of this one. People keep saying \"You don't like it because it's not the game you want it to be.\" Maybe? I want it to be fun every time I play it. I have plenty of games where it's fun to play and lose, but this one can somehow manage to be unpleasant to win. I really wanted this game to be great, but the randomness of card draws is just too much. I've thought about house rules like Mulligans or draw over 8 and discard down, but that's something that should have been sorted out in play-testing. I'd rather go play something else than fix this to my liking. Blah... I'm so annoyed that I don't like this game!\n\nI should probably mention that the 4 of us in our game group do not agree on this. We had a 45 minute discussion that carried over into the following day. The guy who got a good hand of cards in each of the 3 games he's played is the one in love with the game. I suggested he try playing my hand and see how it feels. \n\nAlso, there are a lot of comments suggesting that \"once you learn the deck and what the combos are, the game opens up, you know what to look for, the chains are more obvious, it's less random, etc etc.\" Maybe I really dislike card games... I don't want to learn your deck. I want to play a strategy game where my skill and wits are the deciding factor, not the card draw. I can't shake the feeling that if this game did not have worker placement, I wouldn't confuse it with a strategy game and I'd approach it like a card game.... but I already know I don't prefer card games... so that probably wouldn't help either.\n\nUPDATE: played 4p again, this time with a few random starting resources and everybody starts with a farm in their starting hand, in an attempt to loosen things up a bit. I also chose mainly resource generating clearing cards. I really can't stand this game. I only tried it again because a friend really loves it and hoped that this variant would fix some issues, but I hate everything except the artwork with this game. One player managed to tread water in Winter while the rest of us were in Summer. He nearly doubled our scores and there was almost nothing we could have done to improve our scores. The entire game you are reminded that you aren't performing nearly as well as someone else. Yes, that same thing happens when you have a common score track and you're trailing behind, but sometimes there's an investment strat you can employ that rockets you back into the running. Everdell feels bad to play when the artwork suggests that it should feel like the coziest game out in existence. This game breaks my heart. I can't stand the design decisions here. The only reason I don't score it lower is because I'm still willing to play it with this friend... I just have to constant remind myself that it's for his benefit, not mine, and to keep my thoughts to myself so I don't ruin his fun.",
    "timestamp": 1750716000
  },
  {
    "username": "Euroman",
    "rating": 3.0,
    "comment": "Sorry, I don't like this at all. This is tableau building taken to its worst because you need that card to work with this card. That card comes up, but is immediately taken by the person in front of you, OR you don't have the resources to buy it, so again it is gone before your turn comes around again. It isn't just one card needs another, it's Every card needs another card. Way, way, way too random and takes way, way, way too long!\nEvery 4 player game I've seen played of this has taken at least 2 hours and sometimes even three! And downtime is IMMENSE! Nothing to like about this game. And to top it off the card text is TINY! Everyone is trying to read the cards in the meadow, but it always comes down to picking up the card and reading it, or having someone read it to you. There are worse games, so this only gets a 3, but I will never play again.\nAlso, how can an expansion make it better? It would just make it more confusing, longer, and more frustrating by requiring even more cards that need other cards.",
    "timestamp": 1745877600
  },
  {
    "username": "p00q",
    "rating": 3.0,
    "comment": "Very modern euro-aesthetic design. Animal themed art, high production value, low interaction, meaningless point salad elements.\n\nThe board state for other players is just completely unreadable, the worker placement is very uninspired, and the point salad is so over-balanced it is meaningless. I'm assuming every game ends with all players around 51 points by default, and it is whomever manages to eek out the few extra to get to 60 wins.\n\nInstead of a grid where every card is a drip of points, just concentrate it to make it more readable.",
    "timestamp": 1744668000
  },
  {
    "username": "kefyras",
    "rating": 3.0,
    "comment": "It's not a bad game, but i don't ever want to play it again.\nIt's just not fun.\nIt's a mean efficiency puzzle for people who like to min-max and analyse as much as possible - can you squeeze out anything useful from what you have available ? nothing good ? you still have to do something.\nSo there's many actions that feel bad, unrewarding. I don't feel like i've achieved anything, just barley scraped by a few more points.\n\nAnd there's so few actions that you can't get a good engine rolling. Once you have \"Something\", the game is over.\n\nSome people might like that, but i don't.",
    "timestamp": 1735686000
  },
  {
    "username": "BoardGamingCouple",
    "rating": 3.0,
    "comment": "3/5\n\nBeautiful game, but far too random. There are other engine building games like Terraforming Mars, Wingspan, Oceans, & Earth with better ways to mitigate luck.",
    "timestamp": 1735254000
  },
  {
    "username": "klebinaldo",
    "rating": 3.0,
    "comment": "Boring having to worry about common cards and unique cards.\nBoring having to watch Meadow.\nBoring having to worry the whole time about the limit in my hand. I think it should just be at the end of the season.\nThe combos are not funny.\nThe events don't make sense.\nAnd the placement of workers did not match the Engineer card.\nI don't understand why this game is considered a family game.\nI prefer Imperial Settlers.",
    "timestamp": 1729461600
  },
  {
    "username": "Zaungast",
    "rating": 3.0,
    "comment": "Kitschy card combos lost in a card deck.",
    "timestamp": 1729288800
  },
  {
    "username": "Threef",
    "rating": 3.0,
    "comment": "It's my first review here, so of course it's for a game I have a lot of issues with.\n\n- Aesthetics are beautiful, but they don't match the gameplay. Game design is cute, but gameplay is far from cute. You are playing through 3 seasons... and every player plays in their own alternative universe, since you can end a season earlier, meaning you can be playing in autumn, and someone will be still in summer or potentially even in spring.\n- Random card draws. There were games where we haven't seen a single husband and games where one player had 3 sets of farm+husband+wife\n- Playing free cards, if you have good luck drawing, is incredibly unbalanced.\n- the game lets the most humble player start, and there is nothing humble in this game. You rush for limited spots for production, try to get good cards before other players get them, even if you are not planning to play that card. Just because you don't want other players to have it. There is resource sharing, but only if you are forced to do it.\n- Goals often carry the game but since they are limited (and you have to spend a worker to get a single one) other players might steal them from you\n- Decision paralysis trigger. You have limited amount of workers, limited amount of \"good\" spots for them, and by the end of the game limit of cards you can have in your city. So the last turns I spend overthinking if I can fit some more cards, and which ones\n- Some places for workers are on other players cards. Keeping track of them is a headache and reading the effect\n\n+ Resources are super. Berries are squishy, and amber see through\n+ \"Take that\" card is actually nice for me. It's one of the few player interactions that are intentional. You have a countermeasure that gets rid of it, if you are lucky to draw it, lucky to gave resources and lucky to have a free spot in the city.\n\nOverall, it's a worker placement game where you're deciding which of all bad options you can take. Unless you have luck in drawing cards and everything goes your way, then you know you won in the middle of the game.\n\nI plan to play it again with house rule which splits meadow cards into 4 stacks of normal creatures, normal buildings, unique creatures and unique buildings.",
    "timestamp": 1728943200
  },
  {
    "username": "mOCHU035",
    "rating": 3.0,
    "comment": "2 Plays\n9/29/19\nInteresting engine-builder with really pleasing art. Needs more plays to properly evaluate. There seems to exist significant depth. Also significant randomness. But the 1 play makes me wonder if the at least some portion of the randomness can be overcome to some extent with skill. The season progress challenge is pretty interesting as well. Probably a game that will be significantly better if playing with a group that plays it often. Still rates lower than Terraforming Mars at the end of the day I suppose (as an engine builder); and I do not really like TFM.\n\n11/6/19\nFeedback remains the same. The expansions do make the game a bit more interesting I suppose. But yea.. a lot depends on the card draw and player order. Player order issue gets masked by the card draw issue, but I feel that the lower number of cards to start with is not really a sufficient handicap. The card art does look absolutely spectacular though. And the board is not terrible either. And the box looks pretty good too. Overall, the production quality is noticeably better than TFM, but this game actually makes TFM look better because I already get so annoyed with the card draw randomness in that game (despite the drafting, which is not even an option here - replaced by the meadows which I do not think are a sufficiently good alternative).\n\n12/29/19\n-1 cause I prefer TFM with expansions over Everdell with expansions.",
    "timestamp": 1727733600
  },
  {
    "username": "MTBSi",
    "rating": 3.0,
    "comment": "Beautiful artwork, not much substance. There is way too much luck involved and if you don’t get the right cards or the only pebble spot gets taken it’s game over. Much better worker placement games are out there.",
    "timestamp": 1725400800
  },
  {
    "username": "ourmove123",
    "rating": 3.0,
    "comment": "Everdell can feel overwhelming due to how much information there is to track, potentially leading to player fatigue.\n\nI feel the game is not accessible enough, relative to the calm and cutesy theme it presents.\n\nA strong start in the game can give a player a significant advantage, as there are limited ways to catch up or hinder others' progress.\n\nThe game's tree component wasn't problematic on a big table.\n\nDistinguishing between Critters/Constructions and Commons/Uniques was challenging at a glance, which increased the game's complexity.\n\nThe game appears to be heavily luck-dependent mostly due to card pairing requirements.",
    "timestamp": 1721512800
  },
  {
    "username": "RVS70",
    "rating": 3.0,
    "comment": "Not sure what all the fuss is about. This game has some problems. I would not want to play it again.",
    "timestamp": 1714860000
  },
  {
    "username": "marcuslind1",
    "rating": 3.0,
    "comment": "2024-05-03\nRating after first play, 4p: 3/10.\nCute critters in solitaire town.\nBad: Too much luck of the draw, too much hard to read card text, and too little direct or interesting player interaction. The only attack card I saw in play (The Fool) seemed too strong, and cards that let you use other players' cards are cumbersome because of how hard it is to read other players' tableaus. Comboing can make turns long and forces heads down play to execute well. Long game. If you finish early you must wait for other (probably better) players to finish before the game ends, which can mean several rounds of play.\nGood: Tight starting economy. Limited number of cards in hand and in your tableau adds an interesting restriction that you have to plan around (again, The Fool can really mess up a player's game). Artwork and bits are nice. Pulling of combos can be fun. The open market mitigates some of the luck dependence.\nVerdict: Le Havre and Agricola are still the best worker placement games of this kind to me, when it comes to building your personal board or tableau. Everdell has some nice things going for it, but ultimately feels to bloated and solitaire to compete. But if you want a combination of classic worker placement and personal tableau building with some twists, crazy components and generally non-aggressive play, Everdell is worth checking out.",
    "timestamp": 1714687200
  },
  {
    "username": "Desigual",
    "rating": 3.0,
    "comment": "Good cute fun game. Artwork is great. I like the idea but it definitely lacks player interaction. Other worker placements just do a better job. The mechanisms are interesting. Good light game even though there are a few better tableau builders. This will have luck of the draw.\n\nBest with 2 or 3",
    "timestamp": 1712700000
  },
  {
    "username": "Daniel109",
    "rating": 3.0,
    "comment": "Just another boring resource-collection engine builder with pretty art. Nothing to see here.",
    "timestamp": 1706655600
  },
  {
    "username": "benshever",
    "rating": 3.0,
    "comment": "WAY overrated. Just another “let’s make it pretty and nobody will notice the game is boring and uninspired.”\n\nGame doesn’t offer enough interesting decisions as cards basically have to be played with 1 or 2 other linked cards. I hate this trend in games with bloated tableaus and and decks.",
    "timestamp": 1705791600
  },
  {
    "username": "Tabitha54",
    "rating": 3.0,
    "comment": "This is a beautifully illustrated game and I had such expectations of it. But I really don't like to play it at all.\nI find it boring and needlessly complicated.",
    "timestamp": 1705446000
  },
  {
    "username": "Travisfrz",
    "rating": 3.0,
    "comment": "I recommend getting something like Stone Age, Wingspan, or Scythe. There's not many games I don't like but this is one of them. The art is nice though.",
    "timestamp": 1704063600
  },
  {
    "username": "Bechara",
    "rating": 3.0,
    "comment": "Bad and convoluted worker placement disguised with cute critters for mass appeal",
    "timestamp": 1701644400
  },
  {
    "username": "distanceovertime",
    "rating": 3.0,
    "comment": "Not of fan of worker placements. Enjoyed the setting lore and art.",
    "timestamp": 1701212400
  },
  {
    "username": "at_least",
    "rating": 3.0,
    "comment": "After playing one game I completely don't understand the phenomenon of this game. Maybe it doesn't suit my tastes, although after getting to know the mechanics I thought it would be fun to play and it's something for me, because I like multi-stage board games with deck-buildung mechanics. I didn't find anything innovative in it, sometimes the gameplay was prolonged (I mean the flow), which I don't like very much. I didn't enjoy it, I wanted to finish it as soon as possible. The price is completely inadequate to the experience, although I understand that it's because of the large number of elements. It was also hard to control all the actions of each individual player, especially at the end of the game. The actions on the cards seemed unnecessarily complicated to me. This complication made no sense at times.\nThe game itself is very nicely published, contains a lot of components, and is visually enjoyable. Well, except maybe for the included cardboard tree, which is a game component.\nAt this point I know that I didn't like it. However, I think I will give it another chance, maybe then I will change my rating.\n\nAnother tags:\nnot my copy",
    "timestamp": 1694642400
  },
  {
    "username": "The Pirates",
    "rating": 3.0,
    "comment": "Everdell is visually spectacular in its lush, placid setting, while the gameplay suffers from the incongruent passive aggressiveness that is worker placement, the inclusion of a take-that character that poisons the fun, and the occurrence that some players finish out the game then sit by while others continue on.",
    "timestamp": 1693519200
  },
  {
    "username": "ryanlo00",
    "rating": 3.0,
    "comment": "Nothing is inspiring, limited thematic ties, low player interaction. It is another multi-player solitaire.",
    "timestamp": 1691013600
  },
  {
    "username": "SierraMey",
    "rating": 3.0,
    "comment": "Why is this so popular? So many mechanics, so little strategy. its really all about reading small fonts, doing combos and crossing your fingers that its gonna pay off. Resourcefulness is not rewarded at all.",
    "timestamp": 1689285600
  },
  {
    "username": "Fevin",
    "rating": 2.5,
    "comment": "Wordy as fuck. Des police de caractère 8 pour les chaine de free cast (système pourri s'il en est).\n\nDe l'aléatoire à gogo :\nles objectifs dépendent de cartes précises qui sont en parties piochées secrètement)\ndu développement économique reposant sur des free cast\nPlein de trucs pour modifier et annuler les cost\n\nDu kingmaking majeurs aussi. Des équilibrages à la truelle. Des wording et une iconographie plus que médiocre aussi.\n\nCa passerait sur un apéro game mais ça se dit stratégique.",
    "timestamp": 1685138400
  },
  {
    "username": "JSMA",
    "rating": 3.0,
    "comment": "Langweillig und momnoton",
    "timestamp": 1683928800
  },
  {
    "username": "kataclysm",
    "rating": 4.0,
    "comment": "I didn't enjoy it and can't remember why. I acquired it because of the cute woodland theme, but it seemed too long and complicated. Creature Comforts is more my speed.",
    "timestamp": 1761519600
  },
  {
    "username": "whitecatplays",
    "rating": 4.0,
    "comment": "5p too loooong. Sure it's good and all, but I'm less interested than ever in these quasi-interactive action drafting resource conversion tableau builder point grabbing logistic efficiency puzzles.",
    "timestamp": 1760738400
  },
  {
    "username": "hyde_70s",
    "rating": 4.0,
    "comment": "So very much overrated game. A prime example of a 'new age' board game product: ok gameplay, super mega deluxe components, antropomorphic animals, several versions of a similar game === bgg top 100. I just don't like this box, and everything it represents.",
    "timestamp": 1759010400
  },
  {
    "username": "nic7410",
    "rating": 4.0,
    "comment": "19 new",
    "timestamp": 1757541600
  },
  {
    "username": "DisasterProblem",
    "rating": 4.0,
    "comment": "very mid , i was hoping for more",
    "timestamp": 1755813600
  },
  {
    "username": "Woodland_Alliance",
    "rating": 4.0,
    "comment": "The text is too damn small!",
    "timestamp": 1754604000
  },
  {
    "username": "lkeohane",
    "rating": 4.0,
    "comment": "3",
    "timestamp": 1753740000
  },
  {
    "username": "SenseiZen",
    "rating": 4.0,
    "comment": "Kanske",
    "timestamp": 1751925600
  },
  {
    "username": "Sourhex",
    "rating": 4.0,
    "comment": "not my style of game, deceptively small rulebook, until you realize all the rules are on the cards. Too many things to keep track of unnecessarily. Takes too long.",
    "timestamp": 1751148000
  },
  {
    "username": "Soul_Turtle",
    "rating": 4.0,
    "comment": "Remarkably mediocre. Does nothing special except look cute (in that cheesy modern animal sort of way).",
    "timestamp": 1748469600
  },
  {
    "username": "Dahje",
    "rating": 4.0,
    "comment": "I really do love worker placements and have given this game a few plays, but just don't enjoy it. It feels boring and somewhat unbalanced. I have won and it still didn't feel like my experience was any more enjoyable than losing or that I even got to do anything creative.",
    "timestamp": 1747346400
  },
  {
    "username": "kaylex",
    "rating": 3.5,
    "comment": "Played twice with 4 players. Not sure the appeal here, other than the artwork is very nice. Seems far too random to get the cards you need and too long with much downtime. Maybe it shouldn't be played with 4, but also does the expansions fix some of the randomness somehow?",
    "timestamp": 1746396000
  },
  {
    "username": "Versifex",
    "rating": 4.0,
    "comment": "Tuckboxes created.",
    "timestamp": 1744754400
  },
  {
    "username": "darkfinale",
    "rating": 4.0,
    "comment": "Need more plays.\nGreat artwork.\nTableau building game (combinations too complicated for me)\nPuzzle style.\nDraggy in last phase with multiple mechanics. Can be long.",
    "timestamp": 1744495200
  },
  {
    "username": "Fantazindy_",
    "rating": 4.0,
    "comment": "A popular worker placement game\n+ Visually appealing with adorable artwork, high-quality components, and a decorative tree\n+ Unique mechanic allowing players to advance seasons at their own pace\n- Heavy card reading contrasts with the calm theme, making it less friendly for new players\n- Overly reliant on card draws, as pairing cards is the most effective way to earn victory points",
    "timestamp": 1740870000
  },
  {
    "username": "bernstein82",
    "rating": 4.0,
    "comment": "Multiplayer Solitaire & extreme luck fest (having certain cards in the starting hand gives an extreme advantage)",
    "timestamp": 1739574000
  },
  {
    "username": "Third_Era",
    "rating": 4.0,
    "comment": "",
    "timestamp": 1738710000
  },
  {
    "username": "everydaybear",
    "rating": 4.0,
    "comment": "Steam",
    "timestamp": 1738537200
  },
  {
    "username": "DSAdixits",
    "rating": 4.0,
    "comment": "I'm glad I played this several times before purchasing because the charm is entirely in its artwork; the gameplay itself is far too fiddly and constrained, and requires a knowledge of the cards that I will never achieve given my disinterest in ever playing again.",
    "timestamp": 1734908400
  },
  {
    "username": "johnnytruant",
    "rating": 4.0,
    "comment": "Too much Luck",
    "timestamp": 1733871600
  },
  {
    "username": "turaglar",
    "rating": 4.0,
    "comment": "After 3 plays I had the feeling that there is no more replay factor for me in it",
    "timestamp": 1733094000
  },
  {
    "username": "HarryCrocker",
    "rating": 4.0,
    "comment": "played once over the board and the rest against AI. I think the theme doesn't do it for me and there's not enough interaction.",
    "timestamp": 1732834800
  },
  {
    "username": "boto2137",
    "rating": 4.0,
    "comment": "I prefer looking at it and playing with the components than playing the actual game.\n\nIt's not bad, just not for me - although I've only played the base game.",
    "timestamp": 1728943200
  },
  {
    "username": "smurfodeth",
    "rating": 4.0,
    "comment": "Light worker placement and moderate tableau building, paired up with charming (though sometimes counter-productive) production value, offers a pleasant and engaging enough experience. I'd certainly rather play this than Wingspan or Terraforming Mars. Seems like a good fit for mixed-experience level crowds.",
    "timestamp": 1726437600
  },
  {
    "username": "LuisGomez",
    "rating": 4.0,
    "comment": "I usually don't like games with high-variance decks, and this wasn't the exception. The worker placement feels a bit bland since all the combo opportunities came from the card-playing action. I find random and frustrating the whole prerequisite system in the cards. This should be played at 3 or a maximum of 4 players, but the option to play it at 5+ should be avoided. It has some long turns so waiting for play is extremely unbearable. Also, the asymmetry of the game phases between players can lead to one player without anything to do waiting for the game to end. Maybe in a new play with less AP, I'd enjoy this more...",
    "timestamp": 1722290400
  },
  {
    "username": "smurfodeth",
    "rating": 4.0,
    "comment": "Bland and uninspiring, yet more pleasant than other games in its space.",
    "timestamp": 1721253600
  },
  {
    "username": "Zomerdromen",
    "rating": 4.0,
    "comment": "The game would be more fun if you had more freedom/time to actually build out your table further. There is also too much luck involved for proper balance.",
    "timestamp": 1720216800
  },
  {
    "username": "TheBluestJay",
    "rating": 4.0,
    "comment": "Played it twice with 6 and then 4 people with some expansions. The game turns take too long, and the asynchronous timing means some players finish the game and just...wait around? I also despise that one card that another player can use to ruin your town. Why does this exist in such a cozy game?\nOverall, I could play it again but with 2 players max.",
    "timestamp": 1718575200
  },
  {
    "username": "PrettyNDumb",
    "rating": 4.0,
    "comment": "Tableau building options feels restrictive, making for somewhat dull gameplay. Also, a bit too complex for an intro game, not deep enough for a regular as a hobbiest. Art and production is well done, but theme does little for me personally. Glad I tried it, but strongly prefer wingspan for my ‘lighter, cute tableau builder’",
    "timestamp": 1716501600
  },
  {
    "username": "larrydurbin",
    "rating": 4.0,
    "comment": "Font size on the cards is so small, it's a deal breaker!",
    "timestamp": 1711494000
  },
  {
    "username": "RedHotBandit",
    "rating": 4.0,
    "comment": "A very pretty but convoluted game. It's a perfect example of what's plaguing board games today: all flash, no substance, all algorithm.\n\nThe 3D tree where you track seasons, keep your pawns and bonuses, is totally useless. It could simply be an extended part of the flat board. It's just there for show.\n\nThe theme could just as easily been Dante's Seven Levels of Hell, or Charlie and the Chocolate Factory, which isn't a good thing, because all it shows is that the mechanics were done first, the theme at the very end during some marketing meeting.\n\nThere's too much to keep in mind. There are 4 materials you can use to build stuff, because, \"hey, other games have 3, so we will have 4!\" The instructions on some cards you play are so bloated, it forces the more normal players to simply avoid using them. Each card you draw has over a dozen elements on them, and many have interwoven effects on one another, so using the cards require quite a bit of memory. \"Did I use that card? Can I use it again? What can I use it with? Will it affect the final score? Can others use my card?\"\n\nOn the positive side, you have to carefully choose which card you play because others can take advantage of them, the art is great, the 3D tree looks awesome on Instagram, but once you really think about it, man, what a let-down.\n\nAll we want is that developers design their games theme first. mechanics later. We want to have fun PLAYING THE GAME, NOT LEARNING THE GAME OR BRAGGING ABOUT THEM ON SOCIAL MEDIA!",
    "timestamp": 1711321200
  },
  {
    "username": "reswob",
    "rating": 5.2,
    "comment": "i dont own it and im happy with it. dont understand the hype so much. sure artwork is nice but thats it.",
    "timestamp": 1762038000
  },
  {
    "username": "cenny",
    "rating": 5.0,
    "comment": "It's an okay game, not just for me. Too little player interaction for my taste. I don't ever see me wanting to play this of my own choosing.",
    "timestamp": 1758232800
  },
  {
    "username": "data00",
    "rating": 5.0,
    "comment": "────────────────────────────────────────────────────\nThis game was released before the Flamcraft release.\n\n일꾼놓기, 카드 사용 등 매력적인 요소를 많이 담은 게임입니다.\n그런데 저는 익혀야 할 카드 다양하게 많은 게임은 높게 평하는 경우가 적습니다. 그 게임에 어떤 카드, 어떤 카드가 있는지 카드 다 잘 숙지한 경험자를, 익혔을 리 없는 초심자가 이기는 게 거의 안 되기 때문입니다. 그런 점이 완화된 일부 게임이 있는데, 에버델은 '조금' 완화됐지만(같은 카드가 복수 존재) 부족하다고 느꼈습니다.",
    "timestamp": 1758146400
  },
  {
    "username": "Esyhpe",
    "rating": 5.0,
    "comment": "+ all expansions\n+ Kickstarter",
    "timestamp": 1758060000
  },
  {
    "username": "MrTim94",
    "rating": 5.0,
    "comment": "Nice worker placement game with a cozy theme. It can be a bit intimidating at first, but after a few plays flows very nicely. In my experience, it can feel a little swingy though (if you don’t start off with any good production cards in your hand or the meadow, it can be difficult to recover). The resource pieces are also very well made and are nice to hold. Overall enjoy playing, not sure if I enjoy it enough to get the (pricey) expansions too.",
    "timestamp": 1756591200
  },
  {
    "username": "skipboris",
    "rating": 5.0,
    "comment": "Beautiful chewy deck builder meets worker placement with nearly non-existent player interaction.",
    "timestamp": 1754517600
  },
  {
    "username": "Hieken",
    "rating": 5.0,
    "comment": "Pretty. But if arbitrariness has a name, it's probably Everdell.",
    "timestamp": 1753308000
  },
  {
    "username": "kurtrussell",
    "rating": 5.0,
    "comment": "They focused too much on the theming and not enough on the gameplay. Base doesn't feel very strategically diverse.",
    "timestamp": 1752444000
  },
  {
    "username": "Sagrilarus",
    "rating": 5.0,
    "comment": "The game is fine. It’s a solid vanilla play, with lots and lots of actions.\n\nFelt like labor to me, but the worker placement part wasn’t too onerous in it.\n\nDidn’t see anything particularly innovative to it.",
    "timestamp": 1750370400
  },
  {
    "username": "purplecow55",
    "rating": 5.0,
    "comment": "A tableau card builder where players play across 4 rounds to create a 3x5 grid of cards to score the most points. Turns consist of placing a worker, building a card, upgrading a card into the next level, or passing into the next round. Player with the most points wins.\nThis game depends greatly on cards players have initially. If they synergies well, their game will be great. If they don't, players are going to need to 'fish' for more cards, wasting game time.",
    "timestamp": 1750024800
  },
  {
    "username": "TheSlov",
    "rating": 5.0,
    "comment": "I don't get why everyone loves this game, the way the cards can come out is completely random and you may just be setting up another player for success. Maybe the expansions give the game a better balance or feel but my 2 plays of this were pretty meh. Lots of upkeep, not a lot of interesting choices to make. I think there are more satisfying engine builders and resource management games than this. I guess the animal theme is cute and uber appealing but as I grow older in the hobby I enjoy interesting strategies, mechanism depth and complexity, and \"fun\", whatever that is.",
    "timestamp": 1749160800
  },
  {
    "username": "Alxz21",
    "rating": 5.0,
    "comment": "sell 600",
    "timestamp": 1748383200
  },
  {
    "username": "LorenSztajer",
    "rating": 5.0,
    "comment": "No amount of clever game play can overcome the piece of crap that is the Evertree. It broke during first assembly. And who designs a game with a fragile component that will NEVER go back in the box? I hate this game for costing $30 more than it should for a ridiculous novelty component. Gameplay is mediocre at best. Expansions cost as much as the base game. I regret this purchase.",
    "timestamp": 1748124000
  },
  {
    "username": "FikaPika",
    "rating": 5.0,
    "comment": "Like the art, but it didn't \"klick\"",
    "timestamp": 1747605600
  },
  {
    "username": "eladnl",
    "rating": 5.0,
    "comment": "A regular economic and resource management game, themed after a forest location. Lack of direct conflict makes it a bit boring and repetitive. OKish - not more than that, and quite boring. Nothing to master...",
    "timestamp": 1746914400
  },
  {
    "username": "missmemuch",
    "rating": 5.0,
    "comment": "Zulu Bazaar 4-19-25",
    "timestamp": 1745877600
  },
  {
    "username": "TyDeL",
    "rating": 4.5,
    "comment": "I have to accept that I'm an outlier on this one, which I feel doesn't happen too often, 7 Wonders being another, which is notable because this game feels a bit like \"7 Wonders the Worker Placement Game\" to me. I guess I just don't find minor card combos and complete luck of the draw engaging. The game is undeniably attractive and appealing, to the point of overproduction. I absolutely love the theme and the loose round structure. It's just not the type of gameplay that engages me.",
    "timestamp": 1744840800
  },
  {
    "username": "allwaygo",
    "rating": 5.0,
    "comment": "Cute worker placement tableau builder. There's decent replayability due to the the big deck of cards, variable forest cards and special event cards. 2 or 3 players is best, with it being very tight and a little frustrating at 4 players.\n\nBeing in a different season than your fellow players is theme-breaking and kind of odd. Tree is too big.",
    "timestamp": 1744322400
  },
  {
    "username": "LiverpoolYNWA",
    "rating": 5.0,
    "comment": "Okay so far.",
    "timestamp": 1741215600
  },
  {
    "username": "guacamolen",
    "rating": 5.2,
    "comment": "Not a bad game, but I think the art direction and component quality are the main reason why this gets the praise that it does.",
    "timestamp": 1740178800
  },
  {
    "username": "jens_hoppe",
    "rating": 5.0,
    "comment": "A very ... bland, by-the-numbers worker placement / resource gathering / card playing game, with nothing that really stands out, and only made palatable by cute animal pictures.\n\nThere is also almost no interaction, meaning it's a \"fixed fun\" game, which I guess is why it's so popular with two players.\n\nThe components are mostly overdone: The cardboard tree is stupid, the card layout emphasises pretty pictures over usability.",
    "timestamp": 1739919600
  },
  {
    "username": "Geekishgamer",
    "rating": 5.0,
    "comment": "The game looks very nice. I really love the theme, and I wanted to love the game because it just looks so good! But I found the gameplay to be lacking. You have to play it a few times to start to understand what combos of cards to be looking for and using to build your tableau. Once you figure that out, it seems that allot of the same combo's keep happening. There also weren't any exciting big moments in the game. It feels very solitaire like just building your tableau. I really wanted to love this game, but I ended up selling it.",
    "timestamp": 1739487600
  },
  {
    "username": "skipaoff",
    "rating": 5.0,
    "comment": "не знаю какой бездарь это балансировал, но художник и дизайнер очень хороши\nбольные комбо, несбалансированные карты но в милом и красивом сетинге",
    "timestamp": 1739142000
  },
  {
    "username": "jcarvin",
    "rating": 5.3,
    "comment": "After my first play, this just seems like a basic worker placement/tableau builder game. I'm not sure what the hype is about, but maybe a very more plays will bear that out.",
    "timestamp": 1738623600
  },
  {
    "username": "psrx",
    "rating": 5.0,
    "comment": "Played once, didn't hate it but don't want to play it again.",
    "timestamp": 1737586800
  },
  {
    "username": "samgeorgemoore",
    "rating": 5.0,
    "comment": "Not my favourite worker placement game by any means - felt a bit too limiting in terms of hand and resource management.",
    "timestamp": 1737586800
  },
  {
    "username": "jdvanwijk",
    "rating": 5.0,
    "comment": "Not bad, but gameplay-wise decidedly average. Surprised to see it up so high in the top 100.",
    "timestamp": 1737154800
  },
  {
    "username": "bazyliszek10000",
    "rating": 5.0,
    "comment": "The game is too complicated for what it offers. There are cards with text everywhere. On the tasks, in the places, there are a lot of cards with text that should be remembered, because we want to actively use these cards and places. Access to the cards is made more difficult for more people. We have the cards at home, in the meadow in front of us, etc.. it's a disaster. This is not compensated by the gameplay, because despite the cards in the hand and on the board, randomness is very high. At the beginning you may have perfect cards, other people may be blocked, etc.\nAnother disadvantage is the tree, which cannot be stored in the box after folding and unfolding, it breaks down after folding and unfolding, and above all, it is unnecessary, inconvenient/clunky, it adds nothing to the game and only gets in the way when something falls off it.\nThere is no strategy here, this game is so random that even if you plan something at the beginning of the round, when it is your turn, there may be nothing left of your plans. The cards have changed, the fields have been occupied, if you wait for some related cards, they may never appear. This game supposedly requires thinking, but you can't plan anything, it's pure randomness.\nThe game attracts attention, with a nice appearance and nice workmanship, that's all it takes, the inconvenience of the tree, random cards, problems with card handling, etc. I don't understand the phenomenon of this game at all. I think it might be the price. The game may be sold as a medium-sized, nicely made family game, at a good price, for people who do not pay much attention to randomness and are more focused on doing something with their family, even if it is unbalanced, random, etc..",
    "timestamp": 1735772400
  },
  {
    "username": "Desiderata",
    "rating": 5.0,
    "comment": "Cute forest critters theme. Draft buildings and critters to play onto your tableau. Different sets can earn you goals worth VPs. Cards are also worth points. Worker placement mechanic in order to do any action other than playing a card from your hand. Some cards make other cards free (i.e. the Farm allows for the free play of a Man/Woman critter); otherwise, all cards have a resource cost.\n\nStrange timing in that some players can end their season well before others, leaving those players waiting for several turns. A lot of luck in the cards that come out and what you get in your opening hand and random draws.",
    "timestamp": 1735599600
  },
  {
    "username": "opks22",
    "rating": 5.0,
    "comment": "*Collector's Edition - but for some reason, this one has its own entry.",
    "timestamp": 1733785200
  },
  {
    "username": "oriad",
    "rating": 5.0,
    "comment": "context and artwork of the game are great .\n\nHowever i find the game not enough complex and to much luck involved.\nAlso the first part of the game is quite slow to setup and somehow unbalanced with the end.\n\nI would not reccomend to own but to play with friends if they have",
    "timestamp": 1733526000
  },
  {
    "username": "JotWu",
    "rating": 5.0,
    "comment": "Great art, but luck of the draw and way animals combo with buildings is just awful. Having card bound so strongly to only single other card is major turnoff.",
    "timestamp": 1732921200
  },
  {
    "username": "ZeeDeveel",
    "rating": 5.0,
    "comment": "51st State with squirrels.\n\nLooks beautiful. I have no desire to play this again.\n\nGeeky combo building, currency exchange game with squirrels? I'm not sure who the target audience is.\n\nMy friends would rather play a game not about squirrels and my significant other would rather play a game not about turning small wooden cubes into different coloured wooden cubes.",
    "timestamp": 1731884400
  },
  {
    "username": "LinneasCabal",
    "rating": 5.0,
    "comment": "This game is very cute and has great components, but I find that there are other engine/tableau builders that I much prefer. The goals feel very lucky because with such a large deck the likelihood of getting the card you need isn't great. This is one that looked pretty on my shelf, but I never grabbed for it. It will likely be leaving my collection soon.",
    "timestamp": 1731538800
  },
  {
    "username": "Ving",
    "rating": 5.0,
    "comment": "Trade: Collector's edition with sleeve. The tree has some slight damage but has been taped.",
    "timestamp": 1728338400
  },
  {
    "username": "wiblick",
    "rating": 5.0,
    "comment": "Not for me - gave to a friend, have the app if I feel the need.",
    "timestamp": 1727733600
  },
  {
    "username": "Duke_Rufus",
    "rating": 5.0,
    "comment": "I have always wanted to run a commune of worker furries… until I played this.",
    "timestamp": 1727560800
  },
  {
    "username": "Joey_A",
    "rating": 5.0,
    "comment": "Average euro about collecting things and scoring VP.\n\nThat's it. There's literally nothing remarkable about this game, I just think they wanted to make a schmancy cardboard tree.",
    "timestamp": 1726610400
  },
  {
    "username": "marcomagno",
    "rating": 5.0,
    "comment": "Good components and artwork, but I didn't like the mechanics",
    "timestamp": 1726178400
  },
  {
    "username": "timkrysko",
    "rating": 5.0,
    "comment": "+ Pearlbrook\n+ Newleaf",
    "timestamp": 1725746400
  },
  {
    "username": "lowkeyloki",
    "rating": 5.0,
    "comment": "Meh, basic worker-placement part that never felt interesting. Too many choices and so you never feel that worry of being blocked on the board, which kinda ruins the point of a worker placement game.\n\nCard part is all right but feels random and the cards just aren't wacky enough. The effects are all kinda boring so you might get some resources or something, but you just kinda do the same thing all game. Cycle cards, get resources, buy cards, cycle cards, get resources, buy cards....",
    "timestamp": 1725141600
  },
  {
    "username": "Laoakai",
    "rating": 5.0,
    "comment": "Very punishing for new players and very swingy.\nI like the overall relaxing look and feel of the game, but the game mechanics are just mediocre in my opinion. There are a ton of different places to place your workers, some text is tiny and easily overlooked, many good combinations depend on purely luck to draw them, so It's kind of always start with any sort of engine and hope for the best. The special cards on the tree are very specific and if you work towards one of those, but another player finishes the same one turn before you, because of a lucky event of draws, you are left with nothing. In my first game this resulted in a net zero loss of 14 points and decided the game. Very unsatisfying for me. Will probably not play again.",
    "timestamp": 1724018400
  },
  {
    "username": "Icemasterq",
    "rating": 5.0,
    "comment": "No wonders, with pearls",
    "timestamp": 1724018400
  },
  {
    "username": "serafin88",
    "rating": 5.0,
    "comment": "Gra zalezna od kart",
    "timestamp": 1723586400
  },
  {
    "username": "wwalser",
    "rating": 5.0,
    "comment": "It could be the case that this \"wasn't for us\". But honestly I felt that it was simply bad.\n\nThe production is \"good\" in the Kickstarter meaning of \"good\". Realistically the company has had to iterate several times to fix their own choices in over-production. The tree is in the way… it just is. The early wooden logs rolled off the table. The card text is so small as to be unreadable for any distance and the game is designed to encourage you to read the text of other players cards. The game and its expansions cost much more than is justified by the quality of the game and the company has gone to great lengths to extract as much as possible from both their core fans and those weak to the hype cycle around the game. A behavior for which I don't blame them for but which I think consumers might be justifiably weary.\n\nWhat's more the core game mechanisms just don't come together that well in my opinion. There are whole features that simply don't play out in _most_ games. Card combinations that you might hunt for but probably won't find either because other players are incentivized to snipe them from you or because those cards simply don't show.",
    "timestamp": 1723154400
  },
  {
    "username": "ajaykrishnan123",
    "rating": 5.0,
    "comment": "SOLD",
    "timestamp": 1721685600
  },
  {
    "username": "Starwollf",
    "rating": 5.0,
    "comment": "Köpt beg 21 maj 2023. 400kr",
    "timestamp": 1721080800
  },
  {
    "username": "jaceycole",
    "rating": 5.0,
    "comment": "If you like wingspan you will like this game, if you don't, then you won't. I dislike both. Lots of downtime, minimal interaction, too much card draw luck, different game end times, too long for what it is. For what it's worth, I don't think I really like tableau building games. So much card text to read and internalize. Very difficult to see what cards others have, which is a problem because you're supposed to interaction with their cards. I think this game would be better as just a straight up drafting game, getting rid of the worker placement and seasonal components.",
    "timestamp": 1719352800
  },
  {
    "username": "Oezz",
    "rating": 5.0,
    "comment": "With such limited worker numbers it's hard to believe you can build a full town, but it happens. It's satisfying chaining the cards together and picking up freebies. Art is cute and components are great. Leans slightly too hard into the randomness of the draw deck. Not that much interaction. Tree is annoying rather than wow factor.",
    "timestamp": 1719180000
  },
  {
    "username": "saoneal",
    "rating": 5.0,
    "comment": "This isn't clicking, but I definitely want to try it more. I don't feel the tableau-building thrill like I do in something more focused like Race for the Galaxy, and the worker placement is pretty pedestrian. The first turns feel bafflingly short and aimless, the round system is needlessly at odds with the theme, and some graphic design issues make keeping track of the available goals more trouble than they should be.\nAnd yet I can't help but wonder if I'm trying to engage with its strategies and decisions in a way it wasn't designed for. For now, 3 of the 5 stars are for the rubber berries.",
    "timestamp": 1718661600
  },
  {
    "username": "BGGHannah",
    "rating": 5.0,
    "comment": "I feel like Everdell is just alright for me, I think the game takes up so much room on my table and the set up isnt really worth the game play most of the time! I have all the expansions but havent played most of them yet so I am excited to see what they bring the game",
    "timestamp": 1718661600
  },
  {
    "username": "Khumbanigash",
    "rating": 5.0,
    "comment": "Don't get the hype. Maybe need to play this more often, but currently see no reason to play Everdell again. It looks great, but the game-play loop didn't convince.",
    "timestamp": 1717884000
  },
  {
    "username": "ispaghet",
    "rating": 5.0,
    "comment": "Pretty but dull. Apparently the expansions make it better, and Farshore is a mild improvement, but the whole thing just seems a bit pointless.",
    "timestamp": 1717538400
  },
  {
    "username": "Starcadian",
    "rating": 5.0,
    "comment": "Really fun game. Starts disappointingly slow, but then builds to a crescendo at the end. The theme helps the game a lot. There's certainly a luck element in how the cards come out, but you can usually construct a strategy with what you're provided. Works great with two players.\n\nEdit: Just never got it to the table. It's got to go.",
    "timestamp": 1716501600
  },
  {
    "username": "Doverkeen",
    "rating": 5.0,
    "comment": "Cute theme, a bit to long for what it does, esp. with new players and once you know the deck you know the deck. Makes you feel like you need expensions which I dont like very much.",
    "timestamp": 1716156000
  },
  {
    "username": "troylow",
    "rating": 5.0,
    "comment": "+ Cute art and nice meeples\n+ Nice theme\n\n- High amount of luck\n- Cards with huge amounts of text everywhere. Too much text, too much info strewn every where.\n- Difficult to parse what other players are doing because their tableu are made of cards with huge amounts of text.\n\nWould only ever play test at 2/3 due to the huge amount of text and info i have to parse every turn",
    "timestamp": 1714514400
  },
  {
    "username": "SittingGeorge",
    "rating": 5.0,
    "comment": "Had a lot of fun with this at first. After experiencing a lot of other games, I can kind of see that this one doesn't do anything special. The art has its charm, but otherwise there are other games that do pretty much everything this game does better. In terms of feel, I'd describe it as a way more boring Race for the Galaxy - the worker placement doesn't feel \"necessary\" per se and there are way less interesting decisions for the time spent playing this game.\n\nStill, it has its charm, and it is very approachable! I do sometimes like coming back to it for its familiarity and comfort. I think it's a really good way to introduce players to several mechanisms. It's not punishing and is at least mildly pleasant.\n\nOnly expansion I've tried is Spirecrest. Got rid of that; we both felt like it actively made the game worse. The game is fine as is.",
    "timestamp": 1710543600
  },
  {
    "username": "Var_Kenarah",
    "rating": 5.0,
    "comment": "D",
    "timestamp": 1710111600
  },
  {
    "username": "Gola",
    "rating": 5.0,
    "comment": "One play with three, one with four.\n\nWorker placement with overwhelming number of options: CHECK\nAt least four currencies: CHECK\nComplicated personal tableau with different bonus on every card: CHECK\nAll about lucking into card combos: CHECK\nNot even one new idea: CHECK\n\nYep, it's a Kickstarter game from 2018.",
    "timestamp": 1709938800
  },
  {
    "username": "RagTiger",
    "rating": 5.0,
    "comment": "- Mediocre gameplay and game mechanics. There is really nothing interesting going on here.\n- Absolutely unneccessary \"giant tree\" that blocks the view\n- The card anatomy is poor and often annoying: there are a *lot* of very miniscule text on the cards that is barel legible. There are confusing elements too, eg. the action spots that are available/not available for other players\n--> because of this, if you do not know the card, the game will be very long (way too long for what it can offer)\n- Poorly constructed rulebook (e.g. the \"detailed\" card clarifications answered none of our questions)\n- The artwork on the cards is beautiful and cute but this alone cannot save this game.",
    "timestamp": 1707606000
  },
  {
    "username": "multi987",
    "rating": 5.0,
    "comment": "Give it another chance?",
    "timestamp": 1707519600
  },
  {
    "username": "TOOMUCHGOOD",
    "rating": 5.0,
    "comment": "Need to play it more but it looks great.",
    "timestamp": 1707260400
  },
  {
    "username": "Zhukov3945",
    "rating": 6.0,
    "comment": "KS",
    "timestamp": 1762210800
  },
  {
    "username": "sparkgamer",
    "rating": 6.0,
    "comment": "Sold to reduce the size of the library and simplify an upcoming move. We found the game landed a little flat for us. It's a good game, but it didn’t make us feel like coming back to it.",
    "timestamp": 1762038000
  },
  {
    "username": "mimiwo",
    "rating": 6.0,
    "comment": "Seemed overly complicated for what ended up happening, but maybe just need to play more",
    "timestamp": 1762038000
  },
  {
    "username": "mantler",
    "rating": 6.0,
    "comment": "A bit to luck depending on what cards show up. There are far better cards than others and distribution in deck depends in luck if someone gets the cards that combo well and that will decide the win\nFurther the game drags in higher player counts and overstays it's welcome then",
    "timestamp": 1761865200
  },
  {
    "username": "greetingsfrombergen",
    "rating": 6.0,
    "comment": "NOK 310",
    "timestamp": 1761778800
  },
  {
    "username": "Doogiesham",
    "rating": 6.0,
    "comment": "My go-to for a simple worker placement game to introduce the concept. It’s really pretty and has amazing components and table-presence. This is a great one to introduce to new gamers",
    "timestamp": 1761084000
  },
  {
    "username": "Dreadnaut87",
    "rating": 6.0,
    "comment": "Great art, cozy game. Too much tiny text on cards leads to analysis paralysis if you really want to win.",
    "timestamp": 1760997600
  },
  {
    "username": "Spiderman11",
    "rating": 6.0,
    "comment": "I would define this as a classic euro. Would definitely recommend as a first game for someone. Can be very nice experience for beginner or more casual gamers. I am not a big fan as I am lacking more depth and complexity to this game.",
    "timestamp": 1760738400
  },
  {
    "username": "TiagoBonamigo",
    "rating": 6.0,
    "comment": "Somehow this game never worked well with us. I find it tight and somewhat unfulfilling.",
    "timestamp": 1760392800
  },
  {
    "username": "414448",
    "rating": 6.0,
    "comment": "Pleasant, simple game, but it doesn't lack substance. I'd much rather play this than Wingspan or Ticket to Ride, but I would never suggest it.",
    "timestamp": 1760220000
  },
  {
    "username": "metallicacello",
    "rating": 6.0,
    "comment": "spoken for in BGG.Con Math Trade",
    "timestamp": 1760047200
  },
  {
    "username": "piofernix",
    "rating": 6.0,
    "comment": "2-4 Players",
    "timestamp": 1759788000
  },
  {
    "username": "Avid_Equinox",
    "rating": 6.0,
    "comment": "Ok Tableau Builder and resource-conversion style game",
    "timestamp": 1759528800
  },
  {
    "username": "tynaut2",
    "rating": 6.0,
    "comment": "I bought into the original hype of Everdell and despite the fact that it should have been a game I loved, I found the game rather frustrating, and not as exciting as I hoped. The irregularity of shapes in the board and tree are disorienting from a visual perspective. The graphic design overall is busy and hard to digest all at once on the table. The art and text on the cards is impossible to discern, without picking up every card as it's revealed to read, or play the game so many times you have everything memorized. All of the visual distractions and messiness lead to making the game feel way more drawn out than it should be.",
    "timestamp": 1758751200
  },
  {
    "username": "zerotwoeoto",
    "rating": 6.0,
    "comment": "It is beautifull, but it is a regular game.",
    "timestamp": 1758664800
  },
  {
    "username": "LittleDuke",
    "rating": 6.0,
    "comment": "Simple, really easy to pick up and play. Delightful pieces. Cards are hard to read from across the table, but a little experience solves that. It gets a little solitaire-y, and in general its mechanics are done better in different games. Great for playing with inexperienced gamers though.",
    "timestamp": 1758492000
  },
  {
    "username": "Lethism",
    "rating": 6.0,
    "comment": "Krótkie przedstawienie zasad:\n[ANG] https://youtu.be/vG_MBpe8lnA (3 min)\n[PL] (x min)",
    "timestamp": 1757887200
  },
  {
    "username": "Mageknight12",
    "rating": 6.0,
    "comment": "Everdell has stunning artwork, but the gameplay can feel unbalanced and luck-heavy. Poor card draws early on can ruin your engine, and the worker placement lacks real tension.",
    "timestamp": 1757023200
  },
  {
    "username": "pralat",
    "rating": 6.0,
    "comment": "A worker placement tableau builder with very limited player interaction and beautiful artwork.",
    "timestamp": 1756591200
  },
  {
    "username": "MotleyZoo",
    "rating": 6.0,
    "comment": "The art is stunning, and the physical game is exceptionally well-made. However, the pacing makes it a slog. Like many resource-based games, Everdell suffers from a severe case of analysis paralysis. While the review says 40-80 minutes, don't be surprised if a game turns into a 3-hour affair where each player spends most of the time waiting for others.",
    "timestamp": 1755986400
  },
  {
    "username": "Thegooddoc_help",
    "rating": 6.0,
    "comment": "This game has a lot of neat mechanics, but I can't help to feel that for every thing this game does well, another game just does it way better.\n\nThe 3D tree is sick though",
    "timestamp": 1755900000
  },
  {
    "username": "bearybottoms",
    "rating": 6.0,
    "comment": "0.21 got it",
    "timestamp": 1754690400
  },
  {
    "username": "ErsinA",
    "rating": 5.5,
    "comment": "Mechanics are too bland and boring. Worker placement is not interesting. Card play is just meh. I do not understand the hype around this game.",
    "timestamp": 1753653600
  },
  {
    "username": "ztam",
    "rating": 5.5,
    "comment": "1 play so far at 2 people but a huge deception\nI had huge expectations and it felt flat... No getting the buzz\nWill wait a couple of game of the farshore edition to make my mind.\nGame is beautiful but i dont care for that as once again it proves to be cumbersome more than anything. (Looking at you CoB deluxe vs old brown box)\n\nI see where this is going with combos and ressources management, but i discovered Everdell at the same time as Lorenzo il magnifico, and the latter makes me wanna play another one.",
    "timestamp": 1753567200
  },
  {
    "username": "Koert",
    "rating": 6.0,
    "comment": "Fancy card game with a mix of mechanisms. Less my kind of game.",
    "timestamp": 1753308000
  },
  {
    "username": "allkindsofgains",
    "rating": 6.0,
    "comment": "Everdell is undeniably adorable. The woodland critter theme is consistently illustrated and visually charming, with lovely card art and whimsical components. But once you look past the cute veneer, the theme feels fairly generic. It’s essentially humans in animal form. The anthropomorphism comes off more as a cosmetic layer than a deeply integrated world. The 3D tree, while eye-catching on the table, is clunky to use and annoying to store.\n\nAs an engine builder, it’s okay. Some satisfying combos can emerge, but after 4 or 5 plays, it still hasn’t fully clicked. The core gameplay often feels restrictive, with tight limits on resources, cards in hand, and city space. Instead of enjoying the process of building something, you’re mostly working around constraints.\n\nThe rulebook doesn’t help either. It’s padded with thematic fluff but lacks clarity, and I had to Google several mechanics that should have been straightforward. To make matters worse, my copy arrived without the solo mode dice, and the rulebook binding started falling apart after just two sessions. While the game looks premium at first glance, I’m not confident in its long-term production quality.",
    "timestamp": 1753048800
  },
  {
    "username": "Sorp222",
    "rating": 6.0,
    "comment": "Cute production and mechanics borrowed from many other games - worker placement, cards you play from hand/from a central selection, resource conversion, use other players cards..free placement if in a chain..(Agricola, Le Havre, & wonders duel)..\nMain plus (for me) is that it does not go on forever, but still very much own tableau with only competition around getting the common objectives. I quite like the season timing with players being at different stages and the cute artwork makes a change from the ubiqutous sad medieval dudes. Glad to have tried it and would be happy to play again.",
    "timestamp": 1753048800
  },
  {
    "username": "Krisspear",
    "rating": 6.0,
    "comment": "Cute and versatile worker placement/ plateu builder. I'd play it again, but I feel like it gets kind of old within a playthrough. Looks nice and has variety on setup and locations, but the rounds felt a bit samey to me.\n\nI dislike how of some players will go faster into the next season, but maybe there is some thematic reasoning that I didn't catch. Interesting twist, but it didn't land for me thematically.",
    "timestamp": 1752616800
  },
  {
    "username": "MaureenBrg",
    "rating": 6.0,
    "comment": "Jolie, beau matériel, mais très répétitif même avec les extensions.",
    "timestamp": 1752616800
  },
  {
    "username": "willbeplayin",
    "rating": 6.0,
    "comment": "Solid game. Can't say much else.",
    "timestamp": 1751839200
  },
  {
    "username": "jeremysprofile",
    "rating": 6.0,
    "comment": "Cute tableau & engine builder. Surprisingly easy to optimize provided a few card draws, but each card is common enough that multiple people can develop the broken engine. Suffers from the abundance of choice and the broken build taking a long time to plan, especially for first timers. Overall, too long for the enjoyment it brings.",
    "timestamp": 1750629600
  },
  {
    "username": "willynill",
    "rating": 6.0,
    "comment": "Similar issue to Wingspan, but more pronounced, I think. It feels like everyone is doing their own thing. You don't care about what anyone else is doing. Ultimately, it's as if you were playing by yourself. Needs more ways to make the player feel invested in the other players.",
    "timestamp": 1749506400
  },
  {
    "username": "EnzyMnd",
    "rating": 6.0,
    "comment": "Los materiales son un mil, pero por alguna razón, no logra convencerme. Sale muy poco a mesa.",
    "timestamp": 1749247200
  },
  {
    "username": "couchlife",
    "rating": 6.0,
    "comment": "Everdell feels focus-tested to appeal to modern board gamer sensibilities - no rough edges, no real bad feelings, but nothing really exciting or joyous here. Worker placement into personal tableau feels like purgatory.\n\n05/29/25\n\nOwned but not in BGG collection - Molly bought and Molly wants.",
    "timestamp": 1749160800
  },
  {
    "username": "ChaosFarseer",
    "rating": 6.0,
    "comment": "Everdell doesn't work for me. The art and components are beautiful, but it feels a bit longer than I'd like. The final season is like the length of the rest of the game combined. It's been a while since I played and so I don't remember exactly why the mechanics didn't grip me, especially towards the end, but the impression stays.",
    "timestamp": 1748642400
  },
  {
    "username": "Folofl",
    "rating": 6.0,
    "comment": "*** DIGITAL ONLY ***\nGets super stale without expansions.",
    "timestamp": 1748210400
  },
  {
    "username": "bowdy",
    "rating": 6.0,
    "comment": "Decent card engine game with worker placement mix",
    "timestamp": 1747951200
  },
  {
    "username": "Korrun",
    "rating": 6.0,
    "comment": "Original rating: 7.5 (2023)\n\nNice art. Too much time spent reading cards. Overstays its welcome. The small amount of player interaction wasn't interesting.",
    "timestamp": 1747864800
  },
  {
    "username": "FamilySmile",
    "rating": 6.0,
    "comment": "SOLO PLAYING: I bought this for the hype, gorgeous artwork and beautiful concept. Honestly, it's just the usual tableau building game. The solo version is challenging enough, but there's too much randomness (e.g. especially when drawing cards to achieve events from the tree) and it feels like it wants you to combine cards but without allowing you to get the resources for it (!). I haven't played the Mistwood expansion yet, but it's on my list (hopefully, it will be more satisfying...).",
    "timestamp": 1747432800
  },
  {
    "username": "col_forbin",
    "rating": 6.0,
    "comment": "Great intro to worker placement. If there was a little less luck in the card drawing it would be a favorite. As it is, it is one of my family's favorite games and I'm happy to keep playing it with them.",
    "timestamp": 1746828000
  },
  {
    "username": "nhlln",
    "rating": 6.0,
    "comment": "Unsleeved, on purpose",
    "timestamp": 1746655200
  },
  {
    "username": "Grumpug",
    "rating": 6.0,
    "comment": "Players: 1-4 [3]",
    "timestamp": 1746568800
  },
  {
    "username": "PlayingMonkey",
    "rating": 6.0,
    "comment": "Played only once so I will give it another chance if a friend really wants to play. Finding synergies between critters and locations felt very limited and therefore not satisfying. The open market remained almost the same the entire game. It was difficult to understand how some of the cards work and the confusion was not cleared by the rulebook. I didn't like that players can be in different seasons at the same time and finish the game at different times.",
    "timestamp": 1745791200
  },
  {
    "username": "BGMarc",
    "rating": 6.0,
    "comment": "What is it that i can't see/feel? Yes, perfect artwork, but the rest is average worker-placement.",
    "timestamp": 1745532000
  },
  {
    "username": "sykano",
    "rating": 5.8,
    "comment": "card-based tableaux building game with anthropomorphic woodland critters theme\ncard play with some worker placement\ncute theme, although too childish for my taste\nbasic idea is good, but could be done better\noverrated\n\n+ mechanics\n+ cute wooden critter pieces, some artworks\n- childish theme\n- odd mix of card game and worker placement (with spots all over the place)\n- very fiddly\n- almost multiplayer solitaire\n- odd clunky/bulky 3D board, totally unnecessary (!), even the 2D board is cumbersome\n- artworks could be better\n- text on cards too small\n- could be done better\n- luck-dependent\n- balancing issues (swingy effects, some cards mostly useless)\n- heavily card-based (sleeves necessary)\n- oddly overproduced components that on the whole don't look superior or premium (!)\n- very expensive, especially for what it is, and even more so the expansions (!), very overcosted\n\nI would basically never use that 3D tree. It's completely unnecessary, ugly and in the way.\n\nFor some reason a lot of the cards don't seem that thematic to me.\n\nIt would probably be way better if there weren't duplicates of a lot (all?) cards. It's more interesting to have small variations for cards that serve basically the same function.\nAlso, the fixed combinations of building to its critter become boring fast.",
    "timestamp": 1745445600
  },
  {
    "username": "DoubleMintDave",
    "rating": 6.0,
    "comment": "Fun but it feels like it could have been more.",
    "timestamp": 1744840800
  },
  {
    "username": "Jamesmcm84",
    "rating": 6.0,
    "comment": "-SOLO",
    "timestamp": 1744754400
  },
  {
    "username": "Michele F",
    "rating": 6.0,
    "comment": "Beau jeu\n\nArbre un peu embarrassant.",
    "timestamp": 1744581600
  },
  {
    "username": "beep_beep",
    "rating": 6.0,
    "comment": "Charming design and delightful components. The combination of tableau building and worker placement is enjoyable enough, but it's certainly not a thrill a minute. More challenging and interactive at higher player counts, but then there's too much downtime. If I want a cozy, low-stakes multiplayer solitaire experience, I'm probably reaching for Wingspan (with the Oceania expansion).",
    "timestamp": 1744495200
  },
  {
    "username": "black_daveth",
    "rating": 6.0,
    "comment": "The worker placement to collect resources is a massive fail, and a real drag in the game. Makes simple systems a real chore to work through and just comes across as an excuse to have a bunch of cute little resource tokens.",
    "timestamp": 1744495200
  },
  {
    "username": "No2Ross",
    "rating": 6.0,
    "comment": "People say this is a good introductory worker placement game but I believe they are mistaken.\n\nThe theme certainly makes it more approachable, but the gameplay itself is very restrictive, especially in the first phase of the game where you can accomplish almost nothing. That being said I do like it as a relatively quick two player game.\n\nWhile the production is overall very impressive (especially the different textured resources) the Evertree is perhaps the worst designed component in board game history and automatically loses the game a rating point for its existence.",
    "timestamp": 1743631200
  },
  {
    "username": "CaliforniaWinterTime",
    "rating": 6.0,
    "comment": "Cards as a town left me unsatisfied with an otherwise beautiful and mechanically sound game. I don't have a solution. Just wish my town felt more tangible or maybe converted into a \"top-looking-down\" view.",
    "timestamp": 1743631200
  },
  {
    "username": "Bryle",
    "rating": 5.5,
    "comment": "Bryle: 6\nDewey: 7\nSixtus: 7\nMario: 5.5\n\n+ Mechanically a fun and streamlined design\n+ Gorgeous Art and Components\n\n- Too reliant on lucky card draws especially at the game start\n- The resource management aspect of the game is too loose\n- Slightly too long for the amount of depth it offers\n- Provides very little reason to concern yourself with your opponents and their turns",
    "timestamp": 1743458400
  },
  {
    "username": "Walex",
    "rating": 6.0,
    "comment": "Czarek / Dawid / Ania",
    "timestamp": 1743289200
  },
  {
    "username": "phunter",
    "rating": 6.0,
    "comment": "66",
    "timestamp": 1742338800
  },
  {
    "username": "mayflowery",
    "rating": 6.0,
    "comment": "i remember this game being a lot more fun but the last few times i've played it have not been great. matching pairs of cards from that huge deck also does not feel great especially at lower player counts.",
    "timestamp": 1742338800
  },
  {
    "username": "noom777",
    "rating": 6.0,
    "comment": "Repetitive. It need expansions. The problem is, when I added expansions I lost my will to play even more when I bought the Big Box. In the end, I sold it.",
    "timestamp": 1741993200
  },
  {
    "username": "Laslow",
    "rating": 6.0,
    "comment": "Szép, a fát pillanatok alatt összerakom (max 10 másodperc, és szétszedni is max 10 másodperc), de valahogy ez nekem túl gyors, pillanatok alatt vége lesz, alig jutok bogyókhoz meg hasonlókhoz, nagyon kevésből játszom végig a játékot, ami bejön, rögtön el is megy valamire, és kicsit \"csak ennyi\" érzésem maradt utána.\nAzért vettem meg, mert már az ezredig kiegészítő jelent meg hozzá, és mert szeretni szokták az emberek, hát, gondoltam, kipróbálom én is. Kipróbáltam - nem az igazi. És nem szívesen bonyolítanám a kiegészítőkkel sem. Igazából nem értem a játék sikerét.",
    "timestamp": 1741906800
  },
  {
    "username": "RicardoRix",
    "rating": 6.0,
    "comment": "art, theme are 10/10\nThe gameplay is so-so. The concentration on quality over quantity is it's best feature. But too much reliance on combo's that likely never happen. You can't plan out anything, waiting for a card draw. So it largely falls to luck.",
    "timestamp": 1740178800
  },
  {
    "username": "LaBarberousse",
    "rating": 6.0,
    "comment": "Très belles illustrations et très beau matériels avec la version de base.\nJeu à divers stratégies et de gameplay.\nJe le trouve un peu trop charger en règles et en types d'effets qui peuvent être très variés (pour le meilleur ou le pire) pour la complexité du jeu.",
    "timestamp": 1739833200
  },
  {
    "username": "Speedstar91",
    "rating": 6.0,
    "comment": "I've played the game probably over 30 times and thoroughly enjoyed it. Seen everything, tried everything. I have owned the first add-on. Now I don't feel like playing this game anymore. I don't have this problem with \"race for the galaxy\", where you also build up a an engine, but in the later you have more options and the engine is more sophisticated. My personal rating has dropped from initially 9 to 6.",
    "timestamp": 1739487600
  },
  {
    "username": "raddar2213",
    "rating": 6.0,
    "comment": "Played a couple of times. Interesting card play, cute theme. But there are other games I'd rather play/own.",
    "timestamp": 1739142000
  },
  {
    "username": "ilikebowser",
    "rating": 6.5,
    "comment": "A beauty",
    "timestamp": 1762621200
  },
  {
    "username": "Tyson2337",
    "rating": 7.0,
    "comment": "Good game, think it will be better with one of the many expansions",
    "timestamp": 1762470000
  },
  {
    "username": "hairysoup",
    "rating": 7.3,
    "comment": "With New Leaf expansion in box.\n\nEverdell is awkward in that it's not a heavy worker placement game and should be easy to teach, but because of the unique nature of the cards and how they can be strung together it creates a lot of AP with new players and can be very slow.\n\nGorgeous production, but the unnecessarily large table presence isn't exactly a positive.\n\nLove playing this game with experienced players, and New Leaf helps add a lot more scoring elements and flushing of the market without adding much more playtime.\n\nEdit: Prefer to now pull out Everdell Duo for quick games.",
    "timestamp": 1762297200
  },
  {
    "username": "zingano",
    "rating": 7.0,
    "comment": "Yummy pieces. Less our thing these days?",
    "timestamp": 1762124400
  },
  {
    "username": "mamwee",
    "rating": 7.0,
    "comment": "deluxe",
    "timestamp": 1762124400
  },
  {
    "username": "shammois",
    "rating": 6.5,
    "comment": "Surprised by the high rating to be honest because underneath the slightly cutesy theme there's nothing mechanically here that's new. Gather resources with workers, pay them to 'build' cards, the winner will be the one who best combines cards together - with the caveat that luck can play a big part in what cards you're able to build.\n\nAll that said though, Everdell does what it does pretty well, offering small ways to mitigate that luck of the draw and crucially, not outstaying its welcome (as long as you're not playing with the AP-prone). So whilst it doesn't do anything special, it's still an enjoyable game. And it does look very nice too, if you don't mind the fact the board's not hugely functional - you might well end up peering around a cardboard tree.",
    "timestamp": 1762038000
  },
  {
    "username": "GoldenOlaf",
    "rating": 7.0,
    "comment": "App",
    "timestamp": 1761865200
  },
  {
    "username": "Eugeniosaracino",
    "rating": 7.0,
    "comment": "Esp) Funciona bien pero me molesta la sobreproducción del juego.",
    "timestamp": 1761778800
  },
  {
    "username": "rongbeo93",
    "rating": 6.5,
    "comment": "Surprisingly, with all the hype surrounding it, I think Everdell is just an okay game. The designer tries to blend multiple mechanics—worker placement, tableau building, drafting, and hand management—which ends up making it feel a bit more complicated than it needs to be. While everything works mechanically and I do love the adorable woodland theme and top-tier production, the gameplay itself always feels a bit underwhelming. The combos aren’t particularly satisfying, the turn structure feels slightly off, and for a tableau-building game, being limited to just 15 cards feels restrictive. Overall, it’s a solid game with great presentation, but it falls short of its reputation and isn’t one of my favorites.",
    "timestamp": 1761692400
  },
  {
    "username": "mhgregersen",
    "rating": 6.9,
    "comment": "Much better than I anticipated, must admit that I thought much of the hype was because of table presence. I was wrong...",
    "timestamp": 1761606000
  },
  {
    "username": "Harroguk",
    "rating": 7.0,
    "comment": "Upgraded to Big Box",
    "timestamp": 1761606000
  },
  {
    "username": "wdhenriksen1",
    "rating": 7.0,
    "comment": "As I've gotten older my rating has dropped. The print on the cards is too small.",
    "timestamp": 1761170400
  },
  {
    "username": "Ayanami77Ivy",
    "rating": 7.0,
    "comment": "Solid as a rock and plays smooth. I see why it's popular.",
    "timestamp": 1761170400
  },
  {
    "username": "Langalore",
    "rating": 7.0,
    "comment": "Collector's Edition",
    "timestamp": 1760997600
  },
  {
    "username": "McPixel",
    "rating": 7.0,
    "comment": "Collector edition",
    "timestamp": 1760997600
  },
  {
    "username": "lorex888",
    "rating": 6.5,
    "comment": "Glass Die Fall '24",
    "timestamp": 1760997600
  },
  {
    "username": "Twinge",
    "rating": 7.0,
    "comment": "I'm now thinking this style of engine-builder (see also: Ark Nova, Terraforming Mars...) is mostly capped at a 7.0/10 for me. The process is still enjoyable, but doesn't quite fit into my tastes.\n\nIt feels like I probably either want my combo-engine building to be more shortform (e.g. Dominion, Century: Spice Road), where there's less room for lame ducks and less need to know 80 different cards within a giant deck; OR as a single-player videogame, where I have more time to analyze and learn without my slow play frustrating other people or the awkward constant checking of what other people have built and such. (Something like Magic: The Gathering is also notably different with much of the engine decisions being made outside of play itself, and also being only 2-player.)",
    "timestamp": 1760911200
  },
  {
    "username": "MissP1ggy",
    "rating": 7.0,
    "comment": "Pretty and fun game.\nDutch rules summary: https://boardgamegeek.com/filepage/236792\n\nSolo variant: https://boardgamegeek.com/thread/2554285/2020-solomode-everd...",
    "timestamp": 1760911200
  },
  {
    "username": "AndrewRK",
    "rating": 7.0,
    "comment": "Pretty fun! Randomness is a pretty big part of the outcome but there is still plenty of decision space in the gameplay. Love the big tree.",
    "timestamp": 1760824800
  },
  {
    "username": "Garept",
    "rating": 6.5,
    "comment": "best 3 mid Victor",
    "timestamp": 1760565600
  },
  {
    "username": "Lapming1992",
    "rating": 7.0,
    "comment": "beautiful and fun game.",
    "timestamp": 1760306400
  },
  {
    "username": "SJS1971",
    "rating": 7.0,
    "comment": "Nice resource management game with the 7 Wonders mechanism that you can get some cards for free if you've got a prerequisite. The ability to play cards from your hand or from the board is also nice streamlining. Plays quick but still works as an engine builder.",
    "timestamp": 1760306400
  },
  {
    "username": "Olympian78",
    "rating": 7.0,
    "comment": "BGBSA, mid 2025",
    "timestamp": 1760220000
  },
  {
    "username": "Garwyx",
    "rating": 7.0,
    "comment": "Cool worker placement engine builder with a lovely theme, but too solitaire for my taste, choices are often ambiguous, and planning is difficult because cards may not appear",
    "timestamp": 1760047200
  },
  {
    "username": "ImZhe",
    "rating": 7.0,
    "comment": "Feel like this game shines more when players know the card pool and are able to plan future strategies around cards that will come up. The pool has issues in lower player counts since the cards won't get cycled frequently, and it's a bit strange how the worker placement works with different players being in different seasons.",
    "timestamp": 1759960800
  },
  {
    "username": "WadeB1977",
    "rating": 7.5,
    "comment": "Collector's Edition with Pearlbrook, Spirecrest, and Bellfaire expansions included. Played several times but in good condition. I printed a 3D insert to contain all three in the main box with only a tad of lidlift.",
    "timestamp": 1759874400
  },
  {
    "username": "lewelen",
    "rating": 7.0,
    "comment": "Cute art, good worker placement competition, average tableau building, and unique (but weirdly unsatisfying) timing mechanism driving efficiency. Strange physical design choices that delight (berries!) and bewilder (the tree). Epitome of a game carried on its cute animals, though I'm by no means immune from those charms.",
    "timestamp": 1759874400
  },
  {
    "username": "GrandPseudonym",
    "rating": 7.0,
    "comment": "Good with 2\nBest with 3\nGood with 4\n~60 Minutes\n~90 Minutes\nMediumweight\nCompetitive\nEuro\nGateway\nStrategy\nThematic\nTableau\nWorker Placement\nEconomy",
    "timestamp": 1759615200
  },
  {
    "username": "Nino_223",
    "rating": 7.0,
    "comment": "FAMILY\nWORKER PLACEMENT",
    "timestamp": 1759528800
  },
  {
    "username": "Aurion254",
    "rating": 6.5,
    "comment": "Having been reared on tales from the hedgerow, brambly hedge and then the Redwall saga, I so want to enjoy Everdell more than I actually do. Don't get me wrong, the game is wondefully produced, the artwork is stunning but the gameplay is just somewhat lacking for me. It's hard to put my finger on it, but I think it comes down to a lack of player interaction.",
    "timestamp": 1759183200
  },
  {
    "username": "Coopstrom",
    "rating": 7.0,
    "comment": "I would have gotten rid of this if the wife didn't like it so much",
    "timestamp": 1759183200
  },
  {
    "username": "thespaniardsteve",
    "rating": 8.0,
    "comment": "1-4, 2-3",
    "timestamp": 1762383600
  },
  {
    "username": "Auroric",
    "rating": 7.5,
    "comment": "Everdell is great. The production is stellar and brings new gamers to the table. Lots of variety in cards and tableaus allows for many different strategies, and building everything up feels very satisfying.\n\nHowever, the small card text is rough, making it genuinely difficult to see everything going on. It can also feel excessively combo based, where you're waiting for stagnant cards to rotate into cards you need a bit too often.",
    "timestamp": 1762210800
  },
  {
    "username": "Luiz_Struijk",
    "rating": 8.0,
    "comment": "I could use more trade options on the base game.",
    "timestamp": 1761778800
  },
  {
    "username": "Kater_Inna",
    "rating": 8.0,
    "comment": "3",
    "timestamp": 1761778800
  },
  {
    "username": "BrutusA",
    "rating": 8.0,
    "comment": "Aesthetic: 2\nMechanism: 2\nInvolvement/length/fluid: 1\nReplayability: 2\nOther: 1",
    "timestamp": 1761519600
  },
  {
    "username": "cslinxin",
    "rating": 8.0,
    "comment": "PC",
    "timestamp": 1761519600
  },
  {
    "username": "celenac",
    "rating": 8.0,
    "comment": "Great production. The artwork is nice and immersive, and I like how the resources have their own textures (rubber berries, acrylic resin, wood twigs, smooth pebbles).\n\nGreat and easy-to-understand iconography. The rulebook is easy to follow, but I think it could be a little more detailed. It wasn't clear off the bat what exactly we were supposed to do, which is to build a city to get as many points as we could. It required a playthrough to fully flesh out the details.\n\nDecent theme. Everything seems to flow well and tie together in an understandable way. The theme helps to understand the mechanisms well (e.g. each round represents a season; the card abilities make sense based on the critter/construction; a construction can house only one critter and when used to play a critter / add the critter to your city, you use a \"locked in / closed door\" token on the construction to indicate that that construction is occupied and can not be used to add another critter into the city for free; etc.).\n\nVery strategic and thinky. Feels like there'd be a lot of analysis paralysis and downtime waiting for people to think, so playing with 3+ players might result in a lot of waiting around. It does feel a bit like multiplayer solitaire, with most of the player interactions coming from blocking other players from getting a resource that they want. Players move at their own pace and progress through the seasons individually (they don't wait for all other players before starting the next season), which I thought would make things confusing, but when playing with 2 players, we found that we weren't ever more than 1 season apart from one another. We weren't completely in sync, but we were not far from one another ever.\n\nBecause there are only 4 seasons, just a handful of workers, and just 1 action per turn, the number of total actions you can play in a game feels limited, so I felt like I really needed to maximize my points in the limited number of actions that I had. Involves a lot of thinking through every possible thing to find the best thing to do that would gain the most points. There are a lot of things to think about: events, card combos, meadow cards (i.e. the cards laid out shown in public for display), etc. Involves a bit of reading (of the card abilities) to know your options. In general, involves keeping track of cards to get the best combination of cards to maximize points (as a result of the set collection mechanism).\n\nI think there's good replayability. There seems to be a lot of different cards in the deck and enough variability in setup that keeps each game feeling fresh. I can see how after a few plays (maybe like 4), the strategies and card combinations can start feeling the same, so expansions would really help keep each game feeling like a different experience.\n\nOverall, I like this game because of the theme and cozy artwork. I'd have to be in a certain mood to play -- one where I want to think a lot. It's a great game, but for me, it's just one in the mix of \"good game\" options. It doesn't stick out to me too much. I do like this game more than and think I'd choose to play this game over Wingspan because I think there's more player interaction and challenge.",
    "timestamp": 1761429600
  },
  {
    "username": "Malkoron",
    "rating": 8.0,
    "comment": "Kompetitiv\n+ Court of Approval Promo Cards",
    "timestamp": 1761429600
  },
  {
    "username": "VWildeboer",
    "rating": 8.0,
    "comment": "Love this game, but it is a lot more complicated than the cute art would have you think",
    "timestamp": 1761343200
  },
  {
    "username": "GrittyWillis",
    "rating": 8.0,
    "comment": "WIFE: 8\n\nVery unique, interesting game unlike any other game I have. Combines a lot of fun things and still isn't complex.",
    "timestamp": 1761343200
  },
  {
    "username": "grayzilla",
    "rating": 7.5,
    "comment": "Great condition!",
    "timestamp": 1761170400
  },
  {
    "username": "Amraam555",
    "rating": 8.0,
    "comment": "Game gets better as you learn the cards and plays. Not an easy beginner game but you can see the multiple strategies and how close the game can be. Some of the best art in a game and great theme and components. Great self-reward when you are able to extend you turn out.",
    "timestamp": 1760997600
  },
  {
    "username": "ErinTolles",
    "rating": 8.0,
    "comment": "Elaborate, takes a while.",
    "timestamp": 1760824800
  },
  {
    "username": "Beanreaper",
    "rating": 8.0,
    "comment": "Comfy, Chill, vibe. Fun game thats relaxing and goes by fast. Production is 10/10",
    "timestamp": 1760824800
  },
  {
    "username": "baileywitt3",
    "rating": 8.0,
    "comment": "I want to like this game as much as some of my friends, but it just seems to upset me more than it should. I like the worker placement aspect and being able to choose which cards to play and when, and the components are really cool. However, the player interaction is pretty low, and I never seem to find the powerful card combinations that other players get. There's also a lot of card text that you have to read and it slows the game down quite a bit. It's still a solid medium-weight strategy game, it just doesn't deliver as much fun on each play as I hoped.",
    "timestamp": 1760824800
  },
  {
    "username": "toinen",
    "rating": 8.0,
    "comment": "Easy t teach. The rules are quite straightforward. Understanding the card synergies might take a while. Really pretty game also",
    "timestamp": 1760738400
  },
  {
    "username": "StrongbowGold",
    "rating": 8.0,
    "comment": "C-4",
    "timestamp": 1760738400
  },
  {
    "username": "lulucasserole",
    "rating": 8.0,
    "comment": "A cozy forest-themed village-building/worker-placement game. The large cardboard tree that makes up part of the board makes this one feel unique. The seasonal round structure gives it a sense of unhurried progression. I'd definitely play again (but maybe with a larger table)!",
    "timestamp": 1760652000
  },
  {
    "username": "FlannelPants",
    "rating": 7.5,
    "comment": "Great quality parts and gorgeous parts. Not much player interaction but wonderful solo mode",
    "timestamp": 1760652000
  },
  {
    "username": "Tyiliyra",
    "rating": 7.5,
    "comment": "friend",
    "timestamp": 1760652000
  },
  {
    "username": "Dhole636",
    "rating": 8.0,
    "comment": "PC game",
    "timestamp": 1760479200
  },
  {
    "username": "Everybody_lies",
    "rating": 7.6,
    "comment": "E",
    "timestamp": 1760392800
  },
  {
    "username": "Pura_Vida",
    "rating": 8.0,
    "comment": "Look and feel is great. Gameplay is nice. Sometimes you can feel a little stuck with the cards, especially in twoplayer games, but most of the times you can squeeze out some nice combo's.",
    "timestamp": 1760392800
  },
  {
    "username": "Tob1One",
    "rating": 7.5,
    "comment": "Plusy:\n+ pięknie wykonana gra. Jedna z najładniejszych - wygląda obłędnie:\ndrewniane meeple\npiękne ilustracje kart - to trzeba podkreślić\njakość wykonania elementów - zwłaszcza jagody\n+ worker playsment, którego szybko można się nauczyć\n+ synergie między kartami\n+ ilość kart jest spora, dzięki czemu rozgrywka jest urozmaicona\n+ łatwa do nauki, choć potrzebne jest kilka partii by wiedzieć jakie karty mają synergię\n+ wypraska - może szczegół, ale mając już sporo gier, to się na to zwraca uwagę\n\nMinus:\n- duża ilość kart, ale czym dłużej się gra, tym bardziej odczuwa się ich powtarzalność i przydałby się dodatek (a te są za drogie)\n\nPodsumowanie:\nTa gra jest piękna. Przepiękna. Tak się powinno robić ilustracje do gier- ktoś włożył w to serce. Jakość elementów jest bardzo dobra. Gra łatwa do nauki i świetnie sprawdza jako wprowadzenie do gatunku worker playsments. Grając w grę chce się później więcej kart, bo zna się już na pamięć wszystkie . I tu jest haczyk, bo dodatki są czasem droższe od samej gry.",
    "timestamp": 1760306400
  },
  {
    "username": "greamejohnston",
    "rating": 8.0,
    "comment": "Worker placement, tableau building, card combo heaven. And the theme and the artwork- well, I’d rather eat a rabbit than pet one but my wife and our part-gamer friends love it, so I get to play a quite meaty medium weight Euro rather than yet another hand of Monopoly Deal. And the tree? To the short-sighted miserablists complaining about its lack of functionality, I say this…”it is only the gateway to a colourful world of magic and whimsy hiding just to the left of your imagination.",
    "timestamp": 1760306400
  },
  {
    "username": "mrssallyintown",
    "rating": 7.5,
    "comment": "Cute game, but very little player interaction",
    "timestamp": 1760220000
  },
  {
    "username": "elishacoad",
    "rating": 8.0,
    "comment": "Cute, thematic game where all the pieces come together in a very cohesive way. Heavier than it looks, Everdell rewards multiple playthroughs, but the charming aesthetic and intuitive ruleset make every play an enjoyable experience.",
    "timestamp": 1760133600
  },
  {
    "username": "GCZ745",
    "rating": 8.0,
    "comment": "Overall - 8/10 - Best at 2 players\nI played Everdell three times - twice at 2 players and once at 6 (!) players with the Bellfaire expansion. I enjoyed it each time, but it's so similar to other games I own (Wingspan, Terraforming Mars) that I don't feel like it has a place in my collection.\n\n\nTheme - 2/2\n\n+ This game is as thematic as it gets - a cozy-looking forest game board (complete with a giant pop-up tree), fancy resource tokens, and great artwork on the cards.\n\n+ Critters go out and gather resources for you, forest buildings are constructed, and specific critters want to live in them. Everything you do feels like part of the theme.\n\n\nRules - 1.5/2\n\n+ The rules are generally simple - you place workers to gather resources, then use those resources to play cards from your hand or the display. Anyone familiar with similar games, like Wingspan, should catch on quickly.\n\n- Those that haven’t played similar games may struggle with understanding everything, especially when it comes to players being on different seasons, what makes cards trigger, etc.\n\n\nTurn Simplicity - 1.75/2\n\n+ Playing a turn is simple - place a worker, play a card, or pass (prepare for next season).\n\n+ Resources are tight, so players should generally know what they want to do on their turn, though there are a lot of things on the board to distract them.\n\n\nFun Factor - 1.25/2\n\n+ Finding critter cards that you can play for free because they want to “occupy” one of your buildings, feels like a unique part of Everdell and is very fun.\n\n+ The game has a nice ramp up from barely being able to play a card or two to triggering most of your city and getting extra resources, actions, etc.\n\n- Worker placement feels a bit lacking. Players will generally fight over the same few spots because they have the most valuable resources (e.g., an extra pebble), but there aren’t enough workers or rounds to make it very strategic.\n\n- Cards have extremely small text, making it very hard to read things in the “meadow” (shared card area). Plays occasionally just took whatever because they didn’t feel like leaning over that area again.\n\nIn the end, it was a well-designed and interesting game, but just didn't have anything new to offer for a group that had played a lot of Wingspan and Viticulture. We hoped that Everdell would be a great blend of those two games, but it ended up feeling like a watered-down version of both.\n\n\nChallenge and Replayability - 1.5/2\n\n+ Making the most of the resources you can get is a standard puzzle for card-based engine builders, but is no less fun and challenging here.\n\n+ A huge deck of cards and bonus tiles makes the game extremely replayable; there are also a ton of expansions available to make it even more so.\n\n- Those who already have games with similar mechanics, like Wingspan, Viticulture, or Terraforming Mars may find that Everdell is a bit watered-down; the worker placement is very light and there are a lot of card “pairings” which limits just how much variety you’ll see in a game.",
    "timestamp": 1760133600
  },
  {
    "username": "DevOpsProDude",
    "rating": 8.0,
    "comment": "44x63 - 158\n63x88 - 479\n\nPlayed on board game night.",
    "timestamp": 1760047200
  },
  {
    "username": "Bozok",
    "rating": 7.5,
    "comment": "It was fun. The artwork is great. You can build a cool engine. But it is mostly a multiplayer solitaire (MPS) euro, and that's just not my favorite type of game. It also has a ton of cards available all at once (your hand and the meadow), so it's a lot to take in for new players. After playing once, the base game felt a little bit simple, like I basically got it and saw all there was to see after one play. Perhaps the expansions fix that, but that's more money.\n\nBen and Mel own this. I own the digital version on Steam and iOS.",
    "timestamp": 1760047200
  },
  {
    "username": "MythiccRare",
    "rating": 8.5,
    "comment": "Great - Sublime worker placement engine builder that plays like comfort food tastes.",
    "timestamp": 1759874400
  },
  {
    "username": "Seefeder",
    "rating": 9.0,
    "comment": "Digital",
    "timestamp": 1762681020
  },
  {
    "username": "Aimii",
    "rating": 9.0,
    "comment": "From my Secret Santa!!! So excited to play this beautiful game!!!",
    "timestamp": 1762676040
  },
  {
    "username": "babnufu",
    "rating": 8.5,
    "comment": "Increíble visualmente y divertido",
    "timestamp": 1762629120
  },
  {
    "username": "ClintAchilles",
    "rating": 9.0,
    "comment": "I think I enjoy this game best with no expansions added in, except for the extra card deck. I have played everything, and do enjoy the different board add ons, but still find myself drawn more to the base game. Now I have this giant box with everything and never play it. Which I think it's more of an indictment of big box mentality, because i think when I get the itch to play Everdell, I'm going to be taking Farshore off the shelf instead of lugging the giant box to the table. Still, it's one of my favorite games. The engine building is fun, and getting to get a free card down always feels good. Players switching into different seasons at different times can be awkward, and the ramp up at the end can be unwieldy for newer players, but those things don't bring down my enjoyment.",
    "timestamp": 1762383600
  },
  {
    "username": "carlzzzjr",
    "rating": 8.5,
    "comment": "Great worker placement/tableau builder. Very tight resource management.",
    "timestamp": 1762297200
  },
  {
    "username": "Jeremiiah",
    "rating": 9.0,
    "comment": "-Pearlbrook\n+Bellfaire\n+Spirecrest\n-Newleaf\n-Mistwood",
    "timestamp": 1762210800
  },
  {
    "username": "Theoreticalpart",
    "rating": 9.0,
    "comment": "Perfect family game",
    "timestamp": 1761865200
  },
  {
    "username": "Marman01",
    "rating": 8.5,
    "comment": "Inclusief:\n- Glimmergold Pack\n- Pearlbrook (met Freshwater Pack)\n- Spirecrest (met Trailblazers Pack)\n- Bellfaire\n- Mistwood\n- Newleaf\n------------------\n- Luxe grondstofbakjes",
    "timestamp": 1761692400
  },
  {
    "username": "JT19",
    "rating": 9.0,
    "comment": "Also own The Complete Collection version.",
    "timestamp": 1761519600
  },
  {
    "username": "Flipsmurf",
    "rating": 9.0,
    "comment": ">=15 plays. I bought this game for solo play and have enjoyed it. I have played this game with different friends and everyone was a fan. It is also kid friendly. But not kitten friendly. It is a cute worker placement with lots of expansions, most of which I own. +Spirecrest +Trailblazer +Bellfaire +Pearlbrook + freshwater +Newleaf +Mistwood",
    "timestamp": 1761429600
  },
  {
    "username": "Riverdell",
    "rating": 9.0,
    "comment": "Nice art work, a lot of options... cool game!\n(Everdell tree is nice but not handy)",
    "timestamp": 1761429600
  },
  {
    "username": "JABC",
    "rating": 9.0,
    "comment": "Extremely enjoyable game with outstanding artwork and very fun mechanics. An all-time favorite suitable for almost anyone and anytime.",
    "timestamp": 1761343200
  },
  {
    "username": "Hisu",
    "rating": 8.5,
    "comment": "One of the first \"high quality\" games I played, love the art work, interesting game play deck building game.",
    "timestamp": 1761343200
  },
  {
    "username": "DeKerstman",
    "rating": 9.0,
    "comment": "Rating based on 1st play, which was quite enjoyable. Artwork is great, albeit the text is VERY small. Too small to my liking (but perhaps I'm just getting old). Would like to play this some more and am still considering adding this one to the collection.\n\nTrading away this copy as I acquired the Collector's Edition.",
    "timestamp": 1760911200
  },
  {
    "username": "TheSlushySnake",
    "rating": 8.5,
    "comment": "Animal Civilisation-Themed Worker-Placement + City-Builder.\n1-4 Players. (Best With 3 Players).",
    "timestamp": 1760652000
  },
  {
    "username": "barcasebi",
    "rating": 8.6,
    "comment": "Complete Collection",
    "timestamp": 1760652000
  },
  {
    "username": "Magumarus",
    "rating": 9.0,
    "comment": "+Bellfaire\n+Newleaf\n+Spirecrest",
    "timestamp": 1760652000
  },
  {
    "username": "Gwain",
    "rating": 8.7,
    "comment": "My favourite worker placement game at the moment",
    "timestamp": 1760652000
  },
  {
    "username": "realanthillkit",
    "rating": 8.5,
    "comment": "Streamline redesign\nhttps://boardgamegeek.com/geeklist/254413/collection-bg-rede...",
    "timestamp": 1760565600
  },
  {
    "username": "Groak",
    "rating": 9.0,
    "comment": "Very cute and highly enjoyable tableau builder. It systematically grew on us the more we learned the cards. Its BGG position raised expectations to a dangerous level, but the game delivered and didn't disappoint.",
    "timestamp": 1760479200
  },
  {
    "username": "Anne_Claire",
    "rating": 9.0,
    "comment": "rules heaviness: medium/high\na worker placement management set in the forest with cute art.",
    "timestamp": 1760392800
  },
  {
    "username": "Banemonkey",
    "rating": 9.0,
    "comment": "Sleeved",
    "timestamp": 1760392800
  },
  {
    "username": "YoLYcmqZ",
    "rating": 8.5,
    "comment": "Thoughts: Oh my gosh, such a fun game! Bellfaire and Newleaf are welcome additions. Would be interested in all the expansions but cost doesn't seem worth it—maybe down the road. This is a top game for my wife. The engine building is satisfying, art is gorgeous, and combo potential keeps it fresh. Just delightful all around.\n\nTag(s): Engine Builder, Worker Placement, Beautiful\nBest Player Count: 1-4, {3}\nRating: 8, +0.5\nOwn: Physical, Digital\n+ Everdell: Bellfaire\n+ Everdell: Newleaf",
    "timestamp": 1760392800
  },
  {
    "username": "amazinga",
    "rating": 9.0,
    "comment": "Visually pleasant game. Very nice arts and components. Relatively short game session (that's good) can be played with kids, although they usually have no understanding of related cards and mechanics.\nSurprisingly takes a lot of space, especially with more than 2 players",
    "timestamp": 1760306400
  },
  {
    "username": "Romtos",
    "rating": 8.5,
    "comment": "(CE)\n+Pearlbrook (CE)\n+Spirecrest (CE)\n+Bellfaire\n+Wooden Evertree\n\nAll CC\n\n+Mistwood\n+Newleaf\n+Click Clack's Upgrade Pack\n+Everdell For Everyone\n+Resource holders\n++Tales from the Green Acorn (with art prints)\n\n+Promo compilation (standard size)",
    "timestamp": 1760133600
  },
  {
    "username": "poxi",
    "rating": 9.0,
    "comment": "◼️ Perłowy Potok\n◼️ Święto Lata\n\n◾️ Świąteczne karty promocyjne\n\n★ Drewniane żetony użycia (deluxe upgrade pack)\n★ Zestaw metalowych monet (deluxe upgrade pack)\n\n⇓ Ultra-PRO PRO-FIT\n⇓ Rebel Mini European Premium\n⇓ Rebel Mini European",
    "timestamp": 1760133600
  },
  {
    "username": "awpTilla",
    "rating": 9.0,
    "comment": "Rating with expansion Pearlbrook.\nMost cozy and beautiful game I own.",
    "timestamp": 1760133600
  },
  {
    "username": "BoarderTerrier",
    "rating": 8.5,
    "comment": "10. October",
    "timestamp": 1759701600
  },
  {
    "username": "fogelbaby",
    "rating": 9.0,
    "comment": "Very solid tableau building / worker placement game with great art and tight economy. Great for beginners and experts alike, usually the experts win but beginners will be not so far behind so it avoids that getting beaten by 50 points feel bads.\n\nLove it",
    "timestamp": 1759615200
  },
  {
    "username": "Tanhauser69",
    "rating": 8.5,
    "comment": "Oda a la superproducción para un juego de cartas puro y duro (muy bueno, eso sí)",
    "timestamp": 1759356000
  },
  {
    "username": "Tychose",
    "rating": 9.0,
    "comment": "E raptor insert",
    "timestamp": 1759269600
  },
  {
    "username": "Napattack",
    "rating": 9.8,
    "comment": "2.83\n1-4\nbest at 3\n80 (1,440)\n#17",
    "timestamp": 1762383600
  },
  {
    "username": "oneblessedmess",
    "rating": 10.0,
    "comment": "the game is just terrific! we used to own the basic game and a couple expansions before the complete collection was released, so you will see a similar review there. it is effectively put together, making incredible variability for strategies that all have the potential to win.\n\nit is worker placement, resource gathering, tableau building in their finest forms. the few workers you have feel so valuable when you lay them, but yield you only a little, such that you really depend on combinations of good plays to deleop through the available cards and special abilities. this makes for a lot more excitement than just gather resources and build the most obvious things. the changing of the seasons adds urgency to the game and there is a benefit to choosing to move slowly and a benefit to progress first.\n\nwe have not even referenced how cute the game is. the art is fantastic! the themes they string together are excellent. you can easily sort out what the makers were going for when giving each card its ability. the extra mechanics that come along with the expansions are very worth buying for added variability. the only expansion that gets ignored a lot is pearlbrook, and that, mostly because the pearls are pretty powerful. everdell easily belongs among the best games ever made. we could not recommend it enough.\n\nthe 10+ age recommendation is close. our formerly 10 year old got by well enough, though there was an amount of missed efficiency, without some help. 12+ might be better. the 40-80 minutes feels a bit low. some of our games push 2 hours, but our gaming groups have little people, we make games the background of the game days, and we often pause for conversations and real life.",
    "timestamp": 1761951600
  },
  {
    "username": "quetzal513",
    "rating": 9.6,
    "comment": "Kickstarter backed ~ Dec 18",
    "timestamp": 1761519600
  },
  {
    "username": "Paddouken",
    "rating": 10.0,
    "comment": "Exellent game. Artwork, game mechanics and complexity are perfect, also for beginners.",
    "timestamp": 1761170400
  },
  {
    "username": "Ziul_Solrac",
    "rating": 10.0,
    "comment": "Sleeves",
    "timestamp": 1761084000
  },
  {
    "username": "wknott",
    "rating": 10.0,
    "comment": "Koszulki na karty Rebel (44x68 mm) \"Mini European\"",
    "timestamp": 1760911200
  },
  {
    "username": "kuna23",
    "rating": 10.0,
    "comment": "Most Beautiful game I have ever played. If you play oversell music on a big tv the game is even wonderful.",
    "timestamp": 1760479200
  },
  {
    "username": "rjo0",
    "rating": 10.0,
    "comment": "Very cute design and like the mechanic.",
    "timestamp": 1760133600
  },
  {
    "username": "Nonoku",
    "rating": 10.0,
    "comment": "1-4 B: 3\nW: 2.82\n\nPros\n-Cute artwork/theme\n-Love how the player gains more workers instead of losing workers\n-Nice resource pieces\n-Good complicated/simple balance\n-Has a giant tree\n\nCons\n-Awkward to place things on tree",
    "timestamp": 1760047200
  },
  {
    "username": "Nakira",
    "rating": 9.5,
    "comment": "Everdell – Easily one of the most beautiful games you’ll ever put on your table, with the majestic Evertree towering in the center like a fairy-tale landmark. You lead a charming cast of woodland critters as they build and grow their bustling little city, constructing buildings, inviting new residents, and carefully managing resources to reach key milestones. The game’s card-driven engine blends perfectly with classic worker placement mechanics, creating a smooth and engaging pacing that feels both strategic and whimsical. It’s the kind of game that looks as good as it plays — a true delight for players who love a mix of clever tactics and cozy storytelling in a stunning package.",
    "timestamp": 1759874400
  },
  {
    "username": "bigbadVuk",
    "rating": 10.0,
    "comment": "Everything just clicks for me. I've played it many times and I love the way it builds up. You start off not being able to do much, but then you get your tableau and workers going and all of a sudden you are off to the races, finding new and cool combinations with your cards.",
    "timestamp": 1759701600
  },
  {
    "username": "nrgurshap",
    "rating": 10.0,
    "comment": "I think I originally had this game at a 8.5 but after coming back to it time and time again over the years it is honestly a 10. It will always be in my collection and I am excited to share it with new people every time.",
    "timestamp": 1759701600
  },
  {
    "username": "Edu207",
    "rating": 10.0,
    "comment": "This game is beautiful, the components are really well maded. The gameplay are lovely. Its not too easy either too complicated. A perfect balance.\n\nAnd you have little wooden animals.",
    "timestamp": 1759701600
  },
  {
    "username": "Ahaji18",
    "rating": 10.0,
    "comment": "This has a totally different mood\nVery fun and cozy!!",
    "timestamp": 1759528800
  },
  {
    "username": "Lovinitnz",
    "rating": 10.0,
    "comment": "Gifted to a friend after buying the complete edition. My love of Everdell has never diminished- 2018 is when I fell in love with playing board games - thanks to Everdell.",
    "timestamp": 1758924000
  },
  {
    "username": "OGRussHood",
    "rating": 10.0,
    "comment": "My 2025 Top 250: #49\nMy 2024 Top 250: #46\nMy 2023 Top 250: #48\nMy 2022 Top 250: #52\nMy 2021 Top 250: #126",
    "timestamp": 1758492000
  },
  {
    "username": "Wuyley",
    "rating": 10.0,
    "comment": "Best 3, Recommend 2/4",
    "timestamp": 1758492000
  },
  {
    "username": "SirLeki",
    "rating": 9.5,
    "comment": "Ana",
    "timestamp": 1758492000
  },
  {
    "username": "djakarn",
    "rating": 10.0,
    "comment": "Excellent jeux de combo , ou il faut être vigilant sur ce que font les autres.\nLe jeu de base est tendu niveau ressources",
    "timestamp": 1757109600
  },
  {
    "username": "JacenSunrider",
    "rating": 10.0,
    "comment": "One of my favorites in the collection. A lot of things to do, which in the beginning seems even daunting, and you get a feeling that there's never enough resources to get what you want. But after a round or two the engine starts turning and you are able to make some pretty satisfying combos. Looks and plays great. Doesn't take too long, which makes it easy to put on the table on regular basis. It is a bit heavier on the rules - especially for people new to board games - but in the end it's usually a pleasure to go through both with experienced and new players.",
    "timestamp": 1756591200
  },
  {
    "username": "laura1196",
    "rating": 10.0,
    "comment": "I enjoy an overproduced game that is interactive, worker placement and engine building. My only complaint is that the players I play this with are much much better than I am. It's also Very Long!! Played with a \"chess Timer\". which was fun, challenging and moved the game along.",
    "timestamp": 1756072800
  },
  {
    "username": "Tauzer",
    "rating": 10.0,
    "comment": "What a beautiful game! The artwork is lovely, the components are amazing, and even that inconveniently large tree provides some real table presence. This game is not merely pretty, it's also an excellent worker placement and tableau building game with a plethora of exciting expansions. I have the Big Box but I've decanted my favorite elements into the original box as my Everdell Essentials Edition. For those who are curious that includes Extra Extra Extra (Collector's Edition), Creature Powers (Bellfaire), generic special events (Bellfaire and others), and all the Forest Locations. Each of the expansions gives a different flavor to the game, allowing Everdell to become something of a game system which you can customize to your liking. Want a tighter game, try Spirecrest with just the base game. Want an open high-scoring game, use Newleaf and all its modules. I prefer it to be a bit tighter, which you'll see in my \"Essential Edition\".",
    "timestamp": 1755813600
  },
  {
    "username": "ardentplea",
    "rating": 10.0,
    "comment": "currently my favourite board game, it has so much variety and depth and meaningful player choice and every game is really dynamic and it's SO COZY. and i'm sorry but i really am susceptible to a board game looking really pretty. everdell is my happy place right now",
    "timestamp": 1755208800
  },
  {
    "username": "purlQg",
    "rating": 9.5,
    "comment": "One of the best games I have ever played!\nEspecially with some of the best expansions like New Leaf or Belfaire it becomes an absolutely great game, will allways play.",
    "timestamp": 1755122400
  },
  {
    "username": "mrtoffee79",
    "rating": 10.0,
    "comment": "Mistwood\nSpirecrest",
    "timestamp": 1755036000
  },
  {
    "username": "Mayliie",
    "rating": 10.0,
    "comment": "Can be seen as an improved version of Agricola. More cards and combo",
    "timestamp": 1754776800
  },
  {
    "username": "Kuhni",
    "rating": 10.0,
    "comment": "Rating 2,8/40-80Minuten\n1-4/Best 3/10Jahre\n\nBellfaire 2,7/Best 4\nPearlbrook 2,8/Best 3\nSpirecrest 3,0/Best 2-3\nNewleaf 3,0/Best 2\nMistwood 2,9/Best 1",
    "timestamp": 1754690400
  },
  {
    "username": "Sara_M",
    "rating": 10.0,
    "comment": "Top.",
    "timestamp": 1754690400
  },
  {
    "username": "winichr",
    "rating": 10.0,
    "comment": "Sleeved, wooden tree",
    "timestamp": 1754258400
  },
  {
    "username": "Starvedtostuffed",
    "rating": 10.0,
    "comment": "Love this game. Recommend",
    "timestamp": 1753740000
  },
  {
    "username": "ianjj",
    "rating": 10.0,
    "comment": "Card system is perfect, easy to play, hard to master.\nGreat game",
    "timestamp": 1753480800
  }
]