[
  {
    "username": "Aleks24",
    "rating": 1.0,
    "comment": "Absolutely atrocious",
    "timestamp": 1755727200
  },
  {
    "username": "zmartianov",
    "rating": 1.0,
    "comment": "This game glorifies European colonialism",
    "timestamp": 1754604000
  },
  {
    "username": "geniusadam69",
    "rating": 1.0,
    "comment": "Found this game to be extremely unforgiving with broken mechanics. Lose an early war, lose the game. Rewards for winning are so unbalanced that if you lose once, you're basically out of the game.",
    "timestamp": 1747951200
  },
  {
    "username": "Glanzmuecke",
    "rating": 1.0,
    "comment": "This game has been one of the most boring game experiences ever on my table. I am not the target group for this game either.",
    "timestamp": 1747692000
  },
  {
    "username": "lililililil",
    "rating": 1.0,
    "comment": "Automata / limited player variance",
    "timestamp": 1747432800
  },
  {
    "username": "xfrgux",
    "rating": 1.0,
    "comment": "Terrible balance. No compensation for players who take actions late",
    "timestamp": 1739314800
  },
  {
    "username": "Hexagon95",
    "rating": 1.0,
    "comment": "A very nice Board Game.\nBut I don't like when a manufacturer makes a second edition and your first edition with all of the expansions becomes meaning less....",
    "timestamp": 1737932400
  },
  {
    "username": "gamer2024",
    "rating": 1.0,
    "comment": "Not a fan of the theme or universe or type of game. Tried it , didn't like it.",
    "timestamp": 1737414000
  },
  {
    "username": "cotomel",
    "rating": 1.0,
    "comment": "Boring.",
    "timestamp": 1732834800
  },
  {
    "username": "Scifi66",
    "rating": 1.0,
    "comment": "So MEH. Deck builder / combat / race for points game with Dune theming. Massively overhyped, I can't believe it's rating. A sub-par worker placement mechanic plus a bad deck builder and swingy combat dominated by hideously random intrigue cards. And >3 hours to play. Flush the tanks! I'd play Risk over this nonsense. This is not a Top100 boardgame by any stretch.\n+ Understated board art\n- Random market flop\n- Combat is by far the best way to get VPs, the spot that delivers additional troops for combat is too important (Heighliner?)\n- Pointlessness of solari at end game\n- Few options to actually deck build\nx Ridiculously swingy intrigue cards\nx Caused AP in my group so games run >3 hours. The decision tree isn't rich enough to justify a 3 hour game and there is so much randomness built in. I was so bored during this game.",
    "timestamp": 1725573600
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "The deckbuilding is dull, the resource conversion is dull, the worker placement is worker placement, the bidding-battles could be more exciting. It's just a mishmash of stuff. Well at least the scores usually stop around a dozen points.",
    "timestamp": 1722463200
  },
  {
    "username": "Esyhpe",
    "rating": 1.0,
    "comment": "Overrated, too luck based.\nEasy to teach and play, not that long.",
    "timestamp": 1715119200
  },
  {
    "username": "joven11",
    "rating": 1.0,
    "comment": "severe production quality issues\nI'm really pissed about that.\nAnd the release of basically the same game again with slight variation is also despicable.",
    "timestamp": 1710716400
  },
  {
    "username": "Nozdormu",
    "rating": 1.0,
    "comment": "I played this game well over 20 times in total. I played both offline and online and I feel this game is best played online on steam. However the game has a lot of problems and I don't think the expansions solve these problems.\n\n1) One of my online games I was able to win by drawing the exact three intrigue cards I needed to win in the last round. At that point I don't really feel like I won, but I just ended up getting lucky. To me this is a huge problem with the game.\n\n2) You can get lucky by having the right amount of buying power when a really strong card becomes available or you can get unlucky, by having the opposite happening to you and some of these cards are able to turn the game up side down on their own. While it is true that you don't need good cards to win the game, you do need some decent cards in addition to your starting cards to be able to compete properly and if nothing good becomes available to you, then you are most likely going to be screwed.\n\n3) Player skill does matter. If you have even one bad player on your table, then that may result in a runaway leader on its own. Dune Imperium is at its best when each player knows what to do and when to do it. This means that if a single player is oblivious about the right course of actions, then they won't counter somebody when they could have or should have.\n\nSo to summarize. There is to much luck involved in the intrigue cards, the cards you can buy (which ones show up and when they show up) and the tech (expansion, which ones show up and when they show up). There is also no clear solution for any of these problems either. If you get dealed a bad hand, you can still perform decently well, but your odds at actually winning decrease by a lot. On the opposite end if you get dealed a good hand, your odds at winning increases and while you still have to properly play the game, the game already worked in your favor. To me Dune Imperium is a game that frustrated the hell out of me. I like the idea of it, but I dislike the randomness of it and given how much time we have to spend upon this world, I rather spend my time elsewhere.",
    "timestamp": 1710457200
  },
  {
    "username": "MortyCZ",
    "rating": 1.0,
    "comment": "I don´t like workerplacement and this is the worst workerpalcement game!",
    "timestamp": 1683410400
  },
  {
    "username": "Lamarc_Gasoldridge",
    "rating": 1.0,
    "comment": "Very run of the mill worker placement game, with more rules and less strategy. Outcome heavily guard-railed and based on turn order. Theme does not come through at all.",
    "timestamp": 1681855200
  },
  {
    "username": "aeonphreak",
    "rating": 1.0,
    "comment": "Ah, Dune Imperium. Oh, I really wanted to like this game. I enjoy the Dune IP so I had to really work hard to separate my bias since of course, based on the theme alone, I would want to like it. Initially, I did like it. However, I couldn't ignore it's glaring flaws.\n\nDune Imperium is another one of those modern day games where every action is rewarded and leads to the same outcome, regardless of what you do. Hence, \"the illusion of choice\" as I like to put it. As every action is rewarded, nothing you do really matters. Hence, the game is designed to rubber band players for a close finish where the end game devolves to luck with best drawn intrigue cards.\n\n-Have troops available? Try your hand at the conflict and gain an influence point.\n-Have a surplus of persuasion points? Just pass early and buy a,\"Spice May Flow,\" card to collect an influence point.\n-Have diplomacy cards? Boost yourself on the alliance track and get a point.\n\nThe illusion of choice here creates a disguised, bland strategic experience.\n\nThe luck element of the game is poorly implemented through the use of the intrigue deck. I have no issue with luck implemented in games if it can allow a player to employ a clever strategy as a result. However, this game dumbs it down to, \"Let's pull the lever on the slot machine of the intrigue deck and see if I hit that 777.\" Simply milling an intrigue deck for game breaking cards does not equate to strategic play that's fulfilling as a player. As a result, this game can be rather swingy, unjustly.\n\nAdditionally, the mid through end game strategy devolved down to be the same for all players: Let's hoard 6 spice and see who can be the first person to place their agent on the heighliner board space to deploy 7 troops EVERY SINGLE TIME. You'd be a fool not to place an agent on this spot for the Space Guild. Compare this board space to the Emperor's conspire board space, and it really pales in comparison. The Emperor's conspire space allows a player to spend 4 spice and acquire 5 wealth, 2 troops (which you can't deploy), and an intrigue card. Thematically, the Emperor has access to Sardaukar terror troops and you mean to tell me that's the best he can do? The Heighliner spot is clearly the best space in the game where players would want to ensure they can go as often as possible.\n\nLet's face it, the graphic design on the board was lazy, and a completely missed opportunity.\n\nThe game is light on player interaction. The combat is uninteresting. You could slap any theme on these game mechanisms. When it comes to the Dune theme, I'll stick to the Avalon Hill classic. Further, when it comes to deck building + worker placement/area control, I'll take \"A Study in Emerald\" or Legends of the hidden Arnak any day over this.",
    "timestamp": 1671490800
  },
  {
    "username": "ingedico",
    "rating": 1.0,
    "comment": "Euro",
    "timestamp": 1661032800
  },
  {
    "username": "savedbygrace1521",
    "rating": 1.0,
    "comment": "BORING!!!!!\nDULL!!!!!!\nWASTE OF TIME!!!",
    "timestamp": 1645138800
  },
  {
    "username": "Jessy C",
    "rating": 1.0,
    "comment": "Doesn't come with enough sleeves to play. Support will not respond.",
    "timestamp": 1642546800
  },
  {
    "username": "Fisteszek",
    "rating": 1.0,
    "comment": "The worst game ever it is boring and random I don't recomend playing it.",
    "timestamp": 1642287600
  },
  {
    "username": "Noel_Gibbs",
    "rating": 1.0,
    "comment": "So abstract is has absolutely no connection to it's theme at all",
    "timestamp": 1636758000
  },
  {
    "username": "amasterpiece",
    "rating": 1.0,
    "comment": "Boring",
    "timestamp": 1624053600
  },
  {
    "username": "Mykola_Ku",
    "rating": 1.0,
    "comment": "Нагадало невдалу копію кланку та зоряних імперій + дивне відчуття, що деякі елементи є недоречною пародією з виноробства та Метро 2033(((\nОчікував більшого",
    "timestamp": 1618178400
  },
  {
    "username": "buderix80",
    "rating": 2.0,
    "comment": "Just flip a coin to determinate who will win. Same as drawing a card from the intrigue deck. Because the intrigue cards are too powerful and can decide the hole game (happend in all three played matches).\n\nWith the last drawn card, a guy decided the hole game, by letting win another guy that hadn't got the chance without. After 3 hours! This isn't just luck, it's bad game design. A pity, because the game is really good, until these moments, that are ugly random and feel just awful. That's the reason I didn't buy any additional stuff and after the 3rd chance with the same result, got rid of it.",
    "timestamp": 1758492000
  },
  {
    "username": "OGRussHood",
    "rating": 2.4,
    "comment": "Originally rated a 4 after testing the game, but I dropped my rating to 2.5 after the designer became butthurt over my original rating and sent me a private message about my rating. He complained that either I should explain why I dislike the game (which, had he bothered to read my playtesting review, he would have known why) or remove my rating (which I most certainly won't). I've played over 5,000 games in my life. I don't have the time or wherewithal to make comments on all 5,000+ games, and I certainly will not give special treatment to this game simply because the designer whined about one rating. Game recuperated a half-point in November 2021. After much soul searching, I dropped my rating back to 2.4 in May 2025 as I am unable to overlook Dennen's attitude toward me personally.",
    "timestamp": 1747692000
  },
  {
    "username": "parpari",
    "rating": 2.2,
    "comment": "This is one the most overrate board game in the existence. It is very random with a lot of luck of draw (which are combo-y factor double down on this issue), unbalance powers and very long for what it is. I guess Art and Dune IP are only positive points.",
    "timestamp": 1733871600
  },
  {
    "username": "jelsepa",
    "rating": 2.0,
    "comment": "This game is heresy. How can you even dare put this stain of dirt on one of the most epic sci-fi universe that ever existed? A themeless game that has no link whatsoever with Dune, but used the franchise anyway just for the sake of being sold and hyped.\n\nAnd even if it were another theme, the game just feels empty and soulless. Get some cards, grab some resources, try to beat other players at this mini area control game, grab some points along the way. Rinse and repeat until the end.",
    "timestamp": 1728424800
  },
  {
    "username": "NadiaTrue",
    "rating": 2.0,
    "comment": "probably fine, but having the other players not fully teach the game and actively work to not give you information on how it works made it entirely unfun.\n\nalso to unforgiving for my taste.",
    "timestamp": 1725141600
  },
  {
    "username": "Golyadkin",
    "rating": 2.0,
    "comment": "one of the worst games I have ever played. sorry not sorry :X",
    "timestamp": 1720303200
  },
  {
    "username": "Vinnichi",
    "rating": 2.0,
    "comment": "so boring, so bland...",
    "timestamp": 1718488800
  },
  {
    "username": "Bergbau",
    "rating": 2.0,
    "comment": "Sorry, but this was not a very good game. But I can see why players who haven’t experienced older, more solid, games are drawn to this.",
    "timestamp": 1714255200
  },
  {
    "username": "formidable",
    "rating": 2.0,
    "comment": "Has one of the worst combat systems ever. You can only recover 3 troops per turn. This is a major problem because when someone breaks the shield wall likely that 20 units will be wiped out with practically no way to recover them. After all, the game only lasts 10 turns.",
    "timestamp": 1707606000
  },
  {
    "username": "cfarrell",
    "rating": 2.0,
    "comment": "Played this a few more times recently, and wow, it’s just really an awful game. WTF people? See djberg96’s comment for a deeper dive into why this games suck so hard beyond my comments below.\n—-\nThis is another one of those games (like Terraforming Mars, Terra Mystica, Nevsky, COIN) that I played so much and went so far out of my way to try to like, just because they are so popular, that I ended up despising it more than is possibly reasonable. I rate it a 2, because it is in fact quite bad - if I had to play this regularly then I’d probably rather just leave the hobby. But maybe for most normal people it’s a 4 or 5 bad, not a 2 bad.\n—-\nHere are the house rules I play with: remove all cost-1 cards from the Imperium deck, and make the market row 6 cards instead of 5. At the end of each turn, trash and replace the oldest card in the market. This actually helps a *lot*. Unfortunately it unmasks a bunch of other problems with the game which are not so easily fixable, so I’m not raising my rating. But it makes it a lot more playable.\n—-\nA bit of face-to-face play in between various spikes has really tanked the rating on this. The balance is just quite bad. The Imperium Deck is full of worthless cards and it's very easy for the Imperium Row to get gummed up with garbage nobody wants to buy, which just kills the game. The Intrigue deck is amazingly uneven. And the real problem is that you just don't cycle your deck that much, maybe 4-5 times in a game, maybe even less. This turns too many low-priced cards into worse-than-useless garbage.\n\nAlso: the weird way it covers only the material from the first movie (half the book) leaves it just feeling really thin. The Dune flavor is extremely limited to begin with, but leaving out half the book and family atomics, Feyd Rautha, Alia, etc., it just doesn't feel like there is a lot there. Then for the first expansion they go to the execrable prequels rather than doing something from core Dune.\n\nReally surprised how much love this game has gotten given how obviously problematic so many elements are. I like Clank! well enough but I don't need to play this again. I hope that Dune: A Game of Conquest & Diplomacy will deliver something better.\n---\nThis has settled in to get some semi-regular play. The hype on this one seems a little nuts, with an 8.5 average rating. It’s a perfectly workmanlike piece of design work - but not really that remarkable. The length, especially with 4, is just a big problem.\n---\nThe availability of better TTS modules recently has helped here. I really wish the graphic and physical design of this was more interesting. It’s not terrible, it’s just not that evocative - I’m not sure if this is just because it was tightly bound to a movie that nobody is going to see for quite a while still? But it’s just surprisingly bland.\n\nSo anyway, my opinion of this has been trending up a bit, but not to the tune of another rating point.\n\nI’m also pretty convinced for now that this really wants 4 players. The balancing for fewer does not seem particularly convincing, and the dynamics of the conflict cards seems not ideal at 3.\n\nStill also really needed to trim about 20% from the play time.\n—-\nI should also say I’m super-concerned about the playing time. I haven’t had a game come in under 2 hours, and a 4-player game that went the distance hasn’t come in at under 3. This needs to be 90m, 2h tops.\n—\nPlayed twice, enjoyed. But it doesn’t feel like it’s quite good enough to get repeat play. The unevenness in the Intrigue cards and Factions in particular does not seem great - it’s a huge competitive boon to get a couple good Intrigue cards early, and by the same token investing your very limited resources early and getting cards that are effectively no-ops is bad. It also appears that the game really kinda needs the full compliment of 4 players - the scaling to play with fewer players clearly is not great.\n\nThe Dune flavor is also ok but nothing to write home about. The intrigue in Dune is about intricate plots and sudden strikes, while Dune: Imperium is a classic deck building grind. While there is strenuous competition over conflict zones, which is nice, there are no high-stakes sudden reveals and limited hidden information.\n\nSo, I dunno, I was hoping it would be at minimum a serviceable eurogame. I think it’ll probably clear that bar but not go much higher.\n—\nSo, yes, it looks like this will be a pretty traditional deck-builder which leans into the tropes of deckbuilders a lot more than the tropes of Dune. That’s fine! It’s not going to be the next coming of Avalon Hill’s Dune, but it seems like it’ll be a fun Dune-flavored thing. I pre-ordered it; it helped that I really enjoyed Clank.",
    "timestamp": 1707433200
  },
  {
    "username": "NormandyWept",
    "rating": 2.0,
    "comment": "This game suffers from most of the problems of modern Euros, especially the fact it's been designed around the idea of combining the fashionable elements of deck-building and worker placement as expediently as possible, without really thinking if that is the best way to serve the setting and intention of the game.\n\nI was a bit blown away on first rules learning (via the very flashy but largely-well-done Steam app) with the number of different rules that needed to be introduced. Every time I thought \"well at least I've learned the game now\", a new concept and set of worker placement spaces were introduced. I find the idea that many players play this game with multiple expansions utterly incomprehensible: the base game is already creaking at the seams. It needed systems, spaces, and card types to be removed, not added, if it were truly to become a great game.\n\nThe whole game feels very affected by the issues that have plagued many a post-Dominion deck-building game: especially, the randomness of when you draw particular cards from your highly-variable starting deck and what exactly is in the limited-selection buy-row at any point in time. These factors are going to affect the outcome of your games. That's not necessarily a bad thing - I suspect that I enjoy a high-luck, high-skill game more than your average BGGer - but it does make it a surprise that this game is as highly-regarded as it is.\n\nWhilst it's possible no game could do treatment to Dune adequately from a thematic perspective, Imperium falls short by creating something largely uninteractive and especially where most players' path through the game is to achieve friendship with every non-player faction: something which is certainly beyond all the major \"players\" in the Dune universe in the books/films.\n\n\"The Conflict\" each turn does stand out, in that it does a good job of focusing central attention, creating something of an auction. Compared to most modern Euro games, this is far more interactive and interesting. At its best, with intrigue cards being flung to change the values in the conflict or even to pull out at the last minute and save for the next one, it feels a bit like Condottiere - except that Dune: Imperium as a whole is far less accessible, leading one to question why one wouldn't just play Condottiere instead.\n\nAfter initially finding it slightly less egregious than many modern Euros and especially thinking the conflict was well-done as described above, a torturous three-hour second play which suggested \"Downtime: Imperium\" might be a more appropriate name persuaded me to drop this to a 2.",
    "timestamp": 1703286000
  },
  {
    "username": "gamerdoge",
    "rating": 2.0,
    "comment": "JASE Just another Soulless Euro game. what else do you expect. off-theme. this is not a Dune game.",
    "timestamp": 1703113200
  },
  {
    "username": "GhostInside",
    "rating": 2.0,
    "comment": "I'm one of the first to get this game, and it bombed at our table. We were all very surprised to see how popular it got. I recently played again after more than a year and I think the expansions really improve the experience, but it is plagued by many of the same issues that (to me) look like lazy design decisions.\n\nUpdate: I have played another 30 times, mostly to just be social with my friends in the local community and I can't do it any more. Every aspect of this game is incredibly un-fun.\nIt is like a master-class in tricking the player into believing that have meaningful choices when they really don't.",
    "timestamp": 1703026800
  },
  {
    "username": "sminafar",
    "rating": 2.0,
    "comment": "Similar to Terraforming Mars you are at the mercy of the draw.",
    "timestamp": 1693000800
  },
  {
    "username": "JSMA",
    "rating": 2.0,
    "comment": "Das nächste mal ohne mich",
    "timestamp": 1680991200
  },
  {
    "username": "jammitch",
    "rating": 2.0,
    "comment": "As a Eurogamer, I'm usually good at detecting and avoiding games I hate. I got baited into this because I hoped the primary mechanics would be Euro enough for me, but it's fully an Amerigame, straight up.\n\nToo random, can't plan ahead.\nNo balance, broken card combos, Kwisatz Haderach getting more actions than everyone else so they always get last say on combat.\nNo use for Solari past the midgame.\nWay too long for what it is with massive downtime between turns.\nDrawing a hand on the last turn that stifles all useful actions and guarantees everything I did in the last three hours was pointless and I'm losing the game.\n\nNever again.",
    "timestamp": 1674169200
  },
  {
    "username": "Luminati444",
    "rating": 2.0,
    "comment": "lost ruins of arnak is much better with the expansion. sold",
    "timestamp": 1673391600
  },
  {
    "username": "PJV666",
    "rating": 2.0,
    "comment": "J'ai laissé beaucoup trop de chance à ce jeu sérieusement. Après pas mal de parties et j'en ai regardé aussi pas mal (même en compétition) ce jeu a un grave SOUCIS. L'équilibrage est TROP DÉSASTREUX.\n\nLes cartes intrigue qui ne sert à rien, mais si une personne pioche la bonne (ou les) ça te retourne la game. (GG pour une carte avec une seule action).\n\nLes persos asymétriques déséquilibrées (et les extensions qui Rendent pire ce côté aléatoire tellement le mec qui a créé le jeu voulait corriger ces erreurs d'avant, mais rend le jeu encore + merdique XD.)\n\nD'ailleurs, je trouve le jeu mieux équilibré sans le baron et la meuf qui peut aller là où tu poses quand même tes agents, il faut être vraiment 80- de QI pour voir que dans un jeu de pose d'ouvrier ou le premier qui prend la place est avantageux de laisser un perso comme cela XD. Et bien sûr sans les extensions, qui rajoute + d'aléatoire et de n'importe quoi, juste pour faire plaisir au petit geek qui ne joue jamais au jeu de société 'dis compète ou un minimum équilibré'\n\nRéellement, je comprends pourquoi ark nova est bien mieux que ce dune (PAS BESOIN d'EXTENSION pour essayer d'équilibrer un jeu). Ne parlons pas de Wingspan qui est bien + compétitif que ce dune (et pourtant il a plus d'aléatoire, mais MIEUX GÉRÉ.) Il a aussi Great Western Trail, paladins et plein d'autre qui Détruisent ce DUNE. Je ne comprends pas l'engouement sur un tel jeu. Autant jouer à Charlatans qui est moins 'chaotique' et surtout moins frustrant par son gameplay.\nEt le deckbuilding de ce dune est HORRIBLE, même si tu le gères parfaitement, tu seras TRÈS TRÈS PEU récompensé, autant le supprimer, je pense dans les prochaines extension pour rééquilibrer le tout.\n\nEt pourtant j'ai laissé trop de chance même dans les parties, je gagnais grâce aux persos + cheaté (baron 100 % de winrtate avec moi XD + extensions bien sûr) mais il n'a aucun plaisir vu, tu as quelque prise de décisions, mais tu subis + ce que les autre font aussi et le gameplay est très moyen. Un 7Wonders est bien mieux et mieux équilibrés voir + compétitif.",
    "timestamp": 1673132400
  },
  {
    "username": "ejones307",
    "rating": 2.0,
    "comment": "Sort of a dumpster fire of a game. Lots of direct attacks, and take that happening in the game. If you like randomly losing your turn because another player takes an action that totally negates your action, this may be the game for you. Awful balancing of spaces, with some basically unusable, which I guess is par for most worker placement games. Not a good game in terms of balancing or design, but at least it's basically never fun either. Board looks fine, art is decent. Decent components. We did have a couple times where players mistook player pawns for dreadnaughts. The expansion seems to make the game worse, as they do more often then not. The smuggling spaces were basically always first picked, so much so that people even prioritized the space guild to have more access to them. The variable powers are not even close to being balanced, with some just clearly better then others. The intrigue cards and techs were similarly unfun as they range mostly as either worthless or busted. Battles seemed the icing on the crap salad of a game. One battle in our game saw a single troop beat another player who had deployed nearly all of their troops. Seems bad when a 12/1 advantage can't get it done. The rewards also varied so much, there was a turn where everyone basically said they didn't even care to fight because it wasn't worth putting troops in for the reward offered, to the next turn where 2 VP were for winner only, with a relatively minor prize for 2nd. At least the game isn't 100% winner takes all, it just winner takes everything anyone cares about most of the time. In the end, this game fails in nearly every way in terms of design and play. Most of the people at the table just wanted the game to end by the end. It was a truly a beating to play this game. They really got their moneys worth from the IP on this one, as it would be a complete loser without it.",
    "timestamp": 1646348400
  },
  {
    "username": "thor314",
    "rating": 2.0,
    "comment": "My friends and I couldn't finish a single play through. The game is ill designed in several ways:\n\n1. Complexity for complexity's sake, but with no payoff. There are 6 in-game currencies: spice, solari, water, troops, influence, and persuasion. There are also several types of cards. Each turn takes place through 5 phases. Complexity is alright, when the complexity adds to the game, allowing for an interesting and balanced profusion of strategies. This takes me to point 2.\n\n2. The game is linear. I've played the game once, the following seems very likely true:\nThe game reduces to Get Solari, Go to Swordsmaster, Get more Solari, Go to High Council, Win Battles. In that order.\n\nThere's some variation in how players get the in-game currencies, and the deck building dynamic adds a small amount of diversity to game strategies. That still fails to mitigate for the central fact of the game being simultaneously excessively complex and unfortunately linear.",
    "timestamp": 1644102000
  },
  {
    "username": "Mayasty",
    "rating": 2.0,
    "comment": "Quasi ameritrash that pretends to be the eurogame. Chaos, chaos, chaos. All you do here is luck dependent. You want to place the worker on the board but you can’t because you didn’t draw the proper card. When finally you’ve got it the other player was faster and blocked that space. You want to buy a card from the market but there’s nothing interesting at this moment at the price you can afford, so you buy whatever or your money (persuasion) is gone. You’ve well prepared your troops to win the combat but suddenly someone plays the card that turns the result upside down. Forget about controlling and planning your moves.\n\nI’m sorry but I prefer the „Clank” that has identical card driven mechanism, almost the same iconography, the same luck dependency but without all these euro-like elements and finally it doesn’t pretend to be something more than pure spontanous fun. +1 point for „Clank” resemblance.",
    "timestamp": 1641423600
  },
  {
    "username": "Achire",
    "rating": 2.0,
    "comment": "Agonizing first play experience. I immediately sold the game and would never play again. Our game was so endless that my friend managed to play Terraforming Mars (with expansions) while we played this... and when he returned, we still had plenty of game left. We eventually just quit the game because none of us wanted to play anymore. We checked the remaining cards and the game would've definitely ended with the deck running out, which takes ages. Even if our game's length was some kind of unusual anomaly, I still hate the game. (1) It's incredibly boring. The cards are mundane 'go here'. The action spots are basically all 'get water/spice/silver'. The cards you buy are equally dull and there's no combo-chaining or any of the other stuff that makes deck-builders fun. (2) For all the talk of this being deeper than Arnak, I found the decisions actually much easier to make; it's a shallow decision space (3) Intrigue cards vary from nearly useless to incredibly powerful. Much of the game ends up being determined by a random draw. Overall: I wish I could see what others see in this game, but I just don't. It is infinitely worse than deck-builders like Clank or Quest for El Dorado, much less fun than Arnak, and certainly nowhere near as deep as most worker placements. War, the best part of this game, is far better done in Blood Rage or Inis, which I'd both highly recommend. There's just nothing here that a bunch of other games don't do better.",
    "timestamp": 1632088800
  },
  {
    "username": "CbusGamer",
    "rating": 2.0,
    "comment": "I bought this game because of the hype. I am very surprised it is getting this much attention. I found it tedious and boring. Someone in my group said it feels like \"grinding\" in a videogame, and I think that about captures the experience for me. It will not stay in my collection.",
    "timestamp": 1627250400
  },
  {
    "username": "Br_Des",
    "rating": 2.0,
    "comment": "I sincerely tried to like the game. But after 3 plays with different parties I can surely tell that I don't want to try it once more. Card balance is a joke, as many other people already complained. And it's not just about \"Kwisatz Haderach\", which is essentially \"I win\" card if you get it by round 4. But even between card with the same cost their usefulness varies greatly, like that card with cost 3 that allows you to remove a card AND get 2 spice while you're at it.\n\nThis imbalance snowballs into many more other problems in the game. The biggest issue is the feelings of practically every player during the entire playthrough. I played a lot of other games with the same people, but I noticed that this particular game just makes people sad and salty most of the time instead of making them enjoy the process. It's hard to blame people for being annoyed when pure luck is a major factor and the outcome is frequently decided on whether you got any useful cards in the Imperium Row by your turn. Imagine having 6-8 persuasion with not a single useful card to buy, so you have to spend it on some utter trash only to reveal some ultimate top card for the next player. Yup, happens all the time.\n\nSame imbalance problem with intrigue cards, there some are much more useful than others, and it's only a matter of luck to get anything good. In our second game, a guy won by drawing a single intrigue card with +9 combat strength, which he got for taking 2nd place in combat, so that let him win the next combat and get +2 VP. Imagine how 2 other players felt when they were focusing on Intrigue cards the entire game and always got some useless trash.\n\nThat being said, having any strategy is pretty much pointless, and whether you win or not is always due to luck. That's definitely not what I would expect from a strategy game, making it the second game ever in my entire collection that I seriously consider to just give to somebody else.",
    "timestamp": 1626300000
  },
  {
    "username": "Schr0dinger85",
    "rating": 3.0,
    "comment": "I was expecting a great game based on all the praise I’d read, but the disappointment was severe. It felt like a mix of mechanics thrown together, with none of them fully fleshed out. Too long, very “Euro,” yet it ends with a completely luck-of-the-draw finish. Maybe I’m missing something (I’ve only played it once, with the Rise of Ix expansion).",
    "timestamp": 1762124400
  },
  {
    "username": "Forgeforgeforge",
    "rating": 3.2,
    "comment": "I've never played this game, but I did play uprising once, which is enough to know this game is godawful.\n\nuprising review that probably applies here:\nI can't remember the last time I hated a game more. Maybe root? Every moment I was either bored to tears or extremely frustrated. I wanted to scream.\n\nLike most bad worker placements, there is absolutely no reason to pay attention when it's not your turn. Other people act with total impunity on their turns, there is no reason to predict what they might do, you cannot respond, and every thing they do cuts a firewall across your decision space. there's no reason to plan ahead. Start your thinking over on your turn.\n\nAll the tiles and cards in this game come out in the worst way. They are the dreaded \"situationally good\". What cards/contacts are available on your turn is basically random. Some cards are fucking phenomenal for only one player. Some cards are fucking phenomenal for anyone, but you will not be allowed to buy them, because they were drawn randomly right before your opponents purchase phase. Has there ever been a good game with a card river?\n\nThis has all of the bad things about deck building with none of the good (the good requires control over the contents and the cycling of your deck, and frequent shuffling, eg dominion). There's really zero efficient deck management actions on the action board, the trashing spots are not worth an entire worker action. In this respect, Factions are wildly imbalanced when it comes to deck management and how well they can use good cards (Factions that trash with their signet action, especially when randomly served with great cards they can afford, dominate).\nYour randomly drawn hands limit your actions the same way the draw bag controls War Chest (aka chess but bad when it counts), you might just be dealt an awful round at key moments, which would be fine if the game were shorter, but one bad hand sticks with you for half an hour. Dominion works because the deck control is extremely high, the market is equally available to all players, you shuffle dozens of times, and the game is over in fifteen minutes. This is a shambling 3 hour monstrosity.\n\nThe point scoring system is as bad as they come. Like most limp modern euros, the game artificially creates a close end-game point spread then has a wild final turn. The majority of the points in the game (the faction bumps) are participation trophies. The remaining points have wildly differing costs. Some combats are hard fought, and others just showing up is enough, and you can't predict the mood. The intrigue cards award points basically at random. No one sees enough intrigue cards to have truly chosen a set that matches their plans, but then end game comes and people pull 3 points out of their hat like a magic trick, with cards that finish scoring half-completed objectives you couldn't possibly have counter played.\n\nAnyone who likes modern board games can find fun in pulling levers and collecting resources on their turn, especially if they win. There are two criteria I look at with every game\n1. Am I still having fun when it's not my turn? Do I care what other people are doing? Does it create new opportunities in the gamespace? do I have agency to respond? Are we negotiating? Are we even just laughing about what people chose to do? Absolutely not in this game.\n2. When the game is over, does the whole table agree the player who won played the best? and then can we examine the choices they made and understand what they did well that we can emulate in a future game? No, not really.\n\nThe art direction chose to use the faces of famous actors from the vile and lifeless recent movies, which just instantly dates the game to the era. Oh, look, it's Lil Timmy Mumbles, Christopher Walken, and the jock from the goonies.\n\nThe acclaim this inane game gets make me feel sad and alone in the universe. I had to listen to the soundtrack from 'There Will be Blood' from start to finish to process the feelings of isolation and despair.",
    "timestamp": 1760911200
  },
  {
    "username": "JasonMerosa",
    "rating": 3.0,
    "comment": "Quite confusing, still somehow one my first game.",
    "timestamp": 1760652000
  },
  {
    "username": "Maximaler",
    "rating": 3.0,
    "comment": "Habe das Spiel zweimal gespielt, beides Mal war ich froh als es beendet war. Jeder spielt da hauptsächlich für sich. Ich mag Spiele lieber wo die Platzierung nicht von der Punktevorstellung des Autors abhängt.",
    "timestamp": 1754776800
  },
  {
    "username": "GuySamstag",
    "rating": 3.0,
    "comment": "Rudimentary card market, boring worker-placement, asinine \"conflicts\", and I'm not sure why it's a deck-builder -- maybe the designer is not aware of other card management mechanics? I can't hardly recall any good points about this game: the faction control is alright I think.\nHad some fun once keep going through the swingy objective cards or whatever they're called to score some ungodly amount of points.",
    "timestamp": 1748642400
  },
  {
    "username": "davidmleal",
    "rating": 3.0,
    "comment": "After playing another game I downgrade this game from a 5 to 3.\n\n\nThis game tries to be a mix of deck building and traditional worker placement, but for me does not work. Never have the feeling of deck building because the game end i see good combos, and for worker placement is just meh.\n\n\nI would prefer to play a Star Realms for the true feeling of a deck building or for a worker placement playing a Everdell and have a great time.\n\nDune: Imperium current Rank 6 in BGG, i just don´t see what is great about this game that tries to be mix 2 mechanisms but for me does not work well.",
    "timestamp": 1745704800
  },
  {
    "username": "namle",
    "rating": 3.0,
    "comment": "Another reskinned worker placement game with a twist.",
    "timestamp": 1742252400
  },
  {
    "username": "pingus",
    "rating": 3.0,
    "comment": "I really like the initial concept, but the execution is not to my liking\n\nMy concerns:\n- it's very easy to lock yourself out of \"clan\" worker spaces and it makes the game very newbie unfriendly\n- the Ascension style row of market cards without the ability to redraw the market & without any kind of fluctuation between rounds can cause a lot of frustration\n- new cards have a power spike around cost 5 from what I've seen so far, which can result in an early snowball\n- Intrigue cards are from hero to zero, mixing significant point scoring cards with economy boosters in one deck is always a terrible idea\n- there seems to be quite a lot of worker placement spots that won't be ever taken\n- there are few point scoring opportunities - this results with everyone kinda doing the same thing\n- only 2 clans \"combo\" with each other Star Realms style. I never liked the mechanic as it increases randomness and trivializes the choice of buying new cards\n- there are rules that really could be taken out for streamlining purposes (battles for specific spots or at least \"defense\" in those spots). They don't seem to add anything important to the game\n- There are some small timing/wording issues with intrigue cards\n- Big kingmaking opportunities and the game usues a bot for 2 players\n\nOverall I wanted to like, but every time I played it (over 10 times) it felt like a chore that I eventually just decided to stop doing, because unlike dishes I don't have",
    "timestamp": 1739487600
  },
  {
    "username": "ernestns",
    "rating": 3.0,
    "comment": "Rise of Ix expansion is essential, really cannot enjoy the base game without it.",
    "timestamp": 1736550000
  },
  {
    "username": "Generalkhun",
    "rating": 3.0,
    "comment": "Why this game is so hyped? Most confusing things on the hobby, Not sure how to get fun playing this. The deck building seems not very strong, You may not get anything workable from the market without huge amount of luck.\n\nThe intrigue cards make it even worse. swingy enough to break the spirit of a Euro game. How is it possible to rate this game as high as 8-9, Just not get it",
    "timestamp": 1736377200
  },
  {
    "username": "Osmanthus",
    "rating": 3.0,
    "comment": "Ameritrash in a euro trenchcoat.",
    "timestamp": 1734303600
  },
  {
    "username": "kolonelk",
    "rating": 3.0,
    "comment": "I don't think this does a particularly good job of meshing the worker placement and deckbuilding aspects. I'm also never likely to rate a worker placement game above a 7 anyway as I find the mechanic kind of boring and frustrating, especially when learning a game against more experienced players. We tried this with 2 learners and 2 veteran players, and it was not enjoyable. Variation in leader quality also marred my impression of the game.\nI could probably be talked into another game of it, but I'd rather reach for a lot of other games instead.",
    "timestamp": 1734303600
  },
  {
    "username": "Nijoth",
    "rating": 3.0,
    "comment": "A mishmash of mechanics that barely fits together, lots of randomness and very soft interaction. Not my kind of game. Expansions killed what little enjoyment there was to be found.\n\nUpdated 240916: after several online plays even the basegame is a swingy mess not worth the time at all. A lazy design where almost every game is decided by who drew the better hidden intrique cards.",
    "timestamp": 1726437600
  },
  {
    "username": "Pkolt",
    "rating": 3.0,
    "comment": "My opinion is an unpopular one, and perhaps derives more from the people I played this game with than the game itself.\n\nWhat I most disliked about this game is the frequency at which my investments did not pay off. Like, seriously, this is the only heavy game I've ever played which if you are still learning and playing badly or against more experienced opponents, the mechanics seem to basically shut you out of making any progress at all. It's extremely frustrating.\n\nDraw a good hand to play the conflict? Well, if someone else drew a slightly better hand and you have no use for the consolation prize you are screwed. Draw a good hand for buying cards? Well, you better hope there is something interesting in the market, otherwise you will be flushing your influence down the toilet, or you will face the classic random-market-deck-builder scenario of having to pick up shitty cards just so a good card becomes available for your opponents to buy on the next turn. Draw a good hand for faction actions? Well, you better hope you can get the resources you need to pay for them or those will go to your discard pile without you being able to make use of them and you will have to cycle through your entire deck again (which, by the way, if you're last in turn order is probably not going to work out).\n\nAt least if I sit down to, I dunno, like Brass or Gaia Project or something and I have no idea what I'm doing I can still play and try to score some points while losing badly. Not here.",
    "timestamp": 1725055200
  },
  {
    "username": "darkskies",
    "rating": 3.0,
    "comment": "If you are unlucky with the card draw on the first or second turn, you can really be shafted and there is no way to recover. Definitely shows a lack of playtesting. Far better worker placement games out there. Avoid this.",
    "timestamp": 1719871200
  },
  {
    "username": "mrouricio",
    "rating": 3.0,
    "comment": "Cons:\n- Corridor strategies with little choice\n- The game points system (oh, that “point” that just vanishes into the audience)\n- Horribly dumb combat mechanics\n- Overall setting feels forced onto the game mechanics, like an owl being stretched over a globe through its poor owl behind, a common trait in Eurogames where the setting could easily be about cutting watermelons or shearing sheep.\n- Consequently, there’s no atmosphere.\nPros:\n+ Workers with a beer will enjoy it for mindless evening sessions every day.",
    "timestamp": 1717538400
  },
  {
    "username": "iplaybgnaked",
    "rating": 3.0,
    "comment": "Decent amalgam of worker placement and deckbuilding, and while it is significantly more interesting in practice than its contemporary Arnak. D:I never rises above its linear strategy and obvious optimal moves to be something worthwhile to play over other euros.",
    "timestamp": 1710284400
  },
  {
    "username": "Permagamer",
    "rating": 3.0,
    "comment": "too long, too random, more work than fun",
    "timestamp": 1707001200
  },
  {
    "username": "DanFred",
    "rating": 3.0,
    "comment": "A typical worker placement game. Probably a well designed game that rewards repeat plays but feels like it overloads you with options, highly depends on the card in your hand, minimal player interaction, total abstracted which could be about anything, and goes on too long. Does nothing new or original and not at all my type of game.",
    "timestamp": 1704668400
  },
  {
    "username": "qtzlboardgamer",
    "rating": 3.0,
    "comment": "Deck building, worker placement, and bit of combat make this a clever game. Not sure if the theme helps or hinders (in the case you might not be into Dune)",
    "timestamp": 1703458800
  },
  {
    "username": "Makai",
    "rating": 3.0,
    "comment": "I'm impressed at how the designers manager to combine the worst elements of a worker placement game with the worst elements of a deck building game.",
    "timestamp": 1701039600
  },
  {
    "username": "JoshuaStarr",
    "rating": 3.0,
    "comment": "This game, to me, captures the primary issues I've seen in the last 10 years of board game design. The game creates an illusion of interaction or decisions, but in reality the game is playing itself and you're along for the ride.\n\nI imagine the icon matching mechanic for worker placement was meant to create tough tradeoffs, but the reality is that the cards dictate what to do on your turn. It is not hard to find the most efficient action as the resource collection and conversion economy is simple (yet somehow clunky?) and it's just a matter of being able to take the most resource efficient actions based on turn order and card draw.\n\nThe \"deck building\" is based on a random offering of 5 cards. I get it, conveyor belts are a way to create a card market, but you are just building the deck the game gives you, not one you have built yourself. Not to mention that you really shouldn't have deck building as a mechanic without active deck cycling. In this game, you add 5 - 10 cards to your deck and hope you draw them over 10ish turns reshuffling your discard maybe 3 or 4 times. A key aspect of why deckbuilders work is because you can create synergies between cards and efficiency to have those cards on the same turn more often. This game offers little to no synergies or efficiencies. They exist, but not in a way that meaningfully impacts your turn.\n\nI'm all for borrowing ideas from other games and improving on them, but this one didn't bring anything new to the table for me.",
    "timestamp": 1700262000
  },
  {
    "username": "whiskeyface",
    "rating": 3.0,
    "comment": "Played a few times. Never any fun. A lot of better games out there.",
    "timestamp": 1692482400
  },
  {
    "username": "agriancito",
    "rating": 3.0,
    "comment": "Boring desicions, uninteresting conflicts:",
    "timestamp": 1687989600
  },
  {
    "username": "AbgalAzag",
    "rating": 4.0,
    "comment": "Pre-ordered from Miniature Market.\nNice design, Worker placement with deck builder in Dune universe theme.\nKinda 2-3 hours game long.\n\nUpdate 1\nplayed 30 times. Bad deck building part, unbalanced cards, too much time for a euro game.\n\nUpdate 2\nMaking homebrew to fix part of the game which we dont like, tested like 20 games more, better, but still imbalanced cards and luck based \"possible actions\" from cards is terrible.\nbad design, plain euro, pure luck, will not play this again, prefer true Dune game instead!\n\nUpdate 3\nAfter i saw new expansion video and designers emotions and what they says, no other thoughts, just literaly cash grab, only disrespect",
    "timestamp": 1759788000
  },
  {
    "username": "Yuri",
    "rating": 4.0,
    "comment": "5/10 with 3 players\n4/10 with 4 and 2 players\n+1 with some house-rules",
    "timestamp": 1758578400
  },
  {
    "username": "eddieb",
    "rating": 4.0,
    "comment": "Repeat games have gotten boring. Hopefully expansion will bring it back. As it stands, no desire to play again.\n\nEach expansion makes me want to play it once more. I've tried both. I'm done with it. Such a boring, luck driven game. I've won 3 of 6 or 7 games I played. 2 of those on a tie breaker card from the intrigue cards... Usually first to last place is a 1 point difference, with everyone having the same 4 points from alliance tracks. Not a big enough game to have as much luck as it has. But somehow it still locks people up for super long turns. UGGGG. I wanted this to be a great game. To be fair. I don't really love deck building.\nLooking at it a year later. After several expansions. Just not a game I have any interest in playing again. I play it cause someone in my group loves it. But it's so boring, luck driven. Did you draw the right card. Out of the 100 in the deck. Just a complete waste of time.",
    "timestamp": 1754690400
  },
  {
    "username": "myyysha",
    "rating": 3.5,
    "comment": "The essence of what was bad on deckbuildings, before new designs brought some twists into pure DB. Randomness, unbalanced cards and your turn is pre-destined by the cards you draw.\nWhy is this rated so high is completely beyond me.\n\n(The fact that I don't like Dune as such probably doesn't help.)",
    "timestamp": 1753912800
  },
  {
    "username": "Thorus1984",
    "rating": 4.0,
    "comment": "Worker Placement, aber gar nicht mal so gut. Auch optisch auf dem Tisch sehr langweilig. Mit Drittanbieter-Materialien kann noch etwas Atmosphäre herausgeholt werden und mit den Zusatzboxen und Addons kommt noch mehr Atmosphäre auf. Aber Dune ist das beste Beispiel für ein Game, das als Grundspiel allein nicht überzeugen kann. Dafür ist das Gameplay zu trocken. Und das ärgert mich, denn ich bin Dune-Fan. Aber das Spiel fängt weder die Atmosphäre der Filme noch der Bücher ein-\nHinzukommt, dass sich der Einzelspieler-Modus kaum vergleichen lässt mit dem Mehrspieler-Modus. Hier wurde künstlich etwas angebaut, damit der Publisher \"ab 1 Spieler\" auf die Schachtel schreiben kann, weil man damit womöglich mehr Käufer findet. Der 1-Spieler Modus ist grundsätzlich als schlecht zu bezeichnen. Dune Imperium ist (leider) eine Lizenzgurke, die haufenweise auf Kleinanzeigen verramscht wird. Das ist das einzig Gute: Wenn du denkst, es könnte dir gefallen, bekommst du es für unter 20 €.",
    "timestamp": 1753653600
  },
  {
    "username": "weidox",
    "rating": 4.0,
    "comment": "Worker placement (well implemented with varied thematic locations) + outdated/unbalanced random buy card row (Ascension style, plays very poorly, mostly luck dependent) + majority contests each round for extra bonuses (works fine) + getting secret intrigue cards (very unbalanced) + deck shuffling (with little of deckbuilding as there's almost no deck trimming and max 10 rounds) + Dune theme. Would be a good game as effort is seen in the design, but the card row randomness decides winner and kills the game, amplified by randomness of intrigue cards. You may have just nothing to buy if card row is all low value trash, and then it's luck again if you can get good cards.",
    "timestamp": 1753394400
  },
  {
    "username": "IAmYourAlly",
    "rating": 4.0,
    "comment": "Not thematic and not my style, it does all the things (worker placement, deck building, combat) worse than other games.",
    "timestamp": 1751234400
  },
  {
    "username": "_Dynomite_",
    "rating": 4.0,
    "comment": "Over hyped in my opinion. Alright mix of card auctions and worker placement. But been there played that. The newer versions fixed all the broken stuff but still isn't fun. There's already 1000s of games that do this.",
    "timestamp": 1749420000
  },
  {
    "username": "treunes",
    "rating": 4.0,
    "comment": "I must admit, I am NOT at all familiar with the books, the movies, ... so for me the theme did not ring a bell. This game combines deck building with worker placement, and for me this did not work that great together, because sometimes you want a certain spot/action (so there is competition with the other players) but you lack the card to do so... There is some mitigation, but not much. Also I had the impression that there is a runaway leader problem in this game. Maybe I will play it again, but I'd rather play other games...",
    "timestamp": 1743458400
  },
  {
    "username": "Rackerstar",
    "rating": 4.0,
    "comment": "Nem lett a kedvenc játékaim egyike.",
    "timestamp": 1743030000
  },
  {
    "username": "azeem",
    "rating": 4.0,
    "comment": "This game feels like it was designed on a dare to use a combination of worker placement and deck-building. It succeeds in being functional, but I did not find it fun.\n\nThe game seems to reward being opportunistic, rather than building up an engine as one might expect from a deck-building game.",
    "timestamp": 1741042800
  },
  {
    "username": "Atrope",
    "rating": 4.0,
    "comment": "Un juego que quiere hacer todo y se queda corto... No entra por los ojos , materiales muy mejorables",
    "timestamp": 1740870000
  },
  {
    "username": "BigspenderPL",
    "rating": 4.0,
    "comment": "I've come to realize after many games that the game is wildly chaotic in a bad way. The actions I can take are determined by the symbols on the cards. I have to choose a hand with them and hope that no one will occupy these squares for me (which happens regularly in games with 4 players). Sure, I should buy cards from the market so that I have a variety of symbols. But the market can also be terribly random. At one point, card prices were so high that they were completely stagnant. The cards have such a random combination of effects and symbols that even buying them did not always make sense, and the \"money\" was lost (it does not go to the next round). There was only one space in the game that guaranteed cards were removed from the deck, but it was so expensive (unless someone blocked it for you) that it often didn't make sense. Intrigue cards should be dealt BEFORE the game so that there is no situation where I get a useless one or even draw one that ACCIDENTALLY wins the game. This one is a mess. It pretends to be a heavy strategy game, but in reality the level of control over anything is very low.",
    "timestamp": 1740092400
  },
  {
    "username": "Ashiva",
    "rating": 4.0,
    "comment": "New review posted 2025-01-12 after playing 4-player (and after having gained some more experience in the hobby): downgraded from 6 to 4.\n\nI was hopeful that playing with actual thinking, breathing humans would perhaps make the gaming experience more enjoyable, but I really don't get what people see in this game. It is a jack of all trades but a master of none; an unrewarding slog with many issues and I'm not confident I see a way for all of them to be fixed by the addition of house rules or even expansions. I maintain that the theme is absent and this is essentially a convoluted abstract in an ugly, devoid-of-soul package. It also takes far longer than 2 hours to play with a full table, making it a snoozefest. For that kind of time investment, there are better games you can bring to the table.\n\nI do wonder what has driven the average BGG user to rate this game so highly. Complexity for complexity's sake? Thank you, next.\n\n------\n\nReview below from 2022-01-04 after playing several games of 2-player with the app randomly choosing 3rd player actions:\n\nKind of disappointed!\n\nPros:\n- Not terribly difficult to learn\n- Setup/takedown is not very long\n- Lots of variety\n- Some amount of planning (both short-term and long-term) required, but not enough to make it feel like boring ol' chess\n\nCons:\n- Deck building element is extremely light; combos seem to happen only once in a blue moon, especially in 2-player games since there's less turnover in the store\n- Cards, board, and meeple are kind of ugly\n- Board could have been bigger so as to accommodate e.g. the store, intrigue cards\n- Thematic element is also very light; it feels like a reskin of some other game\n- Movie edition included personages from later books for some reason? What if they are included in future films and suddenly the game no longer matches the movie?\n- Bot play (when playing solo or 2p) is flat and there seems to be a lot of RNG with respect to the battles. App does literally nothing but flip through its cards. I think this aspect is the one I hate the most - that in order for this to be more than a mediocre game, you *need* 3-4 players.\n- Box quality is awful - board doesn't lay flat, there are no separators for cards, and cards don't have a fitted space in the box\n\nOverall feels like a cash grab. I just don't understand the universal acclaim for it. I may end up selling.",
    "timestamp": 1736636400
  },
  {
    "username": "farmergiles",
    "rating": 4.0,
    "comment": "After a while you start to notice more issues creeping up beyond the simple fact the game is ugly as sin. This is incredibly overrated.\n\nThere's quite a few balance issues that have arisen. A lot of the cards in the deck are straight out garbage and there's no rule for the tableau display to auto-scrap cards so it clogs up with trash so fast. Some cards like Worm Riders are overpowered. There's only 2 scoring cards in the Intrigue deck that are not only easy to achieve but basically can auto-win the game for anyone lucky enough to get them. Some spaces barely get used. It's practically mandatory to get your third worker so the game is a bit on rails. Just a lot of small problems that are adding up to one big thing. It started off as an 8, it's down to a 6, might even go to a 5 eventually and it's probably a cull from the collection.\n\nArnak which this game weirdly gets compared to, is just 10 times better.",
    "timestamp": 1736290800
  },
  {
    "username": "TheGiN",
    "rating": 4.0,
    "comment": "1-4\nBest: 3-4\nsleeved",
    "timestamp": 1735599600
  },
  {
    "username": "Akado",
    "rating": 4.0,
    "comment": "Very neat! There's a lot of powers, but it's got a deckbuilder foundation with a lot of stuff on top of it. Can't only focus on one aspect, even if you're the Bene Tesserit.\n\nUpdate after more plays:\nThe base game is...swingy like ameritrash but promises strategy like a heavy euro. Very basic, feels simplistic, with the wild swings of intrigue cards (some give 1 water, some give 2 VP, some give 2-10 swords), the market row being not in your control, and the conflict cards adding to it.\n\nI cannot stand a long game that has such wild swings of luck, where one player can do \"everything right\" and lose because their opponents simply got better cards. That isn't losing because of player agency.\n\nRise of Ix at least felt like more player agency, but I can't help but wonder if future plays would present a bell curve of play experiences, with some being frustrating and helpless?",
    "timestamp": 1734476400
  },
  {
    "username": "tolhs",
    "rating": 3.5,
    "comment": "2024:+1",
    "timestamp": 1733958000
  },
  {
    "username": "dtmoney75",
    "rating": 4.0,
    "comment": "2 Plays\n\nPlayed at: 3 & 4",
    "timestamp": 1731884400
  },
  {
    "username": "SpiritChef",
    "rating": 4.0,
    "comment": "Really didn't enjoy this one. Theme tacked on, swingy cards, deck building was under whelming. Don't want to go near this one again....",
    "timestamp": 1728943200
  },
  {
    "username": "johncole",
    "rating": 4.0,
    "comment": "For me this game was a disappointment on several fronts (taking into account the fact that I am a follower of the literary saga). And since the recent reprint is practically the same, my opinion is applicable to it too. Of course these are my opinions.\n1)The box is too big for the contents.\n2) The components in just sufficient quantities. At some point in the rules it is written that if during the game they should be scarce to replace them with other material (like the dear old colored buttons of the grandmother).\n3) The price could be 20% lower on both editions.\n4)The setting\nNot existent. Putting the names of the various subjects of Dune is not enough for anything. It could be anything even on the day of the market in the village.\n5)Despite the idea of the mechanics as a whole is good, their development and dynamics that arise in the game, reveal a superficial and unprofessional playtest. How could a publishing house of this level and a good creator have produced such a poorly curated thing?\n6) The race to 10 victory points and the various ways to get them, in some ways reminded me a lot of the settlers of catan. But unfortunately while they are obvious that the dice are thrown and what happens is good, here the addition of randomness of the various parts (deck building, cards intrigue, player’s turn, powers of the houses), leads to a management chaos that is often more of a pain or boredom than fun.\n7) The very high rating was given by me enthusiasm for a game labeled Dune that came far away from the first (now old even if with mechanics still good). Once you get on the table, you see the problems and are disappointed in many ways.\n\nIn the end my advice is: \"play but don’t buy it\".",
    "timestamp": 1727992800
  },
  {
    "username": "andsten",
    "rating": 4.0,
    "comment": "The combination of the luck of the draw and the rotating first player mechanic can hose you over in a way that may be tricky to recover from. I usually enjoy most well thought out games, at least once or twice, and this game is indeed well thought out, but the mechanics suck the fun out of it. Want to like it, but do not.",
    "timestamp": 1726005600
  },
  {
    "username": "Eternalsun",
    "rating": 4.0,
    "comment": "Nice deck building and solid euro game, very thematic with a solo well designed (with 2 other factions).\nHowever, I see nothing exceptional here.\nI guess the game is not for me (no exploration, no long term evolution, no narrative or campaign, ...).\nI prefer the depth of Terraforming Mars.",
    "timestamp": 1724536800
  },
  {
    "username": "mawilson4",
    "rating": 4.0,
    "comment": "Not good on several fronts. Some highlights:\n\nEndless wheel of resource conversions and faction tracks to unlock...more resources. Yawn. Even special abilities are barely thematic. They're just more \"stuff\" to internalize. The rulebook doesn't help in this regard, with a fair number of special cases that make it feel less streamlined than it could be.\n\nBlocking-as-interaction. Yawn. Worse, you don't have time to proactively block when resources are so scarce, so the blocking is accidental, acting as randomness instead of intentional player interaction. Also, unlucky card draws and turn order will block you just as often, meaning that its scarcity (and frustration as a result of this) is baked into the design.\n\nThe game's combat isn't combat. Not really. It's just another resource to acquire and optimize. Only intrigue cards sporadically inject something unexpected. Regardless, it lacks the visceral excitement of actual combative games. Limited combat-cube slots also often means winners in crucial rounds are determined by turn order, not via tactical play. It gets compared occasionally to Arctic Scavengers for its combat phase, but that one features psychological factors like bluffing, double-bluffing and escalating brinksmanship over combat bonuses. No such possibilities exist in D:I.\n\nI see almost zero thematic connection overall. It's borrowing an IP for sales, not making a thematic or narrative statement through gameplay.\n\nWorker placement and deckbuilding aren't my preferred mechanics, as they seem to culminate in games I dislike. But I still struggle to see the love for this one, which seems to lurch instead of run in several key areas.",
    "timestamp": 1720562400
  },
  {
    "username": "Rafle",
    "rating": 5.0,
    "comment": "Regalo aniversario",
    "timestamp": 1761429600
  },
  {
    "username": "Zelu1",
    "rating": 5.0,
    "comment": "disappointed by the only few viable strategies which mean there's less options for players",
    "timestamp": 1761343200
  },
  {
    "username": "dj_koen",
    "rating": 5.0,
    "comment": "This game is pretty boring and uninteresting\n\nThe deck building aspect is really under cooked and the rest of the game is uninteresting",
    "timestamp": 1759528800
  },
  {
    "username": "UndutifulCarrot",
    "rating": 5.0,
    "comment": "This one might be better with 3 or more but we were never going to table it with friends with all of the other games we have and prefer to play. The automa at 2 was not fun to upkeep and really detracted from the experience for us. Combine that with no real connection to the theme and it's not a fit for our collection",
    "timestamp": 1758405600
  },
  {
    "username": "FaytParkour",
    "rating": 5.0,
    "comment": "",
    "timestamp": 1758232800
  },
  {
    "username": "TheGoddamnDuke",
    "rating": 5.0,
    "comment": "again, I hate game mixing mechanics (here deck building and worker placement). Discarded.",
    "timestamp": 1756764000
  },
  {
    "username": "Restlin158",
    "rating": 5.0,
    "comment": "Too much luck for such a heavy game. From the intrigue cards, to the way you draw your deck and the market.",
    "timestamp": 1754604000
  },
  {
    "username": "adi_venturer",
    "rating": 5.0,
    "comment": "\"Generic worker placement and deck building: Imperium\".\n\nI keep going back and forth between 5 or 6 for this one. The game starts off as a worker placement/deck building Euro and then becomes quite swingy in late game. I typically don't mind swingy games, and I appreciate what the designer was trying to do here by introducing direct conflict in a Euro game, but this game just hasn't worked for me. Thematically, any Dune game should involve a lot more conflict, politics and intrigue. This game could have had a completely different theme and it won't change the gameplay one bit. If you're a fan of the IP, I highly recommend the OG Dune game or Dune: War for Arrakis for a rich thematic experience.\n\n(Plays: 2, both times with all expansions)",
    "timestamp": 1753653600
  },
  {
    "username": "sykano",
    "rating": 5.0,
    "comment": "crunchy worker placement game with deck building and with Dune theme\nwith combat\nnicely thematic\nnot all that deep, but has its moments\nbut can be quite frustrating sometimes\nDecisions can be very tough (->AP) although agency is often limited and a lot comes down to luck.\n\nRating reduced due to production quality issues with the wooden components!!\nRating reduced due to too many expansions and follow-ups. I really don't like the expansions and I hate that there is a replacement game coming with \"Dune - Imperium Uprising\"! This is really atrocious!!\n\nI'm neither high on the Dune theme nor on the mix of worker placement with deck building, but it works.\n\nThe graphic design is not great, quite a bit too functional especially on the board. The pictures should be bigger and especially the combat area should have artwork instead of a big ugly symbol.\nFlavor text on the cards would have been nice.\nMechanics are reasonable but not groundbreaking. I actually like that they're used somewhat thematically.\nBut the game design is too tight and games end too early.\n\nOn the whole I can recommend the game only to people who know the Dune IP well and like it. The best feature of the game is the thematic ties (characters, intrigue cards, game dynamic, faction space abilities, places, some card tropes, combat).\n\n\n+ mechanics (combination of deck building and worker placement, integration of conflict/combat in this kind of game, intrigue cards, faction allegiance tracks, multiple uses for cards, ...) and how they're used somewhat thematically\n+ asymmetric player powers (!)\n+ sometimes seemingly thematic moments (!)\n+ materials (good in theory, but sadly some huge production quality issues with the wooden components!)\n0 the Dune theme\n-- huge production quality issues with the wooden cubes (even after getting replacements) (!!), also components of the yellow player are not yellow\n- very luck-dependent (!) especially with the intrigue cards but also with cards from own deck and what comes up in the market\n- deck building too limited, worker placement severely limited by cards\n- game design too tight (cards don't do much, even faction cards can't 'talk' to their own faction, game ends too early, can't do needed actions, ...)\n- balancing issues (some strategies, some spots, some leaders, some cards)\n- a bit overstreamlined, could have a bit more to it\n- solo mode flawed (very swingy, very luck-dependent, no market impact, two opponents drawing from one automa deck can lead to very unfair results(!), some spots ignored, ...), 2-player against oneself is much more enjoyable (!)\n- artworks and graphics design could have been quite a bit better\n- box-sized manual is awkward, insert suboptimal\n- heavily card-based (sleeves necessary)\n- expensive\n\nSmart choice to put most unnecessary bling (miniatures, ...) into a separate upgrade pack. But bad choice to drop the ball on quality insurance of the wooden components ruined it for me!\n\nIt's disturbing that a lot of faction cards don't let you place on that faction's spots. You almost always need to draw your one Diplomacy card or fold space to get anywhere with the factions.\n\nSolo mode is flawed. Developers forgot to simulate the market impact. And using only one deck for two opponents can lead to one opponent getting all the weak cards while the other snatches all the Heighliner spots. Additionally the big combat bonuses make them very powerful and swingy in combat. And there are spots where the automa never goes to (research station, sietch, CHOAM, Mentat, ...). What the automa does is pretty chaotic and luck-dependent. The fact that the human player is restricted by what comes up in the Imperium Row and 2 automa players are not, does not work well.\nThe automa deck works fine to enable the 2-player game, but not great for Solo. (!)\n\nI really like the intrigue cards, although very luck-dependent. They're a bit like the action cards from TI4 which have an epic feel to them. And in a Dune game intrigue cards greatly add to the theme.\n\n\nPhases I went through with this game so far:\n1. \"This does not look good. Doesn't seem great.\"\n2. \"Hm, it's somewhat thematic. Nice idea for a Dune-themed game.\"\n3. \"Oh, this is it? Does not work that great in Solo.\"\n4. \"2-4 player works much better, tense and nicely thematic\"\n\nWhen I got my copy, I was disappointed about the production quality. While most things were from ok to good, a lot of the wooden components showed damage and deformations, especially the cubes, although they're standard components which are fine in other games. Not sure how Dire Wolf messed that up. And what happened to the color of the yellow player's components?? These look like almost completely like natural wood, which is impractical in this game because it's harder to see on the sand-colored planet. :/",
    "timestamp": 1753567200
  },
  {
    "username": "Weirdsalmon",
    "rating": 5.0,
    "comment": "2025: played uprising and decided that dune imperium is simply not for me.\n\n5/10: Look. I know. Why is this down here? It’s got tons of things I love ! But I didn’t like my one and only playthrough of dune. I will try it again I swear.\n\nThis playthrough may have been ruined by the teacher withholding rules in order to help them win and by the nature of when I played it(was very new to the hobby)",
    "timestamp": 1751925600
  },
  {
    "username": "mrdollar11",
    "rating": 5.0,
    "comment": "The idea of deck building and worker placement together is fascinating but as a big deck building fan and someone who's not a huge worker placement fan. This game just left me wanting more interesting deck building and less of the board play. Definitely a me problem, but I don't really get the appeal.",
    "timestamp": 1750197600
  },
  {
    "username": "gabrielman",
    "rating": 5.0,
    "comment": "Based on solo: dry as you-know-what",
    "timestamp": 1749333600
  },
  {
    "username": "daemonn",
    "rating": 5.0,
    "comment": "2p.",
    "timestamp": 1747951200
  },
  {
    "username": "federik21",
    "rating": 5.0,
    "comment": "Ok game. It's all about getting lucky draws from your stack and the intrigues.",
    "timestamp": 1747864800
  },
  {
    "username": "Iron_Salamander",
    "rating": 5.0,
    "comment": "Just like the other version of this game, Clank! is more fun and not tied to an IP I dislike.",
    "timestamp": 1747605600
  },
  {
    "username": "Minh_Nguyen",
    "rating": 5.0,
    "comment": "Adventure Realms is my preferred game of this style, by far. I quite dislike this game, and the weird thing is it's somewhat hard to put into words exactly why. Largely overrated and overwrought, quite unthematic, visually unappealing, mechanically unappealing, and in my experience so far, the people who really seem to like this game are also terrible at teaching it. Turns me off like nothing else. Would not be even a little sad if I never played this again.",
    "timestamp": 1746309600
  },
  {
    "username": "realityfoible",
    "rating": 5.0,
    "comment": "I don't quite understand the hype around Dune Imperium. Regardless of which version I play, I always come away feeling that it's a fairly shallow luck heavy affair that long outstays its novelty.\n\nSucceeding at Dune reflects the random opportunities given by the game more than any cleverness shown by the players. It's a game that you can play poorly, but not one you can play well.\n\nThere's quite a bit of luck in whether the right cards become available in the markets at the right time to reward any particular strategy, and lucky draws from the Intrigue deck will handily king-make. This is on top of the luck of the draw already inherent the deckbuilding genre, where what you draw and when completely dictates play.\n\nDune is a random, silly card game with precious little left to player agency, wearing the costume of a serious multi-hour rules dense euro.",
    "timestamp": 1745704800
  },
  {
    "username": "RangerFox",
    "rating": 5.0,
    "comment": "Thematically it is a little bit off, the gameplay is sometimes hard to follow and there is too much randomness to be an enjoyable experience.",
    "timestamp": 1745618400
  },
  {
    "username": "Marell",
    "rating": 5.0,
    "comment": "Mechanically, a good game - but the theme is glued on. It has nothing to do with Dune...",
    "timestamp": 1743544800
  },
  {
    "username": "Johnathan Ray",
    "rating": 5.0,
    "comment": "Played only once so far, but it was brilliant. After my initial play, the area control- war aspect seemed stronger than the deck-building portion of the game, and I wanted the game to be longer. Plus, it didn't help that my friend Gabe Elliot forgot a key rule that he didn't tell us about until the end of the game, which would have given me about 3-4 more points since I had primarily concentrated on deck building.\n03/19/2025 update.\nI was right about the \"deck building\" aspect being poor in this game. You cannot skip combat- as you will not win!\nI ended up playing the game a few more times and then ended up begrudgingly selling it (even with all the upgraded components) because I noticed I just wasn't bringing it to game nights.\nToday, I just had an 8 hour torture fest playing the original Dune (2019) version. This was my 3rd or 4th time playing it, and I will try never to play it again. I'm giving this Dune a few fewer stars for it.",
    "timestamp": 1741474800
  },
  {
    "username": "arildoaim",
    "rating": 5.0,
    "comment": "Only played 4 times, but tried all 2-4pl counts and still fail to see the greatness all of BGG make it out to be. Its a decent and relativly fast and easy to teach game, that got a fair load of tension. But feels like a superfiller in a way that something is missing from being a epic adventure. Dont always have the agency i want, and somethimes feels like the game is playing me than im playing the game.\n\nHave to mention not usually fond of deckbuilders, and feel like trash down to the spaces i need, which sometimes can feel a little bit railroaded. 20 plays down the road maybe i have uncovered some other layers, but i doubt i get the chance. All players i played with are reluctant to put it to the table again...",
    "timestamp": 1741302000
  },
  {
    "username": "Mueckerling",
    "rating": 5.0,
    "comment": "After my initial catastrophic play of D:IU I've got the chance to play the OG under much better circumstances, but my issues with the game remain generally. As a deckbuilding game, D:I is too chaotic and bloated. All you can do is dictated by the cards, which you get through a random card row. Half of the deck consists of cheap cards which rarely get bought, because they are too weak and blow up your deck. When you don't get the right cards, you don't have any means to work around that. Since the cards allow to which worker spots you can go, this can be a problem for all the other implemented mechanisms. I like the worker placement part. I like the bidding for battle, but the underlying deckbuilding base is so underdeveloped for me, that I rather like to play much better and lighter deckbuilders like The Quest for El Dorado, which allow you to actually build your deck strategically.",
    "timestamp": 1741215600
  },
  {
    "username": "Willoo78",
    "rating": 5.0,
    "comment": "1 pt, 1 pt , 1 pt … 6 pts carte intrigue de la mort qui tue j’ai perdu ou gagné selon la chance. Enfin 2h à 2 pour finir sur un coup de chance. No merci",
    "timestamp": 1740265200
  },
  {
    "username": "ts0ng",
    "rating": 5.0,
    "comment": "It does some things well, but would have preferred some more flexibility in deck-building. Choices are fairly obvious and unsatisfying. This would have been better if the deck-building part of this game wasn’t so overstated prior to my first play. It’s fairly tacked on but without it what’s left is still fairly milquetoast wp. Furthermore the intrigue cards didn’t offer much to interest me either (see also comments on Amun Re)",
    "timestamp": 1740178800
  },
  {
    "username": "Blitz37",
    "rating": 5.0,
    "comment": "A good game but some turns can get very fiddly and you're stuck waiting for each person to do like 10 different slow calculations for a single move of an agent.",
    "timestamp": 1740006000
  },
  {
    "username": "adamscott",
    "rating": 5.0,
    "comment": "A good, thematic mix of deck building and worker placement. It's fun to play, but fairly random and likely doesn't have too much strategic depth.\n\nThe newer Uprising edition directly fires this edition.",
    "timestamp": 1739919600
  },
  {
    "username": "jmsmith2434",
    "rating": 5.0,
    "comment": "Includes Rise of Ix expansion",
    "timestamp": 1739228400
  },
  {
    "username": "Third_Era",
    "rating": 5.0,
    "comment": "",
    "timestamp": 1738710000
  },
  {
    "username": "psrx",
    "rating": 5.0,
    "comment": "It's alright. The gameplay is fine, fits the theme well enough, but the whole package is a bit abstract in a lame way. The mechanisms really stand out and it feels like you're cranking the gears, rather than playing the game. There's something to it, but it lacks something. (Much like the book, the world it paints is intriguing, but the characters in it feel like cardboard cutouts. Easy to like the theory of it more than the thing itself.)\n\nCulled (Still own digital)",
    "timestamp": 1737586800
  },
  {
    "username": "tectactoe",
    "rating": 5.0,
    "comment": "+Base Game [4.0] It's not to everyone's taste, but I like the combo-mechanic this shares with LOST RUINS OF ARNAK, i.e., part-worker placement, part minimalist \"deck builder\". Deck builder in scare quotes because you DO purchase better cards to improve subsequent draws, but it's a much leaner implementation of traditional deck building, and far from the only focus of the game (cf. something like DOMINION). It creates a strict and tight gaming experience with very little fat; every decision is critical and involves its own miniature optimization puzzle. I enjoy the combat system here, too - extremely simple to understand and execute, and the mitigation tactics and uncertainties (the Mentat, intrigue cards, etc.) create good tension.\n\n+Dune: Imperium — Rise of Ix [5.0] The base game is great, but this expansion is a \"must have\" for me at this point. It leaves most of the core mechanics alone while improving one major flaw: The sharp depreciation of Soleri during mid/endgame, implementing a brilliant \"shipping track\" system that also makes the base game's weakest faction much more attractive. I prefer the Dreadnaughts here over the \"worms\" used in the new UPRISING game(s).\n\n+Dune: Imperium — Immortality [3.0] The RISE OF IX expansion fixed what I’d consider a flaw in the base game. IMMORTALITY, on the other hand, doesn’t “fix” anything, because there was nothing left to fix. It merely adds additional chrome that, while occasionally fun, wasn’t needed and thus feels ancillary. Did this game really need a tech tree?",
    "timestamp": 1736290800
  },
  {
    "username": "missdragonara",
    "rating": 5.0,
    "comment": "Did not enjoy, which is a shame as I was excited for this one.",
    "timestamp": 1736204400
  },
  {
    "username": "jormungandr",
    "rating": 5.0,
    "comment": "Didn't get anything resembling a Dune feel from this one. On its own merits, I found it to have awkward iconography and clumsy gameplay.",
    "timestamp": 1736118000
  },
  {
    "username": "serewa",
    "rating": 5.0,
    "comment": "very unbalanced with no addnons",
    "timestamp": 1734908400
  },
  {
    "username": "kareds",
    "rating": 5.0,
    "comment": "This isn't my type of game. If it wasn't Dune themed, I wouldn't even give it a second glance, and playing it just makes me wish I was playing real Dune.",
    "timestamp": 1732662000
  },
  {
    "username": "hiimjosh",
    "rating": 5.0,
    "comment": "Deckbuilder where your deck cards have icons and you can do worker placement on spaces with those icons. It's fairly abstract and frankly a bit overhyped. Our 4p game clocked in at 2-3h which felt way too long for what is here. Points are hard to come by and they drag the game out. The game does have a lot of intertwining strategies (almost Race for the Galaxy style) which I think is really cool. The mechanics of the game though are pretty dull: the worker placement is generic, the resource management is generic, the deckbuilding is generic, the combat is generic. Together the game is better than the sum of the parts, however that's partly because the parts aren't impressive in isolation. If the game was faster I would like it more\n\nEDIT: Eh, this game is such a cube pusher. Very abstract and kind of heavy on the randomness. I don't know if I like it that much. This could've have just been a card game and it would have been tighter and kept all the good parts\n\nEDIT: Intrigue cards can get really swingy and introduce a lot of chaos. There is some slight mitigation and prep you can do but not much. Some counter action against intrigue cards would have been appreciated.",
    "timestamp": 1732489200
  },
  {
    "username": "LastDwarfOfMoria",
    "rating": 5.0,
    "comment": "Three hypoplastic games in a trenchcoat pretending to be one.",
    "timestamp": 1732143600
  },
  {
    "username": "HiHoSilver28",
    "rating": 5.0,
    "comment": "The board art is one of the worst that I've ever seen. Especially for a game rated so highly. Even the card art is weak. It feels just like initial pre-production art for the movie. I will say that the iconography is strong and enables easy understanding once you learn the game. The theme is weak, which was shocking considering the source material. The sand worms don't do anything besides drop spice, it doesn't feel like the Fremen have any role in the game besides being used as pawns, it just feels like petty squabbling and very not epic. Like I said, it feels very very weird that the theme is as weak as it is considering the source material.",
    "timestamp": 1731452400
  },
  {
    "username": "MrMonkey",
    "rating": 5.0,
    "comment": "Played the physical version a couple of times and the Steam game a bunch.\n\nI really hate giving this game a mediocre score. The mechanics; the deck building, combined with worker placement, combined with area and influence control. Seems amazing! However, most of the game's strategy is severely undercut by the random and swingy nature of the influence cards.\n\nI can get behind random and swingy, I love Cosmic Encounter. But Dune Imperium combines a long, dry game with this mushy core. It really feels that sometimes, no matter how you play, you are going to lose. Sometimes, that's fine ... but in this type/length of game, it doesn't feel good to me.",
    "timestamp": 1729288800
  },
  {
    "username": "tilikumc",
    "rating": 5.0,
    "comment": "I don't get the hype. It fine, just boring.",
    "timestamp": 1728424800
  },
  {
    "username": "Yondragon1981",
    "rating": 5.0,
    "comment": "I try this game with friends but we didn't like it too much. Might need a second chance",
    "timestamp": 1726783200
  },
  {
    "username": "bazyliszek10000",
    "rating": 5.0,
    "comment": "The game is good, but it's DB. So all the problems of DB are there. Random cards, cards don't come up, you can't go and occupy a field, you can get blocked, or you're forced to make suboptimal moves. Then there's WP, which means that if you already have a card and can go to a given place, it can be blocked by another person in front of you, and for a few more turns you may not have a card that will allow you to enter a specific location. So you can be blocked twice, by cards and by a player. Although the game gives the impression that I can always go somewhere, in games where I create some strategy, there is some tactics, I would like to have more freedom and fewer forced decisions to make. Too much of this random blocking, although the game is quite enjoyable. Scoring in this game is also a bit strange, sometimes you get points completely \"unconsciously\" just by doing what you have to do, other times you have a big problem finding a place where you can get points.\nRating down by 1 because I'd love to play the newer edition.",
    "timestamp": 1726437600
  },
  {
    "username": "BabyGoth",
    "rating": 5.0,
    "comment": "Funny mechanics, but a lot of bad cards you never buy (cause they plug your deck) bring a big downside to the game. High luck-factor with timing at your reveal turn with Persuasion and the cards you can buy.",
    "timestamp": 1723413600
  },
  {
    "username": "wkover",
    "rating": 5.0,
    "comment": "Was talked into trying three-player DI by a good-natured gamer.\n\nWhat I expected vs. what I experienced:\n\nConflict in multiple areas VS. Conflict in a single area (not a bad thing)\n\nA complicated ruleset VS. A straightforward system once the board spaces are understood (a nice surprise)\n\nUnexciting worker placement (my least favorite mechanic) VS. Unexciting worker placement driven by cards (warning: card hosage possible)\n\nA reasonable card market VS. A too-small market that can stall out\n\nThematic Dune-y stuff VS. No idea, since I haven't read the books in 20+ years and my movie memories are missing\n\n4 rating (painful) VS. 5 rating (won't get a second play, but glad I tried it)",
    "timestamp": 1722808800
  },
  {
    "username": "GlobeTrotting",
    "rating": 5.0,
    "comment": "Fine, but nothing remarkable",
    "timestamp": 1720130400
  },
  {
    "username": "dogzard",
    "rating": 5.0,
    "comment": "Not a fan of the whole Dune saga, so I didn't connect with the game as a whole, and the mechanics didn't really mesh well. Not one I'm eager to try again.",
    "timestamp": 1717279200
  },
  {
    "username": "DarwinFinch",
    "rating": 5.0,
    "comment": "The continued hype makes me want to revisit this one. Played only once, and the game felt like it was trying to do too many things at once.",
    "timestamp": 1716501600
  },
  {
    "username": "Tagorn",
    "rating": 5.0,
    "comment": "Horrible Solo Mode so low score for me.",
    "timestamp": 1714428000
  },
  {
    "username": "stormylu",
    "rating": 5.0,
    "comment": "Not good with 4 players (played with rose of ix and immortality twice), very frustrating worker placement, resource use distribution, and going last is terrible.",
    "timestamp": 1713996000
  },
  {
    "username": "Seefeder",
    "rating": 6.0,
    "comment": "Digital",
    "timestamp": 1762680060
  },
  {
    "username": "joanmoreno",
    "rating": 6.0,
    "comment": "Aunque tiene algunas ideas interesantes, como el doble uso de las cartas, se me ha ido desinflando por tener aspectos del diseño que me parecen bastante mal cerrados: cartas de intriga absurdamente flojas en comparación con otras (oportunismo excesivo para un juego tan largo), aperturas óptimas demasiado claras o el uso demasiado plano de los recursos.\n\nEl deckbuilding es un poco regulero: el mercado de cartas se puede estancar fácilmente con cartas caras o que apenas tienen uso, y las cartas del mazo ciclan muy poco. Además, hacia la mitad-final de la partida solo sale a cuenta comprar las cartas que dan PV, no hay muchas alternativas.",
    "timestamp": 1760997600
  },
  {
    "username": "AndrewRK",
    "rating": 6.0,
    "comment": "TENTATIVE RATING\n\nNeed to play this properly (everybody with the same starting deck) before I can settle on a rating. Overall though the flavour and gameplay aren't really as much to my taste as I was expecting.",
    "timestamp": 1760824800
  },
  {
    "username": "abaloo",
    "rating": 6.0,
    "comment": "A tester de nouveau pour se faire une idée plus construite.",
    "timestamp": 1760479200
  },
  {
    "username": "rseater",
    "rating": 6.0,
    "comment": "Very tight and neat game. You only get 2 actions on most turns, and both are very tough choices. The conflict rounds are tense but not random. The start powers seem to be balanced and varied.\n\nupdate: the more I play, the more I am frustrated by the random elements and arbitrary turn order effects. It was fun to explore, but I don't feel like I can get better at it or discover new strategies. It is thematic and varied, but more capricious that it first looks.",
    "timestamp": 1760392800
  },
  {
    "username": "Mr Mjeh",
    "rating": 6.0,
    "comment": "Great fun, lots of interaction, interesting gameplay\n\nA second play had more of the same as the first game - too much luck, especially in the Intrigue cards",
    "timestamp": 1760220000
  },
  {
    "username": "Beefy79",
    "rating": 6.0,
    "comment": "Played Mike's Copy",
    "timestamp": 1758146400
  },
  {
    "username": "Jpeddle9917",
    "rating": 6.3,
    "comment": "Needs a certain group to play with. Super niche game but in the right time and space fun.",
    "timestamp": 1758146400
  },
  {
    "username": "enavico",
    "rating": 6.0,
    "comment": "+ Very well implemented deck-building and worker placement mechanisms\n+ Good theme (it's Dune, after all)\n\n- The intrigue deck is a really annoying element that injects a huge amount of randomness into the game\n- Two end game scoring cards, randomly inserted into the intrigue deck: why don’t you give each player two end game cards to choose one from at the beginning of the match?",
    "timestamp": 1757541600
  },
  {
    "username": "calandale",
    "rating": 6.0,
    "comment": "Too much game state to keep track of. At least the 'worker placement' element is relatively light.",
    "timestamp": 1756850400
  },
  {
    "username": "Darlingo",
    "rating": 6.0,
    "comment": "This will upset some fanboys - but this is wildly overrated. It is certainly above average, but I don't find it quite round. I have two major issues: one of them is the shop for the deck buidling, I just don't feel like I see enough cards. What upsets me more is how the worker placement is limited by my card draw. This has certainly lost me games and is simply annoying, if there is just nothing you can do, because you shuffled your cards poorly. In this regard the system is too tight for my taste. I am also not as excited about the battle system as many are. It feels very uninteresting to me.",
    "timestamp": 1755381600
  },
  {
    "username": "TheMiddleAgedGamer",
    "rating": 6.0,
    "comment": "board is pretty ugly and whwartever. it jsut didnt really click for me. i didnt reallt like the whole needing the right card tto go to a space. timothee is cool thogh.",
    "timestamp": 1755122400
  },
  {
    "username": "Dion1974",
    "rating": 6.0,
    "comment": "Digital",
    "timestamp": 1753999200
  },
  {
    "username": "colinthil",
    "rating": 6.0,
    "comment": "Played once. The deck building part felt a bit auxiliary, worker placement being the most proeminent part. I liked how interactive it is, it has a similar arc as Hansa Teutonica, but of course does not match its depth and elegance. I can see how the different cards could keep the game interesting in the long run.",
    "timestamp": 1753740000
  },
  {
    "username": "VeStil",
    "rating": 6.0,
    "comment": "Dune Imperium is a tightly designed, slow-paced worker placement game that incorporates a deck-building mechanism. While it has the qualities I usually enjoy in a Eurogame—such as a focus on both short-term tactics and long-term strategies— it hasn't captivated me as much as I had anticipated.",
    "timestamp": 1753480800
  },
  {
    "username": "Desiderata",
    "rating": 6.0,
    "comment": "Reminds me a bit of Lords of Waterdeep, but with an area majority mechanic instead of the Intrigue card conflict. Has a bit more to it with the deckbuilding part as well. Seems to marry well with the theme (I have no familiarity) while still being a fairly easy game to learn and play.\n\nI think I prefer the theme and simplicity of Lords of Waterdeep over this game. Plus the theme just doesn't interest me despite having watched the film.\n\n7.25.25 Traded away.",
    "timestamp": 1753394400
  },
  {
    "username": "DeLorean88",
    "rating": 6.0,
    "comment": "I absolutely don't get why this game is rated so high. Basically a worker placement game with cards which determine where the worker can be placed. Only 2 (later 3) actions per round. Market fills up with cheap cards nobody wants. Don't even think about playing this with AP prone people.",
    "timestamp": 1752789600
  },
  {
    "username": "charmed_0215",
    "rating": 6.0,
    "comment": "Purchased June 2021",
    "timestamp": 1752444000
  },
  {
    "username": "Monte_Cristo_II",
    "rating": 6.0,
    "comment": "Original Dune is still the best Dune game in my opinion",
    "timestamp": 1751925600
  },
  {
    "username": "Ternal2",
    "rating": 6.0,
    "comment": "J1",
    "timestamp": 1751061600
  },
  {
    "username": "drewbadour",
    "rating": 6.0,
    "comment": "Willy Wonka is terribly thirsty and must fight the evil Professor Lambeau, and the WWF, to ensure suitable hydration in the confines of a huge cash-cow.\n\nD:I combines average worker placement with below average deck-building, which can apparently be improved by spending more money on myriad expansions.\n\nI dislike the film tie-in artwork, the dour production design, and the clunky wooden tokens. You can spend more than the price of the game on deluxe miniatures. Lovely.\n\nCombat is interesting, and the solo mode is nicely streamlined, but the game just isn't compelling for me. Dune Imperium is the wallet killer.",
    "timestamp": 1749852000
  },
  {
    "username": "sornars",
    "rating": 6.0,
    "comment": "Perfectly cromulent euro",
    "timestamp": 1749679200
  },
  {
    "username": "Elden7",
    "rating": 6.0,
    "comment": "trés bon jeu, mais qui peut se montrer un peu trop hasardeux, le deckbuilding est mal fait, les personnages sont déséquilibrés, et cest dommage qu'on ne puisse pas jouer sans eux. Je trouve ce jeu surcoté.",
    "timestamp": 1748556000
  },
  {
    "username": "Folofl",
    "rating": 6.0,
    "comment": "Better with expansions",
    "timestamp": 1748210400
  },
  {
    "username": "kurtrussell",
    "rating": 6.0,
    "comment": "After having played at least 200 games, with various combinations of expansions, I can confidently say D:I is very good, but not perfect.\n\nDeckbuilding is fun, but ultimately, you'll realize the game becomes a race to buy 'the good cards' from the market, after which it stagnates. Even with Immortality and the nuke token, it still feels like it's mostly just RNG who gets the right deck order to buy 'the good cards'.\n\nAnd 'the good cards' can be quite swingy. Some cards, like Liet Kynes, can break the game. But even more important, access to factions is crucial to get in this game. For those who don't know, it typically takes 8 actions to earn 4 points from faction tracks, maybe 6-7 with other boosts. You should also cycle your deck every 2 rounds. That means it's necessary to buy at least 1 faction access card to maintain point tempo.\n\nThis leads to the single biggest weakness of the card market, which is when it has a paucity of faction access and you're denied buying one. This results in extremely unfun games where you're at a point deficit without much to fight it.\n\nThe other biggest weaknesses D:I have: leaders are imbalanced. Ilban, depending on the expansion, can be busted OP. Intrigue draws are RNG and some are very overpowered (Corner the Market). Turn order has way too big an impact on the game.\n\nI think ultimately the design choices of D:I would inevitably result in a pretty strong meta, and that in a skilled game, way too much is determined simply by the random setup in a way that reduces fun over time.\n\nThat said, is this game still good? Yes. You won't notice many of these issues unless you play with a dedicated group, and you can easily get 5-10 plays before noticing some of these issues. But is it a flawless masterpiece of a game? No.",
    "timestamp": 1748124000
  },
  {
    "username": "tolding",
    "rating": 6.0,
    "comment": "It’s okay. I would need more plays to have a more definitive opinion, but the deck building and worker placement fusion felt a bit too constrained for my liking and the fortunes of card purchasing and intrigue card draw seemed a bit random.",
    "timestamp": 1748124000
  },
  {
    "username": "Mattias",
    "rating": 6.0,
    "comment": "Nice hand management/worker placement game with a great theme. Plays in a short time, but only allows for four players. The theme shines through and I like it, but it is of course nowhere close to the classic Dune game.\n\nThe expansions add a lot and the game has surprising depth for a cube pusher.\n\nAlliance and agent models painted.",
    "timestamp": 1747951200
  },
  {
    "username": "AdrianSantos0",
    "rating": 6.0,
    "comment": "Juego muy completo con toque de complejidad.",
    "timestamp": 1747260000
  },
  {
    "username": "geekshah",
    "rating": 6.0,
    "comment": "Rating based on solo, 2 & 3 players.",
    "timestamp": 1746050400
  },
  {
    "username": "mikethemoose",
    "rating": 6.0,
    "comment": "Good Dune themed deck building game.",
    "timestamp": 1745013600
  },
  {
    "username": "Tudodo",
    "rating": 6.0,
    "comment": "It’s such a hyped game, and I’ve honestly had fun every time I played it. But I never really feel the urge to play it, and I’d probably never suggest it. The spark just hasn’t really hit me.",
    "timestamp": 1744581600
  },
  {
    "username": "D3C6",
    "rating": 6.0,
    "comment": "Based on one play.\nWasn't a great time. A lot of randomness. Everywhere - the actions you are allowed to take the cards you can buy the battles etc. If it wasn't too long then it wouldn`t be a big deal but it`s just not my cup of tea. And also strange theme implimintation like harconens havigan ability to buy jesicas card. Still may be great for some.",
    "timestamp": 1744322400
  },
  {
    "username": "NoClueDough",
    "rating": 6.0,
    "comment": "on APP, only.\nNot vibing with it after a few attempts. Have not seen any of the new movies.\nWill try again later.",
    "timestamp": 1744149600
  },
  {
    "username": "wanne",
    "rating": 6.0,
    "comment": "bei Kai gespielt",
    "timestamp": 1743544800
  },
  {
    "username": "ryby726",
    "rating": 6.0,
    "comment": "The more I play uprising the more I realize that this version is obsolete",
    "timestamp": 1743202800
  },
  {
    "username": "ourmove123",
    "rating": 6.0,
    "comment": "A tense race-to-ten-points game.\n\nThe game is a combination of worker placement and deck building, where I feel both are decent, but not amazing.\n\nMany compare this game with Arnak, and I feel they are totally different games so it wouldn't be a fair comparison.\n\nArnak is a strict resource conversion game, while Dune: Imperium feels more like a strategic battler (as it appears that most game wins result from well-timed combat wins).\n\nThe theme is okay, as I'm not a fan of the Dune universe.\n\nInitial characters that you pick from have huge variation in power potential. Some will be lackluster while others have superb abilities.\n\nThe influence track race is implemented very well, and adds a level of complexity that adds to the tension.\n\nMy least favorite part is the randomness of intrigue cards and their huge variation in power levels.\n\nMy main concern with the game was game balance, in particular the intrigue/market cards and the heavy emphasis on combat for level-3 conflict cards, which results in combat spaces such as Heighliner being very powerful.\n\nBuying from the \"market row\" also felt extremely luck based as the powers of these cards also had huge variations in power levels.\n\nThere is market row stagnation when playing with two players, so house ruling the market row to flush cards was necessary. I.E. 6 cards in the market instead of 5, one-time option to wipe the whole market per player, roll a die for the AI's reveal phase which wipes out the corresponding card in that row.\n\nI felt the best part of Dune: Imperium was the tight race to 10 points. Every point felt worth it!\n\nI feel there is a great opportunity for more games to implement tighter point races where each point feels highly rewarding.",
    "timestamp": 1742857200
  },
  {
    "username": "Eyesis",
    "rating": 6.0,
    "comment": "It is an OK game, but the intrigue cards make it very hectic. Too much luck for a too long game. We could not finish it earlier than 3 hours with 4 players.",
    "timestamp": 1742770800
  },
  {
    "username": "MattiMo",
    "rating": 6.0,
    "comment": "This game and I don't get along as much as I had hoped.",
    "timestamp": 1741129200
  },
  {
    "username": "Sister_Ruth",
    "rating": 6.0,
    "comment": "Solidly designed game, but quite forgettable.",
    "timestamp": 1740697200
  },
  {
    "username": "Lanttu",
    "rating": 6.0,
    "comment": "Played two times. Never with expansions but I've played Uprising once too. It's a fine game and I've heard expansions make it much better. However considering base game hasn't excited me greatly I see no need owning this myself. As such I will be selling my copy but I'd still gladly play a game if someone else put this one the table.\n\nMain problem for me with these \"hybrid\" games with worker placement and deck building seems to be that no side rarely shines that much. Especially deck part. You just don't get to rip through your deck enough times to make any card purchases truly exciting.",
    "timestamp": 1740610800
  },
  {
    "username": "HansSolo",
    "rating": 5.5,
    "comment": "Too random for my taste. You like it, or you don't.",
    "timestamp": 1740351600
  },
  {
    "username": "I_made_a_username",
    "rating": 6.0,
    "comment": "Pros: gameplay aligns with Dune theme well, neat how the deckbuilding serves additional purposes of combat and worker placement (it is integrated with the core gameplay), unique player powers are a nice idea, creates different play experiences depending on player count,\n\nCons: there is no real catch-up mechanic because progress is quite linear in this game (the person who has the most points is very likely to win the game), there is no core mechanic that truly shines because each mechanism has approximately equal weight, unique player signet powers don't get to shine often because the cards come up 1-2 times per game and may not be tactically viable to capitalize upon in a given turn.",
    "timestamp": 1740351600
  },
  {
    "username": "apostateant",
    "rating": 6.0,
    "comment": "This didn't click with me at all. I like the Dune setting but just seemed like a few very generic things tacked together with a theme slapped on them.",
    "timestamp": 1740006000
  },
  {
    "username": "Kent",
    "rating": 6.0,
    "comment": "A worker placement/deck-building game with varying player powers. Boring and tedious. The theme doesn't do much to mask the basic mechanisms and the game seems to play long. While the gameplay itself is okay, frankly I think the game is overrated.",
    "timestamp": 1739919600
  },
  {
    "username": "dabruuzer",
    "rating": 6.0,
    "comment": "Not attempting yet until I learn more about what BG mechanics I truly enjoy.",
    "timestamp": 1738105200
  },
  {
    "username": "sambalamaento",
    "rating": 6.0,
    "comment": "steam app",
    "timestamp": 1737846000
  },
  {
    "username": "Quagmire0",
    "rating": 6.0,
    "comment": "I see why people like it. Not a hard learn at all, even though there are a few things you have to keep track of. First play was just “ok”, although it was at 2p. While, at first glance, it may seem like a game that could go on forever (if people keep knocking you down and you lose VPs), the opposite could happen as well if someone isn't interfered with . There's a lot of luck that happens in the first few rounds and you may not be able to really enjoy your well-built deck by the time that someone pulls off a win. For instance, there may be a consecutive turn where you can't put troops into conflict, or someone else just got to it before you and you lose by a hair. In that case, it may be that the top prize is TWO victory points. This happened in our game, and the game was over. A four point swing in short order. So, timing and luck are a big part of the game. Considering the speed at which the game *can* turn, I think that adding a mechanism where someone can shuffle their deck before running out of cards (and maybe even redraw?) would maybe mitigate that a little. I think this is one where it may take several plays to fully appreciate it, so you may want to borrow a copy before buying.",
    "timestamp": 1736722800
  },
  {
    "username": "Jorerbor",
    "rating": 6.0,
    "comment": "Weird game, clunky game play and scoring. Still works, good strategy and resource management.",
    "timestamp": 1736722800
  },
  {
    "username": "yoc660cc",
    "rating": 7.0,
    "comment": "Rating is for solo only.\nWinning against bots tends to require the same steps every time, so there's no flexibility in strategy, but this game is worth playing because it's a rare game where you can play against two bots.",
    "timestamp": 1762614780
  },
  {
    "username": "High_Hopes_NC",
    "rating": 6.5,
    "comment": "Good game, but I really really don't get the hype, It doesn't really motivate me focus as an interactive euro should. I'll only play it because my friends want to.",
    "timestamp": 1762582920
  },
  {
    "username": "bluestraggler",
    "rating": 7.0,
    "comment": "Borrowed a copy of this to play for a while. I'd be happy to have a copy for group play but not worth it for solo.\n\nVery good 3-4 players. I'd rate it more like 8 or 9. Challenging to play well, and clever design to balance building up your strength and trying to cash out to win a battle for a good reward. Really excellent ratio of setup time/ease of learning with how crunchy it turns out to be.\n\nJust mediocre solo or 2p though. Felt tacked on. The AI is totally random and doesn't make for a very interesting opponent, so the strategy is a little different and IMO, not super engaging. This is a game you need a challenging opponent.\n\nArt is excellent but theme doesn't add tons to the experience really, I wouldn't call it especially thematic. The playable characters are only subtly different.",
    "timestamp": 1762124400
  },
  {
    "username": "maxrabb1t",
    "rating": 7.0,
    "comment": "This game is so tense and mostly always nailbiting. There are variable ways to victory which i loved. Just hoped that deck building aspect would have being more polished. But other than that the game is really well designed to cater more audience. Great job by the designer.",
    "timestamp": 1762038000
  },
  {
    "username": "julia_gulia",
    "rating": 7.0,
    "comment": "Enjoy this game and am a fan of Dune.\n\nI have a box upgrade/organizer and Ryker card sleeves.\nWould like to try the newest expansion.",
    "timestamp": 1761606000
  },
  {
    "username": "bkevans",
    "rating": 7.0,
    "comment": "Good enough that I look forward to playing it; not (quite) good enough to buy it.",
    "timestamp": 1761519600
  },
  {
    "username": "Atagaka",
    "rating": 7.0,
    "comment": "I really like this game - it's tight, does not drag forever and every decision matters.",
    "timestamp": 1761343200
  },
  {
    "username": "bomberleung",
    "rating": 7.0,
    "comment": "BGG6\nDeck building",
    "timestamp": 1761256800
  },
  {
    "username": "chessbestboardgame",
    "rating": 7.0,
    "comment": "I definitely need more plays. I know something out there doesn't click yet with me",
    "timestamp": 1761084000
  },
  {
    "username": "ImZhe",
    "rating": 6.6,
    "comment": "Not bad even though I don't like deck builders, I like the worker placement part but has the usual downfall of deckbuilders where the tableau is very random. I do like the dual use cards",
    "timestamp": 1760911200
  },
  {
    "username": "Beercy",
    "rating": 7.0,
    "comment": "Just one game but pretty good impression, wish to play some more. It gives nice dynamic between players",
    "timestamp": 1760824800
  },
  {
    "username": "Nilssonius",
    "rating": 7.0,
    "comment": "Prefer base game without anything added. Ix at most. Nay to Uprising.",
    "timestamp": 1760738400
  },
  {
    "username": "Zouzou825",
    "rating": 7.0,
    "comment": "Temporary score, I only play it once, I didn't find any outstanding aspect from this highly acclaimed game.",
    "timestamp": 1760479200
  },
  {
    "username": "nhlln",
    "rating": 6.5,
    "comment": "Unsleeved\nmight sleeve",
    "timestamp": 1760479200
  },
  {
    "username": "jkriding",
    "rating": 7.3,
    "comment": "Comes with fully 3D printed box organizer, that converts into card market display when playing",
    "timestamp": 1760306400
  },
  {
    "username": "PotatoKing_",
    "rating": 7.0,
    "comment": "끊임없으나, 불쾌하지 않은 상호작용이 아주 맛있다",
    "timestamp": 1760306400
  },
  {
    "username": "ee_sson",
    "rating": 7.0,
    "comment": "Not good as deckbuilder. Not good as worker placement. Not good as conflict game. But the sum is ok. Feels like a slog for the first half. Can feel random in the end game.",
    "timestamp": 1759615200
  },
  {
    "username": "Ddyraw",
    "rating": 7.0,
    "comment": "One play was solid, but I think there are better hybrid deck builders",
    "timestamp": 1759615200
  },
  {
    "username": "HomesliceSupreme",
    "rating": 6.5,
    "comment": "Good I guess... but other than the theme there's not much here. Fiddly setup (though bearable), worker placement is okay, deckbuilding is okay but I feel like other games do the core mechanics better",
    "timestamp": 1759442400
  },
  {
    "username": "Hroudir",
    "rating": 7.0,
    "comment": "Edit. After years I played it again and had a great time. I had a bit deeper understanding of the game during this refreshment. I still miss the escalation of many deckbuilders and had turns where I couldn't do anything I prepared for thanks to bad luck, but still I enjoyed my play with my focused deck which brought me some great turns, even if I ultimately lost.\n\nIt's probably a good game but I got it during lock down and it doesn't work so well for two players.\nAlso, I hoped that the deckbuiding was much more relevant but with basically 10 rounds you barely circle 4-5 times which doesn't give me the deckbuilding escalation in power I expected",
    "timestamp": 1759269600
  },
  {
    "username": "Mukas",
    "rating": 7.0,
    "comment": "Nos divierte mucho, una vez aprendes como jugar te sientes como un ajedrez tematico",
    "timestamp": 1759269600
  },
  {
    "username": "Geor9eX",
    "rating": 7.0,
    "comment": "3.07 Cmplx/5th",
    "timestamp": 1758664800
  },
  {
    "username": "DatDudeTho",
    "rating": 7.0,
    "comment": "Very tense and enjoyable gameplay. Good depth without being fiddly. Intrigue cards bring a lot of swing in base game, hence deducted a point. Kingmaking is very possible, so deducted another.",
    "timestamp": 1758232800
  },
  {
    "username": "JeepMomma",
    "rating": 7.0,
    "comment": "Will got it for my 45th birthday. Fun so far. Deckbuilding as well as worker replacement\n\n7/2025 We gave it away because we never play it",
    "timestamp": 1757455200
  },
  {
    "username": "Creativenothing",
    "rating": 8.0,
    "comment": "The OG Dune is still a very fun game; outclassed by it's successor Dune Imperium - Uprising (Bloodlines expansion).",
    "timestamp": 1762605780
  },
  {
    "username": "Kamil2310",
    "rating": 8.0,
    "comment": "+ Dune: Imperium – Rise of Ix\n+ Dune: Imperium – Immortality\n+ Dune: Imperium – Uprising\n+ Dune: Imperium – Jessica of Arrakis Promo Card\n+ Dune: Imperium – Boundless Ambition Promo Card\n+ Dune: Imperium – Piter, Genius Advisor Promo Card\n+ Dune: Imperium – Thumper Promo Card\n+ Dune: Imperium – Deluxe Upgrade Pack\n+ Dune: Imperium – Dreadnought Upgrade Pack\n+ Sleeves\n+ Plywood Insert\n+ Metal Coins\n+ Premium resources\n+ Plywood player boards",
    "timestamp": 1762470000
  },
  {
    "username": "prezbank",
    "rating": 8.0,
    "comment": "1/2",
    "timestamp": 1762470000
  },
  {
    "username": "CorneliusTacitus",
    "rating": 7.8,
    "comment": "pretty good, tense play good mix of deckbuilding and worker placement",
    "timestamp": 1762470000
  },
  {
    "username": "korosuuu",
    "rating": 8.0,
    "comment": "???",
    "timestamp": 1762383600
  },
  {
    "username": "Shaunmood",
    "rating": 8.0,
    "comment": "Feels a little disjointed and swingy at times. But its definitely a good game.",
    "timestamp": 1762297200
  },
  {
    "username": "Cricote",
    "rating": 8.0,
    "comment": "+ El auge de Ix\n+ Inmortality",
    "timestamp": 1762124400
  },
  {
    "username": "The Collector",
    "rating": 8.0,
    "comment": "Mobile:\n\nGreat implementation of a very good game.",
    "timestamp": 1761951600
  },
  {
    "username": "OregSamm",
    "rating": 8.0,
    "comment": "13 / 13",
    "timestamp": 1761865200
  },
  {
    "username": "leviathangr",
    "rating": 8.0,
    "comment": "+Rise of Ix\n+Immortality\n\nA high confrontential deck-builder with worker placement mechanics meshed into the much loved Dune world. What else to ask?",
    "timestamp": 1761865200
  },
  {
    "username": "fska",
    "rating": 8.0,
    "comment": "+ deluxe box\n+ plastic resources",
    "timestamp": 1761519600
  },
  {
    "username": "Corwin007",
    "rating": 7.5,
    "comment": "Dune! Quite liked the game, though the intrigue cards are such an annoying part of the game. The action spaces feel more interesting and varied than in Arnak, the deck building more important, but man, I wish there would be a better way to deal with the intrigue cards. Sometimes you draw useless cards, sometimes you get 2 points, sometimes you get 7 combat strength. Moved it down after 2 games and a bit more reflection; funnily enough I won both of those, but it didn't feel satisfying.",
    "timestamp": 1761256800
  },
  {
    "username": "bnordeng",
    "rating": 8.0,
    "comment": "This was a pleasant surprise. I'd heard some decent things, but knowing practically nothing about Dune and the game meant I wasn't seeking it out. It's a somewhat involved, deck-building, resource management, special power stuff that sounds pretty generic yet feels interesting, at least through my one play. The components in the version I played were quite impressive, though I'm not evaluating the game on that part of it.\n\nI did play it with the Rise of Ix expansion which, I was told, makes the game way better. Having not played without that, I don't know. Whatever the case... I really enjoyed the play and would play it again.",
    "timestamp": 1761170400
  },
  {
    "username": "07734",
    "rating": 8.0,
    "comment": "Bedroom",
    "timestamp": 1761170400
  },
  {
    "username": "ygram",
    "rating": 8.4,
    "comment": "Multiple plays with the Rise of Ix expansion and one with Immortality expansion.\n\n+ Direct interaction with battles\n+ Good level of indirect interaction when competing for worker slots and cards\n+ Good deck building with very powerful combos possible but no game breaking cards\n+ Visibility of who is in the lead\n\n- Maybe a bit swingy when the big points starts rolling in in the endgame, but that's also good due to the comeback potential",
    "timestamp": 1760911200
  },
  {
    "username": "PBandJellyfish",
    "rating": 8.0,
    "comment": "@SC",
    "timestamp": 1760824800
  },
  {
    "username": "StrongbowGold",
    "rating": 8.0,
    "comment": "B-4",
    "timestamp": 1760738400
  },
  {
    "username": "Beanreaper",
    "rating": 8.0,
    "comment": "Great hybrid of deckbuilder + worker placement with a sprinkle of combat",
    "timestamp": 1760565600
  },
  {
    "username": "Lengytam",
    "rating": 7.5,
    "comment": "Played it only once, but I could say it's a solid game. It doesn't have any revolutionary mechanism, but at least it tries to model some elements of the theme with it's mechanics.\nThe only reason why I couldn't suggest to buy it, because I think you'll need to get the expansions as well -it just added so much to the game- and the two together have a quite intimidating price tag.",
    "timestamp": 1760479200
  },
  {
    "username": "Jumicorinbo",
    "rating": 8.0,
    "comment": "I love this game, my wife loves it more. The conversation goes like this - hey babe what game you want to pl…. “DUNE!!”",
    "timestamp": 1760479200
  },
  {
    "username": "vdwoord",
    "rating": 7.5,
    "comment": "Like this game a lot. Don't need to have it in my collection because I can play it with others.",
    "timestamp": 1760392800
  },
  {
    "username": "joepunman",
    "rating": 7.5,
    "comment": "Solid game. Great use of worker placement and deckbuilding mechanisms.",
    "timestamp": 1760306400
  },
  {
    "username": "badassbr",
    "rating": 8.0,
    "comment": "Excelente jogo de deckbuiding com worker placemente que faz os jogadores degladiarem em cada rodada!\nA vesão uprising é a melhor versão",
    "timestamp": 1760306400
  },
  {
    "username": "AgentStone",
    "rating": 7.5,
    "comment": "Tight and intellectual, great game. Conflict is good, intrigue cards are great, but (at least in the base game) the card-draw-luck is too big and it's not good with 2 players.",
    "timestamp": 1760306400
  },
  {
    "username": "AidnOne",
    "rating": 9.0,
    "comment": "Nothing to say. Simply a great game hightly replayable",
    "timestamp": 1762628700
  },
  {
    "username": "Wyte Cell",
    "rating": 9.0,
    "comment": "Excellent game, lots of fun!",
    "timestamp": 1762618380
  },
  {
    "username": "PPotter81",
    "rating": 9.0,
    "comment": "Digital",
    "timestamp": 1762297200
  },
  {
    "username": "CocoLE_FDU",
    "rating": 9.1,
    "comment": "不太平衡...容易卡手",
    "timestamp": 1762297200
  },
  {
    "username": "cold25",
    "rating": 9.0,
    "comment": "2x",
    "timestamp": 1762210800
  },
  {
    "username": "Trevinsky",
    "rating": 9.0,
    "comment": "Acquired: 12/24 (X-Mas Gift)",
    "timestamp": 1762210800
  },
  {
    "username": "Auroric",
    "rating": 8.5,
    "comment": "I really enjoy the mix of worker placement and deckbuilding. This level of interaction in a Euro is refreshing, even though the battles are just bids. It doesn't overstay its welcome, and there's lots of interesting combos and strategy.\n\nThat said, it's more random and swingy than I would like. The cool combos you assemble don't come up more than once or twice, which feels pretty unsatisfying. If there was a version of this that allowed me to truly deckbuild and lean in hard to those strategies this game would be a 10/10 for me, because the theme and mechanics are awesome.",
    "timestamp": 1762210800
  },
  {
    "username": "JammyDodger3579",
    "rating": 8.5,
    "comment": "Bomber game. Different ways to win, got to carefully look at your opponents, build your deck carefully, keep stuff in your back pocket. It does feel like you're outmaneuvering each other",
    "timestamp": 1762124400
  },
  {
    "username": "Bozok",
    "rating": 9.0,
    "comment": "Combines worker placement, deck building, and bidding (\"combat\") mechanics. Tight gameplay, great theme.\n\nDune Imperium Uprising reimplements this game. I slightly prefer that over this. My favorite way to play is Uprising + Bloodlines.\n\nI got the physical copy from Josh. I own the digital version on Steam and iOS including Rise of Ix.",
    "timestamp": 1762124400
  },
  {
    "username": "mafkegel",
    "rating": 9.0,
    "comment": "- Box also contains Rise of Ix and Immortality\n- Sleeved cards (Dragon Shield Clear Matte & Arcane Tinmen Small Non-Glare Matte)\n- 3D printed insert: https://makerworld.com/nl/models/467149-dune-imperium-insert...",
    "timestamp": 1762038000
  },
  {
    "username": "Crushar",
    "rating": 8.5,
    "comment": "Sleeved\nE-Raptor Insert\nAcrylic Tokens\nMeeple Stickers\nNeoprene Mat",
    "timestamp": 1761951600
  },
  {
    "username": "Nissa la Bella",
    "rating": 9.0,
    "comment": "Jeu exceptionnel, tendu, magnifiquement équilibré. Toujours un moment agréalable",
    "timestamp": 1761951600
  },
  {
    "username": "oddthought",
    "rating": 8.5,
    "comment": "Bump this up to a 9 with Ix and Immortality added. A brilliant piece of work. The digital version is exemplary as well. I find it co-exists with its sibling Uprising just fine. You can have both. An embarrassment of riches, especially for Dune fans. Enjoy.",
    "timestamp": 1761865200
  },
  {
    "username": "Sinoc",
    "rating": 9.0,
    "comment": "Excellent worker placement + deckbuilding. Quite easy to explain but with a good challenge. B",
    "timestamp": 1761865200
  },
  {
    "username": "SergeBabiychuk",
    "rating": 9.0,
    "comment": "With Rise of Ix expansion!!!",
    "timestamp": 1761778800
  },
  {
    "username": "BenTP",
    "rating": 9.0,
    "comment": "Must have the expansion the rise of IX because you have more option to trash card from the beginning and more option for the combat",
    "timestamp": 1761778800
  },
  {
    "username": "muchiflapopo",
    "rating": 9.0,
    "comment": "Leí las instruccciones, y mire a mi grupo de juego y les dije a esto ya sabéis jugar. En cada ronda habrá un combate. Tenéis dos trabajadores - podréis tener tres en el futuro - y en cada turno podéis mandar un trabajador jugando una carta a una localización (la carta te limita a cual puedes ir) y allí ejecutar lo que se puede hacer en ella. Las cartas que no has jugado te servirán para comprar más cartas y mejorar tu posición en el combate.\n\nNosotros: nosotros que jugamos el 80% de las veces a dos, este juego lo hemos probado a dos, te mete un bot que es la casa de Hagal, y no lo recomendamos. ¿puedes jugar? si y no es mal juego peero, pierde toda la tensión epicidad y mala leche del juego a 4. Es más, analizándolo en general yo como eurogamer veo que el juego no es perfecto (por ejemplo tiene algunos problemillas que resuelve mucho la ampliación el auge de IX), y no lo recomendaría alegremente. ¿y entonces porqué esta nota?\n\nEllos: Pese a lo que acabo de escribir, este juego es uno de los que encajan a la perfección en nuestro extraño grupo de mesa. Mucha interacción, profundo, diferentes estrategias para ganar, mucho de ir a degüello, y unos giros de guión con las cartas de intriga, el estar en la última ronda todos a un punto de la victoria, etc. que lo convierten en uno de nuestros juegos preferidos",
    "timestamp": 1761778800
  },
  {
    "username": "New_Zealand_Neil",
    "rating": 9.0,
    "comment": "\"Arrakis is so beautiful when the sun is low.\" - Chani\n\n\nLEADERS INCLUDED: (8)\n\n●●●○ Baron Vladimir Harkonnen (House Harkonnen)\n●○○○ Count Ilban Richese (House Richese)\n●●●○ Countess Ariana Thorvald (House Thorvald)\n●●○○ Duke Leto Atreides (House Atreides)\n●○○○ Earl Memmon Thorvald (House Thorvald)\n●○○○ Glossu 'The Beast' Rabban (House Harkonnen)\n●●○○ Helena Richese (House Richese)\n●○○○ Paul Atreides (House Atreides)",
    "timestamp": 1761692400
  },
  {
    "username": "hedisch",
    "rating": 9.0,
    "comment": "Alex",
    "timestamp": 1761606000
  },
  {
    "username": "dahntheboss",
    "rating": 9.0,
    "comment": "packed in it: rubik cubes + supplies (plastibands, sleeves)",
    "timestamp": 1761429600
  },
  {
    "username": "Mimi0605",
    "rating": 9.0,
    "comment": "❤️❤️",
    "timestamp": 1761343200
  },
  {
    "username": "VikingBurger",
    "rating": 9.0,
    "comment": "Nagyon jó a munkáslehelyezés és a pakliépítés mixelése.\nNagyon sok út a győzelem felé.\nTalán a legizgalmasabb euró, nagyon jó íve van a játéknak.\nNem annyira tematikus, mint az eredeti dűne.\nVan benne szerencsefaktor az intrikakártyákkal, de szerintem illik a témához.",
    "timestamp": 1761256800
  },
  {
    "username": "Hooloovoo42",
    "rating": 9.0,
    "comment": "ST20 2025 #06\nST20 2024 #08\nST20 2023 #09",
    "timestamp": 1761256800
  },
  {
    "username": "Awesomiser",
    "rating": 9.0,
    "comment": "Great game. Always happy to play it",
    "timestamp": 1761256800
  },
  {
    "username": "dJJa",
    "rating": 10.0,
    "comment": "EXPERT",
    "timestamp": 1762470000
  },
  {
    "username": "malediq",
    "rating": 10.0,
    "comment": "+ Rise of IX expansion\n+ Immortality expansion",
    "timestamp": 1762470000
  },
  {
    "username": "Wasylus",
    "rating": 9.5,
    "comment": "Genre=strategy\nPlayers=3-4; b4\nTime=3h\nExpansions=yes(few) + promo cards\nThemes=SF; adaptation(book), adaptation(Dune)\n\nOwned(version)=Polish\nOwned(expansions)=2(of2)\nCondition=NEW\nSleeves/Insert=no/yes\nOther=need to glue insert + organize; need to sleeve",
    "timestamp": 1762210800
  },
  {
    "username": "mathieulabelle73",
    "rating": 9.8,
    "comment": "Un excellent jeu combinant deck-building, placement d’ouvriers et majorité, le tout en un. Le roi des jeux, ou presque ! Avec une rejouabilité importante et beaucoup d’interaction.",
    "timestamp": 1762038000
  },
  {
    "username": "Jayxtcbx",
    "rating": 10.0,
    "comment": "1 to 4\nSleeved\nPrinted Insert",
    "timestamp": 1761951600
  },
  {
    "username": "Connduit",
    "rating": 9.5,
    "comment": "3-4",
    "timestamp": 1761951600
  },
  {
    "username": "Final_Meeple",
    "rating": 10.0,
    "comment": "Top 50 Games of 2021 - #3\nTop 50 Games of 2022 - #6\nTop 50 Games of 2023 - #6\nTop 50 Games of 2024 - #6",
    "timestamp": 1761865200
  },
  {
    "username": "tanelp",
    "rating": 10.0,
    "comment": "One of my all-time favorites!\nThe mix of worker placement and deck building is perfect.\nI found my two favorite mechanics thanks to this game, and it came out of nowhere!",
    "timestamp": 1761778800
  },
  {
    "username": "ditterio",
    "rating": 10.0,
    "comment": "DUNE IMPERIUM (1-4 players)\nDUNE IMPERIUM: UPRISING (1-4 or 6 players)\nRISE OF IX (1-4 players)\nIMMORTALITY (1-4 players)\nBLOODLINES (1-4 players)\n\nFAQ: https://boardgamegeek.com/filepage/210719/dune-imperium-faq\n\nStrategy guide: https://boardgamegeek.com/thread/2583078/dune-imperium-what-...\n\nRulebook Dune Imperium: https://boardgamegeek.com/filepage/210689/dune-imperium-rule...\n\nRulebook Rise of Ix: https://boardgamegeek.com/filepage/231410/dune-imperium-rise...\n\nRulebook Immortality: https://boardgamegeek.com/filepage/249943/dune-imperium-immo...\n\nRules reference: https://boardgamegeek.com/filepage/227663/esoteric-order-gam...\n\nRules summary with all both expansions: https://boardgamegeek.com/filepage/236435/quickstart-dune-im...\n\nI've won Dune Imperium with:\n\nArchduke Armand Ecaz\nBaron Vladimir Harkonnen\nCountess Ariana Thorvald\nCount Ilban Richese\nDuke Leto Atreides\nEarl Memnon Thorvald\nGlossu The Beast Rabban\nHelena Richese\nIlesa Ecaz\nPaul Atreides\nPrince Rhombur Vernius\nPrincess Yuna Moritani\nTessia Vernius\nViscount Hundro Moritani\n\nI've won Dune Imperium Uprising with:\n\nMuad'Dib (against solo 9 staban tuek and 8 lady matgot fenring)\nLady Margot Fenring (against solo 8 lady margot fenring and 8 gurney halleck)\nGurney Halleck (against solo 8 duncan idaho and 7 kota odax of ix)\n\nGreat eurogame with a lot of fun interaction",
    "timestamp": 1761692400
  },
  {
    "username": "phunter",
    "rating": 10.0,
    "comment": "Deluxe set\n+Rise of Ix\n+ Immortality\n+ Promos",
    "timestamp": 1761692400
  },
  {
    "username": "Nexus87",
    "rating": 9.5,
    "comment": "The base game is an 8, but it improves significantly with the expansions",
    "timestamp": 1761606000
  },
  {
    "username": "ozsoffy",
    "rating": 10.0,
    "comment": "Loved it.\nPlayed it once with expansions, which is not the right way to go. And once without.\n\nI liked everything about this game. From the theme, the art, the components and the mechanics.\n\nHope to play this again soon.",
    "timestamp": 1761606000
  },
  {
    "username": "cyberbob666",
    "rating": 10.0,
    "comment": "French edition\n+ Big box and extra\n+ extension: L'avènement d'IX (2022)\n+ extension: Immortalité(2022)\n+ Bloodline: (comming soon in french 2025?)",
    "timestamp": 1761519600
  },
  {
    "username": "AlejandroMarin",
    "rating": 10.0,
    "comment": "Dune: Imperium is an outstanding game. I love its mechanics, the way they are integrated into the lore of the Dune universe, and its overall playtime. Without a doubt, it’s one of my Top 10 games.",
    "timestamp": 1761429600
  },
  {
    "username": "Dabitto8",
    "rating": 10.0,
    "comment": "10/10 with both expansions",
    "timestamp": 1761343200
  },
  {
    "username": "hockeyjones",
    "rating": 9.8,
    "comment": "9\n\nPlayed in 2025\n\nHS: 13\nSC: 31 (11, 7, 7, 5)\nS: 8",
    "timestamp": 1761256800
  },
  {
    "username": "Mikestribe",
    "rating": 9.5,
    "comment": "Favorite game. It plays well solo, and it's incredible at 3 and 4 players. Rise of Ix makes it even better but I love the base game. So so good. Plans within plans.",
    "timestamp": 1761170400
  },
  {
    "username": "rose0043",
    "rating": 9.5,
    "comment": "Birthday present from family (2021)",
    "timestamp": 1761084000
  },
  {
    "username": "bdavid0127",
    "rating": 10.0,
    "comment": "H",
    "timestamp": 1760738400
  },
  {
    "username": "Dohle",
    "rating": 9.5,
    "comment": "A brilliant blend of deck building, worker placement and light combat. The card play integrates really well with the worker placement, and the low amount of victory points more often than not results in very tight and tense games. The multi-use cards work similarly to Clank! (same designer) but the card effects are improved and made much more interesting making the cards easily the highlight of the show. The only negative is the slight randomness of the intrigue cards that can sway the course of combat dramatically but it still seems to be at least somewhat negatable.",
    "timestamp": 1760306400
  },
  {
    "username": "KS1N",
    "rating": 9.6,
    "comment": "Steam 소장",
    "timestamp": 1759960800
  },
  {
    "username": "Nakira",
    "rating": 9.5,
    "comment": "Dune: Imperium – A clever cocktail of deckbuilding, worker placement, and area control, all wrapped in the epic Dune universe. You’ll juggle gaining influence, managing resources, and waging battles while navigating the complex intrigues of the Great Houses. The mechanics mesh beautifully, offering a tactical playground where every choice counts and no strategy is safe from your rivals. It’s engaging, fast-paced, and constantly rewarding, with the spice of Dune’s setting adding just the right amount of desert heat. If you love multifaceted strategy with a side of political scheming and combat, this one’s a winner every time.",
    "timestamp": 1759874400
  },
  {
    "username": "Gripperas",
    "rating": 9.5,
    "comment": "10/10 with both ix immo\n8.5/10 base\n\nDune imperium (+IX+IMMO) is the competitive board game ive played the most in my collection, both in physical and digital (tts). It deserves to be on the global top 10. A trully remarkable game with many paths to victory, intense interactive gameplay, addictive deckbuilding loop and endless replayability.",
    "timestamp": 1759788000
  },
  {
    "username": "horarp",
    "rating": 9.9,
    "comment": "Nagyon erős tematikával rendelkezik és mesterien alkalmazza a játékmechanikákat. Mondjuk 60% munkáslehelyezés és 40% pakliépítés, de nagyon ott van. Kieggel 10/10",
    "timestamp": 1759528800
  }
]