[
  {
    "username": "4wallz",
    "rating": 1.0,
    "comment": "Superhero fatigue is real. And Iron Heat before Daredevil? Kiss off Disney.",
    "timestamp": 1757368800
  },
  {
    "username": "Captain Boris",
    "rating": 1.0,
    "comment": "The game plays fine but I have lost all desire to support this product after the way FFG has crapped on new players who cannot acquire the most recognizable heroes for a reasonable price. There’s simply no excuse for this decision to put financial strain on customers out of spite.",
    "timestamp": 1746568800
  },
  {
    "username": "BandarFHD",
    "rating": 1.0,
    "comment": "Due to their recent announcement, do not get into the game in the year 2025 onward. Most heroes (mainly Spider-Man MM, Captain America, Doctor Strange etc...) are out of print and they have announced that they will not re-print them. If you like to pay US$ 100 for 50 pieces of paper that the publisher decided not to re-print for \"we do not want to overwhelm people\" stupid reason then by all means buy the game.",
    "timestamp": 1739055600
  },
  {
    "username": "dtmoney75",
    "rating": 1.0,
    "comment": "1 Play\n\nPlayed at: 3",
    "timestamp": 1729548000
  },
  {
    "username": "Iliarch",
    "rating": 1.0,
    "comment": "This game is worth 5.5 stars. It has been egregiously overrated by fans of the franchise (of which I am one). While the game play is fine, it lacks any real strategy and becomes a pure mathematic event at the conclusion, lacking any excitement upon beating the big bad. I have rated it 1 star as it's currently rated above 7.8 and at that level it's frankly an insult to the community at large. I would play this with my kids to introduce them to deck building combo mechanics but only because the familiar superheros would excite them. Fantasy flight is easily my favourite game publisher. For a phenomenal cooperative game battling evil try Arkham horror, there is a better superhero combo deck builder but I forget it's name...",
    "timestamp": 1684533600
  },
  {
    "username": "funnytortoise",
    "rating": 1.0,
    "comment": "Unacceptable characters",
    "timestamp": 1658008800
  },
  {
    "username": "christhomas226",
    "rating": 1.0,
    "comment": "Lifeless game",
    "timestamp": 1649800800
  },
  {
    "username": "AbramsTank00",
    "rating": 1.0,
    "comment": "Sucked.",
    "timestamp": 1646953200
  },
  {
    "username": "decbomb",
    "rating": 1.0,
    "comment": "it is a long boring game that takes forever to play and set up",
    "timestamp": 1643929200
  },
  {
    "username": "mdean",
    "rating": 1.0,
    "comment": "Less interesting than Arkham which is already on thin ice with me. I do like how easy it is to set up and play in comparison though.",
    "timestamp": 1616540400
  },
  {
    "username": "tone23",
    "rating": 1.0,
    "comment": "Game is boring, very little deck construction..",
    "timestamp": 1614207600
  },
  {
    "username": "silvercharm10",
    "rating": 1.0,
    "comment": "Not a good game at all, played Thor against Rhino.\nThor, Hercules, Heimdall, Sif take on Rhino and struggle? Really? These Marvel Characters would crush Rhino but noooo not in this game.\nNot thematical at all, bad game!",
    "timestamp": 1601762400
  },
  {
    "username": "Morabito",
    "rating": 1.0,
    "comment": "Good looking game but it's pure garage. Way too expensive for what it is.",
    "timestamp": 1578178800
  },
  {
    "username": "asphere9",
    "rating": 1.0,
    "comment": "The very concept of this move by FF is vile.",
    "timestamp": 1564783200
  },
  {
    "username": "Shortbeard",
    "rating": 2.0,
    "comment": "the game plays you more than. the other way around. whole game is rebuild your deck",
    "timestamp": 1747260000
  },
  {
    "username": "Ludwig3366",
    "rating": 2.0,
    "comment": "Je me lasse de l'univers Marvel trop exploité de puis 20 ans et je suis également fatigué des éditions de qualité médiocre de FFG.",
    "timestamp": 1746136800
  },
  {
    "username": "vinayplusj",
    "rating": 2.0,
    "comment": "Despite the variety of heroes and villains, the gameplay often feels repetitive. The core set is intentionally limited, and went overboard with intricate rules and mechanics. Surprisingly, the game didn't immerse me in the Marvel universe as I had hoped.",
    "timestamp": 1730847600
  },
  {
    "username": "Ailan",
    "rating": 2.0,
    "comment": "It's good. Not great, lets see once we have more content.",
    "timestamp": 1679266800
  },
  {
    "username": "con_noc",
    "rating": 2.0,
    "comment": "It's a good game. However, in the Korean version, the names of the heroes were written in English. In Korea, I made the mistake of writing in English only in board games, something that had never happened in Marvel movies, games, or cartoons. Disney, FFG, and publishers have made a huge mistake with Korean boardgamers. So this game had to be given only one point.",
    "timestamp": 1670454000
  },
  {
    "username": "Wolcik",
    "rating": 2.0,
    "comment": "new MS Marvel can go bend herself",
    "timestamp": 1654984800
  },
  {
    "username": "disposable.superhero",
    "rating": 2.0,
    "comment": "Played part of one game. Absolutely no enjoyment from playing it.",
    "timestamp": 1652306400
  },
  {
    "username": "zephmode",
    "rating": 2.0,
    "comment": "The game mechanics is weird, clunky, and confusing. It was so unsatisfying that I go through my ginormous deck only once + a few more cards in the entire 4 hours or so that we were up against Rhino. And it was infuriating to see that once we defeated \"normal\" Rhino that we had to defeat an upgraded version of him. How is it that 4 superheroes can spend 4 hours on one villain and then die? It was frustrating that we lost but by then I was happy to not have to play that game anymore. Our Iron Man had trouble ramping up his gadgets. The timing for that was super hard and frustrating. It wasn't until towards the end I had the Helicarrier card to help others. I hate this game. I feel bad for the friend that paid for the game. Harry Potter Battle for Hogwarts is a thousand times better. This is when BGG ratings fail me. I wish BGG had a system to better reflect how different people like different types of games. Like how Netflix knows some people will like certain movies.",
    "timestamp": 1648076400
  },
  {
    "username": "HotnessChaser",
    "rating": 2.0,
    "comment": "There may be a game in there, but it isn’t for me. I quickly realized that LCG games are not for me, especially with the collectible part.",
    "timestamp": 1644879600
  },
  {
    "username": "Flexfulton",
    "rating": 2.0,
    "comment": "Sleeved",
    "timestamp": 1643583600
  },
  {
    "username": "jdubski",
    "rating": 2.0,
    "comment": "Revised Review:\nThere is so much wrong with the game that breaking it out in detail is almost as un-fun as the game itself.\n\nRather than go into depth I’ll just indicate what bothers me as simply as possible.\n\nResources as cards and not tokens sucks. Spending cards to play one card feels unnecessary.\n\nVillains with health per player is a lazy design choice and it shows in the game. Villains shouldn’t always be accessible every round and it would have been nice if there was a story component with objectives to complete to get to the villain. Having 2 levels of the villain to fight against feels very unoriginal and it shows because the the gameplay just drones on while you manage threat and attack the villain.\n\nCycling through a deck should not be a major staple and with cards as resources that is exactly the case. Having cards to cycle the deck can be made to be character or deck specific and other games do just fine with discard x cards to achieve that.\n\nThere isn’t any location or sense of setting that impacts game state and that really hurts theme because marvel is a big universe and this missing component really makes this game feel silly. You’re always fighting the villain every round somewhere and it feels like it really doesn’t matter because the location doesn’t impact the game and it really should.\n\nFlipping to alter ego is a sensible component to add to the game but here it feels silly because your motivation is for healing and preventing damage and that’s really it. It just feels like there was more room here for for other game actions/decisions being in alter ego. Also games play better when action management is a thing. That only happens if there a finite number of actions and this game doesn’t limit your actions. And that is why it isn’t fun with >2 players. If you don’t believe me just watch Boggs play with Team Covenant team at TC’s Marvel event at their store with the kid and his dad. Boggs looked like he was playing his game for the first time with 4 people and realized just how boring it was. But I think therein lies the problem with this game.\n\nOverall this game is sloppy. It feels like a high school project done one week before due date. This game’s design feels like it was designed by 3 kids who opted not to collaborate but instead came up with different ideas and pasted them together and turned in as complete. This game should never have left development and somehow this game made it past senior designers. This game was not ready. This IP has too much potential for this to be FFG’s offering. Just a boring mess of a game with great art work. It is absolutely stunning listening to people say they play 100s of sessions of this game. It is ok to tell FFG that this game was not good and to expect more. This game’s design is way below par for FFG. They missed a real opportunity to make a combo box of competitive and coop play too.",
    "timestamp": 1641078000
  },
  {
    "username": "rolfisrolf",
    "rating": 2.0,
    "comment": "FFG is running out of ideas. They've taken elements from their previous LCGs and just rehashed them here. This is nothing but another money sink, and a boring one at that.",
    "timestamp": 1593381600
  },
  {
    "username": "crow13",
    "rating": 2.0,
    "comment": "Another game that is impossibly difficult but people say is too easy. They play it wrong and/or cheat, just look at Ant Labs playthrough. They play games all the time and are very good, but they made 2 crucial mistakes that greatly lessened the difficulty on the beginner scenario and still had a very tough time winning. The Rhino beginner scenario is fair but then you go to the Klaw scenario. This is supposed to increase the difficulty by one level but every aspect of the enemy is increased. Their are so many increases that you have to deal with that i can't even list them. FFG can't get out of their Cthulhu mode where the challenge is overwhelming and you feel intense stress when dealing with the adversary. You don't feel like a superhero at all. You don't feel powerful, you feel weak trying to overcome unbeatable odds.\nAfter this I'm about done with FFG. They are riding on their reputation of old. They are just about making games that have tons of content and can't make a game that is out of the Cthulhu shadow or feel. It is too bad that people can't be honest or are brain washed by the clout of the company.\nEdit: Tried again substituting the Masters of Evil with the basic Bomb Scare from the first \"beginner\" scenario with 2 players. Got two turns in and frustratingly gave up. Couldn't pull anything significant off. Between the first minion and the secondary scheme, it immediately became unacceptable. Seemed like if it could be done it would take hours of mitigating the scheme and damage, waiting for the one round you could do some piddly damage to the villain. This is a horrible game. Legendary for me was just bland, but compared to this it's a masterpiece. Legendary Encounters is very good, , but it's not superhero themed.",
    "timestamp": 1593208800
  },
  {
    "username": "spriggyman",
    "rating": 2.0,
    "comment": "Clunky as all get out. I NEVER want to play this again.",
    "timestamp": 1580598000
  },
  {
    "username": "Shinobi1Kenobi",
    "rating": 3.0,
    "comment": "Bought to play solo. No strong opinion on it yet to give a rating but after two games it looks promising!\n\nUpdate October 2025: Barely touched it after 18 months. Gameplay mechanics don't \"click\" for me and I personally find a big disconnect between the theme and the cards - I really struggle with why, for example, \"my\" spiderman deck doesn't have spiderman on almost every single card...\n\nRated it a 3.\n\nProbably going to sell it when I get round to it...",
    "timestamp": 1761170400
  },
  {
    "username": "Aselan",
    "rating": 3.0,
    "comment": "This game has far too much downtime with three players and even with two. No interesting decision making - high attack you go against the enemy, low attack - you go against the plans. Thats it. Switching sides of the hero usually is a clear decision and you figured out your turn within a minute and then you sit and wait for 10 Minutes in a 3 player game for your turn to come. Turns of your opponent have no effect on you or at least none that could be influenced. So you just get bored. No need to adjust strategies between players and also cards leave no options for it.",
    "timestamp": 1754431200
  },
  {
    "username": "YoloGames",
    "rating": 3.0,
    "comment": "I was hyped.. but man is this boring.\nThe main ressources are: HP/Threat & ressources (Mana).. that's it. Pretty much all cards give either ressources or change HP/Threat.\nI don't like superheroes so take my comment with a grain of salt. Very quickly i only saw numbers instead of cards.. which means the theme is too thin for me.\nThere are 17 points i need to bring to 0 to win. I have a card that subtracts 4 points, and i'd pay with 2 cards, or yadayada.. I'd rather watch Netflix.",
    "timestamp": 1748556000
  },
  {
    "username": "tscox87",
    "rating": 3.0,
    "comment": "My goodness...\n\nSoooooo long. Not for me.",
    "timestamp": 1735254000
  },
  {
    "username": "wahx",
    "rating": 3.0,
    "comment": "Love the setting, not a fan of the mechanics.",
    "timestamp": 1714600800
  },
  {
    "username": "KBossed",
    "rating": 3.0,
    "comment": "I really wanted to love this but just because the artwork is good, it isn't enough to just battle bad guy, rinse repeat. Played a handful of games but just can't bring myself to get it off the shelf anymore when I could be playing so many other way better games.\nIt's just a bit dull.\n\nEdit - 6/1/24\nHaving read a lot of people raving about this game still, I thought I'd give it another try for the new year.\nHow in gods name does this game score 8.1??????\nIt's sooooooo dull.\nPlay card,\nTrigger action,\nAttack or thwart until the Villain (who is pretty much identical to every other villain except the lovely picture) is dead.\nRepeat until bored ridged or until sleep sets in.\nSlap Marvel on it and everyone starts foaming at the mouth even if it is a complete turd of a game.\nRevised to 3 stars.",
    "timestamp": 1704754800
  },
  {
    "username": "mallie_67",
    "rating": 3.0,
    "comment": "Règles incompréhensibles, donc pas pu y jouer correctement\nJe réessayerai probablement",
    "timestamp": 1704582000
  },
  {
    "username": "hiimjosh",
    "rating": 3.0,
    "comment": "While on paper I should absolutely love solo LCGs, I have yet to find one that sticks. The Lord of the Rings: The Card Game was fiddly and the balance was off. I also disliked playing two-handed. Arkham Horror: The Card Game was excellent, but it sacrificed tight gameplay for cohesive narrative. When I heard Marvel Champions was both streamlined and puzzly it immediately piqued my interest\n\nUnfortunately, Marvel Champions is not my holy grail, but it is pretty close and has the potential to expand to be one of my favorite games. So far I've played all of the core set villains through with Spider-Man as well as Captain Marvel against the harder version of Rhino. The scenario design (in the core set) is basic but fine. The turn-to-turn upkeep is extremely low which is great for me as a solo gamer. The turns are combo-y with lots of action stringing. There is a small amount of hand management in which cards you keep and which you use for paying costs\n\nUnlike say Arkham Horror LCG, a lot of what happens in Marvel Champions is deterministic. I can plan out whether I have enough attack to defeat the villain next turn for example. This gives the game a leg up for me - I prefer a puzzle that lets me (for the most part) plan turns in advance over a game where my fate feels determined by random draws. This does mean the game lacks a bit of dynamicism. If I can near perfectly predict the villain's turn then things can tend to feel a little boring\n\nAlso unlike Arkham, the deckbuilding and card play is much more free. I find this both good and bad. Heroes aren't tied to specific colors but rather one of any color. This means there are many builds for every hero which is a neat aspect. The scenarios themselves are also modular which is fantastic. This game was designed with replay value in mind for sure\n\nAs far as theme goes there is basically no narrative in the game. I'm fine with this. I don't care about superheros but I do appreciate how many superheros and villains there are as that means lots of combinations\n\nOverall the core set is great value. You get plenty of cards for deckbuilding and mix-matching - more so than any other LCG on the market by a wide margin. My only real complaint would be the rules reference which I find almost worthless - I've tried to look up rules many times to find that the word I was looking for was never referenced. Really basic terms are missing (e.g. \"defeat\", \"round\", \"draw\") and it feels like the rules reference was never user tested\n\nSo I like Marvel Champions. Variety is very high, but the gameplay is just good so far. I found Spider-Man to be pretty boring, but I'm liking Captain Marvel as she has more nuance. The villains are just okay so far. There's the dude that hits you hard, the dude that hits you really hard, and the dude with lots of little dudes. I have faith that the scenarios will get better with time as they have with the other FFG LCGs and that's when I expect Marvel Champions to show its stuff\n\nEDIT: Lacked long-term staying power. Games played themselves once you understood how your hero worked. The villains did very little to switch the game up even after adding multiple expansions",
    "timestamp": 1703718000
  },
  {
    "username": "LordTengil",
    "rating": 3.0,
    "comment": "Only played twice. Can't really see it growing on me, but will give it a shot if someone else really want to play it. So far, I'd say stick to Sentinels of the Multiverse. No deck building there, and certainly no strategy, but at least it's fun to smash down your hero cards.\n\nThe theme of your hero does not shine through in this. The rest is just bookkeping.",
    "timestamp": 1699657200
  },
  {
    "username": "PlayingWithHoney",
    "rating": 3.0,
    "comment": "First time playing: got eliminated on the 2nd round because the enemy did damage for 2/3 of my maximum health in one turn. Didn't do my 1 defence thinking that it wouldn't help much. Guess I'll just sit here watching everyone else play for the next hour or two since it's such a fiddly game.....\n\nIf you hate player elimination or fiddly games like I do, give this a pass.",
    "timestamp": 1676847600
  },
  {
    "username": "ejones307",
    "rating": 3.0,
    "comment": "The cards are pretty bland. Not happy To play any of the cards. Super generic theme for a marvel game",
    "timestamp": 1668639600
  },
  {
    "username": "Zableerg",
    "rating": 3.0,
    "comment": "boring game, in mechanics magic the gathering is superior and in theme and fun marvel united is much better, this game is another clear example that the hype gets good scoring even if the game is bad and boring",
    "timestamp": 1663711200
  },
  {
    "username": "roood",
    "rating": 3.0,
    "comment": "Marvel Theme - Check. Cards with cool powers - check. Good game? Not for me. This is the worst produced game I have ever seen. The components don't even fit properly in the supplied trays. Most of the exciting decisions are made just building your deck before you actually play the game. Then you are stuck with your choices and have no ability to change on the fly. If you are into living card games and can look past this, it's probably a great game, if not massively underproduced for the price.\n\nThe replayability would be high if you can enjoy building your deck before you actually play. But even then, for it being a base game, it included very little. Considering how much can be stuffed into some games for a similar price, this seemed like a cash grab with very little effort thrown at it, other than throwing a Marvel theme on an already used formula.",
    "timestamp": 1660773600
  },
  {
    "username": "grimzap",
    "rating": 3.0,
    "comment": "This is a pretty cool game but plays much too long for the \"payoff\". Strategies and decisions are pretty obvious most of the time without a lot of finesse or unexpected situations. Balance can wildly vary depending upon how you set up the villain and hero decks. In the end I often feel like my coplayers and I are hitting a giant hit-point bag for a couple of hours while barely staving off schemes. If this played a little more quickly, I'd rate it higher but I think there are a lot of other games I'd rather play that are less time consuming and more interesting.",
    "timestamp": 1641769200
  },
  {
    "username": "Geor9eX",
    "rating": 4.0,
    "comment": "2.95 Cmplx/8th",
    "timestamp": 1762383600
  },
  {
    "username": "SteoanK",
    "rating": 4.0,
    "comment": "Would not part out. Only trade/sell together.",
    "timestamp": 1760392800
  },
  {
    "username": "nic7410",
    "rating": 4.0,
    "comment": "50",
    "timestamp": 1757541600
  },
  {
    "username": "JasonSaastad",
    "rating": 4.0,
    "comment": "I can be convinced to play if I get to do degenerate stuff with Doctor Strange",
    "timestamp": 1753221600
  },
  {
    "username": "lililililil",
    "rating": 4.0,
    "comment": "Deckbuilder",
    "timestamp": 1747432800
  },
  {
    "username": "Destrio",
    "rating": 4.0,
    "comment": "Cooperative deckbuilding doesn't interest me and neither does the theme.",
    "timestamp": 1741820400
  },
  {
    "username": "BlueMaxima",
    "rating": 4.0,
    "comment": "After having had a really bad start to this trying to play two handed solo (finding the game to be much too simple and long for that hero count) I found it a lot more punchy and enjoyable in true solo mode...but after learning that true solo isn't balanced for in all content, it kinda turned me off to the concept, especially when combined with how limiting the deckbuilding can feel in the core box.\n\nWhile the deck building could absolutely be enjoyable, for me, who's entire strategy just worked around 'throw in all of your hero cards, all of one archetype, add in a few staples and go' with a tiny bit of adjustment on top, I didn't find much fun or real exploration to be had in the deckbuilding, especially since Aggression and Protection are really weak in the base box compared to Justice and Leadership, and some cards are just naff - who would ever realistically use Tenacity? It's screaming for a few more cards to add in some wackier strategies, but I just don't really have the interest in buying expansions to 'make it good' after the base box cost me $80AUD.\n\nI don't mind the actual gameplay being a bit more number crunchy than thematic (I like SotM after all) but the two above major problems really did send it a bit awry for me. If I can find Sinister Motives for cheap, and it can reinvigorate the deckbuilding for me, maybe it'll get higher, but I've never been a fan of recommending a game and then saying \"you need to get expansions to make it REALLY good\".",
    "timestamp": 1736809200
  },
  {
    "username": "BoardGamingCouple",
    "rating": 4.0,
    "comment": "4/5\nWin or lose only (no victory points).\n\nOver the years this card game has really blossomed into one of the best. The mechanics & card pool are all great. Co-op, simultaneous play, & AI are all fantastic. Best at 2 or more players (2 or more heroes). 1000+ plays.\n\nAt some point, with any card game, the best advice is to downsize your collection to only the content you enjoy & will actively play. Deckbuilding could be improved a lot, but other than that lots of fun.",
    "timestamp": 1735254000
  },
  {
    "username": "tectactoe",
    "rating": 4.0,
    "comment": "Very good game; admittedly I'm not the biggest Marvel fan (or a Marvel fan at all) so the theme couldn't be any less interesting to me and yet I find myself totally engrossed in the game, which is surely a testament to its clever mechanism. Hell, I even bought two hero packs! (Captain Marvel & Doctor Strange.) Prefer this as a solo experience. Quarterbacking can be an issue in multiplayer games and that really just drags things out anyway.",
    "timestamp": 1734217200
  },
  {
    "username": "ninqt",
    "rating": 4.0,
    "comment": "Every time I play this game I go on my phone when it isn't my turn and I feel like the game is telling me to buy more stuff afterwards.",
    "timestamp": 1732489200
  },
  {
    "username": "Var_Kenarah",
    "rating": 3.5,
    "comment": "D",
    "timestamp": 1728856800
  },
  {
    "username": "FrancoisX",
    "rating": 4.0,
    "comment": "Much weaker IMO game than Lord of the Rings or Arkham Horror card games, but faster to play as you're not committed to campaigns. Sold it as nobody in the family wanted to get it out of the box.",
    "timestamp": 1727560800
  },
  {
    "username": "Duke_Rufus",
    "rating": 4.0,
    "comment": "It's a co-op, so if I win, I'm just better than a card?",
    "timestamp": 1727560800
  },
  {
    "username": "latschediwes",
    "rating": 4.0,
    "comment": "The special characteristics of the Super Heroes are nicely integrated and there are clever mechanisms, like e.g. switching to alter ego states. Compared to other LCGs, Marvel Champions is a decent product. I had the impression that it's quite playable out of the box, i.e. players are less pushed to buying additional core boxes or expansions.\n\nThe target audience seems to be lovers of card-combo games, puzzle solving and, of course, solitaire players. It works as far as cooperation is concerned, but each person is playing their own little games in parallel. In fact, it wouldn't make much difference if the role of teammates would be taken over by automatons, which is never a good sign.",
    "timestamp": 1726264800
  },
  {
    "username": "Killi",
    "rating": 5.0,
    "comment": "Not that fun for me and I am a marvel fan.",
    "timestamp": 1756504800
  },
  {
    "username": "gladhandydandy",
    "rating": 5.0,
    "comment": "Traded for Azul",
    "timestamp": 1756332000
  },
  {
    "username": "AdalynIris",
    "rating": 5.0,
    "comment": "My opinion is from someone who has actually not played the game enough. I have started it several times, but it was too boring, I left it after 5 minutes. Something was lacking in the game. It is not a bad game, but I always preferred to play other games. So it stayed in the shelf until I decided to let it go.",
    "timestamp": 1755381600
  },
  {
    "username": "BggTroll",
    "rating": 5.0,
    "comment": "solo\nsold",
    "timestamp": 1750975200
  },
  {
    "username": "Josh123212321",
    "rating": 5.0,
    "comment": "idk if this is fun? Seems like if it werent for the Marvel theme this game would have died by the wayside",
    "timestamp": 1749420000
  },
  {
    "username": "CarolusMS",
    "rating": 5.0,
    "comment": "Una de dos, o no lo comprendí bien, o no es tan bueno como lo pintan. Por más vueltas que le doy, no lo recomiendo, la verdad.",
    "timestamp": 1749333600
  },
  {
    "username": "NielosNl",
    "rating": 5.0,
    "comment": "P-2Solo-34",
    "timestamp": 1746655200
  },
  {
    "username": "Nomrbond",
    "rating": 5.0,
    "comment": "Just not for me. It’s amazing for some solo gamers but the core box didn’t inspire me to further investigate the system.",
    "timestamp": 1746223200
  },
  {
    "username": "mortaneus",
    "rating": 5.0,
    "comment": "Picked up the core set, played a game of it, really liked it and was super excited to buy more. The two I wanted most, because they're my favorite Marvel heroes? Dr. Strange and Captain America. Being such A-listers, they'll be easily available, right? Right?? Nope, Out of Print and $200+ on the secondary market.\n\nOh, well. Got rid of it. No reason for me to spend money on a game where the stuff I want is so hard to get.",
    "timestamp": 1741734000
  },
  {
    "username": "jacobderosenoir",
    "rating": 5.0,
    "comment": "Good game but you must be willing to spend time setting your cards and setting the games is way too long for the play time",
    "timestamp": 1740351600
  },
  {
    "username": "TeganAndTheOneRing",
    "rating": 5.3,
    "comment": "I used to love this, but nowadays I can't imagine a scenario where I'd rather play this over either Marvel Legendary or Marvel Zombies.",
    "timestamp": 1739574000
  },
  {
    "username": "SpaceYeti",
    "rating": 5.0,
    "comment": "Wrecking Crew\nGreen Goblin\nMs. Marvel\nCaptain America",
    "timestamp": 1739142000
  },
  {
    "username": "krit1789",
    "rating": 4.5,
    "comment": "Co-op LCG set in the Marvel universe. I'm not interested.",
    "timestamp": 1732662000
  },
  {
    "username": "Dycast",
    "rating": 5.0,
    "comment": "Have not played yet. A gift from a friend.",
    "timestamp": 1732230000
  },
  {
    "username": "timori",
    "rating": 5.0,
    "comment": "Sold my copy because the pandemic interrupted our play group and we didn't want to get back into it.\n\nIt's a fun puzzle but I agree with the SUSD take: the climax feels a little flat because it becomes a little mathy.",
    "timestamp": 1731452400
  },
  {
    "username": "NIG_WAFC",
    "rating": 5.0,
    "comment": "???",
    "timestamp": 1730415600
  },
  {
    "username": "excalibur2099",
    "rating": 5.0,
    "comment": "Ok, but too much book keeping and setup for what it is. Not very engaging for me. I’d rather play other games.",
    "timestamp": 1728597600
  },
  {
    "username": "hywc",
    "rating": 5.0,
    "comment": "I wanted to like this game. I bought it for solo play. Ultimately, it's way too light for me - low on long-term planning. None of the decisions felt hard, it felt more like a \"well I'll take the best move available and see\" optimization-and-reveal. I'm also not excited by the theme. I can see why people who are looking for lighter games enjoy it, and the Marvel universe seems to be captured well and thematically (as far as I can tell). But it's not for me.",
    "timestamp": 1726005600
  },
  {
    "username": "MorphBlue",
    "rating": 5.0,
    "comment": "One 2P game against Rhino so far. Artwork often very similar to Marvel Splendor cards which kinda takes away from the originality of the game for us. Seems like a decent game, but one that could easily be a bit overbearing in the long run. Especially with the high prices for addons. Wife didn't enjoy it very much, not much of a solo player either, so probably wont hit the table at all. Probably fun if you are very into LCG as a genre and the theme; Bought used for €14, box a bit scraped on the edge, cards still new and in shrink when i bought it. English version, Sleeved, sold for €28",
    "timestamp": 1723068000
  },
  {
    "username": "Zenji",
    "rating": 5.0,
    "comment": "Storage Location: Pune",
    "timestamp": 1723068000
  },
  {
    "username": "BoredGrainGreek",
    "rating": 4.5,
    "comment": "Hurts to give it this rating as I wanted to like it. But being honest I didn't really enjoy and it felt so overcomplicated to play. I will try to play again and possibly with people eventually, but it hasn't happened.\n\nI am harsher on ratings for solo games as I don't tend to get the urge to play, whereas if someone was to suggest a multiplayer game I'm usually up for most things.",
    "timestamp": 1722376800
  },
  {
    "username": "FilthyTroll",
    "rating": 5.0,
    "comment": "Most overrated game ever made?",
    "timestamp": 1719007200
  },
  {
    "username": "Goodsound",
    "rating": 5.0,
    "comment": "Fighting Rhino (2 times) was mildly fun, against Klaw not so.\nCumbersome set up. Big spread in Artwork quality.\nBetter than Sentinels otM but it has not yet beaten Marvel Legendary.\nAt a certain point in the game you can end up top decking, hoping to draw a useful card that doesn't come. The Endgame tends to drag a bit, so it overstays its welcome.",
    "timestamp": 1718056800
  },
  {
    "username": "shmonkey",
    "rating": 5.0,
    "comment": "This game drips with theme and it's tied into the mechanics well. Game had an interesting cadence to it and I'd be interested to play more in the future. The starter game wasn't terribly complex and wasn't necessarily the right level of difficulty for me, but I'd like to see more of what the system and the villains have to offer. It was very solid.",
    "timestamp": 1716674400
  },
  {
    "username": "KatonFrogMedium",
    "rating": 5.0,
    "comment": "This is the driest LCG from Fantasy Flight I've played. The setup doesn't work - why would you assemble a 4-team Avengers to take down Rhino? Have Captain Marvel come down and just punch him.\n\nThe heroes don't \"feel\" like the character should. Instead work as an archetype that is familiar to any CCG, TCG fan - aggro, control, Voltron, etc.\n\nThe ending doesn't stick the landing, I don't even have to do the thing to say \"I win\" (or \"I lost\"). I look at the cards, do the math and pack everything up.\n\nIt can scratch the itch if you are looking to play a CCG/TCG and you don't have anyone to play against.",
    "timestamp": 1712959200
  },
  {
    "username": "Im_board",
    "rating": 5.0,
    "comment": "We just haven't been able to play it be confident we're playing it at least %90 correct.",
    "timestamp": 1709852400
  },
  {
    "username": "Misamo",
    "rating": 5.0,
    "comment": "deck building not for me",
    "timestamp": 1708729200
  },
  {
    "username": "Jrh2",
    "rating": 5.0,
    "comment": "I was expecting something more similar to Arkham Horror LCG but his lacks most of what makes AH so good. Theme. Story.\nIn my mind MC:LCG is also quite inferior to LOTR:LCG but maybe that's because of theme. LOTR makes Tolkien's Middle Earth come alive. MC Doesn't do anything for me.",
    "timestamp": 1707260400
  },
  {
    "username": "ZZBrent",
    "rating": 6.0,
    "comment": "A wonderful game. I grew up playing trading card games (mtg, yu-gi-oh, and Pokemon) so deckbuilding is extremely fun to me. Due to my love of deckbuilding, I did need to buy a lot of packs to really dive into the fun of building a wide variety of decks and have a lot of scenarios to fight against. If you don't care about deckbuilding, you might be able to get away with the core, but the expansions are a big part of my enjoyment of this game. For that reason, this game is definitely expensive to get into and get a bunch of expansions for (each hero is $12-15 depending where you buy them from, scenarios range from $16-20, etc.). However, even with expansions, it is much cheaper than the trading card games I played growing up, and I love that I can find specific cards or heroes I want to play and just buy individual packs (knowing exactly what I am going to get). The heroes are all unique and interesting. I am loving building decks right now and trying to defeat all of the scenarios on expert with each aspect.\n\nUPDATE: I still like this game, but ended up selling it off. I did play it 70 times before I did, so take that as you will. But it just got stale after awhile. The decisions just didn't feel interesting while playing, it felt like the decision-making was in the deck building and the games were just playing that out to see how you did with the deck building portion of the game. After playing both, I believe Sentinels of the Multiverse is the better game.",
    "timestamp": 1762124400
  },
  {
    "username": "ImZhe",
    "rating": 6.3,
    "comment": "Pretty good deck construction and variety of characters and enemies, but balance seems off and extremely expensive to collect",
    "timestamp": 1761865200
  },
  {
    "username": "dsumw01",
    "rating": 6.0,
    "comment": "2019 2P-1% 1P-4% Expansion",
    "timestamp": 1761692400
  },
  {
    "username": "LemonToAKnifeFight",
    "rating": 6.0,
    "comment": "A bit boring. The mechanic is plain and brings little to no excitement for me personally",
    "timestamp": 1759960800
  },
  {
    "username": "isramarq",
    "rating": 6.0,
    "comment": "P&P",
    "timestamp": 1759269600
  },
  {
    "username": "Borafil",
    "rating": 6.0,
    "comment": "Fully sleeved in Gamegenic clear matte\nPlayed once",
    "timestamp": 1758405600
  },
  {
    "username": "rwinder",
    "rating": 6.3,
    "comment": "Mixed feelings abound! Maybe my most played solo game. Even if I stop collecting, I’ll have enough to keep me entertained for the long haul.\n\nThe achievement of the game is considerable, but still it's not up to its true potential. I have cooled on this game considerably, as it ultimately doesn’t provide more than a big boss fight.\n\nThen again...no Daredevil, Moon Knight, or Blade hero after five years and none of these in sight in the next year either... So 0/10, right?",
    "timestamp": 1758319200
  },
  {
    "username": "alangager",
    "rating": 6.0,
    "comment": "A few playthroughs so far. I'm not sure if we will ever play this 100% according to the rules. In fact, there is a video on YT where the designers play and even they mess up the rules.\nBut, that said, it's a pretty fast-paced game and relatively easy setup compared to something like Arkham Horror 3rd Ed.",
    "timestamp": 1757196000
  },
  {
    "username": "bad63rfx",
    "rating": 6.0,
    "comment": "Not a bad game, but the play cycle and the deck building were not to my liking. I prefer Arkham LCG.",
    "timestamp": 1751148000
  },
  {
    "username": "Inshane",
    "rating": 6.0,
    "comment": "To include: Captain America hero pack\nMs. Marvel hero pack",
    "timestamp": 1750111200
  },
  {
    "username": "Nod the Third",
    "rating": 6.0,
    "comment": "Got this for a friend for xmas, first 2 plays were quite fun.",
    "timestamp": 1748469600
  },
  {
    "username": "Vitho",
    "rating": 6.0,
    "comment": "(+) Good base game...  I like a lot each minion and hero,\n(+) In expansions, they all have their own capabilities, very great.\n(-) No re-playable \"Story\" / \"Campaign\" mode, only fighting minions.\n(-) For minion extensions, I feel it become (with Galaxy's Most Wanted) a Pay To Win.\n(-) way too expensive in the long run with extension.\n(-) Need to pay / buld your own insert for kick-setups.",
    "timestamp": 1748383200
  },
  {
    "username": "jgoyes",
    "rating": 6.0,
    "comment": "2025-05-20\n\nInitial Rating: 7.5 (May 2025)\n\n• Years ago, I decided to stop buying LCG games, as they publish too much content and there’s simply no time to play it all. The only one I really played was Netrunner, and even though I loved that game, I ended up selling everything. The only allowable exceptions are cooperative LCGs, which I still have high hopes for. I also LOVE Sentinels of the Multiverse and (recently) I played Slay the Spire: The Board Game, which I liked a lot. Because of that, I thought Marvel Champions: The Card Game was a game for me—and it still can be—but I didn’t enjoy much of my first play, which was an unpleasant surprise. I own most of the game’s content (I only stopped purchasing around a year ago), so I was really hoping it would click.\n\n• Marvel Champions is obviously based on the Marvel comics universe, which I have never explored. Everything I know of Marvel I know from the movies. Each player takes on the role of a famous superhero (Spider-Man, Iron Man, Captain Marvel, etc.) and must work together to defeat a villain before their evil scheme succeeds. The formula is similar´s to SOTM. You flip between your hero and alter ego sides (which is novel and brilliant), play cards for powers and upgrades, and react to the villain’s behavior each round. I guess the game does a solid job of capturing the comic book feel.\n\n• Gameplay is basically hand management and action optimization, mixed with a sort of tactical puzzle each turn (just like SOTM and Slay the Spire). You play cards from your hand by discarding others to pay their costs (a RFTG system I really like), and then use those cards to attack, thwart, defend, etc. From my only play, I saw several cards repeated between my deck and my partner’s deck, which is a disappointment. I was expecting fully asymmetrical decks, but around half of the cards were the same. I dislike this a lot. Also, the game feels too long for what it is. Perhaps I was tired that night and I will give it another play, but when we won I didn’t feel much emotion.\n\n• Since my Magic: The Gathering days, I’ve never really liked assembling my own deck. I used to just wait for tournament results and copy whatever won. I’m not sure how deckbuilding really works here yet, but I’m glad I can just pick a preconstructed deck and play. That’s a big plus for me. The older I get, the least amount of deckbuilding I want to do.\n\n• The luck factor is definitely present—card draws can make or break a turn—but that’s to be expected in a co-op card game, and I enjoy it. In fact, the harder the game the better, so luck doesn’t bother me in cooperative games.\n\n• Best with 2 players. I won’t play it with 3 players—too much downtime—and I’m not a solo player (unless I can get it in an app form).\n\n• The replay value is VERY high. There’s a huge amount of content—heroes, villains, modular sets—and tons of combinations to try out. I probably own more of it than I’ll ever play, which bothers me, and perhaps I will end up selling it. I have played lots of SOTM and I still haven’t played it all.\n\nBottom line, Marvel Champions: The Card Game has been a disappointment so far. It’s probably my own fault as I expected too much from it. In any case, the game is a cooperative card game with tons of content and a great Marvel theme, so I can recommend it without reservation. I still have hopes for the game and I hope my initial playthrough was a fluke somehow. The hero decks feel too similar (a shame), and playtime can drag, especially with more players. As things stand, the game didn’t blow me away. I didn’t hate it, but I also didn’t feel excited to keep playing after my first session. Both Sentinels of the Multiverse and Slay the Spire are superior IMO. Before getting rid of it, I will give it at least one more chance to woe me, but if that fails, I’m afraid it might go the way of my other LCGs. Right now, Sentinels of the Multiverse is still the superhero card game I’d rather play.\n\nCurrent Rating: 6.0",
    "timestamp": 1747692000
  },
  {
    "username": "Earl_of_punk",
    "rating": 6.0,
    "comment": "Ich habe mir vor einiger Zeit das Spiel gekauft und auch wenn ich es ganz gut finde habe ich hier mal wieder vergessen dass ich gar nicht mal sooo gerne Deckbuilding mag. Naja macht man michts wenn es jemand haben möchte meldet euch",
    "timestamp": 1747087200
  },
  {
    "username": "david1123",
    "rating": 6.0,
    "comment": "Solo / solo suitable",
    "timestamp": 1746655200
  },
  {
    "username": "Beru",
    "rating": 6.0,
    "comment": "#WTPextension",
    "timestamp": 1745445600
  },
  {
    "username": "areeves",
    "rating": 6.0,
    "comment": "I really wanted to like this because of it's similarity to Arkham Horror LCG, but it is really punishing like the other game. The them is great but doesn't make up for the difficulty.",
    "timestamp": 1745359200
  },
  {
    "username": "playr2",
    "rating": 6.0,
    "comment": "Need to give this game another try",
    "timestamp": 1744322400
  },
  {
    "username": "Solocelt",
    "rating": 6.0,
    "comment": "Not really much fun, it's a game with zero feeling to it when playing solo, not much depth in story, not much continuity in selecting cards, the chemistry between cards isn't there, a fairly soulless game",
    "timestamp": 1742943600
  },
  {
    "username": "CRettig",
    "rating": 6.0,
    "comment": "Only played it once so far, and it feels like Sentinels of the Multiverse, but with decent artwork.",
    "timestamp": 1742857200
  },
  {
    "username": "CMagex",
    "rating": 6.0,
    "comment": "battlefield, needs more plays",
    "timestamp": 1742338800
  },
  {
    "username": "R2DChew",
    "rating": 5.5,
    "comment": "Played this 3 times and I just can’t get into it..",
    "timestamp": 1738623600
  },
  {
    "username": "TheGreatGayAspie",
    "rating": 6.0,
    "comment": "Good production values and some fun ideas but I think this kind of firefighting co-op just isn't for me.",
    "timestamp": 1736895600
  },
  {
    "username": "LordHaas",
    "rating": 6.0,
    "comment": "10 pounds of stuff in a 5 pound bag.",
    "timestamp": 1736809200
  },
  {
    "username": "RollPatrol",
    "rating": 6.0,
    "comment": "Trying to get into it and get a hint of the hype but so far, pretty boring experience for me.",
    "timestamp": 1736550000
  },
  {
    "username": "TheTomTraveller",
    "rating": 6.0,
    "comment": "Expansions:\nRise of Red Skull\nSinister Motives\n\nHeroes:\nSp//dr\nVision\nVenom\nScarlet Witch\nQuicksilver\nDoctor Strange\nThor\nCaptain America",
    "timestamp": 1735426800
  },
  {
    "username": "jefferlope",
    "rating": 6.0,
    "comment": "Fun! But we really felt like we were getting steamrolled by Rhino",
    "timestamp": 1733612400
  },
  {
    "username": "fredknittel",
    "rating": 6.0,
    "comment": "LCG cooperative boss battler, really liked the specific nemesis and obligation cards that affect specific heroes. Looking forward to digging in more.",
    "timestamp": 1733612400
  },
  {
    "username": "Creativenothing",
    "rating": 7.0,
    "comment": "The LCG magnum opus.",
    "timestamp": 1762210800
  },
  {
    "username": "Daimler",
    "rating": 7.0,
    "comment": "LD. Seems like a pretty regular cooperative LCG in the vein of Lord of the Rings The Card Game mixed with Race for the Galaxy. Rules are a bit on the heavier side. Based on the high ratings seems to be quite balanced. Works best with only 1-2p.\n\nNot a fan of Marvel but liked gameplay, it does feel thematic with interesting decisions to be made.\n\nBased on Arkham Horror The Card Game experience - LCG might be not for me? Based off 1 solo play Marvel Champions seems to be more interesting and less punishing game. Try campaign?",
    "timestamp": 1762124400
  },
  {
    "username": "ElQuappo",
    "rating": 7.0,
    "comment": "zu verkaufen (?)",
    "timestamp": 1761429600
  },
  {
    "username": "Hymn_of_Limbo",
    "rating": 7.0,
    "comment": "A decent solo or two player coop game that can be surprising difficult to get to the table and has some lazy card design. Not only are there reprinted cards between hero packs, some of these cards are reprinted from previous LCGs.\n\nGame balance comes at the expense of card flair: most being less memorable than your average MTG card, and can build up to a cluttered table and a decent amount of upkeep.\n\nArt is hit and miss (most of it lifted from comics), but the graphic design and card layout are well done.\n\nMeaningful deck building comes after a buy in of around $150 (MSRP) and even then isn't very interesting (the game has strict deck building limitations to keep the game accessible/balanced which reduces card synergies). Terminology and timing can be clunky. The only way to flesh out aspects (the four suits of the game, essentially) you like playing with is to buy hero packs, which can be frustrating/expensive/addicting/fun. God help you if you like aggression as you'll be stuck staring at the Hulk, Valkyrie and Thor packs that range from downright awful to acquired taste. (Edit: consequent aggression packs improved)\n\nSome modules in this box are required to play other scenario packs/campaigns which is mostly unnecessary/predatory. The seven standard encounter cards for example should just be reprinted in the campaign expansions so people can pick any starting point they wish. They reprint the three basic resource cards for each hero pack and I don't see how this is any different. It would also cut down on the card separating needed to prep encounters.\n\nThese five heroes are a great selection, which even if some are weak in the larger meta of the game (She Hulk) they are fun to play with. Don't worry, Captain Marvel and Black Panther are quite strong so you can find a difficulty that is right for you. The villains aren't as unique as later expansions, but are decent.\n\nMinor complaint: status cards should have been tokens, and some tokens should have been dice.\n\nWhile I enjoy the game, it suffers from drab aspect card design that is too often subtle variations of previous cards. I went in expecting the deckbuilding fun to grow significantly as the card pool increased but on top of straight reprints in hero packs there are too many cards themelessly restricted by keyword or simply uninteresting. The underlying math to the game pierces the theme's veil too frequently and makes the game less interesting.\n\n(100+ Plays)",
    "timestamp": 1760997600
  },
  {
    "username": "mlm67",
    "rating": 7.0,
    "comment": "S E L L ?? . . . . . Butik: 2431:- ..... 1595:-\n\nIncl:\nBase game: 579:-\nExpansions: Rise of Red Skull 419:-, Mad Titan's Shadow 389:-\nHero Packs: Captain America 165:-, Black Widow 165:-, Doctor Strange 164:-, Venom 175:-\nGameGenic XL playmat: 375:-",
    "timestamp": 1760824800
  },
  {
    "username": "Robber91",
    "rating": 7.0,
    "comment": "Fun cooperative engine builder.",
    "timestamp": 1760479200
  },
  {
    "username": "GrandPseudonym",
    "rating": 7.0,
    "comment": "Best Solo\nBest with 2\n~60 Minutes\nMediumweight\nCo-op\nStrategy\nThematic\nCombat\nCardplay",
    "timestamp": 1759615200
  },
  {
    "username": "worador",
    "rating": 7.0,
    "comment": "Awesome solo and 2 player game that lets you build combotastic highly thematic turns. 3+ just takes forever and overstays its welcome all the time for me.\nIn the end turns can be summarized to \"I do X damage and thwart X\", after playing tons of cards and activating effects that take a lot of time and don't have to be executed but just resolved for calculation.",
    "timestamp": 1759615200
  },
  {
    "username": "blackpawl",
    "rating": 7.0,
    "comment": "2025 / 2023",
    "timestamp": 1759269600
  },
  {
    "username": "atlas64gaming",
    "rating": 6.5,
    "comment": "AUGUST 2023: 92ND",
    "timestamp": 1759096800
  },
  {
    "username": "SkyGlad",
    "rating": 7.0,
    "comment": "Torn on this one. Perhaps the best mechanically of the three cooperative LCGs, but the theme I care about least. I love the paying for cards with cards mechanism.",
    "timestamp": 1757973600
  },
  {
    "username": "Cocoabine",
    "rating": 7.0,
    "comment": "7/10: Fun, while grossly overrated. Pros: I enjoy the modular nature of the game, taking pieces to mix and match together for villains, creating interesting and unique situations. I enjoy the variety of heroes, and how they can play differently based on their abilities, and I really appreciate the challenge this game poses. For both better and worse, playing true solo (1 player as 1 hero) feels like a puzzle, where certain combinations of heroes and aspect decks simply won't work, while others have a high chance of success. Cons: I have the core box, 3 hero packs, and an expansion and I really expected more from this game at this point. Some of the aspects are still awful, specifically protection. The 'deckbuilding' is extremely limited, as there are very clearly better cards than others, which will comprise most hero decks. It needs far more expansions to be purchased for there to be a variety of different ways to play the same aspect each time. Instead of feeling complete with what I have, and that buying more would be more variety of content that I already enjoy, its more like getting more would fix fundamental problems in its design, which is an awful model for a game - making it needlessly and endlessly expensive. It also doesn't help that plenty of the early hero packs and expansions are out of print, and cost a significant amount of money that is just not reasonable or sane to expect new players to dish out for. While I still enjoy the game, I am on the fence as to if it is worth ever buying more.",
    "timestamp": 1756936800
  },
  {
    "username": "Jesse Terrell",
    "rating": 7.0,
    "comment": "7.5/",
    "timestamp": 1756591200
  },
  {
    "username": "bazzinc",
    "rating": 7.0,
    "comment": "ms marvel, the green goblin, captain america, the wrecking crew, thor, black widow, hulk, doctor strange, the rise of red skull, ONCE AND FUTURE KANG, ant-man, weasp, quicksilver, scarlet witch, the galaxy's most wanted, gamora, star lord, venom, the mad titan's shadow, drax, nebula, the hood, warmachine, valkyrie, sinister motives, ironheart, nova, Vision, cyclops, phoenix, mutant genesis,next evolution, psylocke, x-23,angel,deadpool,age of apocalypse, iceman, jubilee, nightcrawler, magneto, black panther, agents of shield, Silk, Falcon, Winter Soldier,trickster takeover,",
    "timestamp": 1756245600
  },
  {
    "username": "Connduit",
    "rating": 8.0,
    "comment": "2-4",
    "timestamp": 1761951600
  },
  {
    "username": "Qhorin",
    "rating": 8.0,
    "comment": "Played 2-handed solo. I’ve been sick of the IP for quite some time, but I think they did a great job of thematic integration. Elements like alter egos, boss scheming and attacking, minion proliferation, and obligations really embrace the theme. Puzzly in a light-Spirit Island way.",
    "timestamp": 1761865200
  },
  {
    "username": "pro_tempore",
    "rating": 8.0,
    "comment": "Cool system overall. Very nice variance allows you to play endlessly if you enjoy what Marvel Champions offers. Fantastic use of license.\n\nUpped rating to an 8, and it might deserve higher considering how often we've played it. Gets downgraded slightly because it still tends to feel anticlimactic and/or too abstract in many sessions.\n\nI enjoy both Arkham Horror LCG and Lord of the Rings LCG more... but I play both of those games less often...",
    "timestamp": 1761865200
  },
  {
    "username": "Brezman",
    "rating": 8.0,
    "comment": "NK",
    "timestamp": 1761519600
  },
  {
    "username": "Telaz",
    "rating": 8.0,
    "comment": "My rating (50%): 8\nMy “want to play-again” rating(50%): 8\nMy averaged rating: 8\nPlays:\n\nSOO much better than the kids game (marvel united)",
    "timestamp": 1761429600
  },
  {
    "username": "PBandJellyfish",
    "rating": 8.0,
    "comment": "@SC",
    "timestamp": 1761170400
  },
  {
    "username": "kfbunny",
    "rating": 8.0,
    "comment": "Fine game, but I prefer the game it based itself on: Sentinels of the multiverse.\nI will play this one again if a friends wants to.\n\nrating history\n1st play: 8",
    "timestamp": 1760911200
  },
  {
    "username": "StupidRatCreature",
    "rating": 8.0,
    "comment": "Have all campaigns, scenario and hero packs.",
    "timestamp": 1760565600
  },
  {
    "username": "Nunius",
    "rating": 8.0,
    "comment": "Another excelent LCG.\nI like the gameplay and IP (I like most of Marvel Universe's Characters).\nThis LCG is more casual friendly. The Core Box comes with a playset of each cards (doesn't need to buy a second or third core boxes). And the encounter decks are less punitive than others LCG's (unless you play an Expert mode).\nOverall, it is a great solo and co-op game.\n\nUpdate 2021/09/21\nIt's still an excellent game that I play regularly. The only downside is, like all others LCG and CCG, you need to acquire some (or all) the expansions to keep it fresh and improve it gameplay.\n\nUpdate 2024/11/08\nAfter adding \"few\" more expansion to my collection, I realized that I didn't play with these \"new\" heroes (X-Men) at all; I played solo (mostly), and with Avenger heroes... I culled most of heroes/expansion keeping at minimum, and heroes/villains I like most (almost all from first 2 cycles - Avenger)",
    "timestamp": 1760133600
  },
  {
    "username": "affarimiei",
    "rating": 7.5,
    "comment": "PYN 63.5X88 Perfect Size nere",
    "timestamp": 1760047200
  },
  {
    "username": "halbower",
    "rating": 8.0,
    "comment": "Quite possibly the worst insert of all time. Which is saying something because FFG has a prolific history of making bad inserts.",
    "timestamp": 1759960800
  },
  {
    "username": "MoMahili",
    "rating": 8.0,
    "comment": "Keep",
    "timestamp": 1759874400
  },
  {
    "username": "koutynhu",
    "rating": 8.0,
    "comment": "LIVING CARD GAME\nSubtype: Card Game / Episodic\n\n- Cooperative Deck-Building & Hand Management LCG Game (1-4 Players) [Best:2]\n- Theme: Marvel\n- Complexity:2.69\n\n*Own:\n1. Base Game (01)\n2. Hero Packs MCU: (21) Cap. America, Ms. Marvel, Black Widow, Dr. Strange, Thor, Hulk, Ant-Man, Wasp, Quicksilver, Scarlet Witch, Star-Lord, Gamorra, Drax, Venom, Nebula, War Machine, Valkyrie, Vision, Nova, Ironheart, Spider-Ham\n2. Hero Packs X-Men: (14) Cyclops, Phoenix, Wolverine, Storm, Gambit, Rogue, Psylocke, Angel, X-23, Deadpool, Iceman, Jubilee, Nightcrawler & Magneto\n3. Hero Packs (Repacks and on): Black Panther, Silk, Falcon, Winter Soldier (Pre-order)\n4. Scenario Packs: (05) Green Goblin, Wrecking Crew, The Once and Future Kang, The Hood, MojoMania, Tricksters Takeover (Pre-Order)\n5. Campaign Expansions: (07) The Rise of the Red Skull, The Galaxy's Most Wanted, The Mad Titan's Shadow, Sinister Motives, Mutant Genesis, NeXt Evolution, Age of Apocalypse, Agents of S.H.I.E.L.D (pre-order)\n6. Extras: Gamegenic Blue Playmat\n\nSummary:\nIf you enjoy the LCG games and Marvel, definitely a nice game! When compared with Arkham Horror LCG it doesn't shine as bright due to the lack of campaign and deck progresssion.\nStill, you can do some deckbuilding between scenarios to change the flavour of the game both in the heroes as in the Villain Decks!",
    "timestamp": 1759788000
  },
  {
    "username": "Ddyraw",
    "rating": 8.0,
    "comment": "Very good game, but only played solo and I dont feel like it would be that fun outside of solo. Got rid of it.",
    "timestamp": 1759356000
  },
  {
    "username": "BigBoater",
    "rating": 9.0,
    "comment": "I find this very enjoyable. It doesn't last longer than it has to. The rules between characters are very easy to learn. This is my first LCG so maybe I'm biased, but it is very fun.\n\nEasy to learn: Yes\nTime to play: 30-60 min (Depending on Campaign)\nRe-playable: Yes\nRecommend: A great co-operative game or solo or two handed LCG ... Yes",
    "timestamp": 1762671060
  },
  {
    "username": "LolsuFn",
    "rating": 9.0,
    "comment": "One of the most thematic deck builders with lots of fun ideas. I'm amazes how the developers manage to translate Abilties, etc. into Board Game mechanics.",
    "timestamp": 1762639860
  },
  {
    "username": "Shaunmood",
    "rating": 9.0,
    "comment": "Great boss battler LCG. Most of the original/staple heroes are our of production which is dumb but great game nonetheless.",
    "timestamp": 1762297200
  },
  {
    "username": "oldschoolgamr",
    "rating": 9.0,
    "comment": "An X-traordinary game\nAs an all-in Arkham player, I had been side-eyeing Marvel Champions for years. Uncanny X-Men (via the 1986 Classic X-Men reprint) was my introduction to comics and heroes, so there was no possible way I was going to miss getting them to my game table. Shadowcat, Colossus, Cyclops, Phoenix, Wolverine, Storm, Gambit, and Rogue - the teenager in me is REALLY enjoying this. The dependable FFG quality, depth of mechanics, imagination and innovation make this a wonderful experience. Got it, Bub?\n\nBOX INSERTs: Go7 Gaming MC-001 Marvel Champions for base box and The Broken Token Marvel Champions Compatible Expansion Organizer (SKU: ORG127) for expansion boxes\n\nCARD SLEEVES: Ultimate Guard Supreme Matte Sleeves (Standard Size) AND Gamegenic Clear Sleeves (Standard Card Game Size for Identity and Permanant Cards)\n\nCARD STORAGE: Fageverld three-drawer Trading Card Storage (x6) for Hero|Villain|Player Card (sleeved) storage\n\nSTORAGE LINER: Bahail Drawer and Shelf Liner (non-adhesive | Black) ~ Essential shelf liner so cards don’t slip when a drawer is not completely full - which avoids maintaining foam squares or other spacers ~\n\nPLAYMAT: Ultimate Guard 80 large playmat (black) with Ultra Pro Baseball Bat Tube for rolled storage\n\nPLAYER BOARDS: Team Covenant Cosmic Boards (4)\n\nGAME TOKENS: Team Covenant Hero Cosmic Token Sets (2); Villain Cosmic Token Set\n\nEXPANSIONS: The Rise of Red Skull [S1-Crossbones], Sinister Motives [S4-The Sinister Six], Mutant Genesis [Shadowcat | Colossus], NeXt Evolution [Domino | Cable], Age of Apocalypse [Magik | Bishop], Agents of Shield [Maria Hill | S1-Black Widow | S2-Batroc | S4-Thunderbolts + all Thunderbolt Modular Sets]\n\nSCENARIO PACKS: Green Goblin, MojoMania\n\nFANTASY FLIGHT HEROES: Black Widow, Hulk (Hero Cards), Ghost-Spider (Hero Cards), Spider-Man (MM) (Hero Cards), Ironheart (Hero Cards), Cyclops, Phoenix, Wolverine, Storm, Gambit, Rogue, Angel, Psylocke, X-23, Iceman, Jubilee, Nightcrawler, Magneto, Maria Hill, Winter Soldier, Core Set Heroes\n\nCUSTOM HEROES [101]: Albert {Kajislav}, All New Wolverine/X-23 {BerettaBeast}, Aurora/Northstar {Designhacker}, Banshee {JOTF2609}, Batman Beyond {BerettaBeast}, Beast {Hainz3y2}, Binary {Kajislav}, Black Bolt {Designhacker}, Black Cat {Picollo}, Blade {Rainy}, Blink {Designhacker}, Boom-Boom {Odysseus}, Cannonball {Rainy}, Carnage (CK) {Lokyord}, Carnage (EB) {Neptune}, Chamber {Designhacker}, Clea {JackHKP}, Cloak & Dagger {Designhacker}, Cosmic Ghost Rider {bluehg}, Cypher {Designhacker}, Daredevil (EN) {Rainy}, Darwin {JackHKP}, Dazzler {Lord Havok}, Deathlok {Designhacker}, Destiny {Merlin}, Doctor Octopus {Ripper3}, Dum Dum Dugan {JOTF2609}, Dust {BerettaBeast}, Elsa Bloodstone {CptScorp}, Emma Frost {PHComassetto}, Emma Frost (White Queen) {Rainy}, Fantomex {PHComassetto}, Forge {Designhacker}, Franken-Castle {Odysseus}, Gentile {Cogahan}, Ghost Rider/Johnny Blaze {Rainy}, Ghost Rider/Robbie Reyes {Rainy}, Glob {Designhacker}, Gwenpool {ekAugust}, Havok {PHComassetto}, Hawkeye (KB) {CptScorp}, Hellcat {jakxin}, Hulk {Rainy}, Husk {Designhacker}, Indestructible Hulk {Karmi}, Jean Grey {Dawnbreak}, Jessica Jones {ekAugust}, Juggernaut {EmbitteredSoul}, Karma {Designhacker}, Karnak {Luke Muench}, Legion {Designhacker}, Longshot {EmbitteredSoul}, Luke Cage {Rainy}, Maggott {Designhacker}, Magma {Designhacker}, Man-Thing {Designhacker}, Manifold {bluehg}, Mirage {Designhacker}, Mondo {Designhacker}, Morbius {Odysseus}, Multiple Man {Swept}, Mystique {Merlin}, Namor {Odysseus}, Night Thrasher {Designhacker}, Old Man Logan {Nugget}, Penance {Designhacker}, Persuasion {Kajislav}, Pixie {Muddy}, Polaris {JackHKP}, Professor X {Designhacker}, Professor X ( House of M) {PHComassetto}, Punisher {Odysseus}, Rachel Summmers {Ripper3}, Rasputin IV {jakxin}, Red Guardian {Kajislav}, Red Hulk {Rainy}, Rockslide {Designhacker}, Rorschach {BerettaBeast}, Sabertooth {RyCoRan}, Scarlet Spider {Odysseus}, Shatterstar {Karmi}, Speedball {Karmi}, Spider-Man 2099 {Odysseus}, Spider-Man Noir {Illogical}, Spider-Punk {Odysseus}, Squirrel Girl {Designhacker}, Star-Lord (KP) {ekAugust}, Strong Guy {Designhacker}, Sunspot {Dipsome}, Surge {XB}, Synch {JackHKP}, Temper {jakxin}, Totally Awesome Hulk {Designhacker}, Uncanny Spider-Man {Ripper3}, Venompool {CptScorp}, Warlock {Designhacker}, Warpath {Odysseus}, Weapon Hex {Merlin}, White Fox {Mysteltainn}, Wolfsbane {matty}, X-Man {Tuviel023}\n\nCUSTOM VILLAINS [35]: Abomination {JOTF2609}, Dark Phoenix {Dipsome}, Doctor Doom {Designhacker}, Doctor Octopus {Odysseus}, Dormammu {Jammydude44}, Electro {Designhacker}, Fin Fang Foom {Nugget}, Foolkiller {JOTF2609}, Graviton {XB}, Kingpin {Jammydude44}, The Lizard {Nugget}, Maestro {Nugget}, Mandarin {Designhacker}, Mister Negative {Andy N}, Mole Man {Designhacker}, Morbious {Jammydude44}, Namor {Designhacker}, Power Vacuum {Lord_Havok}, Prowler {Nugget}, The Punisher {PERMAKARMA}, Purple Man {Designhacker}, Sabertooth & Mystique {PERMAKARMA}, Scorpion {Nugget}, Shocker {Ripper3}, The Spot {Designhacker}, Swarm {Designhacker}, Venom {Designhacker}, Virus {ekAugust}, Vulture {Nugget}, Whirlwind {Kajislav}, World War Hulk {Jammydude44}, Xavier Squid {Phenexian}, The Zodiac {TopBanana}\n\n[MARVEL CHAMPIONS: THE CARD GAME SELECT SINISTER MOTIVES WAVE | ALL X-MEN WAVES | SELECT AGENTS OF SHIELD WAVE {THE NEW AVENGERS} COMPLETED 2025]",
    "timestamp": 1762038000
  },
  {
    "username": "Doomfarer",
    "rating": 9.0,
    "comment": "Good game. Nothing amazing but still gets the job done. The deck building part could be better though as there's actually not that many cards you can switch out in the base game. I guess that's what expansions are for.\n\nEdit: Expansions really increase the fun, but it's a bummer that the Base game is so bare-bones as it is. They should have included more scenarios at least.\n\nBalance fix for early heroes:\nHulk & She-Hulk get five card hands in hero form\nThor treats Asgard as if it had the set-up keyword\nEverytime Doctor Strange shuffles his Invocation deck, he is dealt a face down encounter card.",
    "timestamp": 1761606000
  },
  {
    "username": "NathanM",
    "rating": 9.0,
    "comment": "Played 33 games in late 2022 to early 2023 that were recorded outside BoardGameStats/BGG in a spreadsheet. All games were True Solo. Resuming in Oct 2025 as two-handed solo and potential multiplayer and will log all completed games to BGG.",
    "timestamp": 1761519600
  },
  {
    "username": "YoLYcmqZ",
    "rating": 9.0,
    "comment": "Thoughts: My absolute favorite and as close to a 10 as I can give. Nearly 100 plays in and I own almost everything—that should tell you enough. Deck construction hits perfectly, every hero feels unique, and it shines solo. Can't see myself ever getting tired of it.\n\nTag(s): Deck Builder, Solo-Friendly, Thematic\nBest Player Count: 1-3, {1-2}\nRating: 8.5, +0.5\nOwn: Physical\n+ Campaign(s): Rise of the Red Skull, Galaxy’s Most Wanted, Mad Titan’s Shadow, Sinister Motives, Mutant Genesis, NeXt Evolution\n+ Scenario Pack(s): Green Goblin\n+ Hero Pack(s): Captain America, Ms. Marvel, Thor, Black Widow, Doctor Strange, Hulk, Ant-Man, Wasp, Quicksilver, Scarlet Witch, Star-Lord, Gamora, Drax, Venom, Nebula, Valkyrie, Vision, Nova, Ironheart, Spider-Ham, SP//DR, Cyclops, Wolverine, Storm, Rogue, X-23",
    "timestamp": 1761519600
  },
  {
    "username": "K_oroviev",
    "rating": 9.0,
    "comment": "This is probably the best Core Set FFG has put out in years (for all of their games, not only the LCGs). The 5 heroes are fun and by mixing and matching them with the aspect cards you get a lot of replayability. Also, the 3 villains are interesting and players can greatly adjust the difficulty with the included modulars.\n\nAll in all, a great standalone product to help you figure out if you are into the game. You might also get only this one, play it 30+ time, sell it, and be extremely happy about it.",
    "timestamp": 1761519600
  },
  {
    "username": "junshengkeh",
    "rating": 9.0,
    "comment": "Wave 1...\n+ Captain America (2019)\n+ Ms. Marvel (2019)\n+ Thor (2020)\n+ Black Widow (2020)\n+ Doctor Strange (2020)\n+ Hulk (2020)\n\nWave 2...\n+ The Rise of Red Skull (2020)\n+ Ant-Man (2020)\n+ Wasp (2020)\n+ Quicksilver (2020)\n+ Scarlet Witch (2020)\n\nWave 3...\n+ The Galaxy's Most Wanted (2021)\n+ Star Lord (2021)\n+ Gamora (2021)\n+ Drax (2021)\n+ Venom (2021)\n\nWave 4...\n+ The Mad Titan's Shadow (2021)\n+ Nebula (2021)\n+ War Machine (2021)\n+ Valkyrie (2021)\n+ The Vision (2021)\n\nWave 5...\n+ Sinister Motives (2022)\n+ Nova (2022)\n+ Ironheart (2022)\n+ Spider-Ham (2022)\n+ SP//dr (2022)\n\nWave 6...\n+ Mutant Genesis (2022)\n+ Cyclops (2022)\n+ Phoenix (2022)\n+ Wolverine (2022)\n+ Storm (2022)\n+ Gambit (2023)\n+ Rogue (2023)\n\nWave 7...\n+ NeXt Evolution (2023)\n+ Psylocke (2023)\n+ Angel (2023)\n+ X-23 (2023)\n+ Deadpool (2023)\n\nWave 8...\n+ Age of Apocalypse (2024)\n+ Iceman (2024)\n+ Jubilee (2024)\n+ Nightcrawler (2024)\n+ Magneto (2024)\n\nWave 9...\n- Agents of S.H.I.E.L.D. (2025)\n- Black Panther (2025)\n- Silk (2025)\n+ Falcon (2025)\n+ Winter Soldier (2025)\n\nCivil War Wave...\n+ Civil War (2025)\n- Wonder Man (2025\n\nScenario Pack...\n+ The Green Goblin (2019)\n+ The Wrecking Crew (2020)\n+ The Once and Future Kang (2020)\n+ The Hood (2021)\n+ MojoMania (2023)\n+ Trickster Takeover (2025)\n/- Synthezoid Smackdown (2025)",
    "timestamp": 1761170400
  },
  {
    "username": "mingrkli",
    "rating": 9.0,
    "comment": "Superheroes need I say more ? ? This is another one of my fav board games I still keep in real life, It's great to bring it out and fight against the villians! if you like swinging through cities, blasting villains, and saving the world with style? Then grab your mask, because this is Marvel Champions: The Card Game! A 1–4 player co-op card game where you and your friends step into the boots (or suits) of your favorite Marvel heroes to take down the biggest, baddest villains in the universe.\n\nHow do you win? Work together to stop your chosen villain from pulling off their evil master plan whether it’s Ultron threatening global annihilation, Rhino smashing up New York, or some new menace waiting in the shadows. Each hero has their own deck, playstyle, and powerful upgrades swap between your hero and alter-ego forms to recover, plan, and strike at just the right time.\n\nThe game’s alive and always growing, with new heroes, villains, and scenarios dropping regularly. Suit up, team up, and face the impossible. The world’s counting on you, hero. ?",
    "timestamp": 1760738400
  },
  {
    "username": "xinelank",
    "rating": 9.0,
    "comment": "Sinister Motives\nRise of the Red Skull\nGreen Goblin Scenario\n\nHeroes:\nCaptain America\nBlack Widow\nStorm\nMs Marvel\nDeadpool",
    "timestamp": 1760479200
  },
  {
    "username": "sweetsweetdoughnuts",
    "rating": 8.8,
    "comment": "This is a messy game. Card interactions are not always entirely clear (FFG card wording!), games can be swingy, timing and interruptions add complexity, and the table state is frequently a mess with many cards in play that players need to track and remember. But, it somehow still frequently and consistently delivers a fun, challenging experience that our group keeps returning to.\n\nIt's just as satisfying played solo (but not true solo), or up to 4 players.\n\nDeckbuilding presents an ever-present twist and challenge, or building themey, pre-set decks both works. As an experienced gamer with many hundreds of games, I prefer to keep this light and accessible rather than a lifestyle game, but it has still been played almost 100 times at this point.\n\nNever great value (since it's an LCG), but very consistently good fun.\n\nEdit: We're well over 200 play in, and while I still can't quite articulate why, I pretty much always enjoy playing this. Perhaps it is just better than the sum of its parts?\n\nRating up from 7.2 to 8.8",
    "timestamp": 1760306400
  },
  {
    "username": "NillaDkilla",
    "rating": 9.0,
    "comment": "So much fun and fantastically well designed. The game can be played with a simple mechanism for learners or kids or with more experience and better tactics. Genuinely a very enjoyable experience.",
    "timestamp": 1760047200
  },
  {
    "username": "abtrube",
    "rating": 9.0,
    "comment": "1/4/20 Jimmy, Dan P",
    "timestamp": 1759701600
  },
  {
    "username": "KingEngine1",
    "rating": 10.0,
    "comment": "In collection: 2023 November\nWhy did I buy it: A coop game that I could play solo or 2p. I wanted a lifestyle game.\n\nNumber of plays with each hero:\n\nSpider-Man (Peter): 17\nCaptain Marvel: 7\nBlack Panther: 7\nIron-Man: 11\nShe-Hulk: 6\nBlack Widow: 7\nAnt-Man: 11\nDoctor Strange: 6\nCaptain America: 11\nScarlet Witch: 12\nHulk: 4\nQuicksilver: 1\nSpider Woman: 2\nHawkeye: 1\nSpider-Man (Miles): 9\nGhost Spider: 11\nSpider-Ham: 8\nSP//dr: 10\nWolverine: 12\nStorm: 8\nCyclops: 5\nGambit: 6\nIce Man: 3\nColossus: 6\nShadowcat: 8\nRogue: 6\nPhoenix: 9\nNightcrawler: 10\nMagneto: 6\nPsylocke: 4\nDeadpool: 1\nBishop: 2\nMagik: 4\nSilk: 4",
    "timestamp": 1762659540
  },
  {
    "username": "ClintAchilles",
    "rating": 10.0,
    "comment": "It's been my most played game since it came out by far. It suffers from bloat, there's no doubt. Content keeps coming out, and I think at this point I've reached my fill. Of course, I've said that before, and now I got the entire Shield cycle waiting to be tested out on my shelf. It's a fun card game, managing resources versus playable cards, knowing when to flip to your secret identity, when to pile on the damage, and when to remove those counters from schemes. Certain scenarios can be won in a handful of rounds, and others can be a slog that ultimately ends in defeat after seemingly decking yourself multiple times. I think it's a solo or 2-player game only, but I prefer it solo. I could see pairing it down to choice characters and scenarios, and I've never gotten into deck building in this game, but I don't see it ever fully leaving my collection.",
    "timestamp": 1762383600
  },
  {
    "username": "TabledTonight",
    "rating": 10.0,
    "comment": "Heros:\n-Captain Marvel\n-She Hulk\n-Iron Man\n-Black panther\n-Spider-Man\n-Black Widow\n-Scarlet Witch\n-Vision\n-Spectrum\n-Adam Warlock\n-Winter Soldier\n-Thor\n-Ms Marvel\n-Psylocke\n-Hulk\n-Groot\n-Rocket\n-Gamora\n\nVillains:\n-Rhino\n-Klaw\n-Ultron\n-Norman Osborn\n-Green Goblin\n-Kang\n-Ebony Maw\n-Proxima Midnight/Corvus Glaive\n-Thanos\n-Hela\n-Loki\n-Magog\n-Spiral\n-Mojo\n-Wrecker\n-Piledriver\n-Bulldozer\n-Thunderball\n-Drang\n-Nebula\n-The Collector\n-Ronan the Accuser",
    "timestamp": 1762038000
  },
  {
    "username": "Einxald",
    "rating": 10.0,
    "comment": "Everything up to Agents of SHIELD cycle excluding Wrecking Crew",
    "timestamp": 1761865200
  },
  {
    "username": "ditterio",
    "rating": 10.0,
    "comment": "MARVEL CHAMPIONS (1-4 players)\n\nMarvel Shuffle: https://www.marvelshuffle.com/?id=s81FpiuASXdyKbyJpQ1H\n\nHorizontal dividers: https://boardgamegeek.com/filepage/190552/marvel-champions-l...\n\nPlayer aid: https://boardgamegeek.com/filepage/253921/solo-cheatsheet\n\nStar difficulty levels: https://boardgamegeek.com/thread/2438111/star-difficulty-lev...\n\nFAQ: https://docs.google.com/document/d/1LoxeYzEQ0HIkf3_aSi1qOTWb...\n\nStrategy guide: https://boardgamegeek.com/thread/3056134/strategy-guide-cham...\n\nUniversal prebuilt decks: https://boardgamegeek.com/geeklist/278797/marvel-champions-u...\n\nAll in one glossary: https://boardgamegeek.com/filepage/271707/marvel-champions-a...\n\nCard database: https://hallofheroeslcg.com/browse/\n\nDOCTOR STRANGE HERO PACK (1-4 players)\nANT-MAN HERO PACK (1-4 players)\nGAMORA HERO PACK (1-4 players)\nNOVA HERO PACK (1-4 players)\nCAPTAIN AMERICA HERO PACK (1-4 players)\n\nMARVEL CHAMPIONS CORE SET (1-4 players)\n\nDr. Strange beats Rhino\nIron man beats Rhino\nSpectrum & Warlock beat Rhino\nAnt-Man killed Rhino\nSpider-Woman beats Rhino\nAdam Warlock beats Klaw\nCaptain Marvel beats Klaw\nAnt-Man beats Klaw\nSpider-Woman beats Klaw\nMs Marvel, Spider-man & She Hulk beat Ultron\nAdam Warlock beats Ultron\nShe Hulk beats Ultron\n\nTHE MAD TITAN'S SHADOW (1-4 players)\n\nSpectrum & Warlock beat Ebony Maw\nSpectrum & Warlock beat Tower Defense (Proxima Midnight/Corvus Glaive)\nSpectrum & Warlock beat Thanos\nAdam Warlock beats Hela\nBlack Panther beats Hela\nAdam Warlock beats Loki (standard mode)\nCaptain Marvel beats Loki\n\nTHE RISE OF RED SKULL (1-4 players)\n\nAdam Warlock beats Crossbones\nBlack Panther beats Crossbones\nHawkeye beats Crossbones\nDr. Strange beats Crossbones\nSpider-Woman beats Crossbones\nAdam Warlock beats Absorbing Man\nGhost Spider beats Absorbing Man\nAdam Warlock beats Taskmaster\nNova beats Taskmaster\nGamora beats Zola\nAdam Warlock & Dr. Strange beat Zola\nRed Skull: not yet defeated!\n\nSINISTER MOTIVES (1-4 players)\n\nSpider-man beats Sandman\nSpider-woman & Dr. Strange beat Venom\nCaptain America beats Mysterio\nAnt Man beats Sinister Six\nVenom Goblin: not yet defeated!\n\nMy number one game of all time",
    "timestamp": 1761692400
  },
  {
    "username": "el_crosso",
    "rating": 10.0,
    "comment": "This game is a blast! As a long time Marvel fan this is maybe the ultimate experience. The Alter-Ego implementation is solid, most heroes do really feel like their comic counterpart. I do need to try out the scenario packs, because I do think I prefer to have a little more linear story line in my adventures",
    "timestamp": 1761084000
  },
  {
    "username": "jondodd82",
    "rating": 10.0,
    "comment": "Hands down my favorite solo game.\n\nIncludes:\nMarvel Champions: The Card Game – The Green Goblin Scenario Pack\nMarvel Champions: The Card Game – The Rise of Red Skull\nMarvel Champions: The Card Game – The Once and Future Kang Scenario Pack\nMarvel Champions: The Card Game – The Galaxy's Most Wanted\nMarvel Champions: The Card Game – The Mad Titan's Shadow\nMarvel Champions: The Card Game – The Hood Scenario Pack\nMarvel Champions: The Card Game – Sinister Motives\nMarvel Champions: The Card Game – Mutant Genesis\nMarvel Champions: The Card Game – MojoMania Scenario Pack\nMarvel Champions: The Card Game – NeXt Evolution\nMarvel Champions: The Card Game – Age of Apocalypse\nMarvel Champions: The Card Game – Agents of S.H.I.E.L.D.\nMarvel Champions: The Card Game – Trickster Takeover Scenario Pack\nMarvel Champions: The Card Game – Civil War Expansion\nMarvel Champions: The Card Game – Synthezoid Smackdown Scenario Pack\nPlus a bunch of heroes!",
    "timestamp": 1760824800
  },
  {
    "username": "Jayzus",
    "rating": 10.0,
    "comment": "Amazing game. Tons of content with expansions which can get pricey, but worth it so far for me. Quick and easy to play a round as true solo which is my preference, making it perfect with my 2 kids under 4 demanding my attention a lot. So much variation, unique heroes and villains, and customization with your deck or villain modulars. I don't see myself selling this at any point, I have almost all content from Xmen and earlier, and plan to continue collecting when I am able.",
    "timestamp": 1760738400
  },
  {
    "username": "manx1",
    "rating": 10.0,
    "comment": "In many ways you could argue this is the best LCG of all time. I enjoy LCGs as an accessible and convenient alternative to TCGs.",
    "timestamp": 1760565600
  },
  {
    "username": "Applefiend",
    "rating": 9.5,
    "comment": "Fantastic game. Really enjoy the card play. My most played game of all time, love playing it solo or multiplayer.",
    "timestamp": 1760565600
  },
  {
    "username": "Chris Coyote",
    "rating": 10.0,
    "comment": "Laurin's\n\n___\n\n04/24 we got this on lend from spiele-offensive.de by surprise - and it could easily be the first game on lend we purchased afterwards (and purchased lots and lots of expansions, too...)\n\n05/25 after discovering solo for me, this is my most played game",
    "timestamp": 1760306400
  },
  {
    "username": "squallgoku",
    "rating": 10.0,
    "comment": "Rebought 7/5/25\n\n+ Marvel Champions Base Game\n\nWAVE 1\n+ Doctor Strange Hero Pack\n+ Captain America Hero Pack\n+ Thor Hero Pack\n+ Ms Marvel Hero Pack\n+ Black Widow Hero Pack\n+ Hulk Hero Pack\n\nWAVE 2\n+ Ant-Man Hero Pack\n+ Wasp Hero Pack\n+ Quicksilver Hero Pack\n+ Scarlett Witch Hero Pack\n\nWAVE 3\n+ Star-Lord Hero Pack\n+ Gamora Hero Pack\n+ Drax Hero Pack\n+ Venom Hero Pack\n\nWAVE 4\n+ Nebula Hero Pack\n+ WarMachine Hero Pack\n+ Vision Hero Pack\n+ Valkyrie Hero Pack\n\nWAVE 5\n+ SP//dr Hero Pack\n+ Spider-Ham Hero Pack\n+ Nova Hero Pack\n+ IronHeart Hero Pack\n\nWAVE 6\n+ Cyclops Hero Pack\n+ Phoenix Hero Pack\n+ Gambit Hero Pack\n+ Rogue Hero Pack\n+ Storm Hero Pack\n+ Wolverine Hero Pack\n\nWAVE 7\n+ Deadpool Hero Pack\n\nWAVE 8\n+ Magneto Hero Pack\n\nSCENARIO PACKS\n+ Green Goblin Scenario Pack\n+ The Hood Scenario Pack\n+ Mojo Mania Scenario Pack\n\nCAMPAIGN BOX EXPANSIONS\n+ Rise of the Red Skull Expansion\n+ Galaxies Most Wanted Expansion\n+ Mad Titan's Shadow Expansion\n+ Sinister Motives Expansion\n+ Mutant Genesis Expansion\n+ Age of Apocalypse Expansion\n\nSTORAGE\n+ Ultimate Guard Katana Standard Size Card Sleeves (Transparent)\n+ BCW 3200\n\nMy most-played game and my favorite for multiple years in a row, even though it doesn't have miniatures.\nI was pining for my old collection that I sold recklessly after getting disappointed and disillusioned with it, so I rebought it after I discovered some sets are now disappointingly OOP!\nEasily the best way to experience the Marvel Universe!\n\nSome people on the opposite end of the scale find this game to be nothing more than a Maths exercise, but I find an emerging narrative from the card play, reminiscent of those 22-minute Marvel Cartoons like X-Men and Spider-Man from the 90s.\n\nFavorite Heroes to Play As:\nIron Man (gained a new appreciation of the character from MC)\nSpider-Man (lifelong Spidey fan)\nAdam Warlock (my favorite Marvel Character, though not my fave MC *EDIT* With his Wild Tutor Deck, he is easily my favorite Hero to play!)\nDoctor Strange (powerful)\nAnt-Man (Very fun and very thematic)\nGhost-Spider (would love to play her in Coop/Two-Handed)\nCyclops (love Gambit, but just prefer Cyclops playwise)",
    "timestamp": 1760047200
  },
  {
    "username": "El_Chevi",
    "rating": 10.0,
    "comment": "Falta:\nExpansiones:\n- Guerra Civil\n\nEscenarios:\n\n- Synthezoid Smackdown",
    "timestamp": 1759874400
  },
  {
    "username": "Tannerd",
    "rating": 10.0,
    "comment": "An excellent engine. Just too much of it - have stopped collecting as couldn't keep up.",
    "timestamp": 1759788000
  }
]