[
  {
    "username": "KerriCo",
    "rating": 1.0,
    "comment": "While the theme is strong, the mechanics can sometimes feel a bit abstract. For example, the game's action system, which is central to decision-making, doesn’t always feel entirely tied to the zoo-building theme. The cards you play and the resources you manage don’t always evoke the zoo-building theme in an intuitive way. For some, the theme can feel a bit like window dressing compared to the mechanics themselves.",
    "timestamp": 1758924000
  },
  {
    "username": "khepriq",
    "rating": 1.0,
    "comment": "boring & not satisfying game",
    "timestamp": 1755900000
  },
  {
    "username": "shippert",
    "rating": 1.0,
    "comment": "A bad game for bad people",
    "timestamp": 1755381600
  },
  {
    "username": "Scifi66",
    "rating": 1.0,
    "comment": "TLDR->long, fiddly, high-randomness low-interaction fare is the opposite of what I'm looking for in a game. 2p is its best player count.\n+Action selection mechanic copied from Civ a New Dawn\n+End game trigger through intersection of two opposing scoring tracks (Rajas of the Ganges) brings some tension to the late game\n–Main board is too busy, lots of icons\n–Long game (4 hours) given only medium weight.\nxx Card draw luck is a major issue, you draw the right cards for your strategy/projects you are golden, if not then you will have to make lemonade -> if you are a fan of minimal luck Euros this will bother you as it did me although I drew so well in my final two turns I won the game. In Terraforming Mars you can draft as well as develop a card engine through developing projects or laying down tiles on those 1-off bonuses. None of that is available here. There is a card market but it is limited until later in the game and your card draw action is weak until you upgrade or wait until it moves to position 5\n–Animal prison theme\n–Low interaction it is MPS everyone is heads down staring at their zoos, the tile laying in TM has more interaction not to mention the race for awards / milestones and yet TM is often criticised as having too little interaction?\n–Seems to have a runaway leader problem? Get that first bonus and you are well on your way",
    "timestamp": 1753135200
  },
  {
    "username": "jurpque",
    "rating": 1.0,
    "comment": "Estúpido juego de cartas 90% azar, 8% táctica, 2% estrategia.",
    "timestamp": 1751580000
  },
  {
    "username": "Brybimbap",
    "rating": 1.0,
    "comment": "Why shouldn't we support zoos and their \"conservation\" work?\n\nhttps://youtu.be/p3l87NywToQ",
    "timestamp": 1750543200
  },
  {
    "username": "lililililil",
    "rating": 1.0,
    "comment": "Solitaire",
    "timestamp": 1747432800
  },
  {
    "username": "mrouricio",
    "rating": 1.0,
    "comment": "bland euro diarrhea",
    "timestamp": 1746136800
  },
  {
    "username": "Laszlo_Jamf",
    "rating": 1.0,
    "comment": "Lately I've been able to play games at game conventions that I would never think of buying, but since someone already had them and they got such good ratings on bgg I thought I'd give them a try.\nI was invited to a game of Arche Nova, stoically I listened to the 30 minute explanation of the rules and thought to myself hopefully the game won't take that long, it looks complicated and like a solitary multiplayer game, so not my cup of tea at all. After a 3 player and three hours game we were done and after Everdell and Wingspan it was the worst gaming experience I've ever had. Just terrible. But now this game has 13K gamers that have given a 9 or even a 10 rating, about 1K of them.\n\nSo what is it that gets people so excited about these types of games?\n\nThere are simple quick games that are just fun and everyone at the table wants to play another game immediately, but why would you do that to yourself in your free time and play Arche Nova, I don´t get it!\n\nIt's boring, long and free of any emotions or tricky situations that you have to master. Awful, defies game description.",
    "timestamp": 1743202800
  },
  {
    "username": "Der_Rentner",
    "rating": 1.0,
    "comment": "Why shouldn't we support zoos and their conservation work?\n\nhttps://www.youtube.com/watch?v=p3l87NywToQ",
    "timestamp": 1741734000
  },
  {
    "username": "paul4s",
    "rating": 1.0,
    "comment": "In this game, completely wrong values are transmitted! A zoo is not cool and certainly not species protection. People who have no idea might just think that zoos are harmless. Awful!",
    "timestamp": 1741042800
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "Really clunky, you have all these actions that get rotated. Not even for management, it's just to make sure you do all of them evenly. So over half of the game isn't even building the zoo, it's doing paperwork. And then it's easy to run out of money so newbies sit there fiddling with cards and wondering why they can't do anything. OR experts realize they need to get to the next income phase, so they rush that, and everyone else gripes because it ruined their solitaire multi-turn plans.\n\nI kinda like the idea of balancing points with conservation (though in practice it's just to have TWO tracks for VP (it reminds players of Brass, so instant success?!)). But all those damn bonuses on the conservation side just to bribe players into paying ANY attention to it, it really slows things down. Slows it more than usual, I mean. And hoops to jump through for the VP side, like dead cards once you hit 25 VP. It promised a little life, but this is what I mean, everything weighed down by busywork and administration. Even the simple task of building the zoo is slowed down by action-salad, as players activate multiple tiny bonuses and have to choose the right order to do them.\n\nPlayers whine about the EVIL attacks on snakes and such, thouugh really they're complaining because they sat there planning a turn for 10 minutes and now you ruined it. It's really just a self-balancing mechanism, looking at only one of the VP tracks for who to target, so it's way too clunky for me too. But all the \"peaceful\" animals have silly abilities like pocketing cards for VPs, or taking extra cards, and nobody complains about those being anti-thematic?",
    "timestamp": 1740265200
  },
  {
    "username": "Beedun",
    "rating": 1.0,
    "comment": "This has to be the most overrated board game ever created right here..\n\nEvery single game in the top 20 is better than this one.. I've played this a few times now and I honestly can't figure out why people love this trash so much. Seriously? Its boring to play and even worse to look at.\n\nEveryone praises the mechanics to this game. I find that somewhat of a joke - as these mechanics are not new, are not unique to this game, and have been done before.. It lacks anything unique in my opinion.\n\nThe card drafting/role selection - done before many times..\nThe end game point crossing - done before..\nThe art work - boring, bland, and oh sooo meh to look at.\n\nMediocrity at its finest. This game deserves a much lower ranking than it has magically attained. Good riddance to garbage, and the borked ranking system here on BGG....\n\nBummed I can't give it zero stars. How can I block this game from appearing on BGG when I browse this website? That sure would be a nice feature.",
    "timestamp": 1738191600
  },
  {
    "username": "mikemcdasl",
    "rating": 1.0,
    "comment": "If you’ve ever dreamed of creating your own zoo while suffering through a four-hour slog of decision paralysis, Ark Nova is your dream and your nightmare come true. Don’t let the lush box art fool you—this is less about building a zoo and more about turning your game night into an existential crisis.\n\nLet’s start with the theme: You’re running a zoo, but not just any zoo. No, this is a hyper-complex bureaucracy simulator disguised as a board game. Want to bring in a lion? Great! But first, navigate the world’s most convoluted action-selection system, wrestle with an unintuitive card market, and somehow not fall asleep while your friend takes 20 minutes to figure out whether they want to donate to conservation or build a kiosk. (Spoiler: It’s always the kiosk.)\n\nSpeaking of conservation, Ark Nova is obsessed with reminding you that zoos aren’t just about cute animals—they’re also about saving the planet. That would be fine if it didn’t feel like a tacked-on guilt trip every time you try to build an enclosure for penguins instead of adopting some obscure tree frog. And let’s not forget the “exciting” gameplay loop of desperately hoping the one card you need isn’t buried at the bottom of the draw pile. Thrilling.\n\nOh, and the player board? A chaotic mess. It’s a patchwork quilt of icons, tracks, and tokens that looks like it was designed by someone who hates clarity. You’ll spend half the game squinting at your board, wondering where your worker went and why you even decided to play this monstrosity in the first place.\n\nBut the real kicker? The game’s length. By hour three, you’ll be begging for a meteor to hit your zoo just so you can finally stop playing. Meanwhile, the “winning” player will smugly explain how they scored 50 points off a lemur card you didn't even know existed.\n\nSo, if you love games that take forever, make you question your friendships, and leave you more stressed than entertained, Ark Nova is the game for you. Everyone else? Stick to Ticket to Ride and call it a day.",
    "timestamp": 1737154800
  },
  {
    "username": "nevercalled",
    "rating": 1.0,
    "comment": "Lucky based family game but too heavy for that aim. Extremely unbalanced most possibly without proper testing ( maybe even none). Even things extremely easy to balance were not touched in this game.",
    "timestamp": 1729980000
  },
  {
    "username": "Dimetrio",
    "rating": 1.0,
    "comment": "No Russian language",
    "timestamp": 1729548000
  },
  {
    "username": "T1_Faker",
    "rating": 1.0,
    "comment": "bad game",
    "timestamp": 1729375200
  },
  {
    "username": "Stingrayy",
    "rating": 1.0,
    "comment": "Weird game. When did Zoos become cool again?\nPlayed it, won it, don’t understand the fuzz. Almost like playing like solo, optimizing without much tactics or strategies.",
    "timestamp": 1725919200
  },
  {
    "username": "sykano",
    "rating": 1.0,
    "comment": "modern zoo building game\noverrated and overhyped\ndoes nothing for me neither the 'River of Cards' action selection, nor the counter-rotating tracks nor the zoo theme\nhas serious issues with multiplayer solitaire play, random card draw and other design mistakes\n\ntakes a lot of ideas from \"Terraforming Mars\" (big stack of singleton cards, tags, triggered effects, placing terrain tiles on hex grid, placement bonuses, ...) and several other games (counter-rotating tracks and race to unlock better capacity for actions from \"Rajas of the Ganges\", action selection cards from \"Civilization: A New Dawn\", upgrades remotely similar to \"Great Western Trail\", ...)\nand a popular animal theme like \"Wingspan\" to catch popularity :/\n\nI don't like the ugly main board. It's also a very cumbersome format and size. And why is there a second board? Why is that stuff not on the main board?\nAnd having every player puzzle their own zoo instead of having interaction on a common board is clearly inferior to what TFM does. (Sure, it fits the theme better here.)\nAlso, it's very sad that it omits the card drafting of TFM, because that would have been so much better and would help a bit with balancing out the luck of the draw. The additional scoring cards are also harmful for the card flow, they should have been integrated differently, not through the main card deck.\nAlso, the discarding cards to hand limit every time the break track is full is miserable and feels arbitrary. And I'm actually not sure if it's really necessary for balancing. I really doubt it.\nThe whole round mechanic with break track and player triggered break values seems inelegant and awkward.\n\n+ some mechanics (most of them copied from other games)\n+ different and asymmetric maps, replayability with the deck of singleton cards\n0 zoo theme, also not that thematic\n- some design mistakes (!)\n- very luck-dependent (getting good cards) (!)\n- not much player interaction, multiplayer solitaire (!)\n- balancing issues (secret goals, ...)\n- takes long\n- takes a lot of table space\n- complex teach\n- looks, especially the main board and the tiles, thin player boards\n- the round mechanic with the break track and discarding to hand limit\n- most abilities of the animals don't fit the theme\n- heavily card-based (sleeves necessary)\n- expensive\n- exotic box format, oversized box\n\nI'm not so high on the zoo theme. It's ok but not great. I also don't think the game is particularly thematic (e.g. weird animal abilities).\nThe 'river of cards' action selection mechanic is ok, but not great.\nThe game on the whole is good, but not great.\n\nI find it irritating that some animals are sponsor cards and not animal cards. The thing with the special tiles could have been done better.\n\nThe Take-That effects are too hefty, especially stealing cards from other players. (Yes, you can play the variant rules without the Take-That effects or remove the cards from the deck.) The Take-That effects don't fit into the game, feel very artificially attached. The game probably wants positive interaction instead of the negative interaction of Take-That effects.\n\n\nDespite the German designer there are a lot of odd German terms in the game ('Rufreichweite', 'Pausenleiste', 'Zuschnappen', ...) that sound like bad translations.",
    "timestamp": 1723932000
  },
  {
    "username": "klebinaldo",
    "rating": 1.0,
    "comment": "Uma tortura. Quando joguei torci para que partida acabasse logo.\nE o tema não ajuda. Pra mim já chegou tantos jogos com tema ambiental.",
    "timestamp": 1723154400
  },
  {
    "username": "ja141",
    "rating": 1.0,
    "comment": "How to make Zoo Tycoon not fun. Nothing like scoring negative points!!!",
    "timestamp": 1707606000
  },
  {
    "username": "Odebu",
    "rating": 1.0,
    "comment": "Más de lo mismo, muy aburrido y sin ninguna interacción. Un juego del montón para el nicho del culto a lo nuevo.",
    "timestamp": 1700521200
  },
  {
    "username": "HexAddict",
    "rating": 1.0,
    "comment": "Played this twice so far. I am due to play this at least once more.\n\nBear cards in this game are an indicator species. There are 9 bear animals in the game. One is the koala (funny). 3 are raccoons, coati, and the red panda. 5 are real bears. Of the eight extant bear species in real life, 3 were ignored because of game mechanic reasons. The black bear couldn’t possibly boost association and a spectacled or andean bear couldn’t possible b required to be next to rocks and give you an X token. Bears don’t work that way. Only procyonidae can do that!\n\nWith the 200+ zoo deck, this game really relies on luck to get anything to synergise and without any familiarity with the deck, you’re really just hoping for the best. The take that mechanics of venomous animals is also mean and has nothing to do with running a zoo. It’s also kind of long at 3 or 4 players and offers very little. I’m completely baffled how this got to number 4 and the current ranking makes me hate it even more.",
    "timestamp": 1698012000
  },
  {
    "username": "Rihusu",
    "rating": 1.0,
    "comment": "No comprar jamás",
    "timestamp": 1690754400
  },
  {
    "username": "gameyspirits",
    "rating": 1.0,
    "comment": "Terrible. Multiplayer freecell at its worst.",
    "timestamp": 1684792800
  },
  {
    "username": "beardandglasses",
    "rating": 1.0,
    "comment": "Terrible game.",
    "timestamp": 1681423200
  },
  {
    "username": "Mobbygra",
    "rating": 1.0,
    "comment": "overrated and overhyped",
    "timestamp": 1680818400
  },
  {
    "username": "flatulance_a_lot",
    "rating": 1.0,
    "comment": "POS game. Might as well play solitaire.",
    "timestamp": 1680645600
  },
  {
    "username": "enocgzz",
    "rating": 1.0,
    "comment": "It's a very looong game.",
    "timestamp": 1680472800
  },
  {
    "username": "sayden",
    "rating": 1.0,
    "comment": "Zoos should not be celebrated. Leave animals free.",
    "timestamp": 1680472800
  },
  {
    "username": "Epidemius",
    "rating": 1.0,
    "comment": "Multiplayer solitaire is not fun",
    "timestamp": 1678402800
  },
  {
    "username": "iuribuscacio",
    "rating": 1.0,
    "comment": "I want to make it clear that my grade 1. is not for the game itself, but specifically for the various, serious and unacceptable problems such as the launch of Ark Nova in Brazil, and the terrible work of the publisher Grok Games.",
    "timestamp": 1678230000
  },
  {
    "username": "Treelady",
    "rating": 1.0,
    "comment": "Horriblely complicated. Inpossible to \"get going\". Needing to stop to look things up several times a turn makes it impossible to enjoy. I really wanted to like this game, but I just can't.",
    "timestamp": 1677452400
  },
  {
    "username": "Black Saint",
    "rating": 1.0,
    "comment": "Ghastly overcomplicated mish mash of a game with no player interaction. Just nothing fun about this experience at all.",
    "timestamp": 1676934000
  },
  {
    "username": "Devrob",
    "rating": 1.0,
    "comment": "Needlessly convoluted. Could have been better if they didnt force every single idea they came up with into the game. Not family friendly. Will spend the entire first day trying to learn the game so don't expect to play right away.",
    "timestamp": 1672095600
  },
  {
    "username": "Kochamy_zwierz",
    "rating": 1.0,
    "comment": "There is No capybara in game",
    "timestamp": 1666389600
  },
  {
    "username": "gimodude",
    "rating": 1.0,
    "comment": "Inventory - Preordered Amazon",
    "timestamp": 1663020000
  },
  {
    "username": "KaSaKakaDemola",
    "rating": 1.0,
    "comment": "Losowy gniot, ze sztucznie podniesionym rankingiem. ?",
    "timestamp": 1662847200
  },
  {
    "username": "mxke",
    "rating": 1.0,
    "comment": "The ABSOLUTE WORST HOT GARBAGE in boardgaming, ever!\n\nAVOID\nAT\nALL\nCOSTS\n\nQs:\n1) Why does the reputation track exist?\n2) Shouldn't access to it be standard and not restricted accept through action upgradeS(many)?\n\nThis broken mechanism ruins the game and the point of the reputation track. Even worse, it turns the reputation track into an insult for the players; \"You see that card? You ain't never gonna get it!! Why, ya know, lack of development.\" No, snapping does nothing to fix, justify, or explain these errors of undevelopment.\n\nLiterally, factually, the game is not yet fully developed and should have never been produced in it's current iteration.",
    "timestamp": 1656540000
  },
  {
    "username": "DeadFrog",
    "rating": 1.0,
    "comment": "I have rated 924 items with an average rating of about 8, with only 7 items receiving a 1. This is one of them.\n\nThe game is a pure luck of the draw card game that tries very, very, very hard to disguise that fact. I am genuinely, deeply, and utterly baffled why it is rated so highly.\n\nYou may end up completely unable to do anything of significance, or can get good combos, only to lose to a player that simply drew into better ones. Players that draw cards that are strong early or late, at the proper time, get ahead while others just languish. The hand size is laughably small, making it nearly impossible to set up a big combo play for a subsequent round. There is no realistic opportunity to pivot your strategy on a round by round basis, or to take a gamble on a strategy with a plan B, or to set up something for later with options to go in another direction. There's no common mechanism for doing something with cards in your hand that you no longer want to build, to spend towards something else. How did somebody make this game in a world after the creation of Terraforming Mars, with a straight face? Or Race for the Galaxy, for that matter? I don't even particularly love those games.\n\nAlso, it has the very WORST money tokens I have ever seen in a game. The cherry on top is the horrifically designed board/play area/component layout that takes up way more room than it has any right to. Good luck fiddling with the cards on the board without knocking over the terrible, skinny pawns that keep track of everything.\n\nDon't waste your time with this garbage.",
    "timestamp": 1656280800
  },
  {
    "username": "Loten",
    "rating": 1.0,
    "comment": "Absolutely a slog to play. Not a fun experience.",
    "timestamp": 1653948000
  },
  {
    "username": "nightwishpower",
    "rating": 1.0,
    "comment": "overrated",
    "timestamp": 1652738400
  },
  {
    "username": "pablo_espada",
    "rating": 1.0,
    "comment": "Dejad a los animales tranquilos. Los animales no son una propiedad.",
    "timestamp": 1651442400
  },
  {
    "username": "Crouch_",
    "rating": 1.0,
    "comment": "too bland.",
    "timestamp": 1647558000
  },
  {
    "username": "uarabilemothobe",
    "rating": 1.0,
    "comment": "i love",
    "timestamp": 1645570800
  },
  {
    "username": "cidadao",
    "rating": 1.0,
    "comment": "The game looks good and the fact the gameplay resembles Terraforming Mars is a good thing IMO but how come it's 2022 and the idea of creating a Zoo is still considered \"cool\"? What's next? Designing a modern \"SeaWorld\"?",
    "timestamp": 1642287600
  },
  {
    "username": "christhomas226",
    "rating": 1.0,
    "comment": "Low interaction plus terrible theme. Zoos are something that should be abolished, not celebrated.",
    "timestamp": 1641250800
  },
  {
    "username": "realjw",
    "rating": 2.0,
    "comment": "Overhyped.\n\nSame problem with games like Everdell or Viticulture. You're gated by what cards you have access to throughout the game. Plus you got some bullshit cards like the elephant card that gives you a RANDOM end game scoring, so you can pull a game changing lucky draw (which is what happened). Seriously, for a game thats ~3 hours that is ridiculous.\n\nMinimal interaction, 5066th re-iteration of the same thing, nature themed Euro slop. God knows this is popular.",
    "timestamp": 1760824800
  },
  {
    "username": "RaySwan",
    "rating": 2.0,
    "comment": "This game was initially fun. Several Major Problems for me. Primarily, the game plays you. Let me explain.\n\nAll players start with the same objectives for points . You are basically all hoping that at the appropriate times the best cards appear in the card row for you, as opposed to on an opponents turn for them.\n\nBasically that's it. Everyone is pursuing the same objectives, so everyone basically wants the same cards. if you randomly draw good cards or if they show up on the card row for you at the right time, You win.\n\nVery solitary. When I win, I don't feel like I outplayed my opponents just got lucky. When I lose i don't feel like they outplayed me, they just got lucky.\n\nIt's been compared to Terraforming Mars, functionally TM is better in every way. Terraforming Mars allows you to pursue different objectives to win. Has a tactical board element, More ability to engage other opponents etc.\n\nComments made after about 20 games.",
    "timestamp": 1759010400
  },
  {
    "username": "ppsacco",
    "rating": 2.0,
    "comment": "Euro euro euro...not for me...",
    "timestamp": 1757455200
  },
  {
    "username": "wpolka",
    "rating": 2.0,
    "comment": "The action selection mechanism is great but the the luck of the draw is far too much for a game of this length. I don't need to play this one again",
    "timestamp": 1756159200
  },
  {
    "username": "Forgeforgeforge",
    "rating": 2.1,
    "comment": "Literally everything I hate about modern games. It was as interesting as anything was to learn it once, but every time I play it again I hate it more.\n\nNo player interaction. Might as well paint your house.\n\nTo actually engage with this game competitively, you have to ask everyone to pass you every single card several times to read them. The theme is utterly pasted on, moreso than any game I've played in my entire life. What card does what has zero correlation, you infer zero information, everything must be read and reread and cross referenced with an appendix.\n\nAs a competitive game you can complain about the randomness of the cards. If I would play this more I would add one draw and one discard to every level of the card action, or widen the card market to 2 cards wide like pax. or I might go as far as to divide the deck by player count and let each player study what's in their private draw deck before shuffling it so they know roughly what's in the chute.\n\nFirst player generally gets an extra turn and there's nothing in the game mechanics where going first isn't just better\n\nThe actual zoo building is a secondary activity to maximizing your action efficiency around the Association action, where most of your points will come from. The game is padded out by an absurd number of tracks. There's the primary two VP tracks, but also reputation, unlocking associates, universities and partnership zoos are also essentially tracks. Tracks are a sponge for actions that drive every euro game into a mushy oblivion.\n\nNothing here. If you want to play a long two player game with your wife with all the bite of doing a jigsaw puzzle then this might be the game for you.\n\nTom vasel should be thrown into a volcano for popularizing this nonsense",
    "timestamp": 1755640800
  },
  {
    "username": "mitmit117",
    "rating": 2.0,
    "comment": "For me, It as no new mecanics. everything was present in different games, and I don't understand why people think it is a good game. I prefer Civilization that as similar gameplay for exemple.",
    "timestamp": 1754949600
  },
  {
    "username": "petan65",
    "rating": 2.0,
    "comment": "I don’t understand that hype...I am not fun of Solitaire games. There is lack of interaction between players. I'm bothered by some of the mechanics that go against each other -> the draw deck is big, so there's a good chance that you'll just wait for some cards and despite that the game punishes you for holding more cards.",
    "timestamp": 1750975200
  },
  {
    "username": "Kilgannon",
    "rating": 2.0,
    "comment": "The randomness of the cards bothers me. And I dont think it earns its length, it feels about an hour too long.",
    "timestamp": 1746568800
  },
  {
    "username": "saar",
    "rating": 2.0,
    "comment": "Needlessly complex, long, utterly luck driven, multiplayer solitaire. Very underwhelming ending. My group likes it, but it sucks the joy of life out of me. For me it is the board game equivalent of a dementor.",
    "timestamp": 1745186400
  },
  {
    "username": "HealthyGamingNetwork",
    "rating": 2.0,
    "comment": "Needs some heavy erratas to make it good. Too many dead end paths. Currently #7 of all time?! Hell no. Definition of hype train.\n\nUpdate: At the urging of a friend I tried this one again. Add swingy to the list of things I dislike (player drew a card out of that GIGANTIC stack that just happened to catapult them from last to first). No player interaction, horrible artwork, and it still bugs me that they stole the core mechanism from Civilization. Done with this one.",
    "timestamp": 1740351600
  },
  {
    "username": "mike_inprinciple",
    "rating": 2.0,
    "comment": "This should be a game I enjoy. It has my favourite mechanics, it's pretty, it should be highly replayable.\n\nBUT, I think this game is broken. I've played two interminable playthroughs of this game, because I wanted to give it a second shot after the first. The first playthrough was interestingly instructive as well. I'll cut to the chase and home in to what the problem with the game is.\n\nThe game has a massive deck of cards. It's so tall when laid out that you cannot see anything around it, when sitting at a table. It obscures the scores that players are at (very closely to where they tend to be for the end game to trigger, by the way), and for some of us it even obscured this first visible draftable card. Shuffling this deck requires you to book a holiday. You cannot physically shuffle it in one go unless you're Shaquille O'Neal. If you have human hands, you will have to shuffle it in multiple stretches, one bit at a time.\n\nFor our first playthrough I didn't shuffle it very well, so we ended up having lots of synergetic cards close to one another, which generated these action chains when played. This is fundamentally where the engine building fun is supposed to live in this game. I was able to get these long chains of synergetic events every time I would play a new animal in my stack because of the bad shuffling. This made these events dull for all other players. It become dull for me! This fox activates my other fox, which allows me to get a card, then thanks to this sponsor I get 3 points. This other animal allows me to immediately play another animal, etc etc...\n\nSo, thinking I played it wrong I shuffled everything properly and tried again another day. Now the opposite problem presented itself. We were all constantly getting cards that didn't work with where we wanted our playthrough to go. So we had very few chains occurring. We were constantly trying to flush the cards we had to hope for new ones. The cards in the open market barely refresh anyway, so that made for a really dull playthrough. It figures, really, with cards so different form one another, in type, icons, and effects, it's no surprise this happens. The design simply doesn't manage probability and adds replayability through adding more cards in the mix. The deck makes the game unplayable for me.\n\nLast thing I want to mention is the distinct absence of interactions in the game. Pretty much the only interaction is racing for card drafting in the open market or racing to complete missions before others.\n\nI'm clearly missing whatever others are seeing in this game, but more power to whomever gets my used, like new copy.",
    "timestamp": 1739919600
  },
  {
    "username": "Lesko",
    "rating": 2.0,
    "comment": "Best newro is the game that can steal best.\nThis is a charcuterie of solitude inducing mechanisms.",
    "timestamp": 1737759600
  },
  {
    "username": "Don_Pion",
    "rating": 2.0,
    "comment": "It has waaay too many cards and text and symbols and pieces, yeah, too much of everything. I do not like to put effort in reading card after card after card or decyphering symbols all the time, i want to focus on a strategy. Even if i pass this hurdle, the next issue is as bad. Suppose i know all the cards and i can build upon my strategy, i have to pray i get the cards that i want so i depend on luck of the draw in a 3h strategy game? Yeah, i'll pass, there are better games to play, cmon guys, aren't we suppose to evolve in game design? I have so many older games who are way better than this 'newbie'. The key in creating good games is trimming them down to their essence and culling stuff that doesn't add to the experience.\n\nArk nova isn't the only game flooding your hand with a enormous deck of different cards, but i had the worst experience with this one.\n\nAlso this is pure muliplayer solitaire, i don't gave a beep about my opponents game, i play my game and that's it.\n\nThe art is meh.",
    "timestamp": 1737586800
  },
  {
    "username": "Lord Leuber",
    "rating": 2.0,
    "comment": "I know, I know, everyone likes this except the few ones trolling with low grades. Well ok, but I did play it and had one of the most miserable gaming nights ever (and I even think I won, not sure anymore). The multiplayer solitaire complaint has been abundantly leveled at this game, but that is really how I felt. If I would try to open mind approach it - I guess I can imagine there is a way to play this where “what others do matters more”. So if I try to make it my problem, the issue is that when 3 other players start piling up dozens of cards filled with symbols and upside down small text, I am just not inclined to keep track of all that all the time and just make decisions solely based on what I have in front of myself - which is already plenty to keep track of. Maybe after a dozen plays or so that play pattern changes and I get to see the player interaction that so many claim. Sure, but that assumes I am prepared to sit through those sessions of pure misery to hopefully get to a good game. When I played Stone Age for the first time, it was already doable to keep track of opponents options and likely moves, and that game is not yet boring dozens of sessions later.\nWhy do I care - well, I do have concern with the design trend in board games that Ark Nova is an example of, which I think we can agree on whether you like it or not.",
    "timestamp": 1735686000
  },
  {
    "username": "jacob_haller_roby",
    "rating": 2.0,
    "comment": "Ark Nova does not live up to the hype.\n\nIt disguises a very flat and uninspired game with layers upon layers of fluff. So many tracks and resources to manage, but none of them are meaningfully distinct.\n\nA more streamlined (and better) implementation is That's So Clever, which itself is just a better version of Yahtzee. And that's the level of skill/interaction you should expect here, but with piles of unnecessary sludge layered on top to convince you there's something more. There isn't.\n\nThe game also fails on some really basic levels. Despite the glut of iconography, the game still manages to not provide icons for some of the most important elements, e.g. Card Types. You just need to learn which card types have which kind of information to tell them apart, instead of the card simply having a suit symbol. When a simple deck of traditional playing cards has features that your big budget board game is lacking, something has gone wrong.",
    "timestamp": 1735340400
  },
  {
    "username": "Vimpelman",
    "rating": 2.0,
    "comment": "Would rather play Terraforming Mars, and I hate that one as well.",
    "timestamp": 1735081200
  },
  {
    "username": "ggruetze",
    "rating": 2.0,
    "comment": "Suffers from card glut. Game is too long for negative end game scoring to be acceptable\nI dislike it more each time I play. Will not play again.",
    "timestamp": 1731452400
  },
  {
    "username": "Persereus",
    "rating": 2.0,
    "comment": "Strategy here works more like a puzzle building game.\n\nAlso not a lot of interaction",
    "timestamp": 1730674800
  },
  {
    "username": "Oninohugo",
    "rating": 2.0,
    "comment": "Huge footprint of ripped off bloat, waiting to do the single blatant thing that matters for endless hours and hoping to be snowballed by lucky draws of matching cards to take obviously better benefits.",
    "timestamp": 1729634400
  },
  {
    "username": "maazabdullah",
    "rating": 2.0,
    "comment": "art is bad. mechanics are weird. takes too long. cards are random.",
    "timestamp": 1728252000
  },
  {
    "username": "Nicocolithophoride",
    "rating": 2.0,
    "comment": "At first very good and challenging. But in the end not convinced at all. Purely mechanical and no contrôl of the opponent strategy who could just destroy you by having randomly got the good cards and not you. No fun in that. An expansion with board allowing much more interractions would be appreciated. In the meantime I played enough this game",
    "timestamp": 1720562400
  },
  {
    "username": "smurfodeth",
    "rating": 2.0,
    "comment": "Uninspired mix-tape of a game, with poorly written rules and way too many cards.",
    "timestamp": 1718920800
  },
  {
    "username": "The_Red_Meeple",
    "rating": 2.0,
    "comment": "Pro: Beautiful and good challenge.\nCon: very complex and long for a minimum conflict game.",
    "timestamp": 1705273200
  },
  {
    "username": "EndTheRun",
    "rating": 2.0,
    "comment": "So bloated and uninteractive. I sleep.",
    "timestamp": 1703631600
  },
  {
    "username": "Physicsphreak",
    "rating": 2.0,
    "comment": "Wow. Just wow. I like a heavy game and I don't have an issue with complicated rules. One of my favorite games is Weather Machine for example. This game is needlessly complex, the rules are very challenging to learn and the rulebook(s) are organized with a logic that I can only describe as alien.\n\nThe game can't seem to figure out what it wants players to do. It has a variety of opposing motivations, which isn't in and of itself bad except it doesn't seem interested in rewarding you properly. The game makes releasing animals an important late game activity, but the punishments far outweigh the benefits, which begs the question, what's the point? This carries through most of the activities of the game; what's the point? Why build kiosks if you're going to empty your enclosures? Why build multiple sponsors when only one or two will ever be useful? Is it possible the cards are *too* diverse?\n\nAll in all, I don't know who this game is for. Certainly not intense eurogamers, there's interaction and far too little control. Not engine builders, you're lucky to find two or three cards to work together. Certainly not families or people trying to break into the hobby.\n\nI do like the action selection, but it's not original by any means, and the level two actions again don't feel worthwhile nor are the various limitations on action levels intuitive or easy to see or remember leading to numerous errors.\n\nAll in all this is an absolute disaster, too much going on, nothing gels or harmonizes. The game needed playtesting, needed editing, needed to be crafted into an experience. Sadly disappointing for such a well regarded game.",
    "timestamp": 1696629600
  },
  {
    "username": "koflo1",
    "rating": 2.0,
    "comment": "1-4 (2)",
    "timestamp": 1695938400
  },
  {
    "username": "grep_F",
    "rating": 2.0,
    "comment": "You perform actions for hours which are basically determined by cards without any interaction. Horrible experience, although I won the game (against a guy who plays it a lot).",
    "timestamp": 1690063200
  },
  {
    "username": "Slimhunk",
    "rating": 2.0,
    "comment": "Solitaire in a group, i hated being stuck in the one game i have ever played.",
    "timestamp": 1687989600
  },
  {
    "username": "highmarket",
    "rating": 2.0,
    "comment": "Absolutely not game for me. I do love all kinds of complex and heavy card games like Netrunner, Lord of the Rings LCG, Dune Imperium and newly Pagan but not this one.\n\nMy criticisms are:\n- Way too long for the depth of game, esp. w/ 3p.\n- Randomness is too high, no strategic decision but tactical between bad and worse options, very frustating for me. I feel like I'm being played.\n- Overly complex esp. for the limited decisions you can make.\n- Absolut no tensions during play. Neither with the other player(s) nor during early. mid or end game.\n\nConclusion\nMy first thought was that the depth of Ark Nova is comparable to Twice as clever (which I like) as you need to get the bonuses to win the game but with 2-3x levels of unnecessarily complexity; without more interesting decision options or less randomess than the dices in Twice as clever at game length at least twice as long.\nI am quite surprised how Ark Nova is well received and climbing the BBG ranks and that is okay for me but please let me out.",
    "timestamp": 1687816800
  },
  {
    "username": "Nijoth",
    "rating": 2.0,
    "comment": "Not a game for me. Multiplayer solitare, loads of downtime, combos, cards, engine building all spells boring to me",
    "timestamp": 1685829600
  },
  {
    "username": "Professorn",
    "rating": 2.0,
    "comment": "Terrible Theme. (zoos)\nStill the theme is what gives this the high grades with cute animals and everything.\nSince game play is mostly solitaire and luck based.\nTyphical family game when it comes to depth though it´s too long to really be a family game.\nAs a family member I would rather play Wingspan\nAs a Geek I would much prefere to play Terraforming Mars.\nCasual Rating 8\nGeek Rating 2",
    "timestamp": 1680300000
  },
  {
    "username": "angelonnog",
    "rating": 2.0,
    "comment": "I found the randomness in this game to be above average for Euros, although some players argue that it's a tactical aspect of the game. I tend to dislike games where the luck factor is higher.",
    "timestamp": 1678230000
  },
  {
    "username": "Nvasilva",
    "rating": 2.0,
    "comment": "The brazilian version produced by Grok is the worst production of all times, lots of mistakes on it and zero support from Grok, too bad for the game. (Next time, choose better partners, Grok should be closed).\nThe game is ok but takes too much time and I didnt liked it at all, specially the Brazilian version...",
    "timestamp": 1677884400
  },
  {
    "username": "tequila_j",
    "rating": 2.0,
    "comment": "Not my type of game: Cards are too random.",
    "timestamp": 1677366000
  },
  {
    "username": "Danzo",
    "rating": 2.0,
    "comment": "Heavy, minimal-interaction optimisation exercise based around track advancement, tableau building, and finicky tile-laying on individual player boards, pretty much a perfect storm of stuff I dislike in games. The zoo theme drew me to the game, but it's just pictures on cards and quickly falls into the background of the tedious mechanics.",
    "timestamp": 1677020400
  },
  {
    "username": "nagysuti86",
    "rating": 2.0,
    "comment": "Looks slightly better than on the pictures, but trribly bland gameplay and components. Play time was too long for what it offers and it just felt tedious to play it. Card luck seemed like a factor in the game but for the life of me I can't see the point of the 2 scoring system it uses, it just adds unnecessary complexity.\nI was really currious seeing all the hype around it, but it was a sore dissapointment.",
    "timestamp": 1675724400
  },
  {
    "username": "Lunasomnia",
    "rating": 2.0,
    "comment": "I usually don`t like to review games, but this one was such a disappointment for me that i had to write this review.\n\nReally ugly game design, too big for a standard table and seriuosly boring theme and long gameplay. Most of my friends have left it in their collection because it`s the only game their wives would consider playing - mainly because there is none to minor interaction. Which says enough. Too much undeserved hype around this game.",
    "timestamp": 1674255600
  },
  {
    "username": "Toy Marine",
    "rating": 2.0,
    "comment": "If I stuck stock animal pictures on Race for the Galaxy cards, could we play that instead?\n\nThis game is awful.",
    "timestamp": 1670799600
  },
  {
    "username": "NormandyWept",
    "rating": 2.0,
    "comment": "The bright and colourful artwork of some spectacular animals can't save this mess: the actual gameplay is disappointing on many levels, not only in the way in which it perpetuates current unsatisfying trends in game design, but also in some key flaws that it possesses even when judged by the standards of the current zeitgeist.\n\nAs is the current style, there are a multitude of actions and interlocking systems to explain, all with their own myriad details and little foibles. Much of these add very little to the actual decision space and, like with many recent releases, the result feels unfocused and sprawling, a mess of different systems without a clear, compelling core around which development could have focused on removing all of the surrounding noise. Like many recent games, too much happens on the individual boards in front of each player and the interaction is mostly made of a few races and some ill-fitting take-that effects on some of the cards. There is precious little compelling interaction with the other players.\n\nThe game design is reliant on the deck of cards, but here vital lessons have not been learned from Race for the Galaxy. Every card is as specific and as limited as Race's most situational card, Alien Tech Institute, except that here it's all of the cards, all of the time. I suspect that Ark Nova's deck needed to only have 4 continents and 4 types of animals. It definitely needed more generally applicable cards, and more cards with cross-over potential.\n\nWe probably shouldn't have individual card tableaux, individual player boards with jigsaw puzzle placement on a hex grid, the action-rotation-and-upgrading borrowed from Civilization: A New Dawn, a little worker placement board, a set of communal shared objectives, hidden objectives in player hands, AND a bunch of tracks to advance along, all competing for our attention in a single game. The one or two compelling pieces of this needed to identified, and then everything else ruthlessly removed. With all of that still present and combined with a badly-thought-out huge deck of cards, there's precious little here worth the considerable time investment.",
    "timestamp": 1670540400
  },
  {
    "username": "enomix_stona",
    "rating": 2.0,
    "comment": "too hard, too many things to learn",
    "timestamp": 1667343600
  },
  {
    "username": "penguinbirdies",
    "rating": 2.0,
    "comment": "Talk about hype.\n\nThis game SUCKS!\n\nOverstays its welcome by over 2 hours. The upgrade mechanics feel extremely forced to make you not be able to do anything so that the game can be prolonged.\n\nIf you want to sit next to your friends but not talk to them, then just have everyone pull out their phones and browse social media. They might make a comment on each others' posts every now and then but that is a very similar experience.\n\nTheme is HORRIBLE! Why are you doing anything in this game? It is solitaire masturbation. Redundant? Yes, this game is unnecessary.\n\nDoes this make me want to go into animal conservation? NO! It makes me want to punch a llama in the neck.\n\nAbsolute trash! DON'T BUY INTO THE HYPE!!! If someone invites you to play this game, just bring an electronic device and play solitaire, your game group won't even realize you weren't playing.\n\nThe responses to the negative reviews are also astounding. The mob instantly labels one a troll if you don't like the game and will attack viciously like a bunch of political supporters. Way to represent the board gaming community!\n\nAlso, nothing fits if you sleeve cards. POS insert. At least it wasn't another POS gametrayz insert.\n\nI can't believe this game is at #4. Ridiculous!!!",
    "timestamp": 1664575200
  },
  {
    "username": "InvaderFelix",
    "rating": 2.0,
    "comment": "Disclaimer: I know this is a perfectly fine game with positive elements. This was just my first experience.\n\nThe commonly agreed upon Achilles' heel of this game is that you can occasionally be caught by the whims of the deck, which absolutely limits your play options.\n\nI've been trapped in absolute card draw hostage hell on rounds 4-7. I'm talking about drawing six cards back to back, spending all my X's, and drawing up absolutely nothing to play to the board.\n\nI know this was an unlucky random effect on a first time player... but I can't give a game a positive score knowing that I don't have the option to mitigate that kind of bad luck with a generic mulligan effect. Miserable first impression.",
    "timestamp": 1663279200
  },
  {
    "username": "Baelnorn",
    "rating": 2.0,
    "comment": "Average game with below average scoring mechanism. Won’t play again and can’t get my wife to play either.\n\nWill look to sell…",
    "timestamp": 1659564000
  },
  {
    "username": "ibiliss",
    "rating": 2.0,
    "comment": "Terraforming Zoo in twice the length.",
    "timestamp": 1659132000
  },
  {
    "username": "johnthesweeney",
    "rating": 2.0,
    "comment": "A ridiculously complex game of patience, with a deck so big that drawing a card you want is far too random.",
    "timestamp": 1656280800
  },
  {
    "username": "lizardking846",
    "rating": 2.0,
    "comment": "Tried to give it a chance. 7 plays, mostly 4 players, 3 games with 2 or 3 players. Too prone to runaway winner, heavily dependent on card draw. Game takes far longer than it should, average play time 4-5 hours. Most players just wanted it to end and aren't having any fun. Rules are extremely daunting for newer players and very convoluted. Too many fiddly parts to keep track of. Easily the most overrated game on BGG. I expect it to drop out of the top 100 once more ratings come in.",
    "timestamp": 1652997600
  },
  {
    "username": "Bjolnir",
    "rating": 2.0,
    "comment": "Boring and ugly. I don't understand the rating of this game !",
    "timestamp": 1643238000
  },
  {
    "username": "merismo",
    "rating": 3.0,
    "comment": "Complexity for the sake of complexity. Felt like a clunkier version of Terraforming Mars, which I'm not particularly fond of either. And like its spiritual predecessor, luck of the draw plays too central of a role for me.\n\nNo idea why this game is scored so highly. At least the cards are pretty?",
    "timestamp": 1761606000
  },
  {
    "username": "tectactoe",
    "rating": 3.0,
    "comment": "Combines a host of familiar mechanisms in a fairly satisfying manner, though repeated play has revealed that the game does start to get procedural and optimal actions become more obvious. Yes, you \\could\\ have done this, but you \\should\\ have done the other thing, and you \\knew\\ you should have done that other thing, but you wanted so badly to believe this game has far more paths to victory than it does. The cycling of the action cards is a neat wrinkle, but I cringe at the randomness of the cards (as one usually does) and how they can totally make or break who ends up victorious at the table.\n\n+Ark Nova: Marine Worlds [3.0] Adds a few additional things to think about; not sure it actually improves the game, though.",
    "timestamp": 1761519600
  },
  {
    "username": "Xstream",
    "rating": 3.0,
    "comment": "I'd now only consider playing this solo. Sold It though as I likely never play this again.\n\nIn solo there's also that race turn angst, just like real players. For multi-player It only adds time and I have a really long list of other games I prefer to play. It's super random for such a long and complex game. It's just a big luck-fest which tries to balance that out by making It super long (designer's own words). Sadly, It doesn't solve the issues I have with It.\n\nI have played this game now 9 times (4 times solo) and I’ve come to a conclusion. TL;DR: I consider this a less interactive, strategic and more random version of TFM. To me personally also with a less interesting theme.\n\nThe randomness of cards play a very big part in this game and gaining card control can only be unlocked during the game at the expense of other paths. Which means you start going through the same motions or just play a super random game for 4+ hours. I don't like games where card control is something you have to unlock (like in WS) vs TFM (drafting) or ED (unlocked out of the box).\nIt can kill your chances already in the first round and this can also keep on going for multiple rounds. There's almost no mitigation otherwise. And I don't even mind that so much, like in WS, but then It's just waaayy too long for what It is. It doesn't add depth over time. It's just long.\n\nI don't like having your own private zoo board vs a shared one (I.e. TFM) which adds interactivity, area-control or another level of planning and tension for top spots.\n\nI don't like the (lack of) synergy between cards. It's not much of engine building, more about one-time (often wasted) powers, essentially to just prepare a cage for an animal. Any bonus can just come to players without any skill involved. The sponsor cards don't add much as a game strategy either. There's also something about the diversity of the cards that really make that \"bad luck of the draw\" sensation stronger. I guess that's because of the lack of engine building between cards to build something you can utilize better during the game, like TFM manages to do.\nThe tile laying doesn't offer much interesting decision-making either. It's really boring vs a shared interactive board like in TFM where timing, area-control and a race sensation creates that urgency and turn-angst.\n\nThe action selection mechanism is sort of fun though. It helps limit options, but at the same time creates more restrictions. I liked this mechanism in \"Civ: new dawn\" more to be honest. It adds to that \"on rails\" feeling I experience a lot while playing this game. I want to do this but the game state is telling me to do that. It's like the game is playing me more than me playing the game.\n\nAN is complex for the wrong reasons. The complexity doesn't lie in \"choice\", but in \"analyzing what you can't do\" and find the (best) things you can. It's not part of your strategy you setup, It's a constant tactical nature and lack of control. but with a level of complexity I'd prefer in a more open field game, where the complexity lies in options and strategy. Not in restrictions and pivoting the whole time because the game threw random stuff at you. That's something I can still accept in a 1 hour game (I.e. WS), not a 3 - 4+ hour one. This is also why I prefer It solo, as that plays in about 2 hours. I like to look back and think, ok, I should have done this or that, but in AN you can look back and still think \"I didn't have a better choice available\", so the game decided for me to lose then I guess? After playing for 4h?\n\nI did really like the race aspect with the offset tracks to trigger the end of the game, like Rayas of the ganges did as well.\n\nThe insert is just bad with the token boxes not fitting the tokens properly + the odd box size and the bag galore. Not really the kind of production you come to expect nowadays.\n\nI don't understand the hype. I'm surprised at the off-set vs other similar games that didn't get the same love and do a much better job in my book. I guess It must be the theme? I'm really baffled what It is that triggers the masses to collectively love this super long random game so much. But as always, games have a different effect on different people. It's just not my game I guess.",
    "timestamp": 1759010400
  },
  {
    "username": "fzudema",
    "rating": 3.0,
    "comment": "The main problem this game suffers is that it's very unclear how benefitial an action will be in the end. Very beginner unfriendly and even if you like crunchy games not very satisfying to play because of it.",
    "timestamp": 1758232800
  },
  {
    "username": "Maglinkinpark",
    "rating": 3.0,
    "comment": "HOW... is this at #4 already!?!?\n\nOnce I heard \"Terraforming Mars\" mentioned... I was out! No go for me.\n\nUPDATE:\nAfter finally trying it… I can say a few things about it.\n\n1. It’s better than TM by far. The art is better, the theme is better, the game play is better, almost everything is better.\n\n2. What’s NOT different than TM, is the amount of cards and the luck factor. You can’t have a “strategy” in this game period. It’s excessively tactical, but presents itself as a deep strategy game. Just like terraforming Mars does.\n\n3. It could have had half the amount of cards. Way to much swing in that deck. LUCK should not play a major role in a 2+ hour game.\n\n4. The public goals is a messy mechanism. You have both open goals, and then goals that can be played by players. Blehhh. Just cut one of those out of the game. Toooo much stuff!\n\n5. The coffee break is a silly way to maintain updated. It required players to keep track of things they shouldn’t have to think about. This could have been handled by a deck timer or something easier.\n\n6. The game is wayyy too long for such a lucky game. With some of the modifications I just mentioned it may play faster, but also I think the score track could be reduced to speed it even more. Because…\n\n7. The “engine building” element is NOT strong in this. You get a few actions that get better, more icons in the tableau, etc. but you never really feel like you’re progressing. (And no I didn’t play poorly, I was a few points from winning.\n\n8.There are about 5 other things that could have been cut from the game, or at least simplified. This is another one of those games that should have been developed more and trimmed down. Instead it was bloated up.\n\nAll in all I didn’t hate my play of it. I would play again if coaxed by a group and I was in the right mood. But I would probably need to be strongly coerced by friends who own it and want to play. I certainly don’t need a copy in my collection though as I would never reach for it over so many other games.",
    "timestamp": 1754431200
  },
  {
    "username": "dragos_br",
    "rating": 3.0,
    "comment": "Solitaire, restrictive, random targets, overrated; shares many traits with Terraforming Mars which I almost equally abhor (this abomination is even worse).\nWorst game I played in a very long time, I couldn't wait to be done and thanked the player who triggered the end. Steer clear.",
    "timestamp": 1753394400
  },
  {
    "username": "GHoooSTS",
    "rating": 3.0,
    "comment": "probably the most disappointing game i've ever played",
    "timestamp": 1749765600
  },
  {
    "username": "GuySamstag",
    "rating": 3.0,
    "comment": "More of the same -- I just don't find much joy in sitting around the table doing these \"exercises\" together. It plays smooth, at least.",
    "timestamp": 1748988000
  },
  {
    "username": "ultimoratio",
    "rating": 3.0,
    "comment": "Update: JUN 2022 \n\nDowngrading from 2 star to 1 star because the game gets more obvious with its strategic decisions upon further plays.\n\n============================\n\n\n\nI like it better than Terraforming Mars as you have more control on the strategic direction of your game. The card intake is still a crapshoot, but the game is better as there's always an action to take more cards. That, just in itself, made this the better game, but that is a very low bar tbh. Any designer worth their salt can inject more control with the random deck (see Race for the Galaxy)\n\nThe tile laying and position remains to be desired and not enough depth.\n\nHowever, in the grand scheme of things. This is one of the decent ones in the card tableau genre. Race for the Galaxy, Imperial Settlers, Seasons, Innovation, Res Arcana, and so on and so on are far better and far quicker. Simply put, Ark Nova lacks the depth of decision to justify the 1.5 - 2 hour length of game play. And Ark Nova didn't really fixed the many problems of Terraforming Mars.",
    "timestamp": 1747346400
  },
  {
    "username": "darkfinale",
    "rating": 3.0,
    "comment": "Played once on BGA. Artwork not my type. Theme not my type. Feels like a more complicated version of Wingspan. Not inclined to play often. Tile placement not my type.",
    "timestamp": 1744495200
  },
  {
    "username": "Apos",
    "rating": 3.0,
    "comment": "Modern euro game, where over-complicated rules with lots of icons, that hide bland and solitaire gameplay. Very long with more players - best to play solo or with two to avoid downtime. No tension, no emotions and first of all - game lacks interesting decisions - whatever you do, you get bunch of points.",
    "timestamp": 1744408800
  },
  {
    "username": "sutrebuh",
    "rating": 3.0,
    "comment": "Director solum! Take an action selection like in Civilization (A New Dawn), a victory point track like in Rajas of the Ganges, a bonus cascade towards the end of the game like in That's Pretty Clever and a huge pile of project cards like in Terraforming Mars, but instead of playing on a common board in the middle of the table, each player plays in their own area like in Cascadia, also garnished with an animal theme, and there you have the currently so successful solitary rummaging around. What remains is an interactionless struggle with all kinds of possibilities against the whims of luck when drawing cards, which often strikes mercilessly enough to not even allow a real race for the bonuses to break out, let alone a fair one. As a result, we each play for ourselves against the game instead of against the other players, who could simply be left out in favor of a solo game without any loss of fun.\nLonely Director, or if it has to be Latin: Director solum would probably have been a more appropriate title. The fact that you can also lose with minus points is actually the funniest thing about the chewy messing about and an incentive, but it doesn't really suit the target group of such harmony-addicted games. The fact that some animal cards offer the possibility of messing up other players' planned moves was apparently such an inappropriate contrast to the otherwise interactionless hustle and bustle that the game designer himself suggests simply leaving it out. In fact, this intervening action is so coincidental that it is not player-driven interaction, but at best just a set-up. After all, at some point, quite respectable zoos are created, which does somewhat romanticize the business field, which in reality is not beyond all doubt. Otherwise, it should be mentioned: The box is quite large and once again nobody seems to have tried out the storage boxes.",
    "timestamp": 1743717600
  },
  {
    "username": "Bisqp",
    "rating": 2.7,
    "comment": "At first I was charmed with this game. Now, after I played couple of more games (2, 3 and 4p games) I hate it. And I hate it even more when I see it among top 5 on bgg which is extremely undeserved – it shouldn’t be even among top 100 for what it offers.\nYou don’t play this game. You are played. It is totally luck dependent. Best description is: Overloaded and needlessly overpacked card roulette. Either you are lucky and get some cards that somehow match each other and you win or … you are not and you lose. And there is absolutely no way to mitigate this luck in any way. Other games have draft or mechanisms for cycling the cards – here you have none. Also way to long for what it offers especially since the final is so anticlimactic. If you, like me, like heavy, crunchy, demanding and rewarding games with solid thought-over mechanics – go for: Carnegie, Underwater Cities, Anachrony, Great Western Trail and many many others. This is a disaster which is totally overhyped. If you are desperate – go play someone’s else copy couple of times. I guarantee you will run from it the faster the more you play it. One of the biggest disappointments of whole boardgame journey (20+ years now)",
    "timestamp": 1743631200
  },
  {
    "username": "Ginewra",
    "rating": 3.3,
    "comment": "bga",
    "timestamp": 1739833200
  },
  {
    "username": "Paradoxx",
    "rating": 3.0,
    "comment": "Винегрет из механик, половина которых просто ради массы. Перехайленая игра, основное решение в которой сводится к тому, какую из 5 карт не апгрейдить.",
    "timestamp": 1738191600
  },
  {
    "username": "BM_Meisterburger",
    "rating": 3.0,
    "comment": "I'm glad so many people like this game. Personally, I'm not a fan of point salad games. Just didn't seem super fun.",
    "timestamp": 1738191600
  },
  {
    "username": "pandaman148",
    "rating": 3.0,
    "comment": "I really wanted to like the game. I love animals, I love the concept, I love the art and it was highly rated on boardgamegeek.com. Simply put, the rules are too complicated and it dragged, so I have to give it a low rating. Maybe I'm just too new to the hobby or I'm not smart enough, but I felt like it was a homework project rather than a fun board game. It just didn't hit for me.............I don't want to discourage people from getting this game, I just want to make it clear that if your on the edge of getting this game that you know what your getting into. It's a heavy game with tons of love, but it's not for the casual player who just wants to have fun without hurting their brain.",
    "timestamp": 1737673200
  },
  {
    "username": "LambertBehnke",
    "rating": 3.0,
    "comment": "Almost 4 hours of actions, cards, and all that, and then the person with the best opening hand wins the game. If you do well early, you are quicker to getting more workers, using upgraded cards, and getting recurrent bonuses.\n\nSure the theme is nice, and it isn't obvious what will be better in the long run, but that exactly makes the first couple of plays so hard. For me this game isn't going to get enough plays for me to work out which strategies are going to go well.",
    "timestamp": 1736895600
  },
  {
    "username": "tOverney",
    "rating": 3.0,
    "comment": "The game is a slog!\nFor a game that long I would not want something so heavily reliant on \"top-decking\" cards that are good for you!",
    "timestamp": 1735254000
  },
  {
    "username": "inkstainedpapers",
    "rating": 3.0,
    "comment": "Hated it. Played it once after much hype. Terrible card draw and keep mechanics. Game dragged on way too long. Very much a hope for the cards you need game. The market row seems pointless. I would usually overlook these things since I like tile laying games and \"make lemonade\" tactics style gameplay but the one play I had was such a bad one I never want to try it again.",
    "timestamp": 1735167600
  },
  {
    "username": "ubRtstcl",
    "rating": 3.0,
    "comment": "Plays very stale. TFM with no engine building and no group map, the two best parts.",
    "timestamp": 1733180400
  },
  {
    "username": "Tjaball",
    "rating": 3.0,
    "comment": "Ark Nova is often compared to TfM. Altough I see the similarities, I think you have far more options in Mars to do something even if your cards are just not comboing. Not here. This game depends entirely on card drawing. Maybe more similar to Everdell just not have that comforting feeling. I played several games on BGA, and did not enjoy at all.",
    "timestamp": 1730761200
  },
  {
    "username": "HerryKun",
    "rating": 3.0,
    "comment": "I played this game a few times now and never had a good time with it. This is because of the following points:\n\n- I do not feel in control. For a strategy game, everything seems too random to involve a lot of strategizing\n- The mechanics seem too complex for what they are trying to achieve\n- It takes way too long. The actual game loop feels stale after 50% of the game time\n- In the beginning, you have way too little of everything. No money, no space for animals, no cards. Unnecessarily slow in my opinion\n- You are way too dependent on luck.\n\nThe theme of the game is very nice, the artwork is great as well. It is just a bit too janky when it comes to mechanics to make it enjoyable for me. For each subgenre of the game, other ones implement them better.",
    "timestamp": 1730674800
  },
  {
    "username": "gizmobj",
    "rating": 3.0,
    "comment": "I absolutely hate this game!! The end of game scoring is a bit confusing and also feels like a disappointment after such an intense experience. Tough to learn and even more difficult to master. One of the most over-rated games IMO. I would much rather play something more fulfilling.",
    "timestamp": 1730156400
  },
  {
    "username": "Balleflass",
    "rating": 3.0,
    "comment": "Takes way too long with 4 players.\nMay be better at 2 or 3, but I dont feel like I do anything more interestning late game than I did early game.\n\nI really love the card action river which is similar to the action river in the latest Civilization game though.\n\nGame is very random with what cards you can get, and it isnt fixable in an easy way like you can with Terraforming Mars where you draft cards.",
    "timestamp": 1729461600
  },
  {
    "username": "Nushura",
    "rating": 3.0,
    "comment": "Ridiculously punishing for an engine builder game. The whole game revolves around the break mechanic and predicting/forcing the end of the round. However, if you miss it even by one turn you lose a huge amount of tempo (be it in the income of the new animal, cards, workers,…). This tempo loss is irrecoverable. Efffective Player elimination in 2020 for an engine builder that takes 2+ hours is unforgivable in 2020 imo.\n\nThis game should be 2 players only (like bgg poll says). There is no interaction, just adds more downtime between turns and makes end of the turn less predictable.",
    "timestamp": 1728684000
  },
  {
    "username": "Board_Edgelord",
    "rating": 3.0,
    "comment": "Good mechanics put together to somehow make a dull and unengaging game",
    "timestamp": 1727128800
  },
  {
    "username": "CattleCounty",
    "rating": 3.0,
    "comment": "Strategy game lover but don't get the fun part of it....",
    "timestamp": 1726956000
  },
  {
    "username": "AYelesin",
    "rating": 3.0,
    "comment": "Originally had this at a 5, but reduced to a 3 because I couldn't \"take it or leave it,\" but rather I don't think I'd be willing to play another game of Ark Nova. It's not a bad game but it's one that's too long, too lucky, and too complicated for what it is. I could deal with the disappointing art and lack of long term planning, but having to sit through such a long game with so few interesting turns is a chore.",
    "timestamp": 1726524000
  },
  {
    "username": "ElHuerta",
    "rating": 3.0,
    "comment": "If you have bad card luck, you are imprisoned by the game for hours, watching the breakaway leader.",
    "timestamp": 1724968800
  },
  {
    "username": "JosephSchmoe",
    "rating": 3.0,
    "comment": "Overrated\n\nComplexity and rules for the sake of having complexity and rules.\nFeel like a game where either you make a mistake due to a little requirement or your opponent makes a mistake due to a little requirement, and winning or losing this way feels cheap. Add in that you might have another hour or two to slog through to get to the end.",
    "timestamp": 1723154400
  },
  {
    "username": "Lydian",
    "rating": 3.0,
    "comment": "Reminds me a bit of Terraformin Mars\nMechanisms work, and while it has some impact on my playing what the others do, the other players just drag this out too long. It doesn't change much if a human or some random generator would be taking and playing cards, and if I have to say, I'd rather not have other players around that kills the idea of a board game for me.\nIt's not bad per se, I just don't want to play it again as I don't play solo",
    "timestamp": 1721426400
  },
  {
    "username": "Bal_505",
    "rating": 3.0,
    "comment": "Dreadful. Long, dull, and complicated. But I might give it another go some day",
    "timestamp": 1719698400
  },
  {
    "username": "Euroman",
    "rating": 3.0,
    "comment": "My game with 3 players took 5 hours. 5 hours! That's just too long. This play was with others who were familiar with the game, so being new to the rules was not the issue. The tableau building brings it way down for me. Card text is a fun killer. I don't like Terraforming Mars or Race for the Galaxy, so it makes sense that I don't like this.",
    "timestamp": 1717624800
  },
  {
    "username": "mqstout",
    "rating": 3.0,
    "comment": "Could be turned into an OK game. A few things hold it back from being a good game. I hope the following top-flaws can be addressed through a 2nd edition or something:\n\n1 - Game length is a tad long. Like extremely too long. I'm OK with long games, but \"for what it is\" applies here.\n2 - Interactivity is a bit low. Like essentially zero. Some animals [randomly acquired, see #3] briefly harm opponents. Otherwise, most interactivity is in \"claim X before they do\".\n3 - Randomness is a bit high. The deck of cards is pretty fat, and it's not easy to dig deep to find what's useful for you. A lot of cards (randomly) are going to be of nominal, if any, use to you. Distribution of certain critical cards -- like conservation projects -- are only 20 out of the stack of 200-some cards. You could end with seeing zero of them, leading to a boring game and that part of the mechanisms barely used. Or some goals literally unattainable due to the shuffled distribution.\n\nOften compared to Terraforming Mars: This isn't close. Much less game here for the same play time (or TMars will be shorter, depending on expansions). The shared board jockeying and hand-passing drafting makes TM a way, way better game.\n\nIt's just largely... dull. There's never a \"wow!\" moment. There's no real engine building to do neat things. It's just set collection, but the methods of getting those sets is largely luck based. Sounds awesome on paper... but plays poorly.\n\nZoo theme is largely just tacked on; it's mostly an abstract game.",
    "timestamp": 1715551200
  },
  {
    "username": "Warren dM",
    "rating": 3.0,
    "comment": "Multi-player solitaire. It serves no purpose to play with more than two people. Or, why not just play it solo if this is your thing?\n\nI only agreed to try it out because a good friend asked. 4-player game took 3.5+ hours with teach. Could have played like five fun, interactive Knizia games in the same amount of time. Lost opportunity.",
    "timestamp": 1713564000
  },
  {
    "username": "TerraNigma",
    "rating": 3.0,
    "comment": "Time to rip this plaster off.\n\nMy first assessment of the game was rather disappointed, then I thought, I was just playing badly, until now where the circle closes itself.\n\nI hate to admit, since I wanted to like this game, primarily for it's theme, that it is not a good game.\nIt's an exuberantly luck based card game with a thin layer of theme pasted on, that now fell off to crumble onto the floor, to reveal it's true nature.\n\nThis is not about building a zoo. It could just as well be a game about cars in different size of garages. The immersion is considerably lacking, even after I pimped my game with animal meeples, which should have been in there from the outset. i just doesn't catch me anymore since I start the game not with my mind on building a nice animal shelter but thinking what garbage the game will throw at me this time.\n\nThis game has little to no direct interaction with your opponents, if you don't play the mean variant with those asinine attack cards, which make no sense thematically. But if there's interaction it's of the type hate draft and denial, which I both detest.\n\nIt wants to be tactical and smart about hand management and play what you have, instead what you want, but what if you have only expensive animals or no sponsors in your starting hand? Mulligan? Draft? The amount of jinks in the forum about the first turn is ominous enough to see there's something wrong. And this goes on. You could play the perfect game, if you never draw any conservation cards/sponsors with CP but your opponents do, you lose. Fullstop.\nPursue the public goals? Good luck again with that. That's max. 15/20 points, if you are the first to score all of them at max, which you won't.\n\n\"You're just playing badly.\" - every white knight in the AN-forums.\n\nWhat does the designer have to say about this?\n\n\"Of course there will be games where you loose, because your opponent drew nuts - this is on purpose, because it helps bringing people back to the table, as long as it only happens once in a while.\" (M. Wigge)\n\nIf you admit, your game may screw you on purpose, that's where I leave the hype train. I want my games beatable by own accord, not by a random chance of drawing a good card combo. Luckily there's already a competitor on the horizon, which might become what AN should have been: a zoo game.\n\nFor me, this game goes inert. I will play it if asked, but I won't actively pursue it. And I'm rather disconsolate about that.\n\n\nThis guy sums it up perfectly: https://boardgamegeek.com/video/372499/ark-nova/ark-nova-rev...",
    "timestamp": 1708729200
  },
  {
    "username": "Bone White",
    "rating": 3.0,
    "comment": "Has a big issue with combo accessibility - a much more opportunistic game than the mechanics would have you believe.",
    "timestamp": 1706310000
  },
  {
    "username": "dr.morton",
    "rating": 3.0,
    "comment": "A Terraforming Mars clone with some Bärenpark thrown in. Not as innovative or thematic as TFM. Typical hype train game.\n\nAfter more plays the rating goes down from a 6 to a 3.\n\nThere is simply too much luck involved, just like with the terrible Dune:Imperium.\nThe catch up mechanism ist terrible.\nWinning the game is a simple matter of who gets the best sponsor cards early. Ark Nova is no rocket science, the winning path is clearly marked, the card draw decides the game.\n\nIt is now placed before TM. You're kidding me. BGG is surely in its decline.",
    "timestamp": 1705878000
  },
  {
    "username": "SGgrayfox",
    "rating": 3.0,
    "comment": "Sold. Immediately.",
    "timestamp": 1705791600
  },
  {
    "username": "Haze1975",
    "rating": 3.0,
    "comment": "Nope!\nI like complex games, but this game felt just two steps too much in every way. Too many synergies all across the boards (your own and the two main boards), too many icons/symbols and too many cards (aka luck of the draw).\n\nI usually don't mind low interaction in games, I actually generally dislike games with high interaction, but this is too low!\nWe could be looking for different cards, so interaction in the card row may very well be non-existant. And the \"workers\" don't block other players placing on the same spot, so they only block which university or \"buddy-zoo\" remains this round...\n\nHIGHLY overrated!\n\nInsta-sell!",
    "timestamp": 1705014000
  },
  {
    "username": "gwtwred",
    "rating": 3.0,
    "comment": "I posted an extended review in the forums. This game is thematically nonsensical, and the iconography on the cards is unclear and inconsistent. It's really just a recipe for hours of frustration.",
    "timestamp": 1703372400
  },
  {
    "username": "Confucius Rex",
    "rating": 3.0,
    "comment": "Good lord they just remade Terraforming Mars with a nonsensical theme, less player interaction, significantly less flexibility, and an incoherent, meaningless scoring system.",
    "timestamp": 1702508400
  },
  {
    "username": "lee elektrik",
    "rating": 3.0,
    "comment": "Boring, uninspired, overwrought, unfocused, ugly, solitary. Very much to current tastes. It _has_ a heavy box, though.",
    "timestamp": 1702422000
  },
  {
    "username": "parpari",
    "rating": 3.0,
    "comment": "More multiplayer solitaire, longer, luck driven and less thematic with separated player map boards which makes less interaction version of Terraforming Mars. Expect production, this game downgrades version of Terraforming Mars in every aspect.",
    "timestamp": 1701212400
  },
  {
    "username": "Zwario",
    "rating": 3.0,
    "comment": "Everytime I see folks setting this game up, I simply shake my head and go play 5 or 6 games that make people laugh and smile in the same amount of time as 1 game of Ark Nova... (obviously not my cup of tea)",
    "timestamp": 1692655200
  },
  {
    "username": "Gewalf",
    "rating": 3.0,
    "comment": "I am a bit baffled at how high this game is being rated. It lacks any kind of tension or even proper engine building, I feel this game is way shallower than the ratings give it credit for. It's also overly long for the fun it brings.",
    "timestamp": 1691013600
  },
  {
    "username": "royalty_valens",
    "rating": 4.0,
    "comment": "Ark Nova is a game where you can find yourself losing with no chance to win. this is due to a very small set of randomly generated point conditions coupled with a huge deck of cards. It's a shame building a zoo won't help your score.",
    "timestamp": 1761692400
  },
  {
    "username": "JestemTostem",
    "rating": 4.0,
    "comment": "Incredibly overrated game - takes a long time to set up, you need very large table to put game board on, first turns are boring as hell and then, when you start getting some fun actions to play - game ends abruptly because of two convoluted point systems you have to keep eye on.",
    "timestamp": 1761519600
  },
  {
    "username": "shmonkey",
    "rating": 4.0,
    "comment": "This game is like a mashup between a lacerda title and terraforming mars. There are prerequisites for everything, and you need to upgrade several items before you can get to others. You are trying to sequence everything to get the most you can out of the game.\n\nThere are several tracks to work your way up in this game. The card crafting is not as prominent as in TFM. The individual player board trigger placement bonuses to help chain actions. and the round is driven by a common track, the \"break\" track.\n\nOverall i enjoyed my play. I think it was relatively fun, but ultimately its not a game i would seek out. Its more puzzle-like than i prefer and much less interactive. Our first game also lasted a bit over 4 hours. The scoring was wonky and could be simplified greatly. I would have appreciated this much more a couple of years ago, but today i wouldnt consider this to be much fun. It is definitely a good brain burner though, i can see why it is hyped",
    "timestamp": 1759874400
  },
  {
    "username": "Adrian2",
    "rating": 4.0,
    "comment": "Very heavy Euro that takes way too long as a newer player (5 hours at 3 players). It outstays its welcome to the point where it isn’t worth the effort and time required to gain enough experience to play quicker.",
    "timestamp": 1759615200
  },
  {
    "username": "mawilson4",
    "rating": 4.0,
    "comment": "Better than expected. Which is to say, I still sort of dislike it and don't really want to play it. But it's better than Terraforming Mars, a game that obviously inspired many of its mechanisms.\n\nI don't want to say that the animals save the game for me, but...they kinda do. The varied types are fun to discover and add to your zoo, even if they're tied to a whole that is a typically modern soup of resources, symbols and mechanics designed to obfuscate the fact that you're just shuffling things around for points. If I'm going to build a tableau in a game like this, I'm at least happy that it's interesting species of animals. The rest is a mess, but whatever.",
    "timestamp": 1757973600
  },
  {
    "username": "TrickD",
    "rating": 4.0,
    "comment": "Boring.\n\nAnd don't get me started on a game all about conservation releasing an all plastic waste of a deluxe version.",
    "timestamp": 1757800800
  },
  {
    "username": "so_not",
    "rating": 4.0,
    "comment": "It's a relatively complicated solitaire. Often gets compared to Terraforming Mars for some reason and I will always play Terraforming Mars instead.",
    "timestamp": 1757282400
  },
  {
    "username": "Eoin Corrigan",
    "rating": 4.0,
    "comment": "Racing up tracks, with cascading bonuses. Lots of downtime between moves. End game feels very constricted. I don't particularly enjoy the tile laying aspect, which feels artificial, as does the whole game - a zoo with 4 or 5 animals?\n\nFunctional-to-ugly components, very little narrative, and apparently a crocodile is not a predator?",
    "timestamp": 1757023200
  },
  {
    "username": "Saib1995",
    "rating": 4.0,
    "comment": "Terraforming Mars is better",
    "timestamp": 1753912800
  },
  {
    "username": "rharn",
    "rating": 4.0,
    "comment": "Too much of everything (rules, components, playtime) for too few fun moments. I play board games to interact with and backstab my friends -- not to sift through a giant menu and have to go down a rabbit hole of rules and constraints.",
    "timestamp": 1753048800
  },
  {
    "username": "EarlofBronze",
    "rating": 4.0,
    "comment": "Okay game…too many mechanics meshed together. Does not flow for me.",
    "timestamp": 1752444000
  },
  {
    "username": "Greywolf2001ca",
    "rating": 4.0,
    "comment": "The game is good but what kills it is the amateur layout of the cards. They overflow with information that more often than not is used once and then you forget whatever is on the card. It gets even worse, some information are doubled. So you actually have twice the same information on the same card (an icon plus text that says the same thing).\n\nIn card design for games, cards must have a maximum of three information. You could go up to four if the card is used frequently during play, like a creature in Magic the Gathering. For Ark Nova, cards should have a cost (which includes prerequisites), an effect (in text only) and bonus icons... that is it!\n\nToo many icons. A few are useless and could let the text do its job. The PvP icons should simply be removed as the text on the card says what it does and nobody I know plays with the PvP icons anyways. I think these PvP abilities should simply be removed from the game entirely. It would simplify a game that SHOULD be SIMPLE to LEARN in the first place.\n\nOverall, poor job on the cards from everyone that worked on the game. It is as if the cards were made by people who never touched another card game in their life.\n\nThe game is HIGHLY overpriced. This game should be half to two-third of the actual price. It contains only a bunch of cards plus some cardboard tiles and gameboards. Nothing that justifies such a steep price for a card game. No miniatures, no custom dice, no 3D construction, no electronics, nothing!\n\nAlso, I do not feel like I am playing a conservation zoo. The game could have been about crates with colours, medical supplies, bacterias, space junk, T-Shirts, or whatever. It does not feel like a zoo game at all.\n\nThe game is still good but the cards needs professional help and a redesign. Their layout is very poor.\n\nBecause of the poor cards, swarm of icons (several can be removed) and its very steep price, I only gave it five stars out of ten. Just by asking for professionnal help for the cards and making a new acceptable version of them by eliminating useless icons and diminishing the amount of information on cards, I would increase this rating to eight out of ten.\n\n2025 EDIT : I do not know how I missed that when I wrote that review, but the game suffers from a terrible snowball effect. You cannot catch up with a player that has 30 points or more ahead of you, especially if he is playing before you.\nThe fact that the setup of the orignal game did not tell the players to draft their initial cards either from revealed cards on the table or like 7 Wonders, makes this snowball effect even worse. If a player has all the cards he needs on the first turn, you can bet that he will win compared to those who started with a bad hand of cards. So a draft is a must but even then, as soon as someone is ahead by 30 points, the game is over. Not worth continuing playing. I am saying this after playing the game for over 50 times now, so it is not just a belief but tons of games.",
    "timestamp": 1750111200
  },
  {
    "username": "Jordies Team",
    "rating": 4.0,
    "comment": "I would really like to understand the hype and join the huge group of fans but for me there are too many negative points to enjoy this game, unfortunately:\n\n- plays too long for the depth of it: there are games like Roll/Race for the Galaxy, Pirates of Maracaibo etc. that feel equally complex but play in half the time\n\n- very close to TM - for some people this seems like a pro, but I prefer innovation and original ideas\n\n- the card mechanism is from Civilisation: A new dawn. Whereas I don't mind inspiration and adaption the mechanism here is copied bit by bit and the original game was not credited at all which seems unfair\n\n- The same accounts of the VP track and Rajas of the Ganges\n\n- The theme is handled here in an unreflected way. Zoos have problematic implications which is not addressed here at all. In the game animals are surely released back into wilderness but in reality for German zoos alone about 800 wild animals are captured and maximum of 150 are released back into wilderness each year.\n\n- it often feels like forced gameplay since many times the best option to play seems obvious",
    "timestamp": 1749506400
  },
  {
    "username": "Kent",
    "rating": 4.0,
    "comment": "Way overrated. I suspect this is partially because people like the theme and so they want to love it; they want it to be good.\n\nVery random.\n\nThere are random take-that cards that can seriously impact one's strategy and it could take several turns to pivot or recover. And yet there's no way to reciprocate. This was a bad ideal in Terraforming Mars and it's even worse here.\n\nThe end game scoring is nonsensical and meaningless. End game scores in a three-player of say 30, 0, (40) are not uncommon, in fact their likely.\n\nBased on the BGG rating scale, I should rate this a \"2\" (\"Won't ever play again\" - which is my intention). But it gets a rating of \"4\" (\" . . but could play again\") because I suppose if it was a friend's dying wish to play it then I'd accommodate him (but he'd have to be literally about to die).",
    "timestamp": 1748728800
  },
  {
    "username": "Trigonomical",
    "rating": 4.0,
    "comment": "Its good-ish? But also really long. And then when it ends, it ends suddenly. The limited way the cards combo off each other is a let down.",
    "timestamp": 1748728800
  },
  {
    "username": "shawnmackay1593",
    "rating": 4.0,
    "comment": "Really can't understand why people love it as much as they do. It's definitely not a bad game but I find it too long for what it is. And even if it was shorter, I still didn't find it that engaging. Also loses a point for having take-that attack cards. Really no desire to come back to it.",
    "timestamp": 1747519200
  },
  {
    "username": "Breven",
    "rating": 4.0,
    "comment": "$40 Played Once",
    "timestamp": 1743976800
  },
  {
    "username": "tbrofromspace",
    "rating": 4.0,
    "comment": "Maybe in a world where everyone takes 3 second turns, I would be able to stomach playing this game with other people.",
    "timestamp": 1743804000
  },
  {
    "username": "Rackerstar",
    "rating": 4.0,
    "comment": "Nagyon hosszú, vontatott játék. Összetett, így csak azoknak javaslom, akik tapasztalt játékosok.",
    "timestamp": 1743030000
  },
  {
    "username": "Baelna",
    "rating": 4.0,
    "comment": "One of the few games we bounced off.\n\nTheir change to the scoring mechanism means that I may come back.",
    "timestamp": 1740178800
  },
  {
    "username": "Krevillen",
    "rating": 4.0,
    "comment": "Worse - and even way longer - retheme of Terraforming Mars.",
    "timestamp": 1735945200
  },
  {
    "username": "JakeJackPot",
    "rating": 4.0,
    "comment": "A very solid game that mostly lives up to most of the hype. The upgrading and variable action selection is easy to understand but feels fresh to a degree. It's nice to see a grounded theme that is deeply enough to be fun and interesting.\nI do have some problems though. The middle row of cards can be heavily utilized or easily forgotten and it's annoying to consistently look for excuses to use them middle face up cards.\n\nI also think that the unlock system is fun, unlocked from a wide range of places, however it's easy to lose where upgrades are found and you can make many miss plays going for the wrong choices you though would lead to upgrades.\n\nFinally the cards is a problem in any heavy card game, you can often spend a lot of time looking for a specific card and not find it.\n\nAll that to say, the game is fun, looks good and is easy to learn excited for more plays and what comes in expansions.\n\nEdit: After playing about 3 more times since review, my score dropped 1. This is mostly due to a same-y feel starting to develop. I would normally attribute this to playing to much but a few weeks has gone by. It boils down to a problem in the game where my strategy lacks depth because I am just hoping I top deck the right cards or find a good combo amongst my cards I started with as a play, both luck based problems. In the end the game is fun, looks pretty good and is easy enough to teach with some good depth, but it isnt that good of game that it should be universally loved, Terraforming Mars is a better game due to its expansions. Most of my problems with this game could be fixed with expansions but for now its a very solid 7/10 that I enjoy but am not rushing to play again between plays.\n\nIt's a fun game but push comes I would only really want to play it once a month or not at all. It's predictable and repetitive and I'm blow away that it's on the top 100, let alone in the top 10. It's been carried by the hype train and after playing the game with open eyes I see it's short comings.",
    "timestamp": 1735945200
  },
  {
    "username": "skipboris",
    "rating": 4.0,
    "comment": "Initial score after 1 play. Mechanically feels like Race for the Galaxy except with a shallow hex map puzzle added on and a much longer teach and play time. Player interaction felt very limited, and what was there was shallow (just like RftG). Just little races that rarely affect you, and take that attack cards you don't see coming. It really needs stronger chewier player interactions. If I'm having adults over to my house to play a game, it better have strong interaction. 4 adults playing solitaire for an evening is just really sour. After 3 hours of teach and play, we didnt finish the game and I played solo the next day just to see how the engine accellerates at the end, which it does dramatically. Its a little embarrassing to play a game with 90 minutes on the box into the 3 hour mark with nothing but advanced gamers. I think to get to a good game all players probably need 3-5 plays under their belts at minimum, and even then it's still just races with a little blocking. As a solo game I think it's really strong though. The decision making is very rich within the confines of your own zoo and hand. I would rather play this solo over RftG, and as a solo experience it's probably an 8 or 9.\n\nThe cards are pretty, just like RftG.\n\nZoos are receiving a lot of criticism for the entire concept too. I would have enjoyed this more if it was a conservationist and habitat protection theme, no zoos. To me the attraction of the game is the animals and habitats, not the human efforts to capture and enclose. Zoos are not new or modern arks. Habitat protection and enrichment is the only ark nova that can work. Calling a zoo builder \"Ark Nova\" is like saying zoos are the answer to saving animals in the future when the exact opposite is true. Species are going extinct every day because their habitat is being destroyed. Animals in zoos aren't really living lives anywhere close to lives in the wild. The hexagonal puzzle could have had any theme.",
    "timestamp": 1735513200
  },
  {
    "username": "ExplodingSnail",
    "rating": 4.0,
    "comment": "I'm not sure I get the hype for this one. After a few plays I feel that I have seen everything the game has to offer, especially as the play time is overly long meaning boredom often sets in before the end.\n\nThe huge deck of cards is a real issue, but not necessarily just for the reasons of RNG. Most of the cards are just dull and don't do anything of note bar granting some appeal points.\n\nAlso, there is zero theme here.",
    "timestamp": 1729288800
  },
  {
    "username": "HamsterByte",
    "rating": 3.9,
    "comment": "Engine Builder",
    "timestamp": 1726956000
  },
  {
    "username": "magicfreak39178",
    "rating": 4.0,
    "comment": "Not a fan of eurogames, this one is only slightly better than most, and it takes a long time to play, so not worth it for me.",
    "timestamp": 1726869600
  },
  {
    "username": "Doctor_Krieg",
    "rating": 4.0,
    "comment": "There’s a decent design here, but I never want to willingly play it anymore.\nIt overstays its welcome on the table. It’s way too complex to engage with the game players who seem to find the theme awesome.\nI’d heavily recommend against ever playing 4 players. Even 3 is a bit much. But at 2 players… it is kind of “meh”.\nI love the theme and the idea, but that’s about it. I really wanted to like this one!\n(And yes I play and enjoy many heavy games, it has nothing to do with my ability to enjoy those)",
    "timestamp": 1726005600
  },
  {
    "username": "Darklord2160",
    "rating": 4.0,
    "comment": "other one of those card based engine builder, not my thing. long, super solitaire, everything like cards and boards are boiled down to icons and symbols, with ugly artwork on top.",
    "timestamp": 1725487200
  },
  {
    "username": "betasub",
    "rating": 4.0,
    "comment": "Ouf, beaucoup de mécaniques, j'appelle pas ça \"expert\" mais \"lourdingue\"!",
    "timestamp": 1724191200
  },
  {
    "username": "Nightservant",
    "rating": 4.0,
    "comment": "It was extremely fun for the first few games, but when you play more, like hit 30+ games, you will find this game very much luck-based and imbalanced. When you play with folks of closed skills, all that depends who wins is luck, the cards you draw. You will find the endgame targets are jokes as well.\n\nI've talked to experienced players on this game, many with 100+ even 200+ gameplays. All agreed on this.\n\nShould only play occaionally for fun, but seriously if you want true competition, forget about it. Gods decides who wins in this game but not your skills.",
    "timestamp": 1723586400
  },
  {
    "username": "ManEatingHippo",
    "rating": 4.0,
    "comment": "Wingspan meets Terraforming Mars with an action selection system where the actions becomes more powerful the longer you wait (lifted from another design). It's just fine. Not deserving of this stupidly high rating. I'm convinced that BGG is where democracy goes to fail. There is hardly any interaction in this game. I guess this game is for people that don't want to spend time with each other, but not interact, cause that's just gross and mean.",
    "timestamp": 1722981600
  },
  {
    "username": "iplaybgnaked",
    "rating": 4.0,
    "comment": "Alright multiplayer solitaire tableau building efficiency puzzle let down by the randomness of the bloated deck. For as big of a game it appears it is much smaller in practice as playing it in the optimal way is constrained by the cards, it is very much a \"cards play you\" instead of the reverse type of game forcing the player to parse the best course of action based on what's in hand and available publicly which is usually disappointingly obvious with little tension or difficulty in determining the best choice. This is further made worse by the massive deck with an odd distribution of symbols and combo synergies combined with the little means of combat the luck of the draw within the time frame of the short race between the players makes the whole experience too influenced by the luck of the draw to be enjoyable, especially for a game of this length.",
    "timestamp": 1722636000
  },
  {
    "username": "Jiggle Miser",
    "rating": 4.0,
    "comment": "probably a 10/10 gameplay\nbut a 1/10 artwork.\nI guess im just really surprised such a successful prolific game has made no attempt to create anything resembling passable game art. Just shockingly poor effort.",
    "timestamp": 1720216800
  },
  {
    "username": "xbluejayx",
    "rating": 4.0,
    "comment": "Good concept. Lots of variations of cards available for chaining. However, it feels rather saturated at the same time. From the card saturation, there is more down time and feeling stuck. The game just stalls per lack of personal resources almost 35-40% of your game turns. The game does feel like multiplayer solitaire. I will most likely purchase if a “Ares Expedition” variant of Ark Nova surfaces soon. Too much down time at 4 players in between turns. Overall, the juice isn't worth the squeeze with this title.",
    "timestamp": 1718575200
  },
  {
    "username": "Golden Aegis",
    "rating": 4.0,
    "comment": "Far too multiplayer solitare for me.",
    "timestamp": 1717279200
  },
  {
    "username": "tursel",
    "rating": 4.0,
    "comment": "Not for me. Too long for a very solitaire game and the cards involved too much luck. Great theme. Visually ugly.\n\nGave second chance: The experience was more pleasant, but I think I've seen enough.",
    "timestamp": 1716588000
  },
  {
    "username": "rhyeen",
    "rating": 4.0,
    "comment": "I just don't get the appeal. For how long of a game it is, it's engine is really weak. There's less interesting synergies that create satisfying combos and more just stacking of passive benefits. I didn't feel like I was playing a game. I felt like I was just taking my turn. The best strategy seemed to be just do the thing that was currently the best thing to do. Nothing felt weighty. Nothing felt interesting. It was just a huge board of knobs and switches.\n\nI'm sure if I played it more, some of the nuances would start to come out, but why bother? It's just a long drawn out game, and there are more interesting games out there with similar time and complexity, this one just doesn't have room in my heart for it.",
    "timestamp": 1716156000
  },
  {
    "username": "TeamAbsolute",
    "rating": 4.0,
    "comment": "Some clever ideas here, but also a lot off elements that I don’t like - too long, too solitary, too random, too many separate mechanisms, too much of a table hog.",
    "timestamp": 1715378400
  },
  {
    "username": "gatchaman",
    "rating": 4.0,
    "comment": "Ark Nova is a game that seems to reach the logical conclusion of thinking that more systems are better in a game. So there are more interlocking systems, more paths to upgrade, and more different effects all crammed into the game. I don't think it's a good game just because there's a lot going on. Ark Nova applies that logical conclusion to the multiplayer solitaire, no-interaction school of games.\n\nI don't like when in a game I want to do something, but to do it, I have to do this other thing I don't care about, just to upgrade another piece, which lets me advance on a different track, which will give me a token I need to do the thing I actually want to do. Obviously a game can't just let you do whatever you want, but I dislike when I have to jump through a bunch of separate, interlocking hoops just to get to the one interesting action.\n\nI see some describe it as an engine-builder, but it didn't feel like one to me. You're advancing on all these different tracks, but you're not really able to do more powerful things as the game goes on, you just keep advancing on different tracks.\n\nOur game took 3.5-4 hours with four players and teaching the game, but we were also rushing through our turns and forced the end game early. I'm pretty surprised that the typical recorded play time here on BGG is only 100 minutes -- I'm guessing that's a predominance of two-player games. It's really long.\n\nI kept hearing how much better the game is when played online. I don't want a game that's good to play online, I want to play a game that's good in the format that I'm playing right now, which in this case is physically.",
    "timestamp": 1714428000
  },
  {
    "username": "theaudsmustbecrazy",
    "rating": 4.0,
    "comment": "Not sure why this game is so highly rated. 8.5? There's nothing new or innovative about the mechanics of the game. I like animal themes, but I don't like this theme because you're putting wild animals in small caged areas. Even if I liked that aspect (which I DON'T) you're just putting the cards in front of you. The board (your zoo) doesn't look nice at all. And the producer didn't put much money into making quality pieces. Also, there is too much on each card, too much to keep track of. I LIKE heavy games. My favorite games range around 4/5 in complexity. But I don't like a game that seems to have tons of different ways of scoring thrown into it, just to make it bigger. That doesn't increase the ability to hone your skills and play using strategy. All it does is make you have to learn a ton of rules. I didn't think the gameplay in this was worth the hype, the time, or the money.",
    "timestamp": 1712700000
  },
  {
    "username": "AndryWhite",
    "rating": 4.0,
    "comment": "Probably good optimization frankenstein game, zero theme, best for 1-2, almost no interaction. Closer to Underwater city than to TM. I have no interest at all. Not my cup of tea.",
    "timestamp": 1712095200
  },
  {
    "username": "nefelia",
    "rating": 4.0,
    "comment": "Too much information!! It burned my brain\n( maybe it was of the late hour that it played)",
    "timestamp": 1711407600
  },
  {
    "username": "niemivh",
    "rating": 4.0,
    "comment": "If your only complaint of Terraforming Mars was that it was too interactive between players, then this is the game for you.",
    "timestamp": 1710025200
  },
  {
    "username": "Zomerdromen",
    "rating": 4.0,
    "comment": "Too dry for my style. Don't like the artwork nor the competitiveness of the game. Misses the actual fun feeling of building out a cool zoo.",
    "timestamp": 1708729200
  },
  {
    "username": "Wrecktangled",
    "rating": 4.0,
    "comment": "The decisions around card draw are baffling to me. The deck is massive and there few ways to mitigate the luck of the draw. This is compounded by the aggressively tight hand size of 3 cards. Get an end game scoring bonus in the early game? Too bad, basically useless to you. Your opponent gets a card that lines up with their strategy or the end game goals, too bad they score 6-12 points. All that being said, the core of the game is quite fun. Building your zoo and the action selection mechanism is great and very fun. I do wish the upgraded cards felt a bit more strong though as well.",
    "timestamp": 1707519600
  },
  {
    "username": "jaceycole",
    "rating": 4.0,
    "comment": "Did not enjoy my first play. Too long and too many systems which dilute the actually interesting decisions. I think would be better as a card game. If you like games like Wingspan and Everdell I think you'd like this. However, I actively dislike both those games and this one joined the club. I think engine-building tableau builders are best when they're quick-playing and not bogged down in extraneous systems, i.e. Race for the Galaxy. I prefer a tight tactical contest to one of trying to find a unique strategic path.",
    "timestamp": 1707087600
  },
  {
    "username": "Tribox",
    "rating": 4.0,
    "comment": "I do not see the charm in this game. Feels very dry.",
    "timestamp": 1706396400
  },
  {
    "username": "TranMBao",
    "rating": 5.0,
    "comment": "Too heavy, easy to get stuck mid game.",
    "timestamp": 1762470000
  },
  {
    "username": "ThatScar",
    "rating": 5.0,
    "comment": "Action cards and score track are great but the game lacks a social aspect and I'd rather spend my time with friends in so many other ways, like playing Earth or simply chatting is preferable.",
    "timestamp": 1761951600
  },
  {
    "username": "mbick",
    "rating": 5.0,
    "comment": "Rated accordingly for multiplayer solotaire",
    "timestamp": 1761084000
  },
  {
    "username": "mark_c",
    "rating": 5.0,
    "comment": "Multiplayer solitaire.\nOne for min/maxers who like minutiae of puzzle solving rather than a fun game.\nWith increasing player count it becomes more unbearable especially if one or some have an obsessive attention to detail.",
    "timestamp": 1759615200
  },
  {
    "username": "toorwell",
    "rating": 5.0,
    "comment": "Just Another Soulless Euro.",
    "timestamp": 1758924000
  },
  {
    "username": "Gilnoir",
    "rating": 5.0,
    "comment": "I can recognize a good game in this, but it's not for me. The game has some finicky parts and is rather complex for what it offers. The complexity I'm fine with but I absolutely abhor the scoring system.",
    "timestamp": 1758664800
  },
  {
    "username": "sircoolio",
    "rating": 5.0,
    "comment": "map are nopt even at all, helps to play all on same map,and the only way to win with good players is to sit at 99 points and prep for bonus turn with 5x tokens, yawn, you have to do this if you want to be very good, there are some very busted cards and some really bad cards that rng can really do damage or make someone very lucky without much mitigation",
    "timestamp": 1757368800
  },
  {
    "username": "Olds_Cool_Games",
    "rating": 5.0,
    "comment": "Just not fun to play. Tried it so many times. You cant really achieve what you want, you're forced to just play the way the game decides. Not my style of game.",
    "timestamp": 1757109600
  },
  {
    "username": "FenMan",
    "rating": 5.0,
    "comment": "Having owned/played 1000+ games, this was one of fastest to leave our collection after five or six plays. Not a bad game, just nothing we hadn't seen done better elsewhere. No \"there\" there. Also perplexed by current 3.79 complexity rating. If that's all that stopping you from checking this out, we thought this was much lighter than comparably rated games such as Bitoku or Praga Caput Regni, more like a mid-weight 2.80.",
    "timestamp": 1754863200
  },
  {
    "username": "BeloW06",
    "rating": 5.0,
    "comment": "Gave this another chance (4p again) and it confirmed my distaste for what I hate in other card-driven engine builders: the luck of the draw can favour one player and screw others over.\n\nThe winner started up with a great combo in hand, with the action cards being in the right spot to get the combo out on turn 1 and 2, then raking in bonuses while everyone else was trying to escape feeding his engine.\n\nI started with herbivores (+2 coins for him each), tried to draw to get other options but only got one shot unjointed stuff and 1 shot low key supporters, which didn't help me getting anything going. Meanwhile on the other side of the table, a nice engine was coming together quite easily with card draws adding powerful synergies I did't have a chance to acquire. The conservation cards all had icons that didn't match what I had access too, so I had to dig for green cards too while again, the intial ones were aligned with what the winner was able to draw blindly from the deck. There were possibilities for my cards to shoot to the moon too, but nothing came out that did so, while it kept coming for the other player without the others having to do similar things.\n\nThe winner ended the game with something above +40, getting himself extra bonus scoring cards and whatnot on the way while the rest was left in the dust with -10 and more in the red.\n\nI don't need to put myself through a game like that again. (PS: The other 2 players didn't play before, so I don't know if it was experience or lack of powerful options that held them back).",
    "timestamp": 1753567200
  },
  {
    "username": "Jamielannister1",
    "rating": 5.0,
    "comment": "Very nish taste and its not very amusing if you are not into animals …",
    "timestamp": 1752876000
  },
  {
    "username": "Nightyblade",
    "rating": 5.0,
    "comment": "Played it one time, but the topic, mechanics, and game time, didn't catch me. Maybe I had too high expectations. Overall, the zoo topic is perilous, and it's easy to downplay the bad sides. And they did.\n\nI guess \"Take it or leave it\" described it well.",
    "timestamp": 1750629600
  },
  {
    "username": "Mageknight12",
    "rating": 5.0,
    "comment": "Ark Nova is ambitious but bloated — excessive downtime, overwhelming iconography, and a long runtime make it drag. The engine-building can feel solitary and overcomplicated for what it delivers.",
    "timestamp": 1750456800
  },
  {
    "username": "s-man",
    "rating": 5.0,
    "comment": "Technically well designed but rather soulless game that is clearly indebted to Terraforming Mars. It takes way too much time to render not even half as much excitement.",
    "timestamp": 1749852000
  },
  {
    "username": "The Deliberate",
    "rating": 5.0,
    "comment": "This game plays like a smash-up of the mechanics of Barenpark, Civilization, Wingspan, Terraforming Mars, and Rajas of the Ganges all crammed into one game, but with none of the character of any of those games.\n\nArk Nova's defining feature is that it is sprawling, both physically and mechanically. I mostly feels like I was just operating a big complex machine rather than making interesting thematic decisions. The artwork is all stock photos, some of which have an \"artsy\" photoshop effect on them. Gameplay is slow and long, and success seems highly determined by luck of the draw.\n\nThe theme effects of animals are pretty lame, for instance predators like to have more predators around... why? Or porcupines like digging, so you can discard cards from the market row... it's all a bit of a stretch. One of my biggest gripes is that the animals you are personally interested in adding to your zoo are often just incompatible with how your zoo scores points. So you are constantly forced to add things to your zoo that you're not really that excited about.",
    "timestamp": 1749506400
  },
  {
    "username": "Honest",
    "rating": 5.0,
    "comment": "Was a much hyped game. I liked it, but it dragged a little, and comboed off a little too much for my liking at the end, meaning the down time extended to the point of being a negative play experience. It is good, and my partner LOVED it, but not for me (at least not often)",
    "timestamp": 1748988000
  },
  {
    "username": "kilianbognar",
    "rating": 5.0,
    "comment": "Typical bloated modern euro with a cool theme but awful graphics. But seriously: would it be so hard to use actual illustrations instead of slapping a garbage filter on obvious stock photos? Sure, real art costs more, but this just ends up looking incredibly cheap. Not that I’d enjoy the gameplay anyway, but this choice baffles me.",
    "timestamp": 1748556000
  },
  {
    "username": "werekin",
    "rating": 5.0,
    "comment": "Overstuffed simulation of collecting wild animals. The overabundance of bonuses from unlocked resources and missed triggers is totally obscene! The end game scoring system is bizarre, the hidden objectives do not balance, card types for non-animals require clarification and yet the action selection process is rewarding enough that the overall clunkiness is forgiveable. Unconvinced by the amount of zookeeping activity on display here! Far more presentation effort went into the player board and puzzle pieces than hashing together the card deck. Unless they are being ‘snapped’ up from the meagre display row, players are at the mercy of cycling through random draws of seemingly unplayable cards... It’s not quite as bad as that since the glut of cost modifiers, bonuses and residual income payments do make unaffordable prospects suddenly more realistic!\n\nArk Nova involves placing tiles and cards then resolving their effects but the game relies on cycling through plenty of cards, so that is what the game is chiefly about. Success mainly seems to rely on displaying a broad collection of animal types and maximising that track in the centre of the board.\n\nThe downtime with 4 players is chronic. If turn activity was less involved, then it would be more bearable. As it stands, I would only be willing to play again with 3.\n\nWhen I play this again somebody will presumably get to cage the elephant.",
    "timestamp": 1746741600
  },
  {
    "username": "Wolkster",
    "rating": 5.0,
    "comment": "Too long and boring with 3 players. Traded way.",
    "timestamp": 1745618400
  },
  {
    "username": "FunkyDog358",
    "rating": 5.0,
    "comment": "Cool game, but not interesting enough to pay much attention to it.",
    "timestamp": 1743976800
  },
  {
    "username": "silenceisgolder",
    "rating": 5.0,
    "comment": "It's fun to puzzle through and try to find efficiencies in the hurricane of randomness. Well ... it's fun to do that solo on BGA for 45 minutes. I am not sure if I would like this in a setting where the games go on for several hours and there's no computer helping me remember to resolve all the little abilities and effects.",
    "timestamp": 1743717600
  },
  {
    "username": "George_kovo",
    "rating": 5.0,
    "comment": "Prefere teraforming mars\nIt has too many restrictions on cards so you end up building what you can get instead of what you want\nPlayed it second time man the game is messed up.still not a bad game tho for those who like the theme",
    "timestamp": 1743202800
  },
  {
    "username": "ThinkingThatsAll",
    "rating": 5.2,
    "comment": "Maybe it is my fault for listening to the hype and not the game reviews, but this game is nowhere near as good as Race for the Galaxy or Terraforming Mars. Yes, all three games feature a giant deck of cards, but Ark Nova does not put enough focus on the deck. I spent most of the game dealing with special placement, worrying about resources, managing action wax and wain, and sweating the maximum hand size. I prefer the purer engine builder.",
    "timestamp": 1743116400
  },
  {
    "username": "TheWrongTrousers",
    "rating": 5.0,
    "comment": "There's just maybe a bit too much going on here for my AP-prone brain. Your bonuses have bonuses, and the constant sifting through the giant deck of 3 types of cards can be a bit over overwhelming as to developing a strategy. The cards are jam-packed with icons which are all you will see before long. CivNewDawn's action system and the bi-directional scoring track are the standouts, but the game never quite gets fun for me.",
    "timestamp": 1742598000
  },
  {
    "username": "royu",
    "rating": 5.0,
    "comment": "2025-03-07\nNot my type of a game. Very long, large on table, random, boring soltaire. Need for tracking multiple cards. 5/10",
    "timestamp": 1741474800
  },
  {
    "username": "kyhre",
    "rating": 5.0,
    "comment": "I’m happy to have finally been invited to play this canonical game. The various disparate systems work well together; the behemoth of a deck befuddled our attempts at long-term planning, making us jettison plan after plan an scramble to steer our zoos in a better direction; the iconography was overwhelming and yet remarkably clear.\n\nAs a non confrontational two player game I can see an attraction here.\n\nThis is just not my kind of game.\n\nAlso, our three player game took five hours, and I think we were playing at a good clip. It’s just too much.",
    "timestamp": 1741042800
  },
  {
    "username": "HowitzerBug",
    "rating": 4.5,
    "comment": "The deck is too big and too random for any kind of strategic planning - and trying your luck is just useless. I did not enjoy.",
    "timestamp": 1739919600
  },
  {
    "username": "XendoBreckett",
    "rating": 5.0,
    "comment": "It's alright. Way too much downtime. Way too much thinking about things that you can't really do anyway. But I would play again maybe.",
    "timestamp": 1739574000
  },
  {
    "username": "CharlieMnemonic",
    "rating": 5.0,
    "comment": "Didn’t click with me.",
    "timestamp": 1738105200
  },
  {
    "username": "vinniebrasco",
    "rating": 5.0,
    "comment": "Not sure why this is rated so high, Game is Ugly for money and graphic like sponsorships and the board tracks, it's just really ugly, even zoo boards are ugly. Coffee break thing and hand limits not fun, scoring is awkward. I had the real world best animals you want to see in a zoo and it don't matter. I only played 3 times and always 3 -4 players , won once, it was not that satisfying.\nI guess I would play if others wanted to but there are far better games for the time commitment. One I am glad I didn't shell out the unreasonable high price for considering the bland bits.\nIt's a never own game for me",
    "timestamp": 1737846000
  },
  {
    "username": "sambalamaento",
    "rating": 5.0,
    "comment": "BGA",
    "timestamp": 1737846000
  },
  {
    "username": "jdvanwijk",
    "rating": 5.0,
    "comment": "Full review: https://boardgamegeek.com/thread/2931077/ark-nova-mixed-revi...\n\nArk Nova could have benefited from more streamlining in its earlier stages of design. As a player, I wish the designer had asked himself earlier: are all these parts in themselves interesting enough to develop further? Are all these parts really necessary? With some more time spent on tightening up the game, I think the designer could have come to more satisfying results.",
    "timestamp": 1737154800
  },
  {
    "username": "LittleLamb4u",
    "rating": 5.0,
    "comment": "The game is fine for the ridiculous love it gets. The card drawing is the majority of the game and if you draw poorly you have to rinse and repeat until you get a better hand. I'd play it but would not seek it out.",
    "timestamp": 1736550000
  },
  {
    "username": "GJanse",
    "rating": 5.0,
    "comment": "Meh. May plays, I don't get the hype. It is very simple.",
    "timestamp": 1736463600
  },
  {
    "username": "CinnamonRed",
    "rating": 5.0,
    "comment": "Too much luck for me.",
    "timestamp": 1735340400
  },
  {
    "username": "PhilSchwarzmann",
    "rating": 5.0,
    "comment": "Too heavy and too solitaire for me.",
    "timestamp": 1735254000
  },
  {
    "username": "apuity",
    "rating": 5.0,
    "comment": "Game direction clear at a glance, with seemingly a few optimal paths forward (e.g. double continents)",
    "timestamp": 1735081200
  },
  {
    "username": "Yaktala",
    "rating": 5.0,
    "comment": "Okay Game - overhyped in my book",
    "timestamp": 1734908400
  },
  {
    "username": "Fundle",
    "rating": 5.0,
    "comment": "like it",
    "timestamp": 1734130800
  },
  {
    "username": "setropo",
    "rating": 5.0,
    "comment": "ECDE #41",
    "timestamp": 1733353200
  },
  {
    "username": "bucklen_uk",
    "rating": 5.0,
    "comment": "I can see why some (many) people love this with the personal player mat, engine building and personal upgradable mini action rondel.\n\nFor me, not so much. It’s a bit too abstract, most of the cards have effects but in many cases you'll have to reach to find the thematic connection. At the end of the game I’ve scored points, had some clever card plays and (hopefully) solved a tactical efficiency puzzle. However I don’t feel I have a story of a zoo to tell.\n\nThe tactical nature also falls more on the game plays you side of the scale too. You can’t really go in with a plan. Sure your unique player board can set a rough direction but you are quite at the mercy of your starting hand, and the starting conservation cards, and then taking the opportunities the cards present.\n\nFinally there is a rich get richer snowball effect - when things just fall into place and the cards fit it is smooth and exponentially efficient and if it doesn’t you can flail around failing to generate enough cash or unlock enough workers. The upgrading mechanisms make this disparity more acute. Some games it feels satisfying and others a slog.\n\nOverall mildly frustrating with the big random deck. Maybe a draft at the start to get your final 4 starting cards would help, but that would lengthen the game further.\n\nYeah I’d play if you wanted too (but there’s too much iconography and interconnected efficiency mechanisms for me to want to teach and play with new players all the time). No desire to own.\n\n**** Update, Played again. opinion has solidified, just not enough thematic connection for me, add in a quite a bit of input randomness and this is not something I'd rush to play again (but I'm in a minority). Rating dropped. I suspect if forced to play again the rating will drop further.",
    "timestamp": 1733094000
  },
  {
    "username": "Numlock1970",
    "rating": 5.0,
    "comment": "Carlton epi.",
    "timestamp": 1731711600
  },
  {
    "username": "Pandemonium135",
    "rating": 5.0,
    "comment": "Most overhyped game out there. A mess is a good word to describe it. The theme is the only saving grace. There are many many euros out there that are better.",
    "timestamp": 1730502000
  },
  {
    "username": "NIG_WAFC",
    "rating": 5.0,
    "comment": "JC",
    "timestamp": 1730415600
  },
  {
    "username": "willbeplayin",
    "rating": 5.0,
    "comment": "Ark Nova is a game I should like. But in the end it's a mess of symbols left and right with lots of luck-of-the-draw. Every game of it has been a frustrating slog, with me hoping the game would end much faster than it does.\n\nThe expansion just adds more stuff into an already bloated game. I have no idea how this is even in the Top 10 of all time. Overrated.",
    "timestamp": 1730242800
  },
  {
    "username": "LiquidJaeger",
    "rating": 5.0,
    "comment": "I think I've never been this disappointed with a game before. Was expecting so much from this due to the hype and the theme. It was the first play so there is a chance my opinion will change after future plays.",
    "timestamp": 1730242800
  },
  {
    "username": "Matjillam",
    "rating": 5.0,
    "comment": "You mostly play your own solitaire game. And the flow of cards feels kinda overwhelming for me.\n\nThere's just an endless river of cards flowing down the main board and you constantly have to evaluate every card to see if it does anything for you. Only to see them flushed out a moment later. So.... many.... cards....\n\nTo me it's just a card information overflow solitaire with so many possibilites that it feels like trying to swim in a grain silo.\n\nI don't know, it just doesn't hit right for me. I never feel like I get a nice machine up and running because of the constant flow of cards. And I never feel like I can really flush out a strategy, since the available cards always sets the limits anyway. So most of the time you just try to play the best cards available while hoping that certain types of cards show up for you to grab.\n\nI like the heavy games. But to me Ark Nova is just heavy in a frustrating way.\n\nIt's a fine game, but to me it's not a top 100 at all.",
    "timestamp": 1729375200
  },
  {
    "username": "turaglar",
    "rating": 5.0,
    "comment": "As for me I think this game is overrated. The theme is not really my favourite, but also majority of the advanced cards has very expensive requirements, reducing the late game for increased luck.",
    "timestamp": 1729116000
  },
  {
    "username": "skyglow",
    "rating": 5.0,
    "comment": "I really don't understand why this game is so highly rated. In our experience, it takes a long time to play and is so swingy that often you're just going through the motions until the person in front can officially win. We've re-read the rules several times to see if we're doing something wrong, but as far as we can tell, we're playing it correctly.",
    "timestamp": 1728684000
  },
  {
    "username": "Stygran_Gamer",
    "rating": 5.0,
    "comment": "Deep Euro Game that adds so much to the salad to lose its own game identity. The game takes pride into having a massive deck of unique animals and not having a single card repeating, however this would favour the players that start with a combo in their hand rather than other players who need to go through a few hand washes to see something useful for their combos. Being cards unique between each other, you risk spending the whole game searching for combos while you see the lucky players striving. Just play dice at this point.",
    "timestamp": 1728252000
  },
  {
    "username": "davidfauthoux",
    "rating": 5.0,
    "comment": "Race games are not for me",
    "timestamp": 1727820000
  },
  {
    "username": "jkasanen",
    "rating": 5.0,
    "comment": "Not for me, too much hassle and a bit too ambiguous card powers at places. Especially too long for the fun of it.",
    "timestamp": 1727042400
  },
  {
    "username": "janglemangle",
    "rating": 5.0,
    "comment": "fun theme, fun action system, some gripes, but will play more to see if i like it\n\ninterested in playing again with the house rule \"The Elephant in the Room\" where if an elephant shows up, all players must acknowledge that an elephant is now in the room.",
    "timestamp": 1726351200
  },
  {
    "username": "naootje",
    "rating": 5.0,
    "comment": "My main issue with the game is that (depending on the cards you have) there is a lot to keep track of. Also, you have to play with what you get; no planning ahead. It is also quite long.",
    "timestamp": 1726264800
  },
  {
    "username": "neatbender",
    "rating": 5.0,
    "comment": "It is a \"classical\" tableau-builder, less engine than Terraforming Mars, but more with relativity between cards. Overall it's a solitaire game with elements of \"take that\" and some cards have a bit of a negative effect on others, but equally, thus you don't have to pick a \"face\" to cause negative effects. Ark Nova negative cards do barely any meaningful harm. Some cards are without doubt better at the start and some are better late game. Terraforming Mars's core element is the imbalance in cards and evaluation of them. Here you just have to consider the requirements to be played and which achievement cards you work for. Note you cannot keep more than 3/5 cards you want to play, which is an elegant way to stop hoarding cards, but doesn't give you that imbalanced/cheating feeling that Terraforming Mars does. The Mars board is an area majority game, is completely missing in this game, you can puzzle your zoo and that's it.\n\nRecommended for players who are looking for a peaceful alternative to Terraforming Mars, yet still like a random card draw fest, the player with the better card will always win just like in Terraforming Mars (if played correctly)\n\nIs it fun to build a Zoo? Yes, it is! You can play it 1-4; it doesn't matter much!",
    "timestamp": 1725660000
  },
  {
    "username": "Duke_Rufus",
    "rating": 5.0,
    "comment": "Too much zoo. This game sucks, bro.",
    "timestamp": 1724968800
  },
  {
    "username": "energythief",
    "rating": 5.0,
    "comment": "Got it for $10 at Calendar Club!",
    "timestamp": 1724364000
  },
  {
    "username": "MissP1ggy",
    "rating": 5.0,
    "comment": "Love the theme, the mechanics and how the game looks. A multiplayer game, especially with 3 takes a lot of time. The solo puzzle takes 27 turns, it is entertaining and plays in about an hour.\n\nDutch rules summary: https://boardgamegeek.com/filepage/239335\n\nEnglish rules summary: https://boardgamegeek.com/filepage/232702/ark-nova-plain-and...",
    "timestamp": 1724191200
  },
  {
    "username": "DanBakitus",
    "rating": 4.5,
    "comment": "If this wasn’t animal/zoo themed, I’d never want to play again. Love the theme, but symbology was more complex than it seemed like it needed to be. Only played once, and I’m sure multiple plays would help, but highly prefer Terraforming Mars: Ares Exp. at this point.",
    "timestamp": 1723932000
  },
  {
    "username": "KAR42",
    "rating": 5.0,
    "comment": "Its a lot, very crunchy game but without the satisfaction of telling a wonderful story or constant fun interaction with friends... maybe engine building isn't for me.",
    "timestamp": 1723932000
  },
  {
    "username": "sdompi",
    "rating": 5.0,
    "comment": "Beaucoup trop long à plus de 2 joueurs. Surtout interessant en solo.",
    "timestamp": 1723759200
  },
  {
    "username": "Burnhack",
    "rating": 5.0,
    "comment": "Not my type of games heavy-euro fans only.",
    "timestamp": 1722895200
  },
  {
    "username": "kiwipaul",
    "rating": 5.0,
    "comment": "OK, liked it but nothing more",
    "timestamp": 1722463200
  },
  {
    "username": "FourthPartial",
    "rating": 5.0,
    "comment": "Honestly, it's alright, but it's overrated. The layout is cumbersome, the scoring rubric is frustrating, and there are wayyyyy too many cards. It feels like luck most of the time and it doesn't hold my attention.",
    "timestamp": 1721858400
  },
  {
    "username": "Duke_Muell",
    "rating": 5.0,
    "comment": "Have to play it but i am really dislike the artwork....looks like a REWE sticker album.",
    "timestamp": 1721512800
  },
  {
    "username": "teaball",
    "rating": 5.0,
    "comment": "Too solitaire",
    "timestamp": 1719784800
  },
  {
    "username": "LeBao",
    "rating": 5.0,
    "comment": "multi-player is not very good, but solo mode is excellent\n\nI find the game rather kinda random, yes there's strategy, yes you could play around it, but letting your opponent win just because his card action card is in a better spot than u ? or he/she blindly draw 3 good card ? Not my cup of tea\n:\n\nthe more I play it, the more I loathe it, the grading went from 8 last year to 5\nthis year, my taste in gaming has changed quite huge in the past 6 months, if I want to find a low-interaction, combo-oriented, might as well play Seasalt & paper or Azul, this game is 1. too long, 2. too random for an euro-inspired game, and if I want to find a medium heavy euro game might as well play The Gallerist, Vinhos 2010 or Brass Birmingham, the RNG in this game just make me either, winning without satisfaction due to higher luck or losing since my opponent randomly draw a good map+ opening hand or draw a tie-breaker card.\n\nThis game is just not for me",
    "timestamp": 1717970400
  },
  {
    "username": "EugeneLiu49",
    "rating": 5.0,
    "comment": "not my cup of tea. I wanted to like it but I just couldn't. too much information on the cards. too much to keep track of . it is better to play this online than in person. but still i would rather play other games. sold.",
    "timestamp": 1717365600
  },
  {
    "username": "Erik_G",
    "rating": 5.0,
    "comment": "It's on theme, and pretty solid frankly. But sorry BGG, I don't agree that amount of moving parts in your Rube Goldberg machine game = amount of fun, interest, or replayability.",
    "timestamp": 1716588000
  },
  {
    "username": "leantong",
    "rating": 5.0,
    "comment": "这不就是主要看随机的毛线游戏么！14分结束获胜。",
    "timestamp": 1714860000
  },
  {
    "username": "BigG1989",
    "rating": 5.0,
    "comment": "It's Ugly which for a game of this theme is a travesty, the box is crap to sort out and it doesn't an experience that can't be got in previous games",
    "timestamp": 1714600800
  },
  {
    "username": "angelkurisu",
    "rating": 5.0,
    "comment": "Great presentation/theme, elevates somewhat clunky map mechanics and bland card abilities. The scoreboard mechanic is neat.",
    "timestamp": 1713823200
  },
  {
    "username": "JimmyMarchy",
    "rating": 5.0,
    "comment": "Far too complicated but a great idea if you used to love Zoo Tycoon",
    "timestamp": 1713736800
  },
  {
    "username": "purplecow55",
    "rating": 5.0,
    "comment": "Borrowing from Civilization: A New Dawn action selection, where the position of the action determines how strong of an action can be preformed, this engine building feels a lot like terraforming mars.\nUnfortunately, this game involves more fishing.\nThis game reminds of a heavier Everdell.",
    "timestamp": 1712872800
  },
  {
    "username": "Vismeep",
    "rating": 5.0,
    "comment": "Simon",
    "timestamp": 1712786400
  },
  {
    "username": "Dziadko",
    "rating": 5.0,
    "comment": "This game have some interesting mechanics, I really enjoyed actions strength mechanism for example but... This game is just boring, in opponents turns nothing happens that would make you involved, it just doesn't matter, every one is playing his own game, and at the end we check final score. I imagine it could be a very good Solo game, but it's not what I'm looking for in the games.",
    "timestamp": 1711922400
  },
  {
    "username": "Rudbeckia144",
    "rating": 5.0,
    "comment": "I guess I'm in the minority here, but I think it's just an OK game. It doesn't really ignite a spark in me, but I can see why it's so hyped. Just like in Terraforming Mars, there are a lot of stuff going that you have to keep track of, although I find myself less engaged in this particular game. The artwork is even more terrible compared to TF and I think it's just lazy to use stock photos like that.\n\nI was honestly hoping that I'd enjoy this game more than I do, but I'll probably just stick with Terraforming Mars.\nHowever, I must add that my only experience with this game is through BGA. Perhaps I'll get a different impression if I get to play a physical copy.",
    "timestamp": 1711666800
  },
  {
    "username": "Yokiki",
    "rating": 5.0,
    "comment": "I can see that it's a decent puzzle. I can respect it. I just don't enjoy it. The art doesn't really draw me in, the puzzle isn't particularly fun, and the game goes on too long with a high player count.",
    "timestamp": 1710198000
  },
  {
    "username": "resonance2k",
    "rating": 5.0,
    "comment": "A chimera-like game that connects elements of various famous games. Yes, there are many elements, but the game is lackluster and each element is inorganic and overly systematic. I like TCGs, but the combos are much more interesting in specialized games. It's a well-made set, but I prefer the specialized games. The game is satisfying enough if you don't have much experience or if you are a multi-tasker who wants to do many things at the same time.",
    "timestamp": 1708815600
  },
  {
    "username": "kikiam20",
    "rating": 5.0,
    "comment": "This game is equivalent to Cones of Dunshire.",
    "timestamp": 1708038000
  },
  {
    "username": "Nesrie",
    "rating": 5.0,
    "comment": "Love the idea but the mechanics are a bit wonky, the habitats or tracking the animals in them is lacking and you can wind up with a really boring track of cards to pull from.",
    "timestamp": 1707606000
  },
  {
    "username": "Anyone for cricket",
    "rating": 5.0,
    "comment": "I enjoyed the initial exploration, but for me, the eyes-down, no interaction tableau builders are losing their appeal.",
    "timestamp": 1707260400
  },
  {
    "username": "BradJacobs",
    "rating": 4.5,
    "comment": "Ark Nova is not my type of game - I don't enjoy games with little to no interaction, and for reference I spend my veto power on Terraforming Mars whenever friends propose it.\n\nSo it's no surprise Ark Nova isn't my cup of tea either - the game is very solitaire and luck of the draw dependent. I don't like that there's basically no interaction except competition for cards, and some animals with \"take that\" effects.\n\nA lot of the goals depend a lot on your draws and what you have available - through no fault of your own, you might find yourself unable to compete on the secret objective category.\n\nIn a certain way, the game doesn't do anything new that we haven't seen before, except perhaps the scoring mechanism which is interesting in that you want to wait until the right opportunity to explode and be able to get the most points. Yet the mechanisms mingle well, it's satisfactory to play, and surprisingly, the game was pretty straightforward to learn when being taught (I didn't have to learn from the rule book, though I heard complaints).\n\nIt's a nice puzzle with good ideas mingled together. Based on that alone, I'd be willing to play again, despite how much I actively dislike the multiplayer solitaire genre. Even accepting, beforehand, that a lot of it depends on the luck of the draw.\n\nThe theme and artwork are meh for me. I'm nor really fond of animals or zoos for that matter.\n\nBeing realistic, this will never be on my list to play given other choices. But I guess the best compliment I can give to this game is that, given the opportunity, I probably wouldn't spend my veto power on it either.",
    "timestamp": 1706742000
  },
  {
    "username": "honk3d",
    "rating": 5.0,
    "comment": "+1 np",
    "timestamp": 1705964400
  },
  {
    "username": "cantbelikewater",
    "rating": 5.0,
    "comment": "In short this is \"is it my turn yet?\" the game. The core game mechanic is taking one of five actions, each action becomes more powerful the less you use it, so players need to manage when they play specific actions. These actions help you build up a zoo gaining points on a conservation track, and on an appeal track. Both tracks increase towards each other's starting position going in opposite directions. The object of the game is to score the greatest difference in points after the intersection/cross of both tracks.\n\nThe mechanics work well giving you options and control, yet still requiring the puzzle of tradeoff decisions. However there is little interaction, so the game is the quintessential multiplayer solitaire. For the amount of play time, the opportunity cost is too much for me, I'd rather play terraform mars or wingspan in half the time, then another game.\n\n\nPros:\n------------\n1. The action core game mechanic is fun. The actions getting stronger when unused is an incredibly fun mechanic. It gives players a tradeoff decision on their turn, do you perform the action now, or wait for extra bonuses? It also allows players to plan ahead, as things are predictable, and rewards good planning.\n\n2. The ramp up time is quick. Some games you are limited in actions and understand how to build up the engine, but since the path is clear and determinate it feels very long till the gameplay starts to get fun. This game balances the control and options, making the ramp up feel quick.\n\n3. The break mechanic is very well done (explanation of mechanic in feels good). It gives players the freedom\n\n4. Getting bonuses is well done for pacing and gives player mini objectives to work towards. The game offers various bonuses from the conservation track, reputation track, association unlocks, and cards.\n\nCons:\n--------------\n1. This is the definition of multiplayer solitaire, there is no interaction at all. You never need to see what your opponents are doing aside from getting money/appeal when the place a unit, or seeing if they might take the card in the display or if they are competing against you for another objective. Your zoo is separate from everyone else's so you aren't incentivized to look at anything but your own (in terraform mars at least you are building the same world).\n\n2. Feels like there are too many game mechanics that are good for the game, but complicate learning the game (e.g. players need to discard one secret objective after one player hits 10 conservation, or players need to play 1 extra associate, if they have already performed an identical associate actions).\n\n3. Scoring. The tracks make it complicated, as once you cross tracks, you can no longer perform any actions. Players are incentivized to get as close to NOT crossing tracks, and then playing one more turn to cross tracks. Due to the limited options based on the cards you have, this can make the ending feel luck based. It's no longer who can score the most points, but who can get the tracks the closest without crossing, and then cross. This added layer complexity, though interesting, does not add to the game thematically or mechanically.\n\nFeels Good:\n--------------\n1. The break mechanic. Asking people \"are we going on break soon\", or \"I don't care I'm taking my break\" or even begging people to not go on break. This is fun to say, and do.\n\n*break mechanic explained*\nThere is a break track that triggers the \"end\" of the round, forcing players to reduce their hand and generate income. The break is triggered when the break track is completely incremented, it that gets incremented based on 2 actions (the number of spaces incremented can depend on what the triggering player chooses).\n\n2. Planning out your plan and executing. There is enough predictability where you can plan and execute. There's also enough control where you can pivot when things go bad.\n\n3. Even though there are many mechanics all of them work well together, and give you options.\n\nFeels Bad\n------------------\n1. Discarding your cards when a break hits. (Similar to rolling 7 in catan).\n\n2. Waiting for your turn. Because there's almost nothing other players can do to you, waiting for your turn is pointless, you don't care about what they do, as the worst they can do is take a card you want from the display, but there was little you could do to prevent or ramp up early to get that anyways. (Late game you can use the \"cards action\" early, or you can use the \"animals 2 action\" and play the card from the display, though at that point its an easy decision to perform the action earlier).",
    "timestamp": 1705446000
  },
  {
    "username": "pancor",
    "rating": 5.0,
    "comment": "I just don't get it",
    "timestamp": 1705014000
  },
  {
    "username": "tribefan07",
    "rating": 5.0,
    "comment": "I found this game just okay. It's very much a solo experience, with some incidental interaction as far as taking partner universities, cards, etc. But I just found that there wasn't much bite to the game. It's a very long, drawn out experience and I just found that it wasn't worth that much of my time. I found that maybe it had one or two too many mechanisms/variables to think about. Traded after one play.",
    "timestamp": 1704150000
  },
  {
    "username": "foolinjected101",
    "rating": 5.0,
    "comment": "It’s ok, I don’t get the hype.",
    "timestamp": 1703631600
  },
  {
    "username": "farkas18",
    "rating": 5.0,
    "comment": "To me, it feels a touch overhyped. It is by far not my fav. collection building euro. I like the design. There are some smart ideas involved. To me, it is a bit too much. I vastly prefer something like TM, or Wingspan over AN, just because the ability to mix and match difficulty to our mood. The game does not brake, it is enjoyable, but I could take it or leave it. If we have some better collection building game on the table, usually we leave it.",
    "timestamp": 1703545200
  },
  {
    "username": "thenmrkid",
    "rating": 5.0,
    "comment": "Used to like it, and the more I played it the more I realized I really didn't like it. Highly overrated and not worth the HEAVY time commitment.",
    "timestamp": 1703113200
  },
  {
    "username": "Sikko",
    "rating": 5.0,
    "comment": "Meh.",
    "timestamp": 1702940400
  },
  {
    "username": "fabericus",
    "rating": 5.0,
    "comment": "Fab'\nJuly 2022\nDecember 2023 Given away to BS (Xmass Present)\n1x 3 player game.\n\nHorrendously long and tedious.",
    "timestamp": 1702940400
  },
  {
    "username": "Urbanwatts",
    "rating": 5.0,
    "comment": "Overly long with too much luck involved. It's a fine game but not one I want to keep. I don't even see myself recommending it.",
    "timestamp": 1702249200
  },
  {
    "username": "Heroes84",
    "rating": 5.0,
    "comment": "Yeap, to many mini action after play a card and randomness in cards.",
    "timestamp": 1702162800
  },
  {
    "username": "Soobie",
    "rating": 6.0,
    "comment": "Rating: 6.0 for gameplay, 3.0 for art\n\nQuite boring and overall disappointing. There are other card-driven tableau building games (e.g. Underwater Cities), which provide a much more appealing experience for me.",
    "timestamp": 1762682760
  },
  {
    "username": "Xyt4n",
    "rating": 6.3,
    "comment": "PLAYED\n+ + map puzzle optimization play in combination with the cards is interessting and better than in Fest for Odin\n+ + I like the animal pictures. It is fun to see and collect them\n+ Some neat combo and optimization challenges\n- - - Interaction: Your typical euro multi solitaire game",
    "timestamp": 1762682400
  },
  {
    "username": "sparkgamer",
    "rating": 6.0,
    "comment": "Good game. However, I mainly played it at two with my spouse. We always felt like it was too long. Obviously, if we got better at the game that would improve, but for us, the lemon wasn’t worth the squeeze. Sold it to a friend who loves the game, so I’m happy it found a new home.",
    "timestamp": 1761951600
  },
  {
    "username": "banditwins",
    "rating": 6.0,
    "comment": "I see where the hype comes from, but for me, there were too many dead cards, and the game just felt slow. The teach is quite long as well. I could see this score going up with more plays.",
    "timestamp": 1761865200
  },
  {
    "username": "Paddouken",
    "rating": 5.5,
    "comment": "Can't understand why this game was hyped so much. In my opinion there are some mechanics in this game, that do make it more complex as it should be. The theme is a personel thing of cause, but the zoo building does not realy motivate me playing this game.",
    "timestamp": 1761519600
  },
  {
    "username": "adamredwoods",
    "rating": 6.0,
    "comment": "3 plays / 2, 4 players\n\nLIKE: I enjoyed the action selection, using power based on where the card was. This added a fun rotation management for the cards. I also enjoyed talking about the different cards, the effort involved in getting an animal was enough to add charm to the zoo being created. I also enjoyed the coffee-break mechanism forcing players to hurry to play cards to not be forced to discard-- although this aspect disappeared later in the game.\n\nDISLIKE: For 8 hours-- the entire first 4-player game-- I was looking up and explaining rules to others which took more total time than my actual turns. The rules had to be searched for in 3 to 4 areas: rulebook, glossary, errata, and BGG forums. Sometimes a rules was only explained in a small area in the rulebook, hidden by a wall of vast text (for example, animal release for a reptile house was covered in ONE example, yet not in the main rules as written.) Other issues I feel that detract from the game, is that the game is largely about what you can do with the random cards in hand, and if that path is not apparent, the slow, incremental actions in a turn adds to frustration. This minor issue can be remedied with a few plays, but should be noted for first-time players. Above all else, the game feels multi-player solitaire, which for such a long game is not for me. In our second play, we kept missing bonuses, which was annoying due to the small information on cards to keep track of.\n\nOVERALL: For me, I had a poor first play experience, it was a slow grind of interpreting rules and heads-down play. Second play was better, but I still have my reservations. Convoluted rules on random cards is just not fun for me. I feel the basis of any game is the accessibility to its rules, because scattered or fragmented rules leads to more time spent looking details up, explaining, and sometimes deliberating with other players. Ark Nova falls into this category. I could see additional plays, or an all-encompassing card glossary, creating a better playing experience, but I have 100+ other games that immediately offer better, faster experiences.\n\nI do feel I owe the game another try with 2 or 3 players may give the rating a small bump.\nEDIT: Much better with 2 players.\n\nThis game doesn't sell much to me if it's mostly random card mitigation accompanied by multi-player puzzle solving. Why is this rated so highly on BGG? From what I sense, it is a good solo and couples game, and those tend to rate higher on BGG. To further criticize, the board game community continues to drive game designers to make multi-player solitaire games with vague rule-breaking cards. Does this make a good game? Remind me why we are getting together to play a game again? To read tiny cards and rules all night? Bleh. I'm a snob, but I do play some of these game, I just do not need the rule frustrations.\n\nSimilar games: Terraforming Mars, which I don't hold in high regards either. Wingspan, which also has a lot of vague cards, but it's okay. Underwater Cities, which I enjoy a lot, due to the easy to understand cards. Dune Imperium is my favorite from this type of lot.",
    "timestamp": 1761519600
  },
  {
    "username": "bkevans",
    "rating": 6.0,
    "comment": "I know everyone loves this game, but I find it dry and relatively uninteresting for a longer game",
    "timestamp": 1761519600
  },
  {
    "username": "Meties",
    "rating": 6.0,
    "comment": "It’s a beautiful game but it takes so long. And it’s mechanics are just to much about luck. I’d rather play some more interesting games that take half the time twice.",
    "timestamp": 1761256800
  },
  {
    "username": "Kwnanan",
    "rating": 6.0,
    "comment": "Παιχνίδι με φοβερό στρατηγικό βάθος που πάντα είναι ευπρόσδεκτο. Παρόλα αυτά, τραβάει πολύ σε χρόνο και οι κανόνες δεν είναι εύκολοι αν δεν παίζεται συνεχώς, το οποίο είναι και το βασικό του αρνητικό.\n\nΔυστυχώς, λόγω έλλειψης χρόνου, παίζω πολύ σπάνια και όλο και πιο σπάνια έχω τη διάθεση για να το βγάλω στο τραπέζι. Πολύ ωραίο, αλλά δεν το προτείνω παρά μόνο σε άτομα που θέλουν να διαθέσουν τον χρόνο, αλλιώς απλά πιάνει χώρο στο ράφι.\n\nΚαθαρά σαν παιχνίδι, είναι άνετα 9/10. Αλλά, επειδή πλέον βάζω μεγάλο συντελεστή βαρύτητας στο πόσο εύκολα βγαίνει στο τραπέζι, τότε πέφτει πολύ.",
    "timestamp": 1760306400
  },
  {
    "username": "Ragingpiano",
    "rating": 6.0,
    "comment": "It's just way to long",
    "timestamp": 1760220000
  },
  {
    "username": "Desiderata",
    "rating": 6.0,
    "comment": "A unique theme that not a lot of heavier games have ventured into. It's nice that the zoo theme also includes conservation and donations, partner zoos and universities, as well as sponsorship. It's not just about playing animals into enclosures. There's a lot of hand management and choice of what actions to upgrade when (priority management). Some similarities with Terraforming Mars (cards with tags, tableau of cards, combos), but improves on it in several ways. First, you don't have to pay money for cards (although there is a strict hand limit). There are way fewer cards that are \"duds\"--cards that are unplayable at certain points in the game, particularly late game. AN has a card track where players can draft from using actions. Each player also has their own individual player board where they're placing their zoo enclosures and choosing their own unique upgrades. Overall, it's a fun game of engine-building. I'm not sure I'd want to play it with more than 2, bc the downtime would be immense with little to no added benefit. The dual vp track is interesting, and important to know that the game ramps up once a player has 2 or 3 association workers.",
    "timestamp": 1760047200
  },
  {
    "username": "lokomoka",
    "rating": 6.0,
    "comment": "/w Marine expansion",
    "timestamp": 1759874400
  },
  {
    "username": "TVDinner",
    "rating": 6.0,
    "comment": "This one is tough for me. Like Agricola, I just don't see the hidden combos as much as I should. If I get the obvious card combos and cards that support that during mid-game, sure the game gets fun. But when you make one choice at the beginning and nothing shows up, you're left floundering and it does not feel good for a longer game.\n\nHowever, the pictures and theme are well liked by some lighter gamers. And it is not a light or short game. This alone gets it to the table often enough that I never request it for myself.\n\nWe'll see how it holds up in the future.",
    "timestamp": 1759010400
  },
  {
    "username": "jttm",
    "rating": 6.0,
    "comment": "This is a game where I wonder if the entire BGG is gaslighting me. Top 3 means the weight of expectations was really high, nevertheless, I was surprised how poor my first impression of this game was.\n\nThe game is NOT elegant or streamlined. It is rules-heavy and feels clunky. There are too many fiddly rules which are non-intuitive (i.e. they don't match the theme of a zoo building). Honestly it feels like the designer took Terraforming Mars and added more rules on top.\n\nThe rulebook was not good (particular shoutout to \"Release\" which was a keyword on so many cards, but not covered properly). Also certain cards in the glossary just re-wrote what was on the cards instead of explaining them.\n\nFinally, the zoo itself didn't feel like a zoo because of the abstraction. I never felt like my zoo held any animals, it looked more like a map in a war game. There was definitely no \"oh look at my monkeys over here\" feel or \"i think i want to build a zoo of reptiles only\". Every players zoo just looked exactly the same.",
    "timestamp": 1758492000
  },
  {
    "username": "Sorp222",
    "rating": 6.0,
    "comment": "3 plays BGA.\n\nExpected to dislike it, 'coz it's a modern Gabba Euro and everyone says it is like Terraforming Mars. I preferred to TM as the gazillion cards tend to, after placement, turn into icons and end game scoring rather than a perpetual effect you can fire up to extend your turn into infinity. It really is a solitaire experience, there's too many snow bally combos and it feels like there's some luck in what cards you set off with. However its got animals and the action puzzle is pleasing and its... got animals. The puzzles fun and as far as other players at the table interaction seems to be limited to who wins the race to objectives and the overall prize first. The expansion just adds more puzzle stuff that make the line dance more complicated.",
    "timestamp": 1758232800
  },
  {
    "username": "sje6",
    "rating": 6.0,
    "comment": "I was very excited about this game when we got it because of the theme. But after playing it once with two players, we immediately agreed on two things: First, the content of the cards doesn’t really matter. For example, it doesn’t make a difference what type of research you’re doing, you’re just collecting the respective category. So while the theme is there, it doesn’t come through in an engaging or exciting way. Second, and more importantly, the game takes far too long for what it offers. I would have been fine with the game itself if it took about half the time. Then I might have played it again. But with its current length, I don’t feel any desire to revisit it. It’s simply not interesting enough. It’s one of those games where I’m surprised the rating is so high and that so many people seem to really like it. For me, it’s a pass.",
    "timestamp": 1757368800
  },
  {
    "username": "astroglide",
    "rating": 6.0,
    "comment": "Fans of Terraforming Mars have been singing this one's praise for ages. I finally got around to learning it in what seems to have been a sub-optimal setup: 4 players. Between the new-to-usness and the player count the tabletop game wore out its welcome to the extent that we didn't finish. I have since played it a lot on BGA where two fast players can rip out a game in < 40m. I still think the game itself is doing too much, and in a way I can't quite describe. Even with the Marine Worlds expansion improving it, put me squarely on team TM — or more specifically, I think, team Wingspan.",
    "timestamp": 1757368800
  },
  {
    "username": "Atomical1",
    "rating": 6.0,
    "comment": "Sold",
    "timestamp": 1757282400
  },
  {
    "username": "FrancoisX",
    "rating": 6.0,
    "comment": "Nice enough but not a top 10 game for me, bit too solitaire.",
    "timestamp": 1757109600
  },
  {
    "username": "abdiel",
    "rating": 6.0,
    "comment": "Fun, but overly complicated, game. Individual boards, rather than a common central board, are a detriment to player interaction making it more of an individual puzzle game.",
    "timestamp": 1756850400
  },
  {
    "username": "mingrkli",
    "rating": 6.0,
    "comment": "You like animals? You like building the ultimate zoo packed with exotic species, cutting-edge science, and conservation projects that span the globe? You like crafting a masterpiece of habitats, specialists, and strategy while outsmarting your rivals? Here it is Ark Nova! A 1–4 player game where you’ll design and manage a modern zoo, but this isn’t just about cages and critters this is about building the most successful zoological project in the world.\n\nYou win by scoring the most points through clever zoo management, boosting your reputation, and racking up conservation achievements before your opponents can. Every turn, you’ll use one of your five action cards each tied to a key part of running your zoo. The twist? The longer a card waits in its slot, the stronger its power becomes when you finally unleash it!\n\nWith many MANY unique cards featuring animals, specialists, buildings, and projects, no two games ever play the same. Every decision matters do you save up for that big-ticket animal, expand your infrastructure, or rush conservation points before someone else does? Build smart, balance your zoo’s appeal and science, and leave your mark on the world. Will your zoo reign supreme… or will your rivals steal the spotlight?",
    "timestamp": 1756764000
  },
  {
    "username": "CXXXIV",
    "rating": 6.0,
    "comment": "I've played it three times, and it borrows heavily from the mechanics of many other games, but the experience was quite unpleasant. First off, having to shuffle hundreds of cards each time is a real hassle. Secondly, there's barely any interaction in the game. Moreover, the effects of the animals have almost nothing to do with the theme of managing a zoo—the integration of theme and mechanics is extremely poor. I generally dislike games that rely on a large number of cards to offer replayability.",
    "timestamp": 1756159200
  },
  {
    "username": "lordjeb",
    "rating": 6.0,
    "comment": "[Steam Only]",
    "timestamp": 1755208800
  },
  {
    "username": "drphilphil",
    "rating": 6.0,
    "comment": "Good game, but I have some problems with the design. I don't like the random starting cards and I don't like the sole focus on tactics rather than strategy.\nIt's a bit to random for the weight and length for my personal taste.",
    "timestamp": 1755036000
  },
  {
    "username": "Oloovi",
    "rating": 6.0,
    "comment": "Theme is adorable and the action card mechanic is interesting. However I didn't enjoy playing this.",
    "timestamp": 1754344800
  },
  {
    "username": "Vinceloke",
    "rating": 6.0,
    "comment": "Played 4P the first time after bought. Took us 45 minutes to learn 90% of the gameplay mechanics from an experienced player , and it took us 2 hours 30 minutes to finish the game for 4 new players.\n\nUsed - bought RM270\n\nSold - RM240",
    "timestamp": 1754085600
  },
  {
    "username": "MeridithW",
    "rating": 6.0,
    "comment": "Difficult to learn at the beginning.",
    "timestamp": 1754085600
  },
  {
    "username": "crowlemw",
    "rating": 6.0,
    "comment": "Too long for what it is, second half of the game feels like you're just going through the motions.",
    "timestamp": 1753653600
  },
  {
    "username": "pers0n",
    "rating": 6.0,
    "comment": "1-4p, 90-150min, Its a good game, but not amazing. There is a lot to do and it's very long, too long for me. I played for 1.5 hours after a 30min rule explanation with 4 people and we probably had another 1-1.5 hours left.",
    "timestamp": 1753567200
  },
  {
    "username": "cstanton84",
    "rating": 6.0,
    "comment": "For the time it takes, not overly enjoyable. The action selection puzzle throws you a few bones on occasion, dishing out numerous rewards to help keep the train going. Far too often, the cards are just meh. You just putter along without direction or synergy guiding your actions, prolonging the experience even more. I don't have 3+ hours anymore to give to such middling experiences.\n\nBest: 2-3 players",
    "timestamp": 1753480800
  },
  {
    "username": "amanwithtwodogs",
    "rating": 6.0,
    "comment": "Ive owned this game twice now. And I just cant get into it. It's ok. But I feel it has too many flaws for my tastes.\n\nVery long at 3+, very low on interaction and something about the whole ordeal is just not satisfying for me.",
    "timestamp": 1753221600
  },
  {
    "username": "Jistina",
    "rating": 6.0,
    "comment": "Never owned. Played a friend's copy once in April 2024.\n\nOkay, but felt like in depended too much on top decking animal cards. Not getting to see all that many cards during the course of the game and the card synergies being so important meant that it felt a little out of my hands. I wouldn't mind playing it again but it isn't something that I'm going to actively seek out.",
    "timestamp": 1752962400
  },
  {
    "username": "kivi2004",
    "rating": 6.0,
    "comment": "all Cards sleeved",
    "timestamp": 1752616800
  },
  {
    "username": "aresil",
    "rating": 6.0,
    "comment": "2p",
    "timestamp": 1752530400
  },
  {
    "username": "dieterminator",
    "rating": 6.0,
    "comment": "rather would prefer to play it only online, to much card specific extra knowledge required, It feels even after 5 matches I have not played one completely correct and that is due to game would never finish, If we checked any card rules",
    "timestamp": 1752444000
  },
  {
    "username": "TheSlov",
    "rating": 6.0,
    "comment": "Solid game with flowing mechanisms, I like the card action system and how your cards move and get better rewards. All buttons are pressed eventually (similar to Wingspan), and you need to do a little bit of everything to do well. I think the only downside is the game length. At 3 players it was at least a 2hr game, which is asking a lot from a game where each turn is quite short. Just leads to a lot of less \"efficient\" actions that you need to do just in order to get money or some token so that the next/future action is better or you have the pre-requisites for the next action.\n\nI think it fair to compare this game to Terraforming Mars, has a similar tableau system where you buy cards to play and they have an effect or trigger, and are either one time triggers or trigger when X/Y/Z happens. I enjoy this more than Terraforming Mars, but it's in the same vein. The theme is there but I wouldn't say it's essential to the game, I feel that this could have been something else thematically. Because there is at least 200+ cards it can feel very random as to your strategy, you're playing a bit more tactically and making a couple short term decisions rather than a long-term planned strategy.\n\nIt's not amazing, it's not horrible, my only criticism is that this game stays longer than it is welcome and drags on. You will need at least a 2hr window to play this in most cases.",
    "timestamp": 1752184800
  },
  {
    "username": "zWobble",
    "rating": 6.0,
    "comment": "Not impressed",
    "timestamp": 1751839200
  },
  {
    "username": "dirkofthrones",
    "rating": 6.0,
    "comment": "First try, it was way to hot, so didn't understand everything.\nIt has a nice core mechanic and lots of effects on different ressources or goals.\nFor me the iconography is not perfect, i especially struggled a lot with the building part, and there are too many bars for beginners",
    "timestamp": 1751407200
  },
  {
    "username": "raggededge",
    "rating": 6.0,
    "comment": "Really solid engine builder with great theme integration. Some pacing issues in longer games, but overall a satisfying experience, especially for solo play",
    "timestamp": 1751234400
  },
  {
    "username": "CotB",
    "rating": 6.0,
    "comment": "Rankings\n48th Best Game 2022\n185th Best Game 2023",
    "timestamp": 1750888800
  },
  {
    "username": "OrzelBialey",
    "rating": 6.0,
    "comment": "i really like the action mechanics but the variance in the cards you draw make me feel like my actions dont really matter",
    "timestamp": 1748988000
  },
  {
    "username": "kaepone",
    "rating": 6.0,
    "comment": "The first play was a bit of a learning experience and now that I understand the game I can see the appeal. Spacial puzzle with tile tile habitats, numerous bonus combos by covering spaces, uncovering cubes/workers, or progressing up the three tracks. I didn't have issues with the blind card draw as I mainly stuck with choosing from the display and avoided animals with a lot of prerequisites. The action card selection mostly worked well, though a few times I struggled wanting to repeat an action much quicker (Association) and didn't have enough X-tokens to power it up to where I needed it.\nThe game played long, but we were referencing the rules a decent amount to make sure we got all the interactions correct, so that's understandable. I feel like it will go much quicker now that the first game is out of the way.\nLastly, scoring. This is a mixed bag for me. I like the Rajas of the Ganges end game trigger and scoring mechanism because it's a race. But why are players racing to create the best zoo in Ark Nova? Crossing markers as an end game trigger is fine, but I wonder if it would be more meaningful to add points of the two (or three) tracks, such as Final Score = 1x Appeal + 2x Reputation + 3x Conservation. That way players don't feel like they auto-lose the game (and score negative points) if they don't cross their score markers, and they could have a little more freedom to focus on certain tracks.\nAfter more plays this just didn't click for me. Games didn't play much faster, some animals are near impossible to get into your zoo because of high costs or ridiculous prerequisites. Then dismantling your zoo for conservation is just odd. The different maps were fine but didn't make too much of a difference for me. Even the expansion and map packs couldn't change my opinion.\nI'd rather play Terraforming Mars or Underwater Cities.",
    "timestamp": 1747864800
  },
  {
    "username": "jari58",
    "rating": 6.0,
    "comment": "Rating based only on solo plays.",
    "timestamp": 1746828000
  },
  {
    "username": "mongooseroar",
    "rating": 5.5,
    "comment": "It feels like it has a lot of the same strengths and weaknesses as Terraforming Mars but cranked up to 11, and for me, that's really not a good thing. I would probably eventually find this game more enjoyable if I had a group dedicated to this game that grew to a fairly balanced skill level over a bunch of plays.\n\nIf I had such a group, though, I can't imagine why *this* is the game I'd pick for the group to get experienced at.",
    "timestamp": 1746396000
  },
  {
    "username": "DonWalker",
    "rating": 6.0,
    "comment": "Initial rating after first play 8/10 from 06/2022. Game took 3h with 3p (1h of it was teach), which felt a little bit too long. See after 1,5h you had the feeling \"Okay, this game could actually end now, because I did enough!\" But the game took even longer and longer. I have to check how it plays when you know from the begining what you're doing. Stay tuned.",
    "timestamp": 1745445600
  },
  {
    "username": "PlasterCramp",
    "rating": 6.0,
    "comment": "I really loved this game but after playing it 20+ times it became very dull and sort of feels soulless to me now.",
    "timestamp": 1745186400
  },
  {
    "username": "Tamino1",
    "rating": 6.0,
    "comment": "Ark Nova has a lot going for it mechanically, but the graphic design is a weak point: icons and card design feel visually unappealing and unintuitive (e.g. money being represented by a black square). The game also unfortunately has minimal interaction between players. That said, the Tetris-style tile placement on your own player board is fun and adds a satisfying puzzle.",
    "timestamp": 1745100000
  },
  {
    "username": "thEndCFS",
    "rating": 6.0,
    "comment": "There are a couple of things that hold this back for me: it is a touch too long and has very little interaction. I really just never give a shit about what someone else is doing with their zoo.\n\nMy favorite thing about it is the action selection system.. but I can just play Civilization: New Dawn for that.\n\nI personally just enjoy Terraforming Mars more and I think it is primarily because of the shared board.\n\nI enjoy the game with all that being said.. but I just hardly ever want to play it. Typically only gets tabled when someone else suggests it.",
    "timestamp": 1745013600
  },
  {
    "username": "zgienger",
    "rating": 6.0,
    "comment": "It won't ever be my favorite game because of play time and weight, but with that being said, I can see why people put this as their #1 game. All the systems just feel so right together to create a memorable game each time.\n\nAfter playing it a few more times I had to drop the score one more to 7 because its just too long.",
    "timestamp": 1744668000
  },
  {
    "username": "Pacres",
    "rating": 6.0,
    "comment": "Demasiada variabilidad para mí",
    "timestamp": 1743890400
  },
  {
    "username": "muldor",
    "rating": 6.0,
    "comment": "game lenght is not good, one end game scoring (cover all area in your zoo) is way easier to achive than other end game scoring cards witch is not fair, some cards have just ridiculous demands, for example 6 same icons to score just 2 extra points on green track, someone needs to be very lucky to achive such thing before game ends, and after more plays I dont think I like mix of optimise your moves to the best of your ability with so much randomness with card draw, dont like when game tells you to collect specific icons to move on green track but on display lay cards with useless icons to you, so whoever gets luckier with card draw wins, sometimes luck is so bad that you have to play anything even if it have useless icons, but who knows maybe later those icons will be useful ... if specific card show up you are good if not well",
    "timestamp": 1743804000
  },
  {
    "username": "kameronsnewphone",
    "rating": 6.0,
    "comment": "I still believe the game has worse issues with rng card synergies than Wingspan, terraforming, earth, etc. but the core action cardplay and upgrades are nice, plus the spacial element is far more interesting than TF's, which is nearly a non-factor in most games in my opinion. And then again it's 4 hours of multiplayer solitaire, which is just not fun in most groups imo",
    "timestamp": 1743717600
  },
  {
    "username": "Meeple_Mike",
    "rating": 6.0,
    "comment": "I love the action selection system and the shifting power level of the actions cards, but that's about the only thing I enjoy.",
    "timestamp": 1743458400
  },
  {
    "username": "onionator",
    "rating": 6.0,
    "comment": "Mike prefers as solo, same as normal game, no real interaction on multiplayer, set up not bad",
    "timestamp": 1743458400
  },
  {
    "username": "arry1",
    "rating": 6.0,
    "comment": "As a Terraforming Mars successor, it has cool ideas but is weighed down by too much complexity, streakiness of science, and card randomness; I gave it a fair try but now prefer not to open it again.",
    "timestamp": 1743202800
  },
  {
    "username": "Elm0__",
    "rating": 6.0,
    "comment": "After repeated play I decided to lower the rating radically from 9 to 6. There are several reasons for this:\n\n1. The whole game loop has a big tightness, but it is an artificial, feelbad tightness caused by how action selection mechanism works. Compare it to Age of Innovation or Seti, where tightness comes from resource management and is fun.\n2. Feelbad is reinforced by big downtime - because of how action management works and how areas of interaction look, sometimes you are forced to reevaluate a complicated plan on the fly, taking time while others just sit and wait having little to do. There is no grace in it, just annoyance.\n3. Iconography is often less than expressive, you often will end up checking the manual to understand what's going on.\n4. Card-based play is disappointing. Playing animals requires multi-turn setup to optimize it while not giving a real satisfaction. It is mostly tactical with minor strategic aspect. Again it feels bad.\n5. Cards are strikingly imbalanced. Some endgame objectives require huge effort. Other (like kiosks and pavillons based one) seem trivial. Same with sponsors and animals.\n6. You aren't able to do much when stuck with hands that don't fit your strategy. In Terraforming Mars you can at least sell them without any prerequisites. Losing a hand full of cards on the break - another feelbad.\n7. Opaque scoring system where you can end up with negative points. Guys, I don't need to be an established game designer to know that if I end up playing 5 hours and in the end my effort is evaluated in negative numbers, then it doesn't give a lot of fun, does it? Apparently there are some fixes done in which you add 100 points in the end but to be honest it means that instead of ending with negative points you end with points lower than these you were graciously given. Mind boggling.\n8. Completely dry setting. Yes, it's often pointed out that euros are generally dry, but again compare it to Terraforming Mars, where you kinda actually feel like you are Terraforming this frickin planet. In Ark Nova you don't feel you are building the zoo. You feel like you are boxing against the artificial system while on the look for another bonus - like pig looking for some truffles.\n\nAll in all, now I see Ark Nova has a lot of problems and sins modern euros share. I don't see it as improvement over Terraforming Mars. While on TM some mechanics feel simplistic here they are overcomplicated, causing bad experience in general. That's all.",
    "timestamp": 1743030000
  },
  {
    "username": "thegustyone",
    "rating": 6.0,
    "comment": "The Card building aspect is good. Some are cards are way to convoluted though. I dont like the zoobuilding aspect. Every enclosure looks the same you have no real attachment to it. You cant even tell where each animal lives in the zoo",
    "timestamp": 1742770800
  },
  {
    "username": "Dynastico",
    "rating": 6.0,
    "comment": "It's ok. The execution of \"Zoo Tycoon: the board game\" is basically exactly what you'd expect. I have beef with games with a massive card deck containing several very specific archetypes, but your card draw potential is so low it's down to luck whether you get good synergies or not. The action selection mechanic adds the only interesting layer to the game, imo. Otherwise, it's too long and random.",
    "timestamp": 1742511600
  },
  {
    "username": "MrBigos",
    "rating": 6.0,
    "comment": "The game is complex enough to be enjoyable, but I have many problems with this game. Animal powers are totally omittable. Sometimes you have great turns, sometimes you can do almost nothing. Because of the card placement system, you need usually play in same order. And game ends quicker than expected, you never accomplish what you orginally planned, which doesn't give satisfaction.",
    "timestamp": 1742511600
  },
  {
    "username": "adel9591",
    "rating": 6.0,
    "comment": "Comparable to Terraforming Mars, the scoring is a little less intuitive in this one though. Satisfying and rewarding to play, the engine starts rolling at an appropriate pace. Like Terraforming Mars, though, success would seem dependent on getting good cards that fit your engine.",
    "timestamp": 1742511600
  },
  {
    "username": "Shinako",
    "rating": 6.0,
    "comment": "Great graphic design, engaging and balanced actions, and overall well designed economy. The only problem is that VP centers around randomly drawn cards, so you could be completely screwed by luck and get nothing but unplayable animals or conservation requirements that you can't fulfill. Or someone can get a really powerful card that rockets them ahead in resources/action economy and there's nothing that can be done to stop them or catch up. For how long and complex this game is, it's not great that the VP balance relies entirely on random cards. A game this long and complex should place more emphasis on player agency and skill. For some people, that won't be a problem and they'll just enjoy leisurely building their zoo, regardless of if they win. I'm glad to have played this game, but the gameplay and theme aren't interesting enough to make me willing to invest the time and effort required to play it again.",
    "timestamp": 1741820400
  },
  {
    "username": "IOIXIOI",
    "rating": 6.0,
    "comment": "Too much. Le jeu expert lourd, bien lourd.\n\nVoilà un jeu pénible où l'on demande aux joueurs une maintenance permanente, ultra rigoureuse et irréprochable, comme s'ils étaient des ordinateurs.\n\nSoyez prévenu, il faut penser à tout. Il est alors difficile de s'occuper de sa partie et de gérer ensuite tout ce qu'il y a à gérer. Il y a une somme d'erreurs à chaque partie qui est assez problématique. De mon point de vue, ce jeu n'est pas jouable en l'état, à moins d'en faire un travail sans plaisir ou d'avoir à la table un joueur aux capacités remarquables qui corrige tout pour vous. J'exagère mais si peu. Les sous-actions et les imbrications quand on résout notre action principale à chaque tour sont trop nombreuses pour générer une sensation de contrôle et de plaisir, car trop de petits paramètres débordent les joueurs. Combien de fois on entend par partie \"Ah oui, j'avais oublié de déclencher ça tout à l'heure, et de faire avancer ça, de retourner ça et de faire tourner ça, etc.\".\n\nAutre problème, il y a trop de prérequis qui freinent la pose d'une carte animal. C'est parfois tellement laborieux que le jeu n'a plus d'intérêt thématique. J'ai joué avec un joueur expérimenté qui se moquait de poser des cartes animaux pendant les trois quart de la partie. Comme un abruti, et comme le texte au dos de la boîte me le suggérait, je construisais un zoo en posant des cartes, pendant que lui, il faisait des trucs abstraits. Il a gagné, et de loin. Bravo mec, dommage par contre, qu'on n'ait pas vraiment joué au même jeu !\n\nPar ailleurs, les joueurs sont trop dépendants du tirage des cartes. Durant ma dernière partie, j'ai pioché 3 cartes : aucun animal. Aucun animal non plus dans la rivière. Puis j'ai attendu que l'action de piocher soit de nouveau rentable... c'est long. Je finis par piocher 2 cartes : aucun animal. Coup d'arrêt, plus aucune possibilités. 4 heures de jeu réduites à néant. Ce n'est pas rare dans ce jeu à cause de la trop forte présence de cartes mécène et projet dans la pioche.\n\nTerraforming Mars (dont s'inspire Ark Nova) est tellement plus intéressant grâce à la construction de la zone centrale et personnelle. On s'amuse à bâtir une véritable machine de production, amusante, qui nous fait penser que nos actions de jeu ont eu de fortes conséquences.\nLes pouvoirs passifs sont bien mieux dosés, utiles et jouables, on ne les oublie pas à répétition. La pioche des cartes ne mettent jamais une partie en péril, même si ce n'est pas optimal, on a toujours quelque chose de plaisant à faire.",
    "timestamp": 1741388400
  },
  {
    "username": "arildoaim",
    "rating": 6.0,
    "comment": "Its alright, and always happy to play (if i have the 5 hours to spare  \n\nBut the rank is way to high (and somewhat caused by how bgg rank works).\n\nIts been compared to Terraforming Mars alot. While Ark Nova does something better (open card drafting, strategic tracks, \"awards\" chosen by players hand, always 5 actions and tactical order) it loses alot of interactivity of shared board and general streamline from its competitor. Ark Nova is more rules heavy, and more of an set collction game imo. TM is suprisingly more thematic and immersive (also while subjective i prefer its art), and have an more epic arc where youre prodcing in your engine to feel youre really build up something. I wish a third epic game came out with the best of both. Right now there are shorter games to scratch the same itch.",
    "timestamp": 1741302000
  },
  {
    "username": "martidem",
    "rating": 6.0,
    "comment": "The mechanisms are fun. I like engine-building tableaus. I like advancement tracks. I like unlocking bonuses. I like upgrading actions. I like racing for goals. I like spacial puzzles. And I like the dual scoring tracks. But nothing here is new, and it feels like it could be streamlined a bit. Some mechanisms, like the reputation track, feel like they exist simple because there needs to be a restriction for each action upgrade. And the inclusion of take-that, a bunch of unique hex tiles, and the extra conservation cards in the main deck all feel like expansion material that just add bloat and more luck of the draw.\n\nFor me, the scoring tracks could be shorter because the game overstays its welcome by nearly half of the playtime. There's significant luck of the draw, which means that you might not get the synergies you need and will end up with a lot of worthless or unplayable cards at no fault of your own. And at a 3-hour playtime, that means that it's not as fun for the player who halfway through the game knows that they won't win due to bad luck but still needs to play for another hour and a half. I think with shorter scoring tracks and removing the reputation track (i.e. a shorter play time), I'd rate this much higher.",
    "timestamp": 1741042800
  },
  {
    "username": "treeman35",
    "rating": 6.0,
    "comment": "a good game without interaction. we played it 2 times 3 people and it was like 3 solo plays",
    "timestamp": 1740610800
  },
  {
    "username": "Talasmar",
    "rating": 6.0,
    "comment": "I am not in camp Ark Nova. It is a good game but the scoring is a mess so I don't put it as a great game.",
    "timestamp": 1740610800
  },
  {
    "username": "goethean",
    "rating": 6.0,
    "comment": "We didn't like the artwork. Or the gameplay particularly.",
    "timestamp": 1740438000
  },
  {
    "username": "shanev316",
    "rating": 6.0,
    "comment": "Well…I was unimpressed by Ark Nova after 2 plays. It got added to BGA so I thought, why not?\n\n21 BGA plays later and I’m starting to see the depth here. What I thought was luck of the draw before, I just realized that it’s just something to be mitigated and that there’s ways to get what you want. Sure, you can get unlucky and never draw what you need, but that happens very infrequently. I’ll be seeking out a physical copy now and hoping for even more expansions!\n\nUpdate:\nI’ve enjoyed my time with Ark Nova more than I expected to, but I think I’ve just played it out at this point.\n\nIdeal Player Count: 2",
    "timestamp": 1740438000
  },
  {
    "username": "Wasylus",
    "rating": 6.0,
    "comment": "Genre=euro\nPlayers=2-3, b2\nTime=3h\nExpansion=yes(1)\nThemes=animals\n\nComplex=4****\nComponent=3***, cards, mini-boards\nMechanic=3***\nFun=2**\nRandom=2**\nThematic=2**\n\nA very good pure euro game. I don't like pure euro games very much. Add 2 points if complex euro games are your thing.",
    "timestamp": 1740265200
  },
  {
    "username": "Mzungu_Niko",
    "rating": 6.0,
    "comment": "Komplett, Neuwertig, Keine Gebrauchspuren. Nur 1 Mal gespielt.",
    "timestamp": 1739919600
  },
  {
    "username": "Cenagal",
    "rating": 6.0,
    "comment": "No entiendo la necesidad de que dure tantísimo, hace que en mesa de mucha pereza jugarlo.",
    "timestamp": 1739746800
  },
  {
    "username": "joseph777",
    "rating": 6.0,
    "comment": "Sept 2024 - very good\nUpdate - Feb 25 Have downgraded to a 6. It's good and has a strong theme but you can't play to themes within your zoo. I'd love to go with a predator strategy - haven't got the cards or only 1 or 2. Large bird aviary strategy - can only field 1 of those. Hmmm...hyena enclosure looks good, I'll build. Can't get the Hyena card for the entire game. It's a bit odd - you end up having to go with whatever you've got, a bit of this and a bit of that rather than being able to specialise or such. Too many cards in the deck or not enough ways to search for cards you need.",
    "timestamp": 1739574000
  },
  {
    "username": "Fikuus",
    "rating": 6.0,
    "comment": "Played with others",
    "timestamp": 1738710000
  },
  {
    "username": "Loransea",
    "rating": 6.0,
    "comment": "When I got back to the hobby 2 years ago, I fell for Ark Nova with the help of a friend fan of the game. Played it oncte with him and twice with my daughters. Even printed and translated, Family and kid version available in BGG files !\nDidn’t play it for more than a year. Now I realise that the 5 action card drive that seduced me was masking a terrible drawing luck out of the huge deck ! Any strategy can be ruined by a lack of luck.\nIf your ever forget one extra move, you’ll be punished soon.\n\nApart from the animal cards, the game is overrated in my opinion. Luck ruins complexity. I’d prefer «6mint» for luck and Scythe for complexity !\n\nUpdate: this game hype is due to the casino feeling we get IMHO. We hope to gain back what we lost in the previous game.",
    "timestamp": 1738537200
  },
  {
    "username": "Cheeps",
    "rating": 6.0,
    "comment": "This game is a game of reacting on cards you draw, it will dictate how your zoo will look like, you just need to make the right decisions.\n\nThe deck is GIGANTIC and has 3 types of cards: Animals, Sponsor, Conservation.\n\nSo it happened that you draw cards and won't get the Card Type you need although the Card deck is thoroughly shuffled.\n\nEDIT: The Forum is full of questions for clarifications of the card's functions, as every card is different. Needed to check the Forum at times, a bit tiring.\n\nPlaying time is too long.",
    "timestamp": 1737759600
  },
  {
    "username": "emmaak",
    "rating": 6.0,
    "comment": "There are many interesting mechanics, but it’s too long and solitaire, and I’m not crazy about the player boards and polyamino-thingy going on.",
    "timestamp": 1737673200
  },
  {
    "username": "gamesbook",
    "rating": 6.0,
    "comment": "The 'massive deck' with completely random card selection makes this game really unenjoyable for me. Forest Shuffle manages to get it right, despite the threat of OP combos.",
    "timestamp": 1737327600
  },
  {
    "username": "Jack_NKGaming",
    "rating": 6.0,
    "comment": "I played Ark Nova at a gaming retreat. The art (or lack thereof), the action selection and the bi-directional scoring make it a very clever game!\n\nWhy rate it so low? Three reasons. The take that mechanics in this game are totally out of place and add nothing to the experience. The guy using the mechanics in the game I played apologized every time he took an action because it wasn't fun or useful for him and really disrupted the leader. I'm not against take that, but in this game it was vile.\n\nSecondly, the setup for this game is brutal. It took us almost an hour to setup and tear down. The times I would have a chance to play are so few and far between I could never justify owning it, but I did appreciate it!\n\nFinally, the art and graphic design in this game are, in my opinion, atrocious, but that's highly subjective. I personally don't see the appeal.\n\nIt is an engaging experience. If I ever have the time to kill and it is being played I could be persuaded to join in.",
    "timestamp": 1737327600
  },
  {
    "username": "GeorgeMeade",
    "rating": 5.6,
    "comment": "This game really isn't for me.",
    "timestamp": 1737068400
  },
  {
    "username": "Ciel_Bleu",
    "rating": 6.0,
    "comment": "The biggest pain for me in this game is the scoring. After that, it feels too long and overstays it's welcome. (Which is exacerbated by the scoring). It just leaves a bad feeling after spending too long in a game and highly likely ending up with negative points. The components , art, graphic design looks too bland as well. Very \"meh\" table presence. I only tried to play this game because of somebody's Pokemkon re-theme because THAT looked exciting. After playing the game a few times, it is sadly a no-go for me.",
    "timestamp": 1736722800
  },
  {
    "username": "Massche",
    "rating": 6.0,
    "comment": "€40",
    "timestamp": 1736463600
  },
  {
    "username": "repear",
    "rating": 6.0,
    "comment": "6 - Ok - will play if in the mood\n\nI don't generally like multiplayer solitaire games. But this one does interest me. The gameplay is smooth and the puzzle is compelling. I will always play this on BGA and would not recommend it for in person gaming, unless you love the BGA game.",
    "timestamp": 1736031600
  },
  {
    "username": "KRX3",
    "rating": 6.1,
    "comment": "With Marine Worlds expansion. Plus Map Pack 1 and 2.\n[S - 2]",
    "timestamp": 1735599600
  },
  {
    "username": "bholmes4",
    "rating": 6.0,
    "comment": "There are a ton of possibilities for you on each turn, the theme actually works, and for some people I can truly see why this would be a 10/10. But it's still just a points puzzle to me. I like my Euro's light and quick and near the final few turns of the game I was over it, so we packed it up early.",
    "timestamp": 1735340400
  },
  {
    "username": "Javajoesworld",
    "rating": 5.5,
    "comment": "Too multi player solitaire. If a player doesn’t announce they are done with their turn people can wait unnecessarily. While I first liked this game repeated plays showed for me the game was dull and unnecessarily long.",
    "timestamp": 1735254000
  },
  {
    "username": "Flor_S",
    "rating": 6.0,
    "comment": "Cool but heavy and long",
    "timestamp": 1735081200
  },
  {
    "username": "Kater_Inna",
    "rating": 6.0,
    "comment": "4",
    "timestamp": 1734217200
  },
  {
    "username": "TheDorkArts",
    "rating": 6.0,
    "comment": "Fun, layered strategy but not one I’m aching to go back to. Still a good time. I’m also just not in love with the idea of creating a zoo.",
    "timestamp": 1733612400
  },
  {
    "username": "NordRunner",
    "rating": 6.0,
    "comment": "Took me 5 or 6 plays to decide I accepted it enough to keep playing.",
    "timestamp": 1733266800
  },
  {
    "username": "littlechandler",
    "rating": 6.0,
    "comment": "Initial Impressions: This game has as many little rules as an ameritrash game, with unclear iconography making it all that much harder to remember. While I think this game would be much faster on repeated plays, I still think it would still be too long for how repetitively cyclical the game is. While the game goes from pretty restrictive to too open as your income ramps up during the game, it doesn't feel like you are doing cooler stuff. Rather, it feels like you were doing things in too many incremental turns in the beginning, only to get up to reasonable pace per turn later in the game, and then the openness has you have too much of one thing (money, assistants) while still having limitations on another (actions). That and the action line and the requirements after requirements creates planning decisions, but it feels like a lot of work for not enough build up. I think I would like a 2.8 weight version of this game that was faster paced and much more streamlined:\n-Just a cost + maybe a general capacity for animals, no individual enclosures with size requirements, + partnership requirements\n-Just claim this achievement when you reach it rather than the weird conservation card system.\n-Points is just 3x conservation points, + appeal, which is what it effectively is right now anyways, just in a much more convoluted way.\nAs it is right now it feels overwrought.\n\nI heard this compared to Terraforming Mars. My fears were confirmed, that this would be like Terraforming Mars: overly long tableau buildingish game that makes you have to pay significantly to have options, with spatial aspects and achievement systems I don't really care for, and some directed attack cards, but with less engine building, although with theme I like more. While this lacks the engine building I think if you love one you'll at least like the other. If you were disappointed by one even if you moderately enjoy it, you might like me not like the other.\n\nEDIT: On second play, the beginning was alright, the middle was enjoyable, and then I realized there were still quite a few actions until the game ended so the end was me trying to figure out how to trigger the end game condition as fast as possible. I'll bump it up to a 5 since I think I'd be ok playing it with 2 once in a while; with more downtime would increase and attack cards would be an arbitrarily baked take down the leader mechanism.\n\nEDIT 2: solo with the starting 20 appeal speeds up the game, and I assume is similar to the speed of the multiplayer game for experienced players. Bumping up to a 6, but even in solo on the easy difficulty if you make a big mistake the game can still slow down to molasses.",
    "timestamp": 1732921200
  },
  {
    "username": "genji256",
    "rating": 6.0,
    "comment": "Comment after 1 play\nI played this game like I play a hack and slash: not necessarily for the win but for the thrill of cascading bonuses that pop up like Christmas presents. A lot of the game revolves on having appropriate cards at the right time and card drawing abilities are few and far between so it is much more about doing as best as we can with what we have as having a long-term plan.\nI ended up destroying someone with 100+ games under their belts (+31, -20, -28) so I'm not sure what it says.\nI understand the appeal but it felt like the designer wanted to add as many mechanisms and tracks as possible.",
    "timestamp": 1732748400
  },
  {
    "username": "cdoelle",
    "rating": 6.0,
    "comment": "It is a long game but the mechanics are not that difficult. Too many moving parts to get great at it without costing better games time at the table. Fun, but not a game I will play often.",
    "timestamp": 1732748400
  },
  {
    "username": "apisapia",
    "rating": 6.0,
    "comment": "I'd never suggest it, but willing to play",
    "timestamp": 1732230000
  },
  {
    "username": "rDeAk",
    "rating": 6.0,
    "comment": "Might give it a shot again with less players but after a couple of plays Im just refusing to play again with 4.",
    "timestamp": 1732057200
  },
  {
    "username": "CarsonChandler",
    "rating": 6.5,
    "comment": "Long, and less interaction than I tend to like, but a solid game that will stay in my collection for now for the tile placement, the little bonuses along the way, and the satisfaction of building your own little zoo.",
    "timestamp": 1762648920
  },
  {
    "username": "graham greene",
    "rating": 7.0,
    "comment": "Edición 2025 con la nueva versión del reglamento y el tablero modificado",
    "timestamp": 1762627680
  },
  {
    "username": "OurMrMajestyk",
    "rating": 7.0,
    "comment": "A modern tableau builder with a huge deck of cards and all of the usual pros and cons that entails. Lots of symbols, tracks, and combos; you know the drill. I think a lot of the fun you'll get out of Ark Nova comes from how much you enjoy the action card system because everything else in the game is pretty boilerplate. While I'm not expecting strong ties between the mechanisms and the theme in a game like this I do feel that connection is particularly weak in Ark Nova, you can have an awful looking zoo that still scores you a ton of points at the end. A solid enough game that's easy to set up.",
    "timestamp": 1762210800
  },
  {
    "username": "Lord Heisemberg",
    "rating": 7.0,
    "comment": "Impressionnant :\n- une thématique (très) forte ;\n- une mécanique ultra chiadée ;\n- un design très réussi ;\n- des parties très longues (1h par joueur) mais on ne voit pas (trop) le temps passer.\n\nPetit reproche : on joue quand même bien dans son coin pendant toute la partie, l'interaction étant réduite au strict minimum.\n\nMais c'est pas grave, c'est très bien quand même.\n\n[EDIT] Sa variation \"Sanctuary\" gomme les quelques défauts du jeu, notamment sa longueur. Je lui préfère cette version.",
    "timestamp": 1762038000
  },
  {
    "username": "Indy500sr",
    "rating": 7.0,
    "comment": ".compleet\nEAN 8718026305284\nGL3",
    "timestamp": 1761951600
  },
  {
    "username": "ImZhe",
    "rating": 6.7,
    "comment": "Better than terraforming mars, but sad there's no shared board. Fun but very rng, seems like enemies could win just off starting objectives and cards. ton of cards so hard to parse what others are doing",
    "timestamp": 1761170400
  },
  {
    "username": "Rafa44",
    "rating": 7.0,
    "comment": "Good game, but I don’t get the hype. I much prefer Terraforming Mars. I’d also rather play Civolution or SETI-both are better in my opinion.",
    "timestamp": 1761084000
  },
  {
    "username": "hyde_70s",
    "rating": 7.0,
    "comment": "Ark Nova is fun and very well thought out game. It is especially interesting while you're exploring the system. That said, after a first few initial thrilling plays it becomes painfully obvious that this kind of game can only go so far. It is neither deep nor inovative in any way, and leaves you without new things to explore, or excitement to come back to. Thus, it is very overrated and undeserving of it's place among the giants of board gaming. And personally, as with most of this kind of games, I would probably love it more if it was shorter and it had a smaller deck of cards.",
    "timestamp": 1760997600
  },
  {
    "username": "cheshire_cat",
    "rating": 7.0,
    "comment": "Alright, I would like it more if we had less variance on the animal row. For example, if we have a single card of each type always present.",
    "timestamp": 1760392800
  },
  {
    "username": "david_os",
    "rating": 6.5,
    "comment": "I can see why people like this, because once we had got over the initial hump of the rules (the rulebook is really bad) this flows quite smoothly.\n\nActions are usually quick and the puzzle of putting together your zoo and populating it with cool critters is fun. Then you realise, oh yeah, there's this whole conservation thing too, and also reputation, and also... and so on, and it's all a bit too much.\n\nI'm not going to claim to have played enough to really get behind the No Pun Included criticism that the deck is just too big, but... honestly, I think the deck is too big. For a game this complex, the fact that the deck being so big means you can't really plan, so you should just play reactively is disappointing. [I only played it once at Wellycon 2025.]\n\nSo not an unenjoyable experience, but overlong and a bit random in terms of the outcome, and the essentially multiplayer solitaire aspect also detracts.\n\nCertainly wouldn't buy it, but glad to have played.",
    "timestamp": 1760306400
  },
  {
    "username": "Mr Mjeh",
    "rating": 7.0,
    "comment": "Brilliant game!",
    "timestamp": 1760220000
  },
  {
    "username": "PGames_DM",
    "rating": 7.0,
    "comment": "I'd play this again but weirdly enough it's kind of hollow to me. I'm reminded of playing Ara History Untold. This is very much a gamers game, the low score isn't because of the quality of the game or the satisfying mechanics, but rather the feeling I'm left with after playing the game. For me I didn't find the game to have very satisfying or developed late game... for all the buildling and conservation overtones you can end up not sure what was accomplised. There may also be unavoidable anxities triggered by this game in my subconscious about the collapse of civilization and biosphers and the like and I actually think the difficulty getting 'conservation' points is kind of a nice overture to that.",
    "timestamp": 1760133600
  },
  {
    "username": "GCZ745",
    "rating": 7.0,
    "comment": "Overall - 7/10 - Best at 2 players\n(Solo - 3/10)\nI really want to like Ark Nova. It’s very well-designed and blends a lot of game mechanics I enjoy, but for some reason the end result just doesn’t do anything for me. I even bought it again after selling it, feeling like I had to have missed something, but all of the hype and the love most people have for it never clicked with me.\n\n\nTheme - 1.75/2\n\n+ Building a zoo is a great theme that has mass appeal and the game has a nice, clean look to it, if a bit on the boring side.\n\n+ Placing enclosures, filling them with animals, partnering with continents and universities, finding sponsors, etc., is all very thematic and has a clear impact on the game.\n\n- Unfortunately, the zoo you build and the animals you choose don’t matter very much at the end of the game, since it comes down to a simple race for points. It’s missing the “I built something unique” feeling of Wingspan or Terraforming Mars, where you watch your engine come alive in the late game.\n\n\nRules Complexity - 1/2\n\n- I found learning Ark Nova difficult and teaching it to others even harder. There are so many moving parts in this game and trying to distill it all into something that makes sense to first-timers is a tall task.\n\n- Likewise, being the administrator of the game can be overwhelming as so many cards and bonuses can trigger between player turns and at the break.\n\nTurn Simplicity - 0.75/2\n\n+ Players use a series of rising and falling actions on their turn, with actions that aren’t used this turn increasing in power for the next. It adds an element of tension as players think about how long they can wait to do something.\n\n- Even with just 5 possible actions, it’s easy for players to go down a rabbit hole trying to optimize what they do. After triggering a bunch of bonuses and other actions, players may realize a different sequence would have been better and want to unwind things.\n\nFun Factor - 1.5/2\n\n+ Building out your zoo by placing tiles, especially early in the game, is a lot of fun. Adding a few animals to enclosures and reaping the benefits of more money and/or the ability to claim a conservation project creates a satisfying loop you want to repeat again and again.\n\n+ After the first few turns, you’ll almost always trigger some sort of bonus and look forward to the next one.\n\n- The zoo building is sadly pushed aside later in the game as it turns into a cutthroat race for points. Players will scramble to add any animals they can, especially those they may have held onto for the last turn.\n\nChallenge and Replayability - 2/2\n\n+ A huge deck of cards makes it infinitely replayable, especially with the marine expansion that also adds asymmetric cards for action selection.\n\n+ The gameplay is incredibly tactical and the puzzle of figuring out which cards you can use, when you can punish your opponent with a break, and how to push everything across the finish line at just the right time is addictive.\n\n+ There’s a high skill ceiling that will appeal to serious gamers.\n\n———————————-\n\nSOLO\nThere isn’t much here - just a “beat X score in Y turns” challenge, à la Terraforming Mars. The solo mode for Ark Nova is a bit better since most of the cards are still useful solo and they at least put in a bit of effort to create solo-specific components.\n\nI’d play it if I didn’t have any better options, but I certainly wouldn’t buy this game if I only played solo.\n\nSETI is a similar game with a much better solo experience.",
    "timestamp": 1760133600
  },
  {
    "username": "dlestarge",
    "rating": 7.0,
    "comment": "Fun, but can feel a bit too restrictive at times.",
    "timestamp": 1760047200
  },
  {
    "username": "BarFightBill",
    "rating": 7.0,
    "comment": "Best: 2-3\nOwner: Adam A",
    "timestamp": 1759960800
  },
  {
    "username": "edubvidal",
    "rating": 7.0,
    "comment": "Jugado a dos y nos ha gustado a ambos aunque es muy largo de duración y tiene poca interacción, pero lo que haces está muy bien relacionado: como se relacionan unas acciones con otras y el tema de potenciarse.\nJugado a cuatro y les ha encantado. Seguiremos jugándolo, a ver cuando se cansan. Dicen que aunque sea largo como las acciones son rápidas y distintas los turnos pasan sin aburrirse.",
    "timestamp": 1759960800
  },
  {
    "username": "wooloo1",
    "rating": 7.0,
    "comment": "Updated situational ratings:\n\n'8' at 2p with my wife. A real hoot with mating calls and table talk.\n\n'6' on BGA at any player count.\n\n'4' at 3p or 4p in person. Too long and (this applies to most tableau builders) too hard to track the other players' tableaus. So many other games I'd rather play at this player-count.\n\n**********\nOriginal comments:\n\nVery much enjoyed nearly 40 plays in 2022, mostly at 2p. The shine's worn off a bit, but I am still usually willing to play especially at 2p.\n\nArk Nova is objectively better than Terraforming Mars in every way. Period. End of discussion.",
    "timestamp": 1759960800
  },
  {
    "username": "Togii",
    "rating": 6.9,
    "comment": "Strategic Depth: 10/10\nRNG Mitigation: 9/10\nGoofiness Potential: 4/10\nSimplicity: 3/10\nArtistic Direction: 5/10\n\nTime Commitment: 60 min per player",
    "timestamp": 1759960800
  },
  {
    "username": "Ephorus",
    "rating": 7.0,
    "comment": "What I like:\n- Highly addicting.\n- Lots of variability due to different maps, card combinations, and animal projects.\n- Strategic/tactical depth due to card update mechanism, available cards, and different scoring alternatives. Also, one needs to actively monitor and plan the action card play order in order to be as efficient as possible.\n\nWhat I dislike:\n- Too many different animal / continent types which increases dependence on card draw luck.\n- One turn (action) does feel quite slow since the played card usually only has a single purpose. Hence, in one round I might draw a animal card, in the next I play a sponsor card, etc.",
    "timestamp": 1759528800
  },
  {
    "username": "Ddyraw",
    "rating": 7.0,
    "comment": "Cool puzzle, really great on BGA, not so great in person.",
    "timestamp": 1759442400
  },
  {
    "username": "Jasonlin778",
    "rating": 7.0,
    "comment": "來源：財神",
    "timestamp": 1759356000
  },
  {
    "username": "Infernal Turtle",
    "rating": 7.0,
    "comment": "The rulebook is very difficult to follow. Sentences have to be read over and over to recall and connect references to things that were mentioned in previous pages. As the learner i feel like I'm listening to the designer remind himself of how to play rather than teaching me.",
    "timestamp": 1758060000
  },
  {
    "username": "Frosty9",
    "rating": 7.0,
    "comment": "Very solid game. Lots of real estate and need to have very specific people to play with that like this kind of game.",
    "timestamp": 1758060000
  },
  {
    "username": "rikardus66",
    "rating": 7.0,
    "comment": "Juego de gestión de cartas con mayor complejidad de lo habitual en estos juegos. Partidas largas, interacción con tu tablero personal y un sistema de puntos que desconcentra.",
    "timestamp": 1757887200
  },
  {
    "username": "Xue_Y",
    "rating": 7.0,
    "comment": "Playing this on BGA is alright. The symbols are a tad too many for my likings which is a shame but I can see the appeal if this is a theme that appeals to you",
    "timestamp": 1757282400
  },
  {
    "username": "Penguinised",
    "rating": 7.0,
    "comment": "Definitley need more plays of this to form a stronger opinion, but on first play felt like what I wanted Terraforming Mars to be. It's very long though",
    "timestamp": 1757109600
  },
  {
    "username": "langschnabel",
    "rating": 7.0,
    "comment": "Next update: Down to a 7 again. It is a game, that just doesn’t completely give me a spark of joy or excitement. Played it after a year or so, but let me lukewarm.\n\nUpdate: Great Game, so much to love about it. This would be an easy 10, if there were not 2 major downturns for our group: The end mechanism leaves one often a little frustrated, because the game implies the feeling for new ones, that getting your markers crossed is the ultimate Goal of the game. If not achieved after 3 hours playtime, some feel frustrated. Other games have this „just one more turn“-feeling in a positive way, this one not. 2nd: the art is just not beautiful. Sadly this hold the game from hitting our table more often.\n\n_________\n\nI Tested german Prototype at Berlin Con 2021. Cards have a lot of synergies, Tableau-Builder with a lot of bonuses. Interesting winning conditions, action selection and bonus management system. Looks like an optimized Terraforming Mars, also with more interesting parts, more strategies and more opportunities to get cards for optimizing synergies. Also looks complicated at first glance, but is explained in less than half an hour.\n\nLooking forward to play the final version!",
    "timestamp": 1756677600
  },
  {
    "username": "rongbeo93",
    "rating": 6.5,
    "comment": "While the action selection and final scoring are interesting, the rest of the game feels dry. It's not a bad game, just not my cup of tea.",
    "timestamp": 1756677600
  },
  {
    "username": "weidox",
    "rating": 7.0,
    "comment": "Interesting action order+benefits handling, thematic cards (but I don't find inspiration in plain nature), and spoiled by Ascension/Dune Imperium style card row, which randomness makes the game only a tactical affair without strategy.",
    "timestamp": 1756159200
  },
  {
    "username": "sgyffy",
    "rating": 7.3,
    "comment": "First impressions were alright. There was obviously room for me to explore so I could be wrong, but it felt like my engine took too long to get going and then died out quickly. The game started off super slow and then ended too quickly at the same time. Like the engine progressions of the players playing wasn't a steady increase but a huge burst towards the end of the game.\nThe cards are often very felt very fuzzy. We were constantly looking at the glossary even with an experienced player leading the way. Cards in other games (Terraforming Mars) seem to be a lot clearer in the rules and intentions while still giving similar complexity in what they do.\nThe components were fine. They did the job. The organizers for tokens were a little disappointing. At first I was impressed they were included with the game but they couldn't organize the tokens very well (you couldn't put all the level 3 enclosures in a single slot for example).\nI liked the different and unique maps. That makes me excited to play it again.\nI liked that you decide to choose one of the two end game scoring cards in the middle of the game instead of the start. Gives you an opportunity to pivot your strategy based on the luck of the draw.\nMy score would likely improve if I played a second time. But I don't know why I would own this AND Terraforming Mars. They are very similar to how they play. The base building part and LOTS of player boards is a positive thing that I wish Terraforming Mars had.\n\nAfter sitting on it for a day, I've realized that it is at least a 7.",
    "timestamp": 1756159200
  },
  {
    "username": "SeerMagic",
    "rating": 7.0,
    "comment": "I think Ark Nova is a good game. And I understand why people love it so. I was shocked how well they picked up on it, especially my uncle who sometimes has trouble with filler games. I'm just over this game.\n\nI can't exactly put my foot on why, but I just don't care to play it anymore. Like I've gotten all I'm going to get out of the game.\n\n Ripping things out of other games comes together really well\n Engaging tile laying/park building\n Feels clean and smooth\n Both tactical and strategic\n Good game trays\n\n Association board should not have been separate\n The pvp effects in this game are not well done\n Mostly boring animal abilities\n A giant deck sometimes will not give you anything that helps you\n I hate the game end trigger and uneven number of turns",
    "timestamp": 1756072800
  },
  {
    "username": "larryjrice",
    "rating": 7.0,
    "comment": "8/25 - Starting to slide for me as there are some painful games where luck of the draw dooms you from the start. Starting to think about selling my copy - everyone else has it anyway!\n\n=========================================\n\nHonestly, this is probably best with 2. Each other player will only increase play time and down time. A friend asked me the other day which I preferred between Terraforming Mars and Ark Nova - I think my response would be Ark Nova for 2 player and TM for all other counts. If everyone is experienced, I'd likely still do 3 player but I would avoid 4 player like the plague.\n\n==========================================\n\nI'm continuing to enjoy the struggle of making synergies happen even when the card draw is reluctant to help you. ;-) Play time has significantly reduced from the learning game and two player games are now down to 90 minutes which is a welcome sight. The advanced map boards will cause the game to slow again at first since there is no opportunity for CP income on those boards so you can only earn them through playing cards with CP on them or completing CP projects. This works well for two players as the \"hate\" draft effect can be an effective play. Paying attention to what others can do is essential, particularly considering break timing. It is no fun to have a break occur when you an unused 2X token or have 6 cards you want to keep but you are only allowed to keep 3.\n\nFIRST IMPRESSION:\n\nNeed more plays to decide if it moves up or down. Not sure about the balance of tickets vs conservation. But one play likely doesn't answer that question well. One has to be okay with dry spells with the cards from time to time in this game and hope it doesn't happen near the end game. This is mostly solitaire outside of a few cards that will affect the leaders, etc. The central mechanic is solid although I wonder if there are some cards that are rarely worth upgrading compared to others. Game is fairly tactical as you have to play with the cards you have in hand or draw so it frequently is challenging to plan long term unless you have several cards in hand that work well together. Learning games will likely take a fair bit of time - my two player learning game took over 3 hours although I feel it should move along faster than it did. In my next play with three, it took just 2.5 hours so familiarity helped cut down the duration considerably. While you have to keep up in the game, this will likely come down to timing the end game well - since the final score is the difference between your two tracks.",
    "timestamp": 1755986400
  },
  {
    "username": "AimeeAce",
    "rating": 7.0,
    "comment": "I find it too swingy. There are too many types of cards to draw the types you want sometimes, especially in a 2-player game, so planning your turns in advance doesn't seem to work. It's kind of a fly-by-the-seat-of-your-pants kind of game.",
    "timestamp": 1755986400
  },
  {
    "username": "viovas",
    "rating": 7.0,
    "comment": "Good game. But you can easily do strategic failures. A bit too long for my taste. Much downtime.",
    "timestamp": 1755900000
  },
  {
    "username": "RConsonni",
    "rating": 7.3,
    "comment": "After a couple of very different games, I feel this game has some unfortunate over-powered combos. It seems to be an unpolished gem, that needs some tweaking to be a great game. This is rather frustrating.\nA friend suggested that the game would be defined by your starting hand, but this has yet to be better substantiated.\nAll I can say is that this game certainly won't make into my Top 50.",
    "timestamp": 1755813600
  },
  {
    "username": "BoardGaymesJames",
    "rating": 7.0,
    "comment": "\"Mechanics: 6: Decent- Decent mechanics but offers minimal complexity or meaningful variety.\nApproachability: 6: Simple - Fairly easy to learn with some rules complexity.\nReplayability: 9: Varied - Nearly endless options for replay.\nTheme & Art: 5: Present - There but not strongly connected.\nEnthusiasm: 5: Mild Interest - Occasionally willing to play if others want to.\"",
    "timestamp": 1755640800
  },
  {
    "username": "HenryTheSecond",
    "rating": 7.0,
    "comment": "Loaned to Mark Waites",
    "timestamp": 1755640800
  },
  {
    "username": "rafaelpaz",
    "rating": 7.0,
    "comment": "The game is great, without a doubt. The mechanic of chaining actions into \"forces\" allows for mind-boggling and highly satisfying combos. The theme is beautifully implemented.\nIt would get a 10 if the zoo were a single central board to compete for spaces and create truly exciting interactions.",
    "timestamp": 1755554400
  },
  {
    "username": "ystk",
    "rating": 7.0,
    "comment": "heavy\nsolo",
    "timestamp": 1755554400
  },
  {
    "username": "DogBucket",
    "rating": 7.0,
    "comment": "It’s good.",
    "timestamp": 1755381600
  },
  {
    "username": "arpogan",
    "rating": 7.0,
    "comment": "The mechanics seem fine, but I didn’t connect with the game at all – it was supposed to end up on my shelf, and in the end, I’m glad I got to play it before buying.",
    "timestamp": 1755036000
  },
  {
    "username": "Barthi",
    "rating": 7.0,
    "comment": "Bought in December 2021\n\nSleeved with Docsmagic Premium\n\nSold in June 2025",
    "timestamp": 1754776800
  },
  {
    "username": "ToreDenmark",
    "rating": 7.0,
    "comment": "Pretty Good game. Great as a two player non confrontational game or solo game.",
    "timestamp": 1754776800
  },
  {
    "username": "Zachfromohio",
    "rating": 7.0,
    "comment": "It's a pretty good euro game. There's a million of em out there. I am not sure why this gets so much love. I enjoy it, but it's not the greatest thing ever.",
    "timestamp": 1754604000
  },
  {
    "username": "Doctor_Cowboy",
    "rating": 7.0,
    "comment": "Fun-ish, but man... there are so so many cards. Each game is just a big random pile of \"what can you do with whatever pops up.\" not my favorite vibe in a game.",
    "timestamp": 1754344800
  },
  {
    "username": "selwyth",
    "rating": 7.0,
    "comment": "Shared puzzler taken to an extreme, where 2 sit at a table and stare at their own board, with the only interaction being tile draft, racing to certain objectives, and \"interaction tokens\" (which don't even allow you to target somebody, they just target everybody ahead of you). But the theme is charming for me, and the core Action Choice Cycling is cute and interesting for me. Fine if I take a 'Factory Fun' mindset into this.\n\n--------\n\nRaised rating from 7 to 10. I find this puzzle very interesting, and am already needing more cards. Player interaction revolves around whether to squeeze in another Association action before Break (or conversely, forcing an early Break), racing for common objectives, and taking cards others need. The penalties of interaction are not punitive, but add up and compound.\n\nHas the cute dynamic where players start with limited ability to draw from the common card track, so it’s more about timing and really making the draws work. Late in the game, have to really hate-draft.\n\n------------\n\nUltimately, this works better as a BGA video game, since there's little interesting player interaction.\n\n4+3",
    "timestamp": 1753308000
  },
  {
    "username": "dmwainw",
    "rating": 7.0,
    "comment": "BGA - Very similar to Terraforming Mars. Not my thing (yet).",
    "timestamp": 1753221600
  },
  {
    "username": "Ad_patres",
    "rating": 8.0,
    "comment": "Excellent ?\nUn peu complexe mais un must have !\nJ adore",
    "timestamp": 1762680660
  },
  {
    "username": "Bethobrien",
    "rating": 8.0,
    "comment": "Played with our neighbours Ewan and Jess and was a 6 hour playthrough!",
    "timestamp": 1762638240
  },
  {
    "username": "dJJa",
    "rating": 8.0,
    "comment": "EXPERT",
    "timestamp": 1762470000
  },
  {
    "username": "Brian1092",
    "rating": 8.0,
    "comment": "Only expansions",
    "timestamp": 1762297200
  },
  {
    "username": "WeirdFrog",
    "rating": 8.0,
    "comment": "Boardroom, 2-3 Hours, 2-3 Players [2]",
    "timestamp": 1762210800
  },
  {
    "username": "thetuism",
    "rating": 8.0,
    "comment": "Great role selection system where the less you use a role, the more power that role become. Can be pretty thinky. The two track scoring system is also pretty interesting. It can be a bit fiddly, and it could have better ways of keeping track of certain things (like income). For more player, I can see that it may have a bit of downtime between turns.",
    "timestamp": 1762210800
  },
  {
    "username": "Auroric",
    "rating": 8.0,
    "comment": "Someone called it Heavy Wingspan and I like that. Mostly solitaire game with good mechanics that provide a large tactical decision space. Many paths to victory, and building up your zoo polyomino style is quite satisfying. Variable round and game end triggers are an interesting addition I'd never seen before: deciding when to rush the end points is a big part of the strategy.\n\nIt is definitely a point salad/mechanic soup game, with extremely low interaction besides blocking. Players are a little too beholden to luck of the draw, and I'm also not a huge fan of the art. Game runs long, but can end quite suddenly. It's more of a race game than an engine builder, and this can feel a little unsatisfying.\n\nThat said, it does what it's trying to do extremely well. If you're in the mood for a mostly solo tableau/engine builder with a cool polyomino aspect, this is at or near the top. A more interactive version of this would be exceptional, but alas, it's just very good.",
    "timestamp": 1762210800
  },
  {
    "username": "bdakroub",
    "rating": 8.0,
    "comment": "This is my favorite card-driven engine builder--I even prefer it over Terraforming Mars. The best thing about this game is it's fun even if you don't win. At the end of the day, you get to create a unique zoo. This is also the heaviest game everyone in my family likes. I splurged and pre-ordered the 3D zoo component expansion, which may be the most ridiculous expansion ever made.",
    "timestamp": 1762124400
  },
  {
    "username": "Nanferun",
    "rating": 7.5,
    "comment": "Heavy euro game with a nice action card system.\nI get why this is more praised than said terraforming mars for example, even if some game maybe be a little long (usuarlly not more than 3 hours)\nComponents are better quaility and general is a great game i can give it that even if is not exactly for my taste.",
    "timestamp": 1762124400
  },
  {
    "username": "davidxiang",
    "rating": 8.0,
    "comment": "要重视协会和赞助商。动物不能贪多",
    "timestamp": 1762124400
  },
  {
    "username": "ElQuappo",
    "rating": 8.0,
    "comment": "zu verkaufen (?)",
    "timestamp": 1761865200
  },
  {
    "username": "MarathonPhil",
    "rating": 8.3,
    "comment": "Bumping the rating up after playing it with Marine Worlds. I would never play without the expansion now.",
    "timestamp": 1761778800
  },
  {
    "username": "SanktPeter",
    "rating": 8.0,
    "comment": "Erw. Wasserwelten\nErw. Zoo Maps 1\nErw. Zoo Maps 2\n2 Sätze Pläne 1a-8a\nInsert 3D-Druck",
    "timestamp": 1761692400
  },
  {
    "username": "Lemem",
    "rating": 8.0,
    "comment": "Ark Nova's action selection mechanic is what elevates it from the rest of the tableau builders that have swarmed the hobby over the past few years. Every turn is filled with difficult choices that players need to navigate to ensure success. The random card draw is a feature, not a crutch, that allows players to adapt tactical choices into broad strategies as they race to build a winning zoo.",
    "timestamp": 1761692400
  },
  {
    "username": "heatbbx",
    "rating": 8.0,
    "comment": "+ 3D Printed Insert\n+ Marine Worlds\n+ Fan-Made Prelude\n\nVERY crunchy, complex Zoo builder game. The animals and variety are really fun, the decision making is super crunchy. You'll almost wish there was more downtime between rounds so you can plan your next move. The flow of the game is a bit slow but otherwise such an unbelievable experience with the standard engine building feel. Occasionally overstays its welcome but generally a very fun, crunchy game.\n\nRating Tracker:\nNov 2022 - 8.5\nJun 2023 - 8 - overstays its welcome. I hope the new expansion helps!\nFeb 2024 - 9 - The new expansion helped!",
    "timestamp": 1761606000
  },
  {
    "username": "Drausqo",
    "rating": 8.0,
    "comment": "Game",
    "timestamp": 1761343200
  },
  {
    "username": "tag995",
    "rating": 8.0,
    "comment": "Incredibly replayable. best at 2-3p.\nThe interaction level is slight and indirect similar to wingspan, but Ark nova has more of a racing dynamic.",
    "timestamp": 1761170400
  },
  {
    "username": "Magneton",
    "rating": 7.5,
    "comment": "At 2 it gets very stalematey\n\nprzy bardzo pechowym układzie gracz może uciec już w pierwszej rundzie",
    "timestamp": 1761084000
  },
  {
    "username": "CatDadKil",
    "rating": 8.0,
    "comment": "Great game. Only sold because available on BGA. Fantastic habitat builder, five choices of actions that have a major impact on what is available during the game.\n\nGood strategy, a little luck, but mostly skill.",
    "timestamp": 1760997600
  },
  {
    "username": "Hynnot",
    "rating": 8.0,
    "comment": "VENDER?",
    "timestamp": 1760911200
  },
  {
    "username": "Hiimallen",
    "rating": 7.5,
    "comment": "This game has \"need to play more than twice a year to enjoy\" power",
    "timestamp": 1760824800
  },
  {
    "username": "vincent840114",
    "rating": 8.0,
    "comment": "18/10/2025",
    "timestamp": 1760738400
  },
  {
    "username": "Garth M",
    "rating": 8.0,
    "comment": "Provisional 8 after first game. The Civ New Dawn sliding card system works well, the terraforming mars style tableau building is satisfying - it's a lovely package. Of course how much we enjoy it depends on how those card interactions play out in subsequent games. Could go up.",
    "timestamp": 1760479200
  },
  {
    "username": "identisick",
    "rating": 8.0,
    "comment": "The action selection is what elevates this from the standard Euro-y 'move up the track goodness'. Maybe a little too long for what it is, and downtime can be a bit egregious, but it's a lot of fun",
    "timestamp": 1759788000
  },
  {
    "username": "Catyrpelius",
    "rating": 8.0,
    "comment": "Really benefits from multiple plays.",
    "timestamp": 1759701600
  },
  {
    "username": "thefatcyclist",
    "rating": 8.0,
    "comment": "***IV-4",
    "timestamp": 1759615200
  },
  {
    "username": "Therealheinz",
    "rating": 7.5,
    "comment": "Hugendubel",
    "timestamp": 1759615200
  },
  {
    "username": "eltangente",
    "rating": 8.0,
    "comment": "A precision time-piece of finely tuned interlocking mechanisms, there is much more to Ark Nova than building enclosures, filling them with wildlife and funding projects.\n\nKeeping an eye on who might snap that card you need, fund that award, or trigger the break bringing the turn to an end makes for a tense experience that belies the charming artwork and cute components.\n\nThe variety of park maps, ways to score, and huge range of cards keeps the game fresh, with new strategies and combos revealing themselves, even after 20+ plays.\n\nWhile it can be hard to come back from an early bad turn, and is a bit low on player interaction for my taste, the game is such an addictive puzzle that I'll rarely turn it down.",
    "timestamp": 1759528800
  },
  {
    "username": "gpli_11",
    "rating": 8.0,
    "comment": "What I loved:\n- Building the proper enclosure type/size to play animal cards.\n- Conveyor belt action selection is awesome and needs to be in more games.\n- Loved the same end game trigger mechanism as Rajas of the Ganges where the two point trackers meet, but in a much better game imo.\n- the card's art are actually beautiful in real life with a beautiful finish that is easy to splay, shuffle and pick up.\n- You can only upgrade 4 out of 5 action cards, giving it a somewhat asymmetry feel. I am looking forward in playing with unique player boards next time!\n\nWhat I found neutral or have concerns:\n- Releasing animals to score points in one point track but loses in another, discard the animal card, flip the appropriate enclosure, it feels a fiddly and convoluted.\n- Besides first come first serve, very limited player interaction.\n- Question whether the personal end game cards are balanced (I completed my zoo pretty easily and I don't need to worry about the luck of the draw).",
    "timestamp": 1759442400
  },
  {
    "username": "eldub",
    "rating": 8.0,
    "comment": "Have finally come to terms with the fact that this game is fundamentally a 10...but I have less and less fun the more I play it. I think the variance problems are so hard to overcome for many players unless you're just a really good card player who has lightning-quick ability to calculate ROI based on heuristics of probabilities and instincts. And when you play against those people, it's not very fun. Ultimately, I think my rating drops simply because I've hit my skill cap on this game, and it's not very high, and the only people I can get to play with me are significantly better at this type of game to the point where it's not competitive.",
    "timestamp": 1759442400
  },
  {
    "username": "eiphi",
    "rating": 8.0,
    "comment": "heavy but fun",
    "timestamp": 1759356000
  },
  {
    "username": "pastej",
    "rating": 8.0,
    "comment": "I have played this a handful of times by now. I like this take on the 'huge amounts of cards' game, in the same vein as Terraforming Mars and Earth. The variation is fun, but not too overwhelming. I think the cards are varying enough here. I like it!",
    "timestamp": 1759269600
  },
  {
    "username": "lswaage",
    "rating": 8.0,
    "comment": "9/2025 Tense engine building race under a cozy theme. Will probably see more play.\n\n24/12-2024 Much appreciated season holiday gift.",
    "timestamp": 1759183200
  },
  {
    "username": "Danyxandro",
    "rating": 8.0,
    "comment": "an engine builder with resource management and tile placement?\nIt's a bit complex because triggering many effects but just playing an action once per turn makes it simple enough to not be overwhelmed",
    "timestamp": 1759096800
  },
  {
    "username": "atlas64gaming",
    "rating": 8.0,
    "comment": "AUGUST 2025: 40TH\nFEBRUARY 2025: 30TH\nAUGUST 2024: 23RD\nFEBRUARY 2024: 19TH\nAUGUST 2023: 19TH",
    "timestamp": 1759096800
  },
  {
    "username": "Ironclad_Board_Gamer",
    "rating": 8.0,
    "comment": "Collection",
    "timestamp": 1759010400
  },
  {
    "username": "Adri_corr",
    "rating": 8.0,
    "comment": "(1, 4) #players",
    "timestamp": 1759010400
  },
  {
    "username": "shayan_sa",
    "rating": 8.0,
    "comment": "I think the luck involved in this game is significant, and I prefer it solo and two players, since interaction is not that interesting, but the flow of the game is addicting. Good game, but I think it is overrated.",
    "timestamp": 1758924000
  },
  {
    "username": "MiniatureMan",
    "rating": 8.0,
    "comment": "nice Euro. takes a bit long.",
    "timestamp": 1758837600
  },
  {
    "username": "Ralder",
    "rating": 8.0,
    "comment": "Ayla",
    "timestamp": 1758837600
  },
  {
    "username": "BubbleheadAmber",
    "rating": 7.5,
    "comment": "PROS:\n- Does feel like you're building a zoo\n- Card combo potential is addicting\n- Nice game arc of starting slow but things ramping up quite quickly\n- Interesting puzzle\n\nCONS:\n- Not a lot of interaction in the game, a lot of MPS\n- Game feels like an amalgamation of good mechanics instead of innovating\n- Game can feel same-same after a while without card modifiers in expansion\n- Lacks the tension of other MPS games that I enjoy, too cozy for my liking\n\nFINAL THOUGHTS:\nFun game for those who enjoy tableau building, Zoo Tycoon and cozy MPS (but that's not me lol)\n\nUPDATE:\n7.5: After playing a couple of games online, I can now see why this game is so popular. It really does feel like you're managing your own zoo whilst still being a nicely designed Euro. Still too much of an MPS optimization puzzle to play in person (otherwise, it'll be a 9).",
    "timestamp": 1758664800
  },
  {
    "username": "MarcoIlMagnifico",
    "rating": 8.0,
    "comment": "Caveat: I have only played it once with 3 players. I can understand the hype. It's a good game mechanic that is not overly complicated and thematically sound. I definitely want to play again.\n\nPossible niggles:\n- Is this too much multi-player solitaire?\n- No catch-up mechanic in a long game (that I could see).\n- At 4 players (our usual group size) - I could imagine it taking a LONG time, with a lot of downtime, no catch-up and risk that you often get inadvertently foiled by an opponent.",
    "timestamp": 1758578400
  },
  {
    "username": "Dkarpoj",
    "rating": 8.0,
    "comment": "The more I play it the more I like it. Addictive play. Great puzzle with a high skill ceiling. Rising\n\nExpansion kmc.\nCapstone. Alan’s",
    "timestamp": 1758578400
  },
  {
    "username": "DrBARKIN",
    "rating": 8.0,
    "comment": "All sleeved + Turkish Paste ups",
    "timestamp": 1758492000
  },
  {
    "username": "IvoryDaggers",
    "rating": 8.0,
    "comment": "How can this game be so long and yet at the end you're still desperate for 3-4 more turns to get everything done?! Building a zoo is never really finished...",
    "timestamp": 1758492000
  },
  {
    "username": "CoachErv",
    "rating": 8.3,
    "comment": "Sold to Hong Quan\n\nDIFFICULTY: HARD",
    "timestamp": 1758405600
  },
  {
    "username": "superwai28",
    "rating": 8.0,
    "comment": "The hype is real. I couldn't believe I enjoyed the official solo game without an AI opponent. It's still cool to figure out your own puzzle and look for combos. Definitely need to give more plays to this.",
    "timestamp": 1758319200
  },
  {
    "username": "Papinek",
    "rating": 9.4,
    "comment": "Eines der wohl besten Spiele, das bei uns je auf dem Spieltisch zu finden war ! Die Komplexität in Verbindung der variantenreichen Auswahlmöglichkeiten ist außergewöhnlich ! Obwohl ich Zoos hasse, zieht mich dieses Spiel komplett in den Bann ! Dito für meine Mitspieler ! Außer den grässlichen Spielertableaus sind das Artwork und das Material extrem gut gelungen ! Alles in allem : Bravo Mathias !!! Ein Meisterwerk !!! Die Erweiterung fügt sich der Klasse an, nur schade, daß sich ein Hai zerteilen lässt und er auch noch überlebt !",
    "timestamp": 1762598700
  },
  {
    "username": "smriera",
    "rating": 8.5,
    "comment": "Steam. No lo tendría en físico, pero en solitario y con la app funciona genial.",
    "timestamp": 1762588800
  },
  {
    "username": "ingg",
    "rating": 9.0,
    "comment": "타오바오 플레이매트\n개인판 아크릴 레이어",
    "timestamp": 1762470000
  },
  {
    "username": "korosuuu",
    "rating": 9.0,
    "comment": "43€\n???",
    "timestamp": 1762383600
  },
  {
    "username": "ditterio",
    "rating": 9.0,
    "comment": "ARNO solo mode: https://boardgamegeek.com/filepage/236535/arno-alternative-s...\n\nSolo app ARNO: https://brdgm.me/ark-nova/#/\n\nTeaching aid: https://boardgamegeek.com/filepage/232702/ark-nova-plain-and...\n\nComplete compact rules: https://boardgamegeek.com/filepage/241105/action-andy-ark-no...\n\nFAQ: https://boardgamegeek.com/filepage/235760/ark-nova-official-...\n\nStrategy guide: https://boardgamegeek.com/thread/3201460/what-i-learned-100-...\n\n2 rules updates from the publisher: https://boardgamegeek.com/thread/3057107/2-rules-updates-ark...\n\nOfficial solo:\nI've won with map 0, 1, 2, 3, 4, 5, 6, 7 & 8. I started with 20 popularity.\nI've won solo on map A, 0 and 1. I started with 10 popularity.\n\nLonger solo game: play arno solo variant.\nShorter solo game: play official solo mode.\n\n18 cards variant: https://boardgamegeek.com/filepage/259756/ark-minima-ark-nov...\n\nReeds gespeeld met:\nBouwen 0 en 1\nKaarten 0 en 1\nSponsoring 0, 2 en 4\nDieren 0, 3 en 4\nSamenwerking 0, 1 en 3\n\nSolo:\n\nUnofficial Solo Variant - ARNO\n\nKind of solo: Automa\n\nTime: 80 minutes against 2 automas\nSetup: Medium\nDifficulty: Medium (different levels)\nAutoma management/Upkeeping: Easy\nRequirement: PnP deck or app\n\nOpinions: Automa that can be played through a deck. Chance to get the PnP cards or use an app. The automa has several levels and replicates quite well a human players. Nevertheless, some rules need to be used as the solo mode.\n\n+ Opportunity to play against more automas\n+ Different levels\n+ Automa easy to manage\n+ The app helps track almost all developments of the automa\n+ High replyability\n+ Automa acts like a normal player with some minimal adjustments\n\n- Interactive cards follow official solo rules\n\n\n--------------------------------------------------------------------------------------------------------------------------------------------------\n\nUnofficial Solo Variant - HAVEN\n\nKind of solo: Automa\n\nTime: 80 minutes against 1 automa\nSetup: Medium\nDifficulty: Medium (different levels)\nAutoma management/Upkeeping: Easy\nRequirement: PnP deck\n\nOpinions: Very easy to manage automa that requires minimal upkeeping. Solid alternative to Arno. If you look for a game with more automa and reflects a normal multiplayer game the choice is Arno but if you just want to focus on your game, Haven is a valid choice.\n\n+ Very simple, it allows the player to focus on the game\n+ Minimal automa management and upkeeping\n\n- Automa follows different rules than players\n\n----------------------------------------------------------------------------\n\nGreat card game in a great game. This is how you make an engine builder work.",
    "timestamp": 1762297200
  },
  {
    "username": "CptRoboto",
    "rating": 9.0,
    "comment": "Played Rocky's copy solo",
    "timestamp": 1762297200
  },
  {
    "username": "EpicFrenzy",
    "rating": 9.2,
    "comment": "Game plays and flows very well and animals are cool. Only cons I have are the component qualities being not amazing.",
    "timestamp": 1762210800
  },
  {
    "username": "jann1",
    "rating": 9.0,
    "comment": "This is a game that I thought I didn't understand and didn't know how I could win, but after playing it in table with friends it clicked with me very quickly. I would start stratezing and realise that I needed to adapt fast to the things happening at the table. This is something I love about games, Base strategy but deep tactics",
    "timestamp": 1762210800
  },
  {
    "username": "HaoTien",
    "rating": 9.0,
    "comment": "机制太丰富了，五大行动，又是拼图，还要抢分，抢成就。新人建议先升建造，玩熟练了可以不升建造，先升赞助商，。刚开始玩有点分不清赞助商和保护项目。只能说把主题和游戏机制尽量贴合吧，行动强度机制不错，缩减了downtime时间，基本到自己不会考虑执行哪个行动（默认执行强度5的行动）。可玩性很高，还能学学各种动物叫什么名字",
    "timestamp": 1762124400
  },
  {
    "username": "Kazz711",
    "rating": 9.4,
    "comment": "My 1# game! (2023,2024)(BGA + IRL over 100 plays!)",
    "timestamp": 1762124400
  },
  {
    "username": "AdalynIris",
    "rating": 9.2,
    "comment": "Very nice game, far from the typical boring euro themes. The solo game is easy and short, although it is limited to try to gain more than a threshold in points. I would prefer a bot more similar to a human opponent (ANRO variant is better in that aspect). Game with more players is somewhat long and multi-solitaire.\nI upgraded my score thanks to ARNO. ARNO should be made the official solo. It is similar to playing to human opponent, but without AP.",
    "timestamp": 1762038000
  },
  {
    "username": "weceq",
    "rating": 9.0,
    "comment": "#players\n#haevy",
    "timestamp": 1762038000
  },
  {
    "username": "Zevgart",
    "rating": 8.5,
    "comment": "Really good base game, needs expansion or few for perfect score",
    "timestamp": 1761951600
  },
  {
    "username": "Connduit",
    "rating": 8.5,
    "comment": "2-4\n\nIf playing with more than 2, accelerated start.",
    "timestamp": 1761865200
  },
  {
    "username": "Final_Meeple",
    "rating": 9.0,
    "comment": "Top 50 Games of 2022 - #10\nTop 50 Games of 2023 - #5\nTop 50 Games of 2024 - #8",
    "timestamp": 1761865200
  },
  {
    "username": "Swchiddy",
    "rating": 9.0,
    "comment": "I love the animal theming. Gotta get them workers out, and maximize conservation efforts.",
    "timestamp": 1761865200
  },
  {
    "username": "LordYazos",
    "rating": 9.5,
    "comment": "Deep, in itself simple rules. Often compared to TerraForming Mars, but for me a totally different game. What action do you do when and how strong do you want that action to be, always fun to think about.\n+ zoopacks 1 and 2",
    "timestamp": 1761778800
  },
  {
    "username": "FoxRageQc",
    "rating": 8.5,
    "comment": "K Played",
    "timestamp": 1761692400
  },
  {
    "username": "LapoElKhan",
    "rating": 9.0,
    "comment": "Most solid, coherent and well made gameplay design of a board game with a perfect learning curve that always leaves room for improvement. I have played 20 games and still I have not found a roof on game knowledge needed to have better skills.\n\nThe best board game of its kind.",
    "timestamp": 1761692400
  },
  {
    "username": "frasti",
    "rating": 8.5,
    "comment": "Player 2 start with a X token. Beginner special rules\n\nBeginners keep all starting cards. As free action, may discard 3 cards to add any tag until end of turn. At the end of your Draw action, top deck a card. No game end goals, gain 4 CP at the end.\n\n2x core, 2x map pack 1, 1x map pack 2, marine worlds, map 1-8a, map T2, fan made maps, DT 24 promotion team, capybara\n\nModifications: Okapi stables, Free range monkey, build 2, association 2, habitat and diversity projects are 4/3/2 CP, Hollywood H also marketing. Banned: Build 3, cards 3, sponsor 2, association 2, map 3 and 10, free range monkeys, emu, franchise business, reconstruction\n\n25/08/19 [] GF elephant sundrop pldege (+ arcade promo sundrop), turtle pledge, 2 x BGA maps, free gift\nADD map ability promos and coffee mug when PM opens",
    "timestamp": 1761692400
  },
  {
    "username": "obermeit",
    "rating": 9.0,
    "comment": "German 1st edition (Arche Nova)",
    "timestamp": 1761606000
  },
  {
    "username": "BoardgameBriBri",
    "rating": 8.5,
    "comment": "PERSONAL LIKES\nCategory: Animals, environmental\nMechanisms: Events, grid coverage, hand management, income, open drafting, set collection, tags, tile placement, track movement, variable player powers\nOther: Engine building",
    "timestamp": 1761519600
  },
  {
    "username": "YoLYcmqZ",
    "rating": 9.0,
    "comment": "Thoughts: Love the variability. Each game feels like a unique challenge. Play it a ton on BGA. The highs are incredibly high when everything clicks, but the lows sting when your strategy falls apart. The depth keeps me coming back—there's always another angle to explore. Meaty, satisfying, and rewards repeat plays.\n\nTag(s): Heavy Euro, Hand Management, Engine Builder\nBest Player Count: 1-3, {2}\nRating: 9, +0.0\nOwn: Physical, Digital, BGA\n+ Ark Nova: Marine Worlds\n+ Zoo Map Pack 1\n+ Zoo Map Pack 2",
    "timestamp": 1761519600
  },
  {
    "username": "JGMTFreedom",
    "rating": 9.0,
    "comment": "Players: 2-4",
    "timestamp": 1761519600
  },
  {
    "username": "macUladh",
    "rating": 9.0,
    "comment": "A pinnacle of Euro gaming, Ark Nova offers a complex efficiency puzzle with a surprisingly unified design, where the theme carries the logic of gameplay. You build enclosures to house animals to earn income from ticket sales to build more enclosures... eventually supporting conservation projects, partnering with universities and other zoos, and acquiring more and more impressive animals for your zoo. (Best played with Marine expansion.)",
    "timestamp": 1761519600
  },
  {
    "username": "SuAlfons",
    "rating": 9.0,
    "comment": "Not a hard game, but one that has a lot of possible actions per round. Artwork is nice, but looks a bit like an office job came to be a board game.",
    "timestamp": 1761429600
  },
  {
    "username": "Bresciano",
    "rating": 9.2,
    "comment": "remote",
    "timestamp": 1761429600
  },
  {
    "username": "Herdelia",
    "rating": 9.0,
    "comment": "Komplexes Spiel mit Suchtfaktor",
    "timestamp": 1761343200
  },
  {
    "username": "TabledTonight",
    "rating": 9.0,
    "comment": "Marine Worlds Expansion",
    "timestamp": 1761256800
  },
  {
    "username": "grayzilla",
    "rating": 8.5,
    "comment": "Mostly interested in combining with something else to trade for one game. Desire to trade is not very high.",
    "timestamp": 1761170400
  },
  {
    "username": "Kangri",
    "rating": 9.5,
    "comment": "Une fois les règles assimilées, envie de jouer et rejouer tant les choix possibles sont variés. Les différentes mécaniques combinées (collection, polyominos, placement d'ouvriers, programmation ...), le scoring qui monte en puissance et apporte une grosse tension en fin de partie (à la manière de Rajas of the Ganges), le juste niveau d'interaction, la courbe d'apprentissage importante tout comme la rejouabilité, tout concourt à en faire un grand jeu, incontournable dans toute ludothèque Expert. Pour celles et ceux qui jouent en solo, le fantastique mode ARNO est à télécharger impérativement et évite la course aux points de la version officielle.",
    "timestamp": 1760997600
  },
  {
    "username": "sheleemk",
    "rating": 9.0,
    "comment": "Really like the card river mechanic, and the Arno solo variant.",
    "timestamp": 1760997600
  },
  {
    "username": "Alex_P_",
    "rating": 9.0,
    "comment": "Love the action selection mechanism, the card interaction and comboing. Exceptional card-driven tableau and engine builder. Highly recommended.",
    "timestamp": 1760911200
  },
  {
    "username": "Grape_Deuce",
    "rating": 9.0,
    "comment": "Great game, both solo and multiplayer. Only played the physical copy solo, the rest was on BGA.\n\nLove the game, but only play on BGA. Sold on BG Market",
    "timestamp": 1760911200
  },
  {
    "username": "newminimon",
    "rating": 9.0,
    "comment": "Great game but very long and requires a really large table.",
    "timestamp": 1760911200
  },
  {
    "username": "PBandJellyfish",
    "rating": 9.0,
    "comment": "@TX",
    "timestamp": 1760824800
  },
  {
    "username": "foamcore",
    "rating": 9.0,
    "comment": "Digital edition (Steam)",
    "timestamp": 1760824800
  },
  {
    "username": "zaubertee",
    "rating": 9.0,
    "comment": "+ Wasserwelten\n+ Zooplan Pack 1 & 2",
    "timestamp": 1760824800
  },
  {
    "username": "Xaby84",
    "rating": 8.5,
    "comment": "2. kiadás",
    "timestamp": 1760738400
  },
  {
    "username": "TheEvinator",
    "rating": 9.0,
    "comment": "Great 2 player game. For 3-4 players it takes too long for us. We play an average of 1,5 hours per person. Love it more with the expansion of waterworlds.",
    "timestamp": 1760652000
  },
  {
    "username": "Adzemattie",
    "rating": 9.0,
    "comment": "It has a great theme. What I like most about the game is that you constantly have to adjust your strategy based on the cards you draw. It never ends the way I imagine when I get my first cards.",
    "timestamp": 1760652000
  },
  {
    "username": "rezett",
    "rating": 9.0,
    "comment": "Great Game, A deep and high skill-ceiling game.",
    "timestamp": 1760479200
  },
  {
    "username": "Ghosting49er",
    "rating": 9.0,
    "comment": "Building your own zoo in competition with other players. Beautiful game and loads of fun. Does take some time to learn and play.",
    "timestamp": 1760479200
  },
  {
    "username": "Jumicorinbo",
    "rating": 9.0,
    "comment": "Never gets old. Playability infinite, fun factor constant. Try it, buy it. Be happy.",
    "timestamp": 1760479200
  },
  {
    "username": "ethanbg20",
    "rating": 9.4,
    "comment": "Great.\n\nChanged July 2025 \"8\" rating.",
    "timestamp": 1760306400
  },
  {
    "username": "SJS1971",
    "rating": 9.0,
    "comment": "Great game. Love it solo too (with ARNO, a fan made solo mode).",
    "timestamp": 1760306400
  },
  {
    "username": "igor_f",
    "rating": 8.8,
    "comment": "1-4",
    "timestamp": 1760220000
  },
  {
    "username": "prinzit",
    "rating": 10.0,
    "comment": "Animals, full of animals.",
    "timestamp": 1762691040
  },
  {
    "username": "Napattack",
    "rating": 10.0,
    "comment": "3.78\n1-3\nBest at 2\n150 (8,850)\n#1",
    "timestamp": 1762661940
  },
  {
    "username": "Stevie008",
    "rating": 9.5,
    "comment": "45 plays\n35 BGA\n10 live\n\n2025:\n28 plays\n24 BGA\n4 live (incl. ring)",
    "timestamp": 1762651620
  },
  {
    "username": "HairyPotter",
    "rating": 10.0,
    "comment": "Ark Nova is a puzzly race, with an impressively wide decision space to keep each game feeling fresh. It's a largely tactical game, which opens up in exciting ways as the game progresses. My favorite part of the game is the action selection system.\n\nIt's a very well designed game with an inviting theme. High replayability and good cardplay will make this get to the table quite often. The expansion maps and Marine Worlds are all worthy additions to the base game, and are always integrated into our game sessions of Ark Nova.\n\n100 plays in, and I continue to be impressed by how creative the game allows the player to be, with so many viable avenues to explore on the way to success.",
    "timestamp": 1762615800
  },
  {
    "username": "Jinxie73",
    "rating": 10.0,
    "comment": "Love love love!! One of the few games I will get expansions for when they become available. Already funded the 3dtion on KS.",
    "timestamp": 1762470000
  },
  {
    "username": "gabtoschi",
    "rating": 10.0,
    "comment": "Played on BGA. At first glance, Ark Nova seems quite complicated, but the truth is that it manages to distill a lot of strategic depth into rules that aren't all that dense. It seems like a good medium-heavy transition game. I had a lot of fun and would be very happy if someone brought it to the table.",
    "timestamp": 1762470000
  },
  {
    "username": "williamdmp",
    "rating": 10.0,
    "comment": "The theme, mechanics, and essence of this game come together perfectly. Time after time, I find myself bringing this to the table. Great balance between strategy/tactics in this game, feels like it suits my play style well. High replayability and ideal playtime for me (playing 2-3p). will always be a fav!",
    "timestamp": 1762383600
  },
  {
    "username": "Tinopolis",
    "rating": 10.0,
    "comment": "Best game ever:\nvariable, beautifully designed, good balanced",
    "timestamp": 1762297200
  },
  {
    "username": "nicoleku",
    "rating": 10.0,
    "comment": "Best game that can be played always and very often",
    "timestamp": 1762297200
  },
  {
    "username": "jennazaid7",
    "rating": 10.0,
    "comment": "My favorite game of all time\n\n+ map pack 2",
    "timestamp": 1762210800
  },
  {
    "username": "Dahje",
    "rating": 9.5,
    "comment": "It always seems to play long no matter the player count, but never feels like it overstays its welcome.",
    "timestamp": 1762210800
  },
  {
    "username": "loop5",
    "rating": 10.0,
    "comment": "Allround fantastic game",
    "timestamp": 1762124400
  },
  {
    "username": "Bkoons",
    "rating": 10.0,
    "comment": "w/ Marine expansion",
    "timestamp": 1762124400
  },
  {
    "username": "BlueEyesLX",
    "rating": 10.0,
    "comment": "Sleeved with Docsmagic Double Mat Clear Premium Sleeves (DMS625)\nMulticolored Insert by E-Raptor",
    "timestamp": 1762124400
  },
  {
    "username": "godunow",
    "rating": 10.0,
    "comment": "+ Wodny świat\n+ Meeple stickers\n\n+ 3dition [26Q4?]",
    "timestamp": 1762124400
  },
  {
    "username": "Sly_Quick",
    "rating": 9.6,
    "comment": "+ Marine Worlds Expansion\n+ Map Pack 1/2\n\n(Folded Space Inserts)",
    "timestamp": 1761951600
  },
  {
    "username": "Exodusland",
    "rating": 9.5,
    "comment": "This game is pure awesomeness for 2 players. My wife played Zoo Tycoon 2 a lot and when she saw this game in a shop, it was already decided what to get. (I abandoned my wish to get Revive or Seti, for Ark Nova  ) Even though I didn't like the theme at first, was never intrigued to play a board game with animal theme, it works pretty well.\n\nWhat we like:\n1. Trays - thank God!\n2. Design - I mean its alright. The box, the cards and the hex tiles all look good.\n3. Mechanism - tile placement, card activation and \"worker placement\" works great together.\n4. Theme - The zoo theme works really good, even though its a euro game, the theme is not completely lost in between the numbers.\n5. Rules - the rules are written pretty straightforward, I had to check a few info though on the internet.\n\nWhat we don't like:\n1. Design - the main board and the player boards are rather shallow by graphic design.\n2. The VP track was a bit confusing at first, but we got used to it after 2-3 plays.\n3. I wouldn't play it with more than 2 players, as AP is a real thing.\n\nOverall, the game is fantastic. We enjoy every moment. The theme is rather refreshing, after all the Anachrony and Gaia Project sci-fi theme",
    "timestamp": 1761865200
  },
  {
    "username": "Sinoc",
    "rating": 9.5,
    "comment": "Near perfect game, a bit long and with a bit of luck : winning depends of the cards you take. But with a lot ( a lot !!) of cards, it's really interresting. Good mechanich with your 5 actions. Has to be played by max - 3 players, better with 2 !",
    "timestamp": 1761865200
  },
  {
    "username": "EnYoMe",
    "rating": 10.0,
    "comment": "Update 3: Played 36 games since then. Thx to BGA. It is one of the most played games for us now on table and BGA too. So it meens to me, that this game has its curve of learning and meanwhile it makes you addicted \nUpdate 2: played twice with 3 players. Each took close to 4 hours. But it was fun all along. Won’t be my favorit, but it is deffenetly enjoyable, easy to teach/learn, medium-heavy, fun game. Recomended.\n\nUpdate: Played it in 2 player mode. It is much more fun. You can play with the time which in solo mode you can’t. But it is also true that with 2 players it took more then 4 hours to finnish. For sure it will be faster later, but it is still a very long game.\n\nPlayed the solo mode couple of times only sofar. I am sure that with 2-3 player would be much more fun. In solo mode I didn’t see more then 15-20% of the cards in a game. It ended too fast first. Second was close to win, but I had the sensation that with more people playing would give more rounds then the automa. And more rounds means nicer zoo.\nWill play it more for sure, but preferebly not is solo mode.\nAnd oh yes, it is true, they should have been titled it Terraforming Zoo.",
    "timestamp": 1761778800
  },
  {
    "username": "elggun",
    "rating": 10.0,
    "comment": "I think this might be the one that dethrones Terraforming Mars for me.",
    "timestamp": 1761692400
  },
  {
    "username": "vince821",
    "rating": 10.0,
    "comment": "So",
    "timestamp": 1761692400
  },
  {
    "username": "Chalvin",
    "rating": 10.0,
    "comment": "One of our favorites. The theme is fun. The game mechanics are simple, but the strategy can be complex if you play that way. I love the idea of two scoring tracks that intersect.\n\nI have two critiques. One is that players can get a bit stuck for a while without ways to earn green points if their starting hand doesn't provide a good path to early points. The other issue is that game-end comes too suddenly. Points are earned slowly at first and much more quickly in the later part of the game. If one player gets an early lead, it can be very difficult to catch up, as they'll be set up to earn more points than those behind them, and they'll then trigger the end game before some players have had a chance to really enact their strategy.\n\nDespite those critiques, I love the game and play it often.",
    "timestamp": 1761519600
  },
  {
    "username": "Riverdell",
    "rating": 10.0,
    "comment": "Loads of cards, whats not to like.\nNot very innovative though, but still a lot of fun (e.g. the two scoring bars are copied from Raja of the Ganges).",
    "timestamp": 1761429600
  },
  {
    "username": "bdavid0127",
    "rating": 10.0,
    "comment": "H",
    "timestamp": 1761343200
  },
  {
    "username": "el_crosso",
    "rating": 10.0,
    "comment": "So good has a TFM vibe and has tons and tons of cards. It isn't an easy game to initial grasp, but it is one which keeps lingering on in your head",
    "timestamp": 1761084000
  },
  {
    "username": "junes19",
    "rating": 9.5,
    "comment": "매력적인 동물원을 조성하고, 보호 프로젝트에 기여하여\n두 가지 점수 트랙을 적절히 달성해 승리해야하는 게임\n\n카드 놓기, 일꾼 놓기의 적절한 조화\n\n룰을 설명하는데 오랜 시간이 걸리지만\n보드위에 룰에 대한 단서조항이 전부 남겨져 있어\n한번만 설명을 들어도 누구나 재밌게 게임을 플레이할 수 있다.\n\n다만, 아쉬운 점이라면 일꾼 활용이 조금 애매하는 것?\n\n하지만 그것이 재미 점수의 마이너스 요인이 되지는 않는다.",
    "timestamp": 1761084000
  },
  {
    "username": "b4retina",
    "rating": 9.5,
    "comment": "Solo Play Bot:\nStandard solo,Easy level - W89a-64c or 25 victory points\n\nSolo Play AI on PC:\nEasy W- 120-105\nEasy L- 87-111\nEasy W- 114-88\nEasy L- 104-115\nEasy W- 133-99 Map 0\nEasy L- 110-115 Map 0\nEasy L- 109-119 Map 0\nEasy W- 133-101 Map 0\nEasy W- 114-94 Map Silver Lake\nMed W- 128-115 Map Hollywood Hills\nMed L- 119-143 Map Research Institute\nMed W- 124-118 Map Silver Lake\nMed W- 130-115 Park Restarant\nMed W- 130-91 Map Silver Lake\nHard W- 114-112 Park Gates\nHard L- 106-113 Research Institute\nHard W- 125-94 Outdoor Area\nHard W- 128-96 Outdoor Area\nHard W- 119-105-73 Silver Lake\nHard W- 114-103-79 Silver Lake\nHard L- 110-95*-88 Hollywood Hills\nHard L- 105-82*-78 Research Institute\nHard W- 127-120 Research Institute",
    "timestamp": 1761084000
  },
  {
    "username": "Jolman42",
    "rating": 9.5,
    "comment": "Ce jeu est profond et intéressant, thématique, rejouable à l'infini, avec mode solo incroyable : Un véritable classique. Il pêche légèrement par ses visuels vraiment horribles et son manque de flexibilité sur le nombre de joueurs : Je n'ose même pas imaginer le temps de jeu d'une partie à quatre joueurs.",
    "timestamp": 1760997600
  },
  {
    "username": "cgh3rd",
    "rating": 10.0,
    "comment": "Best game most consistently competitive game ever for my wife and I. Most played game too.",
    "timestamp": 1760997600
  },
  {
    "username": "Reniardegrin",
    "rating": 10.0,
    "comment": "Perfekt Game ?",
    "timestamp": 1760824800
  },
  {
    "username": "Paugolg",
    "rating": 10.0,
    "comment": "Best Game ever!",
    "timestamp": 1760824800
  },
  {
    "username": "tphon",
    "rating": 10.0,
    "comment": "Sleeved - Premium UltraPro\n3D Printed Insert",
    "timestamp": 1760479200
  },
  {
    "username": "HonkingAntilope",
    "rating": 10.0,
    "comment": "Great Game. We’re new to this “Board game bubble” and had a little respect for Ark Nova. But if you understand it once it’s really easy and calm to play. At the moment it’s our favorite game.",
    "timestamp": 1760479200
  },
  {
    "username": "Daoshifu",
    "rating": 10.0,
    "comment": "Best game of the year for me.\nOnly negative is, like other games in that vein,an enormous deck that creates incredible randomisation of card draw.\nAlso on strap in for a long game.",
    "timestamp": 1760306400
  },
  {
    "username": "Lightspeed_aust",
    "rating": 10.0,
    "comment": "Another perfect game. Congrats to the designers on this masterpiece. The mechanics, the theme, the options and replayability. It's just a beautiful game.",
    "timestamp": 1760306400
  },
  {
    "username": "Juanpablo567",
    "rating": 10.0,
    "comment": "Great game!!!",
    "timestamp": 1760220000
  },
  {
    "username": "jazzee",
    "rating": 9.5,
    "comment": "sell",
    "timestamp": 1760220000
  },
  {
    "username": "mikeelbig",
    "rating": 10.0,
    "comment": "If you enjoy combos and strategic play the likes of complex card games you will love this game. It is an absolute blast to play from start to finish.",
    "timestamp": 1760220000
  },
  {
    "username": "DGHammer50",
    "rating": 10.0,
    "comment": "70--28--2.....BW 2",
    "timestamp": 1760220000
  },
  {
    "username": "GWondowski",
    "rating": 9.5,
    "comment": "March 2025",
    "timestamp": 1760047200
  },
  {
    "username": "ecdpt",
    "rating": 10.0,
    "comment": "With Zoo Map packs 1& 2 and Marine expansion",
    "timestamp": 1760047200
  },
  {
    "username": "Jimmydm90",
    "rating": 9.5,
    "comment": "2",
    "timestamp": 1759960800
  },
  {
    "username": "Anks",
    "rating": 10.0,
    "comment": "Edited Solo Mode",
    "timestamp": 1759960800
  },
  {
    "username": "Nakira",
    "rating": 10.0,
    "comment": "Ark Nova – Imagine Terraforming Mars, but instead of turning a planet green, you’re filling your zoo with adorable animals and saving the world one conservation project at a time. Ark Nova is a brilliantly complex engine-builder where every card opens a new door — from building enclosures and breeding programs to sponsoring international wildlife efforts. The sheer variety of cards means no two zoos (or strategies) are ever the same: maybe you’ll focus on reptiles, maybe on primates, or maybe you’ll just try to get the wombat enclosure next to the lions for pure chaos. The action-selection system is genius — simple to grasp but endlessly deep — and the theme ties everything together so naturally that even your most cutthroat economic move feels oddly wholesome. It’s brainy, beautiful, and deeply satisfying — the rare heavy Euro that makes you feel good about your spreadsheet-level planning.",
    "timestamp": 1759874400
  },
  {
    "username": "Nrgrushap",
    "rating": 10.0,
    "comment": "Played this game over 300 times. It's almost a masterpiece. I would say It's 85% skill and 15% luck on your starting hand/end game scoring cards. If this game started with players drafting there first hand I think it would lower that 15% luck and fix one of the few issues I have with the game. The other thing that keeps this from being a 10 is that you only receive one copy of each map. This makes playing with friends not as fair due to some maps just being way stronger than the others. I wish the company would sell a map pack that let you get additional copies of Map 1-8.",
    "timestamp": 1759701600
  },
  {
    "username": "Arhino17",
    "rating": 9.8,
    "comment": "Best",
    "timestamp": 1759615200
  },
  {
    "username": "LittleDedede",
    "rating": 10.0,
    "comment": "Super Aufbauspiel, mit vielen Mechaniken, die alle super funktionieren.\nDie Tierkarten sind schön anzusehen.\nAufgrund verschiedener Startparks und verschiedener funktionierender Taktiken definitiv mit Wiederspielwert.",
    "timestamp": 1759615200
  }
]