[
  {
    "username": "zmartianov",
    "rating": 1.0,
    "comment": "This game promotes global conquest and interventionism",
    "timestamp": 1754604000
  },
  {
    "username": "PestLee",
    "rating": 1.0,
    "comment": "Draw 1op cards and roll 1-2",
    "timestamp": 1751493600
  },
  {
    "username": "lililililil",
    "rating": 1.0,
    "comment": "Abstract",
    "timestamp": 1747432800
  },
  {
    "username": "Mrpifpaf",
    "rating": 1.0,
    "comment": "historic game.... that it's not historic....in facts: US propaganda games, history view by the school of Chicago think tank.\nVery slow and boring, awful graphics, luck everywhere...\ndon't know how could it be so high in BGG ranking...avoid waste of money.",
    "timestamp": 1746655200
  },
  {
    "username": "mikemcdasl",
    "rating": 1.0,
    "comment": "Ah, Twilight Struggle, the game that asks: “What if we took the existential dread of the Cold War and turned it into a two-player migraine simulator?” If you’ve ever wanted to recreate decades of geopolitical tension and mutual paranoia while actively questioning your life choices, this is the game for you.\n\nThe premise is simple: One of you plays the USA, the other the USSR, and together you’ll engage in a tug-of-war for global domination. Sounds fun, right? WRONG. What it actually feels like is being trapped in a history textbook written by someone who thinks fun is a capitalist plot.\n\nThe card-driven gameplay is equal parts genius and evil. Sure, you get to play powerful events and influence global politics, but more often than not, you’ll draw a hand full of cards that only help your opponent. Want to play a card to advance your strategy? Too bad—enjoy gifting your rival free influence in South America because the game hates you. Nothing screams “fun” like actively sabotaging yourself for an hour.\n\nSpeaking of strategy, you’d better love maps and math, because this game is basically Risk’s nerdy cousin who’s obsessed with area control and influence points. Forget epic battles or dramatic twists—this is just spreadsheets on a world map, with the added thrill of nuclear annihilation. It’s less “game night” and more “war college thesis defense.”\n\nAnd let’s talk about the theme: the Cold War. You know, that famously uplifting period in history where everyone was constantly on edge, nuclear war was a coin flip away, and entire nations were caught in a power struggle between two superpowers. Truly, nothing says “lighthearted entertainment” like reenacting proxy wars and staging coups in Third World countries.\n\nThen there’s DEFCON. This delightful mechanic ensures that one wrong move can escalate tensions and lose you the game outright. Forget strategy; you’re now walking on eggshells, praying you don’t accidentally blow up the planet while trying to score points in Southeast Asia. It’s the board game equivalent of a workplace trust fall, except the stakes are nuclear and everyone’s already mad at you.\n\nFinally, let’s address the playtime. Twilight Struggle markets itself as a “two-hour game,” which is a blatant lie. By the time you’ve explained the rules, argued over the historical accuracy of a card, and tried to figure out why you’re losing, you’ll be three hours deep and begging for the sweet release of mutually assured destruction.\n\nSo, if you love games that are stressful, punishing, and leave you feeling like you just failed a history test, Twilight Struggle is perfect. For everyone else, I recommend Patchwork. It’s less historically accurate but way more fun—and there’s no chance of nuking the quilt.",
    "timestamp": 1737154800
  },
  {
    "username": "Normal_st",
    "rating": 1.0,
    "comment": "Random: The game. The card mechanic is VERY unfun. You don't have your events? Well too bad!.. jesus.",
    "timestamp": 1720562400
  },
  {
    "username": "bkasten",
    "rating": 1.0,
    "comment": "A not very innovative Euro attempting to be a wargame. And I actively despise all CDG.",
    "timestamp": 1717884000
  },
  {
    "username": "bernstein82",
    "rating": 1.0,
    "comment": "not fun at all. maybe great for cold war buffs",
    "timestamp": 1704927600
  },
  {
    "username": "nickwitucki",
    "rating": 1.0,
    "comment": "When it first came out it may have been good, but it's way too formulistic to compete for shelf space with the board games that have come since. Don't bother with this title.",
    "timestamp": 1668294000
  },
  {
    "username": "illusionDS",
    "rating": 1.0,
    "comment": "boring and soulless trash pretending to be a wargame",
    "timestamp": 1661551200
  },
  {
    "username": "iBud",
    "rating": 1.0,
    "comment": "Didn’t work in our round and it is not pretty.",
    "timestamp": 1647990000
  },
  {
    "username": "Shmegmo",
    "rating": 1.0,
    "comment": "Twilight Struggle is painful. Memorizing the eyesore of a deck seems necessary for optimal play because certain cards can just arbitrarily blindside you. Shame on you if you if you are ignorant enough of history to add U.S. influence to Cuba before Fidel is played, but Romanian Abdication, De Gaulle Leads France, Allende, Ortega, Sadat, etc? How many average players would know not to waste influence there? A long, complex game, that takes repeated plays to learn what is coming and what you \"should\" do is a poor design. Twilight Struggle reveals its own shoddy design the more you play. I've played this game dozens of times and bad luck, especially early on, is a nail in the coffin. A game can become nearly hopeless as early as turn 2 or 3 for the USA player. A good strategy shouldn't have this much dice chucking. Furthermore, many hands play themselves because there is one optimal course of play. This is the dullest Candyland variant that I've ever played. I changed my rating from a 2 to a 1 after playing as USA and having a soviet player eliminate all 7 influence that I placed in Western Europe by realignment rolling before I even took my first turn. This game is broken.",
    "timestamp": 1637190000
  },
  {
    "username": "Pluck007",
    "rating": 1.0,
    "comment": "Worst game. It made me stop playing board games for a while. Booooring, no tactics.",
    "timestamp": 1607986800
  },
  {
    "username": "nacrol_69",
    "rating": 1.0,
    "comment": "el peor juego que he jugado en mi vida!!!no se merece estar top 100",
    "timestamp": 1597960800
  },
  {
    "username": "BOB JAMES",
    "rating": 1.0,
    "comment": "Not a WARGAME, makes no sense calling it such. Yawn, this is a below average game that is just made up to resemble anything.\nI for the life of me cant see why anyone would consider this worth playing moe than once at least twice.\nIve seen crap on blades of grass that looked better than this.\nMaybe Euro players think this is good, I haven't punched mine, Ill wait till it goes up and will unload for 5$ and laugh and pity da fool who wastes their money down a rathole!\nI even won this the one and only time, against some guy who was supposedly World Champion, who then tried to commit suicied for losing to a nug.",
    "timestamp": 1586556000
  },
  {
    "username": "Spleen",
    "rating": 1.0,
    "comment": "I would rather choke on my own skid marked underwear than ever glimpse this game again. What a worthless waste of time and pile of garbage.\n\nI guess if tug of war is your thing, then go for it, but you don't ever make any real progress in the game. Two player games like this are very frustrating. I take my turn to undo what you did, then you take your turn to undo what I did. Repeat until end.",
    "timestamp": 1554847200
  },
  {
    "username": "jpatche",
    "rating": 1.0,
    "comment": "What a chore.",
    "timestamp": 1540504800
  },
  {
    "username": "jpj2",
    "rating": 1.0,
    "comment": "There is a conspiracy at work here. There is no way someone in their right mind would enjoy this game. If you enjoy games Do Not Play This. What a waste of a tree. It is terrible in every way. If someone at a convention asks you to play this thing just slap them and walk away.",
    "timestamp": 1525816800
  },
  {
    "username": "Sableparamedic",
    "rating": 1.0,
    "comment": "This can't be rated so high .. it's just not good :/\nMore luck than Catan. Less options in a round than catan, it feels like. Gotta play those cards.. gotta get that area which scoring card you hold.. etc.",
    "timestamp": 1519340400
  },
  {
    "username": "dragon0085",
    "rating": 1.0,
    "comment": "One of the worst games I have ever played, way overrated.",
    "timestamp": 1516230000
  },
  {
    "username": "turbodiedas",
    "rating": 1.0,
    "comment": "so so",
    "timestamp": 1514502000
  },
  {
    "username": "gabrieleud",
    "rating": 1.0,
    "comment": "Review after 20 plays.\n\nGain influence. Your opponent undoes what you did. Repeat until you are forced to play a card that makes your opponent gain an edge. But don't worry, he will soon be forced to play a similar card to your advantage.\n\nCan't believe that most interesting parts of the game are solved by a 50% odds on a die roll: 50% miss your turn/50% slight change happen. The very next round, the opponent undoes what you did.\n\nYou can coup and downgrade DEFCON by 4 times provoking your opponent, when it is his turn to do so he loses. Seems enough to quit this game.\n\n(I could stand up to round 3 against the AI then I lost after it scored an insane amount of points in East Asia. It had 3 countries there, versus my 7. It won. Don't ask me why, I don't care any more)\n\n\nThose who rated 2+: YOU ALL ARE WRONG.",
    "timestamp": 1513378800
  },
  {
    "username": "DamnTurtle",
    "rating": 1.0,
    "comment": "Just not my type of game. Found it very boring and slow paced. Scoring system was confusing and way too complex.",
    "timestamp": 1508623200
  },
  {
    "username": "Perazzi",
    "rating": 1.0,
    "comment": "Stinklangweiliges Spiel! Genauso interessant wie eine Debatte im Bundestag! ich verstehe die hohe Bewertung überhaupt nicht!",
    "timestamp": 1493244000
  },
  {
    "username": "bigmop",
    "rating": 1.0,
    "comment": "Thanks Santa! a shame that my 300 strong collection didn't have this piece. Really appreciate it!!",
    "timestamp": 1490565600
  },
  {
    "username": "crazyfury",
    "rating": 1.0,
    "comment": "Worst game!",
    "timestamp": 1459807200
  },
  {
    "username": "aruom",
    "rating": 1.0,
    "comment": "che pacco. gioco stravalutato e basato solo sul lato B",
    "timestamp": 1452726000
  },
  {
    "username": "Hoss Cartwright",
    "rating": 1.0,
    "comment": "For the crazy people who spend all night calculating the relative popularity demise of games they like and otherwise wasting such time worrying about nothing. You might as well count how many Chickens cried themselves to sleep. Pure idiot move.",
    "timestamp": 1450220400
  },
  {
    "username": "totally average man",
    "rating": 1.0,
    "comment": "This game is too long. Nothing about this game seems interesting, just boring. If it would take 60 minutes to play it it would be below average for me.",
    "timestamp": 1446505200
  },
  {
    "username": "nolle",
    "rating": 1.0,
    "comment": "this game is not complex it is confused",
    "timestamp": 1439330400
  },
  {
    "username": "Nabla_1981",
    "rating": 1.0,
    "comment": "Rank 1? wth\n\nWould give the game a score of 3.\nBut its sooo overated on BGG that it only get 1 point instead",
    "timestamp": 1433368800
  },
  {
    "username": "Zebo",
    "rating": 1.0,
    "comment": "This game seems to have most everything I DON'T like in a game. Limited to two players, overlong, board looks like geography class, loosely based on history where if it plays consistent with history one player's loss should be a foregone conclusion (the USSR lost the cold war, didn't it?). If I was asked to design the most boring game I could imagine, this would be it. And it's not like I'm not interested in history-- this game isn't it though, at best it's \"alternate\" history. At least Steampunk as alternate history is interesting, cold war alternate history just leaves me, well, cold. Reading the encyclopedia would be much more fun, and more accurate history too.",
    "timestamp": 1420066800
  },
  {
    "username": "paxton73",
    "rating": 1.0,
    "comment": "no thanks.",
    "timestamp": 1404597600
  },
  {
    "username": "Beery",
    "rating": 1.0,
    "comment": "I've yet to play but judging by the rules this promises to be an excellent game.",
    "timestamp": 1398808800
  },
  {
    "username": "Pro_player",
    "rating": 1.0,
    "comment": "The theme is weak as there are other similar games that are more fun.\n\nNot a true war game.\n\nFor 2 players, there are a few other games that I would rather play than this one.\n\nAlso, way too long and boring for what it is !!\n\nNumber 1 game in BGG ?! Give me a break !!",
    "timestamp": 1389308400
  },
  {
    "username": "bieb",
    "rating": 1.0,
    "comment": "too long for just a 2-player game",
    "timestamp": 1377554400
  },
  {
    "username": "chuft",
    "rating": 1.0,
    "comment": "Not a wargame. Enough said.",
    "timestamp": 1375221600
  },
  {
    "username": "MossGrande",
    "rating": 1.0,
    "comment": "Just roll dice to decide the winner. That way, you can save 3 up to 4 hours of your life, and the entertainment would be the same.",
    "timestamp": 1346104800
  },
  {
    "username": "LOtterrbein",
    "rating": 1.0,
    "comment": "It's my most played game, and #1 on my Top Ten list. So, I give it a '1' rating. One is the best, right?",
    "timestamp": 1340143200
  },
  {
    "username": "HoosierDood55",
    "rating": 1.0,
    "comment": "So I thought my buddy was joking when he said this was listed as the best game on the planet. Wow. this game takes way too much time, and as a two player only game the outcome is known well before the end. Blech! I'd rather spend the afternoon having surgery done than have to play this.",
    "timestamp": 1334181600
  },
  {
    "username": "MK-Ultra71",
    "rating": 1.0,
    "comment": "I was in awe at the volume of work needed to design the game and underwhelmed by the production value. Flimsy board and spelling errors.\n\nThe game seemed to drag in the mid war phase and I was prety sick of seeing the same cards come around again and again. I want my three hours back.",
    "timestamp": 1305842400
  },
  {
    "username": "njr5",
    "rating": 1.0,
    "comment": "too long, limited to strictly 2 players, very dry and components subpar compared to recent advancements in boardgame production. Very language dependant",
    "timestamp": 1292540400
  },
  {
    "username": "ZoSo1",
    "rating": 1.0,
    "comment": "What a Waste!",
    "timestamp": 1292367600
  },
  {
    "username": "dave65tdh",
    "rating": 1.0,
    "comment": "Good game but I'm still pissed off about the crappy, uneven cards that came with it. Yuk. The game is broken as I can't shuffle the cards and they refused to replace the cards.",
    "timestamp": 1292281200
  },
  {
    "username": "Mad Archeologist",
    "rating": 1.0,
    "comment": "My rating is based from a purely wargame-historical simulation perspective. It isn't the cold war, adding historical text to cards and defcon track doesn't make a wargame on the cold war. Where are ICBM, bombers and boomers? Where is the tense decision making of the cuban missile crisis, the Kippur war, the Ryan incident or of the political bungling of the vietnam war?\n\nIt is simply a complex euro with pasted on theme. Not well done GMT!\n\nAxing the possibility of a fought WW3 simply eloiminate one of the mayor rationale of cold war decision making (force correlations and efforts in modifying an unfavorable correlation). Working on the basis of the old Pax Britanninca game would have done much more good to the Cold War.",
    "timestamp": 1256857200
  },
  {
    "username": "XorroNTG",
    "rating": 1.0,
    "comment": "one game... not my piece of cake!",
    "timestamp": 1195340400
  },
  {
    "username": "crusaderkun",
    "rating": 1.0,
    "comment": "Boring",
    "timestamp": 1168383600
  },
  {
    "username": "pattonre",
    "rating": 1.0,
    "comment": "This game has some VERY serious problems. Several \"deadly\" card combinations make developing any type of strategy nearly worthless. Play to survive waiting for the proper card combinations for the win. Those that rate this game above a 5 are those that have not seen the obvious.\n\nLike they say, ...\n\nGod must love stupid people as evidenced by the fact ... he made so many of them.\n\nDO NOT WASTE YOUR MONEY ON THIS ONE!!!",
    "timestamp": 1146952800
  },
  {
    "username": "gabagaba",
    "rating": 2.0,
    "comment": "Too long and too much randomness with the draws and dice rolls which can really screw you up early and cause you to lose the game, even if it's still going to go on for another two hours. Wargames was the card that would usually end the game with an unsatisfactory moment of \"oh that's it then?\" anyhow.",
    "timestamp": 1756332000
  },
  {
    "username": "tbrofromspace",
    "rating": 2.0,
    "comment": "the neolibs are at it again",
    "timestamp": 1743631200
  },
  {
    "username": "Thatsnotme",
    "rating": 2.0,
    "comment": "2 til 3 timer\n\nGeekup bits",
    "timestamp": 1737932400
  },
  {
    "username": "HiTracey",
    "rating": 2.0,
    "comment": "My first play of this game was a mildly unpleasant experience leavened somewhat by winning big. My head was spinning due to unfamiliarity with every aspect, including, sad to say, much of the history.\n\nA very clever, well designed and produced game that deserves its many accolades, but is far from my preferences. I detest the prospect of the learning curve against my likely opponents' honed skills; an issue I have with all CDGs, which by their very nature require deck-specific knowledge.\n\nComplexity - 3/10",
    "timestamp": 1735081200
  },
  {
    "username": "Jnixon82",
    "rating": 2.0,
    "comment": "I have never been so badly hosed by dice rolls in my board gaming life.",
    "timestamp": 1729461600
  },
  {
    "username": "HolyRayne",
    "rating": 2.0,
    "comment": "Dry, overly long, ugly, and tedious. First game I ever sold. Pros say there's a fun game to be had..if you memorize all the cards.",
    "timestamp": 1728424800
  },
  {
    "username": "Markies123",
    "rating": 2.0,
    "comment": "Hate War Games.",
    "timestamp": 1707778800
  },
  {
    "username": "TheLimestoneCowboy",
    "rating": 2.0,
    "comment": "*D",
    "timestamp": 1638313200
  },
  {
    "username": "Ravyerr",
    "rating": 2.0,
    "comment": "Random number generator boardgame. Totaly overpriced with super cheap parts. Don't go near it.",
    "timestamp": 1609455600
  },
  {
    "username": "Kent38",
    "rating": 2.0,
    "comment": "Requires far too much memorization of each specific card in the deck. Absolutely despise this game.",
    "timestamp": 1600207200
  },
  {
    "username": "ubirata",
    "rating": 2.0,
    "comment": "belo jogo de embate, card driven game...2-2",
    "timestamp": 1587160800
  },
  {
    "username": "SirPork",
    "rating": 2.0,
    "comment": "NEVER BUY THIS FOR ME EVER AGAIN!!!",
    "timestamp": 1584313200
  },
  {
    "username": "Stormparkiet",
    "rating": 2.0,
    "comment": "Played it once and did not enjoy it. It just takes way (way! Waaaaaay!) too long for what it is, playing events and exerting influence back and forth and hoping for lucky dice rolls. I'd say this if our game had lasted the usual 3-4 hours, and since our play lasted more than SIX hours... yeah.\n\nThe theme is integrated extremely well. I just don't think the game is any good.\n\nEdit: Played it again. Still didn't like it one bit - won't play again.",
    "timestamp": 1579302000
  },
  {
    "username": "Quiron1",
    "rating": 2.0,
    "comment": "A game about control in which I feel I control nothing.\n\nPlease, Ananda Gupta and Jason Matthews (designers of Twilight Struggle), don't leave the outcome of my Coups up to the dictatorship of damn dice rolls! Who said deciding the result of a coup by rolling a dice was fun? It isn't, and game design wise I find that to be UNFORGIVABLE (yes, even if you can add the value of a chosen card to the roll), it's unforgivable because it can have severe consequences in the outcome of the game not really depending on the players, and it explains a great deal of my low rating, sincerely, but so do the aesthetically awful cards layout (the board looks passable and makes me think of geostrategy, but the cards weren't done by too talented passionate artists, that's for sure), they all having that same horrible pale blue background making indistinguishable the cards of each block except for the tiny little star, and the fact that the player is forced to learn soooo many cards and the best way to use them while their varying effects can't even be systemathized makes the learning curve too steep! (Don't give players more than 15 cards to learn to play your game smartly, for god's sake!) Also the game is unjustifiedly waaaaay too loooong and boooooring repeating over and over the same uninteresting mechanic as you feel travelling over a predefined railroad. Then it's a bit silly how power just swings out of control all the time too often driven by this dice/draft randomness. Control of a territory feels too volatile an achievment to actually engage you in it after you notice how easy it is to lose them, it doesn't quite reward you with strategic benefits for controlling them other than power just for the sake of it, and scoring moments for unpredictable regions happening at any unpredictable time, oh lord... (it should really be the other way around: conquests lasting some more and scoring knowing exactly what/when to score, prefferably at the end of the game! not at anytime in-between as TS does). Both U.S. and U.S.S.R. players using their cards and their opponent's is... meh... (why not each player having their own thematic decks -red background for the sovietics, please!- and playing only THEIR own cards?) all along with the cards ambivalence, as they are used for the influence points and/or for the event so you are never too sure how or when to use them, and you not always having a chance to avoid/reduce their bad effects... It's a very good recipe for chaos, indeed. If you as a game designer choose to do all that, don't expect to keep me in that chaotic state of mind during so many rounds, for god's sake!\n\nIt may not be a terrible game if you like knowing about the cold war period, you might have some nice moments with many of its cards, but my rating is far from showing any love to this game, I'm sorry. These ratings are based on wether or not would I ever play a game again, and there's NO WAY I ever play again Twilight Struggle. No, thanks. It's better to leave it in the box (prefferably leave it in the store) and flip a coin up on the air to see who's the winner of the cold war. That way you avoid losing your money, loads of time and making your brain burst for nothing.",
    "timestamp": 1559685600
  },
  {
    "username": "kirtak",
    "rating": 2.0,
    "comment": "If you remember the cards (because you did play before) you already won, if you are new to game you will be beaten badly every time. It is not a game which can be played with new people. It is not a tactic or strategy that will let you win, is is just a remembering what is in opponent deck, what he used already and what he can have at hand. It is like poker, but you don't know what cards are included in deck. Bought it cos of high wargame rating (1st place), but i found it to lack and aspect of wargame. It is a card game set is war theme.\nUpdate: After another try, I lower my rating to 2. Shame few counters is lost, I could sell it at least.",
    "timestamp": 1552863600
  },
  {
    "username": "B41939",
    "rating": 2.0,
    "comment": "Flavorless.",
    "timestamp": 1536098400
  },
  {
    "username": "hxbx",
    "rating": 2.0,
    "comment": "After just one play, I thought this was a bit average. I prefer CDGs with some combat. I didn't think the effort to play was rewarded.\n\nThe second play was a real Struggle & not in a good way - we were both bored & kept hoping it would get better. The game ended in a draw.\n\nI'm over this game.",
    "timestamp": 1533765600
  },
  {
    "username": "ziepten",
    "rating": 2.0,
    "comment": "Too swingy for 2-3 hour game. I would rather play some short version that would give me the same feeling of the game...",
    "timestamp": 1527458400
  },
  {
    "username": "cbatarlis",
    "rating": 2.0,
    "comment": "Boring and Bland theme. Mechanics work but the components are poorly printed. This game is way overrated in this tired and old theme. This game looks like it was printed in the 90's with it's cardboard squares LOL #1 on BGG? Why? Maybe if it had crazy Russian and US Troop Minis and some actual thematic elements with a bit of Story, then perhaps it would be amazing.. but I just find it so ... Meh!",
    "timestamp": 1526594400
  },
  {
    "username": "WilcoxDave",
    "rating": 2.0,
    "comment": "I did not care for the theme or style of play of this game. It seems to be of greater interest for people who enjoy history much more than I do.",
    "timestamp": 1522274400
  },
  {
    "username": "moviemaker27",
    "rating": 2.0,
    "comment": "I hated this game. It takes forever, is so dense and confusing it feels like a lecture instead of a game, and seems like every turn you just go back and forth so no one ever wins. The winning conditions are pretty hard, and it's hard to have the right combo to actually get to use your cards.",
    "timestamp": 1511132400
  },
  {
    "username": "_Kael_",
    "rating": 2.0,
    "comment": "Really looked forward to my first play. Was rather disappointed. Made 6-7 rolls on Space track, success on 1-3 or 1-4, missed all but one. Could keep up a bit due to cards, but was always 1-2 steps behind.\n\nOne turn I started with 5 scoring cards in my hand, meaning I could watch my opponent do free (unopposed) moves for nearly a full turn.\n\nGame needs a number of plays to learn choke points and crucial cards, if you're willing to invest that time. I'm not.",
    "timestamp": 1509836400
  },
  {
    "username": "Chicchic325",
    "rating": 2.0,
    "comment": "Never play this game unless the other person has played. The rules are super complex and the way they are written don't make sense. While you grasp the basics easily enough, the ability to play and remember are too difficult for a casual player. Don't waste your money on this game unless you like arguments.",
    "timestamp": 1496613600
  },
  {
    "username": "MegaMegaPowPow",
    "rating": 2.0,
    "comment": "Played it 4 times with a friend. Hated it at first, and it got slightly less worse each time, but never enjoyed it... I think this is the only board game I've ever just decided \"Nope, this isn't for me, I'm not playing it again\"",
    "timestamp": 1495144800
  },
  {
    "username": "djberg96",
    "rating": 2.0,
    "comment": "Rating after two plays.\n\nA CDG that Cold War fans will enjoy and combat-averse eurogamers can get into because there are no dice and conflict is highly abstracted. The relatively short playing time is a bonus. The somewhat chaotic nature of the game is a downer, however, and eight consecutive failed attempts at the space race have jaded my opinion of this game. Knowing all the cards and their effects in advance will give experienced players a ridiculous advantage over newbies.\n\nThe most critical problem that has been smoked out is play balance. One need not look far for reports of the Russians winning in the first three or four turns because of a good hand combined with the right scoring cards. Not fun if you're the US. Mind you, I think some of that might stem from the TS sharks, so you probably won't experience that for your first few plays while you and your friends fumble around.\n\nAnd, as others have mentioned, this game is seriously overpriced for what it contains.\n\nPS - Twilight Struggle is not a wargame.\n\nUpdate: After honestly giving it many more attempts via Steam, I've had to downgrade my rating. Given competent play on both sides, it pretty much boils down to the arrival and timing of those scoring cards. Plus, it's too easy to fuck up and automatically lose the game because of the screwball rules regarding the DEFCON track, which I've decided I hate.",
    "timestamp": 1490482800
  },
  {
    "username": "PScipio",
    "rating": 2.0,
    "comment": "The sudden death / loss conditions for forced coups are idiotic, unrealistic and very much subject to the whims of chance. Yuck.",
    "timestamp": 1489532400
  },
  {
    "username": "OrionRaphael",
    "rating": 2.0,
    "comment": "I wish this game was fun, I really do. I like complex games, I like war games, I even have a special place in my heart for US vs Russia games (thanks Red Alert!) but their comes a point where there is just too much. Where you're spending all your time keeping track of tokens, markers, tracks, and which phase of the game you're currently in. At that point I'd rather that game be digital, where I am not forced to deal with all that.\nBe prepared to spend 4+ hours learning the game before even setting up, then 8+ on your first round. I would be OK with this is the action was exciting, if the strategy had some flow, or if anything about this game was intuitive.... but it just feel like I'm playing accountant for the cold war, not president.",
    "timestamp": 1485817200
  },
  {
    "username": "WRKRPLMT",
    "rating": 2.0,
    "comment": "the worker placement in this game is terrible",
    "timestamp": 1485644400
  },
  {
    "username": "coldpaws",
    "rating": 2.0,
    "comment": "Rulebook is terrible; The main mechanics of the game aren't that complicated and we still struggled to figure them out.\nLots of randomness with regards to which cards you draw. I won the game in 2 turns by drawing two scoring cards and stacking the deck for myself.\n1d6 die rolls determine important strategic outcomes.\nYou can tell the game was designed by a couple of people w/out game design experience for their own recreation of history. It is not a very well designed game.",
    "timestamp": 1484521200
  },
  {
    "username": "cookiemonster83",
    "rating": 2.0,
    "comment": "Most overrated game I have played so far. Dice rolls for superimportant decisions plus randomness of the cards (which sometimes also imclude random effects) made me really the games played at all. Once you get the strategic important spots on the map, which happens pretty fast and play by the scoring cards only very little depth remains. From its conception (except the dice) it should be a game I normally like. In fact I would never want to play this again.",
    "timestamp": 1483398000
  },
  {
    "username": "cfarrell",
    "rating": 2.0,
    "comment": "The release of the iOS version of this has largely vindicated those of us who complained that the play balance on this is insanely pro-Soviet. Looking at people's win-loss stats as each side reveals a level of imbalance that is totally nuts, and yet which fans of the game largely continue to deny. You'll need to use all the pro-US variants available to make this work (the variant cards alone are definitely helpful but insufficient).\n\nI thought the much faster play of the iOS version might help me get into the game, but actually it just reminded me how much I hate it. If it was only 6 turns, it might be tolerable, but at the length it is I am always bored out of my skull well before the end, when it becomes pretty obvious whose going to win but you've got another hour plus to go.\n---\nAnother reason to dislike Twilight Struggle ... the narrative here is driven entirely by US right-wing fantasy. The rulebook sort of acknowledges as much, but the degree to which the game takes the many disastrous views of American hard right war hawks and makes it look mainstream is distressing. When you look at it with some discernment, this is not the Cold War, it's not even most Americans' experience of the Cold War. It's what the US political right wished the Cold War had been.\n---\nWell, I think at least I've finally figured out the obvious reason why Twilight Struggle has such appeal; it's right on the seam between eurogames and wargames. So wargamers who want something euro-ish but just aren't going to play Beowulf can play and enjoy this. Likewise eurogamers who just aren't going to play Battle Above the Clouds, say, can find this one accessible and interesting. But for anyone who appreciates both sides of the gaming spectrum, who can get a kick out of both Blue Moon or Pandemic *and* Hannibal: Rome vs. Carthage or Breakout: Normandy, Twilight Struggle really just doesn't have anything to offer.\n---\nUPDATE: OK, time to clean up my comment here ...\n\nI kinda like Twilight Struggle just for the theme. It's fun to go back and forth and watch the events and get some vaguely historical fun.\n\nBut the game has a lot of problems. It's too long for what you get out of it (some commentators have said \"quick-playing\" is a strength of Twilight Struggle, but at 3 hours I find it wildly overlong for what it is). Several game elements are out of whack. Realignment, for example, is worthless - how does something like this make it into a finished product? Didn't some play-tester say \"hey, you know, we never, ever use realignment?\". Since the geography of the game largely exists only for realignment, this seems like an issue. And I really dislike how much the game rewards simply knowing the contents of the deck, which makes things unnecessarily hard to learn and needlessly punishing of experience (not skill) differentials.\n\nI could rant on and on about niggling little details like this, stuff that should have been ironed out if GMT had any kind of development process, but the absolute deal-killer here is play-balance. The Soviets are overwhelmingly favored between smart and/or competent players. Sure, I've heard others claim the game isn't unbalanced, but the empirical evidence on my end has now become overwhelming. Once you focus in on the important stuff, paring away all the game elements that don't matter, we haven't seen the US win in 15 games, even playing back-to-back games switching sides, with other players, etc. This is jaw-dropping considering how much luck there is in the game. And I've even found myself pulling punches as the Soviets early in the game, in the hopes of generating a more interesting game and embarrassment of getting to play the hugely favored side, and still winning handily. If the game were anywhere close to balanced you'd think you'd see the US win a few just on pure luck. But no.\n\nAnyway. A frustrating game because with some reasonable development I think it could have been good, even very good; but it's not. I had hopes that 1960: Making of a President might show some improvement, but sadly it seems to have most of the same failings while losing traction on the theme.",
    "timestamp": 1476828000
  },
  {
    "username": "HalfSlothHalfCamel",
    "rating": 2.0,
    "comment": "This game is absurd. There is nothing to love here, and I can't comprehend the amorous feelings BGG has towards this game. It has stood the test of time, with over 23,000 reviews so I know that it isn't just \"oh some people like it, and some people don't\". This is a nearly universally loved title.\n\nBut I abhor it. It's limited to strictly 2 players, which I thought might be great for playing with my wife. Turns out its not. This game is an exercise in futility and frustration. Spend a card and an action to gain some influence in Europe, only to have the other player undo your action, repeat ad nauseum, until you unwillingly have to play the Europe Scoring card and give your opponent all of the points you were trying to earn.\n\nThe game takes forever too, which normally isn't an issue for me (I love Twilight Imperium 3), but for only two players, of which there is zero negotiating or bargaining, or really interaction, taking 180 minutes is unacceptable.\n\nThe components are utter garbage, and fiddly. The game relies entirely too much on luck of the draw or a roll of the dice. I own the physical version and the Steam version and have played a number of times on both platforms, trying to give this game a fair shot, and understand the hivemind. But there is nothing fun, inspired, interesting, or engaging about this trash pile of card board.",
    "timestamp": 1467669600
  },
  {
    "username": "megawidget",
    "rating": 2.0,
    "comment": "Did you memorize all the cards in the game? You didn't? Well, fuck you! Ha. Ha. Ha. We are a skill^H^H^H^H^Hmemory game.\n\nThis game is sheer garbage. I guess people who learned all the cards get their kicks out of rolling dice, but heaven forbid you want a strategic game.",
    "timestamp": 1465336800
  },
  {
    "username": "LemurCrisis",
    "rating": 2.0,
    "comment": "Several clever mechanics with a strong thematic tie. Great history lesson. I was excited to play this, but found it to be utterly tedious. Never again.",
    "timestamp": 1451602800
  },
  {
    "username": "Checkallday",
    "rating": 2.0,
    "comment": "First things first. I really don't like CDG's, or at least I haven't really found one that I connected with yet. Playing events out of hand just feels weird and athematic. I don't get it. It probably has something to with deck-knowledge being the most important skill in a CDG, which is a gameplay skill that I have very little interest in getting. It drains the game of theme in favor of meta-power-gaming. I want history and theme, but the cards are just a thin layer of both over what is ultimately an area-control cubepusher. Dullsville.\n\nI'd rate it a one, but it isn't exactly broken. I just hate it. A lot.\n\n=========================================================\n\nOnly a couple of plays, but I could see this score improving as I learn the game, but I could also see myself growing irritated as I get hosed by cards. As it stands, I love the historical tidbits (even though they are built on at least a few really screwy assumptions) and I am looking forward to playing some more.\n\nUPDATE: Still trying to decide whether TS is a love or hate for me. Card-driven area-control has never been my favorite genre; something about getting hosed by cards leads me to wonder whether it might ultimately be something of a crapshoot. I'm not super keen on the amount of card memorizing overhead that might be required to play the game well. I will need to think more about why I haven't found a CDG I've enjoyed yet.\n\nUPDATE AGAIN: The evolving rating. Good stuff first. The game is a tight, and mostly fun, area-control/influence game. Each hand becomes a puzzle to be solved, and the game has tons of guessing and bluffing as you try to puzzle out why your opponents is making his plays. It has a neat veneer of a theme with cool cards and a nice looking map.\n\nBut the game is problematic in some ways:\n\nTHEME: Some parts of the theme feel sort of right. You're balancing investing influence against more aggressive options in order to win a victory without sending the whole world over the edge. The big picture abstractions feel very much like a Cold War-themed game ought to feel. But, and this is a big one, the details are as athematic as a standard Eurogame with take-that cards. What exactly do my cards represent? Does it make any sense temporally to have an event happen every card play? Not at all: I'm just playing out a script when I really want to be engineering a strategy and authoring history. What role am I in? An abstract Geist in a bipolar world? Thematically it feels wrong, and that it is the ultimate deal-breaker for me.\n\nThe more I play, the less thematic it becomes, as I start to minmax your hand and wait for events. What does it mean, thematically, to win in a region when only you know that it will be \"scored\"? It might be sort of fun from a bluffing/gameplay perspective, but it's thematically off. None of this theme stuff really matters. It's a game, so whatever, but no sense in all the fanboy droning about the Cold War \"feel\"\". It's off. Way off.\n\nGameplay: I'm torn. On one hand it works well. You're walking a knife's edge tug-of-war in a very cool and tense way, but shit there is a lot of randomness to the event draws. A poor draw can really set back one side or the other in a big, perhaps game wasting way. I haven't played nearly enough to really know for sure, but I wonder how much if finally comes down to card-luck and exploiting a good hand. Which is fine, hand-management damage control and hand-exploitation can be a lot of fun, but I'm just not sure that I want that in a game that takes 3+ hours to play.\n\nIn Backgammon, the swingyness of the dice balances out over the course of many games; the better player will always win when the law of large numbers kicks takes over. This may be true of TS as well, but at three hours, can one really get in enough games to balance things? I'm fine with screwy card (or dice) luck in a 45 minute game or in a game that is Uber-thematic (ASL for example), but Twilight Struggle sits in weird sorta-themed over-longish middle-ground: too long and inelegant to compete with the best Euros, and too dry and athematic to compete with the best wargames or themers.\n\nAs with above, none of this really matters if the game isentertaining, which it mostly has been every time I've played. But #1? Nah,not even close.",
    "timestamp": 1449874800
  },
  {
    "username": "tgmcduff",
    "rating": 2.0,
    "comment": "Definitely *not* my cup of tea. Don't even want to log playing it.",
    "timestamp": 1438984800
  },
  {
    "username": "DAAAN",
    "rating": 2.0,
    "comment": "I'm not a big fan of zero sum games, and this is no different. I intensely disliked the way that events triggered for your opponents when you played them. It just doesn't work for me at all. As someone who enjoys games of hand management, that was a killer. I lost when my opponent finished moved us to defcon 1 on my turn and I've never been so glad to lose. If I want to play a CDG, I'll wait to get Here I Stand to the table, but I'm not standing for this.",
    "timestamp": 1427410800
  },
  {
    "username": "smiple",
    "rating": 2.0,
    "comment": "I played this game 3 times and I would be happy to never play it again. Now before I say anything else, I want to say that this seemed very much like my kind of game before I even started playing and I was very satisfied with the push and pull gameplay and many aspects this game had to offer.\n\nThe first game was an early (turn 5 or 6) win by the soviets. The second game we switched sides and was a turn 10 win by the soviets. Both of these were significant victories and had me really wanting to play again.\n\nThe third game the allies won on turn 10 because of one die roll. The allies went last on turn 10 and had to roll the die to win or lose the game based on gaining a certain amount of victory points. We literally played for 2 hours to have the game determined on the roll of one six sided die. This is not to say the gameplay was not fun, but I much prefer to have my decisions be meaningful and to be able to play or strategize around the luck of the game.\n\nThis was over a year ago and it highly influenced my opinion of the game. I haven't wanted to play it since and I don't think I ever will. I give it a 3 because it was enjoyable in some of its design but was an overall disappointing experience. There are so many games out there that are either more fun, more strategic, or both.",
    "timestamp": 1424214000
  },
  {
    "username": "Dagrabbit",
    "rating": 2.0,
    "comment": "I'm not going to sit here and tell you that the number one game of BoardGameGeek is trash. I respect you too much for that. I will say, that I hate this game almost as much as I hate Communism. It kills me to give the game a 2, since it's getting awfully close to a red color, but when in a Soviet Satellite...\n\nThe game is long like a bread line, and it feels like I'm making the same type of decision every turn. And there's a lot of turns! If the Cold War had been settled by playing this game, both sides would have left the table and gone off to play something more exciting like golf or watch the Paint Drying Championships of the Greater Spokane Area. So maybe that would have been good.",
    "timestamp": 1421449200
  },
  {
    "username": "Xelto",
    "rating": 2.0,
    "comment": "A player who knows the cards and their effects has a significant advantage over someone who doesn't. And knowing the cards makes you play in non-thematic ways. (For example, historically, the US should be trying to influence Cuba in 1950. But knowing that the Castro card is in the later mix, it's stupid to do so.) Interesting mechanics, but not enough to overcome the game's flaws.",
    "timestamp": 1418857200
  },
  {
    "username": "oowick",
    "rating": 1.5,
    "comment": "On the basis of a 1/5 game played incorrectly, I liked it well enough. Interesting decisions, some luck of the draw, and great advantages conferred with experience (namely, knowledge of the deck). There is also the resonance of having grown up during the Cold War and lived through some of the events mentioned in the deck.\n---\nDocked a bit for being over long and wearisome\n---\nDocked more for same, and also for game hinging on things like: 1) die hitting 5 or 6; 2) drawing the perfect card from opponents hand and dismantling their strategy for the turn. If it's not over by Early War I'm inclined to seppuku (i.e., lower Defcon status from 2 to 1), to make the awfulness stop.",
    "timestamp": 1417993200
  },
  {
    "username": "Gupzich",
    "rating": 2.0,
    "comment": "Have played this game only a few times. However, each time I go to the closet to pick out a game to play with a friend, this game never comes out. I can only conclude that this game is not for me.",
    "timestamp": 1417388400
  },
  {
    "username": "ciroccojones",
    "rating": 2.0,
    "comment": "I hate this game. So. Much. Every decision is just attempting to choose the least terrible thing. Playing it feels like punishment.",
    "timestamp": 1415487600
  },
  {
    "username": "reg xmgx",
    "rating": 2.0,
    "comment": "Sat down with another experienced gamer and tried to learn this one. I lost due to a triggered nuclear war with a couple rounds to go. It is impossibly long-winded, too driven by dice rolls, and requires an opponent at the same level as you.\n\nThere are too many other games out there (two-player included) that can provide depth and enjoyment, and you could play 2-3 of them in the time it takes to try and get through this one.",
    "timestamp": 1408226400
  },
  {
    "username": "cannedpears",
    "rating": 2.0,
    "comment": "DO NOT BUY THIS GAME!!!!!!!!!\n\nOkay, I love command and conquer strategy games. Axis and Allies, Samurai Swords (now called something else), RISK, Stratego, you name it... and that's what I was hoping for with this.\n\nI will give them kudos for trying to create a game that offers more complicated possibilities to players like coups attempts and technological advancement.\n\nHowever, this game is quite simply a History Lesson. There is barely and actual strategy. Twilight Struggle's game play is dictated mostly by \"events\" that take place on a large number of cards that reveal themselves throughout certain eras in the Cold War. The \"events\" are seriously in the favor of the US (as is the starting position of all the game pieces - which would be fine by me, normally) and one is not allowed to gain the upper hand on their opponent in any creative way by doing something unexpected OR, better yet, taking the lessons of History and no not repeating the mistakes both the USSR and the US made during the Cold War.\n\nInstead, quite depressingly, one is forced to play out events exactly as they happened in the Cold War leaving no room to make decisions that are your own.\n\nAxis and Allies is still the best war game I've ever played and NO, I don't work for whomever the hell made it.\n\n#bummed #theres$60Illnevergetback",
    "timestamp": 1405807200
  },
  {
    "username": "joseph777",
    "rating": 2.0,
    "comment": "Really like this game but find it difficult to get friends to play. It takes a little long to play for what it is.\n\n8 Feb 14 - Got this out again after a long hiatus. Really enjoyed it. Game length seems to have come down a little. The solo rules are great too. You wouldn't think it but the solo variant is actually quite tough. Putting this up a point because of the solo rules.\n\n26 May 14 - Officially giving up on this game. So disappointing. My friend and I can only win when playing Russian. Stupid! Far too long. Takes 5+ hours to play. No way to mitigate bad dice rolling which really badly affects your game. America on back foot the whole way and then can't win. Ridiculous! Selling on ebay.",
    "timestamp": 1401055200
  },
  {
    "username": "Mundster",
    "rating": 2.0,
    "comment": "Very clever, for a card game.\n\nOnly took me 8 years to play it.",
    "timestamp": 1394233200
  },
  {
    "username": "BadMagic",
    "rating": 2.0,
    "comment": "One of the few games that left me actually feeling angry about the game itself after playing. It requires an investment of time in order to memorize the cards and I just won't ever be willing to do that, especially since I am no fan of either history or politics.",
    "timestamp": 1357686000
  },
  {
    "username": "NavayaTCG",
    "rating": 3.0,
    "comment": "Game has some cool mechanics, but not used in the right way",
    "timestamp": 1750024800
  },
  {
    "username": "tommaas616",
    "rating": 3.0,
    "comment": "Complex and hard to play against an experienced player who knows what remains unplayed in the card deck. I enjoyed the historical references, but not the game mechanics.",
    "timestamp": 1739314800
  },
  {
    "username": "RandomShuffle",
    "rating": 3.0,
    "comment": "I can see why people like it, but it is too heavy for my taste.",
    "timestamp": 1728511200
  },
  {
    "username": "Golden Aegis",
    "rating": 3.0,
    "comment": "Really tried to get into this, but never got to finish a game before both parties were bored. Prehaps it was the themeing? Game just wasan't for us.",
    "timestamp": 1717279200
  },
  {
    "username": "FORTRAN77",
    "rating": 3.0,
    "comment": "Bad layout. Poorly made art.",
    "timestamp": 1711321200
  },
  {
    "username": "LordTengil",
    "rating": 3.0,
    "comment": "Just beacuse a game is rated high does not mean it is a game you will enjoy. THis game taught me that.\n\nIf you do not like the setting, or heads up games, or getting deep into how a game works, this is will not be your game.\n\nIf you are a history buff, and you like all of the things above, this game might very well be your cup of tea.",
    "timestamp": 1710543600
  },
  {
    "username": "mduke",
    "rating": 3.0,
    "comment": "A fun topic, but has CDG disease -- lots of gamey hand management stuff, not enough realistic mechanics.",
    "timestamp": 1704409200
  },
  {
    "username": "HS2917",
    "rating": 3.0,
    "comment": "A lot of rules overhead for a tug of war game; Theme was just not that interesting",
    "timestamp": 1701558000
  },
  {
    "username": "Bechara",
    "rating": 3.0,
    "comment": "You must invest a hundred hours to understand all the cards, key locations, and how to mitigate your luck.\n\nBeginners will simply spend four hours to decide the game on who rolls the dice higher.",
    "timestamp": 1701298800
  },
  {
    "username": "lexen",
    "rating": 3.0,
    "comment": "I like the game less the more i play it, unfortunally the components are what we come to expect from GMT, pretty poor! This game give you the best feeling of the cold war tension that i've played. however i feel that the game could end too sudden by certain cards, although rare.",
    "timestamp": 1684792800
  },
  {
    "username": "JorgeMD",
    "rating": 3.0,
    "comment": "ESP\n\n-Ver videoreseña-\nDicen que es el mejor juego a 2, quizás es demasiado pesado y/o de una temática demasiado concreta que no tiene porque gustar a todos.",
    "timestamp": 1683237600
  },
  {
    "username": "Dion_Nys",
    "rating": 3.0,
    "comment": "Not a bad game, but just not for me.",
    "timestamp": 1682719200
  },
  {
    "username": "vip_chicken",
    "rating": 3.0,
    "comment": "If this were released today, Tom Vasel wouldn't even review it.",
    "timestamp": 1678057200
  },
  {
    "username": "Skiveron",
    "rating": 3.0,
    "comment": "Meh, Good game for those who have the patience to play it a few times and discover the intricate strategies. I rather play any of the new more engaging 2 player grand strategy games around. Also don't care at all for the theme.\n\nAlso, a game that's a niche among a niche among a niche should never get a sniff at no.1 position.",
    "timestamp": 1675983600
  },
  {
    "username": "ndecarie",
    "rating": 3.0,
    "comment": "Incredibly complex and long.",
    "timestamp": 1660600800
  },
  {
    "username": "SebFr",
    "rating": 3.0,
    "comment": "USSR can always block DEFCON and score associated op points so USA can't win",
    "timestamp": 1654639200
  },
  {
    "username": "Marcymaru",
    "rating": 3.0,
    "comment": "iOS\n+ Turn Zero expansion and Promo Packs",
    "timestamp": 1648850400
  },
  {
    "username": "Mysticmouse",
    "rating": 3.0,
    "comment": "It's a great game that I never want to play again. Too much work",
    "timestamp": 1642633200
  },
  {
    "username": "Grenack",
    "rating": 3.0,
    "comment": "Horrible Ruling.\n\nThe Game is interessting but if you forget the rules you have to fight through the very bad rulings agian.\n\nThe theme is as expected very war themed and the production quality is form the 80s",
    "timestamp": 1640818800
  },
  {
    "username": "ethelder",
    "rating": 3.0,
    "comment": "Tried 3 times, since it's so high on BGG I truly put my heart into it. NOPE",
    "timestamp": 1614121200
  },
  {
    "username": "thoddo",
    "rating": 3.0,
    "comment": "Nur für Auswendiglerner",
    "timestamp": 1610492400
  },
  {
    "username": "Bigheadnath",
    "rating": 3.0,
    "comment": "Overrated, not enjoyable, doesnt feel rewarding or epic when taking countries .\nNot sure why its so highly rated",
    "timestamp": 1610060400
  },
  {
    "username": "Grim_Tidings",
    "rating": 3.0,
    "comment": "Personally I wasn't keen, yes it's a strong theme (which is dry and holds little interest to me, perhaps just too serious for me?) and mechanically sound (which I found rather long winded and overly complicated in certain areas) but it's just not something I will want to play often, at present.Perhaps in the future I'll be happy to play more, but it really just doesn't capture my interest as I thought it might, a pity. I felt I may have judged it unfairly but tbh I hate this game, it gets some points but no definitely not anything I enjoyed.",
    "timestamp": 1598133600
  },
  {
    "username": "catfishalomar",
    "rating": 3.0,
    "comment": "This feels too much like work. I get it, it's a well designed game, but it just isn't any fun. Almost always a different game I would prefer to play.",
    "timestamp": 1596146400
  },
  {
    "username": "Hammersmithian",
    "rating": 3.0,
    "comment": "All 3 of the stars are for the look and feel of the game, which is nailed on cold war. None of them are for the gameplay and mechanics. I’d seriously question how old some of these ratings are. This game *may* have been good in 2005. I don’t know. I didn’t play it back then. I played it in 2020. And it wasn’t good. It really wasn’t. Its dependence on single dice rolls. Its attempt to ‘balance’ powerful cards with offsetting counterparts, when its core mechanics rely on truly random card allocation that means one player might end up holding them all. Its demand for military ops when it’s so incredibly easy for the DEFCON to be nudged to block. And above all the imbalanced appearance of scoring cards which your opponent may receive several times and you none, leaving you barely able to influence anything. These make this for me a deeply flawed gaming experience and probably the most overrated game on this site. All of these flaws can be mitigated by a near encyclopaedic knowledge of the cards and their effects, but really you’d be so much better off with War of the Ring if that level of time and attention is your thing. And if it’s not, basically anything else in the top 100 is going to be better. Hope that helps",
    "timestamp": 1589061600
  },
  {
    "username": "Kentkome",
    "rating": 3.0,
    "comment": "Não sou fá de jogos para 2 e não curti a mecanica dele.",
    "timestamp": 1586210400
  },
  {
    "username": "Yves_",
    "rating": 3.0,
    "comment": "Only played once : not my game",
    "timestamp": 1579820400
  },
  {
    "username": "AJBrandon",
    "rating": 3.0,
    "comment": "Great game, not for me.",
    "timestamp": 1575586800
  },
  {
    "username": "Valnar",
    "rating": 3.0,
    "comment": "Vastly overrated game, it's who knows the cards the best and is good at card counting and remembering what has been played.",
    "timestamp": 1566079200
  },
  {
    "username": "saagarp",
    "rating": 3.0,
    "comment": "Historical themed games just don't do it for me, even though I tried this several times.",
    "timestamp": 1564869600
  },
  {
    "username": "Simwork",
    "rating": 3.0,
    "comment": "Deluxe edition, 2012. Excellent condition. Played the original edition 12+ times; less enjoyment with each play. Love the events and the game play, but the \"history\" is just fantasy. For trade.",
    "timestamp": 1557439200
  },
  {
    "username": "hybredtv",
    "rating": 3.0,
    "comment": "I honestly do not understand the hype for this title. Hands rarely feel rewarding and the pace is very slow. \"Combat\" is very bland. The theme is A+ which I believe is what pushes this game so high up. Without the strict Cold War theme this game just falls flat.",
    "timestamp": 1551913200
  },
  {
    "username": "Gaertner3031",
    "rating": 3.0,
    "comment": "Boring",
    "timestamp": 1550530800
  },
  {
    "username": "Si Fei",
    "rating": 3.0,
    "comment": "Monstrous area control game with average components (in the \"deluxe\" version.)\nThe theme is not badly implemented, but it feels a bit random at times and it feels like just counting points too often. There surely are more thematic games.\nWould be better if it was shorter. The 180 minute tag is *very* optimistic. We did not finish under five hours ever. That might get shorter if you know the game very well and have memorized all the cards, but I don't think I want to invest the effort to get there. Not a good game for anyone who is not a hardcore fanatic for this sort of game and willing to do the time investment.\nPlainly, I do not get why this is so high up in many peoples opinion.\nMy rating might seem a bit harsh, but it accurately depicts my desire to play this game. Also, I fail to see anything particularly original or inventive in this game mechanics-wise, that should cause me to rate it higher.",
    "timestamp": 1544569200
  },
  {
    "username": "ricomoss",
    "rating": 3.0,
    "comment": "I can understand how people like this game - it's just not for me. This is the kind of game that you are going to need to invest in the entirety of the game to get the full experience. You will need to memorize each card. You are going to need to understand how everything fits together.\n\nTo build a strategy in this game you are going to need to have realizations like: \"Ok, I see that X1-CARD hasn't been played yet, so I know X2-REGION is getting scored soon. I need to play X3-CARD to ensure...\"\n\nI'm sure the game is well balanced. I'm sure it has a depth of strategy that allows for repeated game play. I'm sure it's every bit as fun as people say it is once you grok the system. I'm just not even remotely interested in devoting that much of my attention to a single game (or game system).\n\n Components\n Artwork\n Mechanics (general gameplay \"fun\")\n Rules (well written and easy to learn/teach)\n Replay Value\n Player Uptime\n Meaningful Decisions (luck factor)",
    "timestamp": 1544223600
  },
  {
    "username": "bubblepipemedia",
    "rating": 3.0,
    "comment": "I'm not saying this is a bad game, but I am saying I greatly dislike it. I do not enjoy the idea of only being able to discard one card and the rest of the cards in my hand are cards I also don't want to play.",
    "timestamp": 1542582000
  },
  {
    "username": "greentowergames",
    "rating": 3.0,
    "comment": "So. Many. Chits. And, they're way too small, some of them have no sensical place where they are supposed to be placed. Power swings too drastically with a single card play. Rather than build up, plays and counter plays, I saw too many times a build up of influence to a staggering strength only to be completely removed by a single card with little chance to counter. The theme is awesome, but I didn't find the gameplay to match. Not sure why it's so highly rated.",
    "timestamp": 1525644000
  },
  {
    "username": "boardmathias",
    "rating": 3.0,
    "comment": "Far to random for the time investment and the amount of rules. The influence of die rolls and card draw is very strong. Additionally it feels a lot like playing a deck. The strength of this game is recreating this phase in human history and creating memorable in-game moments. On the other hand it is just to random, for the duration, rules investment and complexity.",
    "timestamp": 1524866400
  },
  {
    "username": "Buttburp",
    "rating": 3.0,
    "comment": "I don't consider this a war game. This is a card game with a board and like with most card games luck of the draw reflects the outcome. On the positive side, I like the historical flavour. But if you are looking for a card game I recommend Race For the Galaxy.",
    "timestamp": 1524780000
  },
  {
    "username": "formula88",
    "rating": 3.0,
    "comment": "I know a lot of people love this game, but I've payed multiple times and it has never clicked with me. The mechanics are decent enough.",
    "timestamp": 1521414000
  },
  {
    "username": "xlloyd",
    "rating": 3.0,
    "comment": "Played a couple times on the app. I just couldn't get into it. Maybe it's the theme (never been interested in wars and such). I might be tempted to try again in person but I'm not counting on it.",
    "timestamp": 1509836400
  },
  {
    "username": "h3lios",
    "rating": 3.0,
    "comment": "Just wonder why this game is always in the toplist rating. Appreciate the theme and the mechanics of the game, but it makes me confused and feel \"lost\". Too vague in my opinion and I'm sure it is not a game for everyone. Learning curve required.",
    "timestamp": 1498946400
  },
  {
    "username": "Jakebeleren",
    "rating": 3.0,
    "comment": "I find the balance just off enough that I would much rather play a lot more games. I like the idea of the game but don't want to play it again.",
    "timestamp": 1497996000
  },
  {
    "username": "alfonzo54",
    "rating": 3.0,
    "comment": "I recognize that this is a solid design and I honestly really like the core ideas. The deck management, the domino theory simulation, the tension around playing cards as events or ops and when to do so. That's all great stuff.\n\nUnfortunately for me there are a few things that really get in my craw and drag down my enjoyment. I don't really like the back and forth of the influence play. To me it feels more like an irritating slap-fight than a tug-of-war. I can't really explain why. I'm also not crazy about the USSR coming out like gangbusters early on and the US having to play crisis management until the initiative swings to them. I don't mind this in other games, like No Retreat, but for some reason I don't like it here. The way the defcon system ties into this annoys me as well since a clever USSR player can make it so the US simply can't fulfill their military ops on some turns. I don't like the feeling of being handcuffed to that extent.\n\nMy other complaints are basically niggling personal preference things. I hate Red Scare/Purge and especially the possibility of it recurring. I had it played three times on me one game. Even Twilight Strategy says it can simply make you lose. Why include it? Quagmire and Bear trap are similarly loathsome. The cards are too one sided in their effects. They don't do anything interesting to the game state and they're no fun to be on the receiving end of. It's a negative play experience. In my last game my USSR opponent could have headlined Red Scare on turn one and Dominated Europe right off the bat because I had a poor hand. He didn't because we both hate the card but it leaves a sour taste in my mouth.\n\nI also dislike the dice rolling essentially on principle. There are few enough rolls that a couple swingy results could impact play in an unpleasant manner. I would almost always prefer some kind of bidding or card resolution than a dice roll. When and how frequently the scoring cards come up is a similar issue.\n\nAll in all I understand why this is well liked. It's got depth of strategy with a non-insignificant luck element and it's quite replayable. It's definitely not for me, though. Every time I play it I'm miserable. The best bullet I ever dodged was when this was out of stock during the GMT tough economy offer and I got Combat Commander instead.",
    "timestamp": 1497909600
  },
  {
    "username": "PandemicFan15",
    "rating": 3.0,
    "comment": "My husband likes it, which is why we have it, but it's just not for me. I don't like 'war' or history type games.",
    "timestamp": 1497823200
  },
  {
    "username": "Quardah",
    "rating": 3.3,
    "comment": "- Highly overrated.",
    "timestamp": 1496008800
  },
  {
    "username": "ijacobs",
    "rating": 3.0,
    "comment": "Steam PC game",
    "timestamp": 1489359600
  },
  {
    "username": "DoctorJ",
    "rating": 3.0,
    "comment": "Before you dismiss this based on the fact that I only have one recorded play, know that I don't record online/iOS plays and I have played it dozens of times there. And the more I play it the less I like it. Although I'm a child of the Cold War and appreciate the flavour, the game just isn't that fun to me or particularly fascinating. Maybe I'm just really bad at this game, but I don't see the strategic planning in it. I am honestly baffled that this game is as highly regarded as it is here on BGG. I don't really like the back and forth nature of it that often comes down to who got dealt the best cards. The game is most interesting in the early and mid war, but generally positions are pretty entrenched by the late war, so the last third of the game is static and kind of uninteresting. I can't stand the rule that can allow someone to cost you a game by triggering a nuclear war because you had to pass a card to them. I'm sorry, but that's just sloppy design. I find myself more annoyed than entertained while playing the game. I realize I'm in the minority on this one, but there is a very long list of games I would play before this one.",
    "timestamp": 1488495600
  },
  {
    "username": "sutrebuh",
    "rating": 4.0,
    "comment": "Train station toilet! The global situation is unpleasant. Evil is overflowing in every corner of the (toilet) world. It needs to be fought everywhere. To do this, we are given a few (card) rags with different properties each round. Some promise improvement, but quite a few are so dirty that we just want to get rid of them, but that's exactly what we can't do. Almost every rag, no matter how dirty, has to be used to wipe the toilet, which ends up looking even worse than before.\nOnly occasionally do you get rid of a nasty rag, but even then you know for sure that it will come back. Everything therefore revolves around the question of in which order the rags should be used for what, in order to keep the mess reasonably under control, or at least better than the opposing cleaning freak. The game is a great illustration of how power politics works: the winner is the one who gets others into more mud while slyly wallowing in it themselves. The only thing you win is power over the mess you worked so hard to create. The German title is really well chosen.\nA game like cleaning a train station toilet: you fight endlessly against all the dirt that is constantly being brought in, and to exercise control over one or two (battleground) toilet bowls during inspection (scoring) at more or less random times, only to neglect others. A good dose of luck (with cards and dice) is definitely helpful. But if your best friend is luck when it comes to hours of cleaning, then the whole thing is, well, sh... .",
    "timestamp": 1756591200
  },
  {
    "username": "D_Choo",
    "rating": 4.0,
    "comment": "I appreciate the way Twilight Struggle marries theme and game in a way that is engaging and interactive.\n\nThe only downside to this game is the way you have to know/memorize the cards to do well. I'm learning this game with a few other players, but I can't imagine how a newcomer would enjoy this if one player has a significant experience advantage. Normally this is fine as more experience should generally lead to better players, but part of the kinds of experiences this game requires to get better is memorization, which I do not find interesting.\n\nOverall, this is a quality game with professional production and will be a keeper in my collection.\n\n10/11/23 Update: Had a few more plays and really enjoy the game for its theme. I’ll raise my rating 5 —> 6 because of the issues I still have with it.\n\n2/29/24 Update: This game can be fun but it can also be a bit too random due to the card draw and dice rolls. I realize that I enjoy my games being a bit more deterministic than TS. I still think it’s a great game.",
    "timestamp": 1753999200
  },
  {
    "username": "wiim",
    "rating": 4.0,
    "comment": "Vastly overrated. Not bad, but did not feel special at all. Really dislike you have to know the cards to have an even experience against someone else who knows them.",
    "timestamp": 1749592800
  },
  {
    "username": "brandysta",
    "rating": 4.0,
    "comment": "In order to play well, you have to know all the card combos and \"when to play what where.\" I don't play enough to know all the \"ins and outs.\" Not my thang anymore.",
    "timestamp": 1747519200
  },
  {
    "username": "coolkid91",
    "rating": 4.0,
    "comment": "The graphic design of this game is about as bad as a corporate flow chart. I could get past that if the game mechanics were solid, but contrary to other CDG's with military units, this game does away with that in favour of coups. While thematically more fitting, it is the single die roll resolution that I deeply dislike and nullifies any strategic element this game presumes to have. A 5 ops spread between a result of a 1 to 6 is simply too much for a game where the highest card is a 4. I think a 2 d 6 roll with an op result of 1-3 would have been much better.\n\nAdditionally I'm not wild on the decision to have the opponent's events trigger on use. It requires a deep understanding of all the cards in the deck and I'm not convinced the additional overhead is worth it; especially given the heavy predominance of luck.",
    "timestamp": 1746828000
  },
  {
    "username": "sireeshaaluri",
    "rating": 4.0,
    "comment": "2 only",
    "timestamp": 1742425200
  },
  {
    "username": "DiceyBoi22",
    "rating": 4.2,
    "comment": "For the grand complexity that Twilight Struggle attempts to be, it feels like an overcomplicated game of Risk. Where there are too many ways too lose, not enough ways too win, and inevitably the lack of story and purpose within the game causes me to only wish to play another game. For the grand strategist who doesn't mind pages of rules, I recommend this for you. But I believe their are better games for 2 people to enjoy.",
    "timestamp": 1741042800
  },
  {
    "username": "cacol89",
    "rating": 4.0,
    "comment": "Random luckfest. I hated it. I could not even get to 1/4 of it. This is the kind of game that frustrates me bug time. Too much luck everywhere.",
    "timestamp": 1729980000
  },
  {
    "username": "ciceroni",
    "rating": 4.0,
    "comment": "Not bad but just too long and complicated to get into. The horrible rulebook doesn‘t do it any favors either.",
    "timestamp": 1728684000
  },
  {
    "username": "Jossjack",
    "rating": 4.0,
    "comment": "No sé ni cómo describirlo. Simplemente no es lo mío. Quizá algún día le de una segunda oportunidad a ver qué show.",
    "timestamp": 1726956000
  },
  {
    "username": "alexdesouza",
    "rating": 4.0,
    "comment": "I admire the story and imagined history that Twilight Struggle tells through its game. The theme, scope, and arc of the gameplay is terrific. However, the presentation is dry (compared to most modern games), the rules overhead is large, and the game length is often 3-4+ hours, significantly longer than it needs to be for the experience it provides. As much as I enjoy the idea of Twilight Struggle, I struggle to get the game to the table or have the desire to do so; but I certainly understand why this game is as esteemed as it is.",
    "timestamp": 1726696800
  },
  {
    "username": "BearDot25",
    "rating": 4.0,
    "comment": "Feels sacrilegious to say it, especially after only a couple games, but I don’t think Twilight Struggle is for me.\n\nBoth games ended in mid-game USSR victories. As the US, I felt like I did what I could but got unlucky with a few coup rolls, and that was that — the snowball was rolling and there was no way to claw back. Now I’m sure with enough plays and memorizing the deck the luck factor and imbalance improves, but I’m not going to dedicate enough plays to get there after my first few games were not all that fun. In general, Twilight Struggle felt very game-y. I didn’t get the immersion so many say they have, because the main mechanic of the game — your opponents events resolving — makes no thematic sense, so many important things come down to a dice roll you can barely manipulate (coups, space race), and the whole defcon vs. milops thing forces you to coup even when it’s not advantageous. Wir Sind Das Volk feels like a much more mature political CDG game.",
    "timestamp": 1715205600
  },
  {
    "username": "brothervm",
    "rating": 4.0,
    "comment": "Fun but took WAY longer than I want to invest in a game. Second play and I felt like I had literally no good options throughout the course of the game. Even actions I took that I thought would net me points ended up going into the favor of the opponent due to the luck of the timing of cards played and the swingy dice rolls. I really want to like this game but I just don't.",
    "timestamp": 1712613600
  },
  {
    "username": "yardswimmer",
    "rating": 4.0,
    "comment": "Thematic implementation of the cards and tension is great, unfortunately the gameplay mechanics are pretty horrendous when viewed on modern board gaming and if this game was made even 10 years later it would not be ranked this high, way too much luck in this game from scoring card timing, card draws where you just have no shot to win that this game would benefit from a redesign",
    "timestamp": 1707692400
  },
  {
    "username": "AmandaDesignsGames",
    "rating": 4.0,
    "comment": "I know that many love this one, and that an expert will beat me, but this game is too random for its length for my tastes. Too often, I wasted good cards to bad rolls, or when my opponent had the perfect counter in hand. I'm sure I could learn to like it, but I don't feel like investing the time when so many games I love barely get table time.",
    "timestamp": 1701817200
  },
  {
    "username": "BangkokRobert",
    "rating": 4.0,
    "comment": "Played just once and short and didn't finished it.\nFelt like Risk which I don't like.",
    "timestamp": 1689976800
  },
  {
    "username": "HavocIsHere",
    "rating": 4.0,
    "comment": "The theme is really engrossing, the rules are simple and crystal clear.However, for that kind of price, I would expect better cards, better pawns (I plan to replace counters with little red and blue dice, but really for that much money the components should be ok out of the box), better art. The box seems to be extremely sturdy... in fact the box is quality wise the best component of the game.The randomness factor is a bit high for my tastes, but ok for that type of wargamish game.However, it is an original game and I have had a good time each time I played. It deserves a better edition.edit: does not deserve #4 spot I think. The first five or so games were much fun, but it still last long, much too long for what it is. The imbalance becomes more and more blatant, an US win is possible only when luck is on its side.\n\nhttp://www.boardgamegeek.com/thread/240085\n\nupdate: I do not want to play again; in retrospect, I only like the idea of that game and none of the execution.\nIt all comes to this: do you like to memorize all the cards in a game? Many games reward that, and if it is your cup of tea, and if you have a similar-minded partner, and if you do not mind the luck, than maybe you'll like this. It's not for me anyway.",
    "timestamp": 1685484000
  },
  {
    "username": "rubiks75",
    "rating": 4.0,
    "comment": "This shouldn’t be enjoyable, but it is!!! Easy to get thoroughly absorbed if you’re in right mood",
    "timestamp": 1681509600
  },
  {
    "username": "yukinonna",
    "rating": 4.0,
    "comment": "P 2",
    "timestamp": 1679353200
  },
  {
    "username": "Citery",
    "rating": 4.0,
    "comment": "While the detail and potential for skilled play are readily apparent, I came out of my first half-dozen games severely let down.\n______________________________________________________\n\nThe rawness of the tug-of-war system for controlling countries results in a lot of unsatisfying tit-for-tat exchanges during play and the consolidation of so much geopolitical subtlety into abstract Influence Points made TS feel unexpectedly disconnected from its theme. After just a few rounds the Cold War veneer washed away and all I saw was a board of red and blue numbers and a bunch of red and white cards that made the numbers go up or down. It feels gamey.\n\nThis unfortunate feeling was deepened by the event system: forcing events of the opposite player to trigger when a card is used for OPs seemed intriguing at first, but it ended up funneling my games of TS into very predictable, constrained lines of play. With almost every event being forced to go off sooner or later, and with player's having such limited agency in their three actions (really two, accounting for the dubious balance of realignment), it just didn't seem possible to have any drastic narrative departures, and the overall game-feel was one of complete mercy to the deck.\n\nNot only does this make TS's narrative arc too scripted for my tastes, but it also means that high levels of play in TS seem dependent on deck memorization and careful maneuvering around the specific requirements of your opponent's events, rather than on more general tactics. Encouraging this type of hyper-detailed foreknowledge is personally unsatisfying as a player, but also undermines TS's thematic bedrock: that the Cold War (to the best of my understanding) was a cultural epoch defined largely by crippling uncertainty.\n______________________________________________________\n\nMost of all though, I heavily dislike the type of dice randomness that TS employs. The probabilities of each roll are completely transparent and drama-less, and the only two possible outcomes for any scenario usually boil down to a painfully binary yes or no. If you roll badly on a space-race discard, you just don't make any progress at all (cause everybody knows rocket scientists are prone to all-or-nothing theatrics). If you roll badly on a Quagmire/Bear Trap check, you just don't play the game until you roll better. The dice don't become a source of tactical reassessment or granular risk management, they just say \"sorry\" and tell you to try again. Coups are the notable exception to this, as the rewards gained are determined by the strength of the roll, something I wish more effects in TS would have emulated.\n\nWith the combination of so many binary die rolls and the variance in the card deck, the likelihood of playing a non-game of TS seems to be worryingly high. Someone got all the neutral 4-OP cards the first time through the deck, or someone had to sit out for four (or nine in one of our games) rounds due to Quagmire, or just the right scoring cards randomly came back out of the late war deck to favor one player over another. I'm sure that in the aggregate, strong TS players win more often than not, but this level of wild unpredictability is not easy to accept when games can be 3+ hours long, and having it rear its head in such a small sample of games is very concerning.\n______________________________________________________\n\nOne last gamey nail in the coffin: having the active player be the sole loser in the event of Nuclear Holocaust is ridiculous. It creates insane incentives for one player to enact mutually assured destruction on their opponent's turn if possible because even if you pull the trigger on humanity-ending Armageddon, you can still die a winner off a technicality.",
    "timestamp": 1677279600
  },
  {
    "username": "Jessimate",
    "rating": 4.0,
    "comment": "Not won over by this, probably need to give it another try…",
    "timestamp": 1671318000
  },
  {
    "username": "Withalskraai",
    "rating": 4.0,
    "comment": "I've played this game many times now and feel like the luck element is a major problem. Options are far too limited to mitigate a series of unlucky draws/dice rolls. The consequences for being unlucky feel devastating especially when the game is difficult enough already. I don't want to have to memorize 100+ cards and various strategies and timings in order to play effectively. At 3+ hours it also gets laborious af. No fun at all.",
    "timestamp": 1660860000
  },
  {
    "username": "LvsSocer",
    "rating": 4.0,
    "comment": "Game fundamentally relies on in depth knowledge of the cards.",
    "timestamp": 1652306400
  },
  {
    "username": "Brought0n",
    "rating": 4.0,
    "comment": "Gift from Fletcher",
    "timestamp": 1647298800
  },
  {
    "username": "DoxChristian",
    "rating": 4.0,
    "comment": "Love the theme, and it's a pretty game, and that is about it. Random back and forth area control games are not fun.",
    "timestamp": 1645311600
  },
  {
    "username": "SocialistDemon",
    "rating": 4.0,
    "comment": "Very thematic and strategic political war game but there are plenty reasons not to play it:\n\n1) Takes an eternity to play and has a crippingly slow learning curve.\n2) Veterans who know the cards have an overwhelming advantage over beginners.\n3) Early mistakes can easily predeterminate your defeat and then you struggle for hours until it's finally over.",
    "timestamp": 1644188400
  },
  {
    "username": "kisgen",
    "rating": 4.0,
    "comment": "Easily one of the most overrated games.",
    "timestamp": 1642633200
  },
  {
    "username": "beri",
    "rating": 4.0,
    "comment": "It's clearly a quality game, but I'm just not into the theme, and I don't like games you have to study and memorize the cards to have a chance.",
    "timestamp": 1641164400
  },
  {
    "username": "gardi",
    "rating": 4.0,
    "comment": "A thrilling game heads up against a friend, although I prefer other 1-on-1 games. Great component quality and such.",
    "timestamp": 1639350000
  },
  {
    "username": "shawnmarx",
    "rating": 4.0,
    "comment": "Owned by app, and had planned on playing it with a friend. We both had the similar opinion: the game requires full knowledge of all possible strategies and cards that could come up. That's just not fun and I find the rating on this to be much too high.",
    "timestamp": 1635112800
  },
  {
    "username": "churchb3",
    "rating": 4.0,
    "comment": "Bad experience. Hated it. I'm sure it's a good game, but would need to read the rules again and probably play through a bit on my own before jumping into a game with experienced player (but inexperienced rules teacher).",
    "timestamp": 1627941600
  },
  {
    "username": "boardgamearchive",
    "rating": 4.0,
    "comment": "2020\nHated my first experience and I don't see myself playing it in the future.",
    "timestamp": 1621980000
  },
  {
    "username": "Jarikv9",
    "rating": 4.0,
    "comment": "jack",
    "timestamp": 1620079200
  },
  {
    "username": "ryansmum2008",
    "rating": 4.0,
    "comment": "Not for me",
    "timestamp": 1618351200
  },
  {
    "username": "Conradb123",
    "rating": 4.0,
    "comment": "I bought this game because it was ranked really high on bgg. But, the more I invested in it, the less I wanted it. I bought the digital version too because the set up is pretty lengthy in real life, and I wanted to practice. I just don't think it's fun. I would play it if someone begged me to play, but that's about it. Buy the digital for 5 bucks and test it out if you're curious.",
    "timestamp": 1613775600
  },
  {
    "username": "menguita",
    "rating": 4.0,
    "comment": "El juego está muy bien editado.\nA parte de eso, las reglas son muy complejas y no tengo claro que consigan su propósito.\nTambién tiene el inconveniente de que la partida se hace muy larga.",
    "timestamp": 1609801200
  },
  {
    "username": "RodZ",
    "rating": 4.0,
    "comment": "This game is very thematic and at times playing the USSR I found myself wanting to say \"Nyet Nyet\" when I was not happy with a USA move.\n\nThe map and components are ok, game has some dice rolling when you perform coups whilst adding some randomness does not detract completely from game. Game takes too long for what it delivers and can be a little fiddly with all the influence counters. I will play this game again but will not be purchasing a copy.\n\nNotwithstanding, there is no way this game should be number one as there are loads of other games about.",
    "timestamp": 1607122800
  },
  {
    "username": "dudaexistencial",
    "rating": 4.0,
    "comment": "Extremely extense and beefy for my taste. Played only once",
    "timestamp": 1604098800
  },
  {
    "username": "Dimitri C",
    "rating": 4.0,
    "comment": "- Like: 2 player game, area control is always fun, beautiful board and cards, great theme, relatively small rule set.\n\n- Dislike: considerable luck factor, longish (3h), bothersome calculation rules for deciding the winner of \"realignment rolls\" and \"coup attempts\", big learning curve because you need to learn all the cards.\n\nAll in all it was the luck factor that made me sell Twilight Struggle. The game is too heavy and too long for the winner to be decided by chance. And yes, luck can be mitigated for a big part, but one of the players will get that small bit of extra luck in drawing and dicing, so with players of similar strength chance will decide who wins.",
    "timestamp": 1603144800
  },
  {
    "username": "damo164",
    "rating": 4.1,
    "comment": "Slow and complex. Can get the same feel from much quicker simpler games. Not my style of game either.",
    "timestamp": 1600207200
  },
  {
    "username": "Primalwolf",
    "rating": 4.0,
    "comment": "Played on the ap. Don’t understand it.",
    "timestamp": 1598824800
  },
  {
    "username": "garry_rice",
    "rating": 4.0,
    "comment": "I used to really like this game but I think my tastes have evolved. I played several games over the past few weeks and I found the die rolls extremely frustrating and the the randomness of how the cards come out (especially the scoring cards) also quite frustrating.",
    "timestamp": 1593295200
  },
  {
    "username": "auroramu",
    "rating": 4.0,
    "comment": "I didn't like it at all",
    "timestamp": 1589320800
  },
  {
    "username": "Lecaro",
    "rating": 4.0,
    "comment": "Das Gleichgewicht des Schreckens spielt den Kalten Krieg nach dem 2. Weltkrieg nach. Das Spiel wird dabei von Karten angetrieben, die die Spieler in ihren Runden gegenseitig ausspielen. Die Karten können dabei auf unterschiedliche Arten benutzt werden. Meistens werden sie als Kartenwerte ausgespielt und können dann in verschiedenen Ländern Einfluss generieren, vorausgesetzt der entsprechende Spieler hat bereits Einfluss in einem Nachbarland. Die Karte kann aber auch eingesetzt werden um den Einfluss des Gegners zu minimieren, was in besonders gekennzeichneten Kriegsgebieten zu verringern des DEFCON Status führt und denjenigen Spieler verlieren lässt, der dadurch einen Nuklear Krieg auslöst, so ist das im Grunde nur ein Aufwändiger Counter wie oft die Aktion von beiden Spielern genutzt werden darf.\nDen Kartentext der Karte darf der aktive Spieler nur nutzen, wenn die Karte selbst neutral oder zu seiner Nationalität gehört. Spielt man stattdessen eine Karte aus, die zur Gegnerpartei gehört darf nur der Wert, wie oben beschrieben genutzt werden, zusätzlich führt der Gegner das Event aus! Da jeder Spieler pro Runde eine feste Anzahl an Karten ausspielen muss, kommt dieser negative Effekt öfter zum tragen, als man es sich wünscht. Punktekarten dürfen nicht in die nächste Runde genommen werden und müssen zwingend ausgespielt werden. Sie bringen beiden Spielern Punkte, je nachdem wie der Einfluss des zu wertenden Gebietes gerade aussieht!\nIm allgemeinen wird in diesem Spiel auch vieles einfach ausgewürfelt. Klappt ein Coup, die nächste Stufe des Weltraumprogramms, im Grunde: Wer gewinnt das Spiel.\nMir hat diese \"Simulation\" überhaupt nicht gefallen... Sehr viele Kartentexte beeinflussen alle möglichen Länder. Ich muss schon Glück haben um die richtigen Karten auf die Hand zu bekommen, die mit hohen Werten und eigener Fraktionszugehörigkeit. Klappt das nicht, dann ist mir bitte die Würfelfee hold, wenn auch das nicht klappt dann hat doch bitte der Gegner auch einfach nur Karten- und Würfelpech und scheitert auch dieses Stoßgebet, dann lass das Spiel doch bitte schnell enden! Und auch dieser Wunsch bleibt mir verwehrt. Nein! Wenn Kriegsspiel, dann viel lieber Risiko, denn das hat gefühlt den gleichen Glücksanteil, lässt aber dafür die Unmengen an Kartentexten weg, die sich die beiden Spieler alle merken müssen.\nWOW! Wie kommt dieses Spiel auf eine Wertung von 8.8 beim BGG Rating? Das ist es mir nicht wert, aber ein Glück bleibt mir: Es war kein Massenprodukt und ich kann es wohl für den gleichen Preis loswerden, den es mich gekostet hat (abgesehen von der Spielzeit, die musste ich wohl als Lehrgeld zurücklassen!",
    "timestamp": 1586815200
  },
  {
    "username": "trayl",
    "rating": 4.0,
    "comment": "The scripted use of scoring cards is monstrously dull. Not many options to explore the game because you have to prepare/respond to the predictable scoring cards.",
    "timestamp": 1584658800
  },
  {
    "username": "JasonSaastad",
    "rating": 4.0,
    "comment": "grognard game\n prolonged playtime\n dramatic dice",
    "timestamp": 1579734000
  },
  {
    "username": "waxweapons",
    "rating": 4.0,
    "comment": "Didn't \"get\" this game - which is a shame because it is so highly rated. Just goes to show, personal preference is entirely subjective!",
    "timestamp": 1579647600
  },
  {
    "username": "Kaizen Zanshin",
    "rating": 3.5,
    "comment": "Meh. Probably the best of the series but I'm just not that excited about it. It's a okay game at best for me. Edit: Jan/20 tried this again nine years later and it's just random on random over and over. The theme is cool, but it isn't really based on an accurate account of reality it portrays itself to be. Rerated from a 5.5 to a 3.5",
    "timestamp": 1577919600
  },
  {
    "username": "ultimoratio",
    "rating": 5.0,
    "comment": "OCT 2025\nIt's less interesting with even more plays. I'm now incline to play Napoleon's Triumph more.\n\n======================\nUPDATE: Sept 2020\n\n45 plays in and it starting to show its roughness to me in a very apparent way. The decision tree turns out to be pretty narrow even after you get past through the standard openings. Some moves become a bit obvious. However, the decisions you take are still very decisive and the tension is still there, which stops this from going down the ratings.\n\n==========================\n\nOne of the best 2 player games I've ever played. It has tight hand management and area-control, but strategy is loose enough to give you freedom to go on multiple paths.\n\nThere's scripted openings for both Soviet and American players, but the game easily branches out. Knowledge of the deck is crucial. Yet, the game has chess-like feeling into it as the two players manoeuvre themselves on every regions of the game.",
    "timestamp": 1760306400
  },
  {
    "username": "iplaybgnaked",
    "rating": 5.0,
    "comment": "Still one of the best CDGs and 2 player games. Unfortunately it requires an opponent of equal skill level to be fun to play because it is nothing but squash matches otherwise.",
    "timestamp": 1759010400
  },
  {
    "username": "Killi",
    "rating": 5.0,
    "comment": "Thematic and original mechanically.\nI just didn't get it, and don't want to. Not for me.",
    "timestamp": 1756504800
  },
  {
    "username": "zavijahbeta",
    "rating": 5.0,
    "comment": "It is not at all a mediocre game, but because the dated gameplay and its theme it is a very niche game. It is not as smooth as other contemporary games. I do not know how this is still in the top 20 games. Maybe there is a bunch of nostalgic that still play it, but from the log stats it doesnt seem is played a lot in comparison with the other top 100 games.\n\nMy confusion strives from its repetiteveness. As a wargame, the turns feel same one after the other. I have played many hex and counter wargames and card diven wargames and TS feels not different (like storm over stalingrad by the same time), it tries to simulate a war and utilize action points to impose a dominance over a region. I do not understand the appeal to it, perhaps it was the first wargame published to be played in less tha 4 hours.\nThe game is very easy to play, play a card for its points or event and make some stuff on the map. However it drags and drags for ages. I feel this is because its randomness and unnecesary mechanics (military operation tracks and space track). Moreover, you have to use a die roll to determine many events and some cards are very punishing for the rival. Yes, I understand simulations appeal is the uncertainty of events, the possibility of what if, but again randomness is the epitome of contemporary hate in board games.\n\nI understand the high position of other wargames within the top 20 like war of the rings or star wars rebellion is due to the theme, but seriously Cold War?. There is no other game with this theme in the entire top 500.\nIt stills intrigue me how past top 20 games lost the position after two decades, like shogun, el grande, tigris and euphrates.",
    "timestamp": 1755813600
  },
  {
    "username": "Sisyfus",
    "rating": 5.0,
    "comment": "I am probably not qualified to write a review for Twilight Struggle, because I have only played 1/2 a game. But I had such strong feelings about it after that half a game I felt like it warranted a review. I'm giving it a 5 because I know it is a beloved game with a great reputation, but if I were rating it based on my personal experience it would be a 1. I guess my 5 is based on my assumption that if I forced myself to play a couple more games, I might understand why someone might like it, but I am certain I never would.\n\nLet me also clarify that I love dense games like Twilight Imperium and Root. So when I picked up Twilight Struggle I was excited that I could have a dense game meant for 2 players. So I went in sold on the game. But to begin with, Twilight Struggle is a visual mess. The game board is the most atrocious, unreadable nightmare I have ever seen. It is seriously my least favorite board game board. The cards themselves and the rulebook are also quite unpleasant to look at from a visual standpoint, and the rulebook is almost impossible to decipher.\n\nAesthetics aside, the actual gameplay was so opaque that I never had any idea what was going on. Besides the insane rules overhead, Each turn you are playing a card that has a benefit for you and for your opponent. And a lot of the time, it seemed like the benefit for your opponent was far greater than the benefit for yourself. I dreaded every single action, and always felt like I was sliding backward. Furthermore, from a Thematic perspective, I don't understand how me playing (for example) the \"Korean War\" card, is triggering the Korean war within the world of the game, or why I would be getting anything out of it or why I would trigger it in the world of the game if I had a choice. It just felt like time it was my turn it was only bad things happening to me that were outside my control. For the record, my opponent felt the same.\n\nAs I said, we didn't finish. We spend almost 4 hours learning the rules, and trying to play and if the round tracker was any indication we were only 1/5 of the way through the game. But we were both miserable, sick of looking at the board and cards, unsure of what we were supposed to be doing, and not intending to ever try Twilight Struggle again.",
    "timestamp": 1754517600
  },
  {
    "username": "Curds",
    "rating": 5.0,
    "comment": "This is an incredible game, I'm just not into political balancing for territorial gain in a board game kinda gal. I did enjoy it with very specific friends.",
    "timestamp": 1751839200
  },
  {
    "username": "DT76",
    "rating": 5.0,
    "comment": "TS is one of those games that I'll play on rare occasions. It's not bad, in fact I enjoy a number of parts of it as well as the overall feel. There's just too many things it does that irritate me, and as long as its sister games are around, I'd rather play one of them. I might play it more frequently despite this if A it wasn't 2 player only (2p games just happen less often) and B it didn't take so darn long.\n\nHaving finally played a few card-driven games, I've come to enjoy this style pretty well. I like the tension of deciding how best to use each card, each hand. I like the headline phase in the beginning, the space race track, the pseudo-deckbuilding element as you try to weed out your opponent's powerful events when they'll be least useful. The area majority core is set up a little strangely, but still totally understandable. Even the scoring cards, which can be a kind of wrench in things by showing up at random, I don't have a problem with. So long as you know what's coming & what's already happened, you know where to focus your attention.\n\nWhere TS loses me is in most of the rest of the game systems. First off, the defcon track. This thing may be thematic, but it's also a huge pain. It feels like a major portion of the game is just managing this one element and trying to make sure you get the first turn when it's low enough for you to pull off the move you want. Having to remember these bizarre restrictions about where you can and can't do these particular actions is always a nuisance. And that's before you get to the fact that you can end the game prematurely by forcing your opponent to push it to 0. I find this both anti-thematic and un-fun, and dislike that rule intensely.\n\nThe military ops track is another piece of chrome that I think could've stood to be cut. I never remember to try and meet that requirement, most of the time you exceed it w/out even trying, and it seems to serve only to encourage you to do coups even more than you ordinarily would (more on that below). I just have no idea why it's even there.\n\nLastly, though, is the big thing: the action balance. I've played this one several times with the experienced players, the ones who do this every week. Now, you can do 4 things with a card. You can attempt a coup or do a realignment, using the die. You can play the event, or you can just use it to put out influence. The people who know what they're doing seem to stick with just 2 of those: coups and events. Events are self-explanatory, if those are good you'll want to use 'em. But it really feels to me like you want to be using coups at every opportunity, as they're just stronger than the other 2 options. Realignments sound cool, but I've rarely seen them be useful. It would be one thing if coups were locked off by defcon restrictions, but the weaker realignments weren't, but as it is, there's not much reason to use them. Placing out influence is likewise fine, but a very expensive way to break up control, limited by adjacency so you can't always reach the spot you want, and then the next turn your opponent can come along and stage a coup, undoing all your work.\n\nIn the end, it's this repetitive feeling of how the game plays (plus the general clunkiness and length) that really gets to me, and makes me wish I were playing something else.\n\nPlays: at least a dozen",
    "timestamp": 1749506400
  },
  {
    "username": "Jayadevhaddadi",
    "rating": 5.0,
    "comment": "kinda interesting mechanics like the VP points going back and forth\nand influences mechanics is cool also... but i dont like the random aspect and all that reading of cards",
    "timestamp": 1749160800
  },
  {
    "username": "eddieb",
    "rating": 5.0,
    "comment": "Not a game to play once. A Cold War version of chess. Game is taken very seriously by the community. Someone good, you just won't beat. You can play 100 games, but if they are a master- they will trounce you.\n\nAfter a year, i haven't wanted to play again. So I am lowering rating",
    "timestamp": 1746568800
  },
  {
    "username": "Vinnichi",
    "rating": 5.0,
    "comment": "Poszła w piz.... COO?! Zachodnia Europa...",
    "timestamp": 1745532000
  },
  {
    "username": "dopebones",
    "rating": 5.0,
    "comment": "After about a dozen plays, I'm starting to appreciate it more, knowledge of the cards leads to certain strategies and gives it a surprisingly chess-like feel.",
    "timestamp": 1739142000
  },
  {
    "username": "dr glaze et al",
    "rating": 5.0,
    "comment": "A game of cold-war intrigue and manipulation. The game has many clever additions to the popular card-driven genre [aka 'We The People' series games]. It plays more like a two-player majority game than a GMT wargame. I am a little concerned about how much of the game could hinge on burying opponents good cards and cycling yours. But moreso about how much it is important to memorize and track key cards.\n\nOn a side note, the typos and blatant errors in the first printing game are apalling. No part of the game got printed without mistakes; the map, the game cards, the play aids, and even the rulebook all have errors. Was there a single editor, developer, or even a proofreader? 'Replublic of China'? Different scoring rules on the play aid versus the rule book?",
    "timestamp": 1738537200
  },
  {
    "username": "Owest",
    "rating": 5.0,
    "comment": "Interested but haven't foudn the strategy for this game yet.",
    "timestamp": 1737327600
  },
  {
    "username": "Firefly57",
    "rating": 5.0,
    "comment": "Moritz",
    "timestamp": 1735858800
  },
  {
    "username": "kylehelp123",
    "rating": 5.0,
    "comment": "2",
    "timestamp": 1735426800
  },
  {
    "username": "jonesy792",
    "rating": 5.0,
    "comment": "Great thematic immersion in the history of the Cold War and the fundamental card play system is solid enough. But I found the gameplay too long and taxing to be a satisfying gameplay experience. A lot of the gameplay felt frustratingly tit for tat and zero sum in a not very enjoyable sense. I feel there are smaller duel games with cards which can play in a much shorter time and give an equally worthwhile experience (plus with these smaller alternatives like Radlands or Air, Land and Sea, you can play more times in one session if you feel aggrieved by luck of the draw and dice rolls).",
    "timestamp": 1735254000
  },
  {
    "username": "Harbard",
    "rating": 5.0,
    "comment": "+ I like the context of this game, the cold war and the fight for influence over the world is really nice.\n\n+ The fact to always searching for the best solution how to use bad cards without ruining your strategy.\n\n- There is too much randomness for me to enjoy this game. Cards drawn, resolution with dice... You can spend 8 turns to build your influence pretty well, and then next turn, you just have the worst cards ever, which ruin completely your game and strategy. This has too much influence on the game. One game I've lost 17 victory points just because of bad cards (3 scoring cards + mostly ugly red cards while playing USA)..\n\n- I hate the fact that you could play a card that will allow your opponent to use to make a coup while at DEFCON2, and then make you loose. Well, he choose to make the coup... Why do you loose? It's a really stupid rule.",
    "timestamp": 1734822000
  },
  {
    "username": "jond",
    "rating": 5.0,
    "comment": "I cracked and purchased a 2nd ed on the BGG Marketplace. Looking forward to getting this to the table a lot.",
    "timestamp": 1733785200
  },
  {
    "username": "ernestns",
    "rating": 5.0,
    "comment": "Thematic and historical, I haven't been able to understand or appreciate the strategic depth it has to offer that others have suggested.",
    "timestamp": 1728770400
  },
  {
    "username": "esayitch",
    "rating": 5.0,
    "comment": "SOLD because it was one of the first games I'd gotten, to play with my dad of all people... Of course, it is far too complex and never got played. If I want to play an epic wargame with my wife, we have War of The Ring.",
    "timestamp": 1728597600
  },
  {
    "username": "Invisible_Lemons",
    "rating": 5.0,
    "comment": "Wanted to love it after seeing a lot about it online, and thinking it was right up my alley. Thought I would, bought it, played most of a game, got interrupted before the end and never finished it. Packed it up a couple days later after neither player tried to finish it.\nThats why my review is only a 5, I'm sure theres a great game here, but it doesn't work for everyone.",
    "timestamp": 1725573600
  },
  {
    "username": "Bertuccia",
    "rating": 5.0,
    "comment": "Love the theme and vibe, however it easily takes 2-3 hours and the dice can be very frustrating. Played multiple times and I always feel like my faction is terrible and the cards are always bad. Luck is very impactful, both for dice and card drawing, and it’s not something I can accept in a 3h game.",
    "timestamp": 1724450400
  },
  {
    "username": "invervegas",
    "rating": 5.0,
    "comment": "Complexity √",
    "timestamp": 1724364000
  },
  {
    "username": "Pekuis",
    "rating": 5.0,
    "comment": "Dec 2022: 7\nJul 2024: 5",
    "timestamp": 1721685600
  },
  {
    "username": "mcdeans",
    "rating": 5.0,
    "comment": "Whilst this is a very good game, it does require quite frequent play to really enjoy it. The card combos and strategies don't suit infrequent play, and playing against someone with more experience will see a one-sided match.",
    "timestamp": 1719871200
  },
  {
    "username": "GarfieldKlon",
    "rating": 5.0,
    "comment": "#56\n\nNot final scoring. Played 3 rounds\nGame mechanics are easy to teach, but the cards are sometimes confusing and not really clear.",
    "timestamp": 1719784800
  },
  {
    "username": "tibbles",
    "rating": 5.1,
    "comment": "I can see the appeal, but this game is gonna take more plays than I want to give it to learn the cards. This was maybe the best back in the day, but I think there's better games now to do similar.",
    "timestamp": 1715983200
  },
  {
    "username": "TertiaVigilia",
    "rating": 5.0,
    "comment": "If you pick up this game, you'll never play Risk again - never. It's so deep in strategy and tactics, in bluffing and creating schemes. At every move you need to think what your opponent might have planned - and in the course you can change the world's political landscape, which is the true fun part of it. You end up with a communist UK and capitalist Cuba e.g. Did I mention the one who triggers an actual nuclear war looses the game? Genius.\nAt the end I did not keep it as it's hard finding a play group for this, and solo (two-handed) removes the tension.",
    "timestamp": 1714773600
  },
  {
    "username": "Neokarasu",
    "rating": 5.0,
    "comment": "Very interesting cardplay system where if you use your opponent's cards for the action points, they get to resolve its main effect. This leads to some interesting decisions and timing to minimize their benefit. If this is just the game, I would have enjoyed it a lot more and given it an 8.\n\nHowever, there is one mechanic in the game that decreases my enjoyment of the game a lot: having to roll a dice for a coup. I think coup is a very powerful action to take and having the result rely on a die roll makes it much less enjoyable to me.",
    "timestamp": 1708729200
  },
  {
    "username": "LuisGomez",
    "rating": 5.0,
    "comment": "[Sleeved]",
    "timestamp": 1706050800
  },
  {
    "username": "sammmmmy195",
    "rating": 5.0,
    "comment": "There's a lot to love about this game, but I never want to play it again.\n\n1) If you don't know the cards, of which there are tonnes, you can be totally screwed by something you didn't even know was possible - which has happened either to me or my opponent basically every time I've played it.\n\n2) Huge swings of luck. Dice rolls are one thing, but my last game came down to a 50:50 card draw (War Games). Not sure how people don't come away feeling crap when a 4 hour intense strategy game can come down to chance.\n\nIf you love the theme, have someone to play it with regularly, and don't mind a bit of luck, you'll probably have an incredible time with it, but I can't imagine there's that many people who fit those conditions.",
    "timestamp": 1705446000
  },
  {
    "username": "arielpk",
    "rating": 5.0,
    "comment": "Nothing above average",
    "timestamp": 1705186800
  },
  {
    "username": "ccbjmu",
    "rating": 5.2,
    "comment": "冷战热斗 晨昏对峙\nTwilight Struggle\nChS",
    "timestamp": 1699484400
  },
  {
    "username": "KingD7W",
    "rating": 5.0,
    "comment": "Awesome theme-mechanic tie in, but it is too long for a two player game.",
    "timestamp": 1692396000
  },
  {
    "username": "iqwarrior",
    "rating": 5.0,
    "comment": "Good \"not-game\". Just not fun. Or not a game. Like the chess: way too serious and exhausting.",
    "timestamp": 1689112800
  },
  {
    "username": "saccenti",
    "rating": 5.0,
    "comment": "Tremendously fiddly, it takes forever, and the dice combat element seems like something I might have designed at age 12. The tug-of-war Adding Of Influence Chits is a puerile design mechanic.\n\nIt is embarrassing that this particular game sits bizarrely atop the rankings on our website, a strange fact which surely sells many copies of the game...to many naive, trusting buyers. I don't really know what to say about that, but I know that it doesn't make me feel good.\n\nUPDATE: I've given this numerous tries now. It is an Ameritrash dice fest. Experienced players (I've only played with fellow amateurs) will surely beat the uninitiated, which is normally the sign of a good game. But in this case, I think it is mainly because they know the deck, and so can manipulate the timing of things. To those who think that this \"skill\" is what makes for an interesting board game encounter, I say \"have at it.\" When two similarly experienced amateur players are pitted against each other, you have a four-hour affair that comes down to who rolls more \"6s\", and who draws the cards in the order that better helps them. That's the sort of nonsense that is utterly forgiveable--and even sometimes fun--in a thirty-minute game. But...\n\nI've dropped my rating on this every single time I have played it. Enough is enough.",
    "timestamp": 1688853600
  },
  {
    "username": "BenRon",
    "rating": 5.3,
    "comment": "1",
    "timestamp": 1687557600
  },
  {
    "username": "davegw78",
    "rating": 5.0,
    "comment": "Bought \"as is\" with no box. Stored in a white GMT box.\n\nIncludes all counters (unpunched), all 110 cards, both player aids and deluxe mounted map. Rules show \"2009.\"",
    "timestamp": 1685570400
  },
  {
    "username": "Kingsoby1",
    "rating": 5.0,
    "comment": "I'm not a big fan of shared deck cdgs where you activate the opponents event by playing the card for ops. Otherwise I think the game is pretty good except for the dice rolling. And especially groundbreaking for when it was released. On release I'd rate this an 8 probably.\n\nIf you haven't played this yet, I highly recommend looking into 13 days the Cuban missile crisis instead. Then if you really dig that it might be worth checking out Twilight struggle for the in depth history",
    "timestamp": 1682805600
  },
  {
    "username": "realityfoible",
    "rating": 5.0,
    "comment": "Twilight Struggle is an interesting game to be sure, and once mastered can be an extremely tactical beast... but ONLY if both players have a solid understanding of all the cards.\nUntil you've done so, TS is going to feel completely arbitrary.\n\nMultiple turns of careful containment and thoughtful maneuvering are routinely made pointless as random events cause massive upsets to the board state.\nThe only way strategy can be made relevant to play is by memorizing every potential card and to play around their timing windows and effects.\n\nI can see how this is a beloved classic, and if I were to really jump into it with both feet I would no doubt reach a point where I felt my decisions matter. However, I'm just not enchanted enough to want to work at enjoying it.",
    "timestamp": 1682373600
  },
  {
    "username": "Bangla",
    "rating": 5.0,
    "comment": "Deluxe Edition 2016 printing.",
    "timestamp": 1676674800
  },
  {
    "username": "mcrstar",
    "rating": 5.0,
    "comment": "Показалось, что правила плохо переведены (а может и такие запутанные в оригинале, не сравнивал).\nИнтересная игра, но как будто чего-то не хватает. Надо играть еще чтобы распробовать.\n---\nПосле игры с Димой Клюйковым стала поинтереснее.\n---\nПосле игры в Labyrinth стала казаться менее интересной.",
    "timestamp": 1676329200
  },
  {
    "username": "JohnWThomas",
    "rating": 5.0,
    "comment": "it has potential, just not my style.",
    "timestamp": 1675465200
  },
  {
    "username": "WingedLycan",
    "rating": 5.0,
    "comment": "It’s enjoyable, but it requires a lot of play to understand. I’m sure I’d enjoy it, but I’d rather play through my collection than focus on the necessary time to get adjusted to this one.",
    "timestamp": 1674514800
  },
  {
    "username": "BBergquist",
    "rating": 5.0,
    "comment": "Got rid of it.",
    "timestamp": 1671750000
  },
  {
    "username": "Inconmon",
    "rating": 5.0,
    "comment": "Very unhappy. Massively luck based and you need to know all cards in order to really play it. Good ideas in there though.",
    "timestamp": 1668726000
  },
  {
    "username": "Ryan Keane",
    "rating": 5.0,
    "comment": "I can see why this is so popular, but I was quite a bit underwhelmed after wanting to try it for so long based on its BGG rating. My opinion is after only 1 play, so take it with a large grain of salt, and I would be willing to try it again, but no great interest to do so.\n\nIt is a good mix of Euro and wargame mechanics, but my main issues were:\nGame length - it's seems like playing 7 out of a hand of 8 cards each turn is excessive; trimming this down could have shortened the game significantly with the same epic feel.\n\nLack of historical theme - Clearly the designers worked hard to put as much history into the cards as possible, but IMO there is not very much integration of theme and mechanics. This was evident when most times we would not read the title of the card when playing it. Most wargames are a much closer simulation of what happened, with a mixture of scripted actions and player decisions. After a good wargame, I want to go read about how the battle actually went historically to see how it differs from what happened. Twilight Struggle does not really produce this narrative, since the game is just a string of events and operations, that only very loosely fit the normal timeline through the structure of the 3 section draw deck. I kept wanting to see the alternative event occur a la Chrononauts - it would have been so cool if each event had 2 possibilities - one if played by US, alternative if played by USSR.\n\n2 player area control with # tiles is pretty boring - ultimately the game is area control, with you vying for majority in each country. # tiles are intrinsically less interesting than piles of cubes a la El Grande, and when it's just 2 players, it creates a tug of war where you add 2, I add 3, you take away 2, I take away 1. That's an oversimplification - there's a lot more strategy over where and when you fight or cede control. We hated We the People, and while Twilight Struggle improves the area control play a lot, it wasn't enough to hold my interest.\n\nAt the end of the day, staring at the map for 3 hours just makes me want to play multiple games of Pandemic in the same time. Same board (pretty much) but more thematic feel and tension.",
    "timestamp": 1663106400
  },
  {
    "username": "Unclefeg",
    "rating": 5.0,
    "comment": "This is one of those games that more people describe as fun to play than it is fun to actually play. It is chess-like, in that winning moves (especially in the early going) or functionally prescribed, but with an amazing dollop of sheer, random luck thrown in, just to make sure that you can't rely on anything actually working out for you.",
    "timestamp": 1662156000
  },
  {
    "username": "spencyrrh",
    "rating": 5.0,
    "comment": "[2022-05-28] 1@app: I need to play this more, but for now, I think its narrative feels pre-determined; the zoomed-out scope elides historical detail; and despite the presence of many rules, I often felt like I had relatively clear choices on my turn. That said, the tense cardplay surges with theme. I can see the appeal.",
    "timestamp": 1653688800
  },
  {
    "username": "CascadeHush",
    "rating": 5.0,
    "comment": "6",
    "timestamp": 1652306400
  },
  {
    "username": "Luke23007",
    "rating": 5.0,
    "comment": "heavy 2 player game. i think this would benefit from many plays and familiarity with the cards. problem is, im not in a hurry to revisit it.",
    "timestamp": 1651960800
  },
  {
    "username": "DSmitty",
    "rating": 5.0,
    "comment": "Only played this twice. I get why it's so highly rated, but it's pretty heavy. You would have to play it a few times in order to really grasp it all, otherwise you're relearning it each time you play and not really getting into the nuance and strategy of the game. We just couldn't get it to the table enough to fully appreciate it.",
    "timestamp": 1651442400
  },
  {
    "username": "Albertinum",
    "rating": 5.0,
    "comment": "Not a bad game. But was the cold war really this boring?",
    "timestamp": 1651183200
  },
  {
    "username": "SaphariGames",
    "rating": 5.0,
    "comment": "Mechanically a 10\n-5 rank for trivialization of colonialism and western imperialism bias in theme",
    "timestamp": 1650405600
  },
  {
    "username": "_EGA_",
    "rating": 5.0,
    "comment": "Варгейм; 2000 (3800)",
    "timestamp": 1650060000
  },
  {
    "username": "MarvelrySkimmer",
    "rating": 5.0,
    "comment": "Hard to rate. I really like the game idea and dynamic, but needs much much plays until you can really play it right and tactical way.\n\nMy girlfriend didn't enjoy this, so bye bye",
    "timestamp": 1643842800
  },
  {
    "username": "vorondesan",
    "rating": 5.0,
    "comment": "Deep and pretty versatile tug of war, unfortunately not very fun to play.",
    "timestamp": 1642374000
  },
  {
    "username": "HappyKillmore",
    "rating": 5.0,
    "comment": "This game has it's merits. Not a bad game but so far from #1 it leads me to believe someone has hacked BGG. 2 players, political, very long....all possible negatives. The target market for this game is so narrow there's no way it can be the best game ever made.",
    "timestamp": 1638918000
  },
  {
    "username": "bierkoekjes",
    "rating": 5.0,
    "comment": "I think this is a solid game. The theme is great but something doesn’t do it for me. The tug of war with cards is just a bit boring. It’s I do something you undo it and that the whole game to me. I know that’s not the game but this is what it feels to me.",
    "timestamp": 1638831600
  },
  {
    "username": "scottie771",
    "rating": 5.0,
    "comment": "Nice game with great theme and flavour. Generally I enjoy the game but it is a bit too much luck driven for my tastes so I don't play that often.",
    "timestamp": 1638831600
  },
  {
    "username": "REINHARM",
    "rating": 5.0,
    "comment": "Good game, interesting theme and mechanics. Not worth the time investment for me personally, both in terms of play time, but also just learning how to actually be good at the game. Even with the app I'd say watergate is a vastly more successful game.",
    "timestamp": 1638226800
  },
  {
    "username": "Growal",
    "rating": 5.0,
    "comment": "After first plays: Seems to be quite luck depended regarding dice rolls and card distribution. Takes too long for me, compared to the amount of luck. Perhaps need more plays.",
    "timestamp": 1635631200
  },
  {
    "username": "paprik",
    "rating": 5.0,
    "comment": "TL;DR: It feels like if chess had an option to \"roll the dice, if you get 5-6, remove opponent's bishop\"\n-----\nI guess I just don't get it. Seems like it's universally rated as an incredible game but it just felt so random. Our first two plays lasted 5-7 hours, because there of the rules and the amount of text on cards.\n\nI really enjoyed the mechanic that makes you trigger the enemy effect on cards, but it also makes it so that almost every card is played and you just pick the order.\n\nBut mostly, it felt really RNG heavy, due to great cards / combos not being drawn and the dice rolls that are used in almost every action basically decided the games for us. You're probably not supposed to use them much, but if you get lucky, you can get such huge swings it's incredible. Blocking someone off an entire continent just doesn't feel great for either player.\n\nMight be better against strangers but I don't really want to constantly screw over or get screwed by a friend in a game that takes this long.",
    "timestamp": 1632261600
  },
  {
    "username": "Atriedes01",
    "rating": 5.0,
    "comment": "App",
    "timestamp": 1632002400
  },
  {
    "username": "Slaaneshi",
    "rating": 5.0,
    "comment": "It is a good game that I will never feel like playing again.",
    "timestamp": 1630447200
  },
  {
    "username": "duckworp",
    "rating": 5.0,
    "comment": "There are so many fans of this game that there is little point in me telling the world how disappointed I was. Expectations are built up from a number one position on BGG. But I was surprised to find a fairly basic area-control game with the scoring determined by random card draws. It was OK but I sold my copy immediately as that is all it was to me.\nIt reminded me a little of Pax Porfiriana, but not nearly as entertaining or as interesting.",
    "timestamp": 1622584800
  },
  {
    "username": "alzhu",
    "rating": 5.0,
    "comment": "Overrated.\n\nBased on memorizing 110 unique cards. Not actual skill, just the patience to memorize all the 110 cards divided into 3 decks. If you don't memorize what each does, and in which deck they are, you can't really make strategic decision whatsoever. Bad mechanic.\n\nGood thing, it might teach some people some basic Cold War history, which the cards are based on. That's the cool thing about this game.\n\nI mean yeah, if you have 2 players who are willing to learn all the 110 cards, then I could see this being somewhat interesting. But there's still luck elements, in various places (Space race, combat die rolls, card pulls).\n\nYou could be just as well playing something actually competitive like Overwatch or Chess. And separately, read a history book about Cold War. Done.",
    "timestamp": 1617314400
  },
  {
    "username": "_The_Inquiry_",
    "rating": 5.0,
    "comment": "Prior to 2020: 0 plays\n\nOh, how I've eyed you, Twilight Struggle: a game that is undeniably an excellent and carefully-designed Euro-Wargame hybrid that once stood at the top of the BGG top 100 and whose unique blend of mechanisms could excite gamers from near and far. Unfortunately, while I can recognize the potency of the incredibly compelling historical narratives and emergent stories that are produced by this game, I can't find myself interested enough in the core mechanisms to justify devoting the time and attention that they deserve. It's a game that does so many wonderful things - creating tense and difficult moments of hand management and anxiety that really evoke the tension of the Red Scape era - but whose rough edges make the game highly dependent on memorization and study, which is not something I look forward to in my games. The game certainly manages to highlight the history of the Cold War, and its abstraction of the spreading influence of Western Democracies versus Eastern Communism is implemented in a way that remains approachable and understandable. In fact, I found myself surprised by just how clean and simple the core system is that structures the game - it's a game whose complexity certainly emerges from exploring the design long enough to identify the sharp edges and interaction of the many, specific events that are spread throughout the deck. Unfortunately, outside of the card play and my appreciation for the cleanness of the influence system, I find myself more critical of the design in the places where thematic and historic accuracy were preferenced over more transparent and mechanically clean designs. It does make me wonder what the purpose of such a design should be: to tell a compelling story which is adjacent to the actual history but tied to it by the same core events or to legitimately propose an alternate history based on the potential developments and tensions of the time, removing focus on specific events and instead on the interactions of influence, power, etc. In this way, I find games like Pax Pamir 2e, which focus on and celebrate the historic realities and zeitgeists more than the specific actualized events, to be more compelling implementations of pseudo-historic narratives. This makes me far more critical of the randomness and luck in Twilight Struggle - especially when considering the incredibly-consequential and RNG-heavy coup and realignment systems - and it really does take away from the things about the game that are mechanically interesting (instead favoring thematic, emotional responses). Couple this RNG-heavy gameplay with an intense need to memorize many of the key, game-changing events that could be in the deck over the course of the game's often long playtime, and I'm faced with a design that, while respectable, is just so much less interesting to me than other card-driven games out there. I can see why this game is well-appreciated and can understand where folks find it to be compelling, but I'm personally conflicted - I think it's such an interesting system filled with choices, strategy, and subterfuge, but it's also a system that seems far more fun to think about than to actually play. So for me, it's one I'll pass on for now. But who knows - there's always value in looking back later in life. Until then!",
    "timestamp": 1615330800
  },
  {
    "username": "MrMT",
    "rating": 5.0,
    "comment": "3rd printing. Atmospheric and interesting, up to a point, but ultimately a more efficient way to play this game is for each side to roll a 6 sided die, and whoever gets the highest score wins. Because, in practice, that is what it will often come down to.",
    "timestamp": 1615244400
  },
  {
    "username": "sajrainwater",
    "rating": 5.0,
    "comment": "Computer",
    "timestamp": 1614294000
  },
  {
    "username": "Blue_Sauerkraut",
    "rating": 5.0,
    "comment": "Far too luck based and fiddly for a game of this nature, especially with the game time. Watergate is a much better implementation of the same system.",
    "timestamp": 1614294000
  },
  {
    "username": "Ca1m_down",
    "rating": 5.0,
    "comment": "Meh. Definitely a game for people that are really into Cold War history stuff. Knowing the cards and developing a meta seems like a big part of this game. Didn't feel great for just a couple plays and the theme and history doesn't draw me in enough to play more.",
    "timestamp": 1613516400
  },
  {
    "username": "Qwibbian",
    "rating": 5.0,
    "comment": "Eric",
    "timestamp": 1613170800
  },
  {
    "username": "exceedinglywell",
    "rating": 5.0,
    "comment": "experineced players that know the deck have advantage",
    "timestamp": 1609714800
  },
  {
    "username": "maybeas13",
    "rating": 5.0,
    "comment": "I honestly, will never play this again. However I didn't want to give it a low score because I don't think it's really the games fault. I really just couldn't get into the theme. The genre may just not be for me.",
    "timestamp": 1607554800
  },
  {
    "username": "rakeful",
    "rating": 5.0,
    "comment": "2-player game, only for hardcore gamers who are history buffs. Lots of cards and rules and takes 3 hours to play.",
    "timestamp": 1604790000
  },
  {
    "username": "M St",
    "rating": 5.0,
    "comment": "Arguably more an alt-hist game of a weird world under strict colonial control by the US and USSR than a game of the historical Cold War. The notion that other countries have their own interests which they will try to defend has no place here. But, as a game not bad, could play again.",
    "timestamp": 1602280800
  },
  {
    "username": "kmd2000",
    "rating": 5.0,
    "comment": "Amazing, seamless blend of mechanics and theme.\nMust-have for cold war / geopolitics enthusiasts.\n\nThe fact that to play strategically you need to memorise a lot of the important cards and a relatively long playtime is making this really hard to get to the table.\n\n[SOLD]",
    "timestamp": 1599861600
  },
  {
    "username": "Vexatious",
    "rating": 5.0,
    "comment": "Only played once and did not really enjoy the game. Need to play again. Am I missing something or is it not for me?",
    "timestamp": 1596060000
  },
  {
    "username": "Thestas",
    "rating": 5.0,
    "comment": "Own the Android app, not the actual game. I only played completely once but I didn't really have fun getting crushed by the AI. Maybe more plays will improve my opinion",
    "timestamp": 1595282400
  },
  {
    "username": "dogterom",
    "rating": 5.0,
    "comment": "i find i to much and overwelming you have to know every card to be able to play this well",
    "timestamp": 1592344800
  },
  {
    "username": "shotokanguy",
    "rating": 5.0,
    "comment": "Overrated, generally unsatisfactory game that involves alternatively placing counters and taking them off, whilst suffering through a hand of cards that seems to always be filled with your opponent’s events. The back and forth jockeying for control of regions must interest some gamers but I find it tedious.",
    "timestamp": 1592172000
  },
  {
    "username": "lee___",
    "rating": 5.0,
    "comment": "Very thematic, but Twilight Struggle is too drawn out and at times too random for me.",
    "timestamp": 1590530400
  },
  {
    "username": "stroutqb22",
    "rating": 5.0,
    "comment": "This game is growing on me and I think I'd really like it if I could just find a solid partner.",
    "timestamp": 1590444000
  },
  {
    "username": "BurnBabyBurn",
    "rating": 5.0,
    "comment": "The game is good I'm just not that excited about the theme.\nI only bought it and played it because it is number one on BGG.",
    "timestamp": 1588456800
  },
  {
    "username": "a2b2c517",
    "rating": 5.0,
    "comment": "Played digital version, find it extremely boring, so boring I can't finish the game. Might try it again with physical copy",
    "timestamp": 1588370400
  },
  {
    "username": "Arlique",
    "rating": 5.0,
    "comment": "Not my cup of tea i suppose. Rules are good, but management of hundreds of tokens is not - could have identifiable plastic pieces for all the status counters (and there are many) at the very least.",
    "timestamp": 1585004400
  },
  {
    "username": "Pierce",
    "rating": 5.0,
    "comment": "Nicely designed game for two players; however it only really works if both players have the same amount of knowledge about what the cards are.",
    "timestamp": 1583190000
  },
  {
    "username": "Dobbin2",
    "rating": 5.0,
    "comment": "Didn't do much for me at first pass.",
    "timestamp": 1582153200
  },
  {
    "username": "Rob Beekman",
    "rating": 5.0,
    "comment": "Owned by Henry",
    "timestamp": 1580943600
  },
  {
    "username": "hazegiant",
    "rating": 5.0,
    "comment": "Good game but too long.",
    "timestamp": 1579388400
  },
  {
    "username": "lajlev",
    "rating": 5.0,
    "comment": "Too long and didn't like the huge amount of options on til map ? dices And cars drafting had a major impact on our game. Did enjoy the theme and feeling of playing the game. Turn/ round flow was really good, just too many ?",
    "timestamp": 1578956400
  },
  {
    "username": "wamsp",
    "rating": 5.0,
    "comment": "A kind gift from user \"Redd85\"",
    "timestamp": 1578524400
  },
  {
    "username": "giltleaf",
    "rating": 5.0,
    "comment": "Awesome theme that's well integrated and clean rules that allow you space to really \"play\".\n\nHowever this is a slog and I can't recommend buying it unless you have an equally excited partner as the person with more experience is at a very high advantage.\n\nPrefer the shorter and similar making of the president",
    "timestamp": 1578438000
  },
  {
    "username": "jshufelt",
    "rating": 5.0,
    "comment": "Fantastic game. However, it is a too big of a game for me to always want to play it. I would have to plan ahead for a time to really get up for it.\n\nWhile the rules themselves aren't really complex, it's just a lot to pay attention to. A well balanced game between two opponents will run for hours. It leaves my friends and I exhausted when it's done.",
    "timestamp": 1578265200
  },
  {
    "username": "roadrun55",
    "rating": 5.0,
    "comment": "120-180",
    "timestamp": 1577660400
  },
  {
    "username": "quietcorn",
    "rating": 6.0,
    "comment": "The mechanisms in this game are beautiful and elegant, the history is interesting and plays back into the theme and mechanics, and it's not super heavy. This game is about two world powers fighting for influence across the planet. On a player's turn they play cards for either the cost of the card in action points which allow them to play tokens and take actions or they can play the card for it's effect. At the start of the game, the communists have the advantage, but the longer the game goes, the more the capitalists take hold and grow in power. Fascinating game.",
    "timestamp": 1762297200
  },
  {
    "username": "ptf666",
    "rating": 6.0,
    "comment": "Nice game, a little bit too long to often hit the table(hope this will change with experience). A little bit to random (coups and realignments are kinda too strong for my liking). Theme is strong and second to none.\n\nedit - have it from dec'11 and still only 2 plays...\nedit - dec 2016 - sold, brilliant game but nobody to play with. In case something changes my buddy has it, so no problem. Maybe I will buy steam digital edition.\n\nedit - bought both Steam and Android app on sale",
    "timestamp": 1761778800
  },
  {
    "username": "MegaWestWolf",
    "rating": 6.0,
    "comment": "Definitely better than my rating, but I really need to figure this one out to make it more than a 6. I feel like most of my plays were the other player dragging me through the game.",
    "timestamp": 1761170400
  },
  {
    "username": "Zerosum",
    "rating": 6.0,
    "comment": "For an overlong Euro that requires deck memorization to be competitive, Twilight Struggle is...not bad. Learn it with a friend and play it a lot. Twilight Struggle reveals itself as a tense, psychological game that's evocative of the Cold War.",
    "timestamp": 1760306400
  },
  {
    "username": "edubvidal",
    "rating": 6.0,
    "comment": "Un juego para dos jugadores de control de áreas conducido con cartas. Las cartas se reparten al azar y pueden ser tuyas o del rival. Se puede jugar como evento, para realizar golpes de estado lanzando un dado o para aumentar tu presencia en las diferentes regiones. Habrá puntuaciones a lo largo de la partida que harán que te fijes más en una región que en otra. Hay victorias instantáneas si se cumplen ciertas condiciones.\nUn juego muy completo, muy temático que necesita de partidas para dominarlo y disfrutar de todo lo que ofrece.\nSi te gusta el período de la guerra fría, es tu juego.",
    "timestamp": 1759960800
  },
  {
    "username": "harrycalder",
    "rating": 6.4,
    "comment": "Acquired in Total Con 2018 math trade.",
    "timestamp": 1757800800
  },
  {
    "username": "Astronica",
    "rating": 6.0,
    "comment": "Really good game, the historical theming is very strong and the battles for control over the different theaters is really interesting. Negatives are that the die can be quite swingy sometimes and also you need to play it a few times to grasp the game and be able to properly play it. But a really solid game overall.",
    "timestamp": 1757023200
  },
  {
    "username": "OisinHughes123",
    "rating": 6.0,
    "comment": "Need to play lots to get used to",
    "timestamp": 1755036000
  },
  {
    "username": "ruttakorn",
    "rating": 6.0,
    "comment": "great concept but unbalanced gameplay",
    "timestamp": 1754431200
  },
  {
    "username": "latschediwes",
    "rating": 6.0,
    "comment": "Twilight Struggle was an interesting experience - not bad, but not something that completely amazed me. The game unfolds slowly, with a steady progression of events that create a certain dramatic arc. However, what surprised me the most was how much it feels like a competitive, strategic puzzle rather than a historical simulation.\n\nAt its core, the game revolves around hand management and optimization. Each turn, players analyze their hand, trying to use their events and action points as efficiently as possible. Success depends less on reacting to a simulated historical narrative and more on mastering the card interactions and planning optimal moves. A player familiar with the deck has a significant advantage over a newcomer, as understanding key events and anticipating card cycles is crucial. Advanced players will even count cards, anticipate reshuffles, and engage in bluffing tactics.\n\nThe game’s theme is well-integrated, and the mechanisms make sense within the Cold War setting. Unlike many modern Eurogames, it is highly interactive - every move directly impacts the opponent. This creates an intense psychological battle filled with tension, where small advantages can be decisive. Every turn matters, every action is meaningful, and the game remains tight.\n\nDespite its depth, the rules are not overly complex; the basics can be learned in about 20 minutes. Given that a single session can easily last three hours, this poses a practical challenge. The game demands a dedicated and evenly matched opponent, making it less accessible for casual play.\n\nUltimately, while Twilight Struggle is an engaging and well-designed game, I find myself wondering whether I would prefer something either shorter and more accessible or, conversely, something more narrative-driven and immersive, like Here I Stand. The game’s strong competitive focus and length make it difficult to fit into everyday gaming situations, which might limit its appeal for me in the long run.",
    "timestamp": 1752530400
  },
  {
    "username": "Qwirk",
    "rating": 6.0,
    "comment": "Long-term loan from a friend.",
    "timestamp": 1751925600
  },
  {
    "username": "MichaelaPat",
    "rating": 6.0,
    "comment": "2025",
    "timestamp": 1751407200
  },
  {
    "username": "rgtft",
    "rating": 6.0,
    "comment": "I received upgraded plastic pieces as a gift last Christmas. Makes the game look very nice.",
    "timestamp": 1750024800
  },
  {
    "username": "yaofengze",
    "rating": 6.0,
    "comment": "419.46买入 390卖出",
    "timestamp": 1749247200
  },
  {
    "username": "btasam",
    "rating": 6.0,
    "comment": "The global scale of this game mixed with the event progression emulates an incredibly satisfying experience regardless of which side you are playing. Not something I want to play all of the time; the app was great.",
    "timestamp": 1747087200
  },
  {
    "username": "BoomDooger",
    "rating": 5.8,
    "comment": "Chels: 5\nAnt: 6.5\n\nOf course - this is a very good game, well designed with a great thematic implementation. The core decision loop of balancing your actions with the opponent's events is quite tense and engaging. However, there's so many things that rub us the wrong way - long playing time that outweighs the impact of actions you're taking; the balance feels off, favoring the soviets even between two novices (which seems to have been reiterated by all levels of player, outside of the most strategically involved); and the actions can feel repetitive when you take time to replace the influence your opponent just removed. As far as 2-player games go, glad we played this several times, but likely one we will not return to.",
    "timestamp": 1747000800
  },
  {
    "username": "quori82",
    "rating": 6.0,
    "comment": "이겨도 별로 재미가 없다. 취향이 아님..",
    "timestamp": 1745100000
  },
  {
    "username": "TForever",
    "rating": 6.0,
    "comment": "Thematic. It's only 2 players though, and like 3 hours long, and 2 players never happen. It's just good for what it is.",
    "timestamp": 1744408800
  },
  {
    "username": "Bowsprit",
    "rating": 5.5,
    "comment": "8, 3",
    "timestamp": 1744408800
  },
  {
    "username": "jw42",
    "rating": 6.0,
    "comment": "Gleichgewicht des Schreckens",
    "timestamp": 1742166000
  },
  {
    "username": "biosludge",
    "rating": 6.0,
    "comment": "I am always outclassed when I play this game. I love playing it because it is an interesting puzzle to try to figure out with the multiple paths to victory and the variable card usage. This is a perfect game. I may not always be willing to play it, but it is great fun.",
    "timestamp": 1740610800
  },
  {
    "username": "Slimeyselim",
    "rating": 6.0,
    "comment": "English deluxe edition, second printing 2011\n\nLanguages: English\n\nGood Condition.\n\nUK Postage only",
    "timestamp": 1740351600
  },
  {
    "username": "Xstream",
    "rating": 6.0,
    "comment": "I own the app. Sold my analog copy.\n\nPlayed 5 times now. It's a good game, but i'm somewhat surprised of the amount of luck vs the high score this game gets on BGG. It's such a clever and well designed game, but luck of the draw or the dice can completely destroy any good plan you may have planned. It's more tactical than strategic.\nIt's ok, I really do respect It, but I just don't like playing It that much after a couple of plays. The investment vs reward ratio isn't right. This game was no. 1 on BGG for 10 years or so ... I mean ... you expect something really good! Many other good games always get trashed for luck of the draw, but with this one It's apparently allowed. Even worse: you roll dice. I do love the epic experience the game offers though. A lot of tension and storytelling, which is often the same, just the order can be different.\nI think If they re-release this without the dice rolling but a different mechanic that offers a bit more control or timing, would make It the epic strategic play It deserves to be.\n\nThis is not an unlikely scenario (happened to me):\nCoup, good chances, roll dice, failure.\nRealignment roll, roll the dice, failure.\n2x Space race, roll the dice, failure.\nOther player, 2x space race, roll dice, both success\nPlay some unwanted events and score some unwanted areas exactly in the wrong time where your opponent scored big time on something you couldn't anticipate and you score nothing.\netc ... You get the point ...\nThat can be TS in a nutshell. Agonizing and painful at times, sometimes in a good way, but most of the time in a way that makes me not really want to play it anymore.\nSure, It does make It super thematic because In real life It's not exact science either and luck plays a big role as well - even the \"intel\" on when areas score Is also thematically sound. I just don't like wasting 3 or 4 hours of my life on It. It really needs a bit more of control where the players dicide on the setbacks to the other player, not a dice roll or bad hand draw. Add to that the amount of upkeep! Intense? Yes. Fun? Not really.\n\nI can understand why people love It though ... but this much? Hm ... But the design and concept is awesome. I've now got Watergate which looks like (finally) a good iteration on the system that may work better, or at least don't take so much time and effort.",
    "timestamp": 1738364400
  },
  {
    "username": "Neilyoung",
    "rating": 6.0,
    "comment": "Digital version",
    "timestamp": 1738105200
  },
  {
    "username": "lainesko",
    "rating": 6.0,
    "comment": "An epic 1v1 battle! As long as both players are on a similar level in experience... If the other player has notably more knowledge then the game is very quickly over. Can be difficult to find a similarly skilled opponent.",
    "timestamp": 1734649200
  },
  {
    "username": "Bust Nak",
    "rating": 6.0,
    "comment": "Digital version",
    "timestamp": 1733266800
  },
  {
    "username": "velo333",
    "rating": 6.0,
    "comment": "It's one of my first own games. I played a tabletop as well as a digital version. I think i should give a second chance to this game. I really like the theme and mechanics, but i haven't enjoyed the game. It waits for a proper time.",
    "timestamp": 1730674800
  },
  {
    "username": "agustinn",
    "rating": 6.0,
    "comment": "3.56",
    "timestamp": 1729202400
  },
  {
    "username": "Zowin11",
    "rating": 6.0,
    "comment": "Sold to Noble Knight",
    "timestamp": 1728856800
  },
  {
    "username": "echelon",
    "rating": 6.0,
    "comment": "Rating based on one unfinshed play.",
    "timestamp": 1726956000
  },
  {
    "username": "Nanaimo Bar",
    "rating": 6.0,
    "comment": "Digital Steam Version",
    "timestamp": 1724450400
  },
  {
    "username": "duck1812",
    "rating": 6.0,
    "comment": "Two player heavy strategy. The wife factor keeps me from getting this one.",
    "timestamp": 1724018400
  },
  {
    "username": "chrisgledhill",
    "rating": 6.0,
    "comment": "A heavy theme supported by a light system.\n\nCivilizacio-ludo Absolute re-ludebla.",
    "timestamp": 1723068000
  },
  {
    "username": "nimzo28",
    "rating": 5.9,
    "comment": "2014: Partie non complétée faute de temps, après environ 3h30 de jeu. Intéressant. J'aimerais y rejouer.\n\n2024-07: 10 ans plus tard, et 7 ans après l'avoir acquis, je n'y ai toujours pas rejoué. Je dois donc y attribuer une note inférieure à 6.",
    "timestamp": 1721080800
  },
  {
    "username": "Philgamer",
    "rating": 6.0,
    "comment": "Okay.",
    "timestamp": 1720994400
  },
  {
    "username": "Bal_505",
    "rating": 6.0,
    "comment": "It's been a loooong time. But I remember it being interesting.\n\nEdit: Played again and it's good. It's very tense throughout, but feels a bit too long",
    "timestamp": 1719698400
  },
  {
    "username": "morrsleib",
    "rating": 6.0,
    "comment": "I like more the dynamic Setup of Imperial Struggle and its three scoring areas. The system with cards there is more complex and rewarding. The artwork of IS is much better.",
    "timestamp": 1717452000
  },
  {
    "username": "kyhre",
    "rating": 6.0,
    "comment": "Wonderfully intense. I love the second guessing, the bluffing, the feeling of being trapped.\n\nI don’t think I’ve played any game that evokes history in quite the same way. I think it does justice to the horror that was the cold war but still manages to be quite funny in a dark sort of way.\n\nI’ve tried a few of the games that try to boil this experience down to a shorter playtime but none of them have been quite successful. Wir Sind das Volk is cool but very procedural and doesn’t get as intense, at. least not for me. I’m very keen to try the Iron Curtain, though.\n\nThat being said, the game is a bit too fiddly and the rules, while simple enough, are a bit much for me to want to teach this to anyone ever again. I think the first few plays are wonderful but it seems that the way to get better at the game is to study and know the fairly big deck of cards. And I’m not really interested in that.\n\nI have my problems with Imperial Struggle from the same designers, but I’m keener to keep playing rather than this.\n\nI have between 10-15 plays of Twilight Struggle, mostly against the same opponent; then I have played this a few dozen times agains the app. I don’t have any great desire to play this game again. I heartily recommend anyone interested try it live though. It has given me some wonderful experiences.\n\nI would sell it for 9000 ISK.",
    "timestamp": 1716933600
  },
  {
    "username": "mkchu243",
    "rating": 6.0,
    "comment": "Too long for the amount of fun, and too random for the length of time\n\nGame can feel really random due to dice rolls which can feel really bad when it fails, but maybe we played too aggressively \"fighting\" over the same locations even though I had +3 for rolls. Same thing for space race. Cards are random as well and feels really bad when you draw a hand of all opponent events.\nFeels like random tacked on rules, you \"have to\" coup once per turn otherwise lose points for defcon.",
    "timestamp": 1716242400
  },
  {
    "username": "yiechow",
    "rating": 6.0,
    "comment": "I assume the high rating mark comes from hours of hours spent by this only two players game. Playing this game is just like being a part of that history, in addition to make your own history. I rather call this historical game. Only played half of entire game with Sheldon. Cuz it's too long to finish.",
    "timestamp": 1715205600
  },
  {
    "username": "che2487",
    "rating": 6.3,
    "comment": "From what I've played, I really like the inevitability of looking down at your hand of cards and knowing you have to play every one of them, no matter if they help you or not. Properly managing your hand really makes this game, and proper timing can lead to sudden victory. Lovely designed game.",
    "timestamp": 1712181600
  },
  {
    "username": "jokris",
    "rating": 6.0,
    "comment": "Too long, rather play 13 days",
    "timestamp": 1711062000
  },
  {
    "username": "fabericus",
    "rating": 6.0,
    "comment": "Fab'\nBefore december 2008\n1 play",
    "timestamp": 1709593200
  },
  {
    "username": "pingus",
    "rating": 6.0,
    "comment": "I apprieciate the design, but long two player games are not for me.",
    "timestamp": 1709334000
  },
  {
    "username": "FlyingPencil",
    "rating": 6.0,
    "comment": "I would play if I was in the mood and had a fast minded person to go against. I only played 7 hours of the game and barely made it to though the second round each time. This is a die hard gamer game, not a casual game.",
    "timestamp": 1705964400
  },
  {
    "username": "glMBk",
    "rating": 6.0,
    "comment": "Im not sure why, but somehow I did not enjoy it as much as expected.",
    "timestamp": 1703890800
  },
  {
    "username": "drasher25",
    "rating": 6.0,
    "comment": "Neat design, but I don't love the need to know all the cards to play well.",
    "timestamp": 1700175600
  },
  {
    "username": "iNano78",
    "rating": 6.0,
    "comment": "Great game. Amazing use of historical events. It's long, somewhat heavy, and you really need to be in the mood. It's certainly not something I'd play every weekend. But it's in my collection because I really do enjoy it once in a while.\n\nPurchased 2011 \"deluxe\" edition from Fandom II from the owner (credited in this edition for correcting some cards), December 2011. Was open (he photocopied the rules to check for changes), but complete and unpunched.",
    "timestamp": 1697580000
  },
  {
    "username": "Ellogeyen",
    "rating": 6.0,
    "comment": "2-4 plays (2014)",
    "timestamp": 1696802400
  },
  {
    "username": "XenonRadon",
    "rating": 6.0,
    "comment": "Generally good. Doesn't take a long time.\nHowever, if players are both experienced, luck becomes too important.\n\n-Commented after playing 100+ games.",
    "timestamp": 1696716000
  },
  {
    "username": "adi_venturer",
    "rating": 6.0,
    "comment": "I can see why people like this game. It's another one of those games that require you to invest multiple plays to really enjoy it. I like games like that. I don't think I'll be investing time in this game though because I'm not a fan of the theme. I prefer fantasy war games/area control games as opposed to those based on real life politics.\n\n(Plays: 1)",
    "timestamp": 1695852000
  },
  {
    "username": "b4ry",
    "rating": 6.0,
    "comment": "Unfortunately, calling this game a WARGAME is a disgrace to REAL wargames. The game is way too random and you can be completely locked up if you have a hand full of scoring cards while your opponent have only event cards.",
    "timestamp": 1695506400
  },
  {
    "username": "MrUnicorn",
    "rating": 6.0,
    "comment": "2",
    "timestamp": 1691186400
  },
  {
    "username": "KillerForce",
    "rating": 6.0,
    "comment": "Game is too lucky, USSR can get so easily countered.",
    "timestamp": 1689631200
  },
  {
    "username": "pertwee",
    "rating": 6.0,
    "comment": "This is a game that I could really get into, but my wife + gaming partner loathes this game, meaning it will absolutely never, ever hit my table. I will never have the chance to develop any relationship to this one.",
    "timestamp": 1689026400
  },
  {
    "username": "John Rogers",
    "rating": 6.0,
    "comment": "Highly regarded and ranked, TS is a very thematic retelling of the Cold War. Its use of cards, defcon/military operations, coups, and realignments result in a tense and engaging 3 hour experience. My primary reservation is the semi-scripted feeling that comes from the deck separation; however, it becomes less so once you hit mid-late war.",
    "timestamp": 1685916000
  },
  {
    "username": "Mystic_Mouse",
    "rating": 6.0,
    "comment": "Epic but 2P only, long setup and tear down, lots of rules, so really hard to get to the table. Those few games you get in are amazing though. Hard to rate a game so dependent on play count and investment.\n\nDingo",
    "timestamp": 1684101600
  },
  {
    "username": "TalesWithinWheels",
    "rating": 6.0,
    "comment": "I just don't get the appeal of CDGs and this one is no exception.",
    "timestamp": 1683583200
  },
  {
    "username": "Nathardicus",
    "rating": 6.0,
    "comment": "Tough game to teach to a new player. With two experienced players though this has to be one of the best two player games out there. Love the historical aspect behind all the cards in the game",
    "timestamp": 1681855200
  },
  {
    "username": "kolosm",
    "rating": 6.0,
    "comment": "Nudzi fest",
    "timestamp": 1680904800
  },
  {
    "username": "sidelooper",
    "rating": 6.0,
    "comment": "Can see is a good game but not my type of thing",
    "timestamp": 1679180400
  },
  {
    "username": "Sox36",
    "rating": 6.0,
    "comment": "Sell",
    "timestamp": 1678834800
  },
  {
    "username": "ooogene",
    "rating": 6.0,
    "comment": "Only thing holding me back is the 4 hour play time on this one. I'm really liking it though. The tension is there full force, perhaps even more so than 1960, because the events HAVE to happen. However, there does feel to be more luck in this game, specifically because the events do have to happen.",
    "timestamp": 1678057200
  },
  {
    "username": "theaaron",
    "rating": 6.0,
    "comment": "I really like the game, but I can see that it will take several plays to learn all of the cards and what sort of strategy to use. Considering the length of the game, that's quite a time commitment. Hoping to get more plays eventually.\n\nUpdate: After owning this for years, I finally got to play a game (well, a partial game) where is all clicked. The game is tense right from the beginning as you're fighting wars on multiple fronts. Some of the cards felt really swingy, but given this game's prominence, I imagine you have to learn to play around those cards.\n\nStill, I can see how this would be enjoyable and I still want to play a full game of it one of these days.",
    "timestamp": 1677366000
  },
  {
    "username": "Hantis",
    "rating": 6.0,
    "comment": "(TTS) Surprisingly good game. I avoided it for so long because of the theme and the look but it plays really well. I love the area control part but I'm not sure about the luck factor of the card-draw just yet.",
    "timestamp": 1677193200
  },
  {
    "username": "Zondag",
    "rating": 6.0,
    "comment": "Not my kind of 2 player game.",
    "timestamp": 1677106800
  },
  {
    "username": "FrogandGames",
    "rating": 6.0,
    "comment": "Just not getting this one. I know it is highly rated, but the I play a card the benefits my opponent is odd for me. I need more plays to really figure it out and give a better rating",
    "timestamp": 1676934000
  },
  {
    "username": "artistterry",
    "rating": 6.0,
    "comment": "bedroom",
    "timestamp": 1674514800
  },
  {
    "username": "zaubererer",
    "rating": 6.0,
    "comment": "There are elements of Twilight Struggle that I like, such as the high interaction between the two players, which cards you will play, and when, are factors that affect a lot your opponent, and also I like that you have to anticipate the next moves of your opponent, which is a negative also because you have to know very well all the event cards to play well, which means that you have to dedicate lots of time to enjoy the game. In the end, Twilight Struggle suffers from the same issues as most wargames, it is very random (you are literally rolling a die in half your plays), its rules are quite complicated, and it takes too long to complete, but the theme is very interesting and there are nice gameplay innovations compared to other games of the genre. If I had to recommend a wargame to someone this would be one of the best choices.",
    "timestamp": 1674514800
  },
  {
    "username": "ajewo",
    "rating": 6.0,
    "comment": "Quite long, complex two player only \"war\" game. I do not like the card driven nature of this game and the game board is quite big.\n\n+ Thematic\n# You need to know the cards (effects) well to play the game well.\n\nSimilar games:\n* The Expanse (multiplayer version of Twilight Struggle based on the TV show).",
    "timestamp": 1674514800
  },
  {
    "username": "adrianfrancies",
    "rating": 6.0,
    "comment": "2 players",
    "timestamp": 1674428400
  },
  {
    "username": "Pepchris",
    "rating": 6.0,
    "comment": "At a higher level of play, the game feels very, very scripted about what the players are going to do with their cards.",
    "timestamp": 1668639600
  },
  {
    "username": "beezany",
    "rating": 6.0,
    "comment": "digital only",
    "timestamp": 1665180000
  },
  {
    "username": "Ryucoo",
    "rating": 6.0,
    "comment": "Absolutely no argument - this is an incredible bit of design. For some, this game will slip into the brain without touching the sides, while for others - most notably me - this will feel a rather convoluted, muddy and painful experience. For one, the hand sizes are too large with cards flooded with text and somewhat complex game interactions each twisting the board state based on unique caveats and exceptions, that only many, many games will bring clarity to. For two, even ignoring the events, each other action - placing influence, coups and realignment comes with quite a heavy number of restrictions to remember even before you figure out why you would pick one over the other. For three, for such a strategically deep game an awful lot hinges on the luck of the dice and I'm afraid I simply can't get past the fact that a plan you have agonizingly put together can be completely wrecked by a bad roll. For four, the area control scoring is inelegant and unintuitive - I simply don't enjoy how it works at all, especially when you appear to be smashing it in an area and it turns out you both end up with 3 points each. Finally, for four, I really didn't find the stress of what to do with a card that is basically boils down to YOU LOSE remotely fun.\n\nI get it; this is very much a game about analyzing your hand for the worst cards and figuring out how and when to play them for minimal pain. But personally, I don't find that enjoyable or interesting. Games should be about agonizing over which exciting option would be best, not which is the least worst.\n\nNothing about TS in isolation is particularly complicated, but there is so much of it. Even discarding cards is turned into a mechanism called The Space Race with its own set of rules and die rolls. The coup process isn't rocket science but it hinges upon whether coup attempts made this round have pushed the nuke track into a level that denies your ability to do it - and you need to coup because you are given a target number of military operations to complete yet this changes if anybody completes them as the Defcon changes and... sheesh.\n\nThe most common phrase you will hear during a game of TS is: \"actually, you can't do that.\" This really is a game for people who are going to get absolutely stuck into it and drink in everything it has to offer. If you were hoping to dig it out casually here and there as part of a heavy rotation of other games, forget it. I so wanted to love it, and in another life maybe I would have. But I sadly don't have the gaming hours to dedicate to this alone so would always be fumbling around in the dark with it. I can see it's appeal, but it's not for me. It's too much to be fun.",
    "timestamp": 1664748000
  },
  {
    "username": "MediumHeavy",
    "rating": 6.0,
    "comment": "Wow! What an intense game. Excellent for any history buff.\nPerfect for snowy days where you don't want to leave the house and have 3-5 hours to spend getting heavy heavy. My mind always feels cloudy when I play this game, it really goes to the limits for me.",
    "timestamp": 1664229600
  },
  {
    "username": "ZipDizzle",
    "rating": 5.5,
    "comment": "I should like this game. And if I played it a lot and studied it I probably would. I just don't want to. I would like to play again but at the right time.",
    "timestamp": 1660946400
  },
  {
    "username": "robinmaypanpan",
    "rating": 6.0,
    "comment": "A fun game, but it often leaves me wanting something more/different.",
    "timestamp": 1660600800
  },
  {
    "username": "elbrycko",
    "rating": 6.0,
    "comment": "4/21/19 played this again after a while away and the dice rolling bothered me a lot more than it had in the past. A single d6 is a lot of variance for how few rolls there really are in the game. More dice rolls = more average, so having this heavy strategic game where you infrequently have to roll ONE d6 to severely swing things one way or the other doesn't sit well with me at all.\n\n8/12/22: Almost tempted to turn this down to a 3/5 in retrospect but I haven't played in a while and that may be a little harsh. Actually, the extent to which I DON'T feel like playing this game again to find out probably means the 3/5 is warranted.",
    "timestamp": 1660255200
  },
  {
    "username": "dmiloc420",
    "rating": 6.0,
    "comment": "Based on this games rating, and reviews, I purchased it. After playing it several times, this game is just okay. It's not a bad game, but it's certainly not great either. Based on some of the information, I was also under the understanding that this game could be played solo, and it can be, but I wouldn't recommend it. As far as world war games go (WWI, WWII, Cold War, ect.), I would much rather play Axis and Allies, if I have the time available, or Blitzkrieg, if I want to play something quick.",
    "timestamp": 1659045600
  },
  {
    "username": "Sonicwarhol",
    "rating": 6.0,
    "comment": "Update 7/2022: Dropping from an 8 to an 6 because playing it now doesn't have strong appeal, but I would play it to see what I think of it all these years later.\n\nLove the card play of this game. Love the way it relates to the Cold War. I have many other games I would rather play than this but it will be kept in case I need that itch scratched. Better than 1960.",
    "timestamp": 1658872800
  },
  {
    "username": "GlitterKittenCorpse",
    "rating": 6.0,
    "comment": "Perfectly recreates the insanely delicate balance and constant tension and feelings of powerless of the situation its trying to simulate... which is exactly why I'm giving it a 6: I'm just not often in the mood to feel like I'm literally mid-Cold War. If you want an intense, heavy game that requires an insane amount of strategy, though, you'll love this.",
    "timestamp": 1658268000
  },
  {
    "username": "CarbonQueenBellevue",
    "rating": 6.0,
    "comment": "Rock: 4.5\nJerry: 6.5\nAlton: 7",
    "timestamp": 1658181600
  },
  {
    "username": "FrankRyan",
    "rating": 6.0,
    "comment": "3 hour chess match.",
    "timestamp": 1657144800
  },
  {
    "username": "countcrow",
    "rating": 6.0,
    "comment": "Maybe I was missold the game but I was advised it was relatively straightforward to play and I suppose it is. Definitely could do with more plays to give it a proper rating but I'm in no rush to put myself through the mental battle again too soon.",
    "timestamp": 1655935200
  },
  {
    "username": "tafm1803",
    "rating": 6.0,
    "comment": "Competently executed and interesting cards but too long and poorly balanced.",
    "timestamp": 1655589600
  },
  {
    "username": "MagicKevin",
    "rating": 6.0,
    "comment": "Thrilling game. I don't know when I'll play again but I don't think this will ever leave my collection.",
    "timestamp": 1655503200
  },
  {
    "username": "MonsterJerky",
    "rating": 6.0,
    "comment": "Long game.",
    "timestamp": 1654984800
  },
  {
    "username": "CarlosSpicyweener",
    "rating": 6.0,
    "comment": "Steam game",
    "timestamp": 1654812000
  },
  {
    "username": "Nactra",
    "rating": 6.0,
    "comment": "Self-cofessed hate rating that is rather unobjective. I guess we all have games we can't stand. Do give it a try without fear if it appeals to you",
    "timestamp": 1654552800
  },
  {
    "username": "AKHawkster",
    "rating": 6.0,
    "comment": "After having played this over 60 times, I still appreciate the quality of this game and recommend it, but I find myself less and less enthusiastic about playing it.",
    "timestamp": 1654293600
  },
  {
    "username": "andy61",
    "rating": 6.0,
    "comment": "Deeply absorbing simulation of the Cold War. Long but not particularly complicated to play, but so many choices to be made, and is thematically tense. Needs investment in multiple plays to really appreciate it.",
    "timestamp": 1653602400
  },
  {
    "username": "General Amadeus",
    "rating": 6.0,
    "comment": "Taavi",
    "timestamp": 1651701600
  },
  {
    "username": "Secondary Arachne",
    "rating": 6.0,
    "comment": "This game is very well designed, but hasn't really clicked with us. Good theme, demands a high degree of mastery to truly work, and we haven't felt the motivation to learn the game to that extent.",
    "timestamp": 1650492000
  },
  {
    "username": "wittyar",
    "rating": 6.0,
    "comment": "Es juego es muy solido, pero 3 horas de partida de 2 jugadores, no es lo mío.\nPrefiero la experiencia online y asincrona... que a su vez te hace perder mucho de la propia experiencia.",
    "timestamp": 1650319200
  },
  {
    "username": "EddieMorgan",
    "rating": 6.0,
    "comment": "Having only played this game once I could tell it was not for me. Not because I didn't like the game, I can see how the game works and am sure that once you really get to know it after a few plays there must be a serious amount of strategy to it. It is simply not for me because to truly get the most out of this game you need to have someone else who knows the game equally as good as yourself.\n\nThis is a game you could never have fun playing with someone who is new to it, and for that reason it is a pass.",
    "timestamp": 1649628000
  },
  {
    "username": "KprWichura",
    "rating": 6.0,
    "comment": "Playing against exprienced oponnent is a nightmare...",
    "timestamp": 1649282400
  },
  {
    "username": "Garnett11",
    "rating": 7.0,
    "comment": "Wargamer's Santa 2013\n\nInteresting historical period, elegant and tight game for sure.\nOn the other hand, a continuous struggle for influence over the various countries. I'd usually prefer a true wargame instead.",
    "timestamp": 1762038000
  },
  {
    "username": "Drausqo",
    "rating": 7.0,
    "comment": "Game",
    "timestamp": 1761343200
  },
  {
    "username": "LannisterCrimson",
    "rating": 7.0,
    "comment": "Bling Status ✓\n\nExpansions: -\nPromos: -\nSpecial Edition: -\nUpgraded Components: ✓ acrylic tiles",
    "timestamp": 1761256800
  },
  {
    "username": "porcine",
    "rating": 7.0,
    "comment": "Okos is, interaktív is, tematikus is, és GMT. De sajnos nekem túl magas benne a szerencsefaktor. Ettől függetlenül bármikor játszanám.",
    "timestamp": 1760220000
  },
  {
    "username": "optimo65",
    "rating": 7.0,
    "comment": "MYYTY\n35€\nRules in English\nPlayed twice",
    "timestamp": 1759701600
  },
  {
    "username": "Forta",
    "rating": 7.0,
    "comment": "DI, SO",
    "timestamp": 1758405600
  },
  {
    "username": "Hrontajkpa",
    "rating": 7.0,
    "comment": "I like it, but I think with more plays to understand it more and speed things up, the rating would rise.",
    "timestamp": 1758060000
  },
  {
    "username": "Dhole636",
    "rating": 7.0,
    "comment": "PC game",
    "timestamp": 1757973600
  },
  {
    "username": "Wolcik",
    "rating": 7.0,
    "comment": "Digital version available (PC, Android)",
    "timestamp": 1757973600
  },
  {
    "username": "alireza9372",
    "rating": 7.0,
    "comment": "Chn",
    "timestamp": 1757714400
  },
  {
    "username": "uoonsek1",
    "rating": 7.0,
    "comment": "Not bad, but do not want to play again.",
    "timestamp": 1757455200
  },
  {
    "username": "dandyy",
    "rating": 7.0,
    "comment": "By playing a card I help my opponent if it is card of his color? Constant stress of not having anything good to play made us get rid of it after two plays.",
    "timestamp": 1757196000
  },
  {
    "username": "Saume",
    "rating": 7.1,
    "comment": "I have only played this game AFTER having played Watergate, but it feels like a deeper version of Watergate, although also significantly longer. I tend to enjoy deeper and medium-to-long length games so I do like this, as I already knew I liked Watergate.\n\nThere is definitely a knowledge factor to this game where if one player is familiar with the cards in the game, they have a definite advantage over a new player or one that only plays this sporadically and doesn't remember the cards. Some specific cards have a huge impact on the game state and if you don't know they're in a game, it can ruin your game.\n\nThe components are very nice, and the artwork does fit the theme, though I find it a bit boring (old-school newspaper style, similar to Watergate).",
    "timestamp": 1756764000
  },
  {
    "username": "Jesse Terrell",
    "rating": 7.0,
    "comment": "7.5/ (s.)",
    "timestamp": 1756677600
  },
  {
    "username": "danrowe2011",
    "rating": 7.0,
    "comment": "Very few games achieve a mastery of their theme as Twilight Struggle. The back and forth exchange that amount to the movement of tint tokens never ceases to thrill. The cards are designed well, balanced and pair historical moments with influence in a fun way. The game is let down but the asymmetry and necessity of knowing each card in the game. I never lose at this. Why? Because after playing it enough time you begin to learn exactly what to do with each card when you receive it. A player with all the intelligence and ability in the world will be steamrolled by an experienced player.",
    "timestamp": 1756332000
  },
  {
    "username": "SenseiZen",
    "rating": 7.0,
    "comment": "2 player game only, 2-3 timmar games, Rankad andra plats för War brädspel, Rankad 14 för strategi och 14 overall, inte så komplicerat, resurser och trupper",
    "timestamp": 1755554400
  },
  {
    "username": "StefanieB",
    "rating": 7.0,
    "comment": "Schrank",
    "timestamp": 1755295200
  },
  {
    "username": "ditterio",
    "rating": 7.0,
    "comment": "I prefer the streamlined 13 days. The original game is too heavy and too long for me.",
    "timestamp": 1755208800
  },
  {
    "username": "nanobastaddo",
    "rating": 7.0,
    "comment": "Imperial Struggle but with nukes",
    "timestamp": 1755208800
  },
  {
    "username": "GeminiWeb",
    "rating": 7.0,
    "comment": "It's been way too long since I last played this. Have now purchased the computer version and enjoying it.",
    "timestamp": 1754863200
  },
  {
    "username": "Spada_",
    "rating": 7.0,
    "comment": "13+. Strategy + War. 2 players",
    "timestamp": 1754690400
  },
  {
    "username": "Bagherra",
    "rating": 7.0,
    "comment": "Sleeved\nInsert:\nhttps://makerworld.com/en/models/1156092-twilight-struggle-d...\n\nIncludes geek up tokens",
    "timestamp": 1753567200
  },
  {
    "username": "Aspudde",
    "rating": 7.0,
    "comment": "Källarförrådet",
    "timestamp": 1753221600
  },
  {
    "username": "XenoLocke",
    "rating": 7.0,
    "comment": "Never been able to fully wrap my head around this game yet. It takes multiple plays to truly grasp the strategy and I just don't play it frequently enough.",
    "timestamp": 1753221600
  },
  {
    "username": "holysmoke",
    "rating": 7.0,
    "comment": "Cux",
    "timestamp": 1753221600
  },
  {
    "username": "Samustroid",
    "rating": 7.0,
    "comment": "Second Edition. Includes a deluxe edition board (which I bought separately) as well as the original cardstock map.\n\nI should play this game more. Twilight Struggle is a playthrough of all the major events of the Cold War in a somewhat randomized order. What makes it a game is that you can also blow up the world during your alternative timeline. The U.S.S.R. could also finally win for once.\n\nAll of my games so far are on Playdek.",
    "timestamp": 1752444000
  },
  {
    "username": "redreg7",
    "rating": 7.0,
    "comment": "$35 AUD Components perfect. Box has a slight tear on the corner. Played Once.",
    "timestamp": 1751148000
  },
  {
    "username": "shanev316",
    "rating": 7.0,
    "comment": "This feels like an old game, the luck of the dice role can be annoying, and I'll never dedicate enough time to actually be good at this game. But this offers such a great experience, the cards are interesting, the theme is interesting, and I learn something new every time I play. This is a game I wish I could play more.\n\nUpdate: It’s just not a game I can commit to playing. It requires frequent plays to show its depths and that’s just not my gaming style.",
    "timestamp": 1750975200
  },
  {
    "username": "goodknee",
    "rating": 7.0,
    "comment": "Back Shelf",
    "timestamp": 1750456800
  },
  {
    "username": "lpcheng",
    "rating": 7.0,
    "comment": "Excellent condition, cards sleeved.",
    "timestamp": 1749420000
  },
  {
    "username": "albertrim",
    "rating": 6.8,
    "comment": "보드피아 책박스 버전+ 플레이빗",
    "timestamp": 1749160800
  },
  {
    "username": "paulastoria",
    "rating": 7.0,
    "comment": "ok",
    "timestamp": 1748469600
  },
  {
    "username": "Idiot_for_Life",
    "rating": 7.0,
    "comment": "Best at 2\nMid length\n1v1 card based area control game pitting US vs USSR.",
    "timestamp": 1748383200
  },
  {
    "username": "Aimii",
    "rating": 6.5,
    "comment": "Rated after a partial game. Was enjoying it! Didn't have time to finish. Wil re-rate later",
    "timestamp": 1748383200
  },
  {
    "username": "Eliya84",
    "rating": 7.0,
    "comment": "Good war game which simulate perfectly the cold war period. Not easy to play and against someone who knows the cards a rookie has no chance. Therefore only an 7.",
    "timestamp": 1747605600
  },
  {
    "username": "Barthi",
    "rating": 7.0,
    "comment": "Bought at Essen 2023",
    "timestamp": 1746914400
  },
  {
    "username": "ImZhe",
    "rating": 7.0,
    "comment": "Game has a steep learning curve, needing to know certain cards in the deck or you will get wrecked by them. Lot of strategy and good tug of war feeling. Definitely a solid, fun game for the right players. There is a decent amount of randomness, with Quagmire/Bear Trap being poorly designed cards in my opinion",
    "timestamp": 1746914400
  },
  {
    "username": "TheMP",
    "rating": 7.0,
    "comment": "An extremely clever design and game that will lend itself to multiple plays with endless degrees of difference in its many twists and turns. Its obviously been well tested and thought out before publishing as there seems to be nothing in the way of errata or contentious cards. Something quite rare these days. I did own this (1st ed.) some years back but offloaded it before finding anybody to play. Now that I have played, its easy to see why so many people love this game.",
    "timestamp": 1745186400
  },
  {
    "username": "svic64",
    "rating": 7.0,
    "comment": "Very fun game with good, clear rules and excellent cards. I would rate the game higher but, as the design notes states, this is not really a historical game (i.e. domino theory etc...). As I prefer historical games (Empire of the Sun, For the People more my taste) I would otherwise rate this game higher. I won't play the game frequently enough to ever be good at it (as that requires thorough knowledge of the cards, what has been played, what is likely coming etc...). Good for a light evening of entertainment, though.",
    "timestamp": 1744927200
  },
  {
    "username": "Dusty27",
    "rating": 7.3,
    "comment": "Digital Version. A good game but for me its entirely eclipsed by Imperial Struggle. But that could be matter of theme more than anything as I know its a super popular game!",
    "timestamp": 1743976800
  },
  {
    "username": "sornars",
    "rating": 7.0,
    "comment": "I don't love games that reward study and I don't love how this game approaches risk with highly consequential single die rolls. Having said that, I recognise the genius of the design and get why this has the reputation it does; I just don't think the game is necessarily for me. I'd be happy to play most of the time but would be unlikely to suggest it.",
    "timestamp": 1743030000
  },
  {
    "username": "hakuus",
    "rating": 7.0,
    "comment": "Delve deep in history. D",
    "timestamp": 1742684400
  },
  {
    "username": "Nearus7",
    "rating": 6.5,
    "comment": "//",
    "timestamp": 1742338800
  },
  {
    "username": "jbrazill",
    "rating": 7.0,
    "comment": "Very thematic but it requires a lot of practice to get to know the cards and play effectively",
    "timestamp": 1742079600
  },
  {
    "username": "Bobby64",
    "rating": 6.5,
    "comment": "The enjoyment of this game strongly depends on how well do you know the deck.\nMechanically it's very solid, but it's very not fun not knowing a thing about your nor your opponents odds.",
    "timestamp": 1741474800
  },
  {
    "username": "mlcarter815",
    "rating": 7.0,
    "comment": "This game gives me heartburn. It's one that I have to be in the right mood for because it's so tense. It's a great game, but expect to play it a few times to learn the cards before the strategies start to make sense. When teaching new players, I like to play as Russia because Russia has a slight advantage at the start, making it easy to beat new players fairly quickly. That gives them a 1 1/2 hour or so taste without having to play out the entire 3 or 4 hours.",
    "timestamp": 1741215600
  },
  {
    "username": "lucashaley",
    "rating": 7.0,
    "comment": "Played! Lost!",
    "timestamp": 1740524400
  },
  {
    "username": "Versifex",
    "rating": 7.0,
    "comment": "Tuckboxes created.",
    "timestamp": 1739919600
  },
  {
    "username": "betasub",
    "rating": 8.0,
    "comment": "Un jeu à la tension incroyable et plein de rebondissements! Le hasard est parfois un peu \"brut\" mais n'enlève rien au plaisir.\n\nMa note oscille suivant les parties... à developper",
    "timestamp": 1762297200
  },
  {
    "username": "Nerdvik",
    "rating": 8.0,
    "comment": "One of the best 2 player games, but also one of the longest and tightest.",
    "timestamp": 1761692400
  },
  {
    "username": "C Thompson",
    "rating": 8.0,
    "comment": "Despite its appearance, this may be one of the most thematic games ever made. If you manage to get through the dense rules overhead, Twilight Struggle offers an evocative simulation of the Cold War, where your only good moves are bad ones. This is a game where you're constantly stuck between a rock and a hard place, and if you like to be in that headspace, Twilight Struggle is compelling, challenging, and often funny. If you don't, this game will be a waking nightmare.",
    "timestamp": 1761692400
  },
  {
    "username": "chus1964",
    "rating": 8.0,
    "comment": "surt octubre de 2025",
    "timestamp": 1761606000
  },
  {
    "username": "Fabiotorres",
    "rating": 8.0,
    "comment": "Número de Jogadores: 2\nDificuldade: 4,0/5,0\nIndicado para Iniciante: Não\nContras: Complexo e demorado de explicar; partida bem demorada; difícil de ver mesa.\nPrós: Estratégia forte e temático.\n\nComentário: O melhor jogo feito para duas pessoas, sem dúvida (atualmente perdeu a posição para Wir Sind das Volk!).\nO jogo se passa no período da guerra fria onde um jogador assume o papel dos Estados Unidos e outro da antiga União Soviética. Durante a partida os jogadores tentam influenciar os demais países para se tornarem seus aliados. A pontuação do jogo é como se fosse um cabo de guerra, ganhando o jogador que conseguir o total de pontuação da sua nação ou ao fim de todas as eras o que tiver feito a maior pontuação.\nO jogo apesar de ser muito bom, alguns pontos negativos sempre atrapalham ele ir para a mesa. O primeiro é a complexidade do jogo, a explicação do jogo é bem demorada. O segundo é o tempo de partida que é muito longo para um jogo de apenas 2 jogadores.\nMas o que faz esse jogo ser top, mesmo com esses pontos negativos, é a temática que é super presente e retrata muito bem os acontecimentos da guerra fria nas cartas; o fato de você poder usar as cartas de várias formas diferentes deixa o jogo super estratégico, devendo o jogador ter um bom estudo do que fazer com elas.\nPara quem está disposto a jogar em dois um jogo demorado, pode pegar que vai ser sucesso!\nWir Sind das Volk! x Twilight Struggle: Ambos têm a mesma temática - Guerra Fria -; você usa as cartas ou com os seus pontos, ou com o seu efeito; um lado representa o capitalismos, o outro o comunismo; e os dois podem terminar no fim de um turno. Embora eles tenham esses e outros pontos em comum, a dinâmica do jogo, bem como os seus objetivos são bem diferentes.\nWir Sind das Volk!: O jogo é menos complexo; menos demorado e não possui um controle de área, ou seja, você nunca vai invadir uma área que o seu adversário tem, apenas vai influenciar a \"atrapalha-lo\".\nTwilight Struggle: Bem mais complexo de explicar e jogar; possui mais ações a se fazer; bem mais demorado; e tem uma disputa direta para controlar as regiões.\nAmbos os jogos são muito bons, mas sofrem dos mesmos problemas, mas o Wir Sind das Volk! um pouco menos. Os dois valem muito a pena conhecer e ter na coleção caso tenha um parceiro pra isso. Um não anula o outro, mas se fosse para ficar com apenas um dele, embora o Twilight Struggle já foi o meu top 1, hoje eu indicaria o Wir Sind das Volk! por ser um pouco menos difícil de por na mesa e curti mais a interação dele.\n\nModo Solo:",
    "timestamp": 1761606000
  },
  {
    "username": "tuttutZOOM",
    "rating": 8.0,
    "comment": "Custom wooden organizer for cards and pieces.",
    "timestamp": 1761429600
  },
  {
    "username": "Petito",
    "rating": 8.0,
    "comment": "Obaleno",
    "timestamp": 1761343200
  },
  {
    "username": "beaglestorm",
    "rating": 7.8,
    "comment": "Sleeved - 110 - Standard Card Game - Gray (FFS05)\nhttps://boardgamegeek.com/geeklist/164572/item/2915481#item2...",
    "timestamp": 1761256800
  },
  {
    "username": "Ridd3r",
    "rating": 8.0,
    "comment": "Excellent game, very strategic. Make sure your brain is well-rested before you start playing it, though.",
    "timestamp": 1760738400
  },
  {
    "username": "bazyliszek10000",
    "rating": 8.0,
    "comment": "This game is more for war game fans. There won't be any spectacular epic battles; it's a arduous 45-year war. It's a difficult game where you have to plan your moves, predict when and what to let go of to prepare for what's coming, because we know it's coming, but we don't know when. The card mechanics are excellent; I haven't encountered this in any other game (it's about playing your opponent's cards), and yet it's already quite old. The rules are rather simple, but described in a terrible way: a wall of text with minimal images. It's best to read with the board unfolded and look for the locations described in the rulebook. It's a nightmare if they could just add images for clarity.",
    "timestamp": 1760306400
  },
  {
    "username": "skur78",
    "rating": 8.0,
    "comment": "Septiembre 2016\nAbril 2007 (regalada la edición en inglés a mi hermano)",
    "timestamp": 1759960800
  },
  {
    "username": "MrWoodrow",
    "rating": 8.0,
    "comment": "Whoa mama. I haven't played this as much as I would like (I'd definitely like to get to know the decks better) but what an experience this is.\n\nFirstly, that ponderous, dry old tome of a rule book makes this game seem much harder than it actually is. I think it's a real barrier to entry as it is actually a pretty simple rule-set.\n\nWhen we first played this the Russians won easily in the early war and then as we got more familiar with the game it became far more balanced. One of the most rewarding gaming sessions of my life was playing this game. Somehow it lasted 4 hours, way past midnight on a work night and I (America)took a hard fought victory in the late war. The tension never let up once.\n\nGreat game, but I can see why the theme might not work for some people. It actually inspired me to learn a little about the Cold War.\n\nThe world is dangerous....and scary.",
    "timestamp": 1759874400
  },
  {
    "username": "logopolys",
    "rating": 8.0,
    "comment": "War Game\n Historical Game\n Two-Player Game\n\nExciting war game that chooses area control over combat. History is evoked, and world domination is abound. Deck-wise, the finest and most balanced mix I've seen.",
    "timestamp": 1759701600
  },
  {
    "username": "LudicrousBeeswax",
    "rating": 8.0,
    "comment": "Digital version",
    "timestamp": 1759615200
  },
  {
    "username": "Petersilio",
    "rating": 8.4,
    "comment": "insert",
    "timestamp": 1758405600
  },
  {
    "username": "TowersAlez",
    "rating": 8.0,
    "comment": "Pueblo",
    "timestamp": 1758060000
  },
  {
    "username": "bnoterman",
    "rating": 8.0,
    "comment": "39",
    "timestamp": 1757887200
  },
  {
    "username": "hed0ne",
    "rating": 8.4,
    "comment": "Enfundado\n+ [P&P]Cartas Arte Alternativo\n+ Promo: La guerra sucia mexicana\n+ Promo: México, cuna de la revolución\n+ Resumen\n+ 2*Ayudas\n+ [P&P]Solitario",
    "timestamp": 1757887200
  },
  {
    "username": "AlainT",
    "rating": 8.0,
    "comment": "Cards Driven game",
    "timestamp": 1757455200
  },
  {
    "username": "Kubidi",
    "rating": 8.0,
    "comment": "Players: 02\nBest: 02",
    "timestamp": 1756072800
  },
  {
    "username": "Oezz",
    "rating": 8.0,
    "comment": "I'm generally not big on two player games, but this one is fascinating. Really intriguing card play with their multi-usage. The game feels like a question of priorities, since you're pulled in all different directions. Enjoy the theme too.",
    "timestamp": 1756072800
  },
  {
    "username": "BambooBlue",
    "rating": 8.0,
    "comment": "From: 2024 WFS No-Ship Math Trade",
    "timestamp": 1755813600
  },
  {
    "username": "benschel",
    "rating": 8.0,
    "comment": "amber-vs-ben",
    "timestamp": 1755295200
  },
  {
    "username": "DieLem",
    "rating": 8.0,
    "comment": "Set up time is quite long, so you need a die hard companion to get into this game.\n\nBut once you're in, the gameplay is epic.\n\nThe mechanic to receive both friendly and enemy cards is excellent. If you have a bad hand with your opponents action cards, he has a bad hand with all your cards!\n\nTension is felt throughout the game. Feels like the Cold War all over!",
    "timestamp": 1754949600
  },
  {
    "username": "Zozobaltazar",
    "rating": 8.0,
    "comment": "Sukhy 8",
    "timestamp": 1754863200
  },
  {
    "username": "Captain Smollett",
    "rating": 8.0,
    "comment": "Das Spiel erzeugt eine sehr stimmungsvolle Atmosphäre, die durch die Mechaniken hervorragend die Spannung und Komplexität des Kalten Krieges widerspiegelt. Die Spielabläufe sind für ein Spiel dieser Kategorie überraschend flott.. Der Glücksfaktor spielt eine nicht zu unterschätzende Rolle. Spiele ich gerne wieder.",
    "timestamp": 1754863200
  },
  {
    "username": "Cercatesori",
    "rating": 7.8,
    "comment": "CRITERIA RATING\nENJOYMENT \nGAMEPLAY \nREPLAYABILITY \nDEPTH \nGAME LENGTH \nALEA \nCOMPONENT QUALITY \nPLAYER INTERACTION \nPLAYER COUNT PERFORMANCE \nSCORE: 7,85",
    "timestamp": 1754085600
  },
  {
    "username": "DarthMisster",
    "rating": 8.0,
    "comment": "Great geo strategy game. Very complex but hours of tension and pure gaming pleasure",
    "timestamp": 1753912800
  },
  {
    "username": "Sportsam26",
    "rating": 8.2,
    "comment": "Medium-heavy game that is a great example of an asymmetric game. USA and USSR vye for soft power around the globe. Smart actions are rewarded and errors are brutally punihshed. The smallest slip can cost you a 2hr game.",
    "timestamp": 1753394400
  },
  {
    "username": "Naerora",
    "rating": 8.0,
    "comment": "끝내주는 상호작용. 카드 사용이 참으로 재미있었다.\n게임에 집중하다보면 현재 몇 번째의 차례인지 혼란스러운 점은 조금 아쉽다.\n카드를 버리기도 하고 빼앗기도 하기에 내 카드의 남은 장수로 차례를 체크하면 오해가 생기기도 함.\n게임은 엄청 재미있고 2인플로 이만한 게임을 찾기 힘들 거 같다.",
    "timestamp": 1752616800
  },
  {
    "username": "djmerk",
    "rating": 8.0,
    "comment": "awesome game. but...\n\n-1 for time commitment, complexity, rules, and overall weight\n\n-1 its related, but i can't play this with any of my friends and my wife definitely doesn't want to play it",
    "timestamp": 1751666400
  },
  {
    "username": "ajpyyzajp",
    "rating": 8.0,
    "comment": "Very tense medium light Cold War game.",
    "timestamp": 1751320800
  },
  {
    "username": "Colombian85",
    "rating": 8.0,
    "comment": "59€ inkl. Erweiterung Promo",
    "timestamp": 1750543200
  },
  {
    "username": "jjoyce",
    "rating": 8.0,
    "comment": "Definitely worth it. My brother and I try to get it played at least once each year, but I want to play it more. The balance for me here is this: I want to play it enough where I can pick it up and go with very minimal rule refreshing, but not play it too much where I know every card in the game. I like being surprised by the cards I get/my opponent plays. Sure, it's not total shock because I've played several times before, but I'm not banking on certain cards.",
    "timestamp": 1750284000
  },
  {
    "username": "Igorplaza",
    "rating": 8.0,
    "comment": "I have to say that I never liked board games, but when I heard about Twilight Struggle, I loved it, bought it and decided to create a similar one, New Cold War. Now I have 2 games at home. If you enjoyed TS, you will enjoy NCW.",
    "timestamp": 1749938400
  },
  {
    "username": "CharlieMnemonic",
    "rating": 8.0,
    "comment": "Loved the idea of this but couldn’t get it never get my head around it.",
    "timestamp": 1748901600
  },
  {
    "username": "JudgeJacket",
    "rating": 8.0,
    "comment": "Absolutely fascinating. Provokes a curiousity in the events the game makes use of to manipulate the world. The more you follow up on that curiousity and reasearch the historical events, the more you understand why the game works and behaves the way it does. The more you understand that, the more invested you become in the narrative that you create by altering such history.\n\nIt makes learning fun for goodness sakes and you walk away feeling exhausted, but smarter by the end of it every time.",
    "timestamp": 1748556000
  },
  {
    "username": "brunobento",
    "rating": 8.0,
    "comment": "Sleevado",
    "timestamp": 1748383200
  },
  {
    "username": "runner_boy_4ever",
    "rating": 7.5,
    "comment": "Amazing back and fourth 2 player game, but it can run very long. I am looking forward to the Lunch Series version of Twilight Struggle coming out (Q4 2022?).",
    "timestamp": 1747951200
  },
  {
    "username": "lou_mein",
    "rating": 8.0,
    "comment": "Sleeved cards",
    "timestamp": 1747951200
  },
  {
    "username": "sam666",
    "rating": 8.0,
    "comment": "The first time I played this game, I didnt get that much into it, but after the 2nd play I started to get whats the big fuss about this game.\nYou are technically forging the history! all based on tactics and bluffing your opponent.\nThe negative thing about this game is that, if you aren't an experienced player you will get wiped by a professional player! which means this game got a lot of depth into it.",
    "timestamp": 1747864800
  },
  {
    "username": "Cabbage1012",
    "rating": 8.0,
    "comment": "App Rating",
    "timestamp": 1747260000
  },
  {
    "username": "Slrussell257",
    "rating": 8.4,
    "comment": "* with turn zero",
    "timestamp": 1747000800
  },
  {
    "username": "welverin",
    "rating": 8.0,
    "comment": "On Steam",
    "timestamp": 1746914400
  },
  {
    "username": "Jackdanielgta",
    "rating": 8.0,
    "comment": "Has a small tear at the top edge of the box. Other then that good condition.",
    "timestamp": 1746482400
  },
  {
    "username": "skifreak737",
    "rating": 8.0,
    "comment": "Wonderful game of strategy, strike and counter-strike! Having lived through most of these events, it has an even deeper impact on me with every play. This is not only a great game, it is a great learning tool and should be used in every H.S. curriculum.",
    "timestamp": 1746223200
  },
  {
    "username": "razzatazza",
    "rating": 8.0,
    "comment": "Best 2 players\n64 x 89mm",
    "timestamp": 1746223200
  },
  {
    "username": "Apollox5280",
    "rating": 8.0,
    "comment": "We had fun, but I wasn't blown away. From what I hear about this game, it really blossoms once you've played enough to know the deck pretty well, so we'll see how I feel about it then. One of the best GMT rulebooks, and a very elegant system.",
    "timestamp": 1745791200
  },
  {
    "username": "WorkmanSasquatch",
    "rating": 9.0,
    "comment": "Epic strategy with lots of tough hand management decisions. The scoring system is brilliant.",
    "timestamp": 1762695600
  },
  {
    "username": "prezbank",
    "rating": 8.5,
    "comment": "+",
    "timestamp": 1762124400
  },
  {
    "username": "depose6",
    "rating": 9.0,
    "comment": "Thoughts after 1 play: really excited to sink my teeth into this. Gonna be a bit hard to find someone to play with me though.",
    "timestamp": 1762038000
  },
  {
    "username": "williamfranz",
    "rating": 9.0,
    "comment": "Twilight Struggle broadened my horizon of board game. It integrates various mechanics while presenting to a considerable extent the reality of the Cold War. It is a classic.",
    "timestamp": 1762038000
  },
  {
    "username": "Zoozolissimo",
    "rating": 9.0,
    "comment": "Very tacticle and with a pretty small luck element, but for me still too big. It's quite long 3-4 h especially the first time, but beacose the board and cards are constantly changing it rearly gets boaring. Only smal critic is that the dethcon elimintes too many possibilaties with little chance of getting them back by raising the deathcon.",
    "timestamp": 1762038000
  },
  {
    "username": "kilfara",
    "rating": 8.5,
    "comment": "30+ plays (FTF, via ACTS/CB and via Wargameroom) - very worthy of its status as a modern classic, although I have played it to the point that I've tired of it somewhat.",
    "timestamp": 1761951600
  },
  {
    "username": "Warbear",
    "rating": 9.0,
    "comment": "Brilliant CDG, if you don't have enough time for more.\nPlayable in 3 hours.\n\nmore than 100 plays",
    "timestamp": 1761778800
  },
  {
    "username": "bonster20",
    "rating": 9.0,
    "comment": "[Christmas present.]\n[sold in BGG auction]\nI *love* this game. It's a war game (a genre I normally don't like) masquerading as straight area control (one of my top two favorite genres). This is the only game I've played that's actually stressful--really simulates the period well! So far, the US has won every time I've played, though the last time it wasn't a blow-out like the first two games.\n\nUpdate: My fourth play was the first one that lasted all 10 turns--took just over 6 hours--and the Soviets won with a score of 12.\n\nUpdate 2: Played game again after many years and wasn't all that crazy about it. It was just a tug of war, with each player undoing what the other player just did. Probably an issue with play style based on unfamiliarity with the cards and pacing of the game. But with so many other games to play, it's unlikely I'll go back to this one any time soon, so I'll sell it. I won't update my rating, though; I obviously loved it when I was playing it more and was familiar with it.",
    "timestamp": 1761778800
  },
  {
    "username": "abeheron",
    "rating": 9.0,
    "comment": "",
    "timestamp": 1761692400
  },
  {
    "username": "dahntheboss",
    "rating": 8.5,
    "comment": "packed in it: paper for mobile photosensible printer",
    "timestamp": 1761429600
  },
  {
    "username": "AMERICANBOYBAND",
    "rating": 9.0,
    "comment": "Comments\nI WANT TO GET GOOD AT THIS GAME",
    "timestamp": 1759960800
  },
  {
    "username": "Joaof",
    "rating": 9.1,
    "comment": "if playing against an equal skilled opponent, it is one of the most rewarding boardgame experiences.",
    "timestamp": 1759442400
  },
  {
    "username": "MorelliBuendia",
    "rating": 9.0,
    "comment": "One of my favorites. Every game is different, exciting and tense.\n\nMogul Scale: 3/E. High skill ceiling, although we're not there and we're not really willing to study or go as deep into it as we could.",
    "timestamp": 1759442400
  },
  {
    "username": "Adripg3",
    "rating": 8.5,
    "comment": "2025",
    "timestamp": 1759356000
  },
  {
    "username": "rikicorgan",
    "rating": 8.5,
    "comment": "(15x) ENJOYMENT:                         Forgettable     Outstanding\n(10x) DEPTH (IN RELATION TO COMPLEXITY): Lacking         Meaty\n (5x) LUCK FACTOR:                       All Luck        All Skill\n (3x) REPLAYABILITY:                     Nil             Limitless\n(10x) MECHANICS:                         Boring          Interesting\n (4x) PLAYER INTERACTION:                Low             High\n (4x) PLAYER COUNT PERFORMANCE:          Not Balanced    Balanced\n (2x) GAME LENGTH:                       Too Short/Long  Just Right\n (2x) CLARITY OF RULES:                  Mud             Crystal\n (5x) COMPONENT QUALITY:                 Cheap           World Class\n\nINITIAL RATING (sum(Criteria Rating x Criteria Weight)/Total Weight) = 8.3 \n\n +0.2 Cold war simulative",
    "timestamp": 1759269600
  },
  {
    "username": "Palach",
    "rating": 9.0,
    "comment": "If you want to enjoy the game, you're gonna have to play it a few times and learn the cards. Knowing the cards is an incredible advantage.",
    "timestamp": 1759010400
  },
  {
    "username": "Imsevimse",
    "rating": 9.0,
    "comment": "A true classic. For a game of this type, the ease of play is fantastic. Rich in history, the game is full of thematic details. Knowing the decks is everything. At high-level play, it’s fairly scripted by now, but that’s a non-issue at my level. It can run a bit long, but it’s completely gripping from start to finish.",
    "timestamp": 1758924000
  },
  {
    "username": "pupykises",
    "rating": 9.0,
    "comment": "moved up rank from an '8'. this is perhaps a bit unfair, as it have only played it once. heck, it may go up to a '10' with further plays. my only concern might be that the board may make the overall experience feel same-y. i can't mark it down for that as of yet, because...one play. loved the decision options.",
    "timestamp": 1758837600
  },
  {
    "username": "Adri_corr",
    "rating": 9.0,
    "comment": "(2, 2) #players\n\nDudo\n45 €",
    "timestamp": 1758492000
  },
  {
    "username": "Scifi66",
    "rating": 9.0,
    "comment": "Status:Shelf\n24Jun->Note it is impossible for newbie players to beat old hands.\n\nThe Cold War, a tense atmosphere that permeated post WWII up to the Stranger Things 80s. Twilight Struggle, once the #1 ranked title on BGG induces that sweaty paranoia, as we felt it during the 2 minutes to midnight period. It is a fun title but card knowledge is so critical it doesn't work for unbalanced opposition.\n+ Asymmetric factions Soviets are strong early, USA late bloomers\n+ Cards as historical events\n+ Mechanic were you must play cards that benefit your opponent = agonising and awesome\n+ DEFCON track where you lose if you cause nuclear war, several cards lower the DEFCON track automatically\n+ Space Race as a safe way to get rid of cards but only 1 or later 2 per turn\n+ Scoring system as a VP tug of war\n+ Great depth\n± War games card can be an anticlimax although it can also shorten one sided games\n±Opponents must be on similar skill level\n–Die rolls can be very swingy, if you don't get an early coup some turns you are in trouble\n\nIncludes Turn Zero expansion, sleeves and BGG counter upgrade.",
    "timestamp": 1758060000
  },
  {
    "username": "AlPacino11",
    "rating": 8.6,
    "comment": "Excellent decisions to make but too long and dice and push your luck cards should be avoided in a game that lasts 4 hours.",
    "timestamp": 1757800800
  },
  {
    "username": "qoizu",
    "rating": 8.5,
    "comment": "digital",
    "timestamp": 1757714400
  },
  {
    "username": "sucrates",
    "rating": 9.0,
    "comment": "Best 2 player non collectible, non-league game on the market. Period. The atmosphere is done brilliant, the gameplay is well thought of.\n\nSome points keep it from being a 10:\n1. Not playable vs everyone: non-gamers and most women spring to mind.\n2. Rules do have a learning curve. Best if you can find someone to teach you the game.\n3. There are a lot of things to be thought of, not everyone likes that.\n4. Play time is too much for a midweek evening. Including set up you'll need 3 to 4 hours for it.\n\nOther than that: brilliant game, with subtle strategies you only discover after a lot of plays. Basic game design follows two main tracks: on one hand it's about constantly anticipating on what your opponent is doing. On the other, it's about playing your cards to maximum effect or playing your opponent's cards for minimum effect. Balance that and you'll start to discover the depth of this game.",
    "timestamp": 1757628000
  },
  {
    "username": "Shpamo",
    "rating": 9.0,
    "comment": "Prepare to go through the five stages of grief while playing this game. Once you reach the last stage, you'll be able to truly enjoy it.",
    "timestamp": 1757196000
  },
  {
    "username": "mrouser",
    "rating": 8.5,
    "comment": "This is a perfect blend of strategy, mitigation, and intensity, with a theme I absolutely love. I'm always in the mood for this game, and now with the iOS game I can play even more.",
    "timestamp": 1757023200
  },
  {
    "username": "marinexx",
    "rating": 9.0,
    "comment": "This game feels like a struggle from the very beginning to the very end. It's super strategic and tactical, I think I started to like it better than chess! The only negative are the dice - in a super strategic game like this one the dice are super annoying. They introduce randomness where there should not be randomness. If they were thrown because of some of the cards only - that's awesome. But 2 out of the 4 available action rely on dice which is stupid.",
    "timestamp": 1756677600
  },
  {
    "username": "kdoenitz",
    "rating": 9.0,
    "comment": "Really about as good as a 2 player game gets. It is even better if you're old enough to remember some of the events (landing on the moon is as far back as I can go).",
    "timestamp": 1755727200
  },
  {
    "username": "Patoani",
    "rating": 9.0,
    "comment": "A classic, nothing much to add here. Maybe digital is better, but the physical version is worth having.",
    "timestamp": 1755640800
  },
  {
    "username": "bdeink",
    "rating": 8.5,
    "comment": "Twilight Struggle is a great game. No matter which side you pick, the gameplay always feels tense, and the game is brimming with historical flavour. The design indulges in the mindset of the Cold War perfectly, incl. discredited aspects of it like e.g. domino theory, to really put you into the headspace in which the war was fought (Paranoia included). Refreshingly, the game doesn't paint either side as specifically good or bad; Horrendous acts incl. coups, proxy wars, assasinations, etc. are tools in each side's toolbox – and in this game as in history, these tools will see frequent use (though in a very abstract form).\n\nThe digital implementation on Steam is very well made and includes an excellent tutorial mode for new players (or for old and rusty ones). I have barely touched my physical copy after I started playing online.\n\nIncl. the Blame Canada promo card from C3i #33 and the Cold War Movies promo cards from C3i #37.",
    "timestamp": 1755295200
  },
  {
    "username": "bolter47",
    "rating": 9.0,
    "comment": "Possibly my favorite 1v1. While a very simple and abstract euro in its core mechanics, the choice of said mechanics tie themselves to the theme masterfully.\n* The victory points tracker is a tug of war, reflecting the constant \"race\" to be on top of the other on the world stage.\n* The area domination score card mechanic is a master stroke to this game. You're always guessing whether or not a player's actions are motivated by whether or not they have a score card in hand, recreating the paranoia that the other superpower's actions might be motivated by them knowing something you don't.\n* The fact you can end up triggering events for your opponent during your turn means every card you play is the result of an exercise in painful risk management and opportunity cost analysis.\nSome card text could be made clearer, especially with how rules writing clarity has evolved in the industry over the years. But then again, what classics don't have their little quirks?",
    "timestamp": 1755208800
  },
  {
    "username": "Disperazione",
    "rating": 9.0,
    "comment": "2",
    "timestamp": 1754604000
  },
  {
    "username": "BladeRunner1",
    "rating": 9.0,
    "comment": "What a game. Every move is agonizing and the tension is unmatched in any other two-player game I have ever played.",
    "timestamp": 1754517600
  },
  {
    "username": "Arnar146",
    "rating": 9.0,
    "comment": "Gulli",
    "timestamp": 1754517600
  },
  {
    "username": "Ahtreyu",
    "rating": 9.0,
    "comment": "Absolutely love it!",
    "timestamp": 1754517600
  },
  {
    "username": "rgallamore",
    "rating": 9.0,
    "comment": "3.61 diff",
    "timestamp": 1754431200
  },
  {
    "username": "Doctor_Cowboy",
    "rating": 9.0,
    "comment": "Very cool game and like the COIN mechanics in their full glory. I find your enjoyment is heavily dependent on your familiarity with the cards in the deck and the strengths of each side during each phase of the cold war. Takes about 3-ish games to really sink in. Probably the deepest, heaviest 2p strategy game you can play though.",
    "timestamp": 1754344800
  },
  {
    "username": "ThirdStringHero",
    "rating": 9.0,
    "comment": "2",
    "timestamp": 1754085600
  },
  {
    "username": "Mante2691",
    "rating": 9.0,
    "comment": "This game is simply great. You feel incredibly the history and it is a card game! For some things is a bit unbalanced, but nothing that you cannot manage with a bit of experience in playing the game. I enjoyed a lot the possibility to adopt so many different strategies.",
    "timestamp": 1753912800
  },
  {
    "username": "avengernk",
    "rating": 9.0,
    "comment": "khalid",
    "timestamp": 1753826400
  },
  {
    "username": "Bobeloska",
    "rating": 9.0,
    "comment": "Wow, what a great game this is! It's my favorite game for 2P, even though it takes a few hours to play through it. For those of you who like strategy and history, this is your game!\n\nEdit 2025; still a great game, but not a game that I prefer to play when I have time over",
    "timestamp": 1753740000
  },
  {
    "username": "Collons2De1Deu",
    "rating": 9.0,
    "comment": "My new non-euro favorite! Left in Istanbul.",
    "timestamp": 1753653600
  },
  {
    "username": "mawilson4",
    "rating": 8.5,
    "comment": "Just a good, involved game. Easy to see why this once held the top spot on the BGG ranks (yes, self-selection in audience played an enormous role as well; that's a prerequisite but not sufficient for such a lofty position).\n\nIt's far from a light game, but for the multifaceted gameplay it delivers, it's intuitive and flows well. Exactly two cards' events rankle me from a design perspective, and only some moments of \"you do something and I immediately reverse it\" seem a touch perfunctory. Otherwise, the freedom the game gives you to activate OPs, as well as the emergent considerations on timing and execution of the game's actions, is fascinating. Even something as subtle as maintaining control over the positioning of the DEFCON track can be a powerful way to influence the game state obliquely, which layers the interaction and strategic considerations.\n\nAnd the history is just recent enough that, even for the portions that occurred before I was born, parents and grandparents lived through them, and so we grew up in the shadow of them. The Cold War wasn't an omnipresent threat for us, but we sensed the collective import of this nebulous tug-of-war. The game captures this.\n\nIt threatens to be too event-heavy, but at least some of this is enemy events in your hand that you don't want to see happen. So when and how you maneuver around them (and when you decide to bite the bullet and activate them) provides painful (i.e. fun) loss-aversion decisions to mix with those where you gain benefits.\n\nI can see how this sort of became the thesis statement for CDGs (card-driven wargames), which some others have iterated on, tried to imitate, or tried to pare down into shorter forms, with varying levels of success. It's a lot of the tensions of that genre done right, plus some cursory touches from Eurogames that undoubtedly broadened the audience a bit compared to its forebearers like Washington's War. The scope (global) and scale (decades) abstracts a lot that might seem more personal or visceral in others that cover only a single battle or more bounded war. But it can hardly be faulted for delivering this grandiose pseudo-conflict so thoroughly. I can't call it my favorite CDG, but can easily see how it's the favorite of many, and were I to invest in enough additional sessions, it could climb to the same heights for me.",
    "timestamp": 1753653600
  },
  {
    "username": "Branigar",
    "rating": 9.0,
    "comment": "- Sleeved.\n- Upgraded to deluxe edition (mounted map, rules, quick reference sheets and cards) with kit from GMT.",
    "timestamp": 1753394400
  },
  {
    "username": "danielmleitao",
    "rating": 9.0,
    "comment": "Rated: 08/2018\nEdited: 01/2022\n\nSold. (12/2022)",
    "timestamp": 1753221600
  },
  {
    "username": "getareaction",
    "rating": 9.0,
    "comment": "Played this maybe a dozen times and I think the US player has only won once or twice, which knocks it down a notch for me. Excellent game, but ultimately exhausting.\n\nUpdate: now that the digital version has come out I've played against the AI fairly intensely for a couple of weeks, and I've grown a deeper appreciation for this game. It manages to evoke 50 years' worth of brinksmanship and paranoia in such an involving way, and you can't help but want to find out more about the stories behind all the events. A masterpiece of design. Bumped back up to an 8.",
    "timestamp": 1752962400
  },
  {
    "username": "Major Geek",
    "rating": 9.0,
    "comment": "Sold 2024\n8/20/23 inventory\nOpen, unpunched\nincludes Kickstarter\n1: Promo deck #1\n2: Promo deck #2\n3: Turn zero pack\n2 extra set of cards\nExtra map",
    "timestamp": 1752876000
  },
  {
    "username": "alobunko",
    "rating": 9.3,
    "comment": "Owned in: App Store, Steam\n\n2 influence handicap to the US",
    "timestamp": 1752444000
  },
  {
    "username": "CharlieNZ",
    "rating": 9.0,
    "comment": "Played",
    "timestamp": 1752357600
  },
  {
    "username": "Sly_Quick",
    "rating": 9.7,
    "comment": "N/A Expansions\n\nN/A Inserts",
    "timestamp": 1762633500
  },
  {
    "username": "ralmeida028",
    "rating": 10.0,
    "comment": "The best wargame EVER!!!",
    "timestamp": 1762210800
  },
  {
    "username": "Javier GP",
    "rating": 9.9,
    "comment": "Inmersión total en la segunda mitad del siglo XX. Todo son hechos históricos. Mecánica no muy compleja que conecta perfectamente con la realidad histórica.\nImprescindible.",
    "timestamp": 1761951600
  },
  {
    "username": "bnordeng",
    "rating": 10.0,
    "comment": "Six plays now and TS is holding strong with a 9 rating and a spot in my top 10. I am definitely getting more familiar. However, I also seem to be getting a bit sloppy (not reading cards carefully, misplaying my hand) and I seem to be showing more AP, especially in the mid-war when I feel like the board is locked up. One thing I've learned for sure is to not give up on a game.\n\nIn my 6th game (USSR), my opponent's 50th (USA), I got off to a great start but moved into Pakistan too early. He couped (6) to flip Pakistan and my huge turn 1 advantage ended up not as huge. For the most part, the cards really went my way this game but the dice did not. I missed many key rolls and my opponent hit the biggest ones for him. It was the first game of TS where I saw the dice so lopsided. Still, my opponent outplayed me with the cards significantly. Still learning.\n\nI feel like the theme is well integrated with the game play. It's been fun to watch an experienced player maneuver through some dicey situations while I struggled.\n\nI feel like I say this a lot after finally playing highly rated games, but I really shouldn't have waited so long to play this one. I finally pushed it to a 10 rating. I don't play it often... it's a commitment and requires the right opponent and I love it whenever I do play it.",
    "timestamp": 1761429600
  },
  {
    "username": "Horsebanger",
    "rating": 10.0,
    "comment": "I play this about once a month online. It's brilliant, and I still am learning hot to play. I kind of wish there was a remake where every card was better, so that I could play more events vs just using the ops. Cards like NATO for instance, are practically useless as an event for USA.\n\nStill, I love it and love playing it to this day.",
    "timestamp": 1760911200
  },
  {
    "username": "SocialJusticePaladin",
    "rating": 10.0,
    "comment": "The single best game about making the best of a bad situation ever made.",
    "timestamp": 1760220000
  },
  {
    "username": "Herakleitos",
    "rating": 10.0,
    "comment": "From my first play, I already knew this was a favorite. The tension throughout is palpable and I love how it portrays the dynamics of an ideological conflict. I don't think I will ever tire of Twilight Struggle.\n\nUpdate 2021: Having played many more times, both in person and online, I can still attest to my enjoyment of this game. There is a strange phenomenon with this title: unlike with other games, where repeated play makes the game easier, this game gets more brain-burning the more frequently you play. This is, presumably, owing to familiarity with the cards. I love it (although I'm terrible at it!) and would never turn down an opportunity to play it.\n\nUpdate 2025: Got this back out after a long hiatus. I still greatly enjoy it but I am considering dropping it down to a 9. Its a bit long and my tastes have changed somewhat.\n\n+ Red Sea (I'm counting this as an expansion)",
    "timestamp": 1759960800
  },
  {
    "username": "hockeyjones",
    "rating": 9.5,
    "comment": "25\n\nLast play in 2025",
    "timestamp": 1759615200
  },
  {
    "username": "greenlotus284",
    "rating": 9.5,
    "comment": "まあいくつか欠点はあると思う。しかしこのあまりの面白さの前ではそれらは些細なことだ。",
    "timestamp": 1759442400
  },
  {
    "username": "blake33",
    "rating": 9.9,
    "comment": "Best epic 2 player game ever",
    "timestamp": 1759269600
  },
  {
    "username": "FollowinADistantStar",
    "rating": 10.0,
    "comment": "Un clásico por méritos propios. La vuelta de tuerca a la mecánica CDG tradicional que obliga a activar los eventos del oponente en las cartas que juegas de tu mano, combinado con una distribución de mazos por eras, y una amplia variedad de eventos bien pensados, dan a este juego una profundidad y rejugabilidad enorme. Esto se junta con lo impredecible de las puntuaciones por región, que también se activan con las cartas, para dar lugar a una de las experiencias lúdicas más tensas que te puedes encontrar... Combinado con el apasionante tema y una notable accesibilidad, al menos en lo que a este tipo de juegos se refiere (el manual son diez páginas, y con la hoja de ayuda ya prácticamente puedes empezar a jugar), creo que este juego es un imprescindible en cualquier colección que admita juegos de confrontación para dos jugadores de cierto peso y duración. Si pudiera ponerle alguna pega, es que a veces los astros se alinean en tu contra, los dados no te sonríen, los eventos no encajan... He tenido alguna partida de querer quemar el juego, xDD Pero dentro del caos hay mucho margen de maniobra y oportunidades para jugades sutiles, trampas, contraataques, etc. Y sin suerte tampoco habría épica... ¡Un diseño maravilloso!",
    "timestamp": 1759010400
  },
  {
    "username": "Sandrem",
    "rating": 10.0,
    "comment": "Купить огранайзер для жетонов с цифрами",
    "timestamp": 1758751200
  },
  {
    "username": "Genuineluigi",
    "rating": 9.5,
    "comment": "3 games in, it's fascinating in so many ways.\n1 game took an hour and a half, 2nd took 2 hours, 3d (which got to the final stage of the game) took about 5 hours.\nEasy to burnout on.",
    "timestamp": 1758751200
  },
  {
    "username": "Timstikkers",
    "rating": 10.0,
    "comment": "Classic, not perfectly balanced, but what a ride",
    "timestamp": 1758664800
  },
  {
    "username": "kellhus",
    "rating": 10.0,
    "comment": "The most tense game I've ever played, really engaging. It can even be quite draining, but is nevertheless a bundle of fun!",
    "timestamp": 1757887200
  },
  {
    "username": "UROPTBishop",
    "rating": 10.0,
    "comment": "Masterpiece",
    "timestamp": 1757282400
  },
  {
    "username": "Udruga Kockica",
    "rating": 10.0,
    "comment": "1 KOM - BID\n\n1 KOM - IVA.K.",
    "timestamp": 1756936800
  },
  {
    "username": "Rubeus",
    "rating": 10.0,
    "comment": "Para mí, el mejor juego de mesa que he jugado nunca para dos jugadores. Requiere mucho tiempo y dedicación, sobre todo a la hora de aprender las reglas y asimilarlas bien. Una vez conseguida la curva de aprendizaje y si tenemos en cuenta el componente subjetivo de cada jugador (cada persona es un mundo, no lo olvidemos, y hay juegos que \"te hacen click\" y otros que no, independientemente de su calidad de producción, etc.), este juego es pura tensión, estás atento todo el tiempo aunque no sea tu turno y, además, cuenta con dados, que es la sal y pimienta (ese puntito de azar que tiene le sienta fenomenal y, ¡ojo!, no es determinante; es decir, por regla general gana el mejor jugador a la hora de gestionar \"malas manos\" de cartas). Un juego maravilloso.",
    "timestamp": 1756936800
  },
  {
    "username": "Javierus",
    "rating": 10.0,
    "comment": "Top top",
    "timestamp": 1756850400
  },
  {
    "username": "Bozok",
    "rating": 9.5,
    "comment": "Wargame (sort of) at strategic (3rd) level. The mechanic where you have to play cards that benefit the other player, and therefore trying to minimize their impact, is very interesting (and a bit frustrating). The barrier to entry for new players is not knowing the cards. Some games can end early, and so it's rarer to see the \"late war\" deck. In that sense, it can be a little hit or miss, but the epic times are very epic!\n\nI own the digital version on Steam.",
    "timestamp": 1756764000
  },
  {
    "username": "Sinashakiba",
    "rating": 10.0,
    "comment": "Masterpiece",
    "timestamp": 1756677600
  },
  {
    "username": "Kaiserchico",
    "rating": 9.5,
    "comment": "If it didn't have a dice system I'd give it a solid 10.",
    "timestamp": 1756072800
  },
  {
    "username": "Shu1984",
    "rating": 10.0,
    "comment": "Bought Dec 2015. M2\nPlayed app since Dec 21\nMasterpiece. Should be on top of the bgg chart as it used to...",
    "timestamp": 1755208800
  },
  {
    "username": "uncelafo",
    "rating": 9.5,
    "comment": "Satisfaction (0-15) - 15\nDiversity (0-10) - 10\nPower of choice (0-10) - 10\nRandomness (0-10) - 9\nMechanich vs Theme (0-5) - 5\n\nGAME EXPERIENCE (50) - 47\n\nArt, graph & symbol (0-8) - 8\nComponents & quality (0-7) - 7\nBox insert (0-5) - 3\nTheme (0-5) - 5\n\nAESTHETIC EXPERIENCE (25) - 23\n\nTime vs satisfaction (0-10) - 8\nDowntime (0-6) - 6\nTime to relearn (0-4) - 4\nSetup time (0-3) - 3\nShelf space (0-2) - 2\n\nPRACTICAL EXPERIENCE (25) - 23\n\nTOTAL - 93",
    "timestamp": 1755036000
  },
  {
    "username": "bigbadscrubb",
    "rating": 10.0,
    "comment": "Only a few plays under my belt at this time, but my initial rating was higher than an 8 until I played some of the \"sharks\" in this game. I won't call the rather scripted card deck completely manipulative, but good players clearly are separated from the newcomers in this one, and I just don't see much variety in gameplay from game to game. This is a brilliant design and a great game, but I will need more plays to see the depth I suppose.\n\n(April 2014)\nI have had a lot of experience with this game by now. My rating remains an 8. The design is excellent...and I see what it is so popular, even if I don't personally agree with its #1 rating. The game seems to be all about counting cards at a high level of play.\n\n(July 2014)\nOK, OK...upping my rating to a 9. This is one CDG where a player must absolutely, positively know the deck in order to succeed. I am not the world's best \"card counter,\" but knowing which critical cards remain in play is a must. The game does reward one who takes the time to learn to play well - thereafter it has an entirely new feel. This is the sign of a great design and as I can now play competitively (can't say that about all board/wargames), I have to bump my rating up.\n\n(December 2015)\nThanks to the immediate accessability of Vassal live games, my games of this are in the 100s by now. Thus, my upgrade to a rating of \"10\" is long overdue.\n\n(August 2025)\nTen years since my last update, and my games are in the thousands, thanks in large part to a very active competitive field and the accessibility of pick-up games via the Playdek/PC digital version. This is my \"best game\" compared to every other board game I have played, so it stays in the \"10 spot\" rating-wise and I doubt that will ever change.",
    "timestamp": 1754949600
  },
  {
    "username": "SirSalzburg",
    "rating": 10.0,
    "comment": "sleeved",
    "timestamp": 1754949600
  },
  {
    "username": "nskladan",
    "rating": 10.0,
    "comment": "Great and clever game for all time.",
    "timestamp": 1754863200
  },
  {
    "username": "rizcharger",
    "rating": 10.0,
    "comment": "Close to perfect game. It ticks all the boxes for strategy game. Extremely thematic with constant tension riding on every decision and cardplay.",
    "timestamp": 1754258400
  },
  {
    "username": "Pedrothegreat11",
    "rating": 9.5,
    "comment": "When you have 3 hours to spare with your friend who loves the 20th century, there is no better game",
    "timestamp": 1754172000
  },
  {
    "username": "traderj",
    "rating": 10.0,
    "comment": "My favorite 2-player game is still Netrunner, and yet I continue to be amazed how strangely replayable this game is. With far fewer rules, cards, and mechanisms than Netrunner, it rivals it in depth and almost matches it in replayablity. I think such a design can only be discovered by accident.",
    "timestamp": 1753912800
  },
  {
    "username": "armadaman",
    "rating": 9.5,
    "comment": "GMT#: 0510-11\nUnpunched counters, cards are bagged.",
    "timestamp": 1753567200
  },
  {
    "username": "otheym6",
    "rating": 10.0,
    "comment": "Would love to play!",
    "timestamp": 1752703200
  },
  {
    "username": "zawraz",
    "rating": 10.0,
    "comment": "This is one legendary title. Long and demanding intelectually, but every hour is worth it.",
    "timestamp": 1752184800
  },
  {
    "username": "debiant",
    "rating": 10.0,
    "comment": "The most evocative game I've ever played, bar none. From the mechanics down to the components, the game is just amazing. Cold Warriors...come out and play-ay!",
    "timestamp": 1752012000
  },
  {
    "username": "eenriquez315",
    "rating": 10.0,
    "comment": "This game started it all for my love for wargaming. Although I prefer asymmetrical wargames from the GMT COIN series lately. It undoubtedly still remains supreme in its class as the quintessential GMT game.",
    "timestamp": 1751752800
  },
  {
    "username": "mothertruckin",
    "rating": 10.0,
    "comment": "Tense from the first card play to the last.\n\nStill undefeated after 12 f2f plays (half as USA). I would like to try the scenario(s).\n\nWith the release of the smaller TS games I have a hard time keeping this a 10, but I will for now even though I am aware of the balance and play length issues.",
    "timestamp": 1751320800
  },
  {
    "username": "jojondro",
    "rating": 10.0,
    "comment": "Revisado",
    "timestamp": 1751234400
  },
  {
    "username": "pinciukas",
    "rating": 10.0,
    "comment": "EUROGAME",
    "timestamp": 1751148000
  },
  {
    "username": "Fuzzcrumbler",
    "rating": 9.5,
    "comment": "A Cold War era CDG that shines (or chills) & sets the example for all other (CDG's). Easily understood rules, nicely crafted components (Deluxe edition), and a steady tension combine to create a memorable experience. Like many games, it helps if players are somewhat at equal levels, otherwise one player will better usilise the cards coming out. But not many games reach this level, though there are many imitators. Permanent keeper.",
    "timestamp": 1750716000
  },
  {
    "username": "macUladh",
    "rating": 10.0,
    "comment": "A tense game of crisis mitigation with strong strategic and tactical elements. It is immensely satisfying to turn around a losing game with a well-timed attack on an important region or by engineering the potential for defcon suicide. The physical game is a bit too fiddly until you've really internalised the rules and strategy, but well worth the effort to learn.",
    "timestamp": 1750456800
  },
  {
    "username": "NateDogma",
    "rating": 10.0,
    "comment": "This game accomplishes the impossible task of harmonizing the impact of hand composition with the slow burn of incremental gains. While a 'purged' \"2-op\" hand of your opponent's cards will feel like certain loss, strategic play trumps luck a majority of the time. This mitigates the 'swingy' feel of the game. Variable cards and dice-rolling keep the game lively. However, the true beauty of the game lies with being forced to play your opponents event from your hand. A perfect 2-player game akin to chess.",
    "timestamp": 1749765600
  },
  {
    "username": "mmychal",
    "rating": 10.0,
    "comment": "I am awful at this game and I wish I were part of an experienced group just trying to get myself better at playing it. It's another fantastic replacement for chess and the theme is what takes it from a 9 to a 10 for me.",
    "timestamp": 1749592800
  },
  {
    "username": "esparver73",
    "rating": 10.0,
    "comment": "Finally the Catalan edition for one of the best strategy games ever!",
    "timestamp": 1749420000
  },
  {
    "username": "NJCardboardWarrior",
    "rating": 9.5,
    "comment": "The ultimate geopolitical strategy game and long running king of BGG. If you lived through the Cold War or are a political historian, this game is a must play. If you enjoy a competitive, high tension game, this one is also a winner. 2 players keeping the world in the brink of nuclear war (DEFCON 2) for the entire game is a standard strategy, so 1 wrong move can end the game against you.\n\nHowever, figuring out how to manage a bad hand of cards, or escaping from a DEFCON suicide card in your hand is a huge thrill. I love this game.",
    "timestamp": 1749074400
  },
  {
    "username": "saoneal",
    "rating": 10.0,
    "comment": "The Olympics have plunged the world into nuclear winter more than once in my plays of this, which probably makes me an idiot.\nThis remains an extremely tense design, from the fragile state of the world map to the constant puzzle of trying to avoid enemy events in your hand.\nIt can feel pretty swingy, especially compared to modern designs, but I think that's part of what makes it work - sometimes the cards just absolutely screw you over, but it very much awards adaptability and tactical pivots.",
    "timestamp": 1748901600
  },
  {
    "username": "Svtx_08",
    "rating": 10.0,
    "comment": "Owned - Noël 2023",
    "timestamp": 1748469600
  },
  {
    "username": "acherubini",
    "rating": 10.0,
    "comment": "One of those games that went somewhere nobody had gone before",
    "timestamp": 1748383200
  },
  {
    "username": "mudekk",
    "rating": 10.0,
    "comment": "Gotta love it.",
    "timestamp": 1748210400
  }
]