[
  {
    "username": "FutureSpec",
    "rating": 1.0,
    "comment": "no",
    "timestamp": 1671231600
  },
  {
    "username": "l111",
    "rating": 1.0,
    "comment": "Pantry",
    "timestamp": 1613602800
  },
  {
    "username": "Frozen Flesh",
    "rating": 1.0,
    "comment": "I came here, because of all the people rating games like KD:M or Hate with a 1, just because of their mature theme.\nI’m offended by how boring the theme of this game is!",
    "timestamp": 1547074800
  },
  {
    "username": "datefruit",
    "rating": 1.0,
    "comment": "farming",
    "timestamp": 1523743200
  },
  {
    "username": "danamark",
    "rating": 1.0,
    "comment": "Why do they call Rosenburg's games sandboxes and Feld's a point salad? And yet the sandbox is so admired, the point salad is so loathed? \"There are a lot of ways to get points\", from a video review. From a written comment, \"Many resources, many actions, many conversion possibilities\", same crap.\n\nA kitty litter box.\n\nSigh.... Doesn't one Dice Tower reviewer ever get tired of this guy?\n\nI guess as long as you keep changing themes you are golden. Oh wait it's farming again, where is the rant?\n\nAnother same old same old, higher priced then Caverna if you factor in the 2 player limit, not that Caverna should be played over 4, or under 3.\n\nAnother game of the same game ilk as the rest this designer cranks out, games for those who aren't master of their own domain, playing this stuff is the same thing.\n\nTotally dumbfounded by the love, the rankings of this.\n\nGoes to show how a tight Fanboy group who are more apt to rate a game, then a regular buyer, can shew ratings. Magic, Dice Masters are another group that can do the same thing, with them it is a life style.\n\nMy one set of Dice Masters is one set to many for me. My now 1 Rosenberg game, Bohnanza, is enough for me. Last original thought he had.",
    "timestamp": 1464213600
  },
  {
    "username": "tang tang",
    "rating": 1.0,
    "comment": "with such a long setup time and such a low replay value , i would rather play chess instead. This game is a waste of card boards and the trees that die are crying. Piece of trash again ...",
    "timestamp": 1448146800
  },
  {
    "username": "TheSlov",
    "rating": 2.0,
    "comment": "I really don't understand the appeal of this game at all.\nEvery other game Uwe designed is better than this generic farming simulator with extra steps.\nIt's a euro sandbox where you can be free to do whatever and find whatever strategy, but this is really just a solo game at best. Not a very good one at that because there is very little dynamic changes game to game. A handful of buildings change...I think that's about it? You can literally play the same game over and over and have very little variation or deviation.\nI get this was a passion project for Uwe to pay respects to his mom and the farming life in rural Germany, but that doesn't mean this is a game that should have been published. So far the worst Uwe I've ever played, almost ALL of his other games are better than this but somehow this is in the top 100 games of all time...\nIt's sort of fiddly, the turns don't have fulfilling/powerful moments, the board is so boring to look at that visually my brain gets closer and closer to comatose state, I don't see the \"fun\" or value.\nDon't look at BGG ratings, look at # of OWNED copies. There's many \"worse\" rated games that double the owned copies of Fields of Arle.",
    "timestamp": 1758751200
  },
  {
    "username": "GarfieldKlon",
    "rating": 2.0,
    "comment": "No desire to play it. I just don't like Uwe Rosenberg games. This sounds like Anno light and some games are not meant to be board games. And multiplayer solitaire...",
    "timestamp": 1706482800
  },
  {
    "username": "Janasik",
    "rating": 2.0,
    "comment": "For a game specifically made for two people, there is a real lack of head-to-head tension. I rarely felt like I was being blocked because of the abundance of different equally fine actions. Agricola at 2-player has more push and pull.\n\nThere are a lot of mechanics here, but they all feel like they are lacking depth. From the feeding phase, which I'm convinced is impossible to fail, to the shipping out resources for contracts.",
    "timestamp": 1664661600
  },
  {
    "username": "dziobanes",
    "rating": 2.0,
    "comment": "boring",
    "timestamp": 1563055200
  },
  {
    "username": "ClassicFrog",
    "rating": 2.0,
    "comment": "a bloated mess of a game. the itches this game scratches can be scratched by many many many better games. i will never play this again.",
    "timestamp": 1559512800
  },
  {
    "username": "AntKampino",
    "rating": 2.0,
    "comment": "Boring euro. Weird set of options. I am happy to play Agricola occasionally but not Fields of Arle.",
    "timestamp": 1525471200
  },
  {
    "username": "JSMA",
    "rating": 3.0,
    "comment": "Ziemlich trocken und langweillig",
    "timestamp": 1761951600
  },
  {
    "username": "Tigrillo",
    "rating": 3.0,
    "comment": "The ultimate mulitplayer solitaire for two people. Which is also why I do not like it much. No interaction whatsoever and no tension. Just two people playing their separate puzzles. Well-crafted no doubt but decidedly dull and a big sprawl of blandness.",
    "timestamp": 1746050400
  },
  {
    "username": "Dunkelzahn2061",
    "rating": 3.0,
    "comment": "Advanced resources that slow down the game but weren't necessary to make the game work, always the same themes and ideas from Agricola ... It's not a bad game, but it was a disppointment and there are too many better games.",
    "timestamp": 1731625200
  },
  {
    "username": "Klausi300",
    "rating": 3.0,
    "comment": "3",
    "timestamp": 1699570800
  },
  {
    "username": "savedbygrace1521",
    "rating": 3.0,
    "comment": "Uwe garbage",
    "timestamp": 1645138800
  },
  {
    "username": "aardbeibanaan",
    "rating": 3.0,
    "comment": "De Friese Velden\n\nVerkoop",
    "timestamp": 1603317600
  },
  {
    "username": "pumaman123",
    "rating": 4.0,
    "comment": "Die Gebäude sind sehr langweilig und erlauben kein engine building.",
    "timestamp": 1756677600
  },
  {
    "username": "pwoloszun",
    "rating": 4.0,
    "comment": "Advantages:\n+ strategic\n+ many different ways you can go\n+ solo variant works ok\n\nDisadvantages:\n- 2p mode feels like solitare\n- boring",
    "timestamp": 1679612400
  },
  {
    "username": "Gamil_",
    "rating": 4.0,
    "comment": "Can't get this organized in a way that makes it playable. Willing to sell/trade.",
    "timestamp": 1670799600
  },
  {
    "username": "Carnage994",
    "rating": 4.0,
    "comment": "I can definitely see elements of Feast for Odin in this game. I know I'm not the right audience for this game, but I would find it hard to justify getting this game considering it is only for two players. I would probably opt for Caverna of Feast for Odin before this one.",
    "timestamp": 1644447600
  },
  {
    "username": "wundersim",
    "rating": 4.0,
    "comment": "2020. I don't know why but this game just feels boring. Like you can do anything you want but you don't know why you'd even want to do it.",
    "timestamp": 1636585200
  },
  {
    "username": "NormandyWept",
    "rating": 4.0,
    "comment": "Auto-biographical, sprawling farming game from the master of the oeuvre - but I don't think this is his best work. I do enjoy the upgrading of tools and this works to differentiate action spaces between players/games in the way that cards often do in his other designs. With repeated plays, it feels this increasingly comes down to a race for the strong scoring buildings, to an extent that these virtually dwarf all the farming, trading, vehicle, and journeying systems surrounding them.",
    "timestamp": 1633557600
  },
  {
    "username": "liketheboys",
    "rating": 5.0,
    "comment": "It's prolly fine but I am not going to scan and analyze a wall of worker placement spots and unique building abilities to carve out a sound strategy. I don't know why it seems fine to me in Agricola with the cards; maybe it's just familiarity atp.\n\nIt's cute. Unlike 'gric, I can decide I want to focus on animal husbandry and do just fine and not feel punished the entire time for it. Certain actions are only available during certain seasons, and it's cool how you often have to make tradeoffs to achieve the goals you set for yourself.\n\nUltimately all this boils down to optimization and solitaire play. I still would prefer Agricola atp. I still might not turn down a game of this with a quick playing partner or two.",
    "timestamp": 1762670280
  },
  {
    "username": "Qhorin",
    "rating": 5.0,
    "comment": "Take Agricola less the interesting combos, the tight action spaces, and the interaction, and what have we?",
    "timestamp": 1762383600
  },
  {
    "username": "Ephorus",
    "rating": 5.0,
    "comment": "What I like:\n- Pretty cool worker placement game for one to two players. I usually never play solo, but it was fun exploring the different strategies by myself. Strong sandbox vibe.\n- Having different actions available in summer and winter adds a nice rhythm to the game and forces you to plan ahead.\n- Nice turn order mechanic in which one can use the action from a different season, with the trade-off that one will go second in the next round.\n- The setting in East Frisia and the historical flavor give it a cozy and grounded feel.\n\nWhat I dislike:\n- Even in a two-player game, it often feels like multiplayer solitaire. There’s not much tension or blocking unless you’re really trying.\n- Buildings could have been more variable to enable even more considerations on which strategy one should play.\n- Not very exciting compared to other duel games I've played. Typical get-resources-to-get-VPs kind of game, which is fine—just not thrilling.\n- Setup and teardown is a bit much.\n\nWhy I culled it:\nAfter two IRL games and the rest played on Yucata as solo, I had the feeling that I'd had the share of experience that I wanted to experience. It's not a bad game, just one that I don't need to play again. I don't feel that “on the edge” feeling that makes me want to come back for more.",
    "timestamp": 1762038000
  },
  {
    "username": "dtmoney75",
    "rating": 5.0,
    "comment": "2 Plays\n\nExpansions: Tea & Trade, Promo\n\nPlayed at: 2",
    "timestamp": 1749852000
  },
  {
    "username": "mdiep",
    "rating": 5.0,
    "comment": "I find Fields of Arle unsatisfying for 2 reasons:\n\n1. None of the buildings seem that good. The connections between them are hard to see and they chain in unsatisfying ways. E.g. many of the red buildings, which require 15 food and 6 upgraded resources to build, upgrade your tools or give you equipment. By the time I've amassed the resources, I no longer need those upgrades.\n\n2. There aren't constraints to make you chase different strategies or to guide your play. Since the buildings aren't that key, the limited variability provided from them doesn't really matter. There's some blocking in the non-solo game, but there are so many action spaces—and most things of consequence require multiple seasons of work anyway—that it's not big of a deal.\n\nSee my thoughts about other Uwe Rosenberg games in my Uwe Rosenberg Games I've Played geeklist.",
    "timestamp": 1746914400
  },
  {
    "username": "sutrebuh",
    "rating": 5.0,
    "comment": "A warm rain of points! Life as a farmer in Uwe Rosenberg's East Frisian homeland was quite carefree around 1800, if you take the game Arler Erde as a yardstick. In Agricola, the procurement of food was often enough not without difficulties and everything else was hard work, every point well earned; in Arle, the farm grows almost by itself. Whatever you do, it rains points everywhere and food can be procured in such abundance that it can be used to pay for large buildings right up to the castle.\nThe question is not whether you get points, but how many. Whichever path you take, the scores are close together in the end. The game doesn't allow you to play so stupidly that no points flutter in. This makes the whole thing feel a little unambitious.\nBut Uwe Rosenberg wouldn't be a master of his trade if he couldn't make this lack of ambition fade into the background. Because we are still eager to carefully weigh up every move and optimize the acquisition of one building or another in the hope of scoring a few more of the many points thrown at us. Because if we pretend for a moment that the first 80 points don't count at all because they're a gift, then we won't be so close together in the end. Then every point counts again.\nWhat remains sad, however, is that life in Arle was obviously much less varied than in the early modern era of Agricola. Apart from a few tiles, you start every game with exactly the same starting situation, and nothing changes in the course of the game. And then there is the matter of the highly praised theme: Which grocer gives you something for free? Is this a board game turned East Frisian joke?",
    "timestamp": 1744236000
  },
  {
    "username": "Rasdel",
    "rating": 5.0,
    "comment": "Some people like having many options. I feel too many options makes everything less interesting. I can understand how this could be a chill/zen game for some due to this but I felt it boring and with no agency.",
    "timestamp": 1730934000
  },
  {
    "username": "Cone Defense",
    "rating": 5.0,
    "comment": "Least favorite of the big Uwe’s. This just felt more constricting and not fun free form. I’d happily choose Agricola, Caverna or Feast over this.",
    "timestamp": 1726696800
  },
  {
    "username": "MissP1ggy",
    "rating": 5.0,
    "comment": "Very good game, lots of nice combinations and a sense of progress. There are a bit too many options for me to wrap my mind around. I can see how this is a nice challenge for others.",
    "timestamp": 1722549600
  },
  {
    "username": "Citery",
    "rating": 5.0,
    "comment": "It's pacing is good and player strategies can be fairly divergent, but it's a little too similar to Rosenburg's other farming-based resource shufflers to justify a place in a collection. The vehicles and buildings aren't enough of a departure from the formula to make this feel distinct, and those other games scale well enough to two players as it is. It's also a little silly that a game designed specifically for two players didn't make an effort to have its action board and building tableau easily readable from either side of the table.",
    "timestamp": 1722031200
  },
  {
    "username": "colb425",
    "rating": 5.0,
    "comment": "I am pretty split on this game. It's mechanisms are so fun to explore, but after 2-3 plays you realize it is nothing but an intricate puzzle. There is almost no interaction and based on the beginning game state there is a most efficient move. AI could solve every game state. This isn't what board games are about to me. But it is fascinating, just not my taste.",
    "timestamp": 1721772000
  },
  {
    "username": "jonesy792",
    "rating": 5.0,
    "comment": "There wasn't a lot of variability here for a game of its weight and it felt far too open in terms of arc and decision-space. Contrasts strongly with Agricola, which I rate much higher (see my review and rating)",
    "timestamp": 1721253600
  },
  {
    "username": "hcmacro",
    "rating": 6.0,
    "comment": "I was skeptical at first and remained so for much of the game. But it is indeed a great two player game despite the dry subject matter.\n\nI do, however, have decent knowledge of agricultural advances during the Dutch Golden Age. Fans of this game should read The First Modern Economy by Jan de Vries—-Frisia extends into the Netherlands. Nowadays we might take the pastoral activities of this game for granted, but the 17th century saw considerable technological advances in land reclamation and dairy production.\n\nA Plano Box made setup and tear down seamless.\n\n...I just don't like these kinds of games anymore.",
    "timestamp": 1760479200
  },
  {
    "username": "Neeby",
    "rating": 6.0,
    "comment": "decent two player",
    "timestamp": 1759615200
  },
  {
    "username": "Killi",
    "rating": 6.0,
    "comment": "I am a big Uwe fan but this one didn't click with me. Must play at least one more time.",
    "timestamp": 1756504800
  },
  {
    "username": "aresil",
    "rating": 6.0,
    "comment": "tts solo 99vp upgrade a lot, buildings",
    "timestamp": 1752530400
  },
  {
    "username": "willbeplayin",
    "rating": 6.0,
    "comment": "Compared to other Uwe games, this one gets bested by Feast for Odin and Ora et Labora but it's better than Agricola and Nusfjord.\n\nI don't understand the 3.90/5 weight rating, this is not that complicated of a game.",
    "timestamp": 1751839200
  },
  {
    "username": "shawnmackay1593",
    "rating": 6.0,
    "comment": "Another Rosenberg that doesn't quite do it for me. Not bad by any means but just enough turns spent in the early game to feed my people that it took a few rounds to become interesting. That being said, fans of Rosenberg's other big games should enjoy this as well.",
    "timestamp": 1751320800
  },
  {
    "username": "dunedragn",
    "rating": 6.0,
    "comment": "8.5",
    "timestamp": 1740697200
  },
  {
    "username": "warlock000",
    "rating": 6.0,
    "comment": "A well-designed, demanding game, but it's way too \"sandboxy\" for my taste. This is a game for players who like to experiment with new strategies and exploit the game engine to its extreme. You are still restricted by only four actions per round, but you can do whatever you like for the entire game and hope that it gives you enough points to beat the other guy.\n\n/update, February 2025: I've played it again many years later and it stays at 6/10 - it just lacks fun factor, tension and focus that would drive my actions. It's a solid design, no doubt, but after 9 plays I know it will never be a game I truly enjoy. There aren't any memorable moments here.",
    "timestamp": 1739228400
  },
  {
    "username": "dirtyfighting",
    "rating": 6.0,
    "comment": "22. 5. 2021 - 1990,- Kč z bazaru Zatrolených her\n\n17.5.2024 - prodej za 1525 Kč",
    "timestamp": 1728079200
  },
  {
    "username": "Spockolowski",
    "rating": 6.0,
    "comment": "It's a beautiful looking game, with lots of interesting decisions and a large amount of replayability, though it's just a little to heavy for me. The brain really burns during the game, which is not my main reason for gaming these days.\n\nNusfjord (another Uwe creation) is a similar type of game that doesn't have the variety of decisions, which for me ends up being much more enjoyable. A strong recommendation for anyone who feels the same way about the heavy Rosenburg games.",
    "timestamp": 1721858400
  },
  {
    "username": "xenon219",
    "rating": 6.0,
    "comment": "Ok, too much of a puzzle over sandbox.",
    "timestamp": 1719180000
  },
  {
    "username": "TrevorJr26",
    "rating": 6.0,
    "comment": "Played once. It's another big Uwe. Being 2 player only is interesting, but means it goes quite quickly. I liked the alternating summer and winter with their own action spaces. Not much more to say. I enjoyed it but nothing really stood out to me, would play again for sure.",
    "timestamp": 1716933600
  },
  {
    "username": "Lgb-JohnDoe",
    "rating": 7.0,
    "comment": "Signed by the designer.",
    "timestamp": 1762124400
  },
  {
    "username": "danielmleitao",
    "rating": 7.0,
    "comment": "Rated: 08/2018\nEdited: -",
    "timestamp": 1761256800
  },
  {
    "username": "Strewth78",
    "rating": 7.1,
    "comment": "3.6",
    "timestamp": 1757628000
  },
  {
    "username": "Zete",
    "rating": 7.0,
    "comment": "I enjoyed this but I’d rather play Kanal or Glass road.",
    "timestamp": 1757282400
  },
  {
    "username": "ousgg",
    "rating": 6.5,
    "comment": "Rather more effort than the payoff warrants, but like all of Rosenberg's 'agriculture' games it is surprisingly more-ish.",
    "timestamp": 1754776800
  },
  {
    "username": "Katabrok",
    "rating": 7.0,
    "comment": "The game really shines at 2 players, the solo game is not that engaging. Said that, the game is a sandbox farm game where you optimize stuff and everything give you points. The mechanic of selecting an action from the other season (and that defining the first player) creates some great options. Feeding is more like a flavour than a boring obligation. And, overall, the game is good vibes most of the times. The zero luck aspect makes me wonder about the replayability though.",
    "timestamp": 1754258400
  },
  {
    "username": "clam16",
    "rating": 8.3,
    "comment": "60–120 Min\nPlaying Time\nWeight: 3.88 / 5\n\n\nEconomic\nFarming\nIndustry / Manufacturing\nSandbox\n\nTable hog\n\nHEAVY STRATEGIC GAME\n2 players - ideal\n\n\nAUS\n2021",
    "timestamp": 1762642320
  },
  {
    "username": "halfchickenhalfsteak",
    "rating": 8.0,
    "comment": "(11/25) Loving this game more and more. Always a fan of open information and the amount of paths in the sandbox makes it a blast. It’s really not as heavy as it looks!",
    "timestamp": 1761951600
  },
  {
    "username": "Solar Cleric",
    "rating": 7.5,
    "comment": "Its a solid game. Tough choices, tight game play elements. Definitely a keeper. I would rate it higher if it wasn't for the massive setup and take down time. This thing is a table hog.",
    "timestamp": 1760565600
  },
  {
    "username": "mjrobertson",
    "rating": 8.0,
    "comment": "This possibly might not be an evergreen keeper, as even with all of its variety I have broadly seen all that it offers. Even some of the best games are not forever. Base game and the Tea and Trade expansion.",
    "timestamp": 1760306400
  },
  {
    "username": "mondauge",
    "rating": 8.0,
    "comment": "Chewy worker placement for two. Increasing proficiency at the different actions is very interesting.",
    "timestamp": 1759442400
  },
  {
    "username": "DaMaHa",
    "rating": 7.5,
    "comment": "➤ 1-2 (Solo, Best: 2)\n➤ 60-120 (Set-Up: 10, Teach: 15)\n➤ 3.85 (Heavy)\nTAGS: Euro/Strategy, WorkerPlacement",
    "timestamp": 1759356000
  },
  {
    "username": "ditterio",
    "rating": 9.0,
    "comment": "Solo topscore: 110 points",
    "timestamp": 1762297200
  },
  {
    "username": "Napattack",
    "rating": 8.8,
    "comment": "3.85\n1-2\nBest at 2\n120 (720)\n#66",
    "timestamp": 1762124400
  },
  {
    "username": "ScotchYeti",
    "rating": 9.0,
    "comment": "Preliminary rating of 9. I was afraid that \"Arle\" is too similar to Uwe's other games, but this is not the case. It has a different flow and comes with the depth that I love in solo games. Learning curve is short and steep, fortunately the iconography is excellent including symbols that make setting up the game faster.\n\nI see why people describe the game as a big \"puzzle\". You can however follow multiple strategies to earn points and the different buildings create a new puzzle every time. For me it works, I don't need more randomness.\n\nHow does the solo play compare to Uwe's other games in my collection?\n- Hallertau is the tactical game where you try to make most out of the available cards. The strategy is more or less the same (push the community center and score with point cards) but it's always fun to play.\n- Nusfjord is a simpler worker placement game on a smaller scale that plays faster than Arle but still provides a satisfying optimization puzzle. It comes with much more buildings and the goal is to find a good combination to score high. \"Best\" buildings are only revealed in the second half.\n- Odin is more thematic, more open, requires more engine building, has this huge tile puzzle element. Long setup and teardown times. When played competitively I think there are \"only\" ~5 strategies. Great table presence, so many worker spots, always a joy to play.\n- Oranienburger Kanal is an optimization puzzle where it's important how to place your buildings, when to activate them and how often. It flows surprisingly well with quick turns. More tactical because buildings are slowly revealed over the rounds, which limits your strategic options. The resource wheel is interesting.\n\n===== Update Nov 2025 =====\nThis is a confimed 9, even better with the expansion that greatly opens up the decision space because you can use tea to temporarily make an action more efficient.",
    "timestamp": 1762038000
  },
  {
    "username": "Marman01",
    "rating": 9.0,
    "comment": "Inclusief:\n- Advent Calender Expansion\n- 1e uitbreiding Tea&Trade (Duits)\n- 63 uitgeprinte Reisdoelen",
    "timestamp": 1761519600
  },
  {
    "username": "m4rvell0us",
    "rating": 9.0,
    "comment": "Niby dopiero po jednej rozgrywce, ale od razu się zakochaliśmy w tej grze z Moniką. Uwe chyba wraca na nasze radary zakupowe",
    "timestamp": 1761519600
  },
  {
    "username": "thefatcyclist",
    "rating": 8.5,
    "comment": "***V-3",
    "timestamp": 1759874400
  },
  {
    "username": "clintonjeffrey",
    "rating": 10.0,
    "comment": "Perfect. Gives you the feeling of having a lot of work to do and not quite enough time to do it all.",
    "timestamp": 1761951600
  },
  {
    "username": "normhyde",
    "rating": 10.0,
    "comment": "Great 2 player game!!",
    "timestamp": 1761692400
  },
  {
    "username": "larrydurbin",
    "rating": 10.0,
    "comment": "Rosenberg's best. The scope of this , 2p only , game puts it in a very limited category. There just isn't any other 2p only euro games of this size , out there. If your gaming is primarily at two , this is a wonderful exercise. Familiar Rosenberg feel with worker placement and farming theme. It's a sand box affair , so you have to choose your direction. You just can't do it all. So many worker placement spots to choose from and you can jump seasons once , if you're willing to lose 1st player. The sandbox nature gives this game a ton of replayability. Beautiful publishing adds to the world Rosenberg is presenting. In our top 10 two player board games of all time and top 20 board games of all time. Sold Feast for Odin , Lehavre, Ora et Labora, Gates of Loyang , Agricola , Caverna , and Nusfjord and kept Fields of Arle!",
    "timestamp": 1759528800
  },
  {
    "username": "Asphodele",
    "rating": 9.5,
    "comment": "+ expansion\nSolo",
    "timestamp": 1759528800
  },
  {
    "username": "Esskeau",
    "rating": 10.0,
    "comment": "Best viewed as a sandbox game with a lot to discover.\n\nMy first and only 10.\n\nIf you're expecting the harsh, stark challenges of Agricola, this is not it. Feeding your farmers is never really a problem, and you'll be able to construct a myriad of things. You'll be able to explore a wide variety of ways to succeed as there are so many different ways to score.\n\nGame play is joyous and relaxing, and it's one of my absolute favorites hampered only by what a massive table hog it is.\n\nFirst play I floundered and invested in too many different small things too late and scored pretty poorly. Second play I went all in on fabrics and leather/wool, scored a decent 97 and discovered how neat the peat boat is. Next time I think I'll go more flax & fields. There's a lot to mess around with and I look forward to doing just that!",
    "timestamp": 1759356000
  },
  {
    "username": "bundeskater",
    "rating": 10.0,
    "comment": "Ich liebe die thematische Umsetzung.",
    "timestamp": 1756332000
  }
]