[
  {
    "username": "Scifi66",
    "rating": 1.0,
    "comment": "Horrible, would give it a 0. Absolutely bored throughout. You could read a book whilst you played. Given this is in the BGG top 100 I'm clearly shouting at clouds.\n–Massive downtime\n–As dice/guests are taken by other players means no need to pay any attention to what is happening until your turn\nxRandom luck of the draw for guests/dice\n–Weird restriction on resources, only 3 dice trigger for resources and two goods are further restricted. Guest market can freeze as a result.\n–MPS",
    "timestamp": 1750975200
  },
  {
    "username": "ultimoratio",
    "rating": 1.0,
    "comment": "Yet another soulless Euro",
    "timestamp": 1739142000
  },
  {
    "username": "cotomel",
    "rating": 1.0,
    "comment": "Great experiment of \"How many times can we rehash the same mechanics in an uninteractive mps?\"",
    "timestamp": 1732748400
  },
  {
    "username": "Bnl88888",
    "rating": 1.0,
    "comment": "Pathetic idea of hotel mgt",
    "timestamp": 1705186800
  },
  {
    "username": "Jobul_is_happy",
    "rating": 1.0,
    "comment": "my favorite",
    "timestamp": 1675033200
  },
  {
    "username": "Pro_player",
    "rating": 1.0,
    "comment": "Boring,\n\nDull and AP prone... It's unplayable at 4 players.\n\nThe mechanics are okay, but too random for such a long and complex game.\n\nOverpriced as well. You got barely $30-$40 worth of money in the box, but they sell it $70 retail, what a joke.\n\nPass !",
    "timestamp": 1449270000
  },
  {
    "username": "gokhan1735",
    "rating": 2.0,
    "comment": "The rules were counterintuitive and complicated. I am not entirely sure I understand the theme either. You have to pay money to serve your guests, and then they get to stay in one of your rooms... I don't really understand how the emperor points/tiles fits the theme either. There is also practically no player interaction. There are way more fun games at the same level complexity.",
    "timestamp": 1746309600
  },
  {
    "username": "vikingcode",
    "rating": 2.0,
    "comment": "I've played a few of Luciani's hit games now - Barrage, Tzolkin and Marco Polo 1 are all favourites - and a few from his common collaborators like Turczi and Tascini, and this would rank as the least fun. While there are some interesting parts - all of us had one \"good\" turn - it simply wasn't fun. Player interaction is non existent, and even watching other players turns is pointless as it doesn't really effect you or your plans, so you just have to.. wait.\n\nLorenzo il Magnifico, released just one year later shares so much of the DNA of Grand Austria Hotel, but actually lets you have more than one good turn that its hard to imagine any situation I'd rather play GAH over anything else.\n\nI have heard that its best at one or two players (!), is tolerable at three and to avoid at four. Our one game at four would agree with that, but if player counts like 3 and 4 are bad, that's just a bad design.\n\nAnd all that is before discussing the RNG. Some staff are incredibly powerful and don't always have a cost that reflects that and some are just straight up better. Get a band hand/draw? Well, there is no mitigation in this game. Being able to hire only one per turn, from your precious 14 turns, means that the less good staff cards that are cheap can't be quickly put into play to compensate for their lack of 'power'.\n\nGuests cards may often get 'stuck' as nobody has the ability to take/clear their boards due to unfavorable dice rolls leading to resources being too scarce. Nothing like the entire table passing to try and roll better.\n\nTo recap, constant RNG with no mitigation, huge down time with no player interaction, and game play that just isn't fun.",
    "timestamp": 1745791200
  },
  {
    "username": "kareds",
    "rating": 2.0,
    "comment": "Nothing exciting about this. I’d rather do something else.",
    "timestamp": 1743544800
  },
  {
    "username": "lou_mein",
    "rating": 2.0,
    "comment": "Dumb baby game",
    "timestamp": 1726783200
  },
  {
    "username": "vejrum",
    "rating": 2.0,
    "comment": "Just yet another resource conversion Euro rehashing mechanisms from other games.\n\nExtremely annoying, pointless Emperor track which constantly interrupts the actual game - like a boss constantly poking you and demanding three-hour long status meetings every morning and afternoon to analyse why you have not finished your work, yet.\n\nAlso effectively broken player boards as one player happened to have completely overlapping goals scoring double for achieving a single goal (and if he had happened to start with one of my initial staff cards he could effectively have scored triple).",
    "timestamp": 1724450400
  },
  {
    "username": "Joaof",
    "rating": 2.0,
    "comment": "played once in a 4 player game.\none of the worst boardgaming experiences of my life.\n\nseeing everyone else giving out high scores I believe my opinion would change with lower player count.\n\nProbably 3/2 players is the only way one can realistically play this.",
    "timestamp": 1703113200
  },
  {
    "username": "GuySamstag",
    "rating": 3.0,
    "comment": "The only enjoyment I get from these types of games is really just to see how decently the theme is pasted on.",
    "timestamp": 1755986400
  },
  {
    "username": "ali98",
    "rating": 3.0,
    "comment": "I prefer Lorenzo and Marco Polo, the graphics and card designs are not beautiful.",
    "timestamp": 1753221600
  },
  {
    "username": "Eliya84",
    "rating": 3.0,
    "comment": "Only onetime played. Crap dice placement mechanisum. Downtime between the tile 1 and 6 ist to high.",
    "timestamp": 1749852000
  },
  {
    "username": "quietcorn",
    "rating": 3.0,
    "comment": "This is a game about running a hotel. Dice get rolled at the start of each round and players get four chances to remove a die and resolve an action that corresponds to the number, with a strength of action equal to the number of dice that were there before you took one. The game works well enough, but it felt like the flip luck was a little too high in terms of which employee cards you get, and which color of customers are available on your turn. There's also a frustrating turn order mechanism where the turn order sort of snakes. With 2 players, the order goes player 1, 2, 2, 1. With four, it's 1,2,3,4,4,3,2,1. This turn order system seems to be different for differences sake because all it really adds is downtime.\n\nAnother issue is what you are essentially doing in the game is taking customers, building rooms in colors that match your customers, and then supplying those customers with cubes that match their requirements so they complete the rooms. All this is done with incredibly few actions. The puzzle is ok, but aside from the flipluck issues and the turn order issue, the game lets you take a customer every turn if you have room for one, but the ability to build rooms is dependent on dice being rolled into the right number. This seems like an issue since it can make for a luck driven bottleneck in the game's core mechanism. This is especially annoying since the game punishes you at the end for having unfulfilled customers.",
    "timestamp": 1718920800
  },
  {
    "username": "asfhgwt",
    "rating": 3.0,
    "comment": "A prototypical \"kitchen sink\" game, as in \"everything but.\" Lots of cards with symbols to keep looking up. No fun factor or flow. Tons of bonus calculations. Dragged on and on with four players, too. For ultra-serious gamers only. Never again for me.",
    "timestamp": 1696370400
  },
  {
    "username": "jibibgg",
    "rating": 3.0,
    "comment": "More of the same from Simone Luciani et al, I like the attempt at theming but I think the contract fulfilment/reward combo-ing is done better in The Voyages of Marco Polo - also no asymmetric player powers (in the base game at least) which I am very fond of.\n\nUPDATE: Sold because I really think it's a bit tooooo tight with the actions and I don't enjoy the extra consideration of guests to room colours - one too many restrictions IMO.\n\nAlso this game has the least control over the dice than any other of the italian dice drafting games mentioned.\n\nI don't think this is a bad game, it's just there are other games, by the same designers no less, that I find more fun, and so I'll likely never return to this.",
    "timestamp": 1684533600
  },
  {
    "username": "orange",
    "rating": 4.0,
    "comment": "A game with strategic goals, but very heavy on tactics. The hotel guest card drafting here is from an open display of five cards in a row, and you are allowed to draw one (you need to pay if you don't want the first two in the row), and a replacement card appears(drawn) at the expensive end of the row. This is a really random mechanic, I usually dislike games that feature it, since it can happen that you need a certain color, that is not displayed, then one card appears in the right color, but the person in turn order in front of you will take it, so you need to wait quite a few turns. In a game with only 14 turns it is a serious random element. The dice throw, that determines what actions and in what strength would be available for the next two turns is slightly better, but also random, but I could live with that. Also a rethrow with fewer dice could be available if you are willing to be last. Otherwise the game is not complicated with only 5 different main actions to select from and meshes its elements together well. 2 player game was less than 2 hours. I would not play this with 3 or 4, since there is significant downtime.",
    "timestamp": 1758924000
  },
  {
    "username": "CMagex",
    "rating": 4.0,
    "comment": "-potentially spring for the KS + expansion (maybe buy from someone who bought the KS, seems too expensive)\n\n#38",
    "timestamp": 1755813600
  },
  {
    "username": "geoffder",
    "rating": 4.0,
    "comment": "Modern euro with no meaningful interaction, as any attempt at blocking is likely to do more damage to yourself if you are sacrificing anything that you need to optimize your points to accomplish it. It felt heavier / more complex than Castles of Burgundy to me, which isn't good since simplicity is the main thing that can save non-interactive point-salad euros for me. At it plays pretty quickly though.",
    "timestamp": 1747778400
  },
  {
    "username": "shawnmackay1593",
    "rating": 4.0,
    "comment": "Based on only one play and I likely will give it one more try. But that first game was brutal and not even close to fun.",
    "timestamp": 1747000800
  },
  {
    "username": "meuxy",
    "rating": 3.5,
    "comment": "A very confusing resource management point collector. Clarity 1000% needs improvement. The game borrows simple dice roll gameplay elements and has a similar playout vibe to Yahtzee. Feels very overly complicated for a simple concept in pattern matching and resource management. Best feature is the many many dies that are rolled. The game only has 14 actions and each player can only do one action per die taken, but it takes absurdly long for only having 14 total moves.",
    "timestamp": 1743976800
  },
  {
    "username": "Betote",
    "rating": 4.0,
    "comment": "Reseña en español en El dado de Jack:\nhttps://eldadodejack.com/2016/12/01/gran-hotel-austria-cubit...",
    "timestamp": 1740006000
  },
  {
    "username": "btasam",
    "rating": 5.0,
    "comment": "Grand Austria Hotel invites aspiring hoteliers to a plethora of suboptimal decisions that can blossom into chain reactions of accommodation. When it comes to hotels, you have to be able to do it all and that means that things can only go wrong.\n\nAt first glance, Grand Austria Hotel uses a very clever system of drafting actions of strength depending on the # of dice in the location. Gameplay is limited by the interconnected requirements of each subsystem and much of the complexity resides in what's available, how it can be used, and the bloated cross-referencing in between. Needless to say, it's a fairly punishing experience with convoluted cost requirements and a visiting emperor handing out game-ending penalties certainly doesn't help.\n\nUPDATE: After a couple more plays, we've had enough of Grand Austria Hotel. My spouse loathes the unnecessarily complex design and the constantly stunted satisfaction of actually doing anything. Grand Austria Hotel fails to deliver an experience of running a great hotel, but elicits the feeling of being a stressed hotel manager if that's your thing. Overall, Grand Austria Hotel is fine, not great and definitely not memorable. The rulebook requires constant double checking even after multiple plays and I'm not sure how necessary it was to have the snake-draft, which kills this games approachability.",
    "timestamp": 1759874400
  },
  {
    "username": "Lowengrin",
    "rating": 5.0,
    "comment": "Grand Austria Hotel has too much randomness. The dice, of course, are one source. But then there are two decks of cards: the Guests and the Employees. Some of the randomness is removed from the former because six are face up for selection, but the latter all come off the top of the deck. Drafting at the start of the game does mitigate this somewhat. Nevertheless, it all adds up to make Grand Austria Hotel a very tactical game with a good measure of luck.",
    "timestamp": 1759701600
  },
  {
    "username": "jonesy792",
    "rating": 5.0,
    "comment": "My typical grievances with this genre apply here, namely the distinct lack of player interaction and dense iconography. The game also lacks elegance with stodgy tracks and layers that I think makes the game take a little more than it gives. I found the dice placement onerous with fiddly resource conversion.\n\nThe game as a whole just felt a little bit too unapproachable and convoluted. It did not play as smoothly as I would have liked. Contrast with Lorenzo Il Magnífico and especially Castle of Burgundy, which are much better experiences.",
    "timestamp": 1755640800
  },
  {
    "username": "Zaungast",
    "rating": 5.0,
    "comment": "Iconography strudel.",
    "timestamp": 1740870000
  },
  {
    "username": "taksw222",
    "rating": 5.0,
    "comment": "Please Stop Snake Drafting.",
    "timestamp": 1738969200
  },
  {
    "username": "heathbarATL",
    "rating": 5.0,
    "comment": "A nice game design, but I don't really want to play it again. It feels like work. The randomness of cards and dice doesn't seem appropriate for a very tight economy.",
    "timestamp": 1736809200
  },
  {
    "username": "tolhs",
    "rating": 5.1,
    "comment": "2024:+1",
    "timestamp": 1733958000
  },
  {
    "username": "staszek",
    "rating": 5.0,
    "comment": "Essen 2015",
    "timestamp": 1730156400
  },
  {
    "username": "Ddyraw",
    "rating": 5.0,
    "comment": "Boring, uninspired, rude waitstaff",
    "timestamp": 1729980000
  },
  {
    "username": "shammois",
    "rating": 5.0,
    "comment": "This was a slow, meandering and theme-devoid experience where I can see that some familiarity would both speed things up and make the game more rewarding. But it's never going to breezy, or tell a story, or generate any moments of levity. Interaction between players is at most inadvertent and largely absent. It's an urban safari for puzzlers around a retail park of cog factories, connection suppliers and chain-making boutiques. Grand Austria Hotel makes me think I should go back and mark down every medium-to-heavy euro I ever played, because my tastes are so far from this now. It was nice to sit down with people I like, of course, but for this kind of abstracted undertaking 3 hours is far longer than I want to spend doing it.",
    "timestamp": 1729461600
  },
  {
    "username": "langschnabel",
    "rating": 5.0,
    "comment": "Initial Rating after the first play. It has nice elements and i like the dice drafting. Theme is nice, but Artwork and symbols are sometimes a bit crowded. It is funny to get some chain plays running, but doesn´t offer that much of a fun, that i want to play it again. It is a good alternative on yucata, if we want to play something online in the medium heaviness category like CoB or Wingspan.",
    "timestamp": 1725573600
  },
  {
    "username": "StyxParadox",
    "rating": 5.0,
    "comment": "Interest based on Essen",
    "timestamp": 1724882400
  },
  {
    "username": "shib71",
    "rating": 6.0,
    "comment": "A pleasant euro, solidly in my wheelhouse in terms of complexity and interesting choices. But the I found the theme and presentation ... fine. Ultimately this game was unmemorable.",
    "timestamp": 1761865200
  },
  {
    "username": "SJS1971",
    "rating": 6.0,
    "comment": "An inventive game with a unique dice drafting mechanism.",
    "timestamp": 1760306400
  },
  {
    "username": "dougfoolery",
    "rating": 6.0,
    "comment": "Dice drafting game with the theme of feeding and housing guests in your hotel. The number of dice determines the strength of each action, so you will have to change up your tactics around the dice roll, as well as the shenanigans of your opponents. With only 14 turns to juggle a myriad of demands, the game is very punishing and any wasted actions will put you out of contention. You have to be on the constant lookout for opportunities to chain your actions and finding these combos from your card play is key to navigating the tight puzzle. It is a stressful game that is not for everyone.\n\nIconography in this game is abysmal. We find ourselves having to refer to the rulebook all the time, lengthening what is already a game with significant downtime, especially at higher player count.",
    "timestamp": 1753048800
  },
  {
    "username": "aresil",
    "rating": 6.0,
    "comment": "2p",
    "timestamp": 1752530400
  },
  {
    "username": "beerwah2000",
    "rating": 6.0,
    "comment": "The game's theme didn't convince me. The emperor's favour doesn't fit into the flow of the game at all.\nI thought it might be to hard for me, but enjoyed Underwater Cities the same weekend very much.",
    "timestamp": 1747778400
  },
  {
    "username": "speter22",
    "rating": 6.0,
    "comment": "Base game is a pretty average euro that gets a slight bump due to quick rules explanation & quick playtime.",
    "timestamp": 1746655200
  },
  {
    "username": "maritn",
    "rating": 6.0,
    "comment": "Not interactive. At least theme comes through, kind of.",
    "timestamp": 1746568800
  },
  {
    "username": "Desigual",
    "rating": 6.0,
    "comment": "Solid eurogame to 2 player games.\n\nbest with 2",
    "timestamp": 1740351600
  },
  {
    "username": "ABigOleBoat",
    "rating": 6.0,
    "comment": "Not a game I'm ever particularly interested to play - the same designers have much better offerings if you enjoy this style of Euro.",
    "timestamp": 1739055600
  },
  {
    "username": "Acpudman",
    "rating": 6.0,
    "comment": "The two times I’ve played since I got the game has been very dull.... money was very hard to come by and always lack of food and drink dice to take. In the two games I’ve played I was pretty much passing pretty much every other round\n\nIf you get it be prepared to look in the instructions every time you want to know what every card does...and then make sure your tablet on BGG ready to explain the instructions of those cards",
    "timestamp": 1738623600
  },
  {
    "username": "ncc1701jv",
    "rating": 6.0,
    "comment": "Interesting but it just didn't personally click.",
    "timestamp": 1738450800
  },
  {
    "username": "tomdabom98",
    "rating": 6.0,
    "comment": "This is a great game at two players, a little longer at three and a little too long for my taste at four players. I think the kitchen hand is OP so i normally remove it from the game but otherwise a great game that replaced Castles of Burgundy for me\n\nEDIT July 2023:\nStill like this game better than Castles of Burgundy, but overall it seems to overstay its welcome somewhat and is a bit too simple for my taste. I haven't tried it with the expansions which i would definitely be willing to one day. I mostly play this game on TTS and I do not own the game IRL. I would play it if someone owns it, but i don't feel its good enough for me to own.\n\ndown graded to 6/10",
    "timestamp": 1735858800
  },
  {
    "username": "tobytoast",
    "rating": 7.0,
    "comment": "Dice placement, wine, strudel, emperors – what’s not to like? Hard to crack the 75 point \"looped the score track\" marker. I've no idea how anyone would get close to 150 points – beginning to think it was a joke to see if people would try...",
    "timestamp": 1761343200
  },
  {
    "username": "lorex888",
    "rating": 7.0,
    "comment": "Sold (2019 Glass Die Sell/Swap)",
    "timestamp": 1760997600
  },
  {
    "username": "juleshawthorne",
    "rating": 7.0,
    "comment": "no thank u",
    "timestamp": 1760911200
  },
  {
    "username": "toinen",
    "rating": 7.0,
    "comment": "two player game only for me. The randomness of the guest cards can be really annoying",
    "timestamp": 1760479200
  },
  {
    "username": "dtmoney75",
    "rating": 7.0,
    "comment": "3 Plays\n\nExpansions: Lets Waltz!\n\nPlayed at: 2 & 4",
    "timestamp": 1759701600
  },
  {
    "username": "MissP1ggy",
    "rating": 7.0,
    "comment": "Great strategy game. Charming theme. Challenging to combo resources, staff, guest, room patterns. Lots to love and explore! Dutch summary: https://boardgamegeek.com/filepage/213680",
    "timestamp": 1759442400
  },
  {
    "username": "ditterio",
    "rating": 8.0,
    "comment": "Solo:\n\nhttp://bilboatbagend.com/grand-austria-hotel-ai.html\n\nhttps://boardgamegeek.com/thread/1636035/solo-play-simplifie...\n\nhttps://boardgamegeek.com/thread/1490836/solo-play\n\nhttps://boardgamegeek.com/thread/1750721/solo-variant\n\nhttps://boardgamegeek.com/thread/1520880/grand-austria-hotel...\n\nSolo Helper: https://brdgm.me/grand-austria-hotel/#/ (je kan dit ook solo spelen zonder de uitbreiding)\n\nYou can play solo without the expansion, the bot from the expansion is very similar to the one from mautoma.com",
    "timestamp": 1762297200
  },
  {
    "username": "bukke2",
    "rating": 8.2,
    "comment": "A heavy dice and card drafting game with lots of variability and a very nice setting. But don´t be fooled: Strangling shortages and bad luck with cards or dice may drive you mad. Gameplay is more tactical than strategic.\nUnnecessary: The Emperor Scoring after round 3, 5 and 7 is really needless, boring and can be very punishing (Players will not recover from these losses). This ugly mechanism celebrated resurrection in \"Lorenzo il Magnifico\" by the same authors (Vatican Report/ Excommunication). In \"Grand Austria Hotel\" it can be even more punishing.\nNevertheless, the quirky thematic embedding to host and accomodate a horde of guests saves the day and makes \"Grand Austria Hotel\" a very pleasant game. You will need several games to control your gameplay. With \"Let´s Waltz!\"-expansion modules (Celebrities, Unique Hotels) it´s great!\nGood rulebook and components. About 30 min. per player. Best with 2 players.",
    "timestamp": 1762124400
  },
  {
    "username": "les_",
    "rating": 8.0,
    "comment": "House rule to reduce luck: Sort the staff cards into two decks, regular and end game scoring. During setup, deal 1 end game scoring card to each player and draft 5 regular cards. Throughout the game, players have the choice to draw from either the regular or the end game scoring decks.",
    "timestamp": 1762038000
  },
  {
    "username": "SergeBabiychuk",
    "rating": 8.0,
    "comment": "=== Perfect Combination of Weight and Simplicity ==> https://youtu.be/BWpM9Dw3lZI",
    "timestamp": 1761778800
  },
  {
    "username": "grzechoo104",
    "rating": 7.5,
    "comment": "Clever, although very abstract euro. I've enjoyed it, but out of all dice placements, I slightly prefer e.g. Lorenzo il Magnifico.",
    "timestamp": 1761778800
  },
  {
    "username": "Tomono",
    "rating": 8.0,
    "comment": "Amazing fun complex puzzle with dice draft and card combos!I sometimes feel there is luck depending on cards I got,but I'm big fun of this.",
    "timestamp": 1761606000
  },
  {
    "username": "BBCarlo",
    "rating": 9.0,
    "comment": "Love the combos you can pull off in this one, very satisfying.\nMany different choices and adaptations to be made - drafting of guests, adapting to the dice rolls and completing rows/sets of hotel rooms.\nVery thematic and would always play this one if asked.",
    "timestamp": 1762620660
  },
  {
    "username": "CotB",
    "rating": 9.0,
    "comment": "Rankings\n8th Best Game 2019\n4th Best Game 2020\n8th Best Game 2021\n11th Best Game 2022\n17th Best Game 2023\n17th Best Game 2024\n13th Best Game 2025",
    "timestamp": 1762606560
  },
  {
    "username": "Matteocascio",
    "rating": 9.0,
    "comment": "stupendo gioco di draft di dadi molto difficle da masterare ma con poche regole.",
    "timestamp": 1761778800
  },
  {
    "username": "el_ultimo",
    "rating": 9.0,
    "comment": "Comprado en 2022 (MAYO) Alfonso C.\nComprado en 2023 (SEPTIEMBRE Expansión)",
    "timestamp": 1761170400
  },
  {
    "username": "rebeljonny",
    "rating": 9.0,
    "comment": "Last played October 2025",
    "timestamp": 1760824800
  },
  {
    "username": "geoffpaulsen",
    "rating": 9.0,
    "comment": "This is a great game. Really enjoy it. Almost always want to play it.\nIconography is sometimes a bit confusing, but the rules refer to much of it.",
    "timestamp": 1760652000
  },
  {
    "username": "lsconanren",
    "rating": 10.0,
    "comment": "excellent game ！",
    "timestamp": 1762470000
  },
  {
    "username": "SaraCV",
    "rating": 10.0,
    "comment": "Love this game! Perfect length, perfect complexity, reasonable amount of variability with the cards and dice to force tactical play. Can't wait to play this again!\n\nMy rating hasn't changed after 25 plays, though I don't think I would ever play this with 4 players again. Happy to play anytime with 2 or 3 players though!",
    "timestamp": 1761951600
  },
  {
    "username": "SoMi713",
    "rating": 10.0,
    "comment": "Nagyon jóleső kombókat lehet csinálni ebben a játékban. Ez a lelke. A kidobott kockák akcióival a nagyszerű kombókat készítjük elő. Eközben figyelünk rá, hogy melyik vendéget választjuk, hol készítünk elő szobákat, hová szállásoljuk el a vendégeket (mindezt helyzettől függően külböző áron és hatással), és Ferencjóskával is próbálunk barátkozni változó jutalmakért, változó célokat elérni, mindezt a érdekes személyzet segítségével. És mindez agyeldobós kombókat eredményez! A stratégia-taktika arány az utóbbi felé billen. Esetenként agyégető tud lenni (jó módon).\nA kedvenc kombózós játékom!\n\nYou can do very satisfying combos in this game. That's the soul of it. With the throwed dice's actions you prepare the great combos. All the while, you're paying attention to which guest to choose, where to prepare rooms, where to put guests up (all at different prices and effects depending on the situation), and you're also trying to befriend Franz Joseph for varying rewards, as well as achieving goals, all with the help of interesting staff. And these lead to mindblowing combos! The strategy-tactics ratio leans towards the latter. It can be occasionally brain-burning (in a good way).\nMy favourite combo-building game!",
    "timestamp": 1761606000
  },
  {
    "username": "m4rvell0us",
    "rating": 10.0,
    "comment": "Świetne klasyczne euro. Zawsze chętnie do niego usiądę. Nie ma co się rozpisywać. Nigdy chyba nie trafi na sprzedaż.",
    "timestamp": 1761519600
  },
  {
    "username": "hockeyjones",
    "rating": 9.6,
    "comment": "23\n\nLast played in 2018",
    "timestamp": 1761343200
  },
  {
    "username": "el_crosso",
    "rating": 9.7,
    "comment": "Just a solid euro with a fun sauce dripped over it. Meeting peoples demands, hire the right staff and fill those rooms as smart as possible. Great with 2, but less enjoyable with more players. A little too much downtime.",
    "timestamp": 1761084000
  }
]