[
  {
    "username": "zmartianov",
    "rating": 1.0,
    "comment": "It promotes conquest and conflict among different ethnic groups",
    "timestamp": 1754604000
  },
  {
    "username": "Floating World",
    "rating": 1.0,
    "comment": "New editions should not be ranked",
    "timestamp": 1754172000
  },
  {
    "username": "lpcheng",
    "rating": 1.0,
    "comment": "Too much randomness built in with insufficient ways to mitigate bad tile draws, bad die rolls, etc. I can see why some love this game, but I'm more of a heavy Euro gamer, and if I want a game heavy with luck, I prefer something to go all out with thematic play and play Nemesis instead.",
    "timestamp": 1726610400
  },
  {
    "username": "Scifi66",
    "rating": 1.0,
    "comment": "Did they fix the tile exploration aspect? No\nDid they fix combat bag VP randomness? No\nDid they fix random aliens? No\nDid they fix exploration tokens? No\nSee 1E description.",
    "timestamp": 1724796000
  },
  {
    "username": "kienzle",
    "rating": 1.0,
    "comment": "Shameless cash grab by a one-hit wonder.",
    "timestamp": 1700866800
  },
  {
    "username": "Snacky22",
    "rating": 1.0,
    "comment": "I give it a 1 because it has a fatal design error, and it is essential for the game, the energy tiles are stolen by the first player, so you need to be the first player and have that tile appear on your turn, otherwise you will never improve your ships, because they need energy",
    "timestamp": 1697407200
  },
  {
    "username": "firemage85",
    "rating": 1.0,
    "comment": "This game is more of an activity rather than a game. If rolling dice for 2-3 hours is your jam, Monopoly and Risk are cheaper buys.",
    "timestamp": 1678402800
  },
  {
    "username": "buderix80",
    "rating": 2.0,
    "comment": "I thought: Finally the game that I was looking for to replace TI. Faster, danisier, better. But it's also too swingy. Out for sale.",
    "timestamp": 1754517600
  },
  {
    "username": "bazyliszek10000",
    "rating": 2.0,
    "comment": "The game is boring, nothing happens for a long time. Too much randomness here. You may be the only person with uncomfortable planets around you and those bones. Considering that we prepare the entire game for the last and usually only fight, throwing a bucket of dice doesn't really appeal to me. The extensive development system compared to other features of this game does not excite me enough to make me want to spend more time with it.",
    "timestamp": 1739314800
  },
  {
    "username": "Johan_Kriki",
    "rating": 2.0,
    "comment": "Odio las mecánicas (mención especial para el conio de los disquitos de influencia), lo desequilibrado que es todo en cuanto a losetas de sector o losetas de descubrimiento, lo demencial que es poder gestionar los recursos como uno quiere, la arbitrariedad de las tecnologías y lo aplastantemente decisivo que puede ser el orden de turno para ese aspecto....\n\nEn cuanto pierdas un par de sectores y produzcas una birria de todo, no remontas ni harto de vino.\n\nNo sé, no le he visto la gracia en ningún momento.\n\nEDITO: dice un compañero de la partida que leyó aquí en BGG que Eclipse es bastante como tratar de lidiar con una mano de cartas que se te da al principio, de tratar de hacerlo lo mejor posible con esas cartas; puede ser, pero para mí que le faltan mecanismos para lidiar con los déficits que uno pueda tener, o las ventajas (brutales) que otros jugadores puedan sacar simplemente a través de la exploración.\n\nEjemplos: mientras entre mis sectores apenas había 2 planetas marrones, otros no sólo producían a tope, sino que se encontraron así como con 12 recursos de material en 2 exploraciones; no sólo eso, además, así como quien no quiere la cosa, con un anillo orbital GRA-TIS; o sea, mientras uno (yo) tuvo que investigar la correspondiente tecnología, y construirlos (construí dos), otro obtuvo uno por el morro, sin hacer nada... no lo veo normal; pero es que otro compañero obtuvo dos PIEZAS (no tecnologías, no: piezas directamente) muy buenas, y que directamente pudo añadir a sus naves así como si nada; mientras tanto, los demás nos las veíamos y deseábamos para investigar las tecnologías de armamento correspondientes, e incorporarlas a sus naves\n\nPorque esa es otra (e importante): obtener mediante la exploración una pieza de nave súper chetada te permite con una sola acción (explorar) lo que a otros les cuesta a lo mejor esperar una ronda (para tener ciencia suficiente y poder investigar), y mínimo dos acciones (investigar y mejorar la nave); igual que lo del anillo orbital \"encontrado\", que es aún peor: te ahorras dos acciones (investigar, construir) y además el material...\n\nPero es que el desnivel entre las losetas que a unos y a otros les salían, fue tremendo.\n\nPor no hablar del descacharrante sistema de la bolsa de fichas de reputación/puntos cuando se resuelve un combate: resulta que en uno que gané en el que aplasté a mi rival y saqué 5 fichas... ¡las 5 eran de 1 punto! \"Es que ya se ha ido combatiendo y sacando las fichas buenas\", me decían. Que no entendía eso, me decían. Claro que lo entiendo, pero me parece un sistema mierder, qué queréis que os diga.\n\nEl manejo de los recursos, de los discos de influencia y demás, me parece también un dolor de cabeza innecesario, no sé. Dependes de lo que te salga, vale. ¡Pero es que no hay forma de paliarlo!\n\nY el sistema de losetas de tecnología, y no poder investigar más que lo que hay disponible, me parece otro elemento demencial: en la primera ronda salieron dos losetas de la dichosa bomba de neutrones. ¿Qué pasa? Que de los tres primeros, dos pillaron esa tecnología. ¿Que tú no la puedes investigar? Ah, pues te jo...s. Es la importancia del orden de turno... Ya, pero es que era la primera ronda, dime tú dónde está la gracia \n\nOtro detalle: para producir algo más de material, intercambié embajadores con mis dos vecinos, muy bien; pero en cuanto me atacaron, pam, como hay que devolverlos, iba a volver a producir poquísimo material.\n\nY otro: no me gusta nada la mecánica del movimiento, que tus naves se queden bloqueadas simplemente porque haya otras de otro jugador (no dan alternativa salvo pegarse), y que las batallas sean hasta que quede uno en pie... ¡con lo que cuesta construir cualquier nave un poco decente! Salvo que te encuentres una de chiripa, claro, que también les ocurrió a otros compañeros, mira qué bien \n\nEn fin, donde se ponga un Clash of Cultures...\n\nDicen que el Forbidden Stars palia en gran medida los defectos de este. Tengo ganas de probarlo",
    "timestamp": 1722895200
  },
  {
    "username": "Gethar",
    "rating": 2.0,
    "comment": "I've never had such dreadful time for such a long time in any other game.",
    "timestamp": 1714255200
  },
  {
    "username": "SuSaBoi",
    "rating": 2.0,
    "comment": "This explains everything:\nhttps://boardgamegeek.com/thread/2881079/eclipse-space-4x-ga...",
    "timestamp": 1681596000
  },
  {
    "username": "LeeKenshin",
    "rating": 2.0,
    "comment": "For a euro game, you can get rather hosed from the initial exploration draws and dice. I rather play something with less randomness, if it's going to take 3+ hours, like TI4.",
    "timestamp": 1668726000
  },
  {
    "username": "RedGallus",
    "rating": 2.0,
    "comment": "One of the worst game I've played.",
    "timestamp": 1653170400
  },
  {
    "username": "ultimoratio",
    "rating": 3.0,
    "comment": "These long-duration games are just so boring now that I am accustomed to playing 18xx (and Through the Ages). This game and TI4 feels so shallow.",
    "timestamp": 1757887200
  },
  {
    "username": "ChaosFarseer",
    "rating": 3.0,
    "comment": "Eclipse _extremely_ did not work for me or my group. Which was a darn shame; the reviews were incredibly strong! It's not as fast as one would hope, and you can spend large fractions of the game simply not interacting with other players. The idea of ship customization is cool, but you don't actually get the arms race or counter-ship-building experience that I personally hoped for. You instead generally gradually upgrade your ships to be a little better. Without a compelling reward or pressure to regularly battle, you instead get in a fight one day and suddenly discover your ships are too weak, and then feel like you lost the game.\n\nI dunno. I really want to see this ship building idea work out in a game, but I think it needs a completely different structure to encourage a space of ship iteration.",
    "timestamp": 1748642400
  },
  {
    "username": "rekath16",
    "rating": 3.0,
    "comment": "I didnt like this game at all.\n\n*collection of Falko Mexiko",
    "timestamp": 1744927200
  },
  {
    "username": "TharsisRoverPets",
    "rating": 3.0,
    "comment": "I want to like this game so much, I fantasize about creating a fan edition of this. I really love customizing ships.\n\nI just have too many issues with the game: negative snowballing, early player elimination, and faction design.",
    "timestamp": 1743976800
  },
  {
    "username": "Radip",
    "rating": 3.0,
    "comment": "I had today the first Eclipse game. I had high hopes as I love TI4. In the first exploration phases I encountered a 1 enemy and 2 enemies tile and 1 grey planet tile, 1 brown planet tile and 1 tile with pink slot and gold locked slot. I had problems with cash and other players got tokens with 8 gold while I got a tile with guns I had to assign to my starbase slot. I was screwed with cash for start.\nI built 1 interceptor, 2 cruisers and 2 drednoughts which Than send in 2 waves 1 int + 1 cru + 1 dre to fight ONE ancients basic ship. This one ship destroyed my 6 ships (with ion cannon upgrades) sent in two waves. I was so behind everyone else and wasted 3 whole rounds for this production. I asked in turn 4 if I won't spoil the game by quitting and after confirmation it would not, I used the 2 actions to remove the 4 disks from the systems and thus ending the game for me.\nMaybe such a scenario is not very common (maybe 1 in 20 games) but the rng killed the fun for me and got me very frustrated. I won't probably play this game again due to one of the worst gameboard experiences I had and I will stay with my TI4.",
    "timestamp": 1743289200
  },
  {
    "username": "BoredBeast",
    "rating": 3.0,
    "comment": "Highly disappointed in this over-hyped management fest of a game. The luck in this game is disappointing, as poor dice rolls will totally remove any amount of build-up or planning, and can wipe you out of the running in one fell swoop. Wanted to like it, but Voidfall is vastly superior to this mediocre game that somehow landed in the Top 100...twice.",
    "timestamp": 1733094000
  },
  {
    "username": "running_on_games",
    "rating": 3.0,
    "comment": "Same issues as the original version. Dice roll for such a game ruins it for me. I would have been more open for this randomness if this games was about 1.5 hours shorter.",
    "timestamp": 1732662000
  },
  {
    "username": "kendallgrubbs",
    "rating": 4.0,
    "comment": "There’s some potential on the board, but the tech tree upgrade process is just way too much for a dice chucker. It’s just over produced blandness that has swallowed up the majority of gamers these days.",
    "timestamp": 1758751200
  },
  {
    "username": "hawk127",
    "rating": 4.0,
    "comment": "have the original... while this edition does make it more accessible, the play is still the same. I enjoy it for a bit, but it overstays its welcome by a lot. towards the end of the game, it takes forever to get back around to you, and is just a slog.",
    "timestamp": 1738537200
  },
  {
    "username": "djsturz",
    "rating": 4.0,
    "comment": "Long space game with dice, did not feel like a \"euro\" space game as many describe it to be.",
    "timestamp": 1736204400
  },
  {
    "username": "Swampy Troll",
    "rating": 4.0,
    "comment": "I am shocked by the score of this game. I've been playing strategy games for 15 years now and this is, by far, the highest variance game of them all. It looks cool, has some great ideas (ship upgrades) but has so many design flaws that it all boils down to tiresome, 4 hours long RNG fiesta.",
    "timestamp": 1735254000
  },
  {
    "username": "theCrabbyDice",
    "rating": 4.0,
    "comment": "There is waaaaay to much luck in the exploration (and free cruisers and combat)\nU can be eliminated in a 4 to 6 hour game soley in the fact that ur planets around u starting point suck",
    "timestamp": 1723068000
  },
  {
    "username": "TheWizardTower",
    "rating": 4.0,
    "comment": "A lot of promise, here. I love-love-love the idea of upgradeable ship blueprints, it's a lot more fine-grained than I see in other 4X games, except maybe Space Empires 4X.\n\nI also like that the economics matter, a lot, and you have this push-pull between doing more in early phases vs saving for later actions later in the game.\n\nBut, there's very little to push players into fighting OR negotiating with each other. TI has a whole phase of the game solely for arguing with the other players, which I really appreciate, and Dune has all kinds of backstab-y negotiations laced throughout the game. Eclipse winds up feeling a lot more like wingspan (it is basically an engine builder at heart, with a space-empire theme) and a lot less like a political negotiation game like TI or Dune.\n\nAnother thing I really missed was background lore. Dune obviously has an enormous leg up here, but even TI has some very clearly communicated tropes behind each faction. These dudes are super into trading, those weirdos are all about backstabby fascism, this group of fish are super good at research and getting advanced technology. Nobody will say that the lore of TI is sublime fiction reading, but almost every component is pulling you into the story of the game, what's happened in the past, what is currently playing out on the board. Even if it's mostly trope-heavy, but it gives players a ton of hooks to grab onto to turn \"hey, can you move your dreadnaught to this hex\" into \"The Emirates of Hacan formally request you to assist our resistance of the occupation of our sovereign territory at Quann.\"\n\nIt isn't going to win a Hugo, but damn if it doesn't make the games feel 100 times richer and more alive.\n\nThere's fantastic ideas here, it just needs a few extra somethings.",
    "timestamp": 1717365600
  },
  {
    "username": "hiimjosh",
    "rating": 4.0,
    "comment": "See comments for first edition",
    "timestamp": 1703804400
  },
  {
    "username": "Boreira",
    "rating": 5.0,
    "comment": "Bardzo bym chciał żeby ta gra była epicką naparzanką w kosmosie, galaktyczną interakcją z wieloma elementami strategii, taktyki, negocjacji, ALE NIE JEST. Przez 80% czasu gry trwa bezkonfliktowa indywidualna optymalizacja zasobów, a pozostałe 20% to pojedyncze rundy, w których w końcu dochodzi do walki. Mechaniki ekonomiczne w Eclipse mają sens, poziom losowości mi nie przeszkadza tylko no właśnie zgadzam się z opiniami, że to jest gra dla wielbicieli gier euro, którzy przez kilka godzin chcą budować swoją planszetkę, zbierać kafelki i być może wygrać grę bez znaczącej interakcji z innymi. Gdyby wyciągnąć taką esencję z całej rozgrywki z tego co faktycznie wydarzyło się pomiędzy graczami, poziom interakcji, dyskusji, zwrotów akcji i ciężkość decyzji to dla mnie są to może dwie rundy gry w Pax Renaissance, Pax Pamir lub Roota i te gry polecam. Opinia po 6 partiach w skłądzie 3-5 osób.",
    "timestamp": 1762124400
  },
  {
    "username": "hyde_70s",
    "rating": 5.0,
    "comment": "Slow, uninspiring, deprived of any spark which defines a great game. Could have been done as a game of card and tokens... like Race for the galaxy? But then it wouldn't cost as much, cover all of the table and last for 5 hours, right? Yes, but this has combat... in which you endlessly roll dice hoping to utilize upgrades of your ships. And the sad thing is, this tacked on randomness is even more dull than deterministic rest of a game which sells itself as a 'space opera'. I was always afraid to try Twilight Imperium, but after this I think I'm not going to be. If this was any other game I would give it a 6, as it is ok. But, because of it's production and place in board game pantheon, for me it becomes something I just don't wish to return to.",
    "timestamp": 1760824800
  },
  {
    "username": "basadani",
    "rating": 5.0,
    "comment": "Weird beast of a game, is my impression after a gladly abandoned half-finished game. So many neat rules that serve to replicate the feeling of playing a computer game space 4x, a genre I love. However, it misses out on a crucial aspect of the computer games: being able to just reload if you are randomly put in the worst place in the galaxy. Here, you'd have to suffer through the game, seeing how you lag behind, for 3-6 hours. Compared to this input randomness at the beginning, accepting the chance of the combat dice is no problem.\n\nStill, it must be nice to be the player who lucked out at the beggining, and be able to build up a nice empire, so I'd be temped to try it again.\n\nIf I owned the game, I'd either sell it immediately, or try to house-rule the setup (probably by stacking the balance of the 3rd level exploration tiles before a game, making sure good and bad tiles are somehow distributed evenly around the table, or by adding some cost to the really exterme exploration-technology tiles, whatever they are called). This way, I'm just glad someone tought it, and I experienced enough of it to loose the urge to ever wanting to buy it.",
    "timestamp": 1753653600
  },
  {
    "username": "sykano",
    "rating": 5.1,
    "comment": "a more euro-style 4X space game\nless theme and negotiation than TI\nmore euro-style strategy stuff (cube pushing)\nand a bit shorter playing time\nsecond edition seems improved, mainly the trays/boards\ngame content as KS exclusives is bad\nonly 6 alien races (plus humans)\nonly a few ships (only 2 dreadnoughts and only 4 cruisers per player)\nship miniatures don't look good, except maybe the neutral ones\nextremely expensive\n\nbalancing issues\nrunaway leader problem ?\nreplayability could be better\n\nIt feels that there are some things missing in this game, like better ways to control your resource economy and to alter the normal curve you randomly get from the explored system tiles.\n\nPlaying only a limited number of rounds is often unsatisfying.",
    "timestamp": 1753567200
  },
  {
    "username": "mi_de",
    "rating": 5.0,
    "comment": "Euro snoozer.",
    "timestamp": 1753308000
  },
  {
    "username": "Wrecktangled",
    "rating": 5.0,
    "comment": "I was so excited for this. I love the ship building aspect of the game, but so much of the rest felt disappointing. Its a long game and there is a lot of luck thrown in. I don’t t typically have strong feelings against luck, but at this length it feels even worse to get hosed by some randomness. The exploration also was a bit of a let down. Perhaps I'm being too critical due to it length, but that I do feel the length exacerbated my feelings.",
    "timestamp": 1751925600
  },
  {
    "username": "dr.morton",
    "rating": 5.0,
    "comment": "No second edition was needed.",
    "timestamp": 1747692000
  },
  {
    "username": "Falko Mexiko",
    "rating": 5.0,
    "comment": "Das Basisspiel ist sehr unbefriedigend. Man zerstört die zentrale Raumstation, wird dafür aber kaum belohnt. Viele Aktionen wirken sinnlos (z.B. will man irgendwann nicht mehr erkunden, da die Unterhaltskosten steigen durch das Legen der Einflussscheiben, und man dann für Rohstoffe, die es auch noch nur am Ende einer Runde gibt, wieder Einflusscheiben benutzen muss was abermals die Unterhaltskosten steigen lassen) Das Glück/Pech in den Kämpfen ist auch sehr oft frustrierend. Ich bin sehr enttäucht.",
    "timestamp": 1744927200
  },
  {
    "username": "jayyfgd",
    "rating": 5.0,
    "comment": "too big, expensive, great otherwise",
    "timestamp": 1743458400
  },
  {
    "username": "HealthyGamingNetwork",
    "rating": 5.0,
    "comment": "Just play T.I. 4",
    "timestamp": 1743202800
  },
  {
    "username": "ncc1701jv",
    "rating": 5.0,
    "comment": "Fun, and had I played this before playing Twilight Imperium I might be much more interested than I am, but TI trumps by a lot.",
    "timestamp": 1738450800
  },
  {
    "username": "F9SSS",
    "rating": 5.0,
    "comment": "Too much random for such game.",
    "timestamp": 1736290800
  },
  {
    "username": "VaultBoy",
    "rating": 5.0,
    "comment": "Good, but feels longer than it really needs to be. I likely wouldn't play it again with 6.",
    "timestamp": 1736204400
  },
  {
    "username": "bobbudowniczy",
    "rating": 5.0,
    "comment": "Too little change over 1st edition to justify the purchase.\nFine product for new owners, but lack of upgrade kit for owners of 1st edition is just a terrible move, that forces me to avoid Lautapelit.fi products in the future. Twilight did it better.",
    "timestamp": 1723672800
  },
  {
    "username": "quietcorn",
    "rating": 6.0,
    "comment": "Eclipse was one my favorite games in 2012. This second edition seems like a general improvement on things, although maybe it doesn't totally resolve the situation where one player can luck into incredibly powerful cannon blueprints early on and throw off the balance. The great innovation of this game was that it was like a 4x game and euro game combination, which in 2012 felt really revolutionary. At this point, I think I'd lean more towards Scythe for that feeling. Again, this isn't bad, I'm just a very different gamer now than I was in 2012 when this would have been a knock out of the park.",
    "timestamp": 1762297200
  },
  {
    "username": "joachimRyu",
    "rating": 6.0,
    "comment": "Before the dice even hit the table, the exploration phase already feels like RNGesus is targeting me personally. One unlucky event and my whole game turns into a solo tragedy while everyone else is having a blast!",
    "timestamp": 1758578400
  },
  {
    "username": "hairysoup",
    "rating": 6.0,
    "comment": "A lot of interesting and fun mechanics going on here with an incredible production value- itt feels on the precipice of something incredible, but the premise falls short largely due to RNG.\n\nIt wouldn't be so bad if it were a shorter game, but if you have bad luck in the beginning with your exploration tiles you simply slog through hours of unexciting gameplay just crawling along with minimal payoff while your friends get to have all the fun and optimize their fleet.\n\nExploration is random, combat dice randomness (yes, there's programming, but if you get a bad roll or a really good one you can still swing the favour of the game, as losing is quite punishing), upgrade selection randomness (no guarantees of what you will be able to build in the future and if it works with your goals), reward tiles are random (again back to exploration, really).\n\nYou could try to argue it's more of a tactile than a strategic game, but even then the heaviness of the random factors can remove even your tactile response options.\n\nA bit too much luck for my liking, and if I wanted an area control game determined by luck I would ultimately play something much shorter.",
    "timestamp": 1758405600
  },
  {
    "username": "SenseiZen",
    "rating": 6.0,
    "comment": "Rankad 18 overall, rankad 15 strategi, varje klass har sin svaghet, svårt för förlorande spelare att påverka vem som vinner, potential snowball, revised and upgraded version of the board game eclipse from 2011, 1-4 timmar spel, komplicerat om man inte spelat ett liknande spel förut troligtvis",
    "timestamp": 1755295200
  },
  {
    "username": "Diinasty",
    "rating": 6.0,
    "comment": "Good game, just not for me. Definitely more fun than other games in this genre.",
    "timestamp": 1753912800
  },
  {
    "username": "SirMarmight",
    "rating": 6.0,
    "comment": "1 Jul 2025:\nI've now had the pleasure of playing Arcs × The Blighted Reach Expansion heaps, whilst finally plummeting into the TI4 Gravity Rift. The yearn to Eclipse has been evaporated by far brighter tabletop supernovas.\n\n24 Jan 2024:\nA 2024 note to self... it's time to trash heap my arbitrary \"must reach X plays before rating & commenting on BGG\" mantra, as realistically the majority of what's tabled won't even break that elusive X. Eclipse: SDftG being an eXcellent example of this, first played back in Dec 2021 vs play number two being only the start of this year!\n\nEXperienced as one part Terran Union tranquilly triple tech tracking in the outer sector, & one part Orion Hegemony hungering for the galactic center with rift cannons flaring. So far has provided nine eXemplary hours squeezed by its influence disc action system & phases cramping towards an inevitable player interaction crescendo.\n\nI've barely rummaged in the 4X tabletop space, meaning personal comparisons don't go further than piXels currently. Now? I have less eXcuses.",
    "timestamp": 1751320800
  },
  {
    "username": "_Dynomite_",
    "rating": 6.0,
    "comment": "Cool for what it is",
    "timestamp": 1749592800
  },
  {
    "username": "Doublelift",
    "rating": 6.0,
    "comment": "The game has a wide variety of elements that work well together. For me the battles are just too long, complicated and random.",
    "timestamp": 1749160800
  },
  {
    "username": "Hinmatt",
    "rating": 6.0,
    "comment": "Epic space game that is shorter than comparable space games.\nYou can actually explore space tiles. They are flipped over when you move on them. Cool tech tree that enables everyone to equip their ships individually.\nThere are a few things I don't like as well:\n- the movement rules that allow ships in many cases to move trough tiles occupied by enemy ships\n- the point system which awards points to both winner and loser of a battle and by luck of the draw the loser could even get more points than the winner\n- neutral ships on the board that everyone can fight to get rewards which leads to engaging with other players rather late in the game\n\nOn the one hand it's good that the game is a shorter epic space game. On the other hand it feels like it ends too soon because it takes a while to build and update your ships and research other technology.\nI am on the fence about this game. It has too many issues for me to really like it.",
    "timestamp": 1748815200
  },
  {
    "username": "UndutifulCarrot",
    "rating": 6.0,
    "comment": "I enjoyed this game well enough, but the combat system does it dirty - roll dice until someone loses really clashes with the complexity of the other parts of the game. I'd play again, but nothing I need to own",
    "timestamp": 1745100000
  },
  {
    "username": "Cobra262",
    "rating": 6.0,
    "comment": "the ship customisation is fun but completely negated by the incredible high luck factor.",
    "timestamp": 1744495200
  },
  {
    "username": "orangecat17",
    "rating": 6.0,
    "comment": "I don't think 4x games are for me. Big sandbox experience. I am not keen on space themes and unfortunately, the gameplay didn't save this one for me. It's a very good design, just not for me.",
    "timestamp": 1742943600
  },
  {
    "username": "Chipperton",
    "rating": 6.0,
    "comment": "I understand the appeal, but I find this game's pace to be dreadful at times. I don't even want to do combat half the time because I don't want to spend two minutes of me and my opponent rolling two dice over and over until one of us gets the few hits we need.\n\nGoing to go into this next time planning to do things a bit different. Maybe that will change my take.",
    "timestamp": 1742598000
  },
  {
    "username": "Arkaine107",
    "rating": 6.0,
    "comment": "Good production. It is fun to upgrade ships, handle faction economy, but overall game balance is bad.",
    "timestamp": 1741302000
  },
  {
    "username": "MonKeYK1nG",
    "rating": 7.0,
    "comment": "I love asymmetric games that include a surprise factor in battles. The modification of your ships is a modification of your chances when rolling dices.\nYou should be aware that especially in the beginning you might have dice rolls with a low chance that decide a lot so luck is always a factor ... but you can play hundreds of sessions and then statistics should be on your side ;-)",
    "timestamp": 1762595640
  },
  {
    "username": "Zhod",
    "rating": 7.0,
    "comment": "6p",
    "timestamp": 1761343200
  },
  {
    "username": "lewelen",
    "rating": 7.0,
    "comment": "Turtling: the game",
    "timestamp": 1759874400
  },
  {
    "username": "BarFightBill",
    "rating": 7.0,
    "comment": "Best: 3-6\nOwner: Adam N\nWeekend game",
    "timestamp": 1759615200
  },
  {
    "username": "Bempa24",
    "rating": 7.0,
    "comment": "Great 4x",
    "timestamp": 1759269600
  },
  {
    "username": "FaytParkour",
    "rating": 7.0,
    "comment": "Good game! Looking forward to playing it again! 5-player took about 4 hours, though",
    "timestamp": 1758232800
  },
  {
    "username": "Moosetoo",
    "rating": 7.0,
    "comment": "4+ plays",
    "timestamp": 1756591200
  },
  {
    "username": "skytostar",
    "rating": 7.5,
    "comment": "When you feel like playing 4x game, this will be a good choice!!",
    "timestamp": 1762570320
  },
  {
    "username": "dj_koen",
    "rating": 8.0,
    "comment": "This game is pretty great but i always end with the game feeling that i didnt get to do anything\n\nThe exploration always gets maxxed out before anything happens and then the game ends without anything happening\n\nThe economy is also way too restricted with just planets making the orbitals nexessary to give player choice which is bad design imo\n\nImo the game would be better if all of the tier 1 and tier 2 planets had an extra white space so you could make choices without having to rely on orbitals and tier 3 exploration spam to get your economy going",
    "timestamp": 1762038000
  },
  {
    "username": "VikingBurger",
    "rating": 8.0,
    "comment": "Nagyon jó kis 4x euro elemekkel.\nA hajók fejlesztése parádé, a felfedezés izgalmas, a harc átlátható.\nA növekvő birodalom egyre nehezebb fenntartásának modellezése zseniális.\nSajnos a lore lehetne jobb, így azért száraz.\nRövidebb TI pótléknak lett véve, annak nem megfelelő, de saját jogán remek játék.\nA második kiadás insertje nélkül lehet nem venném a fáradtságot, hogy felpakoljam.",
    "timestamp": 1761606000
  },
  {
    "username": "thankyou4notsmoking",
    "rating": 8.0,
    "comment": "+Remnants of Worlds Afar\n+Turn Order Variant\n+Warped Universe\n+Galactic Events",
    "timestamp": 1761429600
  },
  {
    "username": "JentPlays",
    "rating": 8.0,
    "comment": "First game took 9 hours (including learning rules) but I wasn't really bored once, I don't think. Very fun game, there are a few tiny changes I would make to make things a little smoother or clearer, but overall it's really good.",
    "timestamp": 1760997600
  },
  {
    "username": "logopolys",
    "rating": 8.0,
    "comment": "War Game\n Science Fiction Game\n\nA decade ago, I owned, played several times, and traded away a copy of Eclipse (1st ed). There were things that I really liked about the game at the time. I really liked how costs and benefits were tracked by revealing new numbers similar to Through the Ages. Building your own ship blueprints was fantastic. The tech tree was streamlined into a series of logical discounts that let you jump ahead at a cost or progress naturally. The different factions offered a wide variety of play styles, including the human factions, which weren't just dismissed as the \"vanilla\" choice but had actual advantages over the more alien factions. I'm pleased to say that all of these things that I liked about the first edition are preserved or improved on in Second Dawn.\n\nUnfortunately, the issues that I had with the first edition that caused me to trade it away persisted in Second Dawn. First, the absolute swing in different map and discovery tiles is absurdly broad. I enjoy randomness in games, but usually randomness has a chance to flatten out so that no single player is overly advantaged. I've never found this to be the case in Eclipse. While Second Dawn improves exploration by not requiring an influence tile to be placed to claim the discovery tiles, that doesn't change the wide imbalance in what the map tile will offer (especially in terms of Ancients) and separately what the discovery tiles have to offer. I understand that eXploration is a critical part of the 4X formula, but this aspect of Eclipse has always felt underdeveloped to me.\n\nSecond, I've never been a fan of combat systems that are fulled open-ended in terms of when the combat ends. I like combat that runs through one round of dice rolling, like Nexus Ops or one round of card drawing like Warrior Knights or Runewars. Combat that continues without guarantee of progress or change of game state for round upon round like in Eclipse or Twilight Imperium really doesn't sit well with me. This is definitely a bittersweet pill with Eclipse, because the combat also relies so much on those blueprints that are so fun to create.\n\nI'm not against playing again, but this still isn't a game I would readily seek out still, especially with so many other 3X/4X games I've had more fun with.",
    "timestamp": 1760652000
  },
  {
    "username": "Tyiliyra",
    "rating": 7.5,
    "comment": "main collection, wrap",
    "timestamp": 1760652000
  },
  {
    "username": "AndyInJapan",
    "rating": 9.0,
    "comment": "Includes:\n- Official double-sided game mat\n- custom Discovery Tile Bag\n- custom acrylic Discovery Tokens",
    "timestamp": 1762038000
  },
  {
    "username": "Evertore",
    "rating": 9.0,
    "comment": "BGG tbp",
    "timestamp": 1761429600
  },
  {
    "username": "Imsevimse",
    "rating": 9.0,
    "comment": "My favorite 4X game has it all. It’s euro-esque in style, boasting a brilliant action economy. The real star, however, is probably the highly customizable ships. Each faction offers a distinct playstyle, ensuring there’s something for everyone. It plays remarkably smoothly even at high player counts, and the production is off the charts.",
    "timestamp": 1761256800
  },
  {
    "username": "Pelikeisari81",
    "rating": 9.0,
    "comment": "I have played many times",
    "timestamp": 1761084000
  },
  {
    "username": "ItsMagic",
    "rating": 8.7,
    "comment": "unlocking spreading combining convincing surprising fantastical stealing deductive collecting tactile;\nA Game of Thrones: The Board Game favoured;\nfavoured over Twilight Imperium?, Xia?",
    "timestamp": 1760824800
  },
  {
    "username": "KSSK34",
    "rating": 9.0,
    "comment": "Compétitif\n60-200 min\n3-6 joueurs",
    "timestamp": 1760652000
  },
  {
    "username": "Vinnyvinvinvinvin",
    "rating": 9.0,
    "comment": "Didn't realize how much I could like a 4X game but here we are lol. I thought that the amount of figurines was an indicator that the game wouldn't be as balanced as it should be given the kickstarter horror stories I've heard, but honestly? This delivered! Not only did I feel like I was playing with toys like a kid again, but I also felt the joys of strategical depth like an adult, for lack of better words. The 8 rounds keep the game snappy, I like the push your luck(?) element of how any actions you can take per round, and the research and ship upgrade systems are delightful, and this was only at a player count of 2! Definitely going to bring it to the table more, though understandably the size of the box is seen as daunting by my friends. The components are very much a double edged sword because of this in my opinion. Can definitely see this go up to a 10",
    "timestamp": 1760392800
  },
  {
    "username": "DubiousCraft",
    "rating": 10.0,
    "comment": "Friend game\n\n4 player game*\n\n6 player game\n\n4X game\n\nLong game",
    "timestamp": 1762682820
  },
  {
    "username": "Sikko",
    "rating": 10.0,
    "comment": "With updated rules still the best 4X space game.",
    "timestamp": 1762297200
  },
  {
    "username": "Eca333",
    "rating": 9.5,
    "comment": "Very fun. I particularly like upgrading my ships.",
    "timestamp": 1761865200
  },
  {
    "username": "Nicephore",
    "rating": 9.5,
    "comment": "Le meilleur 4x que je connais. Beaucoup de possibilités de développement de votre civilisation, 8 rounds vous demande de bien calculer vos actions et place une limite de temps bien appropriée. Sinon, il y a la variante \"home made\" de domination pour en faire un 4 x plus épique encore et certainement plus long. Et à noter la qualité du matériel vraiment top.",
    "timestamp": 1761429600
  },
  {
    "username": "Hori16",
    "rating": 9.9,
    "comment": "Jogo favorito",
    "timestamp": 1761170400
  },
  {
    "username": "thefatcyclist",
    "rating": 9.5,
    "comment": "***VII-2",
    "timestamp": 1760306400
  },
  {
    "username": "yaenz",
    "rating": 10.0,
    "comment": "Eclipse is a grandiose experience, from the first turn to the last.\nThe rich and nuanced interlocking of technologies with tense, yet straightforward and undeterministic combat make every game feel interesting and highly engaging. The dream of mastering the overlaying action economy shapes every play of this masterpiece. The overall production and especially the storage trays deserve an award and are, without a doubt, the best i have ever seen.\nTruly one of the boardgames of all time.",
    "timestamp": 1759960800
  }
]