[
  {
    "username": "tlorow",
    "rating": 1.0,
    "comment": "6.5",
    "timestamp": 1742943600
  },
  {
    "username": "Scifi66",
    "rating": 1.0,
    "comment": "Updated 17/6/19. Space Euro hybrid. Won't play this again. If you want a space combat game checkout Forbidden Stars.\n++ Space taxes / action system is brilliant should be in more games\n+ Building ships with tech tiles is fun\n– Too long 1 game went >5 hours\nxx Early tile draws are too critical, they form the basis for a powerful engine or a hopeless case. Even ditching unattractive tiles results in a loss of action which early game are super tight. Factions who get the right tile draw, can accelerate their engine, close off access to their sector, buy up the right tech and cruise to an uncatchable victory.\nx Introduction of hives makes exploration even more of a high stakes gambit.\n– Dice combat reminds me of risk, one combat went over 10 minutes and I was speed rolling\n– Combat factions can stomp others in the early game - that sucks for the faction being stomped. Especially if their unlucky exploration tile draws couldn't prevent it",
    "timestamp": 1725573600
  },
  {
    "username": "firemage85",
    "rating": 1.0,
    "comment": "A tedious affair. There are so many better games in this category that you could play.",
    "timestamp": 1714600800
  },
  {
    "username": "uduhno",
    "rating": 1.0,
    "comment": "The new eclipse is just much better.",
    "timestamp": 1709506800
  },
  {
    "username": "Shadowthr0ne",
    "rating": 1.0,
    "comment": "get the second edition!",
    "timestamp": 1674514800
  },
  {
    "username": "Juanabis",
    "rating": 1.0,
    "comment": "Fuera del top 100.",
    "timestamp": 1620597600
  },
  {
    "username": "naghiamooli",
    "rating": 1.0,
    "comment": "DO NOT BUY THIS GAME ITS A TRAP\nIt is not what it looks like\n-Exploration is based on luck\n-There is no tech tree\n-These is no depth in terms of engin building or doing something smart,almost all VP you get is for capturing spaces\n-Even VP you get for your battles is based on pure luck and you draw from a bag\n-No diplomacy\n-everybody turtle till the last round and then they attack each other so if you can get some points last round good for you cause no one can take that back from you",
    "timestamp": 1603404000
  },
  {
    "username": "dierenh",
    "rating": 1.0,
    "comment": "Engelse regels in originele opmaak",
    "timestamp": 1581807600
  },
  {
    "username": "ionas",
    "rating": 1.0,
    "comment": "Not even a good economics game... not even that .",
    "timestamp": 1571004000
  },
  {
    "username": "axioms",
    "rating": 1.0,
    "comment": "Incredibly overrated. Economy is a freaking mess (just bump the table once). Exploration is handled extremely poorly. And combat is a tedious chore with all the hit-or-miss randomness. To be fair, technologies and ship design were executed pretty nicely (although it makes no sense why tech tiles must be so random, again).\n\nUnfortunately, that's all it's got going for it. Just a hype train. Yeah, the random factor pretty much kills the enjoyment out of it. And the 13-year-old fanboys drive the final nail on the coffin for me.\n\n(Not to mention it's got some of the ugliest artistic design I've ever seen on a game: both aliens and humans look utterly hideous and unimaginative. And the whole grey-orange-brown-pink palette combination makes it even uglier to look at.)",
    "timestamp": 1521327600
  },
  {
    "username": "Flambeux",
    "rating": 1.0,
    "comment": "Ugly Board & components.\nLong downtime between turns.\nPlay twilight Imperium or Forbidden Stars instead.",
    "timestamp": 1506204000
  },
  {
    "username": "KingCloud0r",
    "rating": 1.0,
    "comment": "Total imbalance.",
    "timestamp": 1489273200
  },
  {
    "username": "bellynice",
    "rating": 1.1,
    "comment": "I'mma hold off on my real rating until I get a game under my belt that involves only experienced players. As of now, my first impression has been, \"Oh my, what tedium. Yaaaaawwwnnn.\" A lot of that has to do with the game taking too. Damn. Long. Plus some whiny and/or annoying opponents. And did someone say \"mega-luck factor?\"\n\n* Oh, whom am I kidding?! I probably won't play this again. Too many other good games to play. True, the \"clearly broken\" part of the \"1\" rating doesn't apply, but it's like that whale on the beach from _Reno 911! Miami_: big and bloated, fascinating to ogle for a while, and then 3-4 hours later, it all explodes, and you're covered in stinky, gooey whale guts. (Then again, the \"you won't catch me dead...\" part may not apply, either, as someone might be compelled for some reason to put my corpse at a table where an Eclipse game is set out...mwahahaaaa.)",
    "timestamp": 1485471600
  },
  {
    "username": "CptPalmer",
    "rating": 1.0,
    "comment": "I just did not like this game. Just felt long and cumbersome to me.",
    "timestamp": 1390863600
  },
  {
    "username": "Gugucia",
    "rating": 1.0,
    "comment": "all game is total random. don't buy it. impossible to teach to newbie. extremely high learning curve. very good to play when really, really drunk though. perfect game for 3am vodka.",
    "timestamp": 1374271200
  },
  {
    "username": "rorshaq",
    "rating": 1.0,
    "comment": "rating after 1 play (4pl) - 4 (5hrs)\n\nboring, annoying, dice laden disappointment. nothing clever or interesting\n\nrating after 2nd play (6pl) -(4hours) -1\n\ni dislike everything about this game - i feel it is excrutiatingly and ineptly designed and i have no idea why it is as liked as it is - play Starcraft instead ^^",
    "timestamp": 1361228400
  },
  {
    "username": "USSRocker",
    "rating": 1.9,
    "comment": "10% of Eurogame\n10% of Ameritrash\n80% of vacuum",
    "timestamp": 1740178800
  },
  {
    "username": "dedbob",
    "rating": 2.0,
    "comment": "Take Twilight Imperium,\nremove strategy of system placement, add luck of random system selection,\nremove strategy of tech development path, add luck of random tech availability,\nremove attractive ship miniatures, add minis that look like they were designed by a 12 year old,\nadd luck of random VP tile draws..\n\nEclipse is shorter? I'd rather play half a game of TI.",
    "timestamp": 1727042400
  },
  {
    "username": "Entropology",
    "rating": 2.0,
    "comment": "Better than TI in a lot of respects, but also has the downsides. Exploring and tile flips are very determinative. Missiles are overpowered. It's the fact they don't take power, so you can build an all missile ship with one tech, where a solid ion gun based ship needs at least 2 and more likely 3-4 techs to be viable. Maybe if you couldn't retreat after the first wave the missile ship would feel more like a risk, but as it is, you get one volley of 10-12 missiles, they get one volley of 3-4 ion guns and you leave. Not sure why they think that isn't overpowered.\n\nRest of it is just too long and too random. Most people check out after 3 hours and that is only 1/2 way. What's the point?",
    "timestamp": 1709593200
  },
  {
    "username": "theromulans",
    "rating": 2.0,
    "comment": "Replaced by the second edition.",
    "timestamp": 1705878000
  },
  {
    "username": "DanFred",
    "rating": 2.0,
    "comment": "Like Twilight Imperium but not as good and I don’t like Twilight Imperium. Feels like a Euro game and feels very abstract. And the game lasts way too long for the supposed fun it delivers.",
    "timestamp": 1685656800
  },
  {
    "username": "PJWagner",
    "rating": 2.0,
    "comment": "Economic, not 4x. Fight me.",
    "timestamp": 1676242800
  },
  {
    "username": "fabriarge",
    "rating": 2.0,
    "comment": "don't play this again.",
    "timestamp": 1637967600
  },
  {
    "username": "Calycaa",
    "rating": 2.0,
    "comment": "I have played twice and won't play again. Too complicated and too long for my taste especially with the mostly random fights.",
    "timestamp": 1607468400
  },
  {
    "username": "neocow",
    "rating": 2.0,
    "comment": "played near release, was truly insanely weighted. take way too long, and basically first 3 games are tutorial, with a long play time.\n\nSame amount of games is needed for anyone playing, or the learned advantage is too high.",
    "timestamp": 1603666800
  },
  {
    "username": "sigtaulefty",
    "rating": 2.0,
    "comment": "set up monster - very complex, not my taste. 2 player is not as good as the other player number choices",
    "timestamp": 1593381600
  },
  {
    "username": "KeeAlvin",
    "rating": 2.0,
    "comment": "2014: Bad bad 4X space game. So bad and random that my hours of playing the game goes down the drain by just dice rolls and random tiles. So damn bad!",
    "timestamp": 1576537200
  },
  {
    "username": "blindside14",
    "rating": 2.0,
    "comment": "I really did not like this game. It's extremely slow. The three plays I have had felt like the longest 3-4 hours of my life. The game had some cool mechanisms but I didnt end of liking the end result of them. The economy felt more punishing than fun, the exploring seemed a bit lucky when a single player gains good tiles while wvwryone else is drawing garbage ones, which wouldnt be so bad if you hadn't paid for them in advance. If you want a good 4x game play Heroes of Land air and sea, it's better. Play Eclipse if you like games that take 3-4 and feel like you did nearly nothing but wish you were playing a good game instead of this outdated game that overstayed its welcome before it was setup. I cannot imagine the people who ranked this game highly did so within the past 3 years. I rated two stars instead of one because the game did have some good mechanisms.",
    "timestamp": 1556229600
  },
  {
    "username": "Derivatus",
    "rating": 2.0,
    "comment": "A mediocre game, but I don't want to play it ever again. It takes six hours to complete and the feeling afterwards is just: why did I do this?",
    "timestamp": 1544310000
  },
  {
    "username": "ExplodingSnail",
    "rating": 2.0,
    "comment": "How is this game so highly rated?!? I love a good 4X game, but this is nothing like a good 4X game. Utter random, unbalanced, ugly nonsense. A gaming disgrace.",
    "timestamp": 1538604000
  },
  {
    "username": "brandysta",
    "rating": 2.0,
    "comment": "Random tile draws here can really make (or break) a player. Very frustrating to get hemmed in while the other players are drawing great tiles to expand into.\n\nNot a bad game, but luck of the draw means an awful lot here.",
    "timestamp": 1524348000
  },
  {
    "username": "mikeo2600",
    "rating": 2.0,
    "comment": "I don't know why this game is so highly ranked. It is deceptive in that it makes you think that there are multiple ways to victory, but, in reality, whoever gets the missile technology wins.",
    "timestamp": 1508796000
  },
  {
    "username": "rekath16",
    "rating": 3.0,
    "comment": "I didnt like this game at all.",
    "timestamp": 1744927200
  },
  {
    "username": "Beastly_Venturer",
    "rating": 3.0,
    "comment": "2 plays. Felt too slow. Took way too long to do anything and the mechanics felt tacked onto the theme. There was also so much luck with the tech coming out as well. Prefer TI3 if I am looking for this sort of itch. Maybe Voidfall will be more interesting.",
    "timestamp": 1738796400
  },
  {
    "username": "CoolBumpty",
    "rating": 3.0,
    "comment": "Gift",
    "timestamp": 1735772400
  },
  {
    "username": "running_on_games",
    "rating": 3.0,
    "comment": "Game mechanics are fun. I like the deep strategy and feel of epic space game! My main problem is inclusion of dice roll randomness for such a long and strategic game. Your best laid plan may go to waste during first couple rounds because of bad roll of a die and then you'll have to try your best for 3 hours or more knowing there's no way you can win. (Happened on multiple occasions to players during our plays). I would have been more open for this randomness if this game was about 1.5 hours shorter. But for such a long game it is a turn-off for me.",
    "timestamp": 1732662000
  },
  {
    "username": "Kalayna",
    "rating": 3.0,
    "comment": "Removing this from my game owned status as it is technically Jason's game.",
    "timestamp": 1723327200
  },
  {
    "username": "marioaguila",
    "rating": 3.0,
    "comment": "Factor suerte en casi todas las acciones disponibles. Viniendo de los 18xx en los últimos meses, resulta intolerable.\nSi te gustan los ameritrash, estarás fascinado, incluso pudiendo decir que tiene toques de eurogame. Le darás un 10 y le subirás artificialmente el ranking acá en BGG.\nPor el contrario si rechazas el factor suerte en juegos largos, si te gustan los económicos sin ese factor, o los euros puros y duros, aléjate.\nLuck factor in almost all available actions. Coming from 18xx in recent months, it is intolerable.\nIf you like ameritrash games, you will be fascinated, you might even say that it has touches of eurogame. You will give it a 10 and artificially boost its ranking here on BGG. On the other hand, if you reject the luck factor in long games, if you like economic games without that factor, or pure and hard euros, stay away.",
    "timestamp": 1714341600
  },
  {
    "username": "qzhdad",
    "rating": 3.0,
    "comment": "rating based on one play. Too much luck of the draw and of the battle dice (although to be fair the latter can be mitigated with upgrades) for the type of game. Lots of nice mechanics, but overall not to my taste.",
    "timestamp": 1704582000
  },
  {
    "username": "dopebones",
    "rating": 3.0,
    "comment": "Perhaps my biggest disappointment ever in a game, I got infected by the hype and was really looking forward to it, then played it and pretty much hated it.",
    "timestamp": 1675897200
  },
  {
    "username": "SaraM99",
    "rating": 3.0,
    "comment": "Too long, Complex set-up. I wanted to kill myself after the first 2 hours",
    "timestamp": 1671058800
  },
  {
    "username": "ultimoratio",
    "rating": 3.0,
    "comment": "The game itself is sublime. Each action is straight forward. The game NEVER felt like it was a drag as there’s always things to do to keep you preoccupied and the last few rounds are still exciting. I love the almost lack of downtime, for a heavy game like this. I love how the map feels tight between the four players, due to the way initial placement works. So it's unlike many games where you start at the edge and you all close in, rather it starts somewhere in the middle. So, you expand outwards if you want to be left alone (but the tiles will be less stellar). I love how fluid the movement feels - none of that plodding malarky on TI4 where your squadrons have to do this slow and plodding island hopping to capture planets. I don’t like that bit of TI4 and it’s just boring and uninteresting. Eclipse is the same the way it does territorial expansion, but it does it quicker. And, of course, I am very impressed at the game duration. The 30mins per player wasn’t that far off as we played 3-3.5 hours in a mostly first timers 4 player game.\n\nWhat sucks is the exploration bit where the tiles are random. I like that it stays true to the 4X experience where you are really exploring the map, similar to Archipelago (unlike a lot 4X-ish games out there) But the tile draw can determine how well the player will do, and I don’t like that. So a few unlucky draws and you'll be lagging behind. And since this is a Euro with no safety nets, it becomes very difficult to catch up.\n\nRandom technology draw is very refreshing, but it is susceptible to turn-order problem if a certain tech is well-sought and you’re last on the turn order simply because the player on your left passed first.",
    "timestamp": 1658613600
  },
  {
    "username": "DrWildcat",
    "rating": 3.0,
    "comment": "Overhyped spreadsheet.",
    "timestamp": 1639954800
  },
  {
    "username": "Mabuchi",
    "rating": 3.0,
    "comment": "The more I play, the more I hate! Very boring experience, it does have some cool aspects to it, but as a whole, its a very bland experience.",
    "timestamp": 1637103600
  },
  {
    "username": "Ravensburg24",
    "rating": 3.0,
    "comment": "Outcompeted by Twilight Imperium 3rd and 4th editions.\n\nI love the idea, but it felt much more like a euro engine-builder than an epic space game which is what I was looking for.",
    "timestamp": 1628460000
  },
  {
    "username": "bazyliszek10000",
    "rating": 3.0,
    "comment": "In this game dice bother me very much, which have a big impact on the gameplay. The game is not so dynamic that I could risk to roll the dice and rebuild after a reasonable time. There is more fight between no-man ships than between players. By the contents of the box you can guess how small the fleet is here.",
    "timestamp": 1616022000
  },
  {
    "username": "Lauri_boa",
    "rating": 3.0,
    "comment": "Too much micromanagement. King-making problems. It's like going to work, giving everything and not getting rewarded because your boss does not like you.",
    "timestamp": 1615417200
  },
  {
    "username": "Joel_L",
    "rating": 3.0,
    "comment": "Long game (4+ hours) with effective player-elimination if you play poorly or are unlucky. No thanks. I believe the game is good if you put the time in, but I'm not willing to waste another minute on it.",
    "timestamp": 1611529200
  },
  {
    "username": "Zete",
    "rating": 4.0,
    "comment": "After many plays I’ve come to the conclusion that it is not that good. Star Trek: Ascendancy is vastly better and more engaging.\n\nPurged",
    "timestamp": 1757282400
  },
  {
    "username": "federik21",
    "rating": 4.0,
    "comment": "2 votes less than 2 edition: 1 for art and ergonomics, 1 for balance.",
    "timestamp": 1740438000
  },
  {
    "username": "Cooley2112",
    "rating": 4.0,
    "comment": "The whole missile platform with targeting computers ruins the game.\nNeeded some kind of point defense or flak rule for all ships.",
    "timestamp": 1737068400
  },
  {
    "username": "muzrobertson",
    "rating": 3.5,
    "comment": "I need to play this more.",
    "timestamp": 1736463600
  },
  {
    "username": "opks22",
    "rating": 4.0,
    "comment": "iOS version.",
    "timestamp": 1732230000
  },
  {
    "username": "Bobekistan",
    "rating": 4.0,
    "comment": "Pro's:\n\n1) The empire management aspect is incredibly intuitive.\n2) Aesthetics and art style suits the genre with the iconography being very well designed.\n3) The cold war style arms race of technology and ship upgrading while trying to counter what your opponent is doing. Many people complain that plasma missiles or whatever are overpowered, I have found that NOT to be the case in my games as long as I kept up the arms race.\n\nCon's:\n\n1) Randomness of tile drawing can make it feel like your empire stagnates at turn one. It's like you instantly lost the game.\n2) Battles can feel like a long drawn out messy slog. It's supposed to be the culmination of the hard work you put into your empire and representative of your economic and technological power. In practice it feels more like a random dice fest without the parts that usually make that kind of combat fun.\n3) Game will generally end just as things are about to ramp up. Kind of like listening to a song remixed by an idiot who cuts out the bit that everyone likes.\n4) Setup time is a pain.\n5) The bookkeeping/empire management part of this game is definitely well done from an intuitive point of view, but it slows the game down a lot and ends up being kind of disconnected from the 4X elements.",
    "timestamp": 1728338400
  },
  {
    "username": "NormandyWept",
    "rating": 4.0,
    "comment": "I had exactly one truly great play of eclipse, when everyone agreed beforehand to play in 90 minutes max. That didn’t really compensate for all the other plays that took a number of hours, which I found spread the interesting parts of the gameplay a bit thin, especially so when players can crash their economy and get into a mess.",
    "timestamp": 1721685600
  },
  {
    "username": "Timulacre",
    "rating": 4.0,
    "comment": "Too long !\nNot so exciting !\nlong waiting times !",
    "timestamp": 1709334000
  },
  {
    "username": "hiimjosh",
    "rating": 4.0,
    "comment": "I like Eclipse alright, but our last game took 4 hours. It’s not worth 4 hours. All of the constituent elements of Eclipse are well designed, but at the end of the day it’s all just dabbling throttled by a taxation system, and you don’t actually do that much in the game. Moreover the random tile pulls are massively important. If you could get this done in an hour - even two hours - then it’d be great. Otherwise just way, way too long for way too little. Just cut literally everything in the game in half",
    "timestamp": 1703804400
  },
  {
    "username": "thebaysix",
    "rating": 4.0,
    "comment": "Really dragged on for our group. I bet if we all knew the game it would be much more enjoyable. My biggest problems here are the rampant dice rolling and how the end of the game can just be a useless dogfight, with basically eliminated players just watching. This is exacerbated by the fact that the rounds get LONGER as the game goes on. I like the theme and the non-dice-rolling mechanics though. Exploration is really cool, and done way better than other games with similar mechanics (BaHotH comes to mind).",
    "timestamp": 1700780400
  },
  {
    "username": "EarlofBronze",
    "rating": 4.0,
    "comment": "First play lots fun! Looking forward to many more games!\n\nAfter a couple more plays, I am starting to see some weak spots in the game. Every game one or two players seems to get \"gimped\". They are unable to interact with other players and eventually end up as bystanders in the game. I also do not like the move your ships to attack THEN upgrade them. This is strictly from a thematic point of view. The game play is okay, but seems a bit cheesy for me.\n\nI do like the tech advancements and the exploration. (Although there could be more exploration?)",
    "timestamp": 1682287200
  },
  {
    "username": "realityfoible",
    "rating": 4.0,
    "comment": "It is entirely likely that who will win and loose will have been decided by turn three, only to have 3 more hours of tedious Sisyphean actions left before the game can finally end.\n\nThere are some excellent design choices here to be sure; I like how research and ship customization is handled in particular. Unfortunately they are buried under an avalanche of randomness and clunky combat mechanics.\n\n----\n\nEdit from the future: After more plays, I stand with my bitterness on this. For all its promises of grand operatic 4X empire management, the only thing that matters is getting lucky with exploration. Everything snowballs or deathspirals from there.",
    "timestamp": 1677711600
  },
  {
    "username": "Obscure",
    "rating": 4.0,
    "comment": "Eclipse features a staggering set of interlocking and yet elegant and streamlined mechanics encompassing exploration, economics, tech trees, diplomacy, unit construction and warfare logistics. It's also a mite on the random side, and all of these diverse elements funnel directly and inexorably towards the totally hands-off, tedious combat minigame that is easily the worst feature.\n\nRejected.",
    "timestamp": 1672095600
  },
  {
    "username": "arturh",
    "rating": 4.0,
    "comment": "I would prefer 2nd edition by far",
    "timestamp": 1648764000
  },
  {
    "username": "Mayasty",
    "rating": 4.0,
    "comment": "The quality of the game is as great as its demand for the space on the table. We had enough problems to squeeze in on the extended table in 4 player game. I can't imagine its version for 9 players :-) Probably snoocker table might be OK. The game is very challanging. However I am afraid that due to long setup and playing time I won't have many occasions in the future to return to it.",
    "timestamp": 1646262000
  },
  {
    "username": "slotus2005",
    "rating": 4.0,
    "comment": "missile technology is too powerful, which throws out an otherwise good game. There was something weird about how not having reserve resources was beneficial.",
    "timestamp": 1642978800
  },
  {
    "username": "lOOmit77",
    "rating": 5.0,
    "comment": "very weak game. didn't like it. there's no depth except of upgrading spaceships. very confrontive, whats actually not the problem. i will playtest the second edition some day, to find out if it make things better",
    "timestamp": 1760911200
  },
  {
    "username": "Nodens",
    "rating": 5.0,
    "comment": "The Euro-Gamers' entry in the quest for the perfect 4X around that time. A resource management game where turtling is rewarded - I mostly like the massive randomness.",
    "timestamp": 1757541600
  },
  {
    "username": "GodfatherPTS",
    "rating": 5.0,
    "comment": "After a few plays, this felt too much like rock, paper, scissors. Except that each player knows who is playing rock, paper, and scissors. Battles are determined before they begin depending on who has which upgrades. And the strategy your opponent picks dictates what you should pick.\n\nI do love the exploration and resource collecting system. The way the player board works with the expansion of your empire is brilliant. Unfortunately the problems above overshadow this brilliance and sours me on the game as a whole.",
    "timestamp": 1748642400
  },
  {
    "username": "silenceisgolder",
    "rating": 5.0,
    "comment": "Not my cup of tea. No desire to ever play it again, but it's still better than not playing a game at all.",
    "timestamp": 1743890400
  },
  {
    "username": "Peekstrom",
    "rating": 5.0,
    "comment": "Hated it. I wont never play it again. Too long, too boring and alliance mechanics? Please.",
    "timestamp": 1741993200
  },
  {
    "username": "PyroBlue",
    "rating": 5.0,
    "comment": "Showed up. Played the first round as the science/research race. Player to my immediate left decides to target me. Try to move towards to the center of the board to get away. Flip a tile with AI enemies that I can't fight. Cool. Try to go away from the center of the board. Flip a second tile with AI enemies I can't fight. Cool. Player to my left moves into my starting zone, wiping out my ships and taking control of my starting planet, thus completely wiping me out of the game. Round one. Proceed to sit for 3 hours watching 4 people play the game. Horrible time. Great story.",
    "timestamp": 1725919200
  },
  {
    "username": "sykano",
    "rating": 5.0,
    "comment": "not appealing\nextremely expensive\nnot even available",
    "timestamp": 1724104800
  },
  {
    "username": "Erlaad",
    "rating": 5.0,
    "comment": "* Rise of the Ancients\n* Ship Pack One",
    "timestamp": 1722722400
  },
  {
    "username": "evileyemcfungus",
    "rating": 4.5,
    "comment": "Totally need to play more of this game. Very much enjoyed it (at the time - 8)\n\nOn further play, how bout that randomness, huh? Super random elements totally mess with this one.",
    "timestamp": 1722376800
  },
  {
    "username": "Philgamer",
    "rating": 5.0,
    "comment": "Don't like",
    "timestamp": 1720994400
  },
  {
    "username": "Mushmo",
    "rating": 4.5,
    "comment": "An interesting space ship builder with combat and exploration. Not great at what it does, but entertaining to play. I played with 2 players and we never interacted. Which was great because I hate knifey stabby games and would prefer to play with myself. Wait…. I uh.. anywho.. Eclipse is a step above ambivalence and is as forgettable as the space it has you fly around in. I have to say the ship customization is cool.",
    "timestamp": 1717711200
  },
  {
    "username": "AKHawkster",
    "rating": 5.0,
    "comment": "Space 4x with a variety of races to give each game a different flavor. Works best with a larger group.\n\n10/23 - 2nd Edition finally played and improves the experience overall. Much easier setup and tracking, better balanced techs. Very unlikely to want to play first edition again.",
    "timestamp": 1697839200
  },
  {
    "username": "bggmatje",
    "rating": 5.0,
    "comment": "[September 2019]\nThe promise is a euro-style Twilight Imperium with shorter playtime. Yes there is expansion and some battle in space, and yes there are many different factions and technologies to choose from, offering good variety. But this game did not excite me half as much as Twilight Imperium does.\n\nThe game seems to be more about engine building and then go out with a big bang at the end. The fighting against opponents all happened in the last turn. Also the way how tiles are connected can make it pretty difficult to reach the opponent. All in all it felt as if the game was too restrictive and I was often denied the actions I really wanted to do. It feels like Twilight Imperium with all the fun stuff ripped out of the game. Not at all a great experience.\n\nObsoleted by Eclipse: Second Dawn of the Galaxy.",
    "timestamp": 1689199200
  },
  {
    "username": "radicalbytes",
    "rating": 5.0,
    "comment": "Space colonialism",
    "timestamp": 1687471200
  },
  {
    "username": "Luds",
    "rating": 5.0,
    "comment": "Very nice theme, comparable in complexity to the likes of Agricola, Caylus and others. I enjoyed building an empire from the ground up, from exploring and researching to building ships for the eventual battle. However, what felt really off with the game was the fight resolution with dice. Very poor. Definitely need to check Exile Sun's system.",
    "timestamp": 1685916000
  },
  {
    "username": "ashkai",
    "rating": 5.0,
    "comment": "This was unsurprisingly not very good for us as a two player game.\n\nWe liked the slight tech tree that there is in this game.\n\nThe combat was even fun in its way.\n\nWe would contemplate this if an official coop or interesting variant was released.",
    "timestamp": 1678489200
  },
  {
    "username": "iqwarrior",
    "rating": 5.0,
    "comment": "I dislike the plastic ships, the movements, the control table with the wooden cubes (how stylish is to use cheap plastic + plain wood blocks together in one game?).\nThe population and technology management is OK, but the game would be better if those ships were left out... (Unlike the Twilight Imperium, where the ships are great, important and add specific flavour to the battles).\nThe colors and design is a little bit terrible (cubes only in pink, orange and brown, like a vomit after party...), and the art work is a kind-of second class (OK, not home made, but neither first class) quality...\nDid I mention the cheap detail-less plastic ships with high-bright cheap colors? (Yeah, I did.)\nI don't know who rates it to 10, but they definitelly haven't played with any really good game yet.\nPolitics: only when the users are chit-chatting, but the game doesn't really encourage it.",
    "timestamp": 1677798000
  },
  {
    "username": "jellynut",
    "rating": 5.0,
    "comment": "Components and play aids are all top quality. A lot of the mechanics are very good.\n\nHowever, the most successful strategy seems to be to reduce interactions with other players to a minimum, possibly have a big fight at the end, and hope for good results on the dice, chit pulls and tile flips.\n\nSome 3+ hour games have had no interactions with other players, except checking/correcting rules, rolling dice for the 'ancients', swapping a treaty cube and then counting the final points at the end.",
    "timestamp": 1676761200
  },
  {
    "username": "antiussentiment",
    "rating": 4.5,
    "comment": "there some very cool mechanics in this game.\nthe random availability of the technologies.\nyou can only keep four bonus victory point chits for battle.\nthe cost of doing your actions and upkeep of colonies.\n\nbut i think this game is weighted to much towards being all about combat for my taste. it seems to really only have one victory path.\n\nAlso.. What's with the plastic space ships and wooden cubes? lets get some consistency in our game production. be Euro style or Ameritrash, not a hotch potch of both in a failing effort to keep costs down..",
    "timestamp": 1673305200
  },
  {
    "username": "SirTimbers",
    "rating": 5.0,
    "comment": "sold. never played. too long",
    "timestamp": 1672700400
  },
  {
    "username": "Kamaitatchi",
    "rating": 5.0,
    "comment": "The Euro player's Twilight Imperium?",
    "timestamp": 1672009200
  },
  {
    "username": "malloc",
    "rating": 5.0,
    "comment": "This is a good example of a well made, resource efficiency euro-game. If you like this type of game then you will like eclipse.\n\nI do have a problem with games that are build around scoring generic VP's. I feel that this one may come down to a very scripted play. Got my resources lined up, time to get in some battles and dig out the 4 vp point chips before their gone... ok thats done now time to run one tech path up to score vp... ok time to defend and expand my vp count on the board......",
    "timestamp": 1667430000
  },
  {
    "username": "theagricolan",
    "rating": 5.0,
    "comment": "I really wanted to like this game. But the more i played it, the more i was bothered by the randomness in combat, and more significantly, the randomness in the tile draw. Different races seemed interesting at first, but got boring as each race has a relatively fixed strategy and varying too much from it leads to inefficiency. This in and of itself would not be a dealbreaker, as I enjoy many games which people call “scripted”, as these games often have a good meta-game. However, this one can be painful, bc the effectiveness of your strategy is heavily influenced by what tiles you draw (e.g. the descendants gain a ton from drawing many ancients hexes, whereas planta gains most from drawing “empty” hexes, etc). Still fun, but more than a little long for what it is and it’s too easy to find more immersive, satisfying games with a shorter play time. It was hyped as taking an epic space opera and condensing it into an evening, but in my opinion it took an average euro game core, tossed in some theme, and stretched it into a 3+ hour grindfest.",
    "timestamp": 1665352800
  },
  {
    "username": "Wigdogger",
    "rating": 5.0,
    "comment": "I had some friends who were quite into this one, and I'd never played, so it was worth a try.\n\nWell, I guess it was =) I had pre-taught myself the game to save time... and that didn't really help much. Even though they all knew the game (it had been a year or since they played) and I was pretty comfortable getting going, the game lasted over four hours, and we hadn't even done the last round. We jokingly called it quits, as the second edition (we were playing the first) only has eight rounds.\n\nI suspect the second edition would help with some of the aesthetics and bookkeeping and overall feel, but this junior 4x thing just didn't do it for me overall.\n\nWhat I do like is the ship customization idea and the tech around that. That's fun. It's neat to slot in upgrades and build around a certain style of fleet. It's also cool to be able to build orbitals and starbases and things in your area that are more stationary. And the economy balance of money and resources can lead to an interesting cadence on your action board, where you have to make tough calls later on.\n\nBut boy, I can't really abide the randomness on the tiles just giving someone way more money or something. Money in particular just seems like this essential element for action economy and to avoid disaster in your game, so having more of it in resources really puts someone at an advantage. And the combat is just not great when extended out. It has some fun wrinkles if you were just doing one battle or something, but when it's just neverending die rolls for some train of combat, it just really kills the game flow. And while the glory tokens for battle kind of help some random little person have a successful combat by having a single ship die, and then they maybe pull a valuable VP chit, it's just a weird cadence later in the game having people cycle chips for minimal gain.\n\nI dunno. I'd play again, but everything felt just too long, and I wish combat was more streamlined. And I also would've liked more of a diplomatic element to be baked into the game rather than just: \"Hey, don't shoot me\" or let's exchange these little ambassador tokens. Not a game I'd rush to play again.",
    "timestamp": 1660341600
  },
  {
    "username": "sspinosa",
    "rating": 5.0,
    "comment": "Has player count issues but ultimately too much of a mental and chit workout for what you get.",
    "timestamp": 1655762400
  },
  {
    "username": "Inconmon",
    "rating": 5.0,
    "comment": "Heavy with long play time, yet completely random",
    "timestamp": 1655416800
  },
  {
    "username": "Abdul",
    "rating": 4.5,
    "comment": "Too long and fiddly, and way too much swinginess in the dice rolls and exploration tiles. Combat seems to hinge too much on flukeing that 1 in 6 chance roll, and is just absolutely boring for me. Ameritrash is just not for me I guess.",
    "timestamp": 1624831200
  },
  {
    "username": "authentic",
    "rating": 5.0,
    "comment": "Slow moving space games are not my favorite but it's still fun to play.",
    "timestamp": 1624226400
  },
  {
    "username": "Fuzzel",
    "rating": 5.0,
    "comment": "Ein 4X, Ähnlich Twilight Imperium. Kürzere Spielzeit, Galaxiefelder müssen erst entdeckt werden (ggf. unfairer Spielaufbau), spezialisierere Schifftech, weniger Diplomatie, Grafik schwach, leichter und schneller als TI.\n-> lieber Twilight Imperium.",
    "timestamp": 1621980000
  },
  {
    "username": "sajrainwater",
    "rating": 5.0,
    "comment": "iOS",
    "timestamp": 1614207600
  },
  {
    "username": "byronator",
    "rating": 5.0,
    "comment": "We really wanted to like this one. Once we got absolutely destroyed by the guy who went heavy missiles, it was all over. It was a race for missiles every game. I hear there's a second edition of this one that apparently fixes that, amongst other things, so I'd be willing to try that out. It's not a bad game, but our group just never wants to play it.",
    "timestamp": 1611183600
  },
  {
    "username": "stvnritch",
    "rating": 5.0,
    "comment": "This is a big bulky civ game in space and it never left my shelf, it was played once and I remember feeling severely let down by the experience. I would be willing to play again but until then I am rating it a 5.",
    "timestamp": 1605740400
  },
  {
    "username": "Phyrexian",
    "rating": 6.0,
    "comment": "Good civilisation game. Sci-fi. Good with all player counts. 1,5h rules explanation. 4h gaming time with four players. Too long for my taste but it's a good game.",
    "timestamp": 1762210800
  },
  {
    "username": "kwhite1",
    "rating": 6.0,
    "comment": "P",
    "timestamp": 1758060000
  },
  {
    "username": "willbeplayin",
    "rating": 6.0,
    "comment": "Replaced by the 2nd edition.",
    "timestamp": 1752962400
  },
  {
    "username": "ApeChild",
    "rating": 6.0,
    "comment": "Really good. A euro style strategy game, which i haven't played anything like before. Not as good as twilight imperium, but a shorter playtime so it'll be easier to actually play. Really like the ability to have a battle with more than just 2 players pieces in a hex. Later expansions allow alliances which build on that great feature, alowing two players to combine into one army. Very cool\n\n-but... After owning this game for like 3 or 4 years I have played it maybe 3 or 4 times. And never with the full player count. I don't know why that is. I want to do that. I just don't. I'm trying to organise a 6 player game, and it feels like pushing something up hill. So I don't know if this is my game after all",
    "timestamp": 1748728800
  },
  {
    "username": "ASihm",
    "rating": 6.0,
    "comment": "little too long, and there's a chance yo get wiped and need to wait many hours for the others to finish",
    "timestamp": 1740610800
  },
  {
    "username": "RandallPeek",
    "rating": 6.0,
    "comment": "App version. It’s nice but nothing special for me.",
    "timestamp": 1740524400
  },
  {
    "username": "Alfagar",
    "rating": 6.0,
    "comment": "Great fun, but to long.",
    "timestamp": 1739660400
  },
  {
    "username": "familygaming",
    "rating": 6.0,
    "comment": "To be clear, I don't think the game is poor - for years I thought it was a very good game - but I am done playing it. Rating objectively, I put this at an 8; my desire to play it is now a 2 - after 28 plays, I don't want to play it ever again.\n\nJAN 2018 - I've done with this game. It gave me a lot of good plays, and had appeal enough to get friends to be excited about it, but after 25 plays or so, I just don't find it fun anymore. Sitting through other players' battles can provide drama and amazing beat-the-odds results, but it's also time consuming and frequently uninteresting to non-combatants. I also don't like the tendency of my plays to have no combat till halfway through the game; and the slow crawl through the techs to tweak your ship for battles has just become rote. Nothing here is really the fault of the game, but after 25 plays, I'm just not interested in exploring the game any further, even with expansions.\n\nPlayed 22 times (mostly 2p, also 3p & 4p) for 48.0 hours.\n\nJUN/13 - Strong mix of Euro systems and Ameritrash theme-based mechanics. I initially gave this a 10, but on a second playing bumped down a notch to a 9. As I was playing, I found the admittedly well-balanced resource system to be such a large part of the focus of the game that the game experience felt too Euro (read system heavy) for my desire for a theme-heavy game.\n\nI think a $15 expansion that consisted of a deck of 60-100 encounter/event cards would turn this game from a 9 to an 11, and make it my favorite game ever. (Just looking at the first large expansion makes me think the Hive ships and new player mats would make for a 10-rated game).\n\nJUL 2013. Still incredible game design. I just want a bit more theme in the way of non-player alien encounters and other events. That would nicely supercede the focus on the resource engine that drives so much of the game.\n\nMAY 2014: Still a solid 9 for me. better with more players, obvs.\n\nJUN 2014: Last play was only an 8 for me, but it was a combination of being tired, getting unlucky with early tile draws (Ancient hexes and a Draco neighbour), and having to teach the game to new players...again - which I find exhausting. In general, my enjoyment of the base game is an 8/9 depending on the group, and a 9/10 with the expansion.\n\n22nd play:  DEC/14: I like the game with 4p, but Alliances have to be banned right now for us - 2 players with the best ship designs banded together to steam roll the other two of us, and is was distinctly less fun. Also, after the game ended, we removed the 7-9p techs out - they add too many power techs.\n\nRating history: 10,8,9...10...9....",
    "timestamp": 1738537200
  },
  {
    "username": "Tigerherz",
    "rating": 6.0,
    "comment": "xmas 19 BGG.be w special ship collection .. given to Dennis Tanja Jan25",
    "timestamp": 1738450800
  },
  {
    "username": "Javajoesworld",
    "rating": 6.0,
    "comment": "I didn’t think this game was quite as good as the masses. I need to try it again as the teacher didn’t remember it as well as he thought and many mistakes were made and the game took unnecessarily far too long as rules clarifications were needed.",
    "timestamp": 1735340400
  },
  {
    "username": "mlehr",
    "rating": 6.0,
    "comment": "Wow. I got clobbered, but this game is a lot o fun.",
    "timestamp": 1733958000
  },
  {
    "username": "stenole",
    "rating": 6.0,
    "comment": "(3-6P) A hybrid game of area control and euro mechanics melded together perfectly. The game has you upgrading ships, fighting battles, taking control of planets. There is also a catch up mechanism where players with little presence gets access to more actions.",
    "timestamp": 1731020400
  },
  {
    "username": "Bertuccia",
    "rating": 6.0,
    "comment": "Difficult to rate it after trying second edition. From the gameplay prospective, I didn’t feel much of a difference, but the player trays, the different miniatures, and the overall amazing production gives a completely different experience. However, if you’re looking for a cheaper version, I heartily recommend this one! My main criticism is that for a “strategy game” there is too much luck involved: dice for battle, random rewards after fights, random systems, random bonuses. Not happy to spend 4h with so much luck, despite being a fine game.",
    "timestamp": 1723932000
  },
  {
    "username": "burnstar",
    "rating": 6.0,
    "comment": "This game will initially remind people of TI- they are both space empire themed games with hexes, but they play completely differently. TI is much more epic and flavorful and themey. Very AT. Eclipse is basically a euro with some space battles and dice thrown in. It combines many things: economic euro, light war, a sprinkling of AT, a sci-fi theme, dice, etc. seamlessly into tight well-oiled machine of a game. Very cool. Rules are pretty simple (although it will initially appear fairly complex), still, first few plays were a little long. Combat can be a little monotonous with no decisions (except to retreat or not) and many die rolls trying to get 6's. Initial turns and luck exploring in the first few turns can also have a pretty big impact on the game. A little dry.",
    "timestamp": 1722722400
  },
  {
    "username": "Ctrlalt",
    "rating": 5.8,
    "comment": "A game I will probably never touch again. While it might have been fun to play, it lacks the uniqueness found in higher-ranked games.",
    "timestamp": 1719093600
  },
  {
    "username": "Ehubfan2012",
    "rating": 6.0,
    "comment": "An ok game though I prefer 4Xs that avoid dice rolls. There's also a large amount of luck involved with rewards from defeating aliens.",
    "timestamp": 1714255200
  },
  {
    "username": "Golyadkin",
    "rating": 6.0,
    "comment": "Sadly traded in a math trade :-(\n\nScience! Fiction! Aliens! Space Ships! Economy! Aliens!\nEclipse was one of the first games I bought. Unfortunately due to the fact that it doesn't play well with two and that I have no friends, it's been acting as a dust collector for quite a while. *Sigh*. I need to read more Alastair Reynolds.",
    "timestamp": 1712008800
  },
  {
    "username": "Lukashi",
    "rating": 6.0,
    "comment": "Brilliant ideas mixed with weird stuff. A lot of stupid randomness and it's not about d6 fights.",
    "timestamp": 1710975600
  },
  {
    "username": "Rajja29",
    "rating": 6.0,
    "comment": "iOS Only",
    "timestamp": 1708470000
  },
  {
    "username": "S Lee T",
    "rating": 6.0,
    "comment": "VG",
    "timestamp": 1705359600
  },
  {
    "username": "warder57",
    "rating": 6.0,
    "comment": "1st Impressions: (Rtg 7)\nGood space 4x game with an economic focus. I want to play more.",
    "timestamp": 1705014000
  },
  {
    "username": "brewsaki",
    "rating": 6.0,
    "comment": "I find Ecplise okay. There are many elements I like, but I'm not big about combat or customizing ships. It's such a big part of the game that it's mostly not for me.",
    "timestamp": 1704668400
  },
  {
    "username": "Captain Smollett",
    "rating": 6.0,
    "comment": "Rockets to heavy!",
    "timestamp": 1703718000
  },
  {
    "username": "immersedreality",
    "rating": 6.0,
    "comment": "Will Donate",
    "timestamp": 1701990000
  },
  {
    "username": "Weaks",
    "rating": 6.0,
    "comment": "Odio eso de que se acabe a los 9 turnos. Quiero un 4x, no un motor.",
    "timestamp": 1701903600
  },
  {
    "username": "britchey",
    "rating": 6.0,
    "comment": "4s, 6s",
    "timestamp": 1695420000
  },
  {
    "username": "GogTad",
    "rating": 6.0,
    "comment": "I really like this game it would be rated higher if the map hexes went so swingy with the draws.",
    "timestamp": 1691359200
  },
  {
    "username": "Zepheus",
    "rating": 6.0,
    "comment": "So much going on in this game, yet so much that I feel I can get from other games. Combat is such a chore and I feel that it really bogs the game down. I'm totally willing to play it again, but I don't think I'll ever recommend it or try to get into a play of it.",
    "timestamp": 1688508000
  },
  {
    "username": "Bevel",
    "rating": 6.0,
    "comment": "Sold in Hamburg",
    "timestamp": 1687039200
  },
  {
    "username": "tibbles",
    "rating": 6.3,
    "comment": "I read the mechanics and I want to like this game, but my in person plays I've been ruined by bad luck off the bat and had 2 out of 3 boring games. My app plays against an AI seem okay, but haven't made me any more excited about it.\n\nThe possibilities make me think it should be a rated an 8+, but my plays have been more like a 4...",
    "timestamp": 1683410400
  },
  {
    "username": "tamsynulthara",
    "rating": 6.0,
    "comment": "This was kinda fun as a way to get some of the feel of TI3 without sinking quite so much time into it.\n\nBut TI3 is still better. And then TI4 game out.\n\nGame over, Eclipse.\n\n(I still haven't tried Eclipse 2E, but considering how TI4 gives me everything I could imagine wanting in a 4X game, I'm not too curious.)",
    "timestamp": 1680732000
  },
  {
    "username": "Hardlygamealot",
    "rating": 6.0,
    "comment": "Pre 2020 - gift",
    "timestamp": 1680213600
  },
  {
    "username": "AMERICANBOYBAND",
    "rating": 7.0,
    "comment": "Rating based on Eclipse 2E",
    "timestamp": 1762124400
  },
  {
    "username": "ditterio",
    "rating": 7.0,
    "comment": "good game but way too overwhelming and chaotic",
    "timestamp": 1761692400
  },
  {
    "username": "watoop",
    "rating": 7.0,
    "comment": "Good but quite fiddly with the tiles and non-dual layer player boards. Enjoyed it but it went a little long and has maybe been 'eclipsed' by later games. Still preferred it to Voidfall though.",
    "timestamp": 1761692400
  },
  {
    "username": "optimo65",
    "rating": 7.0,
    "comment": "35 €",
    "timestamp": 1761343200
  },
  {
    "username": "shmonkey",
    "rating": 7.0,
    "comment": "Don't have the right group for this but would play if someone else wanted to. The economy/action selection system is incredibly well designed.\n\nThe randomness is a big knock on such a long game. random tiles, random dice combat. random combat points, random tech tile pulls. Actually, CHris would love this, so I may end up with it over time.\n\nim kind of echoing Mikes opinion here, I actually liked it a lot more than he did despite the randomness. Im going to bump this a bit for now and see where I land after more play.",
    "timestamp": 1759874400
  },
  {
    "username": "kensiebensie",
    "rating": 7.0,
    "comment": "Gift from Ian",
    "timestamp": 1759356000
  },
  {
    "username": "savantt",
    "rating": 7.0,
    "comment": "Great game - truly, one of the best games out there at the moment.",
    "timestamp": 1759183200
  },
  {
    "username": "Mrwrk",
    "rating": 7.0,
    "comment": "S",
    "timestamp": 1759010400
  },
  {
    "username": "Beefy79",
    "rating": 7.0,
    "comment": "Played Mike's Copy",
    "timestamp": 1758146400
  },
  {
    "username": "danielmleitao",
    "rating": 7.0,
    "comment": "Rated: 05/2018\nEdited: -",
    "timestamp": 1757282400
  },
  {
    "username": "PraxisLoki",
    "rating": 7.0,
    "comment": "Just too long.",
    "timestamp": 1757023200
  },
  {
    "username": "seaapple",
    "rating": 7.0,
    "comment": "Almost Twilight Imperium light. I think I prefer this to TI3.",
    "timestamp": 1756764000
  },
  {
    "username": "OneTrueRowan",
    "rating": 7.0,
    "comment": "I personally love this game, and especially love all the choices players have to make. Should I expand early for a chance at the resources I need, even though my monetary upkeep costs will be higher for the rest of the game? Should I save up for a technology I really want, or buy one now that is less good but will allow me to progress in some way now? Should I specialise in one specific strand of technology, or try to cover all my bases?\n\nThe way that ships can be upgraded is especially nice. Each fleet feels unique from game to game, and players have to balance having a lot of fire power with being able to take a lot of damage. Do you go all in with the missiles tactic? Do you make a tank?\n\nThere are however a few small things I am not so keen on:\n1. It can sometimes take too long to get through, especially near the end when everyone has a lot of ships and modifiers and combat can get tricky to do correctly.\n2. The player mats have a lot of pieces balanced on them that can get knocked around easily - it would have been good to have indented spaces in thicker boards, to hold the cubes in place.\n3. In my experience, the final round is invariably combat-heavy. It would have been nice to have a somewhat randomised end point, eg. to have a mechanism such as shuffling an end point card into the bottom of a stack of round cards, so players are expecting the game to end but are unsure when exactly and either have to take more risks or play more conservatively.\n\nOverall, definitely a game that I am always keen to put on the table when me and my friends have a full day for it.",
    "timestamp": 1756332000
  },
  {
    "username": "Kubidi",
    "rating": 7.0,
    "comment": "Players: 02 - 06\nBest: 04 - 06",
    "timestamp": 1755986400
  },
  {
    "username": "aadepizol",
    "rating": 7.0,
    "comment": "Complex spacial war game.",
    "timestamp": 1755986400
  },
  {
    "username": "KrakenGaming",
    "rating": 7.0,
    "comment": "The vibe of this game is like 2003 rts computer game. My first big box game and it is good. Upgraded to the 2020 second edition.",
    "timestamp": 1754604000
  },
  {
    "username": "rws2029",
    "rating": 8.0,
    "comment": "• Excellent space 4X + euro econ engine hybrid.\n• Highest point total wins.\n• Quicker, lighter than Space Empires 4X but with a similar vibe.\n• With the Rise of the Ancients expansion, this game works surprisingly well at all player counts (2–6).\n• The 1st edition of the game has a more conveniently sized box (compared to 2nd Ed).",
    "timestamp": 1761429600
  },
  {
    "username": "logopolys",
    "rating": 8.0,
    "comment": "War Game\n Science Fiction Game\n\nEclipse would be very easy to describe as Through the Ages in space, and with a map. That might do a disservice to the complexities of Eclipse, but it's also bluntly accurate. The cube system from TtA works well here, supplemented by the addition of \"bureaucracy discs\", which are spent to push the governing and progressive limits of your empire. It is possible to lose the game around turn 5 or 6 out of 9, leaving you to carry out the motions of a futile game, but experience can mitigate this. The alien abilities are all unique, and all worth trying once. They must be especially commended for not making Humans just the vanilla race; they more than hold their own with their logistic speed and trade efficiency that you'll find yourself missing when playing any of the aliens.",
    "timestamp": 1760652000
  },
  {
    "username": "Mintyfreshtaste",
    "rating": 8.0,
    "comment": "Sort of a cursory rating, deserves some more play. I realized I was playing wrong for quite a few games (only flipping colony tiles on Influence action, not at the end of each turn) making the game feel much more constricted than intended (also made it so you couldn't take the discovery tiles for after seeing which bonus it was, which was also constraining though I think it's a decent rule change). Still, lots of fun to navigate about, develop tech, ram ships into each other, etc.",
    "timestamp": 1760479200
  },
  {
    "username": "kldonnelly",
    "rating": 8.0,
    "comment": "Not good enough solo to keep just for that.",
    "timestamp": 1760392800
  },
  {
    "username": "Straddllw",
    "rating": 7.5,
    "comment": "I love the multiple strategies, player powers and economic management aspects of this game. The combat and reward mechanisms feel too random though even though you can mitigate the randomness with proper ship upgrades.",
    "timestamp": 1759528800
  },
  {
    "username": "Dion1974",
    "rating": 8.0,
    "comment": "Digital, IOS version",
    "timestamp": 1759442400
  },
  {
    "username": "goodemailaddress",
    "rating": 8.0,
    "comment": "Includes:\nPulsar Expansion\nRise of the Ancients Expansion\nSupernova 2 Expansion\nBlack Hole Expansion\nNebula Expansion\nShip Pack One Expansion\nPlano Box for Tokens\nCustom foamcore player piece insert\nCustom Tuck-Boxes for each Faction\nMetal reputation tokens",
    "timestamp": 1758578400
  },
  {
    "username": "Illotus",
    "rating": 8.0,
    "comment": "I'm not really surprised that some people have really bad reaction to this considering how big effect luck can have in a single session. Also if you don't like conflict this is not the game for you.\n--------------------------------------------------------------------\nPlayed again with 3, but with next techs revealed one turn in advance. Solid game, but I don't yet quite grasp it properly. One does need to plan ahead with the techs, but luck with exploring sectors does seem bit heavy handed. Would like to play with more than 3.\n--------------------------------------------------------------------\nTested with 3. Was certainly interesting, but tough to say anything else. Probably should play with the variant that reveals upcoming techs.",
    "timestamp": 1758319200
  },
  {
    "username": "Sedd",
    "rating": 8.0,
    "comment": "Ich mag das Spiel.\nFür mehr Infos, siehe 2. Edition. (Eclipse: Second Dawn for the Galaxy",
    "timestamp": 1757714400
  },
  {
    "username": "kobrha",
    "rating": 8.0,
    "comment": "Beautiful plays with 2 to 6 players. Enjoyable explore expand exploit exterminate parts in this game",
    "timestamp": 1757109600
  },
  {
    "username": "HerbertML",
    "rating": 8.2,
    "comment": "It was a little bit like \"Twilight Imperium light\". Simple tech treee (a flat tree), easy diplomaty and a quick play (appr. 45 min per player).\n/*#X6*//*away*//*EUR=90*/",
    "timestamp": 1756072800
  },
  {
    "username": "jumpwalker",
    "rating": 8.0,
    "comment": "played more than 5 times",
    "timestamp": 1754604000
  },
  {
    "username": "jmangus",
    "rating": 7.5,
    "comment": "$50",
    "timestamp": 1754344800
  },
  {
    "username": "rkaski",
    "rating": 7.5,
    "comment": "Epic in scope. Long game. Enjoyed playing.",
    "timestamp": 1750802400
  },
  {
    "username": "bnoterman",
    "rating": 7.8,
    "comment": "50",
    "timestamp": 1750024800
  },
  {
    "username": "JohnnySchmaser",
    "rating": 8.0,
    "comment": "I really enjoyed my first game of Eclipse. Packs a lot into 2 hour (3 player) game. Very nice tracking system. The whole process seems very streamlined.\n\nThe new edition \"second dawn\" is even more streamlined and has cool minis! But it's not different enough for me to replace my original copy. The crit '*' on the new edition dice (a 6 on original dice) does remove the confusion around use of the subtraction modifiers.\n\n---\n\nPlano Box Storage Solution\nCustom clear cube trays from Broken Token\n\nhttps://boardgamegeek.com/boardgameexpansion/184256/eclipse-...\nhttps://boardgamegeek.com/boardgameexpansion/154785/eclipse-...\nhttps://boardgamegeek.com/boardgameexpansion/131415/eclipse-...\nhttps://boardgamegeek.com/boardgameexpansion/104746/eclipse-...",
    "timestamp": 1749160800
  },
  {
    "username": "Ajohnny101",
    "rating": 9.0,
    "comment": "I'm assuming this is basically the same as the revised edition, so I'm giving it the same score... with a slight ding for not having as nice components",
    "timestamp": 1762297200
  },
  {
    "username": "luminarious",
    "rating": 8.8,
    "comment": "Galactic conquest featuring a lot of military planning, resource management and manic research and development.",
    "timestamp": 1762038000
  },
  {
    "username": "canucklehead",
    "rating": 8.5,
    "comment": "Great space/exploration game. Unfortunately can suffer from some luck issues (dice/rewards from tiles). Lots of fun and very thematic. Shorter than TI3 - which makes it better.",
    "timestamp": 1761343200
  },
  {
    "username": "LL81",
    "rating": 8.5,
    "comment": "Pre.",
    "timestamp": 1759874400
  },
  {
    "username": "ConnerCP",
    "rating": 8.5,
    "comment": "sell - eventually",
    "timestamp": 1759356000
  },
  {
    "username": "ForbiddenDonuts",
    "rating": 9.0,
    "comment": "If traded, would include base game plus ship pack one, pulsar, and supernova",
    "timestamp": 1759269600
  },
  {
    "username": "Haakon Gaarder",
    "rating": 9.0,
    "comment": "The best space 4X game.",
    "timestamp": 1758060000
  },
  {
    "username": "Profecia91",
    "rating": 8.5,
    "comment": "Very good 4x game, good mechanics, it's not a brain burner and not to long for this genre of game, the way that you can develop your income, tecnologies and ships it's great, the explore option adds a nice unknown fact to the game, sometimes it's too random, because you don't know what is in that tile, you can have bonus tiles, good places for your population or deadly enemies, the combat fase it's nice, not good, and very simple and you can make it better improving your ships with nice tecnologies: I don´t like is the randomness of the reputation tiles that you win depending on the battle that you fought and I wished that combat was a more important part of the game, because there's a big chance for a player to be very passive and spend the whole game in is corner only making developments and that's bad for the interaction and for the fun of the game.",
    "timestamp": 1757196000
  },
  {
    "username": "Fuzzcrumbler",
    "rating": 9.0,
    "comment": "A heavy dose of luck involving hidden tile choices & die rolling, which control success regarding exploration, research and battles, and can be frustrating at times. It’s not as long as TI, but still long. All in all, for an annual space empire group experience I’d rather play TI, since laws & diplomacy should be part of an intergalactic struggle- which is not present in Eclipse. I prefer the way Space Empires 4X handles various ships & classes. Combat is a chore at times. Also, connecting points can be shut down to keep others away, thus opening up turtling possibilities.",
    "timestamp": 1756936800
  },
  {
    "username": "Pessman",
    "rating": 9.0,
    "comment": "My favorite board game, no doubt. I'm not giving it a 10 only because it is a fairly complex game and not everybody is interested in this level of complexity",
    "timestamp": 1756072800
  },
  {
    "username": "Bentley Mirrorshade",
    "rating": 9.4,
    "comment": "All expansions and miniexpansions, insert\nvanilla: 9.19",
    "timestamp": 1755813600
  },
  {
    "username": "espoon82",
    "rating": 8.6,
    "comment": "We have really enjoyed this game, but even with the first expansion I feel like there is something missing and I can't put my finger on what it is. Otherwise, it lives up to the hype! This game is smart and gives you a lot to think about. Definitely not just Risk in space.",
    "timestamp": 1755813600
  },
  {
    "username": "Fohammer",
    "rating": 9.0,
    "comment": "Sold\nIncludes: Rise of the Ancients, Ship Pack One",
    "timestamp": 1755208800
  },
  {
    "username": "thptr",
    "rating": 9.0,
    "comment": "I think this is good for my Root game group.\nThe base game is solid design.\nExpansions bring the game to another level of grand-epic-space-emprie vibe. I like modding game, but for those who prefer otherwise might find expansions rules too much complex and bloated.",
    "timestamp": 1754517600
  },
  {
    "username": "Tehanu",
    "rating": 9.0,
    "comment": "Cz.",
    "timestamp": 1753999200
  },
  {
    "username": "salaba",
    "rating": 9.0,
    "comment": "With all gameplay expansions - only Ship Pack One missing",
    "timestamp": 1753999200
  },
  {
    "username": "spixel",
    "rating": 10.0,
    "comment": "best with 4 or 6\nKEEP",
    "timestamp": 1759183200
  },
  {
    "username": "hyperking",
    "rating": 9.5,
    "comment": "As someone who appreciates Euros but tends to shy away due to them being dry brain burners, this is the best implementation of euro mechanics into a wargame/ameritrash game I have ever played. The economy is handled so elegantly, never gets in the way and never feels like it's too much. Just a superb game that I will always gladly play if I have 3-4 hours to spare",
    "timestamp": 1757973600
  },
  {
    "username": "YeOldePlayer",
    "rating": 10.0,
    "comment": "After three plays, it's become clearer how to reduce setup and tear-down time, especially with only two players vying for ship upgrades instead of six. Setting out fewer tiles from the bags devoted to the initial parts or each row of upgrades also makes it less likely to knock a bunch of tiles over, as does having fewer orbital/monolith tokens out, as they're rarely used.\n\nI wouldn't be invested in the setup and teardown time if I didn't want to come back to this game time and time again. The player boards are indeed lovely ways to minimize the mental bookkeeping for the resources that are available. Because this game has less diplomacy than others, it works better for our two-player games than other space-themed 4x games do.\n\nSo far, the one major improvement we all seem to need is the Quantum Grid. Without it, the action economy feels too constrained, and the scale of the game feels less epic. However, sometimes that's desirable, and when that tech isn't available, the game's tightness is palpable. It also makes different game sessions feel radically different, increasing the replayability in a lot of good ways. The 30 minutes per player play time seems tantalizing doable with more experience; we're probably at 40 minutes per player without emotional tumult.",
    "timestamp": 1751752800
  },
  {
    "username": "madaxer",
    "rating": 10.0,
    "comment": "Includes all expansions and custom bags",
    "timestamp": 1749506400
  },
  {
    "username": "Zoot58",
    "rating": 10.0,
    "comment": "2nd Edition! (Red Eridani). Original and totally complete. Pieces and Tokens counted, verified, and sorted into a Counter Tray. Six Factions sorted into zip-locs. Two newer velvet bags included, that are not the originals. Sharp clean box, fully intact.",
    "timestamp": 1745100000
  },
  {
    "username": "majzel83",
    "rating": 10.0,
    "comment": "[Marcin]",
    "timestamp": 1744149600
  },
  {
    "username": "mateoosh92",
    "rating": 10.0,
    "comment": "Many possibilities of growth. For all of technologies and sci-fi fans.",
    "timestamp": 1743372000
  },
  {
    "username": "creator1113",
    "rating": 10.0,
    "comment": "1 copy: 1.5 updates",
    "timestamp": 1742166000
  },
  {
    "username": "tmacarle",
    "rating": 10.0,
    "comment": "This game is great. It really has great mechanics, from modifying the ships, to acquiring and researching technologies to exploring space. I have played it the way I am supposed to with ending on certain rounds, and I have played it out for a 'total domination' game where we completely eliminate to other player. I have found that playing and ending on the round 9 fits better for our players.",
    "timestamp": 1740006000
  },
  {
    "username": "EpicSouldier",
    "rating": 10.0,
    "comment": "I've never played the new version. For me, this game is an attempt to create an epic galactic game that plays differently on many occations but for me it is not immersive enough; it feels too abstract.",
    "timestamp": 1738882800
  },
  {
    "username": "jondodd82",
    "rating": 10.0,
    "comment": "I love the way the different mechanisms work together intuitively and create an easy experience to get into and enjoy. At the same time, it's deep and complex and satisfying to wrap your head around for a number of hours. Upgrading ships, buying tech, building your economic engine, mitigating dice rolls, planning out your actions to expand your empire and maximize VPs is just fantastic. I can't recommend Eclipse enough.\n\nIncludes:\nEclipse: Rise of the Ancients\nEclipse: Ship Pack One",
    "timestamp": 1738796400
  },
  {
    "username": "stude",
    "rating": 10.0,
    "comment": "Attractive space theme game with battle orientation. Setup is quite tedious if you do it by the book, I recommend having some kind of organizer for all the tiles to make it faster. Attracts me more than the new version which has too much plastic. Lots of expansions for some extra twist. For some reason, I like Eclipse but Twilight Imperium won't turn me on.",
    "timestamp": 1737586800
  },
  {
    "username": "gracehopper",
    "rating": 10.0,
    "comment": "Donated to https://komm-spiel-mit.info/",
    "timestamp": 1732921200
  },
  {
    "username": "abssalom",
    "rating": 9.5,
    "comment": "Un 4x condensado en unos 30 min por jugador. Un juego cuyo único inconveniente es el montaje y desmontaje y el Analisis-Paralisis que otros jugadores puedan tener.\n\nActualización: La nueva versión es mejor, pero gracias a Lautapelit, podemos actualizar nuestro viejo eclipse sin problema. Sigue siendo de los mejores juegos 4x/gestión de imperios que puedes jugar hoy día",
    "timestamp": 1731538800
  },
  {
    "username": "Andrey12",
    "rating": 10.0,
    "comment": "The best 4-5 players strategy on the market.",
    "timestamp": 1730761200
  },
  {
    "username": "sweeper2000",
    "rating": 10.0,
    "comment": "Seit 10 Jahren spiele ich das Spiel und bin weiterhin begeistert!",
    "timestamp": 1729548000
  }
]