[
  {
    "username": "lililililil",
    "rating": 1.0,
    "comment": "Eurojank",
    "timestamp": 1747432800
  },
  {
    "username": "RollPatrol",
    "rating": 1.0,
    "comment": "Why design a boardgame worth 150€ with deluxe components but a horrific manual?\n\nZero fun to play if you've got to consult the forum every other move because of the miserable rulebook. All too vague about timing, skills, lockpicking, etc. Without the BGG forum and YouTube, you'd be lost.\n\nWhy not add a DETAILED glossary for all the skills?\n\nSo, before you get this game, prepare for countless session interruptions to hunt for rule clarifications.\n\nI sold mine because I want to enjoy the game not puzzle over the manual.",
    "timestamp": 1733439600
  },
  {
    "username": "pleroph",
    "rating": 1.0,
    "comment": "This game is terrible. The rules and player aids are borderline useless. The only way to play this game is to make half of it up, if you try looking up all the random edge cases you'll burn out.\n\nAlso no idea why they need to create so much garbage with all these expansion boxes that contain like 20 dice and a player aid.\n\nHorrible game, unethical company. Avoid.",
    "timestamp": 1706655600
  },
  {
    "username": "fatony612",
    "rating": 1.0,
    "comment": "Game arrived incomplete with obvious production issues. Took months to be resolved and I moved on from the game before it was fixed. Overall CTG has production quality issues, not worth picking up for the price they charge.",
    "timestamp": 1706396400
  },
  {
    "username": "Dali187",
    "rating": 1.0,
    "comment": "Greedy greedy, you pay €150 for a subpar BASE game and you need to shell out another €300 to buy everything inside the game.\nIts literally a joke of a company and game do not support it.",
    "timestamp": 1682200800
  },
  {
    "username": "Lupyo",
    "rating": 1.0,
    "comment": "La difficulté de ce jeu est très mal dosé. soit disant volontairement punitif, je n'y crois pas une seconde. Même en mode aventure le jeu est injouable car trop dur à réaliser. C'est à se dégouter du jeu de société comme première expérience.",
    "timestamp": 1670194800
  },
  {
    "username": "javelin98",
    "rating": 1.0,
    "comment": "One of the worst games I've ever played. Badly unbalanced, nearly unwinnable, and with a dizzying array of various fiddly dice. If I saw a copy of this game lying in the street, I wouldn't walk on by it -- I'd run it over.",
    "timestamp": 1655935200
  },
  {
    "username": "explodes",
    "rating": 1.0,
    "comment": "Played once.",
    "timestamp": 1652738400
  },
  {
    "username": "wangyanbo1994",
    "rating": 1.0,
    "comment": "piece ofshit",
    "timestamp": 1622498400
  },
  {
    "username": "ionas",
    "rating": 1.0,
    "comment": "Looks dead boring abstract",
    "timestamp": 1522706400
  },
  {
    "username": "Selykg",
    "rating": 1.0,
    "comment": "This entire Kickstarter has been a mess. Delayed. Then delayed again due to manufacturing issues. Then the thing does show up and due to shit packaging by Starlit Citidel the bottom chip tray was broken.\n\nChip Theory say they stand behind their products but they won't replace damaged components as they said they would. So much for standing by their work.\n\nFuck these guys.",
    "timestamp": 1495576800
  },
  {
    "username": "Hoss Cartwright",
    "rating": 1.0,
    "comment": "Just don't make any games like this again...Gluttony of garbage on BGG these days.\n\nKickstarter.. Essen!!! ( had to type this last part because somehow it makes it better)",
    "timestamp": 1456095600
  },
  {
    "username": "SJS1971",
    "rating": 2.0,
    "comment": "Too Many Times Having To Look Up Rules In A Disorganized Rule Book.\nToo Many Repetitive Turns.\nToo Many Other Things I'd Rather Do With My Time Like Stand In Line At The DMV Or Have An Audit By The IRS.\n===\nUpdate: Gave it one more try. The game is just miserable. The owner decided to try and sell it after we played. He was sick of it too.",
    "timestamp": 1723327200
  },
  {
    "username": "Boombastix",
    "rating": 2.0,
    "comment": "Clunky mechanics. Good components +2. Trash company -1.",
    "timestamp": 1710457200
  },
  {
    "username": "Azikin",
    "rating": 2.0,
    "comment": "Played a few times, the game was always swingy and it also doesn't scale well with the number of players. It's also too expensive for what it is. I mean, it's more expensive than similar games with miniatures. And here you play with just poker chips. Quite ridiculous.",
    "timestamp": 1702422000
  },
  {
    "username": "pocoloco",
    "rating": 2.0,
    "comment": "This game has become severly overrated because of the solo community. The rules are confusing, the combat is not very compelling and quickly become repetitive, and the puzzle nature of the game doesn't lend itself well to actual multiplayer. This pattern continued, despite having multiple expansions and play-throughs. You'll only be sucked in to buy more content because \"something\" is always missing - that something is a properly developed game.\n\nVERDICT: Overproduced. Underperforms. Like most crowdfunders.",
    "timestamp": 1694210400
  },
  {
    "username": "sareneFactorial",
    "rating": 2.0,
    "comment": "next to no decisions - stand in place, attack every turn, hope you don't roll bad. am i playing this wrong?",
    "timestamp": 1684879200
  },
  {
    "username": "Dudibus",
    "rating": 2.0,
    "comment": "Monsters are too random and encounters are unbalanced. We were either destroying everything easily or getting monster and scenario combinations that were impossible to beat.",
    "timestamp": 1679094000
  },
  {
    "username": "ManEatingHippo",
    "rating": 2.0,
    "comment": "Seriously, garbage like this is ranked 8.4? This is an example why BGG is a joke. These $100+ games are going to kill our hobby and the only thing that will be published in the future will be crap like this.",
    "timestamp": 1636066800
  },
  {
    "username": "DragonLotus",
    "rating": 2.0,
    "comment": "Written rules are trash. Rule organization is terrible. Why even go through the effort of having a written rulebook when it's written so poorly, you have to go watch a video on YouTube. Gameplay is boring. 90% of \"playing\" is reading rules and figuring out effects and the other portion is being disappointed by dice rolls. Fell asleep twice on first playthrough.",
    "timestamp": 1633298400
  },
  {
    "username": "Iliota",
    "rating": 2.0,
    "comment": "Horrible.",
    "timestamp": 1612738800
  },
  {
    "username": "Marzuki",
    "rating": 2.0,
    "comment": "A game of mostly gambling with a ridiculous amount of fiddliness and repetitive content. Overproduced components prefer form over function, as the chips are small and uninteresting. Crazy price point for what is essentially a dice rolling activity.",
    "timestamp": 1606690800
  },
  {
    "username": "Harry Bumnapper",
    "rating": 2.0,
    "comment": "Way too many errors 3 years after release and an unknown number of reprints. Still cannot get anything correct. Imagine going to a great burger joint, pay top dollar for what appears to be a world class experience, only to receive something from the dollar menu at Mickey D's",
    "timestamp": 1591999200
  },
  {
    "username": "Ryanmathis07",
    "rating": 2.0,
    "comment": "You must know upfront that these types of games are not usually my favorite... But this one is extremely long...unexciting battle mechanism... and you cannot control the length of the game due to events that can add on hours to the game... I like games where you learn the rules once then play your stratgy around those rules and possibly allowing for some game rule breaks along the way that are clearly defined and which other players understand... what I do hate are games where every turn needs to be looked up in an encyclopedia of terms and a constant discussion on what was meant by the new ability interaction. So in the end every game is a rules discussion or looking up abilities in an encyclopedia...instead of actually playing the game, and I for one, hate that...add on hours and hours of game length and this game is a hard pass. Cloudspire is better by being more interesting ...but still suffers from the exact same thing.",
    "timestamp": 1567893600
  },
  {
    "username": "jxie",
    "rating": 3.0,
    "comment": "Cheap quality material with not much depth of game play",
    "timestamp": 1762124400
  },
  {
    "username": "Redgarex",
    "rating": 3.0,
    "comment": "I very don't like it. Played 2 times, first time was big dissapointment and I needed to force myself and friends to play it again (I didnt't believe it was so bad, when it have so good opinions). Needleslly too complicated in rules and components, to many unusefull skills, almost no decision making, bad balance. Idea was nice, but game desin is terrible for me and my friends.",
    "timestamp": 1739746800
  },
  {
    "username": "BoardGamingCouple",
    "rating": 3.0,
    "comment": "3/5\nThis was actually quite enjoyable. the upgrades were cool. The game is overproduced, nice components, but very expensive & large to setup. There are cheaper games that are easier to setup.",
    "timestamp": 1739574000
  },
  {
    "username": "whatsabandicoot",
    "rating": 3.0,
    "comment": "Not my sort of game or production (why is there so much neoprene?). Happy to have tried it, but three games is enough to know it's not going to click. I can see the appeal, unfortunately not the fun.",
    "timestamp": 1726869600
  },
  {
    "username": "mortoray",
    "rating": 3.0,
    "comment": "Played it once and that was enough. It has a high quality production value, but it's a fairly basic tactical fighting game -- with way too many parts and rules to track.",
    "timestamp": 1724536800
  },
  {
    "username": "guig67",
    "rating": 3.0,
    "comment": "Extrêmement déçu. Vu la hype générale visible partout, je finis par me laisser tenter malgré le frein du prix astronomique. Et....franchement, déception. Ok, la qualité du matos est exceptionnelle, d'où ma note de 3 minimum. Mais les points négatifs s'accumulent en avalanche : un livret de règle IN-DI-GES-TE. Je suis quelqu'un de patient, capable de prendre du temps dans les jeux experts complexes voire lourds; là j'ai passé deux journées à lire et relire les règles tout en regardant multiples vidéos d'explications (bravo à la chaîne JeanMichelGrosJeux d'ailleurs); mais le pire, c'est que non seulement le livret de règles est mal structuré, mal écrit, manque d'exemples et d'illustrations, mais en prime il ne suffit pas à comprendre toutes les subtilités, avec un un grand nombre de points d'explications tout simplement absents. C'est extrêmement frustrant d'accepter de s'investir lourdement en temps et en argent pour se retrouver sans savoir ce qu'il faut faire.\nAutre chose, l'absence de marge progressive : le jeu est beaucoup trop lourd en subtilités et micro-points de règles très particulières qui, accumulées, rend l'avalanche d'information complètement indigeste. Et les premières parties sont plus que pénibles : on ne s'amuse pas, on se fait rouler dessus, on ne sait pas quoi faire, on n'a pas le droit à une seconde chance (malgré que le perso ne meure pas au sens propre), et on se fait dégommer dès le premier combat sans rien comprendre à ce qui nous est arrivé.\nOn en déduit vite qu'il faut bien une vingtaine de parties pour commencer à maîtriser suffisamment la vue d'ensemble des possibilités et enfin commencer à apprécier le jeu. Perso, je ne me suis pas amusé.\nEt cette perspective ne m'amuse pas non plus.\nEnfin, le style même du jeu, on aime ou on déteste : ce n'est que du combat tactique, avec un aspect narratif minimaliste assez inutile au final; le tout sur une grille hyper abstraite et calculatoire. Gloomhaven ou Heroes of Normandy, jeux de combats tactiques, sont bien plus immersifs et amusants en comparaison (et bien plus faciles d'accès), tout en étant aussi riches en possibilités tactiques.\nBref, une grande déception, et je vais donc m'en séparer très rapidement. Je ne comprends sincèrement pas la hype générale autour de ce titre.",
    "timestamp": 1722722400
  },
  {
    "username": "Poldy1981",
    "rating": 3.0,
    "comment": "Initial habe ich 8 Punkte gegeben. Nach vier Spielen jedoch müssen wir sagen, dass die Bosskämpfe quasi unmöglich zu bewältigen sind. Vorher nie Schwierigkeiten gehabt - und dann beim Boss (in unserem Fall Nom und Drellen) stets gescheitert. Wenn man so extrem viel Zeit zum Spielen investiert (5+ Stunden!) und dann immer(!) scheitert, ist die Frustration echt extrem. Wird verkauft.",
    "timestamp": 1721685600
  },
  {
    "username": "Aphexia31",
    "rating": 3.0,
    "comment": "More upkeep than gameplay, too unforgiving, also more setup than gameplay.\nVery overproduced for what you get out of it.\nWould make a better boring video game.",
    "timestamp": 1718748000
  },
  {
    "username": "joseverdin10",
    "rating": 3.0,
    "comment": "sold",
    "timestamp": 1706482800
  },
  {
    "username": "librasquamis",
    "rating": 3.0,
    "comment": "What should i say... this game very awfull...",
    "timestamp": 1704150000
  },
  {
    "username": "beaslera",
    "rating": 3.0,
    "comment": "Too Many Bones is a cooperative game focused on small-scale tactical battles and light strategic decision-making. Characters level up as the game progresses, preparing for the boss battle. Unfortunately, the leveling feels weak because the generic attributes seem better to level than the distinctive skills/dice, and the distinctive dice are generally only used once per battle and often don't roll what you want when you need it. There isn't enough storytelling since the strategic/overland part is random cards that are just deciding between different rewards with some light flavor text. Since there's no hidden information for the players or per-character motivations, multiplayer games may as well be solitaire with just one person making all the decisions. Worst of all, the battles aren't engaging and many enemies are impervious to certain actions (e.g., flying enemies that I can only attack every other turn) or that strongly discourage certain actions (e.g., an enemy that locks my attack dice if I attack it). Finally, the game is extremely expensive for no good reason. Yes, neoprene mats and weighted poker chips are a luxury, but Quarriors provides more fun and so many dice for less than half the price. I really wanted to like this, but it isn't worth the time or money.",
    "timestamp": 1703545200
  },
  {
    "username": "whiskeyface",
    "rating": 3.0,
    "comment": "Too many bones, not enough fun. Looks great though.",
    "timestamp": 1676847600
  },
  {
    "username": "mjhm",
    "rating": 4.0,
    "comment": "2 plays (wpg)",
    "timestamp": 1758319200
  },
  {
    "username": "Arnar146",
    "rating": 4.0,
    "comment": "Gulli",
    "timestamp": 1754517600
  },
  {
    "username": "Zenith123138",
    "rating": 4.0,
    "comment": "Gameplay all in.",
    "timestamp": 1734390000
  },
  {
    "username": "invervegas",
    "rating": 4.0,
    "comment": "Complexity √",
    "timestamp": 1724364000
  },
  {
    "username": "awwjeah",
    "rating": 4.0,
    "comment": "I feel like I have zero agency in this game. Positioning during combat matters not at all. You can choose the dice you roll but you're still at the mercy of random chance for just about everything.",
    "timestamp": 1724364000
  },
  {
    "username": "thepillbox",
    "rating": 4.0,
    "comment": "Sold May 2022",
    "timestamp": 1695765600
  },
  {
    "username": "andymanpants",
    "rating": 4.0,
    "comment": "A unique, flavorful, and fascinating game overflowing with originality. Sadly, it's also overdesigned, overproduced, and involves (as advertised) a truly excessive number of bones. I was really looking forward to trying this game and I appreciate it for what it is, but the game is honestly 50% MORE than it needed to be in every metric. By the end of a session, I was exhausted, and not in a good way.",
    "timestamp": 1664056800
  },
  {
    "username": "JimmyTwoHands",
    "rating": 4.0,
    "comment": "just ok and it loses points for how expensive it is",
    "timestamp": 1663624800
  },
  {
    "username": "UragGroShub",
    "rating": 4.0,
    "comment": "Not my cup of tea.",
    "timestamp": 1657749600
  },
  {
    "username": "masque",
    "rating": 4.0,
    "comment": "Only played this twice solo, but first impressions where not good. Maybe Patches is not the best Gearloc for playing solo, but I scarcely had an exciting and satisfying battle. The encounters were completely unrelated and the writing was bad. The baddie point system was puzzling. How can a fight on day 4 (four 1 pt baddies) be so much harder than a fight on day 5 (one 5 pt baddie)? Positional play seemed mostly irrelevant. The final boss battle was a huge letdown. It either was going to be impossible or a cake walk. I happen to roll a Poison 3 and a Bone Saw 3, so I won effortlessly on Turn 3. I would have been clobbered if I had rolled just a few points worse.\n\nA few words regarding component quality: I am not sure why folks praise these so much. Sure, compared to cardboard this approach to physically producing a game is a novelty, but if you have ever seen really great poker chips and plastic cards all this is just infuriating. As someone who knows quality poker chips (I own a set of Paulsons) the chips here are just crappy, slugged PVC chips. Again, OK compared to Walmart quality, but extraordinary? The cards are even worse. Lots of card players handling plastic cards all the time (e.g., playing Poker) would run away from these slippery PVC nightmares as fast as possible. Compared to really nice acetate cards (by Modiano, KEM, or Fournier) this is laughable quality.\nBottom line: I'd rather have top shelf wood and cardboard components than bottom feeder chips and plastic cards. Not to mention that the printing is dull and difficult to read (but, hey, cards are plastic).",
    "timestamp": 1656453600
  },
  {
    "username": "londonleon",
    "rating": 4.0,
    "comment": "Oh boy, I really really want to like this. I've played it about 15 times, about 10 of those correctly... I think. The rules are a mess and the game is so swingy. In a few games, we were doing well (I mean really well!) for a while and then a bad dice roll destroyed us... at a crucial time. Meaning we lost. Too much time to be nerfed by one bad roll. For the components, they really should have better ways of keeping track of days/successes. Some things scale with player count and others that should do not.",
    "timestamp": 1656367200
  },
  {
    "username": "maddrax99",
    "rating": 4.0,
    "comment": "Player Mo",
    "timestamp": 1655676000
  },
  {
    "username": "Magila94",
    "rating": 5.0,
    "comment": "Premessa: Non è male come gioco. Il progetto di base è bello, la qualità dei materiali é molto alta.\nVeniamo al dunque:\n- Prima di tutto il regolamento é confusionario, fatto malissimo e non parlo di traduzioni. Intendo proprio come organizzazione. Devi saltare da una parte all’altra. C’è poca chiarezza e devi consultare di continuo la scheda personaggio, il regolamento, le azioni e le abilità nemiche. Abilità che se va male rendono ancora più noiosa la partita: alcuni nemici possono subire un danno per turno. Devi quindi essere fortunato con i dadi altrimenti perderai 15 minuti per una battaglia banale.\n- la difficoltà: ma vi sembra normale che debbano “facilitare” il gioco perché altrimenti rischi di morire subito poiché il personaggio é scarso di base rispetto ai nemici? Devi quasi “imbrogliare” avendo almeno +2 vite a cui aggiungi altri potenziamenti altrimenti vieni sconfitto come un fesso.\n- I personaggi sono appena 4. Tutti gli altri vanno acquistati da parte. Le “espansioni” sono standalon. e costano quanto il gioco base. Ottime le chip, I tappetini e le carte. Ripeto: Alta qualità. Queste sono le cose che “giustificano” il prezzo.\n- Il gioco é troppo ripetitivo. E una volta che hai capito cosa potenziare e come giocare diventa banale. La tua sfortuna può riguardare solo la chip del nemico che peschi per l’evento in base al numero dei giorni. I nemici sono banali, troppi banali. Tutti tranne i boss che hanno un dado speciale .\n- La “rigiocabilitá” : Non è che ci siano differenze negli eventi..o combatti o lanci i dadi. Stop. In solo sono pochi, ho così aggiunto gli “eventi generici” ed è stato un po’ “diverso”. Non capisco perché devo usare le carte “solo” se anche negli “eventi generici” c’è scritto “per 1-2 giocatori”.\n\nConclusione:\nNon si può fare un gioco di 150€ giustificando tutto con i materiali. Bastava una plancia di cartone in cui inserire i dadi. Tokens di cartone per i nemici o in porta monete. Stessa funzionalità ma un costo molto più basso.\nNe ho sentito parlare così tanto bene che sono rimasto allibito.\nMi ha annoiato eppure ho provato a giocare in vari modi per una settimana ma il gioco questo é. Se poi ti capitano alcuni nemici ti annoi e le prendi.\nGioco sufficiente che poteva essere più leggero di peso ed economico.",
    "timestamp": 1756677600
  },
  {
    "username": "Fuzzel",
    "rating": 4.5,
    "comment": "Interessante Spielkomponenten (Würfel, Chips, Spielmatten...),\nTaktische Kämpfe, aufleveln, Schätze finden, Endboss besiegen ..\nNur sehr kleines Kampf Tableau. Beinahe ausschließlich aus Kämpfen und Charakter-Entwicklung besteht. Hype Train. Sehr teuer.\n-> Gloomhaven\n-> Mage Knight",
    "timestamp": 1749852000
  },
  {
    "username": "bway",
    "rating": 5.0,
    "comment": "Very disappointed in this game, allthough the upgrades and random events are fun (and high quality dice), the game just didn't click for our group. Often the better/more powerfull options tend the be the less fun choices. Some games we breeze though with no difficultly and some games we get crushed with seemly no choices to effect the outcome at all.",
    "timestamp": 1748556000
  },
  {
    "username": "mentor77",
    "rating": 5.0,
    "comment": "Don't get the hype around it.\nhad 2 plays, only you could say but I don't want to play it again.",
    "timestamp": 1748124000
  },
  {
    "username": "Piranesaye",
    "rating": 5.0,
    "comment": "I wanted to like it. Really thought I would, but there is not a lot of depth especially as a solo game.",
    "timestamp": 1744149600
  },
  {
    "username": "Zydzy",
    "rating": 5.0,
    "comment": "It's a 5 leaning towards a 3. I guess there is something there, but it's just not fun.",
    "timestamp": 1742338800
  },
  {
    "username": "bucklen_uk",
    "rating": 5.0,
    "comment": "Lovely production, and each character is unique and has a variety of routes you can take, and a nice variety of bosses (who alter the mix of baddies you'll face). Bit of pick your path with the encounter cards. All of this meant I was expecting to love this.\n\nDidn't \n\nwhy? Characters and minions as stacks of chips didn't do it for me. My character sheet as a bunch of dice all with lots of icons didn't do it for me - I just lost the narrative and story and it all came down to rolling dice.\n\nMaybe with more plays something will click and it will shine.\n\nTheme of cute little gearlocks didn't do anything for me either, maybe that is the heart of the problem, just don't like the theme enough to get pulled in, but as a tactical puzzle not bad.\n\n**update played again, yup not for me. Theme doesn’t pull me in so I can’t get past the abstract battle mat, the flood of keywords and the tactical puzzles of which dice vs which baddie, and I’m not invested enough to care about the upgrade path puzzle which is baked into each character.\n\nLess bothered about the chips aspect now I’ve played with the weighted health chips, the light ones packaged with the game definitely feel far cheaper and have a tendency (at least with my clumsy touch) to shoot everywhere.\n\nWaiting on BotSE, hopefully that will be the game I was searching for that this isn’t.",
    "timestamp": 1738105200
  },
  {
    "username": "resolvecherry",
    "rating": 5.0,
    "comment": "enjoyable but very long, large and expensive. plays best with 2-3, 4 would be too crowded.",
    "timestamp": 1737846000
  },
  {
    "username": "studshooter",
    "rating": 5.0,
    "comment": "I see no reason for so much hype around this game. One star just to balance/ Definitely not for all and doesn't deserve being so high among classics.",
    "timestamp": 1733698800
  },
  {
    "username": "rozmiarek",
    "rating": 5.0,
    "comment": "I dislike ameritrash games so I could not find this ine fun but I get why others may enjoy this genre. It reminds me a lot of Cthulhu which shares the same problems as Too Many Bones - constant dice rolls, not enough strategy, not enough choices, the whole gameplay is determined by sheer luck. Personally I would give it 3/10 but since I realize it's just not my type of entertainment I will increase my rank to 5/10. Top notch production quality though that partially explains insane cost of the game.",
    "timestamp": 1726178400
  },
  {
    "username": "Scifi66",
    "rating": 5.0,
    "comment": "Interesting dungeon crawler.\n\nLikes\n+ Dungeon crawler done right\n+ Game design allows for some future planning in skills\n+ As a co-op for 2 worked well\n+ Tons of variety and depth\n+ Components are well made\n- The grid system didn't produce any amazing moments",
    "timestamp": 1724796000
  },
  {
    "username": "Fidimar",
    "rating": 5.0,
    "comment": "Very frustrating",
    "timestamp": 1723759200
  },
  {
    "username": "KubaP",
    "rating": 5.0,
    "comment": "Seemingly cool ideas that become tiring and repetitive after round 2.",
    "timestamp": 1721426400
  },
  {
    "username": "wojtolino",
    "rating": 5.0,
    "comment": "Very, very pleasant. Leaves a lot of space for exploring builds of characters. I really enjoy buying new dice and managing them during battles. Chest opening system sucks and its entry threshold is high, but I really like it regardless.\n\nEdit after second play with 4 players and another character: boring, not that many build options after all and full of downtime. A lot of unnecessary microrules.\n\nPolish version is inadmissibly bad produced - dice after 3 (!) plays are full of scratch (no, it wasn't played on a beach). Scandalous for such price.",
    "timestamp": 1719180000
  },
  {
    "username": "mindr92",
    "rating": 5.0,
    "comment": "Zero table presence , i see why people like it, but playing against chips on a playmat is not entertaining for me in an ameri",
    "timestamp": 1715983200
  },
  {
    "username": "metonymo",
    "rating": 5.0,
    "comment": "Nice components, a bit disappointing gameplay. Had some trouble connecting with the artwork too.",
    "timestamp": 1713391200
  },
  {
    "username": "Hvanboven",
    "rating": 5.0,
    "comment": "Too complicated caracters for what it is, very little story. Batlle after battle",
    "timestamp": 1710284400
  },
  {
    "username": "Red_Cavalier",
    "rating": 5.0,
    "comment": "Cool theme, but it's too much upkeep and not enough fun to make it worth it.",
    "timestamp": 1710198000
  },
  {
    "username": "Milo_ilo",
    "rating": 5.0,
    "comment": "overrated sorry",
    "timestamp": 1704927600
  },
  {
    "username": "Matouffe",
    "rating": 5.0,
    "comment": "Too expensive for what it does.",
    "timestamp": 1703804400
  },
  {
    "username": "ncc1701jv",
    "rating": 5.0,
    "comment": "Did not live up to the hype for me",
    "timestamp": 1698012000
  },
  {
    "username": "MindControlMouse",
    "rating": 5.0,
    "comment": "Dice chucking combat - dice \"budget\" is innovative but battle mat too small, most skills aren't useful, and combat feels samey after a while (mainly because skill differentiation isn't as innovative as it could be).",
    "timestamp": 1693260000
  },
  {
    "username": "woetly",
    "rating": 5.0,
    "comment": "ko andrias punya",
    "timestamp": 1682546400
  },
  {
    "username": "charlest",
    "rating": 5.0,
    "comment": "Excellent asymmetry and a feel-good skill system that increases pretty quickly. Unfortunately the combat is a little bland and the abstract board seems unnecessary. I also do not appreciate how your skills are typically one time uses and you can whiff. Have a suspicion that even though characters are pretty diverse, each will typically be built the same way upon repeated plays offering little variance within a character.",
    "timestamp": 1673910000
  },
  {
    "username": "Kalayna",
    "rating": 6.0,
    "comment": "2024: underplayed. Need to table.",
    "timestamp": 1762124400
  },
  {
    "username": "jegan22280",
    "rating": 6.0,
    "comment": "Main entry",
    "timestamp": 1761170400
  },
  {
    "username": "uncle_trogman",
    "rating": 6.0,
    "comment": "Probably a good solo game. Because downtime is too much for multiplayer. My group first tyrant encounter actually forced only one player to be on the battle mat for the whole battle until you win or lose. There is also player elimination. If you nobody has revive ability/item then you are so SOL. With all those negatives, there is no point talking about how deluxe the components are.",
    "timestamp": 1760392800
  },
  {
    "username": "ImZhe",
    "rating": 6.3,
    "comment": "Decently fun but takes a long time to play. Characters seem to have certain abilities that are much stronger than other abilities. Sometimes the monster you pull from the pile is unlucky and destroys you, most of the time it is ok. Player scaling is pretty bad, extremely difficult at 2 player and easier with more. Personally did not really feel like trying each char more than once.",
    "timestamp": 1759960800
  },
  {
    "username": "kilianbognar",
    "rating": 6.0,
    "comment": "It's too convoluted, but you have an eternity to learn every symbol of every die, because this game is never going to decompse. You can also play it under water, which is something we definitely will do.",
    "timestamp": 1759010400
  },
  {
    "username": "Pamponiros",
    "rating": 6.0,
    "comment": "Its main problem for me was that you have to keep winning in order to advance further... Base game only having just 1 card for days 1-3 in such volume is a bit...funny to say the least.",
    "timestamp": 1758664800
  },
  {
    "username": "Mageknight12",
    "rating": 6.0,
    "comment": "Sick art and dont have fail forward mechanic (enemy stronger by day). Skill dice dont interesting and feel stronger than normal combat dice",
    "timestamp": 1756936800
  },
  {
    "username": "Erundino",
    "rating": 6.0,
    "comment": "After a while the game starts showing his bones...(!!!) sometimes too swingy, getting a little repetitive ( you gonna start to see some better patterns into leveling up -- not very forgiving with experimentation).\nAlso, many times the game just plays itself.\nAnd RULES , so many tiny rules\n\nStill a good game and lots of fun.\nBut too expensive and I want my money spent on it back.",
    "timestamp": 1755554400
  },
  {
    "username": "ditterio",
    "rating": 6.0,
    "comment": "I've only played a demo of this game. Too many rules and the battles didn't seem interesting either. I don't want to dive deep in his game.",
    "timestamp": 1755208800
  },
  {
    "username": "SoloMaru",
    "rating": 6.0,
    "comment": "Too many unhealthy dice variants - and too much increasing basic stats instead of unlocking cool new abilities. Somehow with all the rules and the components, it's still feels quite limiting (only played 2 players coop, maybe will get better at higher player count because you got to specialized?, but then it is voted best for 2)",
    "timestamp": 1754258400
  },
  {
    "username": "mbiella",
    "rating": 6.0,
    "comment": "TRADE",
    "timestamp": 1753394400
  },
  {
    "username": "Alexjkls",
    "rating": 6.0,
    "comment": "boring on long term",
    "timestamp": 1753135200
  },
  {
    "username": "franagor80",
    "rating": 6.0,
    "comment": "En solo\nGrande qualité matérielle\nJe trouve les combats sans fin, longs, ennuyeux, répétitifs",
    "timestamp": 1751752800
  },
  {
    "username": "SlikkRikk",
    "rating": 6.0,
    "comment": "Really neat, tactical presentation. Works awesome for solo too. The depth of characters are amazing!",
    "timestamp": 1746741600
  },
  {
    "username": "AuVaN",
    "rating": 6.0,
    "comment": "Lots of fiddling",
    "timestamp": 1741561200
  },
  {
    "username": "philmcd",
    "rating": 6.0,
    "comment": "Loving it, but MAN I'm finding the Tyrants HARD. Early days yet though.\n\nBest component quality I've ever seen. OK you do pay for that, but you pay top dollar for many games and STILL don't get quality let alone superior quality.\n\nHave got 40 Days and Tyranny expansions too (as yet untried(\n\n2025 update. My desire to play this has diminished significantly with the release of BOTSE, which has introduced most of the elements I feel were missing in TMB.",
    "timestamp": 1741129200
  },
  {
    "username": "adel9591",
    "rating": 6.0,
    "comment": "I held off on rating this for a while, but the number of interactions in the game and truly awful rulebook just make this such a pain to play. I rarely have a game where I am confident I didn't make multiple mistakes, but there are just too many things to look up.\n\nFurthermore, for all the content that is included, you will probably only use half of it. Most of the skills are so unhelpful that it is better to just use skills points to add basic stats to your character. It's one of my most played games, probably close to 30 plays and I still haven't used some skills and don't anticipate ever doing so. The adventures are too tight to waste even a single skill point.\n\nThe monster progression is weird and unintuitive. Worst of all though, is the monster difficulty rule. Making the difficulty based on the day has ruined so many scenarios for me. If I didn't have the skill to succeed in one battle, why would the game expect it to succeed with the exact same skill set in a harder battle? Maybe make the difficulty based on progress, not day. I've learned to pack up the game if you fail two scnarios. It will just snowball from there.\n\nAll that said, the game is undeniably fun. Something about picking skills to roll and chucking a bumch of unique dice is such a blast. But there's a lot that gets in the way of the fun factor here.",
    "timestamp": 1738191600
  },
  {
    "username": "Sentinel025",
    "rating": 6.0,
    "comment": "Need to play this more to see if this score is final. I don't quite see what all the hype is about. But we'll see.",
    "timestamp": 1737241200
  },
  {
    "username": "jarzynek",
    "rating": 5.5,
    "comment": "After one play - 6",
    "timestamp": 1734390000
  },
  {
    "username": "Sir Gustav",
    "rating": 6.0,
    "comment": "We spent a couple hours trying to learn the rules from videos, but ultimately gave up after one round of combat, because it just seemed to cumbersome to learn all those keywords and asymmetric abilities. There was many questions we had that I could not find the answers to in the rulebook, so we cut our losses and moved one. I think the component quality is stellar, and if you pick this game to be the one game you play over and over it might be worth it, but for us this just didn't seem worth it to get into.",
    "timestamp": 1733007600
  },
  {
    "username": "Boroslegion",
    "rating": 6.0,
    "comment": "Ok, but way too long and way too less to do, throw the dice, live or die with it. Nothing more and nothing less",
    "timestamp": 1732230000
  },
  {
    "username": "Kibald",
    "rating": 6.0,
    "comment": "Soloable\n10 best solo games according to zeugma en solo",
    "timestamp": 1731366000
  },
  {
    "username": "Sir Pent",
    "rating": 6.0,
    "comment": "Basically an RPG turned into a board game. The story takes a backseat to the tactical battles and the character development. The game also takes a really long time to finish, and seems anti-climatic because characters are so awesome by the end that the big boss is a pushover. But it's a fun journey along the way.",
    "timestamp": 1729461600
  },
  {
    "username": "Hegiel",
    "rating": 6.0,
    "comment": "Good - usually willing to play. Very good quality of components. Age of Tyrrany makes this game significantly better to me.",
    "timestamp": 1728511200
  },
  {
    "username": "Nuvium",
    "rating": 7.0,
    "comment": "Good at first, quickly becomes tiresome.",
    "timestamp": 1762297200
  },
  {
    "username": "banditwins",
    "rating": 7.0,
    "comment": "Little bit of getting used to the rules, but overall really enjoy this one. Lots of variety with different gearlocs. Tons of dice rolling and character customization.",
    "timestamp": 1761865200
  },
  {
    "username": "Rachelyen0716",
    "rating": 7.0,
    "comment": "第一次玩這遊感覺戲規則比較複雜，人物角色的功能都不同，邊玩要邊看說明書，在與怪獸對戰的時候要看每隻怪獸的打仗方式都不同，需要邊打邊看說明書，也需要策略將角色擺放不同位置，以防被怪獸打敗",
    "timestamp": 1761343200
  },
  {
    "username": "kfbunny",
    "rating": 7.0,
    "comment": "It is fun to play, but it is way too long. Our game lasted for 7 hours ! I guess players didn't rush but still...\nThe skill tree is nice, the mechanic too, but it still simply is a 4x4 grid with tokens moving slightly on it before rolling dice to hit.\n\nrating history\n1st play: 7",
    "timestamp": 1760911200
  },
  {
    "username": "Kaya82",
    "rating": 7.0,
    "comment": "Innovative game, with very good materials and an unique style gameplay. Best for 1-2. Maybe better with expansions. Full cooperative.",
    "timestamp": 1760738400
  },
  {
    "username": "lewelen",
    "rating": 7.0,
    "comment": "Interesting design, great components. Too many times, it feels like the interesting thing to do is the suboptimal thing to do, which made me feel like the game got extremely repetitive despite its initial facade of variety",
    "timestamp": 1759874400
  },
  {
    "username": "Stingart",
    "rating": 7.0,
    "comment": "Just OK, but overprized.",
    "timestamp": 1759615200
  },
  {
    "username": "Weirdsalmon",
    "rating": 6.5,
    "comment": "6.5/10: Too many bones is an insanely overproduced cooperative adventure game where you try to go into a scenario, gain skills and power up to take on a boss. You fight enemies on a grid map using dice that you can unlock and add more to your pool.\n\nThe quality of components here is astoundingly good (chip theory) but the usability of some of those things (day tracker, enemies) is not where I would want it to be. Enemies' info is very small and can be hard to read quickly and often require me(someone with perfect vision) to pick up the enemy to read it. The combat map is very small and positioning yourself is not much of the game and I left wishing there was more to do in each map. Because the map is always the same, battles didn't feel that unique.\n\nEach character is unique with very large play aids that differentiate each of them. They all have their own unique pool of dice to build from which allows you to try different things each time you play. This is fun albeit restrictive in many ways. The level of customization is not insanely high like in The Elder Scrolls: Betrayal of the Second Era.\n\nThe missions and story are simple, but interesting and the game is quite hard if not played at the easiest difficulty. I don't mind hard games, especially not coop games, but Too Many Bones can really suffer if you fail at missions. Each one you fail leaves you further and further behind where you need to be to win and can really snowball you in an unfun way. Rolling your awesome custom dice is super fun, but you don't get to do it that much and I was left wishing I could have had more chances to roll than I had. Combat is quite quick, especially if it goes well for you, and often if it goes very badly it can also play fast.\n\nI have to mention the Keywords. There are simply WAY too many keywords and it results in the beginning and during battles looking like this;\n'New enemy comes out'\n\"Oh, it has Thick skin... what does that do.\" some reading later \" oh and it has Mischief what's that do?\" followed by more reading.\n\nI find this super clunky and there are so many keywords I can't see myself memorizing them and breaking out of this clunky flow.\n\nIn general, I had fun playing and will play more, but I am not rushing to play more. There is enough that I have gripes with here and I just don't see gameplay becoming smooth without 25+ plays and I just don't know that I like this game enough to invest that time with it.",
    "timestamp": 1759269600
  },
  {
    "username": "gergivt",
    "rating": 7.0,
    "comment": "Dice-building RPG\n\nBest at 3-player.",
    "timestamp": 1758664800
  },
  {
    "username": "mephezar",
    "rating": 6.5,
    "comment": "The game mechanincs are good, but does not catch me.\n\nI don't like the illustration and game material, like the flabby player boards",
    "timestamp": 1758492000
  },
  {
    "username": "FrayedEdges",
    "rating": 7.0,
    "comment": "There are some good things about this game, and it could rank higher. But cost and flaws drag it down. A fun game that is overproduced and seems under-playtested. Long to set up, large rules overhead, subject to random losses. Be aware: the expensive, one of-a-kind dice needed to play can (and do) lose their heat press faces over time.",
    "timestamp": 1757887200
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 7.0,
    "comment": "Too Many Bones is very close to being a \"lifestyle game\". Experience with how to operate a character can really pay off. As you experience the RPG-ish game, your party progresses through various encounters, eventually culminating in a big Boss-Battle as the climax.\n\nI jumped down this rabbit hole, getting all game-play expansions. My Trove Chest contents:\nCore Game\nAdventure Mat\nUndertow\nGasket\nGhillie\nLab Rats\nNugget\nRiffle\nSplice & Dice\nTink\nCarcass\nStatic\nPolaris\nChip Theory Games 2021 Promo Pack, which includes:\n- Stanza Chip (alternate)\n- Stanza's 2 alternate attack dice\n- Grim Reaper Nugget Chip (alternate)\n- Truffalo 5pt Baddie Chip\n- Amped Grenades Loot Card\n- Luitar Blade Sharpener Trove Loot Card\nCrossover Loot Promo Pack, which includes:\n- Command Module Loot Card\n- Convoluted Hummingbird Loot Card\n- Duskbreaker Trove Loot Card\nAlly Pack, which contains:\n- 3 of Ghillie's wildlife companions\n- 3 of Tink's Spiderbots\nGearloc Child\n\nHere are my notes on the various Gearlocs:\nCORE GAME\nBoomer - My wife’s favorite. A glass cannon, but fun.\nPatches - Very useful for the healing.\nPicket - My most played Gearloc. A real tank.\nTantrum - Fun, a bit confusing, berserker.\nUNDERTOW\nDuster -\nStanza - confusing, fun with music\nUNBREAKABLE\nFigment - looks interesting, time manipulator\nGale -\nEXPANSION GEARLOCS\nGhillie - wannabe beastmaster. Need to play again to master the traps\nNugget - I am forgetting…. Need to play again\nTink - confusing robot maker\nGasket - a friend played it. Interesting armored tank.\nDart -\nLab Rats - I misplayed these badly. Need another go.\nRiffle - looks fun, crazy card subgame to master\nCarcass -\nPolaris -\nStatic -\n\nKeep (obviously)",
    "timestamp": 1757628000
  },
  {
    "username": "davidxiang",
    "rating": 8.0,
    "comment": "骰子加点还蛮有意思的",
    "timestamp": 1762124400
  },
  {
    "username": "FridleifFaehn",
    "rating": 8.0,
    "comment": "Prima Ding! Kooperativ, Abenteuer, zunehmend fordernd.",
    "timestamp": 1762038000
  },
  {
    "username": "PBandJellyfish",
    "rating": 8.0,
    "comment": "@SC",
    "timestamp": 1761170400
  },
  {
    "username": "Kangri",
    "rating": 8.4,
    "comment": "Une brillante campagne qui se termine lamentablement par une rapide défaite face à un boss surpuissant : c'est le lot de nombreuses parties de ce jeu qui cumule pourtant beaucoup de bons côtés : un matériel remarquable, une mécanique de dés bien pensée qui allie l'amélioration de personnage façon RPG et la richesse de combats tactiques. Chaque tour est un casse-tête et la variabilité des situations permet un bonne rejouabilité. Seule critique, j'aurai aimé qu'un tirage aléatoire des personnages offre toujours une chance suffisante de victoire ce qui n'est pas le cas.",
    "timestamp": 1760997600
  },
  {
    "username": "Infernity",
    "rating": 8.0,
    "comment": "Love this game, but its high barrier to entry gets exponentially worse with more players.",
    "timestamp": 1760652000
  },
  {
    "username": "Not_People",
    "rating": 8.0,
    "comment": "Fun tactical game with interesting character/party building. Great at two players. Lots of ways to play with the expansions. Pricey, but that's due to Chip Theory always using premium materials. Surprising tactical depth for a game that plays on a 4x4 grid. However, some characters have much stronger builds than others leading to much easier wins with certain party make-ups. And the thematic elements could be stronger. These two cons keep the game from getting to the table more often.\n\nAnd we put the collection up for sale so we can try out the Elder Scrolls version. Seems like it might feel a bit more \"adventure-y\".",
    "timestamp": 1760479200
  },
  {
    "username": "thefatcyclist",
    "rating": 8.0,
    "comment": "***VI-3",
    "timestamp": 1759874400
  },
  {
    "username": "Warlock_bylandt",
    "rating": 8.0,
    "comment": "+ 40 Days in Daelore + Age of Tyranny + Dart + Gasket + Ghillie + Lab Rats + Nugget + Splice & Dice + Tink + Undertow",
    "timestamp": 1759442400
  },
  {
    "username": "retlom",
    "rating": 8.0,
    "comment": "Good but very overwhelming at first it took like 2-3 hours to properly finish my first round.",
    "timestamp": 1759442400
  },
  {
    "username": "Adri_corr",
    "rating": 7.5,
    "comment": "(1, 4) #players\n\nJugado:\n\nNom (KO)\nDrellen (KO)\nMulmesh (KO)\n\n160€ Core+40days",
    "timestamp": 1759010400
  },
  {
    "username": "adi_venturer",
    "rating": 8.0,
    "comment": "This will be a bit of an oddball review since I am unsure how to approach this. I have only ever played this game twice. I was a huge fan of the game after my first play. The system is incredible with so much potential to expand the game in different directions - something that TMB has done very successfully. TMB is an exceptional game that gives me a lot of what I look for in a game.\n\nThis was before I had played Elder Scrolls: BotSE though. My second play of TMB was after 25+ games of BotSE and I found myself missing some of the enhancements that BotSE has made to the system. So it is hard for me to judge this game, because after all, there would be no BotSE without TMB.\n\nTo be more specific, I do love the custom characters that TMB comes with. It gives them personality - something you won't get with the characters you build in BotSE. Plus, each character seems to have at least 2 distinct build paths you can take, making them feel different with every play. TMB is a lifestyle game. As is BotSE though. Other than the individual personalities for characters, I think BotSE does everything better than TMB. The character building is a lot more interesting with near infinite build paths. I also felt the tenacity system is better than the bones system in multiple ways: it doesn't lock your dice, the abilities are more powerful/relevant, and there are more ways to get tenacity than just rolling misses. TMBs skill dice also feel less relevant since they are one time use per battle. So most of the time you are just rolling your standard attack/defend dice, making the skill dice feel less important. BotSE with its cooldown track is a much better system. Then there is the whole overworld system, which allows you to choose the type of encounter you want as opposed to being locked into one.\n\nAll in all, I will never turn down a game of TMB, but sadly with BotSE around, I don't find myself looking for a lot of reasons to seek out TMB.\n\n(Plays: 2)",
    "timestamp": 1758924000
  },
  {
    "username": "KanChri",
    "rating": 8.0,
    "comment": "20",
    "timestamp": 1758578400
  },
  {
    "username": "Kamil2310",
    "rating": 9.0,
    "comment": "+ Too Many Bones: 40 Caves in Daelore (English edition)\n+ Too Many Bones: 40 Days in Daelore (English edition)\n+ Too Many Bones: 40 Waves in Daelore (English edition)\n+ Too Many Bones: Age of Tyranny (English edition)\n+ Too Many Bones: Carcass (English edition)\n+ Too Many Bones: Crossover Loot Promo Pack (English edition)\n+ Too Many Bones: Dart (English edition)\n+ Too Many Bones: Gasket (English edition)\n+ Too Many Bones: Ghillie (English second)\n+ Too Many Bones: Lab Rats (English edition)\n+ Too Many Bones: Nugget (English second edition)\n+ Too Many Bones: Polaris (English edition)\n+ Too Many Bones: Rage of Tyranny (English edition)\n+ Too Many Bones: Riffle (English edition)\n+ Too Many Bones: Static (English edition)\n+ Too Many Bones: The Gearloc Child Promo (English edition)\n+ Too Many Bones: Tink (English third edition)\n+ Too Many Bones: Unbreakable (English edition)\n+ Too Many Bones: Undertow (English edition)\n+ Too Many Bones: Adventure Map 2.0\n+ Too Many Bones: Unbreakable Adventure Map\n+ Too Many Bones: BrassMag Figures\n+ Too Many Bones: Ally Pack\n+ Cloudspire: Premium Health\n+ Chip Theory Games: Promo Pack 2022 (English edition) (2022)\n+ Too Many Bones: 12 oz. Coffee Promo Card (English edition) (2022)\n+ Custom Made \"Trove Chest\"\n+ Sleeves\n+ 2x Dicetray",
    "timestamp": 1762470000
  },
  {
    "username": "saneangel",
    "rating": 9.0,
    "comment": "Premium Chips\nGreat Condition\nAll TMB stuff prefer to sell/trade together",
    "timestamp": 1762124400
  },
  {
    "username": "Benncory",
    "rating": 9.0,
    "comment": "Solo",
    "timestamp": 1761429600
  },
  {
    "username": "ZaharAlone",
    "rating": 9.0,
    "comment": "It's a pretty cool adventure game. I've played over 15 solo games, sometimes with one or two Girllocks. I definitely like it. The only thing is that it seems to have some balance issues: not all Tyrant and Girllock combinations play out well enough; sometimes it gets quite tedious, and you constantly have to look up the rules. Overall, I love this game and will continue to play, but unfortunately, it's not perfect. I hope Chips manage to overcome this in future bases.",
    "timestamp": 1760997600
  },
  {
    "username": "lethan",
    "rating": 9.0,
    "comment": "Maybe?",
    "timestamp": 1760652000
  },
  {
    "username": "MorcarCadarn",
    "rating": 8.5,
    "comment": "Provisional score after about 4-5 solo 2-haned plays. Enjoy the core gameplay very much.",
    "timestamp": 1760047200
  },
  {
    "username": "Vandsten",
    "rating": 9.0,
    "comment": "w/ all expansions",
    "timestamp": 1759356000
  },
  {
    "username": "kipernicus",
    "rating": 9.0,
    "comment": "Best solo. Each character plays very differently, which I love. Some are better than others and occasionally I'll have a play-through that feels like a bit of a dud. Generally, I have a really good time though and I find myself drawn back to this game again and again.",
    "timestamp": 1759096800
  },
  {
    "username": "serFarid",
    "rating": 9.0,
    "comment": "Core, Lab, four extra gearlocks, and trove drawers.",
    "timestamp": 1759096800
  },
  {
    "username": "Valerio79",
    "rating": 8.5,
    "comment": "158.99€\n\n19€ - Too Many Bones Adventure Map\n10€ - Ally Pack\n150€ - Trove chest\n\n\nBundle 758€ - 500€ vendita",
    "timestamp": 1758837600
  },
  {
    "username": "superwai28",
    "rating": 9.0,
    "comment": "This game changes my thoughts on dice games. Essentially, there is no failed rolls but a change in timing to execute your dice outcomes. This is a really good mechanism which creates a lot of tactical decisions in each battle. I normally dislike games with die, though I try to embrace it, but when it comes to the much which significantly changes your fate, I don't enjoy it anymore. Too Many Bones gives me a fresh perspective on how dice game can be managed.",
    "timestamp": 1758319200
  },
  {
    "username": "PrestickNinja",
    "rating": 9.2,
    "comment": "What a fantastic production - need to sit and sink some serious time into the game... Keyword salad!",
    "timestamp": 1757973600
  },
  {
    "username": "Opie",
    "rating": 9.5,
    "comment": "Believe the hype. The Goblin King is a 3-1/2 hour campaign but easily accomplished on a long game day or split between game nights. The other villains are unique challenges that will last longer and test your skill and patience. TMB is a master’s class in overstuffed, awkwardly-produced gaming... but any changes to it would feel significantly less epic.\n\nThe only thing keeping TMB from a full 10 is the fact that the full experience costs more than a damned XBox.",
    "timestamp": 1761778800
  },
  {
    "username": "etcjensen",
    "rating": 9.5,
    "comment": "Insert OK",
    "timestamp": 1760997600
  },
  {
    "username": "zuperztar",
    "rating": 10.0,
    "comment": "Includes everything, will always have a spot in the Kallax with the Trove Chest.",
    "timestamp": 1759442400
  },
  {
    "username": "Zippy42",
    "rating": 10.0,
    "comment": "Also Own:\n-Trove Chest and most all expansions.",
    "timestamp": 1759010400
  },
  {
    "username": "Arah",
    "rating": 10.0,
    "comment": "----------------------------------------------------------------------------------------------\nWhy not a 10?\nIt is a case of the game having enough replayability but not infinite replayability. While many of my favorite gaming moments have come from this game, it is due to particular cards that either you experience once and the novelty wears off. These moments will get rarer over extra plays. Another reason is that before mastering the game it is a fun puzzle, but once you do it one needs a curated pool of baddies and combat boils down to a particular order of upgrading stats and a few skills. The game thus loses its replayability. The baddie and card systems are good, but stat vs skill and skill vs skill balance is bad (the game balance throws you vertically scaling challenges with increasing raw stats, giving more importance to rolling more dice each turn vs one time use skills or skills that offer lateral value, and the skills themselves are not balanced with each other, leading to just one optimal build). Also losing vs winning a combat makes a huge impact, leading the game to be played more of as a roguelike survival experience. But then the playtime varies wildly, from 30 minutes to 4 hours. Another problem is the tyrants. None feel epic. They could take some inspiration from KDM. Some extra health could at last make the battle feel more epic, but the newer ones starting from S&D are just frustrating to defeat, not epic.\n----------------------------------------------------------------------------------------------\nMicro Review:\nToo Many Bones is a combat based adventure with a boss fight and a high power curve 'fantasy-steampunk' game.\n----------------------------------------------------------------------------------------------\nPlayers:  /  / \nCooperative Heavy Ameritrash Character Building\nA joy to play, but ambiguous in rules.\nTheme:  \nSkill:  \nReplay: \nFun:    \nToy Joy:\n----------------------------------------------------------------------------------------------\nWhy I love it?\n-Quirky theme, creative events, character growth, rich tactical combat and boss battles.\n-The solid, toy-like components are a joy to move around and engaging.\n-The simple turn structure flows well.\n-It doesn't need inserts nor sleeves, so you waste 0 on 3rd party accessories.\n-Replayability given by the gearloc combinations, their builds at a specific point in time and the random baddies all form unique puzzles each time.\n\nSome of its limitations:\n-You can't opt out of expensive premium components. Ironically, the component out of all that needed the most to be premium was the Premium Health Chips, which are an add-on (due to the standard ones being slippery).\n-Unbalanced: stats are way better than most skills, limiting builds. Many baddies are unbalanced and so are encounter rewards (training rewards are much better, maybe except for some unique rewards).\n-Inconsistent experience: some games will be so so or even bad, with an amazing game here and there.\n-Downtime reading the reference sheets, rules or seeking answers online. Learning a gearloc is like learning a small to medium game in a single sheet, where sometimes 2 full sized ones were necessary. This is another case of being stingy precisely where one didn't need to be stingy.\n-Tyrants are a weak point: pre-Splice&Dice tyrants are underwhelming (except for Goblin King and Gendricks). S&D tyrants are frustrating to defeat.\n-If you play enough, it becomes too easy. See variants for how to increase difficulty.\n\nPlayer Scaling:\nThe game works best with 2-3 gearlocs. 1 is very swingy, and 4 tends to be a spiral of easy. The board also fits 2-3 gearlocs better.\n\nStarter Kit:\nUndertow is an excellent starter packed with a ton of value, and is one of the most expandable standalones. Premium chips are a must. Core Set and additional gearlocs are also very good.\n*Expensive entry point: Undertow, Core Set, Premium Chips, Rage of Tyranny, Gasket/Ghillie/Dart, 40 Days in Daelore, Splice&Dice.\nUnbreakable is a good entry point if one wants to limit the buy in price of the game, which can get ridiculously high otherwise. I would go:\n*Cheap entry point: Unbreakable, Premium Chips, 40 Caves in Daelore, Gasket/Ghillie/Dart.\n\nAlternatives:\n-Dungeon Fighter is a crazy ameritrash crawler.\n-Bullet is a lighter, cheaper alternative with a puzzly grid and hero/boss match up asymmetry.\n\nResources:\nTMB Chronicles: Vapor Patches\nTMB Chronicles: Outboomed\nBuild-A-Tyrant modification:\n-Instead of drawing 2 1pt and 2 5pt from S&D, draw a random 5pt from the baddie pool, and assign as normal initiative, health, attack, defense. But also assign the tyrant dice equal to the baddie's type(s) and also put that baddie into the BAT skills. This is normal difficulty. For higher ones, you can try repeating this with a 5pt again or instead draw a 20pt.\n-Extra Splicing: Center hole of lab mat is labeled 0. In this space goes the first defeated baddie, the next onto 1, then 2, ... up to 4, which holds up to 5 baddies maximum. When resolving the Splice at end of battle, the center baddie always counts for all splices as the 3rd baddie.\n-BAT cap. If BAT attempts to increase a track/stat/slot where it already has the maximum, instead increase another track/stat/slot.\n-Streamlined Splicing: No longer use a bag with 10 splice dice. Use 4 dice only and roll. Wherever the dice land, pick them up in English reading order (top most and if 2 are tied, leftmost). The 4 dice to be used are as follows:\n-Tyrant/Tyrant/Targets/Targets/ExtraBaddies/ExtraBaddies\n-Attack/Attack/Targets/Targets/ExtraBaddies/Ranged\n-Skill/Skill/Ranged/Ranged/Targets/ExtraBaddies\n-Attack/Attack/Defense/Defense/Health/Health\nHigher difficulty variant:\n-Lose when all your gearlocs get KO'd in a battle.\n-Remove all weak baddies, use all baddie types regardless of tyrant.\n-Signal: always calls a 5pt baddie (except in the initial days).\n-Raiding: also counts the baddie itself.\n-One Mind: counts every other baddie, not only beasts (may be overturned, the other option is to also activate itself, One Mind can only be activated once per turn. This means, regardless of how many One Mind's there are, if every beast does not get KO'd and gearlocs don't lose before, every beast would attack twice).\n-Double tyrants: Fight against 2 tyrants at the same time!\n-Gendricks: is hardier (can only take 1 damage per round).\n-Overclocked Nobulous: roll both dice 3 times instead of once.\n-Build a Tyrant: Center space is space 0. Place first defeated baddie here, and it counts as adjacent for all 4 dice. Do the initial splice with all baddies (not only from S&D). From the initial splice, also select one 5pt baddie to place in the BAT skills area and one type among all to add as tyrant die.\nTantrum re-balance: Have Tantrum always have its lowest available rage die in its active slot, and always advance to the next available die. This means you can use rage 2 > 1 > 3 or 3 > 2 > 1, or not get as badly screwed with mischief. Axe Collector BP to give 2 axes instead of 3 (alternatively, make each axe deal only 1 damage). As it stands, Tantrum can deal massive damage and tank/heal himself forever with just a defense investment, too strong. And rage is just too fragile, particularly with mischief around.",
    "timestamp": 1758578400
  },
  {
    "username": "Dalp",
    "rating": 10.0,
    "comment": "I own every CTG game except Triplock, and Too Many Bones is not only my favorite from them but also my number one game of all time, with 250+ hours played. This is a true lifestyle game-full of deep, tactical gameplay and endless moments of puzzling out unique interactions between its many mechanics. TMB thrives on its evolving, dynamic rule set, keeping every session fresh and engaging. A downside for this is the game can also lead to many ambiguous moments resulting in a LOT of time spent in forums and the rulebook.\nRecently started playing The Elder Scrolls: Betrayal of the Second Era, lets see if it can challenge TMB's throne.\n\nEdit: even though I both rate tmb and elder scrolls a 10, tmb is easier to recommend and learn.",
    "timestamp": 1757973600
  },
  {
    "username": "pavlyuchenko",
    "rating": 9.5,
    "comment": "What surprised me the most was the depth of combat on a simple 4x4 grid. Wow",
    "timestamp": 1757628000
  },
  {
    "username": "LoquaciousMonk",
    "rating": 9.5,
    "comment": "With:\nToo Many Bones: Unbreakable\nToo Many Bones: Riffle\nToo Many Bones: Nugget\nToo Many Bones: Ghillie\nToo Many Bones: Gasket\nToo Many Bones: Polaris\nToo Many Bones: 40 Days in Daelore\nToo Many Bones: 40 Caves in Daelore\nToo Many Bones: Age of Tyranny\nToo Many Bones: Crossover Loot Promo Pack\nToo Many Bones: Forbidden Gems Promo Card\nToo Many Bones: The Break Keeper and Undertow Campaign+ Card Pack\nToo Many Bones: The Great Gathering Promo Card\nToo Many Bones: Book of Secrets Promo Card\nToo Many Bones: Box of Endless Adventures Promo Card\nToo Many Bones: Ace in the Troll Card Pack\nToo Many Bones: Nexus Box\nToo Many Bones: Riffle – Jokers",
    "timestamp": 1756764000
  },
  {
    "username": "Christopher_CS",
    "rating": 10.0,
    "comment": "I love this game it is the ultimate dungeon crawl!",
    "timestamp": 1756677600
  },
  {
    "username": "chileoz",
    "rating": 10.0,
    "comment": "Try to play in China",
    "timestamp": 1756591200
  },
  {
    "username": "PhiloKyle",
    "rating": 10.0,
    "comment": "Easily in my top 3 favorite games right now.",
    "timestamp": 1756418400
  },
  {
    "username": "SochaDJ",
    "rating": 10.0,
    "comment": "Very tactile game, great component quality. The Gearlocs are very interesting, and like the decisions of how to progress them. Battles are mini puzzles of how best to use a Gearlocs skills, loot, and dice composition to defeat the enemies. Unlike popular opinion, I did not find this game difficult to learn. The rulebook is a quick read, and does an adequate job explaining things, though I suspect its organization could be better because without the index, it was difficult to find things.\n\nExpansions:\nToo Many Bones: Nugget (2017)\nToo Many Bones: Polaris (2023)\nToo Many Bones: Unbreakable (2023)\nToo Many Bones: Undertow (2018)\nToo Many Bones: Gasket (2018)\nToo Many Bones: Tink (2017)\nToo Many Bones: Lab Rats (2020)\nToo Many Bones: Dart (2020)\nToo Many Bones: Ally Pack\n\n(S)",
    "timestamp": 1756072800
  }
]