[
  {
    "username": "benjaminehlers1",
    "rating": 1.0,
    "comment": "I can't believe a game this terrible is in the top 100 on BGG. Agricola is a long and tedious game with zero fun. I wish I could give a rating lower than 1, perhaps negative-infinity? The absolute worst part in this game is having to feed your workers... talk about a complete waste of time that just drags out an already tedious game. It's soooo punishing not to feed your workers that I can't imagine anyone choosing to not feed their workers or accidentally forgetting to feed their workers. Which means that if everyone is essentially forced to divert a significant amount of workers just to gather food all accomplishing the same thing every turn, then it is a pointless waste of time added to a pitifully long and boring game. That's like making a rule that says \"you have 7 workers to place, but each round you must discard 4 of your workers and only use the remaining 3... But you can't just discard the 4 workers, you need to spend 15 minutes per worker you discard trying to figure out the most optimal way to discard each worker...\" Blegh,...",
    "timestamp": 1762297200
  },
  {
    "username": "MouseWax",
    "rating": 1.0,
    "comment": ":angyface: :axe:",
    "timestamp": 1742425200
  },
  {
    "username": "bernstein82",
    "rating": 1.0,
    "comment": "No interaction / Multiplayer Solitaire",
    "timestamp": 1729720800
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "The narrative of the game is cute. It just feels weird how much the game has to encourage you to do a variety of tasks (instead of just one) by altering the points. It's barely okay, but the advanced modes with all the special cards kinda kills it for me, and that's how everyone insists on playing it now anyway.",
    "timestamp": 1722722400
  },
  {
    "username": "firemage85",
    "rating": 1.0,
    "comment": "I despise this game. All the excitement of watching paint dry. I have never disliked playing a board game as much as this one. I like Euro-games, but this game is mind-numbing, and the theme is dull. Please, stay away from the game. PLEASE.",
    "timestamp": 1720994400
  },
  {
    "username": "hamsternice",
    "rating": 1.0,
    "comment": "I don't like this game because it is a very busy game that takes so long to finish and so many things to do and trying to race other players to an action space because there is only one per player for that space.",
    "timestamp": 1694296800
  },
  {
    "username": "DaveyJJ",
    "rating": 1.0,
    "comment": "One sentence summary: Agricola is the least favourite game I've ever had the misfortune to play in more than 50 years of gaming (and I have played some seriously awful games). But don't take my word for it, here are some other enlightened and honest opinions about Agricola ...\n\n\nQuote:\nAgricola is 45 minutes per player of slamming your dick in a door. -- Jedit\nQuote:\nI'd rather watch paint dry or grass grow. -- gittes\nQuote:\nMy memory of playing this game makes me want to barf. -- sbconstant\nQuote:\nMisery Farm. -- Unknown BGG member\nQuote:\nThe Coldplay of modern boardgaming. Fucking boring and inexplicably successful. -- Abiezer Coppe\nQuote:\nI've never been waterboarded but I imagine the experience is comparable to Agricola. -- SamuraiBudgie\nQuote:\nI would rather trade an eye than play this game. -- WhimsicalOne\nQuote:\nAll the excitement of 16th century farming. -- cooler king\nQuote:\nGoes down like a mouthful of runny sheep droppings. -- bob_the_goon\nQuote:\nAn abomination that made me re-think my life. -- airjudden\nI'm a gamer's gamer. Been boardgaming and wargaming as a hobby since 1969. I love Euros and wargames. I should like this one. Nope. Never again. Awful. Brutal, nasty, cut-throat, passive-aggressive bullshit, stressful, un-fun.\n\nI'd rather undergo root canal work ... without freezing. I'd rather spend three hours in a quiet, dark corner poking myself in the eye with a dull pencil or rusty spoon while listening to Donny and Marie music. I would not play this game again even if you offered me US$1,000 (really). I'd rather play Candyland.\n\nTechnically, I should rate it a \"1.1\" since my opinion of the game somewhat matches BGG rating system definition for a \"2\" ... Extremely annoying game, won't ever play this again. It's much closer to the definition of a \"1\" rating though, however it's not fully \"broken\" as a \"1\" rating requires (though the uneven luck-of-the-draw cards and absolute blocking mechanic [especially when this is done purely for spiteful reasons] pretty much do make it broken in my opinion, since there is no way to recover from these two things). But both of the other two requirements for a 1 rating certainly hold true ... Defies description of a game. You won't catch me dead playing this. Since I agree with two of the three criteria a 1 requires, a 1 is what it rates.\n\nAgricola is the only boardgame I've ever quit half-way through a game (my fourth game, so three-and-a-half plays suffered through) because I was so crazy bored and stupidly frustrated with the absolute choice denial blocking mechanic and the ungodly slow pace and length this game takes. It's also a much meaner game than most of it's fans will acknowledge despite it's friendly little veneer, and it's a game that railroads you to having to do something with little variation in your choice of what to do. Any game that encourages the sort of behaviour where players yell out \"I shall build fences just so you can't!\" is nothing but a spiteful mind-fuck of a game, and a lot meaner than I want to play.\n\nBoring as hell. Never again, I can't even stand the sight of the game, honestly.\n\nI have turned down money to play this game again. I hate Agricola that much. I absolutely refuse to ever play this \"game\" again.\n\nDoes it deserve it's high rating? I guess, and I do acknowledge that it is a very good game for many people, but I have no real idea why, since it's the complete opposite of fun in my opinion. Can I honestly and without malice rate it a \"1\" based on BGG's definition of a what constitutes a 1 or 2 for how I define/rate games? Absolutely.",
    "timestamp": 1676934000
  },
  {
    "username": "Levydrogo",
    "rating": 1.0,
    "comment": "Truly dull game. Rates alongside Catan for the most pointless games I’ve ever played.",
    "timestamp": 1674514800
  },
  {
    "username": "Czechfan",
    "rating": 1.0,
    "comment": "Sterile and essentially a solitaire game.",
    "timestamp": 1657576800
  },
  {
    "username": "meeplestory3",
    "rating": 1.0,
    "comment": "31.5 x 27.2 x 7.0 cm 2.2 kg 1-5P 3.64/5",
    "timestamp": 1646607600
  },
  {
    "username": "christhomas226",
    "rating": 1.0,
    "comment": "boring",
    "timestamp": 1641250800
  },
  {
    "username": "andrebr",
    "rating": 1.0,
    "comment": "30–150 Min 1–5 Players p1 p2 p3 p4 p5 Weight: 3.64 / 5",
    "timestamp": 1632002400
  },
  {
    "username": "TertiaVigilia",
    "rating": 1.0,
    "comment": "No connection to farming (except the wooden animal pieces) whatsoever. You compete against players for action places. Solo mode is completely boring, just going for a better high score.\nYou would expect that the developers spend at least a few minutes learning about farming mechanics and how to incorporate them in a board game. Last but not least, the drawings are pre-school level at best. Disappointing game.",
    "timestamp": 1625436000
  },
  {
    "username": "Ganadai",
    "rating": 1.0,
    "comment": "As far as worker placement games go, this is garbage. Antisocial game with boring theme and one strategy to win. If you don't know that one strategy you're SoL. Publisher used cheap pieces, and changed colors after printing rules making wood and clay colors confusing and backwards from every other game. Save your money and buy Stone Age or Lords of Waterdeep instead. *EDIT* The game has been revised 7 times, fixing some of the issues I have with the original version.",
    "timestamp": 1623535200
  },
  {
    "username": "5mokus",
    "rating": 1.0,
    "comment": "Tactical \"1\"\nThe new version is strictly better.",
    "timestamp": 1598220000
  },
  {
    "username": "geekopoulos",
    "rating": 1.0,
    "comment": "Boring antiquity for nolstagic gamers that miss the old days. Best comment i saw about this game a multiplayer solitaire game.",
    "timestamp": 1581289200
  },
  {
    "username": "toober",
    "rating": 1.0,
    "comment": "Poorly written 9 page rule book with an index that went nowhere. We gave up after 30 minutes of trying to figure out how to set it up.",
    "timestamp": 1561672800
  },
  {
    "username": "Clwe",
    "rating": 1.0,
    "comment": "Here on the Internet, specialized abbreviations are often used as a form of shorthand. The most prevalent occurrence would most likely be LOL, short for laughing out loud. Used as a way of expressing laughter in a medium that is not conducive to auditory feedback, it's a common cue. Another example is IMO, or in my opinion.\n\nSome may believe a falling level of literacy is implied by the habitual use of such quasi-words, but they're really quite handy. Either WTF or POS could be used as a quick way of referring to this game, since they encapsulate the experience in a brief, pithy manner.\n\nPerhaps I should have just started (and ended) this comment with WTF or POS...",
    "timestamp": 1556834400
  },
  {
    "username": "airjudden",
    "rating": 1.1,
    "comment": "How bad is Agricola? Let me bore with a story that best describes it.\n\nWhen I got back into gaming around 2009, I was exposed to Eurogames. I was an old school wargamer, who had been out of the loop for 25+ years, which had dulled my senses, so I was really digging Euros. I had yet to play any of the revered \"top 10\" on BGG, and then a well-intentioned soul invited me to play Agricola. Oh goodie, the #2 ranked game!\n\nIf you are familiar with Lord of the Rings, I was like King Théoden of Rohan and Euros were like Wormtongue. As I \"play\" Agricola (and I use \"play\" generously, as that implies some level of fun), I start waking up and seeing through the haze. This game was terrible. It had about as much to do with farming as Nexus Ops has with ballet.\n\nAnd unlike other Euros, this one was dragging on. It felt like centuries. It wasn't because of analysis paralysis at the table. It was because this game was accelerating our table to near light speeds and relativistic effects were slowing time to a crawl!\n\nNot wanting to be \"that guy\" who cuts out on a game, even one that sucks as much as Agricola, I pondered ways to actually leave the game that would be acceptable. I was thinking, \"If the Second Coming happened right now, that would be cool.\" If you remember the old TV commercials, I desperately tried to re-create the magic by saying \"Calgon! Take me away!\" but alas, I did not transport to a bubble bath. I once pulled out my tri-fold wallet, flipped it open, leaned over and discreetly spoke into it, \"Scottie! Beam me up!\" hoping against all hope it would actually work.\n\nWhen the torture was over and the victory points were tallied, I won! No, I did not have the most -- not by a long shot! No, I won because I would never have to be exposed to this game again. The poor folks at the table were still under Wormtongue's influence and would repeat the misery.\n\nNot only was I woke, I was rejuvenated: Agricola tried everything to break me, but I overcame!\n\nNow that I fully understood what \"multi-player solitaire\" and \"themeless abomination\" meant, with clarity of thought, I drove home afterward, got on BGG, and lowered the rating of every single Eurogame I ever played, because I saw Euros for what they are. This game is so broken that it broke an entire genre for me! How's that for broken?\n\nI rose a new and better man and embraced the glorious wargames of my youth and their distant cousin, Ameritrash.\n\nI guess I owe a great debt to Agricola. If not for the depths of its suck, I might still be stuck in that beige-colored land of \"elegant mechanics\" and utter boredom. So thank you Uwe for freeing me from this cage!",
    "timestamp": 1552863600
  },
  {
    "username": "Godelieve",
    "rating": 1.0,
    "comment": "Not my thing.",
    "timestamp": 1552604400
  },
  {
    "username": "Tomasjj65",
    "rating": 1.0,
    "comment": "How a vast majority can call this piece of shit a great game defies understanding.",
    "timestamp": 1535148000
  },
  {
    "username": "Malaggar",
    "rating": 1.0,
    "comment": "This might be the most bland and most boring game I've ever played. I don't understand it's popularity.",
    "timestamp": 1526940000
  },
  {
    "username": "plentypokes",
    "rating": 1.0,
    "comment": "Though the gameplay is okay, I will downvote this game for supporting outdated norms surrounding what a family constellation should look like. Considering the time of release, it should really have less conservative setup than this to fit into modern society. That said, farming elements in the game are better planned and it is a game that could be enjoyed by more complex players, but personally I would choose other games over this one.",
    "timestamp": 1524780000
  },
  {
    "username": "kosterix",
    "rating": 1.0,
    "comment": "So bland, so mechanical, and so mean and unfriendly no fun remains whatsoever.",
    "timestamp": 1512255600
  },
  {
    "username": "Boltana",
    "rating": 1.0,
    "comment": "Felt like I was doing taxes trying to keep track of all the rules and plan out my moves. I'm sure with more frequent plays it would start to click, but the first game was overwhelming. Combined with the fact that I'm not a big Euro-style gamer and little chance of getting my wife to play (if it takes 5 minutes to cover rules for a new game its doomed) will keep this one collecting dust.",
    "timestamp": 1506204000
  },
  {
    "username": "Epidemius",
    "rating": 1.0,
    "comment": "Because cube pushing euros should stop being promoted as \"fun.\" Multi-player solitaire is not something I enjoy doing.",
    "timestamp": 1481238000
  },
  {
    "username": "niccolo711",
    "rating": 1.0,
    "comment": "zzzzzzz",
    "timestamp": 1454367600
  },
  {
    "username": "nopast0507",
    "rating": 1.0,
    "comment": "not a good game",
    "timestamp": 1454194800
  },
  {
    "username": "SamuraiBudgie",
    "rating": 1.0,
    "comment": "I've never been waterboarded but I imagine the experience is comparable to Agricola.\n\nThe process of partaking in this game was so prolonged I was convinced the clock was going backwards.\n\nIt later turned out that due to daylight savings the clock had gone backwards, but the point still stands due to my growing fear that I was stuck in a sort of time loop of which I couldn't escape, and I would be stuck in a purgatory in which I would be forever damned to play Agricola.\n\nI think the earliest clue that the game was not for me was whilst reading the instructions I got a call from family informing me that my Grandparents had died in some freak accident on their farm in the valley.\n\nI bring this review to you from the funeral service. I actually thing I'm having more fun here.",
    "timestamp": 1446332400
  },
  {
    "username": "Francaher",
    "rating": 1.0,
    "comment": "Aburrimieeento",
    "timestamp": 1441922400
  },
  {
    "username": "Constantinople",
    "rating": 1.0,
    "comment": "This is fun?\n\nGet an accounting program instead.",
    "timestamp": 1441317600
  },
  {
    "username": "sbconstant",
    "rating": 1.0,
    "comment": "Worst game of our time. \"Farming\" in a vacuum. Dying for a good Kansas cyclone to sweep it all away.\n\nIn other words, my memory of playing this game makes me want to barf.\n\n(To quote user offwater on the game Vinhos: \"You mined tin in Cornwall, painted the ceiling of the Sistine Chapel, so why not produce wine in Portuguese vineyards now?!\nBecause, to be honest, it is about the 1001st heavily structured euro with a boring pasted-on theme rammed down our throats that offers the same old clichéd cube-pushing yawn-fest for 4 hours (including a 1-hour rules explanation) as its predecessors.\nAnother nail in the coffin of the eurogame genre...\")",
    "timestamp": 1430344800
  },
  {
    "username": "talonsea",
    "rating": 1.0,
    "comment": "can't really put it into words ... I just don't feel it\n(I've won a recent game of it also - and still the same feeling)",
    "timestamp": 1425423600
  },
  {
    "username": "AdmiralCrunch",
    "rating": 1.0,
    "comment": "Online Play.\n\nThis isn't one I would pick up a physical copy of. Unless you are in to midevil farming the theme is dry. You have 15 turns of building out your farm, stumbling over your opponent as you go for the same resources.\n\nI believe playing with the advanced cards makes it worse. They add complexity to a game where there is too much going on anyways.",
    "timestamp": 1421535600
  },
  {
    "username": "Waltertrem",
    "rating": 1.0,
    "comment": "What a bad game:\n1) long and boring\n2) not intuitive\n3) constructed\n4) theme pasted on",
    "timestamp": 1405807200
  },
  {
    "username": "Ndenitto",
    "rating": 1.0,
    "comment": "*snore*",
    "timestamp": 1397426400
  },
  {
    "username": "Feel the Love Santa",
    "rating": 1.0,
    "comment": "I really think I hate this game. If I have a bunch of wood and a lazy farmhand, why on Earth can't he build me that bloomin' fence I need so I can buy some cows later!\n\nStupid game with a pasted on theme.",
    "timestamp": 1385679600
  },
  {
    "username": "Pro_player",
    "rating": 1.0,
    "comment": "The most overrated game of all time. Typical worker placement eurotrash game with an extremely boring and souless theme.\n\nThe mechanic is boring, Zero player interactions. We play boargames to have fun right ?! Who the hell wants to be a farmer anyways. Go play Harvest moon on your playstion or Farmville. It's thousand times better than this garbage.\n\nThe game dragged on for ages without any new or exciting things to do... Gosh it was so painful that nobody had fun in my group. Played a first time, it was so bad I almost cried for wasting my money on this game. Our group gave it a second try a few weeks later, but it was no better... in fact in was actual worst than the first experience. I want those 6 hours of my life back.\n\nDo not touch this game !!",
    "timestamp": 1383346800
  },
  {
    "username": "agichan",
    "rating": 1.0,
    "comment": "Doing my part to lower the overall rating of Agricola :-p",
    "timestamp": 1369864800
  },
  {
    "username": "buylower",
    "rating": 1.0,
    "comment": "Meh + Blah + Zzzzzzzz = Agricola\n\nTHE most mindnumbingly boring, unnecessarily complex, scripted, and overrated waste of time and money ever created in the history of civilization. Period.",
    "timestamp": 1366754400
  },
  {
    "username": "cricmate",
    "rating": 1.0,
    "comment": "Highly overrated. Would have probably rated it a 5 or 6. But opted for 1 to balance out the overrating by others.",
    "timestamp": 1364767200
  },
  {
    "username": "cardshark28800",
    "rating": 1.0,
    "comment": "I have never had the first clue as to what I'm doing, what my goals are or how to achieve them. It should come as no surprise that not only was I curb-stomped in both games but that I have little desire to play again. I'm sure that I'm missing out on one of the All-Time Greats but that's OK.",
    "timestamp": 1359846000
  },
  {
    "username": "kroqgar",
    "rating": 1.0,
    "comment": "A Medium Game so slow at the beginning it comes to life at the end....not so original Setting.I usually prefer other games because you bore yourself for about an hour before beginning to enjoy the game...as said It comes to life only just in the last Turns too late to be so good as people say...Overvalued....",
    "timestamp": 1345932000
  },
  {
    "username": "Speedwaysupporter",
    "rating": 1.0,
    "comment": "this game becomes even worse if you play it more often !",
    "timestamp": 1327359600
  },
  {
    "username": "jambel",
    "rating": 1.0,
    "comment": "dziadostwo, bez atmosfery, bez wolnego stylu gry",
    "timestamp": 1325026800
  },
  {
    "username": "SebasTTan",
    "rating": 1.0,
    "comment": "Gra w ogóle mi nie leży. Jest sucha i beznadziejna. Gra się kończy i nie ma na koniec ani w trakcie gry żadnych emocji żadnego \"ja chcę jeszcze raz\" na końcu. Bania.",
    "timestamp": 1321830000
  },
  {
    "username": "TheStroy",
    "rating": 1.0,
    "comment": "Cant understand why people like this game so much, extremely boring.",
    "timestamp": 1312495200
  },
  {
    "username": "matthiske",
    "rating": 1.0,
    "comment": "Nothing special. interesting choices but I felt I was in a drought playing this with not much of a fun factor.",
    "timestamp": 1304200800
  },
  {
    "username": "boing123",
    "rating": 1.0,
    "comment": "dry and uninteresting game. well at least it fits its theme better than PR.",
    "timestamp": 1292194800
  },
  {
    "username": "AnalogGamer",
    "rating": 1.0,
    "comment": "I've played solitaire games with more player interaction.",
    "timestamp": 1286661600
  },
  {
    "username": "gittes",
    "rating": 1.0,
    "comment": "I'd rather watch paint dry or grass grow.",
    "timestamp": 1275170400
  },
  {
    "username": "JohnHBiedenkapp",
    "rating": 1.0,
    "comment": "I detest this game, do you really want to be a medieval farmer?",
    "timestamp": 1265324400
  },
  {
    "username": "Salahaddin",
    "rating": 1.0,
    "comment": "A trashy euro; not reallistic at all; ugly graphics; good for family play perhaps",
    "timestamp": 1254780000
  },
  {
    "username": "rogmyersgeek",
    "rating": 1.0,
    "comment": "Played this with my gaming group last night. Everyone seemed to be all pumped up about this game, but I couldn't see what the big hype was all about. Fiddly, frustrating and frankly boring decisions each turn, very little player interaction and a lot of pre-planning seemed to me to be just plain boring. And the theme - who would want to be a medieval farmer? Lots of excitement there!!!????? Bottom line - worst game that I have played in a long time. Too bad because I wanted to really like this game.",
    "timestamp": 1244844000
  },
  {
    "username": "ardashir",
    "rating": 1.0,
    "comment": "I played once..\nIt's not big deal..",
    "timestamp": 1241647200
  },
  {
    "username": "Datharaur",
    "rating": 1.0,
    "comment": "I dedicate this rating to everyone who hasn't yet played this game and gave it a 10 based on hype. I wanted to like it; I really did. Heck, I even bought this game after I thought that maybe I was missing all the fun because I didn't play it often enough.\n\nSomeone recently asked me if my opinion has changed about Agricola. It hasn't. In fact, it's gotten worse. A one indicates my personal reaction to a game is that I have no desire to play it. Ever. I've played it eight times now, with different groups of players, and each time is worse than the last.\n\nIt's way too fiddly and illogical to be entertaining, and the theme of French Medieval farming is, shall we say, uninspiring. What next, a game about simultaneously building wooden, iron, *and* steel ships in a French port while avoiding starvation, Mr. Rosenberg?\n\nYes, the mechanics of Agricola are interesting, but ultimately, the game as a whole is a dismal failure as fun, which is the primary reason for this rating.",
    "timestamp": 1234393200
  },
  {
    "username": "OldCastles",
    "rating": 1.0,
    "comment": "Agricolull, so dull, so dull. It's not a game, it is a shame. A crushing bore and nothing more.\n\nAgricolull = 8.52? Chess = 7.08? GO = 7.67?\nGo = 7.670 (in words: seven thousand six hundred and seventy), Chess = seven thousand and eight, Agricolull = one, and you'll be pretty close to the truth.",
    "timestamp": 1229641200
  },
  {
    "username": "Shryke",
    "rating": 1.0,
    "comment": "This isn't a game. I've never seen it, nor do I believe it exists. It's actually a huge prank, who's sole purpose is to expose just how pathetic some of the people on this site are. The hissy-fit/Nerd Rage that has come from this game is staggering in it's intensity and hilarious is it's complete irrelevance. I never knew how many fat middle aged losers who got pantsed in gym class this site had.\n\nWell played gentleman, I didn't think my opinion of this community could get any lower.",
    "timestamp": 1195426800
  },
  {
    "username": "Bagherra",
    "rating": 2.0,
    "comment": "The game has the same mechanical feel of a cross between Puerto Rico and Caylus. The actions don't seem compelling and the penalties are quite harsh.\n\nA very interesting concept that is relatively simple in concept but terribly difficult to understand good strategies.\n\nAbsolutely requires player aids to play adequately I'd strongly recommend printing score charts and major improvement summaries for each player to reference during the game.\n\nThe game can feel a little bit like multiplayer solitaire despite having ruthless interaction in worker placement. I was a little disappointed that the game didn't spark discussion except to clarify rules and get strategic advice.\n\nso far through 10/25 all games I've played received a score of 30...at least I'm consistent \n\n11/2 scored 43 in two player game.",
    "timestamp": 1748642400
  },
  {
    "username": "areeves",
    "rating": 2.0,
    "comment": "Just hate making a decision between the lesser of two bad options. There is also a build order you must follow or you'll get crushed.",
    "timestamp": 1742684400
  },
  {
    "username": "Meteser",
    "rating": 2.0,
    "comment": "boring game, the instructions are hopelessly and incomprehensibly written",
    "timestamp": 1739660400
  },
  {
    "username": "de_aztec",
    "rating": 2.0,
    "comment": "Not fun. I like worker placement but this is not fun at all.",
    "timestamp": 1737932400
  },
  {
    "username": "BoardGamingCouple",
    "rating": 2.0,
    "comment": "2/5\n\noutdated classic that doesnt have much variety in player choice.",
    "timestamp": 1735254000
  },
  {
    "username": "Xstream",
    "rating": 2.0,
    "comment": "Sold the game. Gave It another shot on the iPad many years later, still think the same.\n\nDoesn't feel like a game. Scripted and boring. Visually horrible to me aside from some fences and the animals you keep. I don't get the hype. There is no fun, interaction with other players or variety in things to do. You \"must\" do stuff all the time that i don't \"want\" to do. I just hate this game, like most of the uwe Rosenberg games aside from Bohnanza, when he still was able to inject fun. It all feels so programmed in the way it plays. Even though it comes with a shit ton of cards. I rather play monopoly every day. Which says a lot. I prefer my daily work over this dry scripted drag of what they call a game.\n\nAnd now he's into Tetromino games ... sigh ... I can see he can design good games, he just picks all the things I hate in gaming ;-) To me he approaches everything too much from a programming approach. It's so predictable and dry. It needs more surprise and adventure.",
    "timestamp": 1719180000
  },
  {
    "username": "emptyset",
    "rating": 2.0,
    "comment": "It's too tight for my taste. Everything you try to accomplish takes several workers - and you only start out with two.\n\nFeeding your people is a central part of the game and a real nuisance. There's always a feeling of dread because you don't have time for everything - and because of the way scoring works, you have to do a bit of everything.\n\nHaving 14 different cards at the beginning of the game is pretty neat and the best part of the game - but most of the cards you don't even get to make use of. You play maybe 2-4 cards in the course of the game. The way the cards work isn't very streamlined and the return on investment is often very slim. The cards never feel powerful or satisfying to use.\n\nI love the wooden animal meeples, but the art on the cards is atrocious.\n\nAgricola: All Creatures Big and Small – The Big Box does everything I want from Agricola.",
    "timestamp": 1710716400
  },
  {
    "username": "jmcdaniel8520",
    "rating": 2.0,
    "comment": "I've only played this game 3 times so as usual, take my rating with a grain of salt, but I cannot stand this game. The game isn't bad as far as games go, it just isn't fun for me to play personally. Every single time I develop a strategy, the player before me takes the action space I needed, so there is no strategy, just adaptation. But adaptation usually means you get a worse option and it doesn't synergize well enough for your engine. I recognize fully that I'm losing because I just don't get the game, but playing it is a chore because of how constantly (literally every turn) your preferred option is going to be taken from you. Even in the games where all of my occupations and major/minor improvements are synergizing well with my strategy and I'm somehow managing to get the actions I want, when I want, I still end up trailing behind the leader significantly. The leader had 3 beggar cards in harvest 1 and still beat me by nearly double the points in the end. Game is not for me, and don't feel bad if you feel the same when you play it.",
    "timestamp": 1706310000
  },
  {
    "username": "coyotelaughs",
    "rating": 2.0,
    "comment": "Dislike it, the only reason i gave it a 5 is that i see that its a good game, just not one that I like",
    "timestamp": 1704927600
  },
  {
    "username": "brownsound",
    "rating": 2.0,
    "comment": "Typowy Uwe Rosenberg. 2 to w tym przypadku komplement.",
    "timestamp": 1690063200
  },
  {
    "username": "ergoqed",
    "rating": 2.0,
    "comment": "About as fun as eating sawdust.",
    "timestamp": 1679612400
  },
  {
    "username": "Bilb",
    "rating": 2.0,
    "comment": "Stress seems to be a selling point. Seems backwards to me. I took the summer house so I could leave the game early. Only time I've effectively quit a boardgame",
    "timestamp": 1667775600
  },
  {
    "username": "joseph777",
    "rating": 2.0,
    "comment": "4th April 2010\nAbsolutely fantastic. Wasn't convinced on my first game, scoring only 15 points (how embarrassing). I failed to appreciate how important it is to feed your family and felt pressured all game. However, it has grown on me very quickly. I play Puerto Rico and Power Grid plus a plethora of other games and heartily rate this a 10. Fabulous 2 player game. Fantastic with more. What my gaming club loves is that it plays within 60 - 90 minutes no matter what. There are lots of things to do and you have to have 2 or 3 options up your sleeve. The cards for the different decks are great but you should limit yourself to playing only 2 or 3 as we've found that you tend to waste family member actions on getting them out while other players get ahead by plowing fields, sowing, building fences, etc. Fun.\n\n21Dec10 - Still love this game. What a fantastic 2 player! I like multiplayer too. We have become quite wary of the cards. You really can fall behind if you focus on them too much. 2 or 3 out over the course of play seems adequate.\n\n3 Jan 13 - Have downgraded from a '10' to '7.5'. Still great but not playing it as much. One problem is that it's not easy to get the cards out if you're playing decks. Trying to get professions out, etc, will mean that you fall behind elsewhere.\n\n22 Oct 14 - Haven't seen this on the table for a long time. Lots of newer games that we prefer. Shipyard, Stone Age, even good ol' Puerto Rico is better. Rate a 5.\n\nDec 21 - I actually refused to play this the other day. I understand those who love this game as I did once too but you have to play regularly to be good at it and the feeding of the family drives me to distraction when I'm out of practice. Bye, bye, Agricola.",
    "timestamp": 1640473200
  },
  {
    "username": "GaryP",
    "rating": 2.0,
    "comment": "I have an oven, and you have an oven, but you are on the Bake Bread \"space\", and that somehow prevents me from baking with MY oven?!\n\nI so very much wanted to like this game. Farming theme? Terrific! Limited resources? Great! But illogical constraints on when I can use those resources ruins it.\n\nAlso, the scoring is such that there are not really different strategies to pursue. You need to be decent in almost every aspect and great in a couple. Specialization is not an option.\n\nWith some tweaks, I'd probably enjoy it, but I'll just play its superior sibling, Le Havre Fields of Arle, instead.\n\nUpdate: Taking a chance, I bought Fields of Arle. THAT is the game that I wanted Agricola to be. I also enjoy Caverna and Ora & Labora. But I will never play Agricola again.",
    "timestamp": 1635807600
  },
  {
    "username": "Fragasnap",
    "rating": 2.0,
    "comment": "The worker placement works well early (as miserable as it may be), limiting resources with players fighting and choking each other, but the pace of the game eventually overloads the board with spaces, resulting in that supposedly key blocking becoming impossible.\n\nThe way the game incentivizes collecting some of everything results in a samey experience each play. Hands of cards theoretically change the game, but their random nature results in sets that are sometimes synergistic and sometimes not which makes the game seem to favor players with good draws (which is bad news for a game as long as this one). Drafting or discarding can only help so much when the cards are so unbalanced.\n\nThe game is totally different between 2 and multiplayer player counts: In 2, denial makes the game incredibly slow to start, where 3-player games are a bit more friendly, which undermines its player interaction.",
    "timestamp": 1633730400
  },
  {
    "username": "zinniye",
    "rating": 2.0,
    "comment": "Never again\nIt's toooo much going on and so boring\n\n(Played on Board Game Arena)",
    "timestamp": 1627682400
  },
  {
    "username": "tommynomad",
    "rating": 2.0,
    "comment": "An almost bottomless array of eventually inconsequential decisions. More fiddly than the gaming payoff is worth.\n\nHope not to play it again.",
    "timestamp": 1619474400
  },
  {
    "username": "vegasstar",
    "rating": 2.0,
    "comment": "Too fidgety.",
    "timestamp": 1615417200
  },
  {
    "username": "W33k5",
    "rating": 2.0,
    "comment": "You own a farm. Your friend that owns the game beats you by 50 points every time. Also, this took 2.5 hours.",
    "timestamp": 1609110000
  },
  {
    "username": "zubor",
    "rating": 2.0,
    "comment": "My brain hurts ...",
    "timestamp": 1600466400
  },
  {
    "username": "Batamo",
    "rating": 2.0,
    "comment": "Nothing. Happens.",
    "timestamp": 1598047200
  },
  {
    "username": "Michalq",
    "rating": 2.0,
    "comment": "Playing this feels like working....",
    "timestamp": 1597615200
  },
  {
    "username": "Technon",
    "rating": 2.0,
    "comment": "Incredibly boring. The theme is like someone made an obvious joke but it was interpreted as serious by the game maker.\n\nUgly design. Ludicrous cartoon style.\n\nHorrible forced gameplay with absurd, illogical rules.\n\nThis game brings out the bad of the players. In that aspect it's an evil game, really.",
    "timestamp": 1584054000
  },
  {
    "username": "RobertBobby",
    "rating": 2.0,
    "comment": "Mechanics 2/3\n\nPresentation 0/3\n\nEnjoyment 0/3\n\nFor its time it was an amazing game, but when we take a step back and compare it to more modern designs with shared mechanics it more than shows its age. Don't get me wrong it's still an okay game, maybe good, but not great. Removing my own bias towards what I think is the Golden Eye of boardgames is hard, but realizing I had made that comparison allowed me to accept that it deserves a place in a hall of fame rather than a current top 100 list.\n\nTo avoid \"ruining\" it for other players I rather not discuss the major strategies, but once known it reduces the game into a luck based exercise where players are shoehorned into turn-order jockeying just to make \"the move\". I am not some kind of boardgame savant, I'm not even that great a player, but I had played enough boardgames to recognize the dominant strategy before finishing Agricola's terrible rulebook.\n\n\n\nAt first it felt odd to assert that Agricola has somehow gotten worse overtime. The contents and rules have more or less stayed the same so shouldn't the score? It shouldn't. I know it isn't fair to judge Agricola as if it were a modern title, but they're all competing on the same board so we don't have much of a choice. Aside from the major flaw that is the dominant strategy...\n\nThe art and iconography is average. I'm willing to concede that beauty is in the eye of the beholder, and perhaps it would be better to say that the art isn't to my taste. But... There is a disconnect between the art of the game and the theme the art is depicting. I'm not asking for photo-realism or a macabre depiction of struggling farmers, but playing this game with a handful of cartoon characters ripped straight out of a discount colouring book tells me art wasn't a concern, they just asked their guy to draw some cartoons and slapped those suckers on. \"You don't need great art for a great game\" and I would agree with you if it weren't distracting from the overall experience, or if the game had other redeeming qualities. The iconography is at best passable, but the overall presentation is confusing on the cards. Graphics that denote the set or player count requirements are displayed boldly on the center of the card, it wouldn't be unreasonable to assume that information displayed so prominently would be something to be constantly reminded of. Instead anything a player might use in game is comparatively small and pushed to the corners of the cards. I find it funny that the indexing displayed in the center of the card is about as readable as the cost requirements, maybe ever more so since it isn't hyphenated.\n\nScoring is abstract and disconnected from the game. The game sells you a theme of survival but you'll find yourself fencing in your non existent herd of animals and plowing fields that have no real use to you. The game forces the players to act like some kind of discount compulsive Noah who needs at least one sheep, boar, cow, grain, vegetable and absolutely not a single open space on your property no matter how efficient your engine is. Looking across the table to see a mirror of what you've built is indicative that there are no real choices when playing, we're all doing the same thing, but we have to wait in a queue to do so.\n\nDespite the railroading and the granularity of actions the inability to plan for your turn make this one of the most AP prone games I have ever played. This is a game that asks you to plan ahead but gives you no tools to do so. I love games that force you to adapt to changing circumstances, but that's if the game gives you a way to adapt, think creatively or make flexible plans, Agricola does not. Instead you look at your board and decide what the least shit option is. Thematically action selection is disjointed from common sense, so using theme as a crutch to explain poor mechanics isn't an option, and because of this disconnect from reality teaching this game and remembering rules is a chore.\n\nSorry Tim, only one person's wife can give birth a turn. Why don't you build an extra room? Oh right, someone is already doing that. I hope you understand that despite having your own property and materials that we've set a limit on new housing developments at one per turn, noise pollution and all that. Hey why not plow a field? Oh. Sorry. Forgot about Susan, can't have two people plowing a day, that'd be against the homeowner association bylaws you agreed to.\n\nThe replay value of this game is incredibly poor. The variable setup of this game does nothing to encourage variable strategies. If someone were to tell me that whac-a-mole had a high replay value because the moles appear in semi randomized patterns each game I would assume they've gone mad. Enter turn based whac-a-mole, despite the variable start the players all have the same plan unless they've got...\n\nBroken randomly distributed occupations! Wow exactly what I want from my themeless hour+ long euro... It is hard to believe that anyone can enjoy a euro where at the end of the game you won because you were dealt a stacked hand. Sure you can draft the cards if everyone is an experienced player, but now the game is significantly longer while only slapping an adhesive-bandage on the massive wound that is the wildly imbalanced cards. Oh and you can still win if you're lucky enough to draft a broken combo.\n\nI wasn't expecting to go on a rant so I'll end how I started. Agricola was a fantastic game and it deserves to be in a hall of fame, hopefully we can find a spot for it next to Snakes and Ladders and Monopoly.",
    "timestamp": 1581202800
  },
  {
    "username": "Staver",
    "rating": 2.0,
    "comment": "I don't see the point of this game, when Caverna is readily available. Caverna is a superior version of this exact game. This game didn't need a reprint, it needed to fade into obscurity. Caverna is the exact same basic game, but fixes my complaints about this game.",
    "timestamp": 1565906400
  },
  {
    "username": "Naomania",
    "rating": 2.0,
    "comment": "Just not my cup of tea.",
    "timestamp": 1561327200
  },
  {
    "username": "emperormark",
    "rating": 2.0,
    "comment": "The poster child for everything I hate about Euro-games. Awful.",
    "timestamp": 1555279200
  },
  {
    "username": "DeletedUser389997",
    "rating": 2.0,
    "comment": "Wanted to like it but couldn't. I found this the most excruciatingly boring Euro I'd ever played.",
    "timestamp": 1554328800
  },
  {
    "username": "Jedo1",
    "rating": 2.0,
    "comment": "Being an actual, starving, medieval farmer would be more fun than wading through this management mire.",
    "timestamp": 1553641200
  },
  {
    "username": "CowStriker",
    "rating": 2.0,
    "comment": "This is one of the first games I was introduced to. It sucks so much and is so boring that I cannot comprehend how I still managed to get as invested in the hobby as I am now. Will never play again period.",
    "timestamp": 1552863600
  },
  {
    "username": "MYKERAN1965",
    "rating": 1.5,
    "comment": "Why does everybody praise this game? It is an absolute hot mess. The instructions are ridiculous and provide no insight into actually playing the game. Absolute worthless crap.",
    "timestamp": 1550703600
  },
  {
    "username": "topstefan",
    "rating": 2.0,
    "comment": "Initial rating: 8.5\n\nUpdate 20100427: Just changed my rating from a 8.5 to a 6.5\nNow that my initial hype is gone all that's left is a multiplayer solitaire which takes a couple of hours. Gaming time better spent playing other games IMHO\n\nUpdate 20110127: changed rating to 2.5 after seeing it being played 2 times in a month...I disliked it so much I didn't join in...\n\nUpdate 20190103: It has been 10 years that i've played this game and nowadays we play a lot of worker placement games. I must try this game again so i've bought it for € 20 including shipping. Is it a vintage wine or a cheap beer?",
    "timestamp": 1546470000
  },
  {
    "username": "davispigeon",
    "rating": 2.0,
    "comment": "Could've been that I played with players experienced with this game but I hated it. I made a wrong decision early on and was locked out of any good moves.",
    "timestamp": 1542841200
  },
  {
    "username": "NoxMortem",
    "rating": 2.0,
    "comment": "Reduced the rating after several games because it becomes boring and one game is like the other.\n\nUpdate 2016: Reduced down to 4. Won't play this ever again.\n\nUpdate 11.11.18 to 2: II liked it when I got it, now it fells boring. Never again.",
    "timestamp": 1541890800
  },
  {
    "username": "rorodrisaz",
    "rating": 2.0,
    "comment": "Hated it",
    "timestamp": 1532901600
  },
  {
    "username": "Thecl3rikkiller123",
    "rating": 2.3,
    "comment": "A game that can be fun, but it really isn't that good",
    "timestamp": 1530655200
  },
  {
    "username": "The Nue",
    "rating": 2.0,
    "comment": "Having the move you intended to make blocked by another player is of course a natural component of any worker placement game. Here's the thing: at this point, the smartest designers out there have added games to the market in the genre where being blocked from your intended move poses a challenge of adaptation... selecting between one solid option and another, being flexible, and perhaps even altering your long term plans. That's good player interaction. Agricola is not that sort of game. A player blocking your move at the wrong time means your're f*cked. Not \"wasted turn\", or \"Slowed engine\" f*cked, as in \"You instantly lost the game, eat d*cks\" f*cked. There are so many scoring mechanics where missing the mark by one costs an absurd amount of points, the penalties for not feeding your family are so steep and so easy to get stuck with en masse suddenly, so many useful buildings or citizens can be scooped before you can do anything about it, mis-timing or mis-calculating one resource gain can put off your ability to advance for so many turns, that basically it is aborhently easy for one bad turn to cost a dozen points (and in the process, the game). It takes a mechanic meant to make player interaction engaging, and turns it into a game where you suddenly find yourself knee-capped so aggressively it's infuriating and defeat and victory commonly feel arbitrary. There are just so many better games like this out there, don't waste your time on this one.",
    "timestamp": 1525471200
  },
  {
    "username": "Baryon",
    "rating": 2.0,
    "comment": "Actions are scarce, resources are scarce. I don't want to feel like I'm about to starve to death in a board game, not when it's competitive and my opponents will happily see me starve and happily block me from recovering. Not my idea of a \"game\".",
    "timestamp": 1523397600
  },
  {
    "username": "Leozz",
    "rating": 2.0,
    "comment": "Over rated",
    "timestamp": 1515625200
  },
  {
    "username": "grouchysmurf",
    "rating": 2.0,
    "comment": "No thrills. Just two 2p games, I am really willing to give the game a second chance. After that I will probably sell it. From the hype it gets, I expected something much much better.\n\nThird game: the score goes down to 5. Each time I play, I like it less.\n\nSold. I really couldn't get to like this game.\n\n22nd August 2009: I am updating my rates so that they would be in compliance with BGG rating scale. Rate down to 4.\n\n2017: rated down to 2 (won't play it again)",
    "timestamp": 1511737200
  },
  {
    "username": "polm23",
    "rating": 2.0,
    "comment": "A very kind and enthusiastic owner of the game taught me how to play this at a boardgame meetup and I honestly had an awful time. Limited indirect interaction is unsatisfying, I don't care about building an engine, and the theme is boring. Helpful in learning what I like and don't at least.",
    "timestamp": 1509055200
  },
  {
    "username": "Thunderforge",
    "rating": 2.0,
    "comment": "This game is always frustrating for me. I hate that I can never really tell who is winning, and that passive-aggressiveness is really the only way to influence other players. The theme is a bit dull too. It's one of the only games where I have won, but felt disappointed when I did. I'll be happy to never play it again.",
    "timestamp": 1504908000
  },
  {
    "username": "El_Scorcho",
    "rating": 2.0,
    "comment": "Overly complicated. Takes a whole evening to explain to new players.\nEvery turn is painful and taxing and simply not fun.",
    "timestamp": 1501797600
  },
  {
    "username": "Kwakkie",
    "rating": 2.0,
    "comment": "Not a bad euro. I had the typical feeling of \"What the hell am I doing, and why?\" feeling when playing, but I get that from most euros. Not very difficult and length was just right as I was getting bored in the last two harvests.",
    "timestamp": 1500156000
  },
  {
    "username": "Demarryl",
    "rating": 2.0,
    "comment": "Not fun without tweaking.",
    "timestamp": 1496354400
  },
  {
    "username": "SmokeyJack",
    "rating": 2.0,
    "comment": "There are too many bad things that can happen on your turn. Then by the time you are able to set up a few things, the game ends. Having to settle for the less optimum move due to a little mistake is one thing, but why punish the person for it as well?",
    "timestamp": 1493935200
  },
  {
    "username": "skoll69",
    "rating": 2.0,
    "comment": "Why the heck can't I build a fence, if another player decides to build a fence?",
    "timestamp": 1492380000
  },
  {
    "username": "mxke",
    "rating": 2.0,
    "comment": "This is not the end-all be-all of games. Personally I have to find the right people to play it through to it's finish. Great concept, thematic appropriation, and execution but too much punishment or frustration of needing one more move to execute the move you wanted to achieve. Main strategy is to populate your family ASAP, oh but don't forget to feed them. FMG\n\nTraded away.",
    "timestamp": 1491861600
  },
  {
    "username": "Finnwolfy",
    "rating": 2.0,
    "comment": "Almost everything that I don't like about Eurogames or worker placemen games, can be found in this. Huge downtime, having to do everything ultimately, or else... Random cards in the start that you have to plan whole game around of lose... If i want dull misery farming, I want the game done by Phil Eklund, he probably could make it at least properly impactfull and competitive, instead of passive agressive \"I pick carrot so you lose one point\" \"I shall then build fences so you can't!\"",
    "timestamp": 1489964400
  },
  {
    "username": "shortstack0425",
    "rating": 2.0,
    "comment": "The most boring, ridiculously convoluted euro game I have ever played!\n\nTo be fair, while euros are not my favourite style of game, I do enjoy the farming theme immensely so I had high hopes that this one might deliver.\n\nFor I game I had heard nothing but high praise of upon it's release, I was incredibly underwhelmed with this game upon playing it. From the extremely lengthy set up to the incredibly boring gameplay, my hopes were squashed quite quickly with this one.\n\nWill never play again and I now have an extremely expensive reminder in my collection to always take the hype with a grain of salt.",
    "timestamp": 1489186800
  },
  {
    "username": "Klausi300",
    "rating": 2.0,
    "comment": "2",
    "timestamp": 1483657200
  },
  {
    "username": "Abiezer Coppe",
    "rating": 2.0,
    "comment": "The Coldplay of modern boardgaming. Fucking boring and inexplicably successful.",
    "timestamp": 1474408800
  },
  {
    "username": "sakoguru",
    "rating": 2.0,
    "comment": "3-Players: Overly stressful and punishing. Played a couple of times, and never came close to enjoying it. I'm going to give it another shot or two to see if it can earn a few more points.",
    "timestamp": 1473372000
  },
  {
    "username": "Xeserox",
    "rating": 2.0,
    "comment": "I think I am one of the few odd people out when it comes to Agricola. I am not going to deny the amount of choice you have in this game, or the multitude of ways to earn points. My problem with Agricola is simple... It feels like work. I enjoy all the Creatures Big and Small, and that doesn't feel like work to me, but standard normal Agricola feels like work. No thank you.",
    "timestamp": 1458601200
  },
  {
    "username": "dingo154",
    "rating": 2.0,
    "comment": "Seemed very stale and boring. Not much change throughout the game, everyone did the same thing turn after turn.",
    "timestamp": 1454886000
  },
  {
    "username": "armed-medic",
    "rating": 2.0,
    "comment": "I find no fun",
    "timestamp": 1454281200
  },
  {
    "username": "D Bo",
    "rating": 2.0,
    "comment": "This is a love it or hate it game, and boy do I hate it. It's not that it's a bad game. Clearly it is quite good overall based on its rankings. But to me it just feels like work, and there are too many decisions to make and it can just be too punishing if you don't make the correct decisions. It wasn't for me and there are other worker placement games I prefer way more, so I traded my copy away. I'd be perfectly fine with never playing again to be honest.\n\nPlays\n2012 - 1\n2013 - 1",
    "timestamp": 1452207600
  },
  {
    "username": "lukasaurus",
    "rating": 2.0,
    "comment": "Theme : Boring\nGame : Too long\nVerdict : I would rather eat wood than play this game.",
    "timestamp": 1451257200
  },
  {
    "username": "BigspenderPL",
    "rating": 3.0,
    "comment": "Way too slow, punishing.",
    "timestamp": 1758060000
  },
  {
    "username": "Oninohugo",
    "rating": 3.0,
    "comment": "With infinite setups, build the same well-rounded inefficient farm, hoping game winning actions become randomly available when first in turn order.",
    "timestamp": 1748815200
  },
  {
    "username": "StarlordAKPeterQuill",
    "rating": 3.0,
    "comment": "Started with the completely wrong mindset: I just heard you can manage your own farm, grow crops, held animals and so on...\nThematicly this is all true, but gameplay-whise you have to play the game like it's meant to be played: you must go on workers, you must use grain for feeding your workers, you must use all the space possible. In addition to that the action-cards can be totaly swingy so there is another balance issue.\nTotaly not a great experience. Even if it's not very much similiar I always would tend to Feast for Odin. It's in every aspect better than this piece of cowdung.",
    "timestamp": 1746396000
  },
  {
    "username": "mephezar",
    "rating": 3.0,
    "comment": "not broken, a game of lack for ressource is not for me",
    "timestamp": 1733698800
  },
  {
    "username": "shishmish",
    "rating": 3.0,
    "comment": "For two players, it's 9.\nFor five players, it's 3, never to be played again.\nHaving played solo and 2 players I wondered why negative reviews and struggle to feed. Having played with 5 players, now I understood. I still think it wasn't playetested correctly with high player count as bake bread action still has only one space creating choke while wood have multiple. A hint to might be scoring example which looks like 2 player game, while 5 player table was mostly empty signalling that something is seriously wrong.",
    "timestamp": 1722549600
  },
  {
    "username": "Erik_G",
    "rating": 3.0,
    "comment": "This game made me wary of engine building, worker placement, and euro games in general for a long time.",
    "timestamp": 1716588000
  },
  {
    "username": "werekin",
    "rating": 3.0,
    "comment": "Presenting the opposite problem to Caverna, where all you want to do is everything, before struggling to narrow down what goodies you most covet. The farm of misery presents a multitude of undesirable guff after a neighbouring git swipes that only selection of interest ? leaving disappointment to be plucked from a bunch of uninteresting options ? Fields of Arle on the other hand is a positive advertisement for a career in agricultural pursuits!\n\nAny lunatics who actually want to play with a 14 card opening hand, will find this is their game. Yet there are so many useless cards in this game that unless you have a table of expert drafters on hand, there will be zero balance. Do your friends a favour by drafting something else.",
    "timestamp": 1710370800
  },
  {
    "username": "seandavidross",
    "rating": 3.0,
    "comment": "Giving it the benefit of the doubt. 5 player game took 3 hours. Painful. Would rate the game a 4 with that number of players. For some reason, I think I'd like the game fine playing solo. For that, I suspect I would rate the game an 8 (but we'll see). For each added player, subtract one full rating point to reflect my willingness to play at that number. The replenishment phase got tiresome quickly.\n[UPDATE] Played with 3. Much faster. More enjoyable. I think that's about the limit for number of players I'd be willing to stand. Probably best with 2.",
    "timestamp": 1704582000
  },
  {
    "username": "cfarrell",
    "rating": 3.0,
    "comment": "I realized I had trashed my rating on this without updating my comment, so here we go …\n\nI played this a bit on BGA during the worst of the pandemic, and I have to say it was eye-opening (I hadn’t actually played the game in ages). I just totally wanted to gouge my eyes out. I would have rather been doing virtually *anything* other than than playing this. It was just a combination of the terrible balance and lack of flexibility. How you play the game is just totally dictated by your cards, and the as a result the imbalance, if you get a kinda trash hand, can be just wild. It’s highly scripted and railroaded. The worker placement competition just isn’t interesting and can be insanely frustrating when the key space that unlocks the game for you gets snagged by an opponent before you have a chance at it because that opponent doesn’t know what he’s doing. The balance on the Start Player space insane; if you’re sitting to the right of a player who over-values going first you’re totally screwed in a wildly frustrating way. The actual gameplay is just a disaster. Nice art! And a fun homage to medieval farming and animal husbandry. But this is just a crap game.\n—-\nOK, I think the 7 rating is about where this settles. It's a fun game, and I usually enjoy it, but I'm starting to weary of it as I find the cards to be frustrating as often as they are fun. Also, I think the pressure on wood in the early game is a bit too high, putting a heavy premium on cards that can bootstrap wood (or reeds). Not sure. But the balance doesn't seem right. Usually you know if you have a shot by the second harvest, and usually I know if I've won by that point; the early game is just really tight, and people who get ahead early will win. Also, as I mention, the huge variety implied by the vast number of cards seems deceptive; too many cards are too weak or specialized to be useful very often, and the I and K decks do not seem to stand alone well, so you need at least some E cards to make the game work, which seems to result in seeing the same core cards being played over and over again since they are the most versatile and useful.\n---\nUPDATE: Well, I've docked my rating a point. I still like Agricola, but I think the initial appearance of variety is deceptive. I think the card mix is too large, too inconsistent, and too surprisingly similar. It's not so much that there are strong cards, but that there are too many weak, useless, or too-highly-specialized cards, and that overall the cards are not helping the theme as much as I thought. I've found myself looking at my cards and seeing only a few legitimate plays and too few really interesting cards. I think the decks needed a round of culling to bring the card count down but the consistency up. It seems that not many games are going to be spoiled for everyone by one player getting great cards and dominating, but having your own game spoiled by a lousy draw occurs with somewhat disappointing frequency.\n\nAlso, the early game (Phase I & II) are dominated by getting a food engine going. This is almost entirely contingent on getting cards that enable you to do so in some way. Getting cards that accelerate getting that food engine going seems a huge advantage. Likewise, if you *don't* get that engine going by then, you're done and hardly need to play the rest of the game.\n---\nAfter playing some more, this may finally be a game the hypemeisters and I can agree on, more or less. First time through I enjoyed it but it didn't quite suck me in, but more play has improved my opinion. It's thematic enough, and balanced enough to be interesting (unlike similar games, there is almost always something productive to do, instead of having two or three good choices and \"the rest\"). I think the cards do a good job of allowing the game to have a pretty clean core system, with theme, depth and interest then introduced through the huge variety of cards.\n\nIt's still not perfect - the endgame scoring is a little awkward, and the rewards for doing things are not quite lined up with in-game activities, so you end up building worthless fences from time to time just to get a few VPs. There also can be a little lock-up at the end because almost every activity scores points for something, but it's not a smooth curve, there are peaks and plateaus, so towards the end you have to do a little more theme-breaking math than you'd ideally like. It's a little gamey, it would nice if it were better, but it's not a major problem, I think; it's close enough, and for the most part the game lets you play reasonably intuitively.\n\nDefinitely keep the player-count to 4 or fewer. 5 is too many, in my opinion - the game becomes too slow.",
    "timestamp": 1703458800
  },
  {
    "username": "tolhs",
    "rating": 3.0,
    "comment": "2023:+0.5",
    "timestamp": 1701558000
  },
  {
    "username": "bricksii",
    "rating": 3.0,
    "comment": "Every game of Agricola I've ever played has left me feeling miserable. There is no sense of accomplishment; only of having failed less.",
    "timestamp": 1699916400
  },
  {
    "username": "asfhgwt",
    "rating": 3.0,
    "comment": "A serious, solid game, but alas, a boring one. The cards are all \"special\" cards, and in a 5-player game each player has 14 of his own plus the major improvements! The combinations are hard to evaluate and I don't see how they all could possibly have been playtested. Naturally, some combos are clearly a lot better than others, so the luck of the draw can be a big factor.\n\nThe only interaction is in choosing roles, and if someone picks the one you wanted you'll have to completely re-think your selection. The whole thing is clunky, with a zero excitement level, and after your turn you can go read a book for a few minutes. Oh, yeah -- the game drags on far too long, and I pondered quitting after the first two hours.\n\nMy second and third plays found me constantly thinking \"When will it end, already!?\" Expansions just make things worse. While I like the concept, the whole affair feels more like work than anything else.",
    "timestamp": 1696370400
  },
  {
    "username": "Bitter_Baker",
    "rating": 3.0,
    "comment": "This game is an absolute slog to play with 4 or more players. I've never played a game of this that took less than 4 hours, and there is a very good chance that you will have lost the game before it begins because your cards don't synergize. It's not a bad game, but there are plenty of better games to play at that time range.",
    "timestamp": 1690927200
  },
  {
    "username": "DanFred",
    "rating": 3.0,
    "comment": "This is a well made harsh game that requires multiple plays and constant thinking to do well and I didn't hate it, but found it boring, didn't really care what I was doing, knew I could not win early on, and has minimal player interaction. Boring and not at all my type of game, but for those who like worker placement game this is probably one of the best.",
    "timestamp": 1690840800
  },
  {
    "username": "Andural69",
    "rating": 3.0,
    "comment": "Z-Man edition. Very Low trade Priority.",
    "timestamp": 1689372000
  },
  {
    "username": "lukestrotz",
    "rating": 3.0,
    "comment": "This might be my most controversial rating, but I just don't like Agricola. It's not a bad game per se, but it's definitely not a game for me.\n\nIgnoring the theme (which I'm indifferent to), I'm not really a fan of worker placement games, so my relationship with Agricola was already off to a bad start.\n\nI'm also not really a fan of medium weight to complex euros, so that's not helping things either. Agricola is just too complex for what it is.\n\nAnd it also feels like a game where there's an illusion of choice. I love games where you have to think on your feet and work with what's available to you, but I feel my choices are extremely constrained in Agricola (and potentially even more constrained based upon what my opponents do).\n\nI'll play it if I must, but I'll be glad when it's over",
    "timestamp": 1686607200
  },
  {
    "username": "Thatsnotme",
    "rating": 3.4,
    "comment": "Geekup ressourcer, meeples og animeeples",
    "timestamp": 1684965600
  },
  {
    "username": "Daoshifu",
    "rating": 3.0,
    "comment": "I do not understand the hype about this game.\nI have never sold a game so quickly.\nThe only positive about this game is that i sold it for more then i paid for it",
    "timestamp": 1681423200
  },
  {
    "username": "John Rogers",
    "rating": 3.0,
    "comment": "UPDATE: 2.01.19 (cleaned up comments)\n\nAgricola is a well-themed, engine-building-efficency-points-salad-maximizer. There is variability in the cards, tension in feeding your family, and frustration via its indirect interaction and limited number of turns. The game has a progressively large number of actions (30+ between WP spots and cards) to choose from and while this may seem to encourage variety and specialization, the points capping and penalties for not doing everything actually works to funnel players down very similar paths. l find the plethora of upfront and increasing information along with the efficiency-point-salad model to be very stressful and AP inducing far beyond my level of enjoyment.\n\nThis is a favorite of my primary gaming partner and as such I have played it every couple of years or so to the tune of 10x. My latest expericne though may be my last (and I won 46-28-25-12). Not because the game was all that I mentioned above (though it was) but because I was mercilessly razzed for clearly struggling with the expericne. I enjoy my company but this made an already very frustrating game a thoroughly unenjoyable one. Congrats guys you turned this session into one of my least favorites ever, which is almost exclusively occupied by sessions with inconsiderate players.\n\nWIFE RATING - 5",
    "timestamp": 1680386400
  },
  {
    "username": "The Deliberate",
    "rating": 3.0,
    "comment": "The basics of this game are solid, but the overall execution is horrible. There is way too much tiny writing everywhere, especially with so many special cards. Drags gameplay down to a glacial pace. Feels very clumsy and overly complex. Artwork is also really bad, as is visual design. Playing a whole game takes entirely too long.",
    "timestamp": 1678143600
  },
  {
    "username": "papergames",
    "rating": 3.0,
    "comment": "All the sessions we played were defined by a one moment during each game: whoever gets the child first wins, and while you can somehow plan around its, at the end it can be random. All the other things you do seem not to matter that much.",
    "timestamp": 1675810800
  },
  {
    "username": "jodokast4",
    "rating": 3.0,
    "comment": "This is more complex than I really tend to enjoy in a game.",
    "timestamp": 1662847200
  },
  {
    "username": "TwiggyAK",
    "rating": 3.0,
    "comment": "app",
    "timestamp": 1662674400
  },
  {
    "username": "Guntower_Mike",
    "rating": 3.0,
    "comment": "I've never had an enjoyable game of this. It's very punishing and overloaded with too much information to get your head around unless you play it multiple times - but I simply don't enjoy it enough to do that.",
    "timestamp": 1660341600
  },
  {
    "username": "Sashabean",
    "rating": 3.0,
    "comment": "Win T=35 C=34",
    "timestamp": 1657058400
  },
  {
    "username": "natemccracken",
    "rating": 3.0,
    "comment": "I've always felt let down by Agricola. It seems as though you can choose nearly any strategy and come out near the top. Results in an empty experience whether you win or lose. It's certainly got some good ideas in it, but IMO doesn't deserve to be on BGG's top 50.",
    "timestamp": 1650837600
  },
  {
    "username": "tishdar",
    "rating": 3.0,
    "comment": "Not a #1 game, but i enjoy it. I think what keeps it down for me is that, while i like to build engines, what i most like is seeing those engines profit me. In this game, there is always a feeling of being behind - you never get to coast on your wonderful farm. Another harvest is always around the corner.\n\nTons of replayability with the cards.\n\nlike others i have a small issue with the scoring forcing you into a generalist strategy.\n---------------\nJune 2012 update - demoted from 7 to 6. Agricola is nice, but feels like work. My tastes seem to be moving towards \"fun\" in games. Agricola is not fun, really. Its interesting, i guess. If i have a hankering for a complex, engine-building game that frightens newbies, i will go to Puerto Rico. New players are always keen on the complexity of PR - with Agricola, they are overwhelmed by the options and the race for food. It can be a brutal, unfun game at times.",
    "timestamp": 1648936800
  },
  {
    "username": "PSouth",
    "rating": 3.0,
    "comment": "Dissapointing.",
    "timestamp": 1645138800
  },
  {
    "username": "savedbygrace1521",
    "rating": 3.0,
    "comment": "typical Uwe garbage",
    "timestamp": 1645138800
  },
  {
    "username": "motoboy",
    "rating": 3.0,
    "comment": "Played twice, very dense euro-game with a very tight economy, hard to get to our group table",
    "timestamp": 1644015600
  },
  {
    "username": "raged_norm",
    "rating": 3.0,
    "comment": "Too fiddly to set up",
    "timestamp": 1643324400
  },
  {
    "username": "lukaszsw",
    "rating": 3.0,
    "comment": "Played twice, good in theory. The game makes it that you need to be a little bit of everything to score points. So you cant focus on one thing.",
    "timestamp": 1641510000
  },
  {
    "username": "GaiaHero",
    "rating": 3.0,
    "comment": "Decent worker game but way too restrictive.",
    "timestamp": 1635199200
  },
  {
    "username": "sparkydvl",
    "rating": 3.0,
    "comment": "Hate this game for some reason. It's so mundane and boring theme. Played it quite a while ago though, might be worth trying again since I love Caverna so much.",
    "timestamp": 1630706400
  },
  {
    "username": "MIJB19",
    "rating": 3.0,
    "comment": "Going in with low expectations (primarily because of the hype surrounding the game), I was pleasantly surprised. Probably need a couple more plays to define my rating more seriously, but after one play, I have to say it was fun to play. The one thing that jumped out (and is cliché if I remember correctly), is that too-little-time-to-do-what-you-want-to-do feeling.",
    "timestamp": 1630188000
  },
  {
    "username": "mothertruckin",
    "rating": 3.0,
    "comment": "I like Le Havre better. My copy came with the Z deck.\n\nSold.",
    "timestamp": 1629583200
  },
  {
    "username": "Vince22",
    "rating": 3.0,
    "comment": "its a good game, but i dont love it",
    "timestamp": 1623794400
  },
  {
    "username": "tReason",
    "rating": 3.0,
    "comment": "Spreadsheet simulator",
    "timestamp": 1609714800
  },
  {
    "username": "PlusOrMinus",
    "rating": 3.0,
    "comment": "Only played once. Too many pieces. Never again. Gave to friends who like it!",
    "timestamp": 1607986800
  },
  {
    "username": "Fizberry",
    "rating": 3.0,
    "comment": "iOS",
    "timestamp": 1607900400
  },
  {
    "username": "stvnritch",
    "rating": 3.0,
    "comment": "I don't know what it is about games that simulate farming but for the most part I just don't like them. I found this game to be boring and stale and probably wont play it again. However my tastes have changed as I've aged and its possible that if someone could convince me to play this again I might like it, I don't know, but as of now i do not like this game.",
    "timestamp": 1605135600
  },
  {
    "username": "PeriklesKwaXulu",
    "rating": 3.0,
    "comment": "Takes too long, too little interaction, lacks exigency.",
    "timestamp": 1588629600
  },
  {
    "username": "chrboesen",
    "rating": 3.0,
    "comment": "Multi-player solitaire. Played 10 times with a monthly game group. Cards make it relatively \"fun\". Better than Puerto Rico and Caverna.",
    "timestamp": 1586383200
  },
  {
    "username": "etighe",
    "rating": 3.0,
    "comment": "Uwe Rosenberg;",
    "timestamp": 1579042800
  },
  {
    "username": "Laurentiu",
    "rating": 3.0,
    "comment": "Tedious setup, tedious play, ends just as it was starting to get a bit interesting.",
    "timestamp": 1574636400
  },
  {
    "username": "Zerosum",
    "rating": 3.0,
    "comment": "Game forces you not to specialize, but the theme is not superfluous. Agricola would be better if it included moonshine, kidnapping, and blood-feuds. At least it has bacon.",
    "timestamp": 1571608800
  },
  {
    "username": "dugman",
    "rating": 3.0,
    "comment": "I like Le Havre and Lords of Waterdeep and wanted to like Agricola but can't. It's overly complicated and seems to be a game requiring you to do a very specific strategy in order to remain in balance (one path to victory). Plus the theme is pretty boring. Not the worst game ever but definitely a big disappointment for me, highly overrated on this website.",
    "timestamp": 1570140000
  },
  {
    "username": "barry_015",
    "rating": 3.0,
    "comment": "Too long.\nToo much feeding...",
    "timestamp": 1566943200
  },
  {
    "username": "Katielou",
    "rating": 3.0,
    "comment": "An exercise in tedium. I kept trying ways other people said would improve this, but honestly, while I recognise there are plenty of decisions to be made it was so dull I didn't care. Its not a question of hard or not, its a question of interest, and this game left me thinking that I would rather have done almost anything else than play this. The only part of the game I found remotely interesting were the cards, and you don't get many of them or play them very often.. Definitely not a game for me.\n\nFind a box, write Boredom on the front and give it an all beige cover and it would look more interesting to me than this game.",
    "timestamp": 1562796000
  },
  {
    "username": "tompa",
    "rating": 3.0,
    "comment": "the truth is, this is one of those games you cannot dismiss as being bad. BUT, every time i play this game i get way too stressed due to feeding issues... and i don't want to feel stressed when i play a game. i want to enjoy the company and have fun. this game does not afford that. hence the meager grade. too bad.",
    "timestamp": 1559599200
  },
  {
    "username": "stephengehring",
    "rating": 3.0,
    "comment": "Tons of options; lots of theme; just not our favorite. Got bored of the theme and not really as fun at a 2p count.",
    "timestamp": 1559080800
  },
  {
    "username": "Jediskills",
    "rating": 3.0,
    "comment": "Rating based on one play. I can see how deep the game is, but this one of those game where every players does their own thing which doesn't really affect others. It's it got one of the most boring theme and presentation that I have seen.",
    "timestamp": 1554588000
  },
  {
    "username": "Leonithic",
    "rating": 3.0,
    "comment": "\"Come, sit beside me and futilely move your own cubes around as you admire my ability to build a points-generating engine.\"",
    "timestamp": 1553641200
  },
  {
    "username": "Bulwyf",
    "rating": 3.0,
    "comment": "Played at BGG.Con. This game has a lot of potential replay value because of all the cards and how they change your situation in the game. I had fun figuring out how to make a go of it with just the tools on hand. At the end of the game there's a sense of accomplishment when you've created a successfull farm.\n\nI am concerned however that Agricola may not have enough player interaction to aviod the multiplayer-solitare pitfall. More playing are needed to see if Agricola lives up to the hype.\n\nI'm dropping the rating to a 6. Once the newness of the game wore off I began to see Agricola for what it is. A mediocre worker placement game that has a real lack of player interaction, soul and fun. Sure the cards add a nice element of the unknown, but once you seen them all the game become nothing more than a near-solitare logistics puzzle. Even the vaunted \"I\" or interactive deck dosen't change that assessment as most of the iteraction is very indirect or parasitic in nature. In fact I call it the \"P\" deck.\n\nThis is another case of hype overselling a game beyond its actual merits. It's not a bad game it's just *meh*.",
    "timestamp": 1553122800
  },
  {
    "username": "tempus42",
    "rating": 3.0,
    "comment": "One of the clear hits of BGG.CON 2007, I was lucky to grab it for one play. It was very impressive, but when you really dissect it, it's pretty much all stuff we've seen hundreds of times before. Nothing truly new here at all, but still it was oddly compelling. To me, it felt most like a light version of Roads & Boats (which still makes it a pretty heavy game). We made a mistake in shuffling all of the occupation decks (and the minor improvement decks) together into one, and we were wondering why some of the cards seemed so much better than others, so we were glad to find out that if you played it correctly, it wouldn't have been as unbalanced as we thought it was.",
    "timestamp": 1549580400
  },
  {
    "username": "gothdj",
    "rating": 3.0,
    "comment": "I actually kind of hate this game.",
    "timestamp": 1547161200
  },
  {
    "username": "Germflinger",
    "rating": 3.0,
    "comment": "A tedious and wearisome game of dull mechanical punishment.",
    "timestamp": 1544050800
  },
  {
    "username": "BogartRamshackle",
    "rating": 3.0,
    "comment": "I hear this game is fun and has good crunchy strategy.\n\nWell, the first time you play it's just a slog, and I doubt I'll give it the chance to get past sloggy.",
    "timestamp": 1540677600
  },
  {
    "username": "NotThatSalem",
    "rating": 4.0,
    "comment": "Slow and old - there are many better games out there now. I also don't like that everyone needs the same specific things to win.",
    "timestamp": 1759788000
  },
  {
    "username": "Mauricio_Oliva",
    "rating": 4.0,
    "comment": "the game Orleans is better.",
    "timestamp": 1759269600
  },
  {
    "username": "braycon1",
    "rating": 4.0,
    "comment": "Very little luck, but also very little fun. I don't see the appeal of this although I know many consider it a classic.",
    "timestamp": 1756418400
  },
  {
    "username": "Thegooddoc_help",
    "rating": 4.0,
    "comment": "Imma go to sleep",
    "timestamp": 1755900000
  },
  {
    "username": "Doctor_Cowboy",
    "rating": 4.0,
    "comment": "I know a lot of people love this game, but I hate feeling starved for resources. Much prefer the bounty of resources in Caverna to Agricola.",
    "timestamp": 1754344800
  },
  {
    "username": "shawnmackay1593",
    "rating": 4.0,
    "comment": "Just not fun for me. The variety in cards was interesting for a couple turns but the rest felt more like work. I already find that Uwe's feed your people mechanic sucks the fun out of his games and that made a restrictive game even worse. The game pieces are also very bland and boring. Nothing about this appeals to me.",
    "timestamp": 1748556000
  },
  {
    "username": "shizzane",
    "rating": 4.0,
    "comment": "I enjoyed my first teaching game. I don't know if this one would make it onto the table much in my group though. I have some reservations too about how much replayability this one would have.",
    "timestamp": 1747951200
  },
  {
    "username": "dseagle",
    "rating": 4.0,
    "comment": "Pretty solid worker placement game. The thing I always get hung up on and really don't like is the mechanic where you have to feed your farmers at the end of each round. I want to keep all the income I generated during the round to spend during the next round. Something about having to dump income to keep my farmers from going \"begging\" and losing VPs always rubs me the wrong way. Paying money/resources for straight VPs is almost always the most boring part of any game and is either reserved for the very end of a game or if you have excess and need to get rid of it. This game forces you to do it every round.",
    "timestamp": 1738278000
  },
  {
    "username": "bigblog",
    "rating": 4.0,
    "comment": "I couldn't figure out how to play it honestly.",
    "timestamp": 1736895600
  },
  {
    "username": "Forgeforgeforge",
    "rating": 4.0,
    "comment": "meh.\n\nPractice at home before you play. Every game tells a story. The story is you made a drafting mistake before the game even started. It's a fucking boring story.\n\nThis game does not benefit from human opponents. You would have a similar experience playing against a robot that randomly blocked spaces until the final stretch, when scoring is tediously calculable.",
    "timestamp": 1736031600
  },
  {
    "username": "fei0x",
    "rating": 4.0,
    "comment": "Jenny's",
    "timestamp": 1736031600
  },
  {
    "username": "Philgamer",
    "rating": 4.0,
    "comment": "Don't like.",
    "timestamp": 1720994400
  },
  {
    "username": "Khumbanigash",
    "rating": 4.0,
    "comment": "Only played once and Agricola didn't appeal to me at all. The theme is meh. The art is meh. Can't even remember how it played... Didn't have a good time with the game. Maybe it also played a role that I was crushed by my fellow players who had already played the game a hundred times...",
    "timestamp": 1717884000
  },
  {
    "username": "tommayj",
    "rating": 4.0,
    "comment": "I'd love to love this game, for what it's worth the game play is good. But it's just so, so fiddly. I just can't bring myself to keep playing these games where moving the little chips and tokens accounts for half the time spent playing it. I would absolutely play this as an online game, just so a computer can do all the fiddling for me... but even then, this game can sometimes feel so boring to me.",
    "timestamp": 1717020000
  },
  {
    "username": "MCDexX",
    "rating": 4.0,
    "comment": "So very over it.",
    "timestamp": 1715896800
  },
  {
    "username": "Animepops",
    "rating": 4.0,
    "comment": "Only one play through so far, but I found it kind of boring. Maybe another try or two will make me feel different. (Rating based on digital play only)",
    "timestamp": 1712181600
  },
  {
    "username": "Kodeir",
    "rating": 4.0,
    "comment": "Very little interaction, as the only way to influence other players is through the action drafting. The game is designed in such a way trying to block opponents is sub-optimal, as it's generally better to pursue your own goals.\n\nAction drafting aside, the game is a pure optimisation activity of snowball economies, where every player is on his own, giving life to its own farm, and lasts far too long for what it offers. Would rate higher if a game with newbies could be reliably finished in an hour or less.\n\nI see the appeal it has, particularly for those who love low conflict games, but this is definitely not for me. Not a bad game though, and will play if asked.\n\nRating: \nOptimal number of players:\n4\n2\n\nFor more information on how I rate games, go to my profile",
    "timestamp": 1709334000
  },
  {
    "username": "Jolnarfanatic",
    "rating": 4.0,
    "comment": "If I’m going to play a game I don’t want to spend it feeding my people the whole game",
    "timestamp": 1705273200
  },
  {
    "username": "AdamCatant",
    "rating": 3.5,
    "comment": "Manual labour and starving children. Fun times.",
    "timestamp": 1702940400
  },
  {
    "username": "Fawkes",
    "rating": 4.0,
    "comment": "Misery Farm was one of the last games I played before taking a 15-year hiatus from board games. It was a worthy heir to Caylus - a dragging, boring, somewhat random overly long experience where you hoped that you drew good cards. And the theme - oi vey. Rosenberg's designs have gone downhill since Bohnanza.",
    "timestamp": 1702767600
  },
  {
    "username": "hiimjosh",
    "rating": 4.0,
    "comment": "The canonical farming game. I like the pressure in this game and the arc to the game is strong, however it plays out similarly every game. I dislike how the demand for the different goods plays out with wood being in constant demand and extremely strong and brick being niche. It's okay. It's a classic so it sticks around even though I'm pretty tired of it",
    "timestamp": 1700780400
  },
  {
    "username": "Gambit1486x",
    "rating": 4.0,
    "comment": "I really wanted to enjoy this game, as I like the general mechanics. Unfortunately I was so bored playing it. Not a game I will ever buy, but maybe I will play it once or twice a year if someone else wants to",
    "timestamp": 1698879600
  },
  {
    "username": "R3sy",
    "rating": 4.0,
    "comment": "Played 4 times with 2 players. All turns felt like just doing randomly what was the best at that time, didn't really feel like you could plan a strategy ahead which I would have expected with a game like this.",
    "timestamp": 1698879600
  },
  {
    "username": "koflo1",
    "rating": 3.5,
    "comment": "1-4 (3-4)",
    "timestamp": 1695938400
  },
  {
    "username": "Tigerherz",
    "rating": 4.0,
    "comment": "+ de Luxe Version, Sonderausgabe 2011/2012 LookOut",
    "timestamp": 1690668000
  },
  {
    "username": "Decagon",
    "rating": 4.0,
    "comment": "Definitely did not live up to the hype.",
    "timestamp": 1690581600
  },
  {
    "username": "compman",
    "rating": 4.0,
    "comment": "This rating is after my initial play. It could change in the future depending on whether or not my initial fears and concerns turn out to be founded or not. For example:\n\nThere are lots of cards and lots of text in very small font on each one of those cards. Because there are so many cards, strong card familiarity is something that would take A LOT of plays to acquire. I see why all of the wooden bits are there but the number of cards in the game seems excessive. It feels like having five boards worth of Puerto Rico buildings - all different and all having a paragraph of text instead of a summary of their use. Yes that many cards would contribute to variety from game to game but when each card requires a paragraph's worth of text to explain its use, the game can very quickly bog down with players reading each card to see what it does. Puerto Rico doesn't suffer from this problem as, after a few plays, you learn what the buildings are and what they do because the same set of buildings is available in each game and you get reminded more frequently how each building works. Race for the Galaxy also doesn't suffer from this problem as it uses a symbol system to explain each card. Thus, once a player is familiar with the symbols, they can quickly tell what a card does.\n\nAlso, at it's heart, Agricola seems like a path carving game where, after a few initial turns, you are almost \"locked\" in to a specific style of play for your cards and resources to interact in the most efficient manner possible and yield the best results. This quasi \"locked\" feeling kept me from really paying that much attention to the other players when selecting actions. The only thing I cared about was whether or not the action that most benefited me was available when it was my turn. This created the \"multi-player solitaire\" feeling that many people harp on Euro's about but which I had not truly felt in a Euro before until this game (that's including the usual targets that get indicted by many for being \"multi-player solitaire\" like Princes of Florence and Race for the Galaxy).\n\nFurther, the theme does nothing for me. (I've noticed that farming games in general don't work for me. Hacienda, for example, just isn't exciting to play.)",
    "timestamp": 1687730400
  },
  {
    "username": "bazroberts00",
    "rating": 4.0,
    "comment": "I know a lot of people love this game, I just didn't enjoy it. It can be quite mean, which in and of itself isn't so bad, but it is so tight on the board and if someone takes the one space you need your whole turn can be completely ruined. I just didn't find myself enjoying a lot of the choices, and if you are playing against people who know the game well you will get crushed. You fall behind in this game and catching up is almost impossible.",
    "timestamp": 1683583200
  },
  {
    "username": "jellynut",
    "rating": 4.0,
    "comment": "Nice cards and components - but doesn't feel like playing a game with or against others. Just collecting stuff, and watching a joyless exercise in min/maxing. Long downtime between turns.\n\n2013 update - played once it seemed worse than ever.\n2019 update - still the same issues\n2022 update - nice to be playing games again\n\nIf I ever play again - try to remember:\n* Draft the cards that put things on the track\n* Distinguish between the minor improvement cards (pictures of things) and occupation cards (pictures of people) by looking at the pictures - and not trying to guess which shade of orange is which.\n* Read all of the 44 of the cards (4-player) that are passed to me in the draft - There are no relevant icons to help.\n* To not refer to it as Misery Farm",
    "timestamp": 1679698800
  },
  {
    "username": "tamsynulthara",
    "rating": 4.0,
    "comment": "A bit too hard to keep track of what's going on for my taste.",
    "timestamp": 1679612400
  },
  {
    "username": "alejandrovenezuela",
    "rating": 4.0,
    "comment": "Excellent Game but it's not recommended for more than 4 player. Besides The rules and the strategy is strongly complicate for amateurs players\nNevertheless, it's an excellent game for experimented players, you have thousand of way of winning.\nIt's an extremely original game\n\nMy personal opinion for giving a 5 is because I am a euro heavy gamer and for me a good euro game should not have too much text and Agricola is too dependent of the cards, besides the reading and the drafting make the game very long. I prefer by far Le Havre and Ora & Labora from this designer.",
    "timestamp": 1677193200
  },
  {
    "username": "reapersaurus",
    "rating": 4.0,
    "comment": "It seems fair to say that after 15 years, Agricola proved without a shadow of a doubt that the cult of the new and the bias towards heavy games caused it to be rated higher than the game actually deserved. Time has proven this to be the case, as both Agricola and Puerto Rico have suffered some of the largest drops in average rating of any of the Top 100 games.\nSo if anyone thought they were \"overrated games\", well, by definition they were proven right.",
    "timestamp": 1675206000
  },
  {
    "username": "sashiuma",
    "rating": 3.6,
    "comment": "일꾼놓기",
    "timestamp": 1669849200
  },
  {
    "username": "disposable.superhero",
    "rating": 4.0,
    "comment": "The more I play it, the less I like it. This may be a 7 soon.\n\nUpdate: My wife got this in the divorce. I haven't played it in 5 years and don't miss it.",
    "timestamp": 1668466800
  },
  {
    "username": "berz118",
    "rating": 4.0,
    "comment": "Not for me",
    "timestamp": 1667948400
  },
  {
    "username": "pescime",
    "rating": 4.0,
    "comment": "3/18/12 - This game is so random, I am surprised so many euro fans like it. I never get anything helpful in the occupations or minor improvements. I like randomness but it just doesn't fit in this game. I really need to stop playing this game.\n\n9/17/11 - I finally got to sit down and play Agricola. My teacher was Ken and he had a nice set with some custom pieces. We flew through this two player game as the decisions got tougher. I did feel behind most of the game but for my first time through the game, my goal was to manage my empty spaces. I ended up with 20 points and lost to a more seasoned player.\n\nWith these style of games, the multiple options always overwhelm me in my initial play. I am sure once the familiarity of cards and choices become more second hand, I would probably do better. My rating may change if I play more but for now its a 6.",
    "timestamp": 1665698400
  },
  {
    "username": "BlindWo1f",
    "rating": 4.0,
    "comment": "I was looking forward to playing this game but unfortunately it's not for me, I am open to trying it again though.\nI'm not a fan of games where so many rules are on the cards & you're often left asking players to re read their cards several times over. There was no real part of this game that hooked me & made me want to immediately return for more.",
    "timestamp": 1663020000
  },
  {
    "username": "hermeticPaladin",
    "rating": 4.0,
    "comment": "I enjoyed the family mode, but found the real game a bit much",
    "timestamp": 1661896800
  },
  {
    "username": "HS2917",
    "rating": 4.0,
    "comment": "Replaced with Caverna",
    "timestamp": 1660773600
  },
  {
    "username": "JasonSaastad",
    "rating": 4.0,
    "comment": "strategic contest\nmoderate skill:moderate luck\n\n awful aesthetics\n incidental interaction\n abated agency via communal crap\n\nThe Occupations and Minor Improvements favor players who are dealt synergistic cards which compounds the problem of the start player action space being a waste of an action if the Minor Improvements you were dealt are sub-par or not synergistic with your strategy.\n\nIf it's illustrated by KF, count me out.\n\nI'd rather play Caverna",
    "timestamp": 1660082400
  },
  {
    "username": "Fd12",
    "rating": 4.0,
    "comment": "like viticulture, but harder. at least more logical.",
    "timestamp": 1659650400
  },
  {
    "username": "Legomancer",
    "rating": 4.0,
    "comment": "I really do not understand the level of hype and emotion surrounding this rather average worker-placement game. I do appreciate the integration of the theme, but the amount of work required for so little payoff is a huge turn-off for me. I'd much rather play Antiquity.\n\nUpdate: 5/17/22. Downgraded this miserable thing to a 4.",
    "timestamp": 1652738400
  },
  {
    "username": "tycygo",
    "rating": 4.0,
    "comment": "Heavyish euro farming game. I have found little enjoyement playing this game. It realy feels like being a medieval peasant, which is feeling i do not like, or seek in games. Struggling to live, struggling to basicaly do anything meaningfull and in the end you have 4 people, clay house and 4 pigs... ehm...\n\nSince worker placement here is quite murderous, good places are taken immediately and there is real struggle to get them before your opponent. Unwelcoming for new players since most of the board gamers have played this classic, which feels outdated for me especially the art which is pain to look at. Why would I play this? I do not know. This game has perfectly working gameplay mechanically, but enjoyement and beauty is missing here.\nI would rather play different euro game that looks better and gives me better feeling of acomplishement rather than \"yay i have gotten 4 sheep so i can eat two and breed the other two\"\nThis game has lots of hardcore fans and competetive players that played this for 15 years. This says alot about quality of this game and to them i say Move on! There are other good games out there. No reason to play this today in 2022.",
    "timestamp": 1650492000
  },
  {
    "username": "yiorgolas",
    "rating": 4.0,
    "comment": "",
    "timestamp": 1648418400
  },
  {
    "username": "bneffer",
    "rating": 4.0,
    "comment": "Tight eurogame. Jobs are interesting and fun. Overall gameplay is punishing and simple \"not fun\" for me. More of a puzzle than a game.",
    "timestamp": 1647471600
  },
  {
    "username": "bqsfgame",
    "rating": 4.0,
    "comment": "I cannot like this game since there are several very expertised players around me.",
    "timestamp": 1645225200
  },
  {
    "username": "calandale",
    "rating": 4.0,
    "comment": "This is a miserable experience. No connection to the decisions really made in farming to help guide play. Nothing but a miserable, AP-filled, point salad game.",
    "timestamp": 1644879600
  },
  {
    "username": "Boozeroony",
    "rating": 4.0,
    "comment": "2",
    "timestamp": 1644274800
  },
  {
    "username": "SJS1971",
    "rating": 4.0,
    "comment": "My rating is only after 1 play so definitely provisional. The game was hard and mystifying, but I felt that way after my first play of The Voyages of Marco Polo and now I love that game. So I am hoping to get more plays of this.",
    "timestamp": 1642978800
  },
  {
    "username": "ZeeGarcia",
    "rating": 4.0,
    "comment": "Tight, calculated survival that makes it difficult to do something FUN, as opposed to something TO SURVIVE. The idea of many paths to victory feels like an illusion; you will need to end up doing a bit of everything, with the only difference between the players being the order in which they tackle these tasks.",
    "timestamp": 1639090800
  },
  {
    "username": "dogzard",
    "rating": 4.0,
    "comment": "Too many choices, no real clues as to what strategy might be better. Just too \"noisy\" to be fun.",
    "timestamp": 1635807600
  },
  {
    "username": "Jace Beleren",
    "rating": 4.0,
    "comment": "Lots of tension playing this game, never feels like you're fully in control",
    "timestamp": 1633384800
  },
  {
    "username": "ShaonV",
    "rating": 4.0,
    "comment": "Long, too many options, even though there seems to be one strategy for best outcome, and can get easily blocked by other players, without the possibility of catching up. Important to understand all the nuances before playing (what to do first, why), which is impossible for beginners.",
    "timestamp": 1633212000
  },
  {
    "username": "baylobo",
    "rating": 4.0,
    "comment": "Not for me, I suppose. Just very, very boring game.",
    "timestamp": 1624485600
  },
  {
    "username": "Puggen",
    "rating": 4.0,
    "comment": "What is the fuss about this game? … selling a cardboard pumpkin just doesn’t tremble my world.",
    "timestamp": 1624226400
  },
  {
    "username": "Migmeister",
    "rating": 4.0,
    "comment": "Ouf, this former number 1 game. I'm not saying it's a bad game, I'm just saying that this is not for every one. My feeling is that it's super tight, every decision can make you lose your game. Most action forces you to take the next 2 or 3... I love game where things become exponential. This one is really about doing as much as you can with as little as you have. Kind of feel like work more than a game. Definitely not for me.",
    "timestamp": 1619388000
  },
  {
    "username": "Takhyon",
    "rating": 4.0,
    "comment": "A very frustrating experience. Each time you feel like you're getting somewhere or are about to accomplish something, the game forces you to take actions which are less fun or otherwise you get bombarded with negative points. Because of how the scoring works you're also not allowed to specialize and each player is forced to acquire at least one sheep / horse / vegetable / whatever or else, yeap, there you go, more negative points. Feels like it's also very difficult to recover from a few suboptimal moves, making you just slowly wither away for the entire rest of the game.\n\nIt's understandable how people enjoy a tight and punishing design like this, but for me all the restrictions and constraints the game forces on the players make it not fun to play. I'm just not interested in games where it feels like you're constantly just barely scraping by, I'm more of a player who wants feel like they're thriving and accomplishing a lot. Willing to give this a few more tries to see if it improves a bit with experience, but games of this style are just really not my cup of tea.",
    "timestamp": 1619301600
  },
  {
    "username": "Virabhadra",
    "rating": 4.0,
    "comment": "I think the \"tremendous variability\" touted by Agricolytes is overstated - everybody still scores victory points for the same things, and your cards dictate the order in which you hit those marks. It also seems like you whether you get a fistful of synergy or complete shit in your opening hand kinda determines how much fun you're going to have for the rest of the game. Either things'll play out smoothly or you're going to bust your ass making the best of a bad draw and lose anyway.\n\nI still wouldn't turn down a game, but if we're set on a Euro, I wouldn't play it over Puerto Rico either.",
    "timestamp": 1618869600
  },
  {
    "username": "Noobidish",
    "rating": 5.0,
    "comment": "materialistic not social (yea ive read Montaillou: Village Occitan too) tempo game. maybe it’s only a drafting game once you’re really good at it. it’s also very funny when players try to stop each other from achieving anything. its really good and i don’t think anything better can really be done with worker placement",
    "timestamp": 1762614240
  },
  {
    "username": "Dreamdealer",
    "rating": 5.0,
    "comment": "The holy cow of BGG but not my kind of meat.\nI like medium-heavy games but this is to much bother for the playing experience it provides",
    "timestamp": 1762470000
  },
  {
    "username": "davidxiang",
    "rating": 5.0,
    "comment": "没玩明白+坐牢系列",
    "timestamp": 1762124400
  },
  {
    "username": "JammyDodger3579",
    "rating": 5.0,
    "comment": "Only played the once, and the playing environment wasn't the finest. I mean, what is there to say, relatively classic worker placement efficiency style gameplay, wrapped up in a theme I'm not fond of. At least the meeples are really cool",
    "timestamp": 1762124400
  },
  {
    "username": "jeffrey_a_meunier",
    "rating": 5.0,
    "comment": "My rating of a 5 is misleading. If this game were handed in as an assignment, I'd give it an A+. However, that doesn't mean that I like to play it. Because I don't.\n\nThere is only one path to victory: (in this order) collect wood, expand house & family ASAP, diversify. There's no need to explore different strategies because they won't work against a player that chooses to follow the one path to victory. And once that player takes the lead, there is no catching up. The game is simply a fierce competition for wood, expansion, diversification. There are many tactics within the strategy, but only one strategy. With a game that has this much going on, this many cards, tokens, tiles, and board space, you'd think that there would be many ways to win. There aren't.\n\nI want to like this game more than I do. I love having to develop and manage the farm, but the game is too much like the setting it models: an environment unforgiving of errors, with an excess of struggle and a lack of fun.\n\nThis is an engine building game, but you don't really get to enjoy the engine that you've built. By the time your engine finally starts running, the game is over.\n\nAlso, even within the game world a lot of suspension of disbelief is required. If (for one example out of many) two players have ovens for baking bread, they can't both simultaneously bake bread. Yes, sure, it's a game and the rules are there to restrict and guide game play, but it still bothers me. Other players' contrived explanations to help with the suspension of disbelief are equally implausible. \"Maybe there's only one oven and what you're gaining is not the oven itself, but permission to use the one oven.\" Well, cripe, if this actually happened in real life, wouldn't they just build a second oven? Ok, ok, suspension of disbelief. It's just a game.\n\nYeah, so many complaints. Other than that, it's a really well-designed game.",
    "timestamp": 1761778800
  },
  {
    "username": "snorman",
    "rating": 5.0,
    "comment": "I can't get into this game and have no desire to play. And yes, I've played the physical copy a couple of times. I even bought the app so that I could learn to play & try to appreciate the game on my own time It's so highly praised on BGG, how could I be wrong? Alas, I can't even make it through the tutorial (which I've attempted to get through multiple times) without being bored out of my mind and wanting to move on to something else. Mechanics? Solid. Theme? \"meh\". Theme integrated into the game mechanics? Fail.",
    "timestamp": 1761519600
  },
  {
    "username": "Dr_frankenscience",
    "rating": 5.0,
    "comment": "I was very excited to finally get a copy of this game! However, I found this game to be very challenging. Compared to other games I found making choices to be generally less fun. You don't have a buffet of interesting choices to make. Instead, what you have are tough choices that don't really allow you to build well-oiled machine. At the end of the game you feel like you have survived but not really thrived. Maybe that gives some people a sense of accomplishment in the face of persistent adversity. But overall I found it to be punishingly difficult throughout.",
    "timestamp": 1761256800
  },
  {
    "username": "designsbybriana",
    "rating": 5.0,
    "comment": "I feel like this game is more punishing than it should be. Worker placement and it feels like there are never enough workers or places to succeed. I enjoy Caverna, by the same designer, more.",
    "timestamp": 1760133600
  },
  {
    "username": "dj_koen",
    "rating": 5.0,
    "comment": "I dont really like the game but i dont hate it also",
    "timestamp": 1759528800
  },
  {
    "username": "PerfectRoll",
    "rating": 5.0,
    "comment": "I do not like the \"feed your people\" aspect of this game done to this extreme.",
    "timestamp": 1756936800
  },
  {
    "username": "msaya",
    "rating": 5.0,
    "comment": "The widespread adoration of this game borders on madness. There is nothing about it that draws me back. The best part of the design lies in the varied and copious Occupation and Minor Improvement cards, which fortunately keep the beginning of the game—and the rest of it too for that matter—from becoming formulaic.\n\nNot an easy game to learn: even in the family version a new player still needs to know the Major Improvement cards well. Other significant quibbles: the less-than-good rules set, the sprawling, cumbersome layout, the okay but could have been better art design, and the constant, increasingly fiddly upkeep. [Donated: Goodwill, 2025]",
    "timestamp": 1754604000
  },
  {
    "username": "selvalabelva",
    "rating": 5.0,
    "comment": "Brainburn         Longevity    \nLuck impact       Rules/Setup  \nInteraction       Involvement  \n\nAftertaste           Enthusiasm   \n\n Played at 3+4 player count\n Confrontation: indirect",
    "timestamp": 1751320800
  },
  {
    "username": "spencyrrh",
    "rating": 5.0,
    "comment": "2024-02-25 (3 plays on BGA): I hope I am able to put aside my resentment that this game's ubiquitous imitators have ruined the hobby. I like messing around with my farm and its wooden components, and I can see the tension in the drafting, but this will never be a favourite for me. I just have to collect all the things and tot up my score at the end. Who cares?\n\nWhat I will say for worker placement games is that their low interaction, mechanistic representation, and gentle themes can make for quite funny or social moments, assuming you have the right players present. For that reason, I can have a pleasant time playing this game.",
    "timestamp": 1750543200
  },
  {
    "username": "Marius n Milan",
    "rating": 5.0,
    "comment": "2011\nN",
    "timestamp": 1747951200
  },
  {
    "username": "Eliya84",
    "rating": 5.0,
    "comment": "It was ok but not more. I have no desire to play this game again.",
    "timestamp": 1747778400
  },
  {
    "username": "vici12365",
    "rating": 5.0,
    "comment": "?",
    "timestamp": 1747432800
  },
  {
    "username": "TheOneCleanHippy",
    "rating": 5.0,
    "comment": "I found it to be really boring.",
    "timestamp": 1745964000
  },
  {
    "username": "JFed01",
    "rating": 5.0,
    "comment": "1-(3,4)-5p 30-150m strategy",
    "timestamp": 1744495200
  },
  {
    "username": "Yankster",
    "rating": 5.0,
    "comment": "A benchmark for worker placement games. I like the fact that it rewards you if you diversify your actions. It is a lot more fun if you select your cards with a draft.",
    "timestamp": 1743116400
  },
  {
    "username": "ultimoratio",
    "rating": 5.0,
    "comment": "This is my first \"heavy game\" - which won't be considered as such now, due to this arms race to create the most obtuse and convoluted design. However, this worker placement classic still trumps over most Euro games.\n\nThere's the obvious strategy of getting more workers, but Farmers of the Moor alleviated that now.\n\nI have the revised edition of this game.",
    "timestamp": 1743116400
  },
  {
    "username": "ElizaAnne",
    "rating": 5.0,
    "comment": "Hard to feed your people and do all the things you want to do. Big game with lots of options of what you can do and not enough time. Feels overly complex.",
    "timestamp": 1741820400
  },
  {
    "username": "masterlelik",
    "rating": 5.0,
    "comment": "boardgames\nP (once)",
    "timestamp": 1739574000
  },
  {
    "username": "ernestns",
    "rating": 5.0,
    "comment": "Great game, but for me, has been replaced by Caverna.",
    "timestamp": 1736550000
  },
  {
    "username": "muzrobertson",
    "rating": 4.5,
    "comment": "A baseline for the genre of modern Euro.",
    "timestamp": 1736290800
  },
  {
    "username": "bggmatje",
    "rating": 5.0,
    "comment": "[June 2021]\nA complex strategy euro game, one of Uwe Rosenberg's farming games. It has good intertwining mechanisms and what you do on your turn is incredibly important. There are also a lot of options to choose from. Perhaps a bit too much to my taste. This one made my head hurt, and while I am glad I played it once, I don't have the desire to play it again.",
    "timestamp": 1736290800
  },
  {
    "username": "Alerosa3",
    "rating": 5.0,
    "comment": "Última partida: 2023-06\nEn el Club Dante",
    "timestamp": 1736204400
  },
  {
    "username": "Zeusman",
    "rating": 5.0,
    "comment": "Non-Library Copy",
    "timestamp": 1731970800
  },
  {
    "username": "timori",
    "rating": 5.0,
    "comment": "Owned on ipad years ago. I don't even know if the app is still around. The game showed a lot of promise, as its many high ratings show, but it wasn't for me back then. I'm curious to go back to it now, but at the same time there are a ton of new games out since then and while I now enjoy the tighter, more stressful style of games, the lack of player interaction compared to something like Bus, isn't appealing to me.",
    "timestamp": 1731452400
  },
  {
    "username": "magicfreak39178",
    "rating": 5.0,
    "comment": "This is one of the best eurogames I have ever played, but I do not like eurogames, so I still would prefer to not play it.",
    "timestamp": 1730329200
  },
  {
    "username": "LordTengil",
    "rating": 5.0,
    "comment": "Played 3 or so times.\n\nSolid game, just not my cup of tea.",
    "timestamp": 1730070000
  },
  {
    "username": "bomberleung",
    "rating": 5.0,
    "comment": "BGG54\nWorker Placement",
    "timestamp": 1725919200
  },
  {
    "username": "Cone Defense",
    "rating": 5.0,
    "comment": "We were late to this one, but I just don't get it. Overall the game feels mostly about setting yourself up to tread water in certain areas for points and center yourself to feed your family. There are too many choke points for materials though making this feel constrained to the point of not making interesting decisions.",
    "timestamp": 1725660000
  },
  {
    "username": "Scifi66",
    "rating": 5.0,
    "comment": "Aging but solid Euro. Any game that has a dibbler card gets my vote!",
    "timestamp": 1724796000
  },
  {
    "username": "selwyth",
    "rating": 5.0,
    "comment": "Action Choice Drafting with many action choices, complex scoring and great scalability with number of players.\n\nSolid game, but nothing \"wow\" in design. Seems like the only big defining thing of the game is that there are a lot of things you need to do, and lots of text-heavy cards, and you don't have enough actions to do everything, so you have to choose and balance trade-offs. Other games have this too, just not taken to such an extreme. But I'd want to have this game if stranded on a desert island with 3-4 other gamers, since the cards give unlimited, if contrived, replay value. Solid and infinitely replayable but nothing particularly special.\n\nI don't understand wtf is so awesome about the cards. They infuse a huge dose of luck into the game, especially since you can't deduce what other people have due to the sheer volume of cards. This game's use of cards is the exact way I hate cards are used for board games (for unnecessary complexity, increasing luck and rewarding experience, and allowing for cheap, no-effort expansions). Also results in frontloaded complexity in having to plan out 14 (!) cards, that makes this game very uneven to play, even when experienced. Biggest mechanical weakness of the game.\n\nPerfect the Family Game (without the cards), which stands up to less than 10 plays (exposing the shallowness of this game), instead of including a ton of cards in the base game and passing it off as an essential part of the game when it really is 3 expansions already packaged in.\n\nI would have preferred it if the design was such that 14 random cards were laid out every game in some common pool, and you could use the Occupation or Minor Improvement action space to draft one of the cards from the pool and play it, after paying its costs. I prefer this pseudo-Family Game version, because the hidden information with the cards just disrupts the well-themed elegance of this game.\n\nDrafting the cards isn't bad either though. It's a good excuse to read cards before the game so I don't have to keep referring back to them during the game.\n\n2+3",
    "timestamp": 1724623200
  },
  {
    "username": "Sadaki",
    "rating": 5.0,
    "comment": "Just play Feast for Odin",
    "timestamp": 1723932000
  },
  {
    "username": "NakedBuddha",
    "rating": 5.0,
    "comment": "This is what I call a project manager game and it really feeds into my shortcomings with ADHD and I like the game but suck at it and hate feeding those people. I am one of the few so don't listen to me.",
    "timestamp": 1723154400
  },
  {
    "username": "CharlieMnemonic",
    "rating": 5.0,
    "comment": "Wow, what a disappointment this was. I was looking forward to playing this classic, but found it only to be a random collection of tasks that used farming terminology (e.g. \"sheep\"). I never felt like I was implementing a farming process, just grabbing whatever chore was left. The cards have so much text on them they may as well not have any art on them at all. Traded away.",
    "timestamp": 1722722400
  },
  {
    "username": "mawilson4",
    "rating": 5.0,
    "comment": "Listen, I get that this game has a devoted following. But what I can't fathom is why micro-actions to, say, build a fence is fun. I've heard this game drips with theme. Yes, sure, whatever, but it's an explicitly bland theme. Those getting the most enjoyment out of it also seem to be the ones parsing the game's options for super-strategies. This is antithetical to why I play most games; if I want to study a game at length to min-max my tactics, I'll open a Chess book. But then, plodding around, trying not to starve, then losing by 20 points to the player who owns the game isn't much fun either.\n\nI like the sharper edges of the strategy, at least. More games should be comfortable with brutal beats for poor play, rather than handing out points like they're candy at a parade. A shame this fact isn't wrapped in more amusement at those bad beats, as with many others that feature negative scoring.\n\nAgricola deserves some credit for starting a handful of trends in board gaming, or at least popularizing them. They're just not trends I particularly enjoy. So while this version of its ideas is better than many that came after it, that's only saying so much.",
    "timestamp": 1720562400
  },
  {
    "username": "noobcitizen",
    "rating": 5.0,
    "comment": "boardgame equivalent of being kicked in the nuts. the game punishes you for every mistake you make. the only viable we to catch up to an opponent is when they make a mistake as well. when I play Agricola, I feel that the win con is not who has the most point, but who made the least mistakes.",
    "timestamp": 1719784800
  },
  {
    "username": "Flavorman2000",
    "rating": 5.0,
    "comment": "Generally not a fan of of Rosenberg and these styles of games. I'll play it just not generally something I'd gravitate to. Limited actions and not enough time to do what you want to do. I think one of the keys is to establish an extra food supply early so you can feed more workers and thus get more actions and thus crush your opponents, I failed to do this.",
    "timestamp": 1718920800
  },
  {
    "username": "nyhotep",
    "rating": 5.0,
    "comment": "Too much of a solitaire puzzle game.\n\nI hate the theme, which makes zero sense: grab all the reeds before your next-door neighbour and leave them to starve (this must be the most unpleasant village on the planet); send your 3-month-old baby out to work.",
    "timestamp": 1718143200
  },
  {
    "username": "GrimBrownie",
    "rating": 5.4,
    "comment": "Hard for me to get into this game and it's just not my flavor or game. Overall the game is well built, but not for me.",
    "timestamp": 1717711200
  },
  {
    "username": "Karima",
    "rating": 5.0,
    "comment": "Meine Familie leidet Hunger - das Spiel deprimiert mich immer zutiefst. Das Grün-Grau der Grafik erinnert mich an unangenehme Krankheiten. Ich kann verstehen, warum man dieses Spiel mag, aber es ist mir zu negativ.",
    "timestamp": 1716760800
  },
  {
    "username": "Daniel109",
    "rating": 5.0,
    "comment": "The cornerstone of the multiplayer solitaire, worker placement/resource gathering genre---a genre I already don't like, so this was always going to be a tough sell. I need to give it another go, but I found my first playthrough to be pretty drab. I did like how tough it was to get points and to make progress, as the struggle made the puzzle more satisfying than it otherwise would have been.",
    "timestamp": 1716069600
  },
  {
    "username": "Brandizzle",
    "rating": 5.0,
    "comment": "Fascinated me when first getting into the hobby. I remember thinking \"This is interesting! But I wonder if there is anything like it that's not so painful.\"",
    "timestamp": 1714860000
  },
  {
    "username": "MikeKoro",
    "rating": 5.0,
    "comment": "2nd Play Thoughts   5   (Sept 2023):\n\nPlayed again and still didn't love it. I did a little better with my knowledge of the first game but still think I would choose many other games before I reached for this one. I am still determined to continue playing so as to be enlightened with what everyone else sees in this game.\n\n1st Play Thoughts   5   (Dec 2022):\n\nI was somewhat lost in my first play of this, and made some big mistakes which led to me not scoring very well, but I feel like I got a decent concept of what the game is all about. I would play it again, but I wasn't a huge fan. It seems like one of those games where you only start to know the game after a dozen high level plays, but for me, the game was a little boring and punishing for me to put in that much of a commitment. The game felt overwhelming from the start having 20 or so cards in my hand and no idea what is a good card or a bad one. I have played Caverna around the same time, and I like what Caverna does a bit more. This game just feels so tight and punishing for you to only score 10-30 points for having a few cows and some pumpkins to show for all your work by the end. If I needed to choose a worker placement for game night, this would be low on my list.",
    "timestamp": 1713823200
  },
  {
    "username": "TimNT",
    "rating": 5.0,
    "comment": "Caverna ist das bessere Spiel",
    "timestamp": 1713477600
  },
  {
    "username": "leszekomega",
    "rating": 5.0,
    "comment": "Worker placement bez interakcji. Powtarzalna przez setup. Nie porwała mnie.",
    "timestamp": 1711666800
  },
  {
    "username": "Necroblaster3000",
    "rating": 5.0,
    "comment": "2 sheep give you 1 additional sheep.\n9,999+ sheep also create only 1 additional sheep.",
    "timestamp": 1710111600
  },
  {
    "username": "soki86",
    "rating": 5.0,
    "comment": "0 interactions",
    "timestamp": 1708297200
  },
  {
    "username": "stowed4sea",
    "rating": 5.0,
    "comment": "While somewhat good, I cannot rate it very high because without the expansion, it feels like I'm replaying the same game, even with all the variability and cards, the feeling of the game is too similar from game to game. I do not like is being forced to build a little of everything to avoid negative points, sometimes I just want to farm and not be a rancher. As good as this game is, I can only play it once a month or so, sometimes I just want more open choice in a game.\n\nEDIT: The more I play, the more I hate it. It ends just as you start to feel you can breath. I would much rather play a longer game like The Colonists where you really get to build something up instead of trying to cram it all into an hour's worth of play. It just isn't fun for me.",
    "timestamp": 1707087600
  },
  {
    "username": "slawslom",
    "rating": 5.0,
    "comment": "I just dont understand why this game is so popular. Played it 3 or 4 times and it was a chore everytime.\nI liked La Havre more but generaly those games are not my thing.",
    "timestamp": 1706655600
  },
  {
    "username": "B_Moores",
    "rating": 5.0,
    "comment": "Probably an unfairly low rating, I always have fun playing but player interaction isnt great",
    "timestamp": 1706482800
  },
  {
    "username": "Nanorider426",
    "rating": 5.0,
    "comment": "I think it's a rather boring game.",
    "timestamp": 1704668400
  },
  {
    "username": "Teslavstwain",
    "rating": 5.0,
    "comment": "One of the earliest games I played in the realm of hobby games. A fun worker placement game where you build up your own farm based on your placement choices.",
    "timestamp": 1703631600
  },
  {
    "username": "BoardGameHappy",
    "rating": 5.0,
    "comment": "Painful game which has been bettered by Caverna and then A Feast For Odin",
    "timestamp": 1700694000
  },
  {
    "username": "firenflux",
    "rating": 5.0,
    "comment": "Kept this game a long time because it’s so highly rated I thought I was missing something. Turns out, no matter how many times I try it, it does not live up to the hype. There are a lot of better games of this type.",
    "timestamp": 1698098400
  },
  {
    "username": "PhanSiPance",
    "rating": 5.0,
    "comment": "This game almost ruined Friday night at GenCon50. One guy loves the game the other hates \"solitary\" group games. The sniping back and forth was a bit much. I feel like they were playing me and trying to get me to not learn the game, I would like to play it again but who knows when that will ever happen.",
    "timestamp": 1697320800
  },
  {
    "username": "Rob Beekman",
    "rating": 5.0,
    "comment": "Owned by Henry",
    "timestamp": 1696629600
  },
  {
    "username": "Zeph!",
    "rating": 5.0,
    "comment": "Much like Caylus, will take more plays to master.",
    "timestamp": 1695074400
  },
  {
    "username": "AmassGames",
    "rating": 5.0,
    "comment": "Prefer Caverna, depends if you like crowns\n\nGoogle AmassGames (2,300 board game reviews, podcast, 3000+ Instagram posts and more)",
    "timestamp": 1692396000
  },
  {
    "username": "eggnewton",
    "rating": 5.0,
    "comment": "I should like this more and maybe I'll play again one day and be converted. I haven't played it in years but it always gave me slight anxiety.",
    "timestamp": 1691964000
  },
  {
    "username": "dkauffman",
    "rating": 4.5,
    "comment": "Great low randomness, just extremely hard to master. Similar to Puerto Rico, where there is simply an optimal way to play, and the winner is just whoever is smarter. I'm definitely wrestling outside of my weight class with my group, but it's certainly a well made game.",
    "timestamp": 1691013600
  },
  {
    "username": "kaepone",
    "rating": 5.0,
    "comment": "Too stressful with everyone working toward roughly the same goals.",
    "timestamp": 1690927200
  },
  {
    "username": "Opography",
    "rating": 5.0,
    "comment": "Not my kind of game, as there are a lot of things to worry about, but I do think it has a lot of interesting mechanics.",
    "timestamp": 1690495200
  },
  {
    "username": "midna2003",
    "rating": 5.0,
    "comment": "Played it a couple of times with 2 players, and I did not really click.\nMaybe this is better in a competitive multiplayer setting.\nWill need to try it in that context, but could also simply not be a game for me.",
    "timestamp": 1689976800
  },
  {
    "username": "PraneFuji",
    "rating": 5.0,
    "comment": "Agricola is a great worker placement game that I came to play relatively late in my boardgame history (2019). I like the constraints of the game in it's demand for feeding your growing family and avoiding negative points from lack of development, as well as the way occupations and improvements shape one's strategy towards victory. Will def play again.",
    "timestamp": 1687903200
  },
  {
    "username": "meshnaster",
    "rating": 5.0,
    "comment": "Place a circle on the board, grab some cubes. When you have enough cubes, turn them in for a scoring opportunity.\n\nI think in general that I don't like worker placement games. It may be that I think they are weak mechanically.",
    "timestamp": 1685484000
  },
  {
    "username": "bfrizb",
    "rating": 4.5,
    "comment": "Not my kind of game. For (semi-)competent/experienced players, it seems like too much of your fate is determined by the Occupation cards you receive at the beginning of the game (even when drafting), such that you can _start_ a 2+ hour game of Agricola with fair sense of how you'll finish the game, which is unattractive to me.",
    "timestamp": 1681596000
  },
  {
    "username": "bainewedlock",
    "rating": 5.0,
    "comment": "Rating 6 = To someone with a similar taste like me: Try this game once if you get a chance.",
    "timestamp": 1679180400
  },
  {
    "username": "RalfMalf",
    "rating": 5.0,
    "comment": "Ok, but I find the gameplay and theme a bit boring. I'd rather play this than Caverna, though.",
    "timestamp": 1679007600
  },
  {
    "username": "Eldard",
    "rating": 5.0,
    "comment": "Played it twice, and I'm unimpressed.",
    "timestamp": 1678316400
  },
  {
    "username": "thrasymedes",
    "rating": 4.5,
    "comment": "Not sure why, but the puzzle here was just never enjoyable to me. Maybe just because it's so tight on resources, and you can be so intensely stymied by other player's choices? Plus the long playing time. Whatever it is, I would only reluctantly play again.",
    "timestamp": 1677366000
  },
  {
    "username": "BearDot25",
    "rating": 5.0,
    "comment": "Playing Agricola is like building a Rube Goldberg machine in a straight jacket. Feels overly restrictive and “solvable”; because there are so few actions I end up getting stuck staring at my cards and the board trying to plan out all 14 turns until my brain turns to mush.\n\nPlaying the Family Version makes the game a bit more palpable for me, but I still don't think I'd ever chose to play this one.\n\nEdit: I was definitely a bit harsh on this one. The drafting improves the game a lot, and I see why people love it. I think I’m just bad at it b/c I’m not good at planning out so far ahead. Raising from 5 to 6.",
    "timestamp": 1675983600
  },
  {
    "username": "Destrio",
    "rating": 5.0,
    "comment": "Misery farm, could still be a good game but the theme is difficult to overcome despite its smart mechanics.",
    "timestamp": 1674860400
  },
  {
    "username": "colmoss1",
    "rating": 5.0,
    "comment": "Just a impression after one game. The mechanics are very easy and the game plays smoothly. Take one action from the main board. You can improve these actions by installing your occupation or improvement cards. So far so good. But the problem is that on one hand, you have a good amount of actions and also combos, but one the other hand you are so so restricted due to lack of resources and due to occupied action spots, that cannot use your actions optimal. I almost constantly have to waste actions to gather resources and barely had the feeling, that i did a good or perfect turn. This feels quite frustrating. The scoring system also doesn't match my taste. It forces you to build every possible aspect of the game, otherwise you will get negative points. You cannot focus. I would give the game a second try but as we have a lot of heavy Eurogames which are more rewarding, i don't know why i should do this.",
    "timestamp": 1674255600
  },
  {
    "username": "Megamic03",
    "rating": 5.0,
    "comment": "3,64\n1 - 5; best 3 - 4\n30 - 150 Minuten",
    "timestamp": 1672614000
  },
  {
    "username": "NOOCX",
    "rating": 5.0,
    "comment": "Agricola is a classic I've never played for a very long time, partly because I'm not a Worker-Placement-Guy and \"Farming games don't excite me\" (I like plants though and nice looking nature-themed games usually peek my interest at least). Now that I've played it, I'm surprised, that I enjoy the Worker-Placement and Engine-Building here more than I thought I would.\n\nUnfortunately there are also two big issues massively spoiling my overall experience. The implementation of the theme is poor to a degree I'm worrying about it (only so many fences, just one offspring no matter the number of animals, making food out of wood, stone, whatever, child needs own house...). And I very much dislike how players are forced to do a mixture of everything and play the game in a certain, very constrained way, instead of being encouraged to go their own way. Certainly a game, asking more for persistence than creativity.\n\nAgricola is ok, ultimately though not a game I want to play as lack of freedom and inconsistency of theme is killing it for me. So sorry Uwe, farming beans is all I want.",
    "timestamp": 1667602800
  },
  {
    "username": "EnYoMe",
    "rating": 5.0,
    "comment": "Didn't have a chemistry with it. Tried it on table and online too.",
    "timestamp": 1665266400
  },
  {
    "username": "sunyushen",
    "rating": 5.0,
    "comment": "不会算",
    "timestamp": 1664920800
  },
  {
    "username": "Keahaw",
    "rating": 5.0,
    "comment": "Played on BGA. I can see why people love this game. However, resource conversion puzzles just don’t excite me at all.",
    "timestamp": 1664575200
  },
  {
    "username": "CepterJB",
    "rating": 5.0,
    "comment": "ワーカーの先取り要素が気に入らない",
    "timestamp": 1663970400
  },
  {
    "username": "Wrecktangled",
    "rating": 5.0,
    "comment": "All the people I tend to agree with on games, like Agricola. I really want to like it, but I guess I just dont get it. I prefer games where I am playing against my opponents, but in this game I feel as though I am fighting the system more than the people around the table. I also dislike the need for family growth and the need to diversify. Each game feels similar to the last due to the need to spread out and do everything. You get these wildly varying cards each game, which you would think spice up each game, but then you are forced to play like the last in order to not take crazy negative points. I am no where near an expert and have only played several times, but I am a bit disappointed I dont enjoy this one as much as I thought I would.",
    "timestamp": 1660341600
  },
  {
    "username": "Gabantik",
    "rating": 5.0,
    "comment": "I know it’s a classic and everyone loves it but I just hate the constant feeling of starvation and lack of time. The choices are definitely meaningful but they never feel fun. I guess that is the point of the theme but it just makes me irritated when I play it.",
    "timestamp": 1659391200
  },
  {
    "username": "Zerility",
    "rating": 5.0,
    "comment": "The game balance is off and the speed and stage length feels wrong. Compounding actions take too long and don't pay off well enough for the effort in some cases.",
    "timestamp": 1659218400
  },
  {
    "username": "b4b8",
    "rating": 5.0,
    "comment": "The game can be brutal, everyone competes for additional workers. If you end up not getting one you'll fall behind.",
    "timestamp": 1657749600
  },
  {
    "username": "heavymetalboardgamer",
    "rating": 4.5,
    "comment": "Vastly inferior to Caverna and A Feast For Odin.",
    "timestamp": 1657317600
  },
  {
    "username": "Fuzzcrumbler",
    "rating": 5.0,
    "comment": "I've come around to hating the whole feeding your people/workers feature. I'll only tolerate it in T'Zolkin. Also, this theme is painfully boring. Particularly since there are a plethora of other choices around that do the same thing, but better (these days). The last play had 2 of us falling asleep. Just horrible.",
    "timestamp": 1656712800
  },
  {
    "username": "sperorin",
    "rating": 5.0,
    "comment": "+ gameplay loop is tight and clear\n\n- food requirements are too rigorous",
    "timestamp": 1656540000
  },
  {
    "username": "Dasbooby",
    "rating": 5.0,
    "comment": "It's ok. Too many cards (7-14) of moderate length that you have to read and decide on before the game even starts. Caverna exists.",
    "timestamp": 1655762400
  },
  {
    "username": "rosewild",
    "rating": 5.0,
    "comment": "Played in 2019",
    "timestamp": 1650060000
  },
  {
    "username": "ApostropheN",
    "rating": 5.0,
    "comment": "We've only played this as a two-player game, and not once has it been fun. It becomes so very versus (even accidentally) that it's beyond frustrating, and it mostly just feels like an exercise in frustration. I'm reserving judgement until we can play with more than two players, but it's a solid \"meh\" with two.",
    "timestamp": 1646434800
  },
  {
    "username": "DH1983",
    "rating": 5.0,
    "comment": "This game was way too harsh at the two player count for us. The optimal move was often just to foil your opponent's plans. We enjoy the more open Caverna much more than this one. The game is well designed and I would maybe consider playing with 3 or 4 players, but we did not enjoy it two player and so got rid of it.",
    "timestamp": 1644361200
  },
  {
    "username": "IsidorBeerenz",
    "rating": 5.0,
    "comment": "This game is on the top 40 on geek rating. If you erase expansions for popular games on that top list, this game almost makes top 20. Of all games ever made. Please! This game is mediocre at best - OR I am sevearly missing something.\n\nMe and my girlfriends enjoy games such as Brass Birmingham, Terraforming Mars, Wingspan. Also enjoy playing simpler games with the nieces, such as Ticket to Ride and Azul.\n\nWe have been trying to find 2 player games, so we got Agricola. We played it about ten times or so, neither of us enjoy it. Too simple perhaps?\n\nI don´t hate the game  - I just find it mediocre.",
    "timestamp": 1640818800
  },
  {
    "username": "atomzero",
    "rating": 5.0,
    "comment": "I don't get the love for this game. It's a fine game, but you cannot win through specialization, which knocks it down quite a bit for me. When I see people play this game, they keep talking about how many ways you can win, yet every farm looks nearly the same by the end of the game.",
    "timestamp": 1640646000
  },
  {
    "username": "Guide8491GM",
    "rating": 5.0,
    "comment": "Love it and play it often. Haven't tried it as a single player though",
    "timestamp": 1638918000
  },
  {
    "username": "Dormammu",
    "rating": 5.0,
    "comment": "The same old complaints of most detractors, but I'll be honest rather than novel. The cards are too wildly variable and the fixed end conditions make the strategy feel constrained (whether or not it truly is). Le Havre fixed everything I dislike about this game.",
    "timestamp": 1638831600
  },
  {
    "username": "Tegarend",
    "rating": 5.0,
    "comment": "I am *not* a EURO-only gamer, but there's always room for a game of Agricola for me.",
    "timestamp": 1637362800
  },
  {
    "username": "RMacG",
    "rating": 5.0,
    "comment": "Don't own this. Not sure I really like it. Has issues that first player can really somewhat control the game and first person to get an extra person has a huge advantage. I find you are so focused on getting resources to feed your family, the game is not that enjoyable. Others like it though so may be that I am not great at it.",
    "timestamp": 1633903200
  },
  {
    "username": "nswoll",
    "rating": 5.0,
    "comment": "Agricola is in my top 5, I have over 100 face to face plays and over 1500 online plays.\n\nBut I realize it's not fair to rate a game based on variants and player-improved design. The original game sucks.\n\nBut if you draft, and remove the banned cards, and remove the useless cards (which is how we always play in person and online) then the game is amazing.",
    "timestamp": 1632866400
  },
  {
    "username": "Shortbeard",
    "rating": 5.0,
    "comment": "Played the family version of the game. This was not as good as I was expecting. Most of the decision process was made for you based on food requirements. Would like to try this one more time with the full game but a very uninspired first play.",
    "timestamp": 1631829600
  },
  {
    "username": "citabogue",
    "rating": 4.5,
    "comment": "Français",
    "timestamp": 1631484000
  },
  {
    "username": "djbrickhaus",
    "rating": 5.0,
    "comment": "I have only played once, and I enjoyed the experience. I am not a huge Euro fan, but I would play this again if the mood struck right. The mechanics are interesting, and the gameplay is much better than Caylus.",
    "timestamp": 1630879200
  },
  {
    "username": "crucius",
    "rating": 5.0,
    "comment": "It's not a bad game, but there's so much you can (and must) do that it very easily becomes an overwhelming experience. I played once and have no desire to play it again anytime soon.",
    "timestamp": 1628632800
  },
  {
    "username": "RhodesN7",
    "rating": 5.0,
    "comment": "It's hard for me to admit this isn't a \"bad\" game. I just find it extremely tedious and boring. I also strongly dislike the massive deck of cards and how much the initial draw/draft/setup sways the game. This wouldn't even be in my top 500 games, so when people claim it is #1 I occasionally can't hold my tongue. A 5 is as high of a rating I can give to a mediocre game with such an insistent fanbase.",
    "timestamp": 1626645600
  },
  {
    "username": "Zamba Bone",
    "rating": 5.0,
    "comment": "Judd Vance gets it to the point: \"See, that's the problem with Eurogames: there is nothing rooted in reality. It's just a multi-player solitaire puzzle masquerading as a group game.\"",
    "timestamp": 1625349600
  },
  {
    "username": "authentic",
    "rating": 5.0,
    "comment": "Extremely influential game with excellent merging of theme and mechanic. Can drag a bit though, especially with large groups.",
    "timestamp": 1624226400
  },
  {
    "username": "Swandog74",
    "rating": 5.0,
    "comment": "Just play Caverna.",
    "timestamp": 1623276000
  },
  {
    "username": "biscuits409",
    "rating": 5.0,
    "comment": "I prefer le havre, but this is no doubt a solid game. You NEED Plano boxes to make this work. Way too annoying to update the board every turn using bags.",
    "timestamp": 1623103200
  },
  {
    "username": "Hotspurious",
    "rating": 5.0,
    "comment": "Digital",
    "timestamp": 1622757600
  },
  {
    "username": "NickSAu",
    "rating": 5.0,
    "comment": "Update: I'm no longer enjoying this, in fact I find it infuriating.\n\nHowever, this is probably due to playing this when tired because this game pressures you to assess food (which doubles as money) and the competition for resources.\n\nSo not only do you have to grit your teeth but a hand of cards then makes you consider charting alternate ways through this tough environment.\n\nThe variety of cards is the appealing aspect as each game will be refreshing, but unless you can build a room and start having offspring the process of building an efficient and high scoring farm is plodding and the feeling is compounded by reseeding the board every round.\n\nBy then, towards the end, I feel I'm wringing my forehead to squeeze out where I can gain 1 point without losing out a point somewhere else.\n\nSo feels like hard labour for little gain, much like running a medieval farm.",
    "timestamp": 1621288800
  },
  {
    "username": "Nenananas",
    "rating": 5.0,
    "comment": "Meh, although I enjoyed my time as a farmer, there are way too many choices you can make. Not to mention all the things you have to read, especially for first timers. The only reason for others to exist is blocking though, which is just not my cup of tea.",
    "timestamp": 1617660000
  },
  {
    "username": "wundersim",
    "rating": 5.0,
    "comment": "2018? Too tense for my liking.",
    "timestamp": 1617487200
  },
  {
    "username": "SlantyME",
    "rating": 5.0,
    "comment": "Complex",
    "timestamp": 1617228000
  },
  {
    "username": "stoneart69",
    "rating": 5.0,
    "comment": "Meh, don't play with more than 3 players or you may die of boredom.",
    "timestamp": 1616194800
  },
  {
    "username": "Goldron",
    "rating": 5.0,
    "comment": "multiplayer solitair game",
    "timestamp": 1608591600
  },
  {
    "username": "mimiwo",
    "rating": 6.0,
    "comment": "I see why people like it. I like the concept more than the actual gameplay",
    "timestamp": 1761865200
  },
  {
    "username": "Euroman",
    "rating": 6.0,
    "comment": "Good game but too much maintenance required. Also, the cards have too great of an affect on the game. Not worth the time and trouble in my opinion. Get behind and you'll stay behind type of game.\nPlay Caverna instead.",
    "timestamp": 1761778800
  },
  {
    "username": "MBorcher54",
    "rating": 6.0,
    "comment": "Never feel like i get to finish this game always ends before i feel accomplished.",
    "timestamp": 1761692400
  },
  {
    "username": "IOIXIOI",
    "rating": 6.0,
    "comment": "Agricola est un jeu historique qui a contribué, à son époque, à l’essor du jeu de société pour passionnés. En 2025, c'est désormais un jeu daté.\n\nCe jeu est trop exigeant. Ce n’est vraiment pas drôle. Je dirai même que c’est grave, tellement ce jeu se prend au sérieux. Il me fait aussi peur que les gens dénués de dérision.\n\nJe vous invite à regarder Le Cheval de Turin de Bela Tarr pour voir un équivalent cinématographique à Agricola. Je parle ici d’un film de 2H30, où des gens miséreux mangent des patates dans le noir, dans leur bâtisse isolée du monde, en attendant que l’hiver passe.\n\nPour des soucis de cohérence avec la rudesse de l’épreuve que traversent les ouvriers d’Agricola, je vais les renommer des « condamnés » aux travaux forcés. Aller comprendre pourquoi on s’inflige ça, mais il va falloir aller chercher de très nombreuses fois des moyens de nourrir nos condamnés. Sous un prétexte simulationniste, on passe son temps à faire des actions stériles pour trouver de la nourriture. On fait tellement souvent ça, qu’à la fin, on ne construit rien d’intéressant. C’est tendu, non pas parce que les joueurs se disputent les ressources, mais parce que le jeu ne veut rien donner aux joueurs !\n\nDe plus, il y a des aménagements qui sont tellement nuls qu’ils ne rentrent dans aucune stratégie viable. Ce sont juste des pièges à débutants, créés pour les mettre à genoux, leur faire baisser la tête et leur faire comprendre l’humilité.\n\nÉpargnez-vous ce chemin de croix. Il existe plein d’autres jeux complexes qui proposent une expérience heureuse, où la pose d’ouvriers offre des récompenses généreuses et non pas de pingres sacrifices de la part du jeu. Essayez Les Châteaux de Bourgogne, Underwater Cities ou Beyond the Sun.",
    "timestamp": 1761343200
  },
  {
    "username": "brothervm",
    "rating": 6.0,
    "comment": "My summation of this game in a single word: \"Arrgh!\" Is that a word? This game feels like actual work.\n\nAfter further play, improving from 6.0 to 6.5, but I think this score might be higher if I didn’t feel like I was hating my life while I was playing.",
    "timestamp": 1760738400
  },
  {
    "username": "Gchristo",
    "rating": 6.0,
    "comment": "spoken for in BGG.Con Math Trade",
    "timestamp": 1760133600
  },
  {
    "username": "maritn",
    "rating": 6.0,
    "comment": "+ Thematic\n- Overwhelming number of actions and cards on your first game\n- Basically no interaction, you're just doing your own stuff\n\nThese low interaction, lots of available actions games are just not my cup of tea.",
    "timestamp": 1759528800
  },
  {
    "username": "davethegame",
    "rating": 6.0,
    "comment": "Didn't think I'd enjoy it as much as I did. (Plus, it's fun to call someone a Master Baker.)",
    "timestamp": 1759010400
  },
  {
    "username": "destro",
    "rating": 6.0,
    "comment": "k",
    "timestamp": 1756245600
  },
  {
    "username": "SouthernGirl",
    "rating": 6.0,
    "comment": "Having played Caverna first, this was lackluster. They are essentially the same game, with Caverna being the upgraded, better version.",
    "timestamp": 1755986400
  },
  {
    "username": "AgentStone",
    "rating": 6.0,
    "comment": "First edition is just 6.",
    "timestamp": 1755122400
  },
  {
    "username": "BenRon",
    "rating": 6.0,
    "comment": "1",
    "timestamp": 1754863200
  },
  {
    "username": "Kantai",
    "rating": 6.0,
    "comment": "I hate it so much, but I desperately need to play it again.",
    "timestamp": 1754776800
  },
  {
    "username": "rutherford82",
    "rating": 5.7,
    "comment": "Farming is fun, but I'm so bad at Euros.",
    "timestamp": 1754604000
  },
  {
    "username": "gracehopper",
    "rating": 6.0,
    "comment": "Nice but too long.",
    "timestamp": 1750284000
  },
  {
    "username": "paramoreta",
    "rating": 5.5,
    "comment": "A classic euro game that offers more headaches and AP than fun. New players don't stand a chance against experienced ones. Too much thinking for such a low-rewarding experience. Wanted to like it, but never did. I would go for Caverna hands down.",
    "timestamp": 1749506400
  },
  {
    "username": "sairam71",
    "rating": 6.0,
    "comment": "After many tries I think it’s a fine game. It’s hard to get anything going and feels like a constant survival game. Very punishing.",
    "timestamp": 1748642400
  },
  {
    "username": "Gendalm",
    "rating": 6.0,
    "comment": "I like to see my farm (and family) growing and arrange all the pieces myself.\n\nOften it becomes a competition for getting wood and less expert players may struggle to find the optimal strategy with cards.\n\nADDED ON MAY 2025: I generally prefer to play more thematic games but, as worker placement, I think the theme works quite well. Also it helps that the game has a family mode (and could be probably adapted for kids as well).",
    "timestamp": 1748469600
  },
  {
    "username": "Lord McMatty",
    "rating": 5.5,
    "comment": "I want to like this game, but it is too intense trying to think ahead multiple turns. Not relaxing - hurts head. And multiple plays seem similar. It could be good if in the right mood, but it is hard to find right people to play.",
    "timestamp": 1747346400
  },
  {
    "username": "Sinoc",
    "rating": 6.0,
    "comment": "Great game, but boring for me. I don't like the mecanich",
    "timestamp": 1747173600
  },
  {
    "username": "Rubcar91",
    "rating": 6.0,
    "comment": "Thought this was fine. Unfortunately, it does feel like you have to do a little bit of everything, which makes the game feel a bit scripted. Didn't feel like I had a lot of freedom to explore and find my own path. Granted, I'm sure experienced players would prove me wrong, but there was nothing exciting about this on a first playthrough. Getting anything to happen seemed like an uphill battle from the beginning of the game to the end. I did enjoy the variety offered by the different cards though.",
    "timestamp": 1747000800
  },
  {
    "username": "dtmoney75",
    "rating": 6.0,
    "comment": "1 Play\n\nPlayed at: 4",
    "timestamp": 1745791200
  },
  {
    "username": "quori82",
    "rating": 6.0,
    "comment": "암것도 모르고 일꾼 둘로 플레이한 초플 감상.",
    "timestamp": 1745100000
  },
  {
    "username": "oursino",
    "rating": 6.0,
    "comment": "Un jeu assez lourd dans sa mécanique mais qui fonctionne plutôt bien si quelqu'un vous l'explique (ça évite de lire la règle à priori longue). Une aide me semble indispensable pour rappeler aux joueurs que des actions doivent se faire selon un certain ordre. Le plus dommageable, à mon sens, c'est qu'il est très difficile de se faire une idée des points des adversaires et donc de savoir si on gagne ou pas…",
    "timestamp": 1744840800
  },
  {
    "username": "opks22",
    "rating": 6.0,
    "comment": "iOS version",
    "timestamp": 1744063200
  },
  {
    "username": "wolvendancer",
    "rating": 6.0,
    "comment": "Farmers of the Moor, Gamers Deck",
    "timestamp": 1743976800
  },
  {
    "username": "ninjadorg",
    "rating": 6.0,
    "comment": "A Euro! I kinda want to know what all the fuss is about though...\n\nUPDATE - really struggling to get over the tedious theme, but the gameplay is tight, and brilliantly executed. I rather see this as feeding into the creativity of games that followed (like Dominion) more than being a fantastic game in itself, though the pieces, cards, and content is pretty flawless. I'm just not a massive fan of medieval farming...\n\nUPDATE - 20/12/16: This was and still is in my top 20. Somebody explain why! I'm not supposed to like medieval farming unless it involved goblins and broadswords...",
    "timestamp": 1743976800
  },
  {
    "username": "BlaAlla",
    "rating": 6.0,
    "comment": "It's just ugly!\nThe cards are funny, and animals are cute. But other then that It's just ugly game.",
    "timestamp": 1743717600
  },
  {
    "username": "tbrofromspace",
    "rating": 6.0,
    "comment": "Reviewed",
    "timestamp": 1743631200
  },
  {
    "username": "Jeffs042",
    "rating": 6.0,
    "comment": "Played my way through my first game of Agricola. Hard game with lots of decisions effecting the outcome. Played the original so I don't know how it plays in the revised edition.\n\nVery long game. Lots of analysis paralysis from our first play through. Promising gameplay though.",
    "timestamp": 1743372000
  },
  {
    "username": "skaughty",
    "rating": 5.9,
    "comment": "$30 with the goodies",
    "timestamp": 1742684400
  },
  {
    "username": "smaug007",
    "rating": 6.2,
    "comment": "I now won't mentally run away from it, yet I think I appreciate it more than loving it.",
    "timestamp": 1742252400
  },
  {
    "username": "AmongFriends",
    "rating": 6.0,
    "comment": "Feeding your workers is a mechanic I do not like and Uwe tends to love it. It's a surprisingly stressful game which goes against its theme. There's some fun choices here and there but it's very thinky and coming up with the food resources to feed your families is rough if you miss.\n\nPure worker placement games have to be exceptional for me to like and this one just isn't that.",
    "timestamp": 1742166000
  },
  {
    "username": "Moneycopy",
    "rating": 6.0,
    "comment": "Cute, but deep. Its hard to gather 4 boardgame geeks.",
    "timestamp": 1741561200
  },
  {
    "username": "butsam",
    "rating": 6.0,
    "comment": "Very innovative, fun with any number of players (including the solo version, although solo has a different feel of course and it is better with opponents).",
    "timestamp": 1741302000
  },
  {
    "username": "sykano",
    "rating": 5.9,
    "comment": "worker placement game to build a farm in ancient Roman times\nwhile it's a classic, it's not that good anymore because it basically forces you to do almost the same every time. The cards give only slight variation.\n\nOptions are too limited for my taste. It's beyond me why you can't bake bread while another farmer is sowing his fields.\nAnd that nonsense that important and quite basic actions become available not before almost end of the game and that years are over faster in second half of the game.\nThe first few rounds are pain and if you finally get going the game is suddenly over.",
    "timestamp": 1740956400
  },
  {
    "username": "Rasdel",
    "rating": 6.0,
    "comment": "It is still one of my favorite \"farming\" euros. Most people blame the feeding mechanic but for me it is something that makes it interesting, tense and it gives me a clear purpose. Other games just give too much freedom and they end up feeling like anything is valid for points and sometimes less is more.",
    "timestamp": 1740870000
  },
  {
    "username": "jecabreradc",
    "rating": 6.0,
    "comment": "Dont see why this would be more than a 6 other than people being nostalgic about it. It is mechanically sound. It is a good game. I respect that it was probably great when it came out. But I would recommend other games in 2025.",
    "timestamp": 1740697200
  },
  {
    "username": "jacobderosenoir",
    "rating": 6.0,
    "comment": "It was the number 1 game for many years on BBG and you see why when you play it. It's a simple game to teach, fast to play and the number of strategy you can try pushes you to want to give it one more try.",
    "timestamp": 1740351600
  },
  {
    "username": "Wasylus",
    "rating": 6.0,
    "comment": "Genre=euro\nPlayers=1-5, b3, b4\nTime=3h\nThemes=??\n\nComplex=?*\nComponent=?*, board, cards\nFun=?*\nMechanic=?*, workers\nRandom=?*\nThematic=?*\n\nA very good pure euro game. I don't like pure euro games very much but this is one of my favourites.",
    "timestamp": 1740265200
  },
  {
    "username": "djmerk",
    "rating": 6.0,
    "comment": "i like this game, yet find it extremely frustrating. with more plays i've found that it's just a little too dense for me to want to break out all the time. i prefer pillars of the earth.\n\nedit: after it sitting on my shelf unplayed for years, i've decided it's just too dense for my liking. rating downgraded.\n\ni've also given up entirely on uwe rosenberg. his games all feel the same. it's just about maximizing production in a constrained way. they are all okay. but i never get excited to play any of them again.",
    "timestamp": 1740178800
  },
  {
    "username": "Versifex",
    "rating": 6.0,
    "comment": "Tuckboxes created.",
    "timestamp": 1739919600
  },
  {
    "username": "krechevskoy",
    "rating": 6.4,
    "comment": "I REALLY wanted to like this game. But I could not as it was too unfriendly.\n\nFor a euro, really only one person can farm at a time? no wonder Europe is in debt.\n\nIf I wanted to play something where I was worried about my next meal came from I would go back to my college days, or those really bad times when my parents were too proud to go on welfare growing up.\n\nI wish it was more enabling like Le Havre or harvest moon.",
    "timestamp": 1739660400
  },
  {
    "username": "ianoas",
    "rating": 6.0,
    "comment": "Awesome game! Uwe Rosenberg is the man!",
    "timestamp": 1739574000
  },
  {
    "username": "Phenuxela",
    "rating": 6.0,
    "comment": "Solo",
    "timestamp": 1738278000
  },
  {
    "username": "Danielka7",
    "rating": 6.0,
    "comment": "Not keen on playing since I own Caverna, but I feel like I should give it another try.",
    "timestamp": 1738105200
  },
  {
    "username": "keespinosa",
    "rating": 6.0,
    "comment": "Played ages ago with Torkelsons?",
    "timestamp": 1738018800
  },
  {
    "username": "Alrami",
    "rating": 6.0,
    "comment": "I find that I don't want to play that often as the game always seems to be similar in play",
    "timestamp": 1737673200
  },
  {
    "username": "loungehead",
    "rating": 6.0,
    "comment": "This is a game that I should love; it has solid euro mechanisms, tough choices, and plenty of interaction. For some reason, though, I just can't bring myself to ever suggest playing it. Someday, perhaps, someone who loves the game will join my game and can show me what I've been missing about it. Until then, it's just going to be another game on the shelf.",
    "timestamp": 1737586800
  },
  {
    "username": "tatoolo",
    "rating": 6.0,
    "comment": "If you're able to get things going relatively early, this game can be pretty enjoyable, but if you fail to get traction early on, it feels like you're constantly treading water and the game feels more like a chore.\n\nThe spatial element of the player boards is almost completely non-existent, so my board looks almost the same every single game. It's annoying.\n\nThe interesting part of the game for me is trying to get a combo worked out with the cards you get at the start of the game, and trying to get that combo out on the table while still keeping your family fed.\n\nSold my first copy, but my gf wanted to get a copy so it's back in the collection. Sadly, I think I dislike the 2p version more than 3-4p due to the scarcity of action spaces to get goods.",
    "timestamp": 1737586800
  },
  {
    "username": "cadavaca",
    "rating": 6.0,
    "comment": "When my mom and sister came to visit me for Thanksgiving after my dad died, I brought this game to their motel room. My mom and a friend of mine and I played Agricola then. My friend won by double digits. The next day my mom and I played a two-player game; I won with the exact score my friend had attained the day before.",
    "timestamp": 1737327600
  },
  {
    "username": "clearush",
    "rating": 6.0,
    "comment": "in 2021 Agricola feels old and less fun compared to some of Uwe newer designs",
    "timestamp": 1735945200
  },
  {
    "username": "UnfitStone",
    "rating": 6.0,
    "comment": "This is good. I understand the appeal, but don't really care to play it. The game is constantly about stressing you out with what you need to do instead of what is fun to do. It's a challenging puzzle that I didn't enjoy working on.",
    "timestamp": 1735254000
  },
  {
    "username": "Radge",
    "rating": 6.0,
    "comment": "The problem with Agricola is that I don't want to play it",
    "timestamp": 1735254000
  },
  {
    "username": "anomander64",
    "rating": 6.0,
    "comment": "Rating after one 2-player game. Interesting game, difficult to assess because it took us half the game to understand the rules. More plays will tell.",
    "timestamp": 1735254000
  },
  {
    "username": "Berf78",
    "rating": 6.0,
    "comment": "Caution : tension-inducing, brain-burner of a game that will leave you sore!\nEvery session is a challenge crammed with tough decisions.\nFun, but feels like a workout.",
    "timestamp": 1734908400
  },
  {
    "username": "KingofLions",
    "rating": 6.0,
    "comment": "Played this once, Jen Backman taught me, and it was fun. But... I haven't played it since so I'm still not going to rate it. I tried once on my own, but the rules were GRADE A Fucked. Way too hard to understand. Melanie says she knows how to play it. We'll figure it out some day.",
    "timestamp": 1733958000
  },
  {
    "username": "Abstractite",
    "rating": 6.0,
    "comment": "It took me awhile to pinpoint what I didn't like about Agricola. I kept the rating at 10 because I didn't seem have a reasonable reason (heh) to lower it.\nBut when I got Agricola: Farmers of the Moor, I realized that the occupations seemed to be just added for good measure, besides being frightfully imbalanced (at least for two players, which means a lot to me).\nWith Farmers of the Moor (sans occupations), Agricola is one of my favorite games.",
    "timestamp": 1733698800
  },
  {
    "username": "LeZerp",
    "rating": 6.0,
    "comment": "The archetypical 2nd generation worker-placement. Mostly ends up feeling contrived and obstructiony - I mean, \"only one family can breed this turn\", when so much of your end games is based on getting that extra worker as early as possible?\n\nIt never really engaged me",
    "timestamp": 1733612400
  },
  {
    "username": "Arkanev",
    "rating": 6.0,
    "comment": "Own the original",
    "timestamp": 1730674800
  },
  {
    "username": "bjsully6",
    "rating": 6.0,
    "comment": "I generally liked this game. It really makes you feel like a farmer and makes the tough choices of what to do each turn. I would probably still play it but it did not make it to the table that much for me. I played it solo a few times and that was pretty fun. I generally enjoy worker placement games and I did like this one. I don't think it had any game mechanics issues but just one of those games that did not grab me enough to want to play it a lot.",
    "timestamp": 1730156400
  },
  {
    "username": "Hollyhock",
    "rating": 6.0,
    "comment": "This once was a \"all-in-one-box for 50€\" eurogame that was later transformed into a kind of collectible card game that costs 3x for a similar amount of content.",
    "timestamp": 1729980000
  },
  {
    "username": "ObzidiaN",
    "rating": 5.5,
    "comment": "It's a real classic but I didn't love it.",
    "timestamp": 1728252000
  },
  {
    "username": "tothrmate",
    "rating": 6.2,
    "comment": "This is a bit unfair rating as the game is quite good and I have actually played it more than the registered plays. However, I have almost zero affinity to play it anymore.\n\nFirst, it's not really enjoyable to play it with new players, as the game greatly rewards experience, especially in case of timing when to go for the first player spot, racing for more workers/improvements, and when to expect certain action spots to come up. Combining that with the variability of the cards, it could be a pro instead of a con but there are plenty of games with better themes and art scratching the same itch, so I don't really feel the urge to put the energy into it.",
    "timestamp": 1727215200
  },
  {
    "username": "fredknittel",
    "rating": 6.0,
    "comment": "The puzzle is how do you maximize your points through working your land, building your farm, and raising animals with limited worker placement actions and with opponents blocking actions. Only played basic game, but can see it being addicting to dig into.",
    "timestamp": 1726696800
  },
  {
    "username": "Yoda2798",
    "rating": 6.0,
    "comment": "Agricola is a classic in the worker placement genre, being one of the first games to really kick the genre off. While it's clear to see where following games took inspiration, it's also clear how the design is a bit dated in some ways compared to more modern takes. First of all, the game is quite complex compared to its successors, which retain the core type of gameplay while managing to be more approachable. Relatedly, the theme is rather dry and not something that will excite many people, even if it does fit well enough with the mechanics, while more modern games in the genre like Everdell and Dune:Imperium are far more likely to grab players (Agricola's art being subpar also doesn't help). Gameplay wise, Agricola is also comparatively harsh: you'll be stuck on just two actions per turn for a while, and even once the option of having kids opens up there's a serious cost to get them in play, along with an extra mouth to feed adding to the real struggle to have enough food when harvest comes around while doing what you want to (way way harder than something like Stone Age, even). Each resource is generally limited to one action space, i.e. only one person can grab it per turn, so the \"take that\" element when someone beats you to an action you want to take can be very painful as there's not usually a different way to accomplish the same thing. Agricola lives up to its setting of being a struggling farmer getting by, and while I probably would want to play it again at some point and can appreciate its complexity to some extent, I think for new players especially but also just myself that I would rather play a more approachable (and enjoyable, due to being less harsh and having stronger progression over the course of the game) worker placement game like Everdell instead.",
    "timestamp": 1726437600
  },
  {
    "username": "luminous48",
    "rating": 6.0,
    "comment": "I have a knee jerk negative reaction to the game boiling down to a race of getting more workers. I love all the cards the game comes with and the strategies that you can build around them. Truly gave me the angst of \"you want to do everything, but you cant\" that is exemplified in so many great games. I always think of the fond nostalgia I have with Agricola, but I never want to pull this thing off the shelf given that it is so big, so long and ultimately not very interesting once you realize you're just going for the same core strategy of maximizing workers every game.",
    "timestamp": 1726092000
  },
  {
    "username": "Kiro",
    "rating": 6.0,
    "comment": "1 - 5",
    "timestamp": 1725228000
  },
  {
    "username": "vejrum",
    "rating": 6.0,
    "comment": "Finally got to try this. Quite simple despite the awful rulebook. Meh! 80% fiddly \"bookkeeping\" and reading all the different cards. 20% gameplay.\n\nAs much interaction and things to do and shovelling shit as if actually living on a small farm in the middle of fecking nowhere.",
    "timestamp": 1724450400
  },
  {
    "username": "parpari",
    "rating": 6.0,
    "comment": "It is very good game but I am not fan of randomness of occupation cards. I know it can be drafted but it slows down and decreases elegant of the game. That is why I find La Havre superior. It is very similar game but open information and no card draw.",
    "timestamp": 1722981600
  },
  {
    "username": "kiwipaul",
    "rating": 6.0,
    "comment": "A classic, but play other games over this these days",
    "timestamp": 1722463200
  },
  {
    "username": "Ruesailmana",
    "rating": 6.0,
    "comment": "I figured it out what I don't like about this game: The goal is too dispersed for me; no empty spots and as much variance as possible with the few resources and the short time you have. I need to work towards some kind of goal to enjoy a game; like a defendable dungeon in Dungeon Lords or (I hope) the best beers in Brew crafters. Some games I play are a bit scattered goalwise speaking, but at least in those games you can choose your own goals or ways to go forward. In Agricola not so much; Agricola crossed the fine line of not enough focus combined with too many must-do's and too little resources",
    "timestamp": 1720044000
  },
  {
    "username": "Raoninja",
    "rating": 6.0,
    "comment": "uno dei giochi più brutti del mondo, noiosissimo. il 70 per cento delle carte non servono a niente e se le usi hai perso. Invece gli altri giochi di Uwe mi piacciono molto",
    "timestamp": 1719871200
  },
  {
    "username": "Ctrlalt",
    "rating": 6.0,
    "comment": "This game is good and solid, and I would recommend it to other players.",
    "timestamp": 1719093600
  },
  {
    "username": "game addict",
    "rating": 6.0,
    "comment": "Poor condition",
    "timestamp": 1718748000
  },
  {
    "username": "JohnnyRedshells",
    "rating": 6.0,
    "comment": "long and excessive gameplay that has a wingspan engine, with a smidge more complications. While the game has strategy and good goals for players to achieve, the game is inferior to the majority of reputable engine builders/farming/village building games.",
    "timestamp": 1717970400
  },
  {
    "username": "Spelmaniak",
    "rating": 6.0,
    "comment": "Very clever puzzle game. Maybe a bit to much of a puzzle than a game. Love to play it over and over.",
    "timestamp": 1717970400
  },
  {
    "username": "slaapgraag",
    "rating": 6.0,
    "comment": "Zie BSM https://www.bordspelmania.eu/spellendatabase_post.php?mode=p... voor mini-review.\nNa 2e potje afgewaardeerd naar 6: Als beginner blijft het wat tasten in het duister.",
    "timestamp": 1717797600
  },
  {
    "username": "zuzusdad",
    "rating": 6.0,
    "comment": "A fun, complicated and incredibly frustrating game. The frustration comes from not being able to do the things you want/plan to and the pressure to feed your farmers. Mentally exhausting game.",
    "timestamp": 1716760800
  },
  {
    "username": "SYGF",
    "rating": 6.0,
    "comment": "The game rewards good stochastic play and branching decision paths. Really good hidden information element, but gets better when all players have cards memorized.",
    "timestamp": 1716415200
  },
  {
    "username": "spelledaren",
    "rating": 6.0,
    "comment": "This is kinda cute, and somewhat interesting. But number 1? It's a math game...about farming. Very odd.\n\nFamily game works fine, I have no problem with it compared to the card driven normal game. When you know everyones options it actually becomes more cut-throat, so it feels like the family game opens for more screwage than otherwise!\n\nThe rule book is horrible for learning the game. Ugh! Bad bad designers. Where is the layout explained? Anyway, after getting through the first game you find that this actually plays quickly, but is prone to AP. So if you have an AP-prone player, don't play this with them.\n\nI don't think this is solitaire. I plan all my moves depending on what the others will and want to do. It might become more like solitaire with the cards, as more options are viable to more people, but I have to play more to judge this properly.\n\nI will probably never suggest this with my regular gaming group, there just are better games that interest us more. I will play this with my SO, and try to sell it to a few other non-regular gamers that we meet up with.\n\nUPDATE:\n\n8 games played. Rating lowered from 6 to 5. Nothing has changed, it's a math game.",
    "timestamp": 1715896800
  },
  {
    "username": "c_cutlip",
    "rating": 6.0,
    "comment": "Was fun for a while, but the combination of worker placement with a whole gazillion of cards isn't really my kind of fun. Especially not when all the farms end up looking more or less the same in the end, and it's mostly a question of making it a bit quicker/more efficient than the other players. And I want more interaction in the WP games I play (Dominant Species, Vanuatu, Keythedral, even Caylus), at least when they are of this weight and length.",
    "timestamp": 1715032800
  },
  {
    "username": "3milion",
    "rating": 6.0,
    "comment": "A bit repetitive?",
    "timestamp": 1713304800
  },
  {
    "username": "andycted",
    "rating": 5.5,
    "comment": "Boring as hell, simplistic, lots of false decisions and the rest is pure optimisation with the wrong kind of interaction. Bah",
    "timestamp": 1713218400
  },
  {
    "username": "HighChronicler",
    "rating": 6.0,
    "comment": "I thought the theme was excellent, but it just didn't scratch that itch for me. It also felt hard to do anything.",
    "timestamp": 1712008800
  },
  {
    "username": "mcmgm_bgg",
    "rating": 6.0,
    "comment": "SdJ almost",
    "timestamp": 1710802800
  },
  {
    "username": "Carlijnwins",
    "rating": 6.0,
    "comment": "I don't like this game.... the feeding of your family...it is horrible, no resources and time running out.. sold immediately after playing 2 or 3 games.",
    "timestamp": 1710111600
  },
  {
    "username": "pozdnyshev",
    "rating": 6.0,
    "comment": "z-man",
    "timestamp": 1710111600
  },
  {
    "username": "pingus",
    "rating": 6.0,
    "comment": "Caverna made it -2 points.",
    "timestamp": 1709334000
  },
  {
    "username": "Inari44",
    "rating": 6.0,
    "comment": "Agricola is a worker placement game that takes 14 rounds. Each round has 3 phases. These rounds are grouped into 6 stages. Each stage will end with a special 4th harvest phase where you get to harvest any grain or vegetables you’ve grown, feed your family, and breed animals. You begin as a couple of farmers in a little house - so 2 workers. You’ll be placing workers on a space to take the action of that space. There are accumulation spaces that will continue to fill up with goods each round. A space of this type that goes unused will become more and more appealing as the goods build up over time. A new action space is revealed each round for more options, but this game does use action blocking so once a player puts a worker on an action space - no one else can use that action until the next round.\n\nYou’ll be growing your farm, home, and family. More family means extra workers for more actions, but you have to keep them fed or you’ll start gaining beggar cards worth negative VP. There are also a ton of cards for improvements and occupations that provide more abilities and scoring. As with any game with so many cards, there ends up being a bit of luck for getting good combinations that work well for what you’re doing - and some are clearly better than others.\n\nThe game is tight and encourages you to be flexible. Someone will most likely be blocking what you want to do, so it is good to always have a backup plan. Making the best of whatever cards you draw is part of the game. Ensuring you keep your growing family fed adds a bit to the tension, but also feels tedious. Always getting workers as quickly as possible is just repetitive but necessary. Despite the large number of cards which should add variety, every game feels basically the same to me. I think it is mostly designed well - but it is just boring.",
    "timestamp": 1708902000
  },
  {
    "username": "Space8es",
    "rating": 6.0,
    "comment": "Agricola is a classic. It's a game I appreciate and would come back to play once in a while, but the lack of variability makes each experience feel samey. Feeding the workers can be quite tiresome and going for extra workers is basicly a non-brainer.",
    "timestamp": 1708297200
  },
  {
    "username": "Jocab",
    "rating": 6.0,
    "comment": "The game is... well - there just to much... or to little... I dont know. Its *very* much a euro-style game. The few times I have played it, I was not very much entertained. It is one of those games that is the reason Im going towards highly thematic games.",
    "timestamp": 1708210800
  },
  {
    "username": "TVDinner",
    "rating": 6.0,
    "comment": "moo? We decided to pick up Le Havre first.\n\nbaa-aa-aa-aah. We decided to pick this up. It's still hard for me to wrap my limited brains around the game.\n\nI think this one's still a 7 primarily because we haven't played it enough to really get a feel of how the options play out.\n\nWe still haven't played this enough to get past the randomness of the card draws. I think it may be stuck at seven because this old fart can't seem to get around the card draws and do something useful.\n\nThis has fallen to a six. I just can't get past spending so much time playing the game when a player can just get lucky in a 14 card draw at the beginning. I like the game, but Le Havre seriously kicks the crap out of it for me.\n\nI'd really like to think I'm learning how to see how my hand of starting cards work together, but I just don't. Drafting just kills me.\n\nI can't decide if I like the openness of Caverna with less fighting with the same strategy, or Agricola's less resource paths and hidden cards.",
    "timestamp": 1707606000
  },
  {
    "username": "hergambit",
    "rating": 6.0,
    "comment": "Includes minis",
    "timestamp": 1707260400
  },
  {
    "username": "Westerlund",
    "rating": 6.0,
    "comment": "M",
    "timestamp": 1707087600
  },
  {
    "username": "kifty",
    "rating": 6.0,
    "comment": "After one play, I found it fun, but a bit more complicated that I thought it would be. Definitely a stretch to call this one a family game. I'm looking forward to playing it more.\nUPDATE: I'm bumping it down a notch to 7. I like it well enough, but it's kind of stressful to play, to be honest. Maybe it's because I always seem to lose so horribly.\nSept. 2011: Back up to an 8! This game shines with 2 players, and since my wife really likes it, that makes for better gaming experiences.\nFeb. 2024: This has dropped pretty steeply in my estimation. Worker placement games just aren't my jam, I guess. I'll hold onto Caylus, but the rest can go.",
    "timestamp": 1707087600
  },
  {
    "username": "garry_rice",
    "rating": 6.0,
    "comment": "Love the farming theme. That said, play is very tight and it can be a struggle to produce sufficient food each harvest if a system is not developed in the early rounds when there are more turns between harvests.\n\nEDIT - I've soured on this one over time. Part of it may be that I'm tired of worker placement as it is engaged in this game.",
    "timestamp": 1707087600
  },
  {
    "username": "M2Cat",
    "rating": 6.0,
    "comment": "I was eager to play it since start of my gaming career.\nI did not know what to wait from it.\nPlayed it first time in 2024.\nNow it looks lots outdated.",
    "timestamp": 1707001200
  },
  {
    "username": "Luke1705",
    "rating": 6.0,
    "comment": "A little repetitive after many plays, but it flows well and is extremely fun trying to guess what your opponents will do and react accordingly. Highly recommended",
    "timestamp": 1706396400
  },
  {
    "username": "HomerTheChopper",
    "rating": 6.0,
    "comment": "ze 2 rozgrywki na 2 osoby, obczepiłbym w więcej",
    "timestamp": 1705878000
  },
  {
    "username": "chicagometh",
    "rating": 6.2,
    "comment": "Edit: Rating from 7.9 to 6.2 - Having played more of the 2-player All Creatures Big and Small, I find it to be superior in nearly every way. Since Agricola was released, more games have made large unique decks of action-driven cards (Terraforming Mars, Ark Nova, etc.) that do this right...in Agricola, the cards don't mean as much as they should and it is frustrating, because that is where the fun is. Otherwise, it becomes a table-random worker placement slog that I don't really want to play anymore.",
    "timestamp": 1705532400
  },
  {
    "username": "Dan61",
    "rating": 6.0,
    "comment": "Owned on Steam",
    "timestamp": 1705446000
  },
  {
    "username": "sobaka770",
    "rating": 6.0,
    "comment": "Wow, what a reversal - I loved Agricola when I first started with the hobby but it fell pretty heavily for me. My group doesn't like it and the theme is just not exciting after a dozen plays. Sold it and Caverna because I can't justify playing this.\n\nORIGINAL. Almost perfect. There's a bit of downtime between turns, but this is for me the best small group game. No dice, minimal luck and a lot of fun. Whot though farming would be interesting...",
    "timestamp": 1705273200
  },
  {
    "username": "MEJV",
    "rating": 6.0,
    "comment": "Game that need more gaming. Good theme even it wasn't not about bishop of Finland from 1500.",
    "timestamp": 1704841200
  },
  {
    "username": "okiedokie",
    "rating": 6.0,
    "comment": "Xx This sort of game isn't really my cup of tea. Played once, would try again, but I don't see it being a non-stop hit for me. I would prefer Puerto Rico.",
    "timestamp": 1704841200
  },
  {
    "username": "chrisbrandt",
    "rating": 6.0,
    "comment": "I understand why this is such a highly regarded game. It is a superb exercise in planning and managing scarce resources. But it's just too fiddly for me... and too long. I'll play it if that's what's being played, but I feel that there are other games that give me those experiences without quite as much stinginess and in a shorter time.",
    "timestamp": 1704754800
  },
  {
    "username": "el_piszczu",
    "rating": 6.0,
    "comment": "Owned it, rated 8/9\nAfter time - too complex to explain to new players and always goes in same direction (you need cow, carrot, boar etc etc to contend for win in the end) - not a huge fan anymore",
    "timestamp": 1703631600
  },
  {
    "username": "berniethered",
    "rating": 5.5,
    "comment": "stressful/harsh game - sometimes rewarding but is it worth the effort? how is it that in every game I get so worked up that nothing is happening or clicking together and then at the last second it all works out ok. It is just a bit too long to get to the table... and I would love to try out some variants for feeding. Ultimately, this game is just too tense, punitive and restricting for my taste - and maybe some variant could make it more to my liking but really - do I want to do that? if you like games that leave you fretting and wishing you could do more then you might like this game... for me. I don't think this is for me.",
    "timestamp": 1702162800
  },
  {
    "username": "goaliechris",
    "rating": 6.0,
    "comment": "Was better earlier on, but now ewe has much better games. It's a game where you have to diversify and htink about the other players placements. Don't like how you have to funnel to feed your players.",
    "timestamp": 1701817200
  },
  {
    "username": "m4p3t",
    "rating": 6.0,
    "comment": "BGA",
    "timestamp": 1701644400
  },
  {
    "username": "Gazzik",
    "rating": 5.5,
    "comment": "With Sheep replacement pieces, and good metal and plastic containers for the myriad of pieces in this frustrating game. As a new player, never play it with an upside-down board.",
    "timestamp": 1701298800
  },
  {
    "username": "jcsehak",
    "rating": 6.0,
    "comment": "AKA Misery Farmer",
    "timestamp": 1700348400
  },
  {
    "username": "werika",
    "rating": 6.0,
    "comment": "I can't objectively rate it lower than a 6 because it's not a *bad* game. It is, however, extremely stressful and I just don't want to play it.",
    "timestamp": 1699052400
  },
  {
    "username": "ab4523",
    "rating": 6.0,
    "comment": "A classic game, that has influenced many titles since, but now feels too constraining and process-heavy. I would much prefer to play something more positive like Le Havre.",
    "timestamp": 1696802400
  },
  {
    "username": "Muggy86",
    "rating": 6.0,
    "comment": "Sleeved. With Organizer (+18.19 01/06/2023 DD)",
    "timestamp": 1696543200
  },
  {
    "username": "ConraDargo",
    "rating": 6.0,
    "comment": "Still a pretty good game, but it really can be a tad unforgiving and it takes way too long for what it SHOULD be. The cards can really screw things up too and I'd rather play without them, or pick Caverna or Agricola: ACB&S instead!",
    "timestamp": 1696543200
  },
  {
    "username": "CarsonChandler",
    "rating": 7.0,
    "comment": "Enjoyed this on BGA even not knowing what I was doing.",
    "timestamp": 1762655100
  },
  {
    "username": "Nuvium",
    "rating": 7.0,
    "comment": "Good, but too much setup.",
    "timestamp": 1762297200
  },
  {
    "username": "Lgb-JohnDoe",
    "rating": 7.0,
    "comment": "Signed by the designer.",
    "timestamp": 1762124400
  },
  {
    "username": "BrutusA",
    "rating": 7.0,
    "comment": "Aesthetic: 1\nMechanism: 2\nInvolvement/length/fluid: 1\nReplayability: 2\nOther: 1",
    "timestamp": 1761519600
  },
  {
    "username": "Derianhorgen",
    "rating": 7.0,
    "comment": "SpielboxRating 7-10, av. 8,75\nThomas",
    "timestamp": 1761429600
  },
  {
    "username": "Qhorin",
    "rating": 7.0,
    "comment": "Excellent economic engine game. Variable win conditions and hopefully replay value due to the number of cards. Scales very well form 2 to 5 with little downtime. A few occupation cards appear to be a bit strong. I always want to play this game.",
    "timestamp": 1761429600
  },
  {
    "username": "thorbot",
    "rating": 7.0,
    "comment": "If you play with the card draft variant the gameplay is greatly improved. I enjoyed this more than I thought with the draft. Happy to play any time but would rather play AfFo or Hallertau if given the option.",
    "timestamp": 1760911200
  },
  {
    "username": "StrongbowGold",
    "rating": 7.0,
    "comment": "D-5",
    "timestamp": 1760738400
  },
  {
    "username": "HaoTien",
    "rating": 7.0,
    "comment": "过的太苦了，基本都在维持温饱，第一次玩体验很一般，不如波多黎各那么机制爽",
    "timestamp": 1760565600
  },
  {
    "username": "Ricosuave24",
    "rating": 7.0,
    "comment": "Enjoy it, just hard to get it to the table.\n\nI have the old version (no animeeples)",
    "timestamp": 1760479200
  },
  {
    "username": "Kveld",
    "rating": 7.0,
    "comment": "En mi opinión la piedra roseta de la transformación de filosofía de los euros de la simplificación al barroquismo.\n\nA pesar de adjudicarle este pecado, Agrícola no es un juego sin alma, cuenta una historia y el jugador, independientemente de la puntuación, puede contemplar la granja resultado de sus esfuerzos.\nLa interacción de los jugadores se reduce a la ocupación de las acciones disponibles, las cuales normalmente van cargando su recompensa si los jugadores no las eligen.\nEl sistema de cartas quizás es el punto débil del juego y es para mí torpe, incluso inplementando alguna variante de draft.\nEsquema usado ad nauseam por Uwe en posteriores juegos.",
    "timestamp": 1760392800
  },
  {
    "username": "acolyte",
    "rating": 7.0,
    "comment": "Revised edition is better, so dropped my rating on this one.",
    "timestamp": 1759874400
  },
  {
    "username": "MrBigos",
    "rating": 7.0,
    "comment": "I just love the theme and scoring system in this game. You try to build best farm and that's it. The game has simple mechanics, but the designer calculated things perfectly, so there is always something missing, you always need to chase some specific resource and abandon others.\nAfter couple plays I still don't know how to play it perfectly, which gives a lot of room for learning and improvement.\n\nUpdate: After couple plays with cards, I am starting to hate it. Instead of building the best farm, game now focuses to play cards in specific order and farm is not growing couple first turns.",
    "timestamp": 1759096800
  },
  {
    "username": "Minh_Nguyen",
    "rating": 7.0,
    "comment": "Probably gets better with more plays. Maybe willing to give it another chance. This game has a well established reputation as a love it or hate it game, and after very limited plays I'm clearly in the latter group.\n\nPlayed again after 13 years. Now that I'm firmly in the hobby and have more reference points to view this game against, the rating is going up from 3 to 7, in otherwords, from miserable to fine. It's not overly hard to get enough food to feed your family. Some goods are much more scarce than others. 2 actions per round for the first several rounds feels pretty restrictive. I like the decisions around when to play occupation and minor improvement cards, and in what order. The math in the game is curious, and I think you have to play enough times to internalize the math before you can really enjoy it, at least for me that will be the case. On the whole it's right now a pretty straightforward worker placement game, which is a very crowded category.",
    "timestamp": 1758837600
  },
  {
    "username": "DeadDomino",
    "rating": 7.0,
    "comment": "Me having rated this a 7 feels almost sacrilegious. But I haven’t played it since 2017 and don’t feel super drawn to it.",
    "timestamp": 1758492000
  },
  {
    "username": "Hisu",
    "rating": 6.5,
    "comment": "Very similar in gameplay to a few other games that I prefer more thematically",
    "timestamp": 1758146400
  },
  {
    "username": "themikeman",
    "rating": 7.0,
    "comment": "BGA: Maybe just shy of great? Playing online takes away much of the pain of setup and upkeep and the game still felt like a chore to learn and play. However, it was fun to build up a farm and I can imagine having a little civilization grow in front of you being fun and satisfying. I just wish things were a bit more intuitive and streamlined. Feast for Odin is even more decision space complex, but Agricola has way more emphasis on cards and gradually revealed locations which seems to tax memory and knowledge more. (7)\n---\n2/15/25: More BGA, seeing more of the fun here. Lots of tough decisions and since everything is so tight, blocking actually makes a big difference vs other worker placement games that are more generous. Card combos are the real magic here, but I wonder if loosening up the scoring could make this game more inviting. (8)\n---\nIRL, adding resources to the accumulation spaces is a huge pain.",
    "timestamp": 1756936800
  },
  {
    "username": "Rubeus",
    "rating": 7.0,
    "comment": "Edición antigua del ínclito «Agrícola», del famoso diseñador Uwe Rosenberg. La regalé cuando salió la nueva versión.",
    "timestamp": 1756764000
  },
  {
    "username": "Moonpie13",
    "rating": 6.5,
    "comment": "Finally got around to playing this one. I can call myself a board gamer now. Having played it now in 2025 for the first time though meant i couldn't help but feel it's been improved upon. It was dry and merely okay.",
    "timestamp": 1756418400
  },
  {
    "username": "MPetey",
    "rating": 7.0,
    "comment": "Played",
    "timestamp": 1756245600
  },
  {
    "username": "BJOSEPHLYON",
    "rating": 7.0,
    "comment": "NO PICS\nLBC",
    "timestamp": 1756245600
  },
  {
    "username": "kacperjestfajny",
    "rating": 7.0,
    "comment": "Really good, but lacks of varies ways to win.\nYou always need to be optimized the same way",
    "timestamp": 1755813600
  },
  {
    "username": "ditterio",
    "rating": 7.0,
    "comment": "see Caverna",
    "timestamp": 1755208800
  },
  {
    "username": "NithGamer",
    "rating": 7.0,
    "comment": "Got it from sci-fi bokhandeln summer 2014.",
    "timestamp": 1755208800
  },
  {
    "username": "Rorek9",
    "rating": 7.0,
    "comment": "No frills resource management and engine-building game. Players can suffer from decision/analysis paralysis",
    "timestamp": 1754863200
  },
  {
    "username": "GeminiWeb",
    "rating": 7.0,
    "comment": "First 3 plays were solo games ...",
    "timestamp": 1754863200
  },
  {
    "username": "ReptilianSamurai",
    "rating": 7.0,
    "comment": "Good worker placement and farm building but can have some analysis paralysis and can be annoying when the spot you need is taken",
    "timestamp": 1754690400
  },
  {
    "username": "Arnar146",
    "rating": 7.0,
    "comment": "Gisli\nTýnt\nBGA",
    "timestamp": 1754517600
  },
  {
    "username": "AnotherKees",
    "rating": 6.5,
    "comment": "Gets a bit boring after a couple of games. The first couple of moves are basically the same (i.e get an extra worker asap).",
    "timestamp": 1753999200
  },
  {
    "username": "Althoinerbehurfteil",
    "rating": 7.0,
    "comment": "Great game. One of the best Eurostyle games I have played. It works well as 2 player.",
    "timestamp": 1753826400
  },
  {
    "username": "renvhoek",
    "rating": 7.0,
    "comment": "One of my original Euros to play, has a lot of nostalgia but not one I'd pull out since I believe there is now better out there.",
    "timestamp": 1753480800
  },
  {
    "username": "PaleHorse",
    "rating": 6.5,
    "comment": "I rather like this game and would like to play it more to fathom the depths of it but NO ONE in my family of gamers likes it. It is very fiddly and has way too many cards for its own good and it is after all a worker placement game--not my favorite and it plays too long for what it is. I would prefer a whole lot of titles to this one (including Le Havre) and would still rate it a 7 but from the family's reaction I deduct a point.",
    "timestamp": 1753308000
  },
  {
    "username": "doublecrocodile",
    "rating": 7.0,
    "comment": "It's pretty good, but I'm not sure Agricola creates enough fun for me and my group to justify its length and setup. I do like creating strategies from the initial occupation and improvement cards, and I admire how the game just makes intuitive sense, making it easy to teach. Another worker placement game that I really wish I like more than I actually like.\n\n+ Immersive\n+ Charm\n+ Tight gameplay rewards strategy\n+ Timed ending\n\n- Slow until everyone knows how to play\n- Lots of pieces to set up and manage",
    "timestamp": 1753308000
  },
  {
    "username": "holysmoke",
    "rating": 7.3,
    "comment": "Cux",
    "timestamp": 1753221600
  },
  {
    "username": "hammerfest451",
    "rating": 6.8,
    "comment": "Includes:\n-Goodies box",
    "timestamp": 1753048800
  },
  {
    "username": "Rickdey55",
    "rating": 7.0,
    "comment": "We just hate feeding the people. Takes away the fun for us.",
    "timestamp": 1752962400
  },
  {
    "username": "chunky56",
    "rating": 7.0,
    "comment": "Feb 2019:\nNot as excited about this as I used to be; a bit worn out on worker placement games.\n\nOriginal:\nGreat fun every time. Satisfying to see one's farm at the end. Only prefer to play this one 3-5 players.",
    "timestamp": 1752703200
  },
  {
    "username": "Brother Abe",
    "rating": 7.0,
    "comment": "8.7645 We have revised edition",
    "timestamp": 1752444000
  },
  {
    "username": "tscox87",
    "rating": 7.3,
    "comment": "A mean and tight worker placement game with an agricultural theme. A classic, but not really to my tastes.",
    "timestamp": 1751580000
  },
  {
    "username": "hihimorton",
    "rating": 7.2,
    "comment": "It's a good worker placemnt game.\nThe cards make it more complicated but interesting.",
    "timestamp": 1751493600
  },
  {
    "username": "Wigdogger",
    "rating": 7.0,
    "comment": "A classic game that I hadn't played until 2025. Shocking, I know.\n\nAnd I can see why it's well-liked and formative for many modern Euro gamers. The tight worker placement and economic considerations make you really squeeze out every single victory point. And starting out in essentially a negative position seems to be something that Rosenberg does quite often. I've actually played A Feast for Odin before, as well as a couple of his other games, so I did have something of an insight into what would be in this game.\n\nI do appreciate having a lot of runway over the course of the game to actually make some progress. That does help you have something of a feeling of breaking through late in the game when you FINALLY accomplish something of value. But the scores are fairly low. Some good choices over which worker spots to take, especially as they get better with more resources dumping on them each round.\n\nWe also played with the Farmers of the Moor expansion, and that did add extra considerations with horses, heating and some extra cards. It seemed to add a reasonable extra cognitive layer to an already heavy-ish game.\n\nDo I like this game better than Feast? Probably not. I think that game sings in many ways that shows the evolution of Rosenberg as a designer, whereas this was his original strong entry. And I think I expected that A Feast for Odin would be a long game; I didn't expect that to be the case for Agricola. It might just be a one-off, but it was pretty long. Still, besides the length of game and me not really giving a crap about the theme, art or presentation, I do respect the mechanics.\n\nEverything is a struggle, and that does at least mechanically evoke something of the struggle of putting together this functioning farm.",
    "timestamp": 1751320800
  },
  {
    "username": "gmcnish",
    "rating": 7.0,
    "comment": "Good match to theme; I like how you need family to do things, but then end up feeding them the wild boar you were hoping to breed, cause you miscalculated.\n\nPlayed family game twice, and normal game with the E deck once. Really like the occupations/improvements.\n\nIt's growing on me.\n\n:Looking forward to another play.\n\n2025 — havent played in years, and i find variability from stacks of stuff rather than strategic options tiresome. But i should give it a go again.",
    "timestamp": 1750975200
  },
  {
    "username": "PwnPlow",
    "rating": 7.0,
    "comment": "Agricola est un grand classique de la gestion, exigeant et ultra stratégique. On y ressent une vraie pression tour après tour, entre nourrir sa famille, optimiser sa ferme et ne rien laisser au hasard. Mais cette tension constante peut aussi fatiguer : le jeu punitif et le manque de flexibilité le rendent parfois frustrant, surtout pour les joueurs occasionnels. Une référence… mais pas pour tout le monde.",
    "timestamp": 1750975200
  },
  {
    "username": "rkaski",
    "rating": 7.0,
    "comment": "I wanted to love it, but I hate it. It's a beautiful game. It should be right up my alley. I don't like it, and that's that. I wish I did. Maybe I'll try the family edition at some point. I simply feel the game is far too punishing to enjoy.",
    "timestamp": 1750802400
  },
  {
    "username": "finallyiamnoone",
    "rating": 7.0,
    "comment": "I remember enjoying it, but got frustrated playing it some time ago because of a lot of upkeep. Sold.",
    "timestamp": 1750111200
  },
  {
    "username": "SquirrelFrog",
    "rating": 7.0,
    "comment": "A little too complicated for me to enjoy, and I feel like I take the same strategic route each time.",
    "timestamp": 1749679200
  },
  {
    "username": "spieleben",
    "rating": 7.0,
    "comment": "Classic worker placement. Okish as all wp. Nothing outstanding. Making new workers seems very strong.",
    "timestamp": 1749679200
  },
  {
    "username": "lawmen",
    "rating": 7.0,
    "comment": "工人擺放+各種卡牌驅動，變化在於職業卡與次發的多樣性，但是太貪的話容易餓死",
    "timestamp": 1749679200
  },
  {
    "username": "Doomfarer",
    "rating": 7.0,
    "comment": "Tentative rating after one play. Not totally impressed so far. It's a good game and it will never play out the same way twice which is great for replayability, but I still didn't get totally excited about it. I do think it will grow on you, so rating might well increase in the future when I get to play it more.\n\nBest (and only score) so far: 48p in a four player game.\n\nUpdate: Played a 5-player game today, and while still fun the game became a bit too long to be really enjoyable. I'm usually not too fond of optimization games as it is. I'll still gladly play it but preferably with four or fewer players. Interesting to note that the cards change according to number of players. Nice!",
    "timestamp": 1749506400
  },
  {
    "username": "Esskeau",
    "rating": 7.0,
    "comment": "Bought second hand, unpacked but clearly never played 2008 ed.\n\nHad a few plays now, and the ramp up in fiddly bits to keep track of still causes a bit of difficulty. Being dealt a less than ideal hand initially does make it that much harder, as well.\n\nOr, I'm just not very good at it. I'm slightly bothered that it feels a bit more like a job and a problem needing solved, rather than \"fun\".\n\nIt's also a bit saddening that I believe it might be a bit too punishing for the group I currently play with, and I'm probably stuck playing it solo, with all the upkeep blunders that inevitably happen when there's too many fiddly bits. That's fine and all, but there's cards I'll never see like this, which is unfortunate.\n\nWill have to do a few more plays, and probably something to help me keep track of my rounds better.",
    "timestamp": 1749333600
  },
  {
    "username": "jcheller",
    "rating": 7.0,
    "comment": "Absolutely love the theme the art the cards. But this game seems too brutal and confining for me to love. It offen feels like an exercise in frustration rather than being fun. I really wish I could see why so many people love this game.",
    "timestamp": 1749074400
  },
  {
    "username": "TForever",
    "rating": 7.0,
    "comment": "This is my preferred version. Random, tight, disks and cubes. Excellent game.",
    "timestamp": 1749074400
  },
  {
    "username": "Zephyr_Falcon",
    "rating": 7.0,
    "comment": "7",
    "timestamp": 1748901600
  },
  {
    "username": "dsumw01",
    "rating": 7.0,
    "comment": "2007 2P-11% 1-32% (Solo roll 20 sided die for opponent blocking) expansion",
    "timestamp": 1748901600
  },
  {
    "username": "trench",
    "rating": 7.0,
    "comment": "Was too heavy to hit the table regularly and I traded away after a few years of sitting on the shelf.",
    "timestamp": 1748556000
  },
  {
    "username": "tar heel",
    "rating": 7.0,
    "comment": "sold it, bought it back. now I don't have the nice wooden resources, but I do have the non-revised edition I started with.",
    "timestamp": 1748556000
  },
  {
    "username": "Illotus",
    "rating": 7.0,
    "comment": "Ultimately I dislike having to do everything and the game being so tight. Funnily enough the tightness was something I've enjoyed in earlier years.\n----\nExcellent with two, though requires about as good players to be enjoyable.",
    "timestamp": 1748469600
  },
  {
    "username": "stenole",
    "rating": 7.0,
    "comment": "(3-5P) Build a farm, try to survive while at the same time expanding and branching out. Then score all the elements you failed to complete.",
    "timestamp": 1748383200
  },
  {
    "username": "RVW0711",
    "rating": 8.3,
    "comment": "A masterful worker placement game. I cannot play this game enough. The card play, with the occupations and improvements, provides endless depth and replayability and really is the heart of the game. I have yet to master the balance required in Agricola, but despite not winning a large percentage of the time, the game still finds its place among some of my absolute favorites. My favorite Euro, no doubt.",
    "timestamp": 1762383600
  },
  {
    "username": "don3000",
    "rating": 8.0,
    "comment": "Solo: A great challenge as a solitaire. The cards handed are a big factor between success and failure.",
    "timestamp": 1762297200
  },
  {
    "username": "Hgogro",
    "rating": 8.0,
    "comment": "8",
    "timestamp": 1762038000
  },
  {
    "username": "grzechoo104",
    "rating": 7.5,
    "comment": "I've been playing modern board games since at least 2004 and never played Agricola until 2025 - I've had only experience with 2-player version (All Creatures Big and Small) and was pretty sure that currently it's just a regular worker placement that doesn't have much to offer. I changed my opinion, though - even nowadays it's a great game, with a lot of tension and not much space for mistakes and while the core gameplay seems repeatable and similar each game, cards bring enough freshness and replayability. Now I understand, while it's considered a classic - I'd prefer to play it over a lot of modern eurogames.",
    "timestamp": 1761692400
  },
  {
    "username": "Valcurdra",
    "rating": 8.0,
    "comment": "Fantastic game! An all time favorite, introduced me to worker placement and still my favorite in that genre.\n\nLove how tight the board is and how every action counts, both your own and your opponents. Variable setup and cards add a lot of variety to each play.\n\nHave played Uwe's other games but this is the best for me.",
    "timestamp": 1761429600
  },
  {
    "username": "Hori16",
    "rating": 8.0,
    "comment": "Joguei somente 1 vez",
    "timestamp": 1761170400
  },
  {
    "username": "chibisushi",
    "rating": 8.2,
    "comment": "Sleeved",
    "timestamp": 1761084000
  },
  {
    "username": "BlackoutGunshot",
    "rating": 8.0,
    "comment": "Even playing it for the first time in 2025, it's clear why this is such a monument in game design. There's something so satisfying about upgrading your small farm and making clear progress. The first time I upgraded my clay house to a stone house, I knew there was something really special here. I have a long way to go to fully see all that Agricola has to offer, but I'm very enchanted.",
    "timestamp": 1760997600
  },
  {
    "username": "TheoGB",
    "rating": 8.0,
    "comment": "Only downside is the complexity at the start. Worth a solo play to establish the general tactics before explaining to new players.",
    "timestamp": 1760738400
  },
  {
    "username": "PvtBeckMorale1",
    "rating": 8.0,
    "comment": "Have enjoyed playing with others even though I usually finish last. As a solitaire experience, I really enjoy it even though it can be largely thought of as a giant puzzle in that mode, one that induces extreme Analysis Paralysis to maximise my score.\n\nAlso tried the Farmers of the Moor expansion solitaire but didn't enjoy it. That was one of those instances I have experienced where an expansion takes a game in a direction I don’t like, changing the essence of the original game that first appealed to me. I sold Farmers of the Moor at a UKGE.\n\nAugust 2023 - Played (solo) for the first time since August 2012, using the standard solo rules, although I forgot about the solo adjustments for food requirements and wood supplies. Not as much AP as I’d expected and I enjoyed the optimisation puzzle.",
    "timestamp": 1760738400
  },
  {
    "username": "rkleopold",
    "rating": 8.0,
    "comment": "!!!!! Goes",
    "timestamp": 1760738400
  },
  {
    "username": "peggy08120821",
    "rating": 8.0,
    "comment": "是款能夠培養邏輯思維的遊戲，需花時間且專注遊玩，並且理解卡片意義。",
    "timestamp": 1760652000
  },
  {
    "username": "kajabbar",
    "rating": 8.0,
    "comment": "- 30e",
    "timestamp": 1760652000
  },
  {
    "username": "SuDGameGeek",
    "rating": 8.0,
    "comment": "First game that introduced me into the hobby. Satisfying game play everytime.",
    "timestamp": 1760652000
  },
  {
    "username": "kldonnelly",
    "rating": 8.0,
    "comment": "Also own:\nFarmers of the Moor\nThe Goodies Expansion - includes Czech (CZ) and Ö-Deck\n\nL-Deck Cards (a selection of them)\nLegen*dairy Forest Deck - up for sale\nNetherlands Deck (NL) - up for sale\nWorld Championship Deck - 2011\nX-Deck\nChangeling cards\n\nThe Revised Edition\nExpansions: Blue, Green, Purple, Red, White, Yellow\nArtifex Deck\nBubulcus Deck\nCorbarius Deck\nDulcinaria Deck\nEphipparius Deck",
    "timestamp": 1760047200
  },
  {
    "username": "Szaqis",
    "rating": 8.0,
    "comment": "Very big \"I want to play another game, I have some idea how to make a better score\" sindrome.",
    "timestamp": 1759269600
  },
  {
    "username": "Bkoons",
    "rating": 8.0,
    "comment": "iOS app",
    "timestamp": 1759269600
  },
  {
    "username": "beaglestorm",
    "rating": 7.8,
    "comment": "Like new, opened but unplayed. All cards premium sleeved - 360 - Standard European - Purple (FFS04):",
    "timestamp": 1759183200
  },
  {
    "username": "Adri_corr",
    "rating": 7.5,
    "comment": "(1, 5) #players",
    "timestamp": 1759010400
  },
  {
    "username": "Gimpzilla",
    "rating": 8.0,
    "comment": "Very euro. Very cut-throat. Action economy and prioritizing colony growth while adapting in a worker placement system where everyone is stepping on each other toes.",
    "timestamp": 1759010400
  },
  {
    "username": "pallazzo47",
    "rating": 7.5,
    "comment": "- I begrudgingly enjoyed my play of this game. I don't like farming as a setting and I also don't enjoy Klemens Franz's art style. But, with that being said I can see why it's lasted so long in the top 50. The emerging worker placement spots that come out each \"phase\", but you don't know what order, is great.",
    "timestamp": 1758924000
  },
  {
    "username": "SDGooner",
    "rating": 7.5,
    "comment": "Need to play this more. It's punishing if you can't get a synergy going with the cards you get and play.",
    "timestamp": 1758924000
  },
  {
    "username": "JoshuaStarr",
    "rating": 8.0,
    "comment": "Agricola gets right what most other worker placement games get wrong. Rather than attempting to make the worker placement mechanic itself interesting, Agricola uses vanilla worker placement on top of a ruthlessly tight game engine. Each harvest serves as a reminder of how much you wish you could do and how far behind that you actually are. The only things that relax the game engine are the Occupation and Minor Improvement cards, whose synergies/efficiencies serve as the primary exploration space for the game.\n\nWhile Agricola is primarily a tight rope walk of efficiency (which I find less interesting than shared incentives), there is an undeniable variety each game when drafting your hand of 14 cards. And given how quickly it plays, you can reasonably get enough reps in to explore that variety.",
    "timestamp": 1758924000
  },
  {
    "username": "dmwainw",
    "rating": 7.9,
    "comment": "BGA",
    "timestamp": 1758578400
  },
  {
    "username": "DarthHenryAllen",
    "rating": 7.5,
    "comment": "Great game, but the Second Edition improves on it to the point that I consider it the definitive edition now and I've transferred my play logs to that entry (since it's really an iteration/version of the same game).",
    "timestamp": 1758578400
  },
  {
    "username": "swornabsent",
    "rating": 7.5,
    "comment": "DSP 2008\n\nA revered classic, and the standard by which so much is measured.\n\nCaverna was a pleasant maturation.",
    "timestamp": 1758578400
  },
  {
    "username": "mayoevelyn",
    "rating": 8.0,
    "comment": "I can see why it's a classic, fun turn based game with minimum race elements",
    "timestamp": 1757973600
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 8.0,
    "comment": "BGG:HoF\n\nWhen Agricola was a new game we had a lot of fun, racking up several plays. I got it as a 1st-edition German import. After a while, Lookout Games was kind enough to send me English cards. My battered edition still sees play every once in a while.\n\nKeep",
    "timestamp": 1757541600
  },
  {
    "username": "jerevinan",
    "rating": 8.2,
    "comment": "파밍게임의 명작\n빡빡한 게임이다.\n일꾼 밥먹이다가 쫄딱 망하겠네..",
    "timestamp": 1757455200
  },
  {
    "username": "Drrabbits",
    "rating": 7.5,
    "comment": "Sold the copy after finding it too stressful. The art is also hideous. Solid design, i prefer caverna. *update: will be backing special edition, to have a deluxe 'classic'\n\nSOLD",
    "timestamp": 1756677600
  },
  {
    "username": "robinplaysgames",
    "rating": 7.5,
    "comment": "Its a classic for a reason. A starter worker placement game that can be ratcheted up in complexity by playing with the cards and then again by adding drafting.\nFeels a bit out of date but its a game I will still be coming back to in 10 years.\n7.5/10",
    "timestamp": 1756072800
  },
  {
    "username": "JY_Liu",
    "rating": 8.0,
    "comment": "If I rated this game 15 years ago, it must be 10.",
    "timestamp": 1755727200
  },
  {
    "username": "Hembba",
    "rating": 7.5,
    "comment": "I haven't played the game yet. It's from Uwe though so it's probably a game with tons of components, tough gameplay and a steep learning curve. I enjoy challenges.",
    "timestamp": 1755295200
  },
  {
    "username": "Oloovi",
    "rating": 8.0,
    "comment": "Classic for a reason. Very enjoyable to build your farm and strategy based on the cards you get.",
    "timestamp": 1755208800
  },
  {
    "username": "Grzesko27",
    "rating": 8.0,
    "comment": "iOS",
    "timestamp": 1755208800
  },
  {
    "username": "Steezish",
    "rating": 7.5,
    "comment": "3/16/25: Have only played once on BGA so far. I would like to play it real-time or in person to see if that changes my rating.\n\n8/12/25: Enjoyed my second playthrough much more. This game used the beginning of game drafting method which helped me create a strategy. Im curious how this game would play in person. Bumped score from 7.25 to 7.50.",
    "timestamp": 1755036000
  },
  {
    "username": "Stirlingmoomoo",
    "rating": 8.0,
    "comment": "Solid game with a huge amount of replayability",
    "timestamp": 1754517600
  },
  {
    "username": "mr_lunch",
    "rating": 8.0,
    "comment": "Each time I play this, I just want to play it again. Damn you, Agricola! I'm looking at unpunched games on my shelf here!",
    "timestamp": 1754517600
  },
  {
    "username": "smartacus",
    "rating": 8.0,
    "comment": "Played App",
    "timestamp": 1754517600
  },
  {
    "username": "onceplayed",
    "rating": 7.5,
    "comment": "The worker placement is extremely tight. The adjust works for every player count. Even at 5 it plays fairly fast. Hand cards feel a bit old by now but having 14 hand cards per game from a big set is really fun. Overall very enjoyable and chill experience.\n\nranking down to 7 for now. played 5 players twice. its fun but also a lot of waiting. you cant really plan too long, so youre not thoroughly engaged as in games more agency. i want try different decks and different players too. also tried it solo but i think it sucks solo.",
    "timestamp": 1754344800
  },
  {
    "username": "superspacedinvader",
    "rating": 8.0,
    "comment": "Need to play it more!",
    "timestamp": 1754172000
  },
  {
    "username": "RaveAir",
    "rating": 8.0,
    "comment": "Az igazi \"Gazdálkodj okosan\" társasjáték. Úgy kell igazgatnod a munkásaid lehelyezését a különböző akcióhelyekre, hogy minél működőképes birtokod legyen és közben éhen se halj. Egyszerűen nagyon nehéz minden területen jól teljesíteni, de pont ez az egyik olyan tényező, ami sokszor újrajátszhatóvá teszi a játékot.\n\nEgyszemélyes módban is kivállóan működik, de ez ugyanakkor jelzi is, hogy akcióhelyek elrablásán túl nincsen túl sok interakció a játékosok között.",
    "timestamp": 1754172000
  },
  {
    "username": "Azacan1977",
    "rating": 8.0,
    "comment": "N.º Jugadores: Mejor 3-4 / OK 2",
    "timestamp": 1753999200
  },
  {
    "username": "Nekromisantrop",
    "rating": 8.0,
    "comment": "A\nwooden inlay\n2 x professional overlays\n3 sets farmer-miniatures\n+ A,B,C,X-Decks\n+ Die Moorbauern",
    "timestamp": 1753740000
  },
  {
    "username": "norbideejay",
    "rating": 8.0,
    "comment": "[solo]",
    "timestamp": 1753653600
  },
  {
    "username": "Zozobaltazar",
    "rating": 8.0,
    "comment": "Sukhy 8\n\nKeep",
    "timestamp": 1753308000
  },
  {
    "username": "davisote",
    "rating": 8.0,
    "comment": "beautiful game!",
    "timestamp": 1753221600
  },
  {
    "username": "Flatirons",
    "rating": 8.0,
    "comment": "Martin owns it.\nOn BGA premium.\n\nSetup (0-Slow | 4-Quick): 2/4\nEasy to teach (0-Hard | 4-Easy): 2/4\nPlayer Interaction (0-Solitaire | 4-Plenty): 1/4\nDowntime (0-Long | 4-Short): 2/4\nLuck Influence (0-Swingy | 4-None/Counterable): 3/4\nReplayability (0-Barely any | 4-Almost infinite): 4/4\nFun (0-Boring | 4-Heck Yeah): 3/4",
    "timestamp": 1753135200
  },
  {
    "username": "DynaBG",
    "rating": 8.0,
    "comment": "4 Players game is really fun, a lot of versatile ways to build up your farm.",
    "timestamp": 1752962400
  },
  {
    "username": "Joka61",
    "rating": 8.0,
    "comment": "BR 2007",
    "timestamp": 1752876000
  },
  {
    "username": "AutoGrifo",
    "rating": 8.1,
    "comment": "Upgraded my copy with miniatures from model train hobby shops. Not something I would enjoy playing all of the time, but when in the mood, I like how critical all of the decisions are in the game. The stress is what makes it enjoyable and feel like an accomplishment in the end.\n\nAlso bought extra player pieces to allow for 1 more player! Everyone who insists on playing games like this with no more than 3 players, I bite my thumb at ye! I often need games to be at least 5 players or they don't get played enough.\n\nAlso added the Agricola Big Box 15th Anniversary, although now that Awaken Realms is coming out with their Special Edition of Agricola, I regret buying this Big Box (even if it was on sale).",
    "timestamp": 1752876000
  },
  {
    "username": "DrCrow",
    "rating": 8.0,
    "comment": "Classic Uwe.\n\nBase game Agricola is not quite as good as base game Caverna, but Agricola's multitude of expansions give it more staying power.",
    "timestamp": 1752703200
  },
  {
    "username": "teiji",
    "rating": 8.0,
    "comment": "this game has suffering which is not in other games.",
    "timestamp": 1752616800
  },
  {
    "username": "Northnilly",
    "rating": 7.5,
    "comment": "3",
    "timestamp": 1752357600
  },
  {
    "username": "CharlieNZ",
    "rating": 8.0,
    "comment": "Played",
    "timestamp": 1752357600
  },
  {
    "username": "cicerunner",
    "rating": 8.0,
    "comment": "Experiencing this - an original edition with only cubes and discs - having become used to my Revised edition really highlights the effect of the visual and organisational improvements in the newer edition.\nIn particular, as a colourblind player, I realise that the shaped resources allow me to assess the board state as straightforwardly as those with good colour vision can with any edition.\nThis plus the improved ergonomics of setup and card revisions make a full 1.0 difference in rating between this and the Revised version for me.\n\n(No plays logged independently of the Revised base game.)",
    "timestamp": 1752184800
  },
  {
    "username": "Bhelf",
    "rating": 8.0,
    "comment": "Start the game feeling like a starving dirt farmer. End the game feeling mildly successful.\n\n+ Occupations & Improvements make games different\n+ Nice turn flow\n+ Challenging\n+ I really feel on the brink of ruin at the start\n\n- Needs a storage solution to speed up setup. I use a plano box",
    "timestamp": 1751925600
  },
  {
    "username": "JTerrington22",
    "rating": 8.0,
    "comment": "Only played the digital implementations but they show how good this game is very well. If Agricola was the only game you owned you could play this for hours without it growing stale. The theme doesn't do a lot for me but I do think it is a brilliant game.",
    "timestamp": 1751752800
  },
  {
    "username": "Creativenothing",
    "rating": 9.0,
    "comment": "Agricola is in the masterpiece collection. Infinitely replayable, and very addictive.",
    "timestamp": 1762604820
  },
  {
    "username": "funandfunky",
    "rating": 8.5,
    "comment": "A fine game, with an such an incredible amount of tension!",
    "timestamp": 1761951600
  },
  {
    "username": "Dodosaur",
    "rating": 8.5,
    "comment": "Fun game. A bit too thinky for what I expected. This might improve with more plays and then the score might go up. I love how tense this game is. I like the theme more than I expected. (In friend's collection)",
    "timestamp": 1761692400
  },
  {
    "username": "norkbes",
    "rating": 9.0,
    "comment": "The King (General?) of Replayability. I immensely enjoy playing it. My number one among the heavier games.",
    "timestamp": 1761692400
  },
  {
    "username": "kesulin",
    "rating": 8.5,
    "comment": "8.5 con 2, 3 o 4 jugadores\ncon 5 jugadores es un juego con mucho downtime y la nota bajaria considerablemente, quizas un 6.5.",
    "timestamp": 1761692400
  },
  {
    "username": "canucklehead",
    "rating": 9.0,
    "comment": "What a great game! Truly worthy of its place. Family game is excellent as well when playing with children (10+ though!)",
    "timestamp": 1761343200
  },
  {
    "username": "yabluz",
    "rating": 9.0,
    "comment": "Ce l'ho da poco, provato in solitario",
    "timestamp": 1761084000
  },
  {
    "username": "Ajohnny101",
    "rating": 9.0,
    "comment": "I'm assuming this is basically the same as the revised edition, so i'm giving it the same score.",
    "timestamp": 1760911200
  },
  {
    "username": "globetrotter",
    "rating": 9.0,
    "comment": "Initially this felt as a really engaging game with a big potential. It was more interesting to build the farm than optimize the points you got!\nCaverna is a much better spin-off.",
    "timestamp": 1760911200
  },
  {
    "username": "ExcellentRaven",
    "rating": 9.0,
    "comment": "cant resist it. dont even like it, but cant resist it. like a brain hack, i just want to solve the puzzle. Best of all, you can mess with other player's goals through blocking, which makes it delicious.\n\nwe play with a set of 7 occupations face up, and 7 minor improvements face up, and anyone can take from either row when selecting the appropriate action. When one is played from display to player space, it is replaced from face down deck, so it's always 14 up. This means you can't have none of that womp-womp! I gain 12 bonus points off of this card that you couldn't have known I had. haha nice game, bullshit. also you don't have to manage a 14 hidden card hand. also, more control over all options. win-win-win-win.\n\nNow everything can be blocked. so much better.",
    "timestamp": 1760911200
  },
  {
    "username": "ngidding",
    "rating": 9.0,
    "comment": "XIII",
    "timestamp": 1760306400
  },
  {
    "username": "tphon",
    "rating": 9.0,
    "comment": "3D Printed Insert",
    "timestamp": 1759874400
  },
  {
    "username": "wangwei726",
    "rating": 9.2,
    "comment": "最佳3-4人 想玩",
    "timestamp": 1759788000
  },
  {
    "username": "LookyRo",
    "rating": 9.3,
    "comment": "It was hard to learn the rules of Agricola, but once you get the hang of it, the game is really great.\n\nI always enjoy playing it!",
    "timestamp": 1759528800
  },
  {
    "username": "MorelliBuendia",
    "rating": 8.5,
    "comment": "Revised + Artifex + Bulbucus + Corbarius + Dulcinaria + Consul Dirigens.\nGreat worker placement game. It's tense, it's unforgiving, and it's very clever. The amount of cards it has give it a lot of replayability.\n\nMogul Scale: 3/D. Could be either C or D, but I'm going with D because of the drafting.",
    "timestamp": 1759442400
  },
  {
    "username": "CicutaGames",
    "rating": 9.0,
    "comment": "Disfruto lo catigador que es este juego, \"sufrir\" mientras van pasando los turnos y las rondas, terminar tus primeras partidas con una puntuación miserable y tener que volver a jugar para poder mejorar, para mí es algo que en este juego disfruto.\n\nLa combinación de cartas siempre es interesante, después de varias partidas se comienza a sentir como una partida de ajedrez, tratando de prever las jugadas de los oponentes.\n\nUn clásico merecedor de ese título.",
    "timestamp": 1759269600
  },
  {
    "username": "dotneko",
    "rating": 9.0,
    "comment": "en Málaga",
    "timestamp": 1759183200
  },
  {
    "username": "ejclason",
    "rating": 8.5,
    "comment": "Getting the game setup is even worse than Settlers of Catan.",
    "timestamp": 1759183200
  },
  {
    "username": "thefatcyclist",
    "rating": 8.5,
    "comment": "***II-2",
    "timestamp": 1759010400
  },
  {
    "username": "fourquartets",
    "rating": 9.0,
    "comment": "Expansions:\nFarmers of the Moor\nGamer's Deck\nThe Goodies Expansion\nThrough the Seasons\nWorld Championship Deck\n\nAccessories:\nGaming Trunk Old Farm Organizer for Agricola\n\nNotes:\nThis one isn't leaving but I have two copies. Need to sort them, figure out which has what and is which edition, etc. At some point I'll do all this and move one of them on. A good example of when you actually have too much for one game. Likely will move Farmer's of the Moor on eventually as I can't ever see getting to it. [LA]",
    "timestamp": 1758924000
  },
  {
    "username": "turzin",
    "rating": 9.0,
    "comment": "A masterpiece. My favorite game for nearly ten years. A lot of interesting decisions in the game but it's really mean, so my wife and my friends don't want to play very often.",
    "timestamp": 1758232800
  },
  {
    "username": "dominustrick",
    "rating": 9.0,
    "comment": "Look this is a solid game. I hesitated to pick it up because of the theme. I mean seriously be a farmer, raise some kids and pigs and sheep and corn whoopie. It's stay at the top of BGG for an extended time and the constant battle of Puerto rico and Agricola ultimately pushed me to buy this and I did not regret it. I have owned it for about 3 weeks and played it solo about 10 times and with friends about 7 times. This game is great, lots of stuff to do and the screw your neighbor aspect of making decisions is quite exceptional. If I see this game requested at the game table I will definitely consider picking up an expansion",
    "timestamp": 1758060000
  },
  {
    "username": "Primalwolf",
    "rating": 9.0,
    "comment": "Too much to do. So variable. The Worker placement game.",
    "timestamp": 1757887200
  },
  {
    "username": "casualgod",
    "rating": 9.0,
    "comment": "Best with 3-4\n\nAgricola needs a small change to the turn order mechanic and a card drafting tweak to make it a near perfect worker placement game.\n\n52 hours played.",
    "timestamp": 1757800800
  },
  {
    "username": "rmartinc",
    "rating": 8.5,
    "comment": "Have the extra boards as well",
    "timestamp": 1756850400
  },
  {
    "username": "NairHotel",
    "rating": 9.0,
    "comment": "A genuinely amazing game with so much tension and very enjoyable decisions at every point in the game. I love that everyone is trying to do the same things. I love that you have to roll with what is available, but there is room for the big thinkers to try to create multi-level plans with fail-safes. Somehow getting completely screwed can be kind of funny and depressing at the same time. It's a great game",
    "timestamp": 1756764000
  },
  {
    "username": "Saume",
    "rating": 8.9,
    "comment": "I now understand why this is considered such a classic.\n\nWhile this is similar in some ways to Caverna, Caverna feels more like a sandbox to me, you pretty much also do whatever at any time. Agricola, on the other hand is much more focused. It's worker placement, resource management and a little bit of building your farm. You need to feed your people and do a little bit of everything to avoid losing points.\n\nThe cards you can play are also great. They give players a little bit of variable powers.",
    "timestamp": 1756764000
  },
  {
    "username": "Bozok",
    "rating": 8.5,
    "comment": "Designed by Uwe Rosenberg. One of the original worker placement games! Still really great, though Caverna is a bit better, and it's less punishing.",
    "timestamp": 1756764000
  },
  {
    "username": "timetrip",
    "rating": 9.0,
    "comment": "Really good worker placement game. Interesting farming theme. Takes about 2 hours. Best played with 4/5. Only real issue is that it's a brain burner the ENTIRE time. Playing it is exhausting.",
    "timestamp": 1756764000
  },
  {
    "username": "gregor1863",
    "rating": 9.0,
    "comment": "I like just about everything with this game: lots of cards with great art, simple bits, engaging strategy, and a theme which fits well. I like having tons of choices to make on a turn.\n\nMy 8 year old has no problem with playing the family rules.",
    "timestamp": 1756677600
  },
  {
    "username": "SVan",
    "rating": 9.0,
    "comment": "A great game, with a lot of tension at times. The cards give it a ton of variety. Never seems to run too long, in fact, most games you wish you had a few more turns to finish your farm.\n\nThis is an instant classic, but I wonder if it has staying power. Still probably one of the best Euros I've played.",
    "timestamp": 1756677600
  },
  {
    "username": "dendrig59",
    "rating": 9.0,
    "comment": "A classic.",
    "timestamp": 1756504800
  },
  {
    "username": "OneTrueRowan",
    "rating": 9.0,
    "comment": "My partner and his family are absolutely obsessed... and I have to admit, I am too. We must have played at least 100 times over the last couple of years.\n\nWhy? Because you spend the whole game feeling like there is so much to do and no time to do it, but this just makes you want to keep coming back for more. Next time, of course, you'll manage to get everything done!",
    "timestamp": 1756332000
  },
  {
    "username": "Avid_Equinox",
    "rating": 9.0,
    "comment": "See agricola: revised",
    "timestamp": 1756159200
  },
  {
    "username": "Obidiah",
    "rating": 9.0,
    "comment": "I like both Caverna and Agricola, but in the Agricola vs Caverna debate - I'm on team Agricola.\nEach game you need to tailor your strategy to the minor improvements and occupations you first receive. So its a new puzzle each game - giving Agricola great longevity.\nCompetition for the different worker placement spots is at just the right level.",
    "timestamp": 1755900000
  },
  {
    "username": "Tauzer",
    "rating": 9.0,
    "comment": "This was one of the first modern board games that really drew me back into the hobby after my CCG phase had ended. I first played it in 2009 and was instantly hooked. I love how thematic it feels as you struggle to keep your family fed and to have enough left to bring your farm ahead. It's tight and can be unforgiving, but it's also immensely satisfying. I love how impactful the cards are, though you may only play a few in a game. It feels like it shipped with at least two expansions included given the three different decks with hundreds of different occupations and minor improvements.",
    "timestamp": 1755813600
  },
  {
    "username": "duanewulf",
    "rating": 9.0,
    "comment": "Expansions owned:\nAgricola: Bubulcus Deck",
    "timestamp": 1755554400
  },
  {
    "username": "Song_of_Shield_Lady",
    "rating": 8.5,
    "comment": "好玩，爱玩，爽玩，常玩常新。",
    "timestamp": 1755554400
  },
  {
    "username": "ayii",
    "rating": 9.0,
    "comment": "Currently in the UK",
    "timestamp": 1755554400
  },
  {
    "username": "ErgonomicJonze",
    "rating": 9.0,
    "comment": "Tactical, brutally competitive and unforgiving, peak worker placement gameplay. Incredible staying power with huge variety offered through the expansions. Rosenberg's worker placement games have sadly moved way from this brutally competitive style by offering more options and a bigger decision space to players, leaving Agricola as the zenith of this genre. High recommend playing at least once. Even if you find that it's not for you, its very very fun to explore a few times.",
    "timestamp": 1755381600
  },
  {
    "username": "Sir Melancholie",
    "rating": 9.0,
    "comment": "Replaced with the Revised edition of the game.",
    "timestamp": 1755208800
  },
  {
    "username": "arpogan",
    "rating": 8.5,
    "comment": "An absolute classic – despite initial impressions, the rules are simple and intuitive. Sometimes, the “too short a blanket” syndrome can be a bit frustrating.",
    "timestamp": 1755036000
  },
  {
    "username": "Suleckja",
    "rating": 9.0,
    "comment": "Great game, so many things to do and keep an eye on, you have to approach with a good balance. Can't wait to play it again.",
    "timestamp": 1754690400
  },
  {
    "username": "chadw09",
    "rating": 9.0,
    "comment": "Nice combination of structure and replayability\n[Game Surplus $44.00 Jul 2010]",
    "timestamp": 1754431200
  },
  {
    "username": "h00sha",
    "rating": 9.1,
    "comment": "The Stairway to Heaven of boardgames. There's no overstating how important this game was to the hobby and to me personally for many years. It's only downgraded to an 8 now because I don't want to play it anymore (I still do, though, because the wife likes it).\n\nPlay count doesn't include ios.",
    "timestamp": 1754172000
  },
  {
    "username": "cabbagekingaf",
    "rating": 9.0,
    "comment": "I love the cute meeples, the pastoral setting, the understandable theme that ties in well with the mechanisms, and the constriction of feeding your people each harvest while trying to claim those job spaces before your opponent(s).\n\nWhen playing solo, my favorite way is using the \"Screwed\" solo variant from the BGG forums/files.",
    "timestamp": 1754085600
  },
  {
    "username": "horarp",
    "rating": 8.5,
    "comment": "Nagyon okos és szűk játék, korához képest nagyon jó",
    "timestamp": 1753912800
  },
  {
    "username": "ChrisSmith4773",
    "rating": 9.0,
    "comment": "Sell $20",
    "timestamp": 1753740000
  },
  {
    "username": "JHristomilo",
    "rating": 8.6,
    "comment": "Sesudo y maravilloso juego. Las cartas de oficio y de adquisiciones le otorgan variabilidad y evitan que siempre sea lo mismo, de modo que debes adaptar tu estrategia a la mano de cartas.\nSorprendente y adictivo modo solitario.\nEl único pero que se puede poner al modo solitario es que juegas por batir una puntuación, algo que a mi no me termina de convencer. Sin embargo, la mecánica es tan adictiva que eso pasa a un segundo plano.",
    "timestamp": 1753308000
  },
  {
    "username": "Vic Thiessen",
    "rating": 8.5,
    "comment": "7",
    "timestamp": 1752703200
  },
  {
    "username": "Cercatesori",
    "rating": 8.9,
    "comment": "ENJOYMENT \nGAMEPLAY \nREPLAYABILITY \nDEPTH \nGAME LENGTH \nALEA \nCOMPONENT QUALITY \nPLAYER INTERACTION \nPLAYER COUNT PERFORMANCE \nSCORE: 8,88",
    "timestamp": 1752530400
  },
  {
    "username": "calebpalkki",
    "rating": 9.0,
    "comment": "I have 2 problems with Agricola. One problem is that the ending position is usually very similar between all players, and you can never go all out on just one single component of the game. Also, the game is less good with 2 players. Other than that, the game is perfect",
    "timestamp": 1752444000
  },
  {
    "username": "pkcanno",
    "rating": 9.0,
    "comment": "From Bohnanza (1997) to Agricola (2007): The Rosenberg Transformation",
    "timestamp": 1752098400
  },
  {
    "username": "Jestertrek",
    "rating": 9.0,
    "comment": "As I get older, I appreciate Agricola more and more. I think it's just a clean, elegant design that works on so many levels and for so many levels of player skill.",
    "timestamp": 1751234400
  },
  {
    "username": "Minerv55057",
    "rating": 9.0,
    "comment": "Z-man version",
    "timestamp": 1751148000
  },
  {
    "username": "Schwartzkopf",
    "rating": 8.8,
    "comment": "This was the second hobby game I ever bought. Once I realized there were more games like Catan out there, I found Boardgamegeek and went out and bought the number one ranked game. At the time that was Agricola. Wow - my family was NOT prepared from the step up from Catan to Agricola! But I stuck with it, played some solo games, and eventually wore everyone down to play the full game. It instantly became my favorite game of all time (out of the 4 or so that I had played...). It stayed that way for a few years until overtaken by my current #1 in 2013.\n\nHonestly, what's not to like about this game? The fact that it is difficult to feed your family? Stressful when someone takes that action that thwarts your plans? OR maybe because it is really really hard to do at least a little bit of everything to avoid losing too many points? Yes these are the knocks against this game. But for me, these are the reasons i LOVE the game!\n\nYes, Caverna came out. It is a looser game with many more options in many ways, and it's easier to feed people. But the tightness of Agricola is what I appreciate most - I feed off of the urgency to feed my family. Caverna has a bunch of rooms, but they are static. Agricola has a crap-ton of cards that change every single game. Note: ALWAYS play with a starting draft of cards, as this lessens the possibility that you'll get dealt a dud hand.\n\nCaverna is a really good game. Agricola is better. So much so that I don't even consider Caverna anymore, and it has left my top 100 and collection.",
    "timestamp": 1750975200
  },
  {
    "username": "icedrakin",
    "rating": 9.0,
    "comment": "What I love most about this game is the competitiveness. Actions are simple but you have to think twice about what you want to do, what others want to do and how to block them",
    "timestamp": 1750975200
  },
  {
    "username": "sorcretic",
    "rating": 8.5,
    "comment": "Feb. 2025 #73: I'm surprised Agricola fell this far in my list--it's still one of the best modern Euro games out there. I first played it 12 years ago, in total confusion, before I was in the hobby proper. Now this kind of game seems old hat. But it's still got deliciously tight worker placement and near infinite variability with the number of card decks available. Playing it feels like meeting up with an old friend. I don't think I'll ever get rid of it.\n\nJul. 2024 #44\n\nJan. 2024 #34: Uwe Rosenberg's games always evoke something in me. There's a sense of place that you don't see with more abstract Euro designers. Agricola wasn't always my favorite Uwe game, but the variety of cards, the tightness of the worker placement, and that \"how can I even do anything?\" feeling put it above the others for now.",
    "timestamp": 1750802400
  },
  {
    "username": "Darigaaz",
    "rating": 10.0,
    "comment": "I should buy it one day because a game collection should include this all-time classic.",
    "timestamp": 1762630920
  },
  {
    "username": "HairyPotter",
    "rating": 10.0,
    "comment": "Very appealing game, with an excellent integrated theme, and easy to learn for such an in-depth, complex game. Agricola is impressively scalable from 2-5 players(4 seems to be the sweet spot, with 3 close behind). The randomly drawn and vast amount of Improvement and Occupation cards keep the games and strategy fresh every time! The out-of-this-world replayability factor of this game is what makes it truly special.\n\nWe normally draft, mixing in an assortment of decks.\n\nUwe games:\n1. Agricola\n2. A Feast for Odin\n3. Caverna: The Cave Farmers\n4. Le Havre\n5. Ora et Labora\n6. At the Gates of Loyang",
    "timestamp": 1762615980
  },
  {
    "username": "bluestraggler",
    "rating": 10.0,
    "comment": "Wow, is this good. A classic for a reason. Such a tight design: every choice is critical and brutal. You're worried about everything you need to do in a very limited time frame, but also everyone else is snatching the same resources, and how am I gonna feed all these people?!\n\nIt's maybe a touch long and always makes me feel like I'm screwing up. But in a good way?\n\nRating based on multiplayer. For solo play more like 8 - Still great! Although I didn't find that I wanted to play it more than a few times at a stretch. Some more recent games have improved on adding things like factions (or spirits, companies, etc.) to provide more replayability by creating a slightly different experience every time. Here you have project cards to give you some direction, but they don't feel like they drive your play as much. I should try out an AI opponent variant.\n\nIt's quite a different game with other players than solo. Solo is just an efficiency game, it's so much more complex with other players. Suddenly you have competition and resource scarcity, and who goes first matters (but brilliantly, you can spend a precious action in this round to claim a critical first choice in the next). A point in its favor is that beefing up your solo experience doesn't make it so you can't play with others. With some games, playing too much on your own means you've developed skill and experience and won't be a good match with new players anymore. Not here.",
    "timestamp": 1762124400
  },
  {
    "username": "lehalls999",
    "rating": 10.0,
    "comment": "35€ Tienda",
    "timestamp": 1761519600
  },
  {
    "username": "apax",
    "rating": 10.0,
    "comment": "H",
    "timestamp": 1761519600
  },
  {
    "username": "kurtrussell",
    "rating": 10.0,
    "comment": "Simplicity makes this worker placement a classic. It's not tripping over itself to do something and miss, it does what it does, take it or leave it.",
    "timestamp": 1760997600
  },
  {
    "username": "Gunkus",
    "rating": 10.0,
    "comment": "A classic for a reason. Agricola is the most worker placement worker placement game condensing the genre while also giving so much room for experimentation and creativity in how you build your farm. Every time I play I feel like I’ve found out new ways to ruin everything, and while it should feel too punishing it just makes me want to play more. It feels knizia like in how it will make you feel stupid for your previous mistakes and I could see how this would drive someone away, but for me this game is a very satisfying experience even though I’ve yet to win, which is the mark of a great game in my opinion.",
    "timestamp": 1760997600
  },
  {
    "username": "ccchla",
    "rating": 10.0,
    "comment": "很像開心農場,比較難的地方是需要每個東西都蒐集一點才不會被扣分",
    "timestamp": 1759960800
  },
  {
    "username": "DoctorPhil",
    "rating": 9.7,
    "comment": "Best game for me. The cards offer me endless variability and a competitiveness found in TCGs, and the worker placement is tight and interactive. It can be a tournament style competitive game, but it’s also fun just to see what happens. The theme comes through nicely, and every move in this game makes sense with resource conversion and farm building. The tableau building is the best; you farm visually looks amazing but there are so many ways to build it up with cards and components, it’s fantastic. It scales well for multiple players, and the solo campaign adds something different to just beating your high score. This game has everything and it’s what got me hooked in hobby gaming.",
    "timestamp": 1759356000
  },
  {
    "username": "blake33",
    "rating": 9.9,
    "comment": "Fabulous game - one of the best ever",
    "timestamp": 1759269600
  },
  {
    "username": "spixel",
    "rating": 10.0,
    "comment": "best with 3-4\nKEEP",
    "timestamp": 1759183200
  },
  {
    "username": "LittleDuke",
    "rating": 10.0,
    "comment": "THE worker placement game. Improvements and Occupations also grant a wonderful amount of variance and replay-ability. I've been playing this game since I was a kid, and it still hits the table consistently.",
    "timestamp": 1758492000
  },
  {
    "username": "stofke",
    "rating": 10.0,
    "comment": "R010",
    "timestamp": 1758492000
  },
  {
    "username": "cyberbob666",
    "rating": 10.0,
    "comment": "French version\n+ Ext Les fermiers de la lande\n+ Animeeples\n+ Farmer Meeples\n+ Vegeemeeples\n\n100$",
    "timestamp": 1758492000
  },
  {
    "username": "Koert",
    "rating": 10.0,
    "comment": "Intriguing complex strategy game in which you develop your near empty farmyard into a booming farm with pastures full of cattle and lots of crops on your fields. The farming theme fits remarkably well with the game mechanics. *** Recommended to start with the family game during a learning session. The full game adds sets of occupation and minor improvement cards which increases the complexity of the game, but also ensures a rich variability in possible game scenarios. *** Closest victory: 3 players tied with 30 points and me with 31 points (K-deck on 25/12/2013) *** Played: Family Game: 2-player (p2/w2), 3-player (p2/w2), 4-player (p5/w3) & 5-player (p3/w1) / Full game with E-deck: 3-player (p5/w3), 4-player (p6/w3) & 5-player (p8/w6) / Full game with I-deck: 3 player (p1/w0) & 4-player (p3/w3) / Full game with K-deck: 3-player (p6/w5) & 4-player (p6/w6) / Full game with AB-decks: 3-player (p3/w2).",
    "timestamp": 1758232800
  },
  {
    "username": "oscaresgil",
    "rating": 10.0,
    "comment": "After playing hundreds of other games, this one still gets the title of being the best in terms of strategy, theme, expressiveness and enjoyment. Simply a classic.",
    "timestamp": 1758060000
  },
  {
    "username": "Viliik",
    "rating": 10.0,
    "comment": "U mamky",
    "timestamp": 1757628000
  },
  {
    "username": "Nylo",
    "rating": 10.0,
    "comment": "+ Folded Space Organizer",
    "timestamp": 1756764000
  },
  {
    "username": "Wilco_v_W",
    "rating": 10.0,
    "comment": "Me and my friends own several good board games, but Agricola is the one we keep playing over and over again. We have yet to find another game with this combination of fairly simple rules and extreme replayability. It is my favorite game, even though I've won only a few games over the years. That speaks volumes, I guess.",
    "timestamp": 1756591200
  },
  {
    "username": "Killi",
    "rating": 10.0,
    "comment": "Best worker placement out there. Ever since it came out in 2007 no other worker placement has managed to do it as elegantly as Agricola.\n\nEasy to teach, impossible to master. Genre defining game.\n\nFor me Agricola is for Worker Placements what Dominion is for Deck Builders.",
    "timestamp": 1756504800
  },
  {
    "username": "X4_Commander",
    "rating": 10.0,
    "comment": "Good game for kids after 9",
    "timestamp": 1756072800
  },
  {
    "username": "FireManBearPig",
    "rating": 10.0,
    "comment": "Second copy of original base game (for spare cards) is on 5x5 Kallax; all other Agricola content stored in dedicated BoardGameTables bag.",
    "timestamp": 1755813600
  },
  {
    "username": "kikaytete",
    "rating": 10.0,
    "comment": "30-8\n77%\nE 58 - K 61 - A 51\n\n23-5\n82%\n\nInicial 59\nMáximo 85 (7ª)\n\nhttp://loquenomegustadel.blogspot.com/2011/08/agricola.html",
    "timestamp": 1754776800
  },
  {
    "username": "StevenOnBGG",
    "rating": 10.0,
    "comment": "Catan introduced me to 'real' boardgames, but Agricola was the one I fell in love with. I played it countless of times, and it is the ultimate worker placement game IMO. The tense feeling you get when you approach the final turns, checking if you maximized all the possible things on your little farm.. Excellent game and contender for GOAT.",
    "timestamp": 1754517600
  },
  {
    "username": "Lauron The Dark Lady",
    "rating": 9.5,
    "comment": "De Fernando.",
    "timestamp": 1754344800
  },
  {
    "username": "Lemem",
    "rating": 10.0,
    "comment": "Agricola is the magnum opus of Rosenberg's work and perhaps the board gaming hobby. The worker placement mechanic is simple but the depth materializes from the intricate and brutal game engine that Agricola presents. Players must balance obtaining resources to build out their farm while establishing a food engine that can sustain them over the six harsh harvests throughout the game. A myriad of occupations and minor improvements help create more elaborate synergies and scoring opportunities, unlocking an unfathomable amount of replayability which ensures each play to be unique. Some may find Agricola's tight gameplay to be too burdensome but for others it's the reason this masterpiece hits the table time and time again.",
    "timestamp": 1754172000
  },
  {
    "username": "pjims",
    "rating": 10.0,
    "comment": "Fantastic. Maybe my favorite game. Love the theme and the fact it plays well with many player counts. Cards keep it varied. Love it.\n\nUpdate (6/14): After a bit of burnout thanks to the iOS app, I am once again really enjoying Agricola. RftG has overtaken it as my favorite game, but I look forward to 16th century farming for many many plays to come.",
    "timestamp": 1754172000
  },
  {
    "username": "TrevorJr26",
    "rating": 10.0,
    "comment": "See my review for the revised edition",
    "timestamp": 1753826400
  },
  {
    "username": "eldistopico",
    "rating": 9.5,
    "comment": "Clásico entre los clásicos en la colocación de trabajadores. Hay mecánicas difíciles de superar. Las sensaciones al finalizar la partida siempre son satisfactorias ganes o pierdas. Con un poco de interés, puedes sumar a toda la familia.",
    "timestamp": 1752530400
  },
  {
    "username": "glsonn",
    "rating": 10.0,
    "comment": "Gifted from Myrriah and Jared on 9/26/08.\n\nUpgraded to a 10 after 3 plays. It's as much fun as El Grande, which used to be my only other 10.\n\nFor a long time, my family and friends all wanted to play this just as much as I did, so we played nearly every night. It's not quite as much fun with only 2, so we don't play it as often anymore, since we don't often have more than 2 players available.\n\nI think it's a combination of wanting to win, wanting to beat your personal best score, and wanting to find new ways to combine the cards that keeps us coming back for more. Also, you can never have too much wood.\n\nK-Rated: 10\n\n#5 in all time plays on 7/14/25.\n\nH - 2",
    "timestamp": 1752530400
  },
  {
    "username": "LombardiCJ",
    "rating": 9.5,
    "comment": "Agricola is pretty close to being an ideal Euro for me. There are tons of difficult decisions to make, and every move changes the course of your game. Just a super tense, awesome game!",
    "timestamp": 1752444000
  },
  {
    "username": "LouieSTFU",
    "rating": 10.0,
    "comment": "Core Collection\n\nI experienced Agricola early when I first started board gaming, which is why my tastes lean Euro, Rosenberg-centric. The overall gameplay structure remains similar each game (get kids, do a bit of everything, feed your workers), so this is an approachable entry point for heavy Euros. Also, the added Occupation and Minor Improvement cards add some spice, either making individual actions stronger, or opening up entirely new strategies.\n\nExpansions:\nAgricola: Farmers of the Moor",
    "timestamp": 1752444000
  },
  {
    "username": "yickwah_2012",
    "rating": 10.0,
    "comment": "Agricola is my best favourite board game (Puerto Rico ranked 2nd). It needs a careful balance between crops, mammals and population growth. The selection of a career allows players to adopt different strategies. The figures are also cute, and really attractive to kids.\n\nHowever, there are too many cards to read. It is too difficult to attract beginners or novice players.\n\nFound in Manga \"After School Dice Club\" Chapter 60.",
    "timestamp": 1752357600
  },
  {
    "username": "VibroChimp",
    "rating": 10.0,
    "comment": "I’m not normally a fan of these types of games (worker placement with tons of resource conversion and spreadsheet scoring) but this one has such a strong sense of theme that it all works together beautifully. The variability of the card powers keeps the game fresh and endlessly replayable. Surprisingly easy to learn, since all of the rules make thematic sense. Except for the rule about keeping a farm animal in your house…who does that?",
    "timestamp": 1751148000
  },
  {
    "username": "hockeyjones",
    "rating": 9.9,
    "comment": "5\n\nPlayed in 2025\n\nSC: 96",
    "timestamp": 1750802400
  },
  {
    "username": "mano3",
    "rating": 10.0,
    "comment": "1-4 (3-4)\n\n60 - 150 minutes",
    "timestamp": 1750370400
  },
  {
    "username": "kruppman",
    "rating": 10.0,
    "comment": "Addictive....",
    "timestamp": 1750024800
  },
  {
    "username": "Kroomiester",
    "rating": 10.0,
    "comment": "Agricola is a game I can't stay away from. The worker placement game is as satisfying as it is frustrating. Juggling other player's incentives with your own to try to predict the moves you'll reliably be able to string together is a beautiful challenge that only gets better the more you play. The cards in Agricola allow for interesting asymmetry between players, while also adding a feeling of engine and combo building to the game. I suspect I'll be playing Agricola for a long time to come",
    "timestamp": 1749852000
  },
  {
    "username": "khepriq",
    "rating": 10.0,
    "comment": "Better than AIwakened Realms. Buy this instead",
    "timestamp": 1749420000
  },
  {
    "username": "stevepwalker",
    "rating": 10.0,
    "comment": "Keep",
    "timestamp": 1749160800
  },
  {
    "username": "Corwin007",
    "rating": 10.0,
    "comment": "It's an amazing game, learned to love it at all player counts from 2 to 4, and these days I can see the value of 4p plays more than when I started. The drafting of combos at the start is immensely satisfying, especially when you are able to then implement them.",
    "timestamp": 1748988000
  },
  {
    "username": "Dlearn",
    "rating": 10.0,
    "comment": "Outstanding worker placement with excellent balance and mechanics",
    "timestamp": 1748988000
  },
  {
    "username": "Grumpy_Goblin_Herder",
    "rating": 10.0,
    "comment": "One of, if not the most played and favourite game.",
    "timestamp": 1748815200
  },
  {
    "username": "jondodd82",
    "rating": 10.0,
    "comment": "Replaced by Agricola (Revised Ed.)",
    "timestamp": 1748469600
  },
  {
    "username": "happy_teapot",
    "rating": 10.0,
    "comment": "This game still holds up. It's one of the best euro games out there.\nIt's super tight and the choices you make matters. You can block people but it rarely plays out well since you could have gone for something more beneficial for you own part.",
    "timestamp": 1748383200
  },
  {
    "username": "HolyGigi",
    "rating": 10.0,
    "comment": "My first board game (excepting Monopoly and the like) and, while the learning curve was steep for me, totally worth it. After the 2nd game you play you already have a good idea of what to do and what not to do.\nI'd recommend at least 3 players. With two, the one who played more games will always win. But with more people, there's always the chance that someone will want to do the same action as you.\nIts a blast in 5, although it takes about 2-3 hours\n\nChanged the grade to a 9. Still enjoying this, but it is hard to get it to the table when we are 4 or 5. Guess it is because of the additional options we have, and also because it tends to take quite a long time",
    "timestamp": 1748124000
  },
  {
    "username": "ClaudioDiBiase",
    "rating": 9.5,
    "comment": "Capolavoro, dall'estetica al gameplay alla rigiocabilità alla facilità delle regole. Pochi giochi sono a questo livello. Una strategia profonda che ben deve coniugarsi alle carte iniziali e cambiare di volta in volta. Nonché una dote di pianificazione a in largo anticipo maggiore del solito. Queste le doti del giocatore perfetto di Agricola. Non 10 giusto per la poca interazione tra i giocatori.",
    "timestamp": 1747260000
  },
  {
    "username": "Lizziereads54",
    "rating": 10.0,
    "comment": "Maybe I’ve given this a 10 for sentimental reasons. This was the first solo game I was introduced to. Some find the feeding brutal, but I like the challenge, the campaign mode, and the variety of additional decks.",
    "timestamp": 1747087200
  },
  {
    "username": "denismarcio",
    "rating": 10.0,
    "comment": "Foi meu número 1 por um longo tempo",
    "timestamp": 1746655200
  },
  {
    "username": "cook086",
    "rating": 10.0,
    "comment": "Agricola is a brilliantly designed strategy game, with round 14 always coming too soon. I appreciate how individualized occupations and minor improvements shape your strategy without ensuring a dominant or insufficient farm. The supply and demand of resources ensures that every game has a unique feeling, dependent on the cast of players. Having to feed your family is a brilliant and realistic handicap to farming progress. Great job, Mr. Rosenberg!",
    "timestamp": 1746309600
  },
  {
    "username": "capasso2300",
    "rating": 10.0,
    "comment": "How have i never rated this game?\n\nIt's perfection to me. Endless replayability, tight and tough decisions, player interaction, and a quick playtime.\n\nMy most played big box game.",
    "timestamp": 1745964000
  },
  {
    "username": "wombat929",
    "rating": 9.5,
    "comment": "This is my favorite side-by-side solitaire game, with a heavy bit of \"no, that's what I was going to do!\" I like the way your hand of cards changes drastically what you can and might do, and your opponents' choices cause you to completely rethink your plans. No bad games of this yet.",
    "timestamp": 1745272800
  },
  {
    "username": "Optimal_Math",
    "rating": 10.0,
    "comment": "Great game, great re play ability. Excellent mechanics. The theme is something I wouldn't have thought I would enjoy, but this just speaks to how great the actual game play design is. Well done!!!",
    "timestamp": 1744927200
  },
  {
    "username": "larryjrice",
    "rating": 10.0,
    "comment": "Agricola is a fascinating card game with limitless opportunities and variation due to the huge number of cards. The combinations are almost limitless as well.\n\nThe solo game is an interesting puzzle that isn't as easy as one might think which unfortunately gets boring and repetitive very quickly.",
    "timestamp": 1743976800
  },
  {
    "username": "warlock000",
    "rating": 10.0,
    "comment": "My favourite euro game.\n\nPhenomenal game, just brilliant. I still think that Agricola is Uwe Rosenberg's magnum opus. And it just keeps getting better with each subsequent play (especially with the Farmers of the Moor and Gamers' Deck expansions added). I love the tightness of this design and the interrelation between the theme and the mechanics - everything is intuitive and makes perfect sense. The best thing about this game is the challenge of managing scarce resources and figuring out the most effective ways of using the cards in your hand. This puzzle is just a fascinating, brain-burning delight. But keep in mind that this is a \"I wonder if I can do this better, quicker and more efficiently next time\" type of game. Optimization is the heart of Agricola, so if you don't like designs like that, you probably won't enjoy this one.\n\nBy the way, Agricola works exceptionally well as a solo game! It's a really challenging puzzle.\n\nThe only drawback I can think of is the constant need for repleneshing goods - this gets a bit too fiddly, especially late game.\n\n/update: my plays are split between the Revised and the original editions (depending which one I pick for the game night).\n\nAfter expanding the Revised Edition with Artifex + Bubulcus decks and Farmers of the Moor I can finally say that this is the version to get at this moment due to better availability, the card pool became big enough and I trust that the selected cards are balanced and polished. I will never get rid of my old version though, it's still absolutely wonderful and I love many of the cards that are missing in the new one (especially the G-deck). But if you don't own Agricola yet and want to get into it, I guess it's better to get the Revised stuff. Honestly though, you can't go wrong with either edition (I love the old pool of cards). This game is a work of art.\n\nI own the following expansions:\n- Farmers of the Moor\n- Gamers' Deck.",
    "timestamp": 1743804000
  },
  {
    "username": "GomJabbar",
    "rating": 9.7,
    "comment": "My Rank: 11\n\nMy first worker placement-style game. Love it. I have Caverna, but I like Agricola more.",
    "timestamp": 1743631200
  },
  {
    "username": "billratio",
    "rating": 10.0,
    "comment": "Greatest board game of the last 500 years. I have played this more than anything other than chess. The more you play it the more you appreciate it. The game is not really as punishing as people say once you understand it. With all the occupations and minor improvements it has it can be played forever. I personally feel that most complaints made about the game are by people who don't know how to play board games well.",
    "timestamp": 1743544800
  },
  {
    "username": "cubntin",
    "rating": 10.0,
    "comment": "1-5 Players",
    "timestamp": 1743289200
  }
]