[
  {
    "username": "kolvorok",
    "rating": 1.0,
    "comment": "Tragically multiplayer-solitaire euro, redeemed for 15 minutes by its presentation and theme and then regressing for 3 hours into a (basically random) attempt of tactically optimising turns and making points head-down looking at the table… booooring! Ideal for socially challenged types who abhor any interaction, storytelling or creativity in games… and there would be a way to role-play this a tiny bit... but nobody wanted to even try at my table... avoid… especially with 6 players... who would want to inflict that level of downtime on their friends?!?",
    "timestamp": 1762038000
  },
  {
    "username": "Scifi66",
    "rating": 1.0,
    "comment": "Heads down low interaction game that goes way too long. I witnessed a 3+ hour game which is crazy, not enough here for that!\n+ Loved the theme, wish the game lived up to it. Nice art and components\n– Straight forward puzzle, feel I've grasped it after one game\n– Objective random draw and early discards were far too random. I'd probably come up with a variant to fix this so you could work on longer range goals through the entire game\n– Interaction was super low",
    "timestamp": 1748642400
  },
  {
    "username": "lililililil",
    "rating": 1.0,
    "comment": "Automata",
    "timestamp": 1747432800
  },
  {
    "username": "Bisqp",
    "rating": 1.2,
    "comment": "I hate games that are totally luck driven, full of randomness and at the same time force you to constantly develop plans, strategies which are put into trash every single time its time for you to play. I hate even more games who fool you into being something they are not, promising something that they tragically not deliver.\nAmong many many games I have played there are very few games who perfectly fulfill all those criteria. Obsession is one of the top 3 of those on the \"hated list\". This game is frustrating, over-hyped, cluggy (especially with all those additions, promos, cards, additional meeples. Suffers awfully from enormous downtime (3p+ games).\nJust to clarify - among my top games are - Brass: B, Gaia Project, TMars, Underwater Cities, Kanban EV, Anachrony and many 18xx games. So it's not that this game is \"too difficult\". It's just bad game, bad design from A to Z. It should never be played with more than 3p. Has nice art work and flavour text thought. That I can admit.",
    "timestamp": 1743631200
  },
  {
    "username": "ahran",
    "rating": 1.0,
    "comment": "So boring. Feels like it takes forever to play. Unreadable cards and tiles.\n\nThe game is mostly sitting around watching other players take their turn with no interaction and very little actual strategy. The only real strategy is figuring out how to never be asked to play this again.\n\nIf I had unfortunately bought this I would have thrown it in the trash rather than giving it away. I don't think I've ever hated playing a game this much.",
    "timestamp": 1732921200
  },
  {
    "username": "cotomel",
    "rating": 1.0,
    "comment": "Scripted, mps too reliant on market rng.",
    "timestamp": 1732748400
  },
  {
    "username": "honk3d",
    "rating": 1.0,
    "comment": "+1np",
    "timestamp": 1732143600
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "A game I almost like because it really leans into its theme. I like building the rooms with silly names. But the worker placement is too limiting, half the turns you just don't do much. And there's the reputation requirements (which I didn't notice the first time playing) and that makes a lot of things a chore to do, rather than outwitting the other players.",
    "timestamp": 1729720800
  },
  {
    "username": "lou_mein",
    "rating": 1.0,
    "comment": "Yawn. Fart. Change my pants",
    "timestamp": 1726783200
  },
  {
    "username": "Big Bad Lex",
    "rating": 1.0,
    "comment": "Three plays on BGG: A game that really intrigued me before playing and amidst the hype I was very tempted to buy blind. So many rave reviews, so many expansions.\n\nMany thanks BGA for saving me £100. This is a game that seems at first pass to have a clever engine building structure with multiple routes to exploit. The reality is that success or failure will be determined by the luck of the tile and card draw. It's quite possible that the tiles you need for end game bonus VP's may never be drawn. A player might suffer a draw of dire guests turn after turn and a poor start will be hard/ impossible to recover from even if the randomness of the game eventually breaks in your favour in the latter stages. There is no mechanism to compensate for this arbitrary mayhem. Find yourself unable to generate reputation and you might as well give up as you will be unable to use the more powerful guests and improvements even though you have them in hand. So very broken for any gamer who likes to have any influence what they can do.\n\nA 4P game will have significant downtime and for the AP prone, this will bring out the worst in them. You don't really care what other people are up to so it is another example of multiplayer solitaire.\n\nI don't understand the 7+ ratings How is this a top 100 game? BGG needs to compartmentalise into different game genres so players can focus on what they like rather than being forced to sift through this deepening swamp of insipid crap before you find anything worthwhile.\n\nI do not give out '1' ratings lightly but such a reliance on random card draws and luck in the 21st Century makes Obsession no better than Snakes and Ladders with faux decisions.",
    "timestamp": 1687903200
  },
  {
    "username": "quietcorn",
    "rating": 2.0,
    "comment": "The process of play in this game is really interesting. Each player starts with an array of 1 tile of each color. On your turn, you select 1 tile to be your active tile. You then have to spend a worker in the color matching the box on the tile. The tile then often lets you play some number of cards from your hand. The cards often cost additional workers of varied colors, and then the cards also produce their benefits. Normally workers take two turns to reset, unless you pass reclaiming your played cards which also resets your worker pool. Rounds are few, so ideally you want to pass as few times as possible. To facilitate this, one of the common effects on the cards is to get more cards. It's a great core mechanism to build a game on, but sadly this game is burdened by an incredibly high degree of randomness, which kills the experience for me completely.\n\nThe new cards you buy come in the form of blind or mostly blind draws from the stack. From the basic pile, the VP variance on the cards ranges from 1 to -4vp. For example, one player might use their turn to draw cards, and get cards with good abilities and 2vp, and another might get useless take-that cards that cost them 5vp for owning. There is a single cull card in your starting array, but again, resetting your cards spends a full turn a game with very few turns, so don't expect to get a lot of use from it.\n\nThe game has very high value secret goal cards. Some can be completed but many require you to have a set of three specific tiles or similar requirements that rely on those tiles both making it to the display, being at a cost you can afford, not being chumped off or bought by another player. Essentially impossible. In our game one player was able to do all three of his, two players couldn't complete even one.\n\nThere is also a powerful card that gets handed off at the end of each round to the player who has the most VP on buildings of the color matching the current demand card. The reward additionally comes with a hidden VP card work around 6vp. Each round one new demand card flips. In our game we each pushed heavily into one color of building, chasing the demand of that particular round. In our final round, a second demand card matching the color one player had already pushed into, which doubled his claim from those tiles, which made him unbeatable for getting the card in the final round, which gained him the 8vp printed on the card plus another 6ish vp bonus card.\n\nAdd to this the unpleasant take-that card effects, the poor graphic design choices, and you have a game that could have been amazing, but falls so short of it's potential that it's heartbreaking.",
    "timestamp": 1721685600
  },
  {
    "username": "namdh0809",
    "rating": 2.0,
    "comment": "난이도 3 버전의 \"Gizmo\"\n\n물론 난 \"Gizmo\"도 좋아하지 않지만, \"Gizmo\"는 아주 훌륭한 포지션이라고 생각한다.\n쉬운 난이도, 짧은 시간, 엔진 빌딩 및 콤보 가이드용 게임으로 매우 적합하다.\n\n하지만 \"Obsession\"은 내 취향에도 맞지 않으며, 포지션 또한 애매하다.\n아무리 봐도 유저 타겟이 \"Gizmo\"와 겹치는거 같은데, 그렇다면 \"Gizmo\"유저들은 플레이 타임을 대폭 늘리며 엇비슷한 \"Obsession\"을 할 필요가 있을까?",
    "timestamp": 1701817200
  },
  {
    "username": "DoubleByte",
    "rating": 2.0,
    "comment": "A neat concept hindered by a completely autopilot first fourth of the game, an absurd amount of luck, and a great deal of repetition. I also found many of the cards hard to read and the iconography inconsistent.",
    "timestamp": 1677625200
  },
  {
    "username": "asfhgwt",
    "rating": 2.0,
    "comment": "A draggy puzzle. Complexity for its own sake. No excitement. No fun. Couldn't wait for it to end. Playing with four would take three hours.",
    "timestamp": 1672700400
  },
  {
    "username": "NormandyWept",
    "rating": 2.0,
    "comment": "Typical contemporary Euro release, with a heads-down feel, as you spend an hour or two managing the rotation of workers on your player board and your hand of visitor cards as you try to puzzle out the best route through the game's 16 rounds.\n\nI can't imagine playing this with more than two players - it would seem pointless given, one or two race elements and grafted-on take-that effects aside, they may as well not exist given where the focus of gameplay is. Therefore adding players won't substantially change the shape of gameplay but will simply add play-time and, from any individual's perspective, downtime.\n\nThe system is simpler than it first appears and after a play or two you're able to get past the rules complexity and play relatively quickly. But you're ultimately playing a puzzle with randomly-drawn tiles and cards and, considering the strong setting of competing for a higher place in regency society, that's disappointing when the same story could be used for something which more directly pitted you against one another.",
    "timestamp": 1665180000
  },
  {
    "username": "x3000gtx",
    "rating": 2.2,
    "comment": "This is the most overrated game I've ever played. The production quality is great, but the game just isn’t fun. There’s almost zero player interaction and the setup/upkeep of everything takes up a sizeable chuck of time. For me there is nothing at all thematic about this game. All you are doing is grabbing tiles that say things like 'cricket' on them and inviting people to the event aka just selecting cards you draw at random to go to the event based on their stats and the workers you have available. I would never play this game again and I'm glad I was able to easily sell it. This game makes me not trust BGG ratings, there's nothing about the gameplay that deserves it to be over 8.0 rating and it seems like everyone is just hopping on the bandwagon of it for some reason.",
    "timestamp": 1659477600
  },
  {
    "username": "Hammerheart82",
    "rating": 2.0,
    "comment": "One of the most overrated games ever played. Very luck-driven, poor decision making process. Everything is casual in this game and there's no planning. Terrible.",
    "timestamp": 1647126000
  },
  {
    "username": "marcuslind1",
    "rating": 2.0,
    "comment": "To much randomness and multiplayer solitaire for my tastes. There also seems to be economic snowball effects and runaway leader problems, which is particulary problematic since so much depends on luck (more skilled players may disagree of course).\n\nThe theme is original and well implemented, and components are good quality.\n\nRated for first printing/KS.",
    "timestamp": 1571176800
  },
  {
    "username": "mistermarino",
    "rating": 2.0,
    "comment": "When I think of Eurogames, I think of elegance and tableaus and spreadsheets and sheer, mind-crushing boredom. While the modern boardgaming renaissance has given us a host of shockingly boring themes--mixing paint, making wine, soil formation--Obsession is the tsetse fly in the ointment. It put me to sleep months ago, and I still can't shake it off.\n\nIf the thought of renovating your Victorian estate, managing a staff of servants, hosting social events and playing matchmaker to your dreadful relatives doesn't cause you actual physical pain, then I suggest you get tested to see if possibly you died but hadn't noticed yet.\n\nDoing these things in real life would do worse than drain my will to live. It would drain my will to do anything about the fact that it had drained my will to live. Vegetative state, here I come!\n\nPretending to do them in a game? Just...why? Isn't there enough pain and sadness in the world?\n\nLook, I get it. Eurogames aren't about anything and need \"themes\" to facilitate assimilation of complex, interwoven systems of chronological, spatial and mathematical processes. Or rules. Whatever.\n\nBut this is the boardgaming equivalent of watching glue dry, except that it takes a thousand times as long and does not deliver a delightful chemical high to go along with the debilitating headache.\n\nOkay, I admit I made up the bit about soil formation as a game theme. At least I think I did. Then again, who doesn't want to play a Eurogame that takes 10 million years?\n\nObsession does not take that long. It only feels like it does.",
    "timestamp": 1548716400
  },
  {
    "username": "perry555",
    "rating": 2.0,
    "comment": "Played it twice. If you fall behind then you can't catch up and the other player turns take longer and longer. Very boring and very luck dependent.",
    "timestamp": 1545519600
  },
  {
    "username": "JukkaMikael",
    "rating": 3.0,
    "comment": "What on earth? Top-decking cards that might be unplayable, wildly unbalanced tiles, theme hidden in the flavor text, no interaction whatsoever, visually very dull. Obsessed about how bad this is in comparison to its rating.",
    "timestamp": 1733612400
  },
  {
    "username": "bjsully6",
    "rating": 3.0,
    "comment": "There was not one element of this game that I enjoyed. I did not even finish the first game. I don't think that is a knock against the game but it is really not my style of game.",
    "timestamp": 1730415600
  },
  {
    "username": "TheCat",
    "rating": 3.0,
    "comment": "For a game with this much planning required, there is far too much randomness. Never again.",
    "timestamp": 1720216800
  },
  {
    "username": "darkskies",
    "rating": 3.0,
    "comment": "I really don't understand the fascination with this game. It is so random with the card draw if you get a good card from the deck, you are on to a winner, if you get a cad, it sucks to be you! Way too much randomness and imbalanced for a lengthy euro. No thanks.",
    "timestamp": 1719871200
  },
  {
    "username": "adrian79e",
    "rating": 3.0,
    "comment": "Boring and not engaging at all. No combos, almost no interaction and the theme and art design are definitively not of my liking. Sold it after first (and only) play.",
    "timestamp": 1717711200
  },
  {
    "username": "vikingcode",
    "rating": 3.0,
    "comment": "Multiplayer solitaire, with close enough to zero interaction and large luck elements on draw of objectives, guests and tiles.",
    "timestamp": 1716674400
  },
  {
    "username": "Amewingcat",
    "rating": 3.0,
    "comment": "Dreadful artwork and painful slow play, one to miss",
    "timestamp": 1713132000
  },
  {
    "username": "Fevin",
    "rating": 2.5,
    "comment": "Le thème est très bien retranscrit c'est assez rare pour un gros jeu de gestion ! Mais est ce vraiment un gros jeu de gestion ? Ca en a la mollesse et des règles assez longues (4 aides de jeu !) mais c'est tout !\n\nQuasiment toutes les sources de PV sont aléatoires / arbitraires, les choix se résument à suivre une tendance évidente sans réelle liberté. L'iconographie / ergonomie est plus que douteuse. Les wordings pas super clairs. L'équilibrage est complètement nul.\n\nC'est un solitaire mis à part une option de kingmaking et l'achat des tuiles mais qui au final est tellement dirigiste qu'il ne crée pas vraiment d'interactions. Ce qui rend l'attente bien plus pénible surtout qu'on ne joue que 14 coups dans la loooongue partie. Mais des coups longs à résoudre.",
    "timestamp": 1701471600
  },
  {
    "username": "Kilmister",
    "rating": 3.0,
    "comment": "Boring - breaked up the game after three rounds. Also the texts are to small and the game parts don´t look beautiful (except the pictures on the cards)...",
    "timestamp": 1699138800
  },
  {
    "username": "hatemachine",
    "rating": 3.0,
    "comment": "Boring theme. Boring components. Boring gameplay. Boring, boring, boring.",
    "timestamp": 1676242800
  },
  {
    "username": "sykano",
    "rating": 4.0,
    "comment": "Theme and looks are not for me.\nI have a lot of trouble to look beyond that to determine if there is something good about the game.\nIt seems insanely boring.\nnot enough player interaction ?",
    "timestamp": 1759356000
  },
  {
    "username": "federik21",
    "rating": 4.0,
    "comment": "Enjoyable mid heavy engine builder. Unappealing looking and Multiplayer solitaire.\nI didn’t feel the theme.\nToo much randomness for the objectives and cards. Long downtime in 4. Too expensive for what it is.",
    "timestamp": 1757973600
  },
  {
    "username": "Balleflass",
    "rating": 4.0,
    "comment": "Multiplayer solitare.\nNot for me.",
    "timestamp": 1755900000
  },
  {
    "username": "hiimjosh",
    "rating": 4.0,
    "comment": "Although I didn't mind the core mechanics of the rooms and flipping them, this was such a mishmash that didn't gel at all. The luck is extra heavy and introduced some serious feels-bads for what is trying to bill itself as a mechanical euro. I'm not really sure who this is for, but a bunch of people seem to like it.",
    "timestamp": 1743458400
  },
  {
    "username": "MightyGeekPants",
    "rating": 4.0,
    "comment": "Just Ugh. Don't see what people like about this - mechanically or thematically.",
    "timestamp": 1738969200
  },
  {
    "username": "muzrobertson",
    "rating": 4.0,
    "comment": "Hard not to be charmed.",
    "timestamp": 1736377200
  },
  {
    "username": "GroundDoon",
    "rating": 4.0,
    "comment": "so unfocused",
    "timestamp": 1733007600
  },
  {
    "username": "dreamer1789",
    "rating": 4.0,
    "comment": "I don't mind the theme, but the gameplay bores me.",
    "timestamp": 1732402800
  },
  {
    "username": "theblobb",
    "rating": 4.0,
    "comment": "w/ Wessex, Upstairs Downstairs and promo tiles",
    "timestamp": 1732316400
  },
  {
    "username": "Mamjor",
    "rating": 4.0,
    "comment": "Beau matériel et belle thématique, mais gros problème d’équilibrage. Le premier à prendre un peu d’avance ne peut plus être rattrapé.",
    "timestamp": 1731106800
  },
  {
    "username": "Euroman",
    "rating": 5.0,
    "comment": "Deck building in the Century Spice Road style, but your cards have to be paid for with workers that cycle into your play area. Deck building and tableau building are not my favorite mechanics.",
    "timestamp": 1762614480
  },
  {
    "username": "Peteypabloplays999",
    "rating": 5.0,
    "comment": "Got really bored.",
    "timestamp": 1759010400
  },
  {
    "username": "Glanzmuecke",
    "rating": 5.0,
    "comment": "I really do like the theme of the game, but for me it has the classic euro-problems: Everything is super abstract and opaque, plus the skills of the different workers are hard to remember (at least for me)",
    "timestamp": 1756245600
  },
  {
    "username": "TForever",
    "rating": 5.0,
    "comment": "Worker placement game with some rotatable characters. In the range of Lords of Waterdeep.",
    "timestamp": 1745359200
  },
  {
    "username": "Avid_Equinox",
    "rating": 5.0,
    "comment": "Worker placement:\n+ Good theme and components sell it well\n- Dry\n- Random card draw objectives that can be easy to not worth it to fulfil based on when you get them\n- Minimal player interaction - this removes worker placement blocking as you place workers on your own cards. So you just interact via point comparison for courting and for buying tiles in the shop.\n- As it's not innovative, it sits in a crowded genre and it doesn't stand out - so many worker placement games exist that I don't see why you need this one unless you LOVE the theme.",
    "timestamp": 1745100000
  },
  {
    "username": "silenceisgolder",
    "rating": 5.0,
    "comment": "This one kind of won me over. It's not my type of game, but it does icon soup better than I think any game I've played recently, most of all because the thematic integration is actually believable. The theme also seeps into the procedures of the game which makes it feel light hearted and not obtuse. The card draws are kind of a lot...some secret objectives required certain buildings to be built which might just never come out, and others gave you points (not much fewer points!) for things that you can accomplish in stride, while others just provided you some direction. That's common in these games though. So far I see this as the peak game of a trend I have no interest in (MPS, card-draw heavy, icon soup games).",
    "timestamp": 1743717600
  },
  {
    "username": "rjones53",
    "rating": 4.5,
    "comment": "Basically it's a real mess of luck based elements. It's a hand builder where you are building up a hand of cards. Unfortunately there are far too many luck elements for this to ever be a good game.\n\n* You're dealt a random family at the start with 2 random starting cards.\n* Objective cards are gained and lost during the game but luck often determines if you complete them or not.\n* Bonus point cards are randomly drawn with random benefits.\n* The prestige guests you gain vary in quality too much, especially 1 prestige guests. I particularly don't like this push your luck element.\n* Building cards are random and cost too much to refresh. Often trying to get a good room is a challenge which also makes the courtship battles too lucky.\n\nA person gaining better cards early on than someone else will almost certainly win. I hate the negative cards, they feel like very badly balanced decks. No catch-up mechanism which is essential for such an unbalanced & lucky game. I particularly hate long push your luck games and this feels like a push your luck game more than anything else unfortunately. The play time is often 2-3 hours even for the short variant with 4 players, the fact with an expansion this can go up to 6 sounds awful. Best at 2-3.",
    "timestamp": 1743030000
  },
  {
    "username": "DrDave73",
    "rating": 5.0,
    "comment": "I thought everyone would love it, mostly due to the theme, which would float 3 out of 4 of us's vibe (not me though). It's been on the table twice in over a year. Just doesn't work for us. And once you learn where the main points can be won it's pretty much just a race.",
    "timestamp": 1742166000
  },
  {
    "username": "docspouse",
    "rating": 5.0,
    "comment": "2-4 players",
    "timestamp": 1741647600
  },
  {
    "username": "Ginewra",
    "rating": 5.1,
    "comment": "bga",
    "timestamp": 1739228400
  },
  {
    "username": "PlayAndCode",
    "rating": 5.0,
    "comment": "Feels too random for such a heavy game.",
    "timestamp": 1738278000
  },
  {
    "username": "TwoZsInAPod",
    "rating": 5.0,
    "comment": "I think this just has too much going on for me. I felt confused and underwhelmed after hearing so much hype. It rarely felt like I had meaningful choices and mostly just had to do whatever I *could* do.",
    "timestamp": 1736550000
  },
  {
    "username": "Pippishortstocking",
    "rating": 4.5,
    "comment": "Its just not very pretty and rather convoluted. The rheme is quite strong and it was a game we wanted to love but just hated the fact that you had to pick up the rule book every 5 minutes to check something. 3 plays later and we hadnt changed our minds.",
    "timestamp": 1735340400
  },
  {
    "username": "snth",
    "rating": 5.0,
    "comment": "I asked my friend to remove the rapey guy from the guests deck in his copy. Other than that, fun thematic game with a high luck factor.\n\nFrom a Mel or Spike or even Jenny perspective, this is really not good, a three. As a story creation engine, it's better. A five.",
    "timestamp": 1734994800
  },
  {
    "username": "Grunwald",
    "rating": 5.0,
    "comment": "Ciekawy i dość dobrze oddany temat, ale całkowity pasjans zniechęcający losowością - karty gości, budynki... a najgorsze są cele",
    "timestamp": 1734476400
  },
  {
    "username": "tectactoe",
    "rating": 5.0,
    "comment": "+Base Game [4.0] An artistic joy, a diamond in the rough as far as unique themes go, and a relatively straightforward action system that forces players to (wisely) mitigate bad luck as best as they can.\n\n+Obsession: Wessex Expansion [4.0] The new family adds a nice starting bonus - an extra stating tile. Enables play at 5 players, too, but I would never recommend that.\n\n+Obsession: Upstairs, Downstairs [5.0] The new servant types are marvelous and, at this point, almost feel essential to the game - it gives players further means to sidestep unlucky draws and navigate other ways to score points.",
    "timestamp": 1734303600
  },
  {
    "username": "tolhs",
    "rating": 5.1,
    "comment": "2024:+1",
    "timestamp": 1733958000
  },
  {
    "username": "Udai",
    "rating": 5.0,
    "comment": "I enjoyed playing the game, although I felt there was a strong element of luck and it was not my favorite game.",
    "timestamp": 1733612400
  },
  {
    "username": "SenorBivins",
    "rating": 5.0,
    "comment": "Base Game",
    "timestamp": 1727647200
  },
  {
    "username": "Duke_Rufus",
    "rating": 5.0,
    "comment": "I love Jane Austen and Downton Abbey! But not this game.",
    "timestamp": 1724968800
  },
  {
    "username": "fergaliciousMe",
    "rating": 6.0,
    "comment": "I was so hyped for this one and wanted to love it. It felt flat for me mechanically though. Some improvement point that may have already been fixed by the expansion is giving the player more agency when inviting guests, i.e. a costly action selection mechanism to peek at the next 3 guests and rearrenging them.",
    "timestamp": 1762584360
  },
  {
    "username": "reswob",
    "rating": 5.8,
    "comment": "Did only play it once or twice. Need more exp. to talk better about it - but sofar i mostly dont like it :/",
    "timestamp": 1762038000
  },
  {
    "username": "Korwin",
    "rating": 6.0,
    "comment": "It's a simple euro, there are no complicated decisions you need to do.\nThe theme elevates it above the run of the mill competitors.\nShort and fast, which is welcome, but with low production value.\nOn the other hand, the first and the last turn aren't that different, which is usually a sign for bad design\n\nI'm not sure how it got so far up the ladder, but I guess good Victorian games are in short supply.",
    "timestamp": 1760738400
  },
  {
    "username": "logopolys",
    "rating": 6.0,
    "comment": "This was a fairly straightforward resource allocation euro. Mechanically, this was a fine game, with nothing thrilling but nothing disappointing. Theme is where it gets interesting, especially with my experience with Gosford Park and Upstairs, Downstairs. I don't know if I'll pursue this again, but it was good for a one-off.",
    "timestamp": 1759356000
  },
  {
    "username": "EllikTheren",
    "rating": 6.0,
    "comment": "Impressively well implemented thematic. You can feel the passion behind the making of this board game. The game plays extremely well solo.\nHowever, the game has too many high luck swings. I wish I could get a more consistent experience and rely entirely on my tactics and strategies.",
    "timestamp": 1759356000
  },
  {
    "username": "enavico",
    "rating": 6.0,
    "comment": "+ Excellent theming\n+ Smart objective selection mechanism\n\n- Too much luck involved for a euro",
    "timestamp": 1758751200
  },
  {
    "username": "berniethered",
    "rating": 6.0,
    "comment": "This would be higher if players were not at the whims of the game - I don't mind luck if it can be mitigated or if there are more choices - but the game is so tight that the luck of the builders market or the luck of the draw for new people knocks it down for me.\nAlso the game is too restrictive. You get all these cards and tiles but when increasing reputation is so freaking difficult... You can't use the things you collect for so long. Just feels like a bummer.\nAnd the rule books are a huge chore... A total pain.",
    "timestamp": 1758492000
  },
  {
    "username": "mjhm",
    "rating": 6.0,
    "comment": "multiple plays (bga)",
    "timestamp": 1758319200
  },
  {
    "username": "CMagex",
    "rating": 6.0,
    "comment": "battlefield",
    "timestamp": 1755813600
  },
  {
    "username": "Mestail",
    "rating": 6.0,
    "comment": "theme is fun,but except the theme, nothing else; Unblanced...",
    "timestamp": 1754949600
  },
  {
    "username": "LostChord_Mark",
    "rating": 6.0,
    "comment": "4-2024\n2025-06 Rio taught - 4 player - not really my thing - need to try again - but dont want to",
    "timestamp": 1754604000
  },
  {
    "username": "aresil",
    "rating": 6.0,
    "comment": "bga",
    "timestamp": 1754085600
  },
  {
    "username": "Xyt4n",
    "rating": 6.0,
    "comment": "- - I don't get much theme out of it\n- - to mechanical for me\n- - multiplayer solitair",
    "timestamp": 1753912800
  },
  {
    "username": "daemonn",
    "rating": 6.0,
    "comment": "ugly looking",
    "timestamp": 1752012000
  },
  {
    "username": "dmwainw",
    "rating": 6.0,
    "comment": "BGA",
    "timestamp": 1751580000
  },
  {
    "username": "Stejeh",
    "rating": 6.0,
    "comment": "Nice flow deck management game, but for a game using cards and a market to get things done, why they didn't do a market with the gentry pile? a bit too random for my taste for that kind of game.and also very solitaire",
    "timestamp": 1751061600
  },
  {
    "username": "Lemem",
    "rating": 6.0,
    "comment": "Obsession's theme is uniquely refreshing but unfortunately I found the worker placement gameplay to be repetitive, solitaire, and drab.",
    "timestamp": 1750802400
  },
  {
    "username": "withouthavingseen",
    "rating": 6.0,
    "comment": "Very, drawn out, very euro eurogame.",
    "timestamp": 1750543200
  },
  {
    "username": "bluestraggler",
    "rating": 6.0,
    "comment": "Great theming with a well-realized look and feel.\n\nBut gameplay has just not been engaging. It's a unique solo design, not just a rehash of other well-known mechanics (which I always appreciate), but for whatever reason it didn't keep me interested. Maybe not enough of a sense of variety in the types of things I can do, the rival families, or how games play out. I'd play a couple times, put it a way, and not think about it again for a while.\n\nMultiplayer, probably 2P is the sweet spot because at 3 or especially 4 there's a lot of downtime waiting for your turn. Other players take tiles you might want, but that's pretty random. There's also too much of a luck factor in early courtship draws that end up deciding the game.\n\nSold.",
    "timestamp": 1750197600
  },
  {
    "username": "metelo",
    "rating": 6.0,
    "comment": "A cool, quick, and different game, it has a lot of twists, plenty of flavor, and a take-that element.",
    "timestamp": 1749938400
  },
  {
    "username": "CarsonChandler",
    "rating": 7.0,
    "comment": "This was alright on BGA, a little tough to learn, but I think my wife would probably really enjoy it based on the style and the theme.",
    "timestamp": 1762652940
  },
  {
    "username": "reqqz",
    "rating": 7.0,
    "comment": "Nice theme, but the gameplay feels a bit bland. If you enjoy heavy euro games, this one probably won’t be for you. However, if you prefer lighter euros and like the theme, you might really enjoy it.",
    "timestamp": 1762470000
  },
  {
    "username": "Nuvium",
    "rating": 7.0,
    "comment": "The high-profile guests have too much influence on the final score.",
    "timestamp": 1762297200
  },
  {
    "username": "Derianhorgen",
    "rating": 7.0,
    "comment": "SpielboxRating 8-9, av. 8,33\nThomas",
    "timestamp": 1761951600
  },
  {
    "username": "TyDeL",
    "rating": 6.5,
    "comment": "This game is a bit surprisingly fun, I wasn't sure what to expect. Obsession is basically tableau building and resource/hand management. Buy tiles, activate them with staff and send people from your hand to the events to earn money and prestige, buy more buildings, win the hand of the fancy pants couple. It's fun to get into.\n\nI do have a lot of issues with how luck dependent everything is. Random cards you're drawing, random event requirements, random tiles that come out, random objectives. Some official variants combined with the expansion have improved it for me. I probably wouldn't have gone through the trouble if my wife didn't love the theme so much.",
    "timestamp": 1761778800
  },
  {
    "username": "Felwin",
    "rating": 7.0,
    "comment": "MITT -- 2:00 Stunden -- Komplexität 3+\nOkay @ 2-4 -- Good @ 2-3 -- Best @ 2-3\nLetztes Spiel 01/2025",
    "timestamp": 1761084000
  },
  {
    "username": "Cocoabine",
    "rating": 7.0,
    "comment": "7/10: It has a snowball effect, where the first person who gets the special Fairchild card can runaway with the win, and speaking of them - they are completely unbalanced, since the woman is way better than the man (One gives prestige guests which give victory points, reputation and money, while the guy only gives a little money and rep). The variable card draw in the game can also be great for some and horrible for others. But I enjoyed the unique theme and engine building mechanics. Would play again.",
    "timestamp": 1760997600
  },
  {
    "username": "netfilterz",
    "rating": 7.1,
    "comment": "Honestly just bought it based on the hype each time there’s a reprint…",
    "timestamp": 1760997600
  },
  {
    "username": "Auroric",
    "rating": 7.0,
    "comment": "Good euro that has an almost oldschool feel, combined with fantastic theme. I enjoy the process of drafting different buildings for my estate, while trying to manage a hand of cards and the worker resources to activate them. There's a ton of variability, and every game will feel slightly different with alternate objectives and strategies.\n\nIt is another minimal interaction Euro game, so the theme does a lot of heavy lifting here. The randomness is sky high, and although it mostly comes out in the wash, you can still end up with objectives that you simply can't fulfill, or guests that put you on the back foot early. I also find the courting aspect to reward the player who's already doing well, which I don't love, although there are variants for that. It can also be extremely AP prone, without a ton of payoff for it because of the luck factor.\n\nOverall I've enjoyed Obsession. It's one of the most thematic Euros I've played, and building out your estate is a genuinely good time. It gets a little dry after awhile, and the randomness can be annoying, but it's still one I'd consider picking up at the right price. This could really draw certain family members to it who aren't big gamers, and i could play it and enjoy myself.",
    "timestamp": 1760652000
  },
  {
    "username": "mjrobertson",
    "rating": 7.0,
    "comment": "Evergreen keeper. Consider getting the Characters expansion at some point. Although the base game and first couple of expansions is arguably more than enough.",
    "timestamp": 1760306400
  },
  {
    "username": "adi_venturer",
    "rating": 8.0,
    "comment": "Obsession is two very different games in one box and they both warrant discussion. On the one hand is Obsession the multiplayer experience. It's not your standard run-of-the-mill dry Euro, but it is also too long for what it offers. The game is fun and features some unique mechanisms, but purely from that mechanics standpoint, it is a point salad with wild swings of luck - the bane of most Euro purists. So maybe a 7/10?\n\nThankfully for me though, I am the opposite of a Euro purist. I am all about that theme and love games that are not afraid to compromise balance and mechanics for a true thematic experience. It is really hard to pull that off in a Euro framework like Obsession's though, because there is no room for table talk to balance out the mechanics of the game. Enter Obsession Solitaire mode! This is where the game truly shines! Dan has really poured his heart and soul into this project, and it really gets the room to breathe and display itself at its grandiose best when the shackles of balance and forced player interaction are removed!\n\nThis game is Downton Abbey on tabletop. Every component and action in the game pulls you into its Victorian England setting and takes you on a journey. The design of this game catches every essence of Downton Abbey: rich fancy people on the decline trying to stay relevant in their society the only way they know how - by throwing expensive events! I only recently acquired this game and have come to adore it so much. This game is everything I want it to be and then some! It offers a very crunchy puzzle to solve while constantly trying to distract you with a very immersive theme - should you choose to engage with it. The Solitaire mode is easily a 8/10 or even a 9/10 for me. I fully expect my rating to grow as I play this game more. There is a reason the solo community gushes over this game, and now I am one of them. I don't think I ever want to play this game multiplayer to be honest. This game is best enjoyed solo or maybe with a partner not looking to be hyper-competitive, who is willing to join you on an incredible journey through ballrooms and Corquet lawns.\n\n\n(Plays: 5+)",
    "timestamp": 1762683540
  },
  {
    "username": "Papinek",
    "rating": 8.2,
    "comment": "Dan Hallagan created the game with a barrel of love ! The contents of the box are unusual and extraordinary ! The gameplay is outstanding with 2 or 3 players and the solo mode is top ! What a pity that the area tiles are without a picture printing like the monuments ! In conclusion : great",
    "timestamp": 1762597440
  },
  {
    "username": "Dr_IJ",
    "rating": 8.0,
    "comment": "Game you are gonna play with your significant othere that is not much into board games. Quality of game is really good, but overall expansions make core game a bit messy with card and tiles additions and removal. A bit more artwork on tiles would be great.",
    "timestamp": 1762561860
  },
  {
    "username": "nickbudz",
    "rating": 8.0,
    "comment": "If you buy this one for the theme, I don't think you'll be disappointed. The game seems more complicated than it actually is, although I think part of that is that the rulebook felt poorly organized to me. The game is clearly a labor of love for the designer, and I really enjoyed being a part of the process during the Kickstarter.\n\nOverall, I think this one is a keeper for me, although it's not going to make it to the table as much as other similar-weight games.",
    "timestamp": 1762470000
  },
  {
    "username": "Beru",
    "rating": 7.5,
    "comment": "#WTPextension",
    "timestamp": 1762383600
  },
  {
    "username": "skytostar",
    "rating": 8.0,
    "comment": "Reading this rule book is like i play hide and seek.",
    "timestamp": 1762297200
  },
  {
    "username": "WardenOfDoom",
    "rating": 8.0,
    "comment": "Exp In This Box:\n● Useful Box\n● Promotional Tiles\n● Upstairs, Downstairs\n● Wessex Expansion\nSleeves:\n● Arcane Tinmen\n● Arcane Tinmen Medium - Non-Glare Matte (57x89mm)\nLanguage:\n● Eng\n.",
    "timestamp": 1762297200
  },
  {
    "username": "Luma_",
    "rating": 8.0,
    "comment": "Obsession: Wessex Expansion (2018)\nObsession: Upstairs, Downstairs (2020)",
    "timestamp": 1761865200
  },
  {
    "username": "photonic",
    "rating": 8.0,
    "comment": "+ Characters Expansion\n+ Metal Coins",
    "timestamp": 1761778800
  },
  {
    "username": "jkbamboom",
    "rating": 8.1,
    "comment": "For those folks who like an immersive Victorian era London theme and worker placement in a game, then you got to play this. Totally dripping with theme.",
    "timestamp": 1761692400
  },
  {
    "username": "ditterio",
    "rating": 9.0,
    "comment": "OBSESSION (1-4 players)\nUPSTAIRS, DOWNSTAIRS (1-6 players)\n\nPlayer aid: https://boardgamegeek.com/filepage/231972/player-aid-approve...\n\nSet up guide and references: https://boardgamegeek.com/filepage/270073/obsession-setup-gu...",
    "timestamp": 1762297200
  },
  {
    "username": "Legionnair3M",
    "rating": 9.0,
    "comment": "MG",
    "timestamp": 1761865200
  },
  {
    "username": "MegaWestWolf",
    "rating": 9.0,
    "comment": "I held off on getting this for years. I don't like Downton Abbey at all, so I avoided this game because of the theme.\n\nI was wrong in waiting. This game is a lot of fun.",
    "timestamp": 1761606000
  },
  {
    "username": "tiggsterino",
    "rating": 9.0,
    "comment": "Sleeving - in progress. Sleeves for smaller cards are still needed.",
    "timestamp": 1761429600
  },
  {
    "username": "thankyou4notsmoking",
    "rating": 9.0,
    "comment": "+Wessex\n+Upstairs/Downstairs\n+Characters",
    "timestamp": 1761429600
  },
  {
    "username": "Pchan909",
    "rating": 9.0,
    "comment": "Bot slots in easily and is a great game solo. Feels very much like multiplayer since you're just building your own estate anyway. Loving the synergies of deck and tableau building with the added complexity of the servant resource management. Definitely worth adding upstairs downstairs from the get go and read the instructions since videos seem to skirt over a lot of the little rules that can be game changing if missed if you don't already know how to play.\n\nAll that game and it fits in a regular size box, even with most of the expansions (fit in upstairs downstairs and Wessex no problem).",
    "timestamp": 1761429600
  },
  {
    "username": "Napattack",
    "rating": 8.5,
    "comment": "3.09\n1-4\nBest at 2\n90 (630)\n#80",
    "timestamp": 1761170400
  },
  {
    "username": "marieboucher",
    "rating": 9.4,
    "comment": "One of our favourites",
    "timestamp": 1760997600
  },
  {
    "username": "Bouttime",
    "rating": 9.0,
    "comment": "5",
    "timestamp": 1760824800
  },
  {
    "username": "1ngu",
    "rating": 9.0,
    "comment": "Incl. Wessex expansion, Upstairs, downstairs, promotional cards and promotional tiles (added 2020-09-26) Characters expansion (added 2024-11-26)",
    "timestamp": 1760565600
  },
  {
    "username": "YepJustFine",
    "rating": 10.0,
    "comment": "Since picking up an all-in Kickstarter set of this it has become a staple game around the house. We love the characters, artwork, style and theme of this quality production. It has effortlessly become the board game that both my wife and I have ever played the most! Kayenta's metal coins are truly something to behold.",
    "timestamp": 1762696980
  },
  {
    "username": "Baconian",
    "rating": 9.5,
    "comment": "This is what I have been looking for for so long: richly thematic games that use the theme to drive the mechanisms and vice-versa. This is game design at its finest.",
    "timestamp": 1762470000
  },
  {
    "username": "yelske",
    "rating": 9.9,
    "comment": "This is my favorite game, I must admit I was a bit hesitant if it would fit me at first as I was not a big euro player (this game changed that for me). This game plays like butter and I love the theme. The solo bot plays so well and is very easy to run. Played one game with 2 players, which is ok, one at 4 which I never want to do again.",
    "timestamp": 1762383600
  },
  {
    "username": "Albia",
    "rating": 10.0,
    "comment": "❦ Solo Mode // Included in the Base Game\n❦ Required Play Space // 24\" x 28\"\n❦ Setup Time // 10 Minutes\n❦ Play Time // 50 Minutes\n\n✅ Each play creates interesting situations that have short-term and long-term effects, making every choice meaningful.\n✅ There is a great deal of variety with the improvement tiles and guests, allowing different strategies to emerge.\n✅ Although artwork is minimal, the theme is very strong and it’s fun to imagine what each tile or event looks like.\n✅ Play time moves at a good pace, with many plays often lasting under an hour while offering a satisfying experience.\n✅ Solo opponent families vary in difficulty levels, and some create ongoing storylines to become memorable nemeses.\n✅ Managing all of the moving parts feels thematic and creates a wonderful, interconnected set of game mechanics.\n\n❌ Some degree of luck is involved with some of the highest scores, although there are many ways to score well.\n❌ Prestige guests are some of the best ones available, yet these can sometimes feel a bit unbalanced with the variety.\n❌ Understanding how to use the expansion servants takes some time, and there are a handful of new rules to remember.\n❌ Frustration can seep into many plays with closed courtship and hidden theme cards, but it’s relatively quick to reset.\n\nRead the Session Reports and Review at Gameward Bound »",
    "timestamp": 1760997600
  },
  {
    "username": "Lendengold",
    "rating": 10.0,
    "comment": "Anne\n(gekauft)",
    "timestamp": 1760565600
  },
  {
    "username": "Jag_girl",
    "rating": 10.0,
    "comment": "Birthday present from Nic - both of us are fans of Jane Austen & Downton Abbey and I'm a resident of Derbyshire, so this is a dream come true!\n\"Carson, bring the champagne, we have something to celebrate\"",
    "timestamp": 1760479200
  },
  {
    "username": "buzard",
    "rating": 10.0,
    "comment": "A masterpiece of design. Dozens of subtle but important decisions keep you involved even when it is not your turn.",
    "timestamp": 1760220000
  },
  {
    "username": "Anks",
    "rating": 10.0,
    "comment": "Edited Solo Mode",
    "timestamp": 1759960800
  },
  {
    "username": "jBullfrog",
    "rating": 10.0,
    "comment": "What a beautifully crafted game. Truly incredible how the game captures the spirit of period piece drama and intrigue.\n\nA favorite game for my wife and I when we want to play a longer game (we play the extended game) and it's always a blast. So much fun talking about who is being invited to what and who are they bringing along. So much fun slowly expanding your estate into something grand.\n\nAlso, LOVE the solo mode!!!",
    "timestamp": 1759788000
  },
  {
    "username": "Jnunes29",
    "rating": 9.5,
    "comment": "Fantastic game that is dripping with theme. If you havent played it, give it a try.",
    "timestamp": 1759356000
  }
]