[
  {
    "username": "SpielzusammenGER",
    "rating": 1.0,
    "comment": "Millions rave about it, only few dare to speak the truth. Not a good game.\nNeat idea to cooperatively land a plane but what totally kills the game is the luck based die rolls and the mandatory silence.\nRepeat after me: Games are a social activity. If I play games I want to talk and interact.\nThis game is dumb.\nI noticed, similar to The Crew, that socially awkward people love this game as they dont need to talk. If you like SkyTeam go play video games by yourself. I would only recommend this game to people during a divorce when they dont talk to each other anyways. Nope! This is not a game.",
    "timestamp": 1761429600
  },
  {
    "username": "Mageknight12",
    "rating": 1.0,
    "comment": "Sky Team has a fun theme, but limited communication and repetitive actions make it feel samey fast. Once you’ve cracked the puzzle, there’s little incentive to replay. 2/4 dice slot is madatory ?.",
    "timestamp": 1750456800
  },
  {
    "username": "ManEatingHippo",
    "rating": 1.0,
    "comment": "Obvious choices. It's just bad.",
    "timestamp": 1742770800
  },
  {
    "username": "Jerapa",
    "rating": 1.0,
    "comment": "Just, no. Plan all you want, but if both players don't get the dice rolls needed when they're needed, which happens A LOT, you ain't never gonna land that plane on anything other than the introductory game. 90 percent luck (mostly bad) with dice rolls, 10 percent strategy, and no interesting decisions. Wanted to like this, but it's just awful. Might as well toss four dice in the air and try to predict the outcome. Wrong? You lose.",
    "timestamp": 1741734000
  },
  {
    "username": "LatvianStumpy",
    "rating": 1.0,
    "comment": "***Update - Coildespring were no help whatsoever. Another awful company to avoid at all costs.\n\n***Original comment - Damaged components, awaiting response from Coiledspring in regards to how to fix.",
    "timestamp": 1736550000
  },
  {
    "username": "RobinZh",
    "rating": 2.0,
    "comment": "Please be aware that this game mechanic may amplify major disagreements between you and your partner, especially for those who may not be adept at considering each other's perspectives.",
    "timestamp": 1721772000
  },
  {
    "username": "wavedog98",
    "rating": 2.0,
    "comment": "There's no setting I like to think about less than being in an airplane or at an airport. Playing this makes me feel like I need a valium and a shower after drinking a shitty cup of $5 coffee. Gameplay doesn't help much - victory or defeat likely will come down to a lucky die roll and leave you feeling as helpless as a poor sap stuck in customs while his connecting flight lifts off from the runway. Don't worry, there is a hotel with mirrors on the ceiling just down the way. Just wait here for a few hours and we'll have you booked!",
    "timestamp": 1721685600
  },
  {
    "username": "WolfgangofChrist",
    "rating": 2.0,
    "comment": "boring, repetetive",
    "timestamp": 1720476000
  },
  {
    "username": "RogerDHyman",
    "rating": 2.0,
    "comment": "I am so very glad that real pilots aren't in their cockpits rolling dice, and are unable to communicate with each other.\n\nMicrosoft Flight Simulator this ain't.",
    "timestamp": 1716674400
  },
  {
    "username": "drewtimmer",
    "rating": 2.0,
    "comment": "Not a fan.",
    "timestamp": 1696370400
  },
  {
    "username": "sksksksmsm",
    "rating": 3.0,
    "comment": "성장요소가 없는 게임을 안 좋아하긴 하지만 그걸 감안해도 재미없었다. 테마에 몰입도 잘 안 되고 내 취향은 아니였던 게임.",
    "timestamp": 1762297200
  },
  {
    "username": "UnluckiestCat",
    "rating": 3.0,
    "comment": "I'd love to love this game as I usually enjoy 2-player games and love cooperation. The theme is great and there seems to be so much content/replayability. Unfortunately, the gameplay felt really underwhelming and I can't even exactly say why: there wasn't much feeling of cooperation and tension was comparatively low. Might have to give it another try considering all the hype around it and my hope that it'd offer so much, once I/we get to like it...",
    "timestamp": 1762124400
  },
  {
    "username": "ValerianofEternia",
    "rating": 3.0,
    "comment": "Pros :\n• Well-integrated and original airplane pilot theme\n• Clever use of dice mechanics\n• Easy to learn and fast to play\n\nCons :\n• Lack of meaningful decision\n• Gameplay feels unexciting and passive\n• Teamwork feels more random than in The Crew\n\nConclusion :\nIt feels more like a shared simulation than a truly engaging game.",
    "timestamp": 1759183200
  },
  {
    "username": "Maximaler",
    "rating": 3.0,
    "comment": "Mir machte das Spiel keinen Spaß. Man spielt zu zweit, man darf sich nicht unterhalten und spielt nicht mal gegeneinander und gewinnt wenn man durch Glück das richtige würfelt.",
    "timestamp": 1754863200
  },
  {
    "username": "oriad",
    "rating": 3.0,
    "comment": "first play . Initial play scenario way too easy .\n\nI played the most difficult scenario.\nHonestly this game a part of mitigation dice placement offer nothing really enthusiastic\n\nA deception for how bad is festival de Cannes jury decision..\nThis is a game for kids not for expert.\nThe only information is placing dice in the mandatory spots and then hoping the luck of your partner does it\n\n\nAre we serious this is fun? Not really",
    "timestamp": 1751320800
  },
  {
    "username": "Tramba",
    "rating": 4.0,
    "comment": "An sich klasse aber ab einer gewissen klasse nur noch Glückssache.",
    "timestamp": 1761519600
  },
  {
    "username": "couchlife",
    "rating": 4.0,
    "comment": "06/06/25 - Didn't find a ton of tension and fun decisions here. Put the dice where it goes, you either have it or you don't. Maybe ramps up at the later levels but not a lot of laughs here.",
    "timestamp": 1760911200
  },
  {
    "username": "kniziagamer",
    "rating": 4.0,
    "comment": "The first co-op board game that I liked a bit. The hidden information, strong theme and components make it fun. A competitive version would still be nice.",
    "timestamp": 1759356000
  },
  {
    "username": "honk3d",
    "rating": 4.0,
    "comment": "np",
    "timestamp": 1755813600
  },
  {
    "username": "swaggymonsta",
    "rating": 4.0,
    "comment": "Not sure why this didn't capture my love, when I know it's so highly rated/loved. Maybe it's the lack of full coordination. Maybe I just like heavier games. Not sure, but it just wasn't for me",
    "timestamp": 1753048800
  },
  {
    "username": "Geor9eX",
    "rating": 5.0,
    "comment": "2.04 Cmplx/15th",
    "timestamp": 1762383600
  },
  {
    "username": "Avid_Equinox",
    "rating": 5.0,
    "comment": "Limited comm game where you just have to kind of \"interpret\" what the other person has instead of making logical deductions about their \"dice hand\".\n\nThe crew has limited comms but has trick-taking which has it's own language to others with what you choose to play with. Sky team's dice do not have this, and it feels more random.\n\nIt's also not that exciting - just play dice on slots and see what happens, saving dice mitigations until they're required. I prefer limited comm games with more concrete things to deduct on than this.",
    "timestamp": 1757455200
  },
  {
    "username": "minitj",
    "rating": 5.0,
    "comment": "1 партия на двоих за 15 мин.\n\nБросаем кубики и молча по очереди выкладываем их на разные параметры планшета, чтобы самолёт долетел до финиша. У вас разные роли в которых заключаются разные ограничения для конкретного игрока, но не суть. Игровой процесс в том, чтобы решить какой кубик и в каком порядке положить, чтобы ваш товарищ по штурвалу на основе вашего хода сделал некий вывод о ваших значениях т.к вам важно в двух общих критериях достигать баланса.\n\nИгра топ 1 на данный момент на БГГ в категории семейных игр, но для меня она даже в сотню бы не зашла… Игра феномен, чем же она увлекла такое количество игроков? Для меня это загадка.\n\nОбъективно, игра тут есть и она «нормальная», но лично мне было не интересно в неё играть, все принимаемые решения по борьбе с рандомом на кубах были скучными, 2 кубика тратим на обязательные два параметра, а 2 оставшихся на какие-то из общих, которые всё равно продиктованы игрой т.к трекер раундов подгоняет и надо двигаться вперёд, количество зависит лишь от выпавших значений. Обговариваете примерный план, хотите или не хотите двигаться и на сколько(всё зависит от кубов), но вряд ли вы будете «не двигаться», это редкость и вам потом всё равно надо нагонять прогресс полёта и придётся потом бороться с рандомом ради двойного движения вперёд, поэтому считайте третье обязательное действие тратится на то, чтобы убирать самолёты с трека полёта. И вот у вас интереснейший ход из 1 кубика и решения в какую из 2\\3 свободных клеток его воткнуть, хотя и тут вряд ли будет сложный выбор т.к какой-то из параметров будет обязательным или уже подгорать и надо туда хоть что-то положить, но всё конечно не настолько плохо и душно, бывают и свободные кубасики которые можно бахнуть в кофеёк. В этой партии мы проиграли на последнем ходу, увы и ах, но наши кубики выпали такими значениями, что мы не смогли состыковать управление, будь у нас кофе справились бы, но его пришлось тартить ходом ранее дабы не врезаться в другой самолёт. Могли лы мы как-то лучше отыграть этот раунд? Неа, посмотрев на все кубики, было, что удачно выпали значения которые необходимо поставить, чтобы включить последние рубильники, а из оставшихся кубов ничего не могло состыковаться для победы. И обычно, в такие моменты появляются эмоции от накала страстей, что сейчас вот-вот будет решающий ход и… А тут этого не было, скорее было «ну ладно, соболезнуем пассажирам, го во что-то другое».",
    "timestamp": 1756677600
  },
  {
    "username": "Pevsfreedom_",
    "rating": 5.0,
    "comment": "A co-operative game that features two people with headsets flying a plane together in which you aren't allowed to... communicate.. to help.. fly the plane.. together? What? This does nothing for the \"overlord\" problem or whatever you want to call it from co-operative games because a player has just as much freedom to be an alpha in the discussion phase as they would during the action phase. Should have made it harder with more important choices and allowed people to communicate in a co-op game. Every time we finished a scenario the game was just.. over. No tension or fun. What a bore.",
    "timestamp": 1756159200
  },
  {
    "username": "Noogs",
    "rating": 5.0,
    "comment": "I don’t quite understand all of the love for this game. Don’t get me wrong, I think that the design is brilliant. The way that the problem space of the game is presented is incredibly clever and intuitive for such a small-footprint game. Nothing is wasted, and the board is crazy functional. For ui design, I’d give this a 10. Easy.\n\nMy beef with the game is the experience I get from playing it. I don’t find the tension that builds up delicious/ desperate which is the case with the best co-ops of this type. You know, that feeling of things spiraling out of control as you try to bring the game state home. Here (at least for me) the “clock” of the impending landing is there and there is a clear state you need to achieve at that point. The “game” part then mainly comes from obstacles and the randomness roll of dice. Yeah, there is the whole The Mind thing where you have to try and anticipate your partner’s play, but once you and your partner are in synch this is largely about dice rolls and obstacles. The former…in a co-op… meh. The latter makes the game puzzly. Small, quick, kind of dry (to me) puzzles.\n\nI can see the appeal of that for a lot of BGG’ers. The Crew is another game that I would put into this category, puzzles where the “game” comes from random deals, and then how those deals are played “silently.” The Crew’s theme is completely absent, but at least players have more control over how information is delivered (via what cards they play). Sky Team’s theme is awesome, but player control is less and much more simplified. In both cases, once you solve one of the puzzles (landings, space ventures), there is little reason to revisit them. The game gets boring.\n\nI can totally see why this won the Spiel. Small package, brilliant design. Something a parent can play with a kid, or kids could play with friends. For me, though, it’s ultimately dry and not that compelling in the kind of game play that I enjoy.",
    "timestamp": 1755468000
  },
  {
    "username": "BoardGaymesJames",
    "rating": 5.0,
    "comment": "https://www.youtube.com/watch?v=CI8l9yM1GfA",
    "timestamp": 1755295200
  },
  {
    "username": "FR_IT",
    "rating": 5.0,
    "comment": "This could be boring and repetitive, you have to play with the proper partner; anyway i like the theme; the game in general is nice, created optimally and with a perfect duration.\nBut definetely, surely better and more challanging \"Under Falling Skyes\"",
    "timestamp": 1755295200
  },
  {
    "username": "Gernial",
    "rating": 5.0,
    "comment": "Nice game idea, but replayability for me far to low. Its not that difficult to find the valid path to win every game. I needed three games, so maybe less than the difficulty niveau level of TicTacToe.",
    "timestamp": 1754604000
  },
  {
    "username": "salkind",
    "rating": 5.0,
    "comment": "I had written a whole thing about how the first scenario is a dud, but after giving it another shot it turns out piling more requirements and mechanics on doesn't actually make it much more fun - the dice placement restrictions are so tight as to not leave much room for cleverness or communication",
    "timestamp": 1752012000
  },
  {
    "username": "astroglide",
    "rating": 5.0,
    "comment": "Among co-op games for exactly 2P Sky Team is far and away #1 on BGG as I type this with Codenames Duet a distant second. Although I've only played the intro scenario, I'm really not seeing that. I thought it was okay?",
    "timestamp": 1750716000
  },
  {
    "username": "d3stinyman",
    "rating": 6.0,
    "comment": "Nice game but gets repetitive. Harder scenarios feel very luck dependent",
    "timestamp": 1762624980
  },
  {
    "username": "SamuraiCoyote",
    "rating": 6.0,
    "comment": "There's the afluency of two player games. Since Patchwork, there have been a plethora of those exclusively two player games in THAT squared sized box that promise a nice somewhat crunchy time with light strategy. It's a nice two players game time.\n\nWhat does it has to do with Sky team? Sky Team says \"what if that but coop\"? It goes from a \"2-player game\" to a \"couples game\". It's not a gem you'll play with a random stranger. You'll play it with a person you somewhat know, because with a random person would be a hard time. It's a game that NEEDs to have some connection with the other person due to the cooperative side and the conflictive nature of the game being \"oh well, better for next time\". Patchwork wanted to be crunchy and compact and created a whole family of games for two players because in it's simlplicity, it had strategies and the inherent human need of wanting to win over other.\n\nSky Team tries to go with a more wholesome cutesy approach to that idea and try to blame the defeat in \"bad luck\". It's a different approach to the two player game. ¿Does it work? It's a nice engine, but if you have any or other two player game of THAT SIZE of box, there's very few to do even with the expasions if those are \"this are a bit harder\".\n\nSky Team is not a very interesting \"two player game\", but well it does to be a \"couples game\". You¡ll like it depending on what type of relationship you have with board gaming with that other person you'll play it.",
    "timestamp": 1762038000
  },
  {
    "username": "greetingsfrombergen",
    "rating": 6.0,
    "comment": "NOK 200",
    "timestamp": 1761778800
  },
  {
    "username": "kystas",
    "rating": 6.0,
    "comment": "I guess this is as good as a two player dice co-op can be? Interesting enough if you are \"on the mood\", but I play this kind of co-ops quite rarely and then... well, these scenarios - although there are quite many of them - goes with same rhythm every time. There isn't enough variety or new twists...",
    "timestamp": 1760997600
  },
  {
    "username": "CatDadKil",
    "rating": 6.0,
    "comment": "Good game, although a little too much random chance involved for my personal liking. Fully completed all scenarios",
    "timestamp": 1760997600
  },
  {
    "username": "Ridd3r",
    "rating": 6.0,
    "comment": "Gets a bit repetitive",
    "timestamp": 1760738400
  },
  {
    "username": "blahblahginger",
    "rating": 6.0,
    "comment": "ok",
    "timestamp": 1760392800
  },
  {
    "username": "ImZhe",
    "rating": 5.5,
    "comment": "Simple game, easy to learn and good for 2 players. Small decision-making space though",
    "timestamp": 1759960800
  },
  {
    "username": "Ahaji18",
    "rating": 6.0,
    "comment": "Enjoy playing it when the mood is right\nPerfect game to be playing with wife ❤️",
    "timestamp": 1759528800
  },
  {
    "username": "IsolatedPawn",
    "rating": 5.5,
    "comment": "Cool theme, good components, and sometimes it delivers a tense experience. At the end of the day, though, I'm not sure how much of an actual game there is here, and I'm going weary of games that limit/forbid talking.",
    "timestamp": 1759528800
  },
  {
    "username": "Forta",
    "rating": 7.0,
    "comment": "Priority",
    "timestamp": 1762641720
  },
  {
    "username": "LyleB",
    "rating": 7.0,
    "comment": "sell",
    "timestamp": 1762470000
  },
  {
    "username": "tickbite",
    "rating": 7.0,
    "comment": "A game about communication with almost no communication. Wow! Learning to trust you co-pilot is fun and the more difficult airports are challenging in a nice way. The game is short enough that it doesn't hurt much if you crash the plane on the runway. But there's a lot packed into the short flight. I can hear the passengers (and the very fun to have intern) sigh three or four times per game when things just barely seem to work out.",
    "timestamp": 1762470000
  },
  {
    "username": "jeffrey_a_meunier",
    "rating": 7.0,
    "comment": "Unique and clever. It gets an A+ for that.\n\nIt's really good but I prefer games with a little more depth, so I'll rate it a 7. Maybe I'll like it more after a few more games. I'm sure the challenge will increase with the more difficult scenarios.",
    "timestamp": 1762210800
  },
  {
    "username": "invertebrate_ooze",
    "rating": 6.5,
    "comment": "I didn't play with any scenarios, so it was just meh but I would play again",
    "timestamp": 1762210800
  },
  {
    "username": "Matthias_K",
    "rating": 8.0,
    "comment": "FUN: after the explanation I thought it would feel like you are playing a solo game in parallel, but it actually feels like a partnership game where you try to signal information with your moves.\n\nUNIQUE: I like how you can discuss between rolls, but not during the resolution of one. The very clever system that represents the journey combined with the round counter is thematic, very unique and offers a ton of replayability.\n\nNEGATIVES: the sticker for the horizon indicator is terrible. I had to cut out the plane to make it look nice. The initial scenario is too easy.",
    "timestamp": 1762645140
  },
  {
    "username": "Bethobrien",
    "rating": 8.0,
    "comment": "Game category: co-operative",
    "timestamp": 1762640400
  },
  {
    "username": "TabledTonight",
    "rating": 8.0,
    "comment": "Turbulence Expansion",
    "timestamp": 1762470000
  },
  {
    "username": "CptGambit",
    "rating": 8.0,
    "comment": "Probably the best Coop game for 2 player. Very thematic - you really feel like flying a plane.\nThe best high-five game in my collection.",
    "timestamp": 1762470000
  },
  {
    "username": "katunia",
    "rating": 8.0,
    "comment": "played once at BerlinCon 2024; Geschenk von Anna und Bruno, two-player",
    "timestamp": 1762383600
  },
  {
    "username": "Sly_Quick",
    "rating": 8.9,
    "comment": "+Turbulence Expansion\n\n(3D Printed Insert)",
    "timestamp": 1762470000
  },
  {
    "username": "camax",
    "rating": 9.1,
    "comment": "Lots of cool challenges with the various airport approaches and modules like kerosene, ice brakes, and intern. There's some minor dice mitigation to help you, but both players really need to silently coordinate well each turn with engine speed and axis especially, but also avoiding other air traffic, and getting your flaps and brakes set before landing.",
    "timestamp": 1762470000
  },
  {
    "username": "smriera",
    "rating": 9.0,
    "comment": "Qué maravilloso juego a dos. Una vez aterrizado en el primer aeropuerto, deseando probar la campaña.",
    "timestamp": 1762383600
  },
  {
    "username": "CitronFacile",
    "rating": 9.0,
    "comment": "Amazing two player game!",
    "timestamp": 1762210800
  },
  {
    "username": "Spineco",
    "rating": 9.0,
    "comment": "Best coop board game out there. Simple enough to be accesible. Complex enough to be challenging. Games are quick and exciting. Its just a wonderful idea brought to life thanks to amazing developers. Masterpiece!",
    "timestamp": 1762124400
  },
  {
    "username": "williamdmp",
    "rating": 10.0,
    "comment": "Any game I can play repeatedly with my Wife will always score high. Love the unique theme and gameplay. great replayability and varying difficulty with the different missions. There are surprising pockets of strategy that pop up with this game where you and your partner can make nice moves to be proud of. if you lose a round it's easy to reset. perfect game!",
    "timestamp": 1762383600
  },
  {
    "username": "Raffaelo",
    "rating": 10.0,
    "comment": "Just fantastic to play! Recommend everyone to play it with your friend or partner",
    "timestamp": 1762210800
  },
  {
    "username": "Bateyes",
    "rating": 10.0,
    "comment": "Geschenkt an Anna.",
    "timestamp": 1762210800
  },
  {
    "username": "davidxiang",
    "rating": 10.0,
    "comment": "好玩的，开飞机谁不爱呢",
    "timestamp": 1762124400
  },
  {
    "username": "RodimusPrime",
    "rating": 10.0,
    "comment": "This game is great because it is so thematic while having some good strategy too.",
    "timestamp": 1761865200
  }
]