[
  {
    "username": "lisiy50",
    "rating": 1.0,
    "comment": "Random game.",
    "timestamp": 1739228400
  },
  {
    "username": "Drenchoor",
    "rating": 1.0,
    "comment": "Ненавижу лавкрафта и связанные с этой тематикой игры. Казалось бы, не нравится - не играй, но все игры по его «вселенной» магическим образом всегда собирают вокруг себя миллион фанатов, не желающих больше ни во что играть.",
    "timestamp": 1736636400
  },
  {
    "username": "Ludwig3366",
    "rating": 1.0,
    "comment": "FFG prend trop ses clients pour des vaches à lait !",
    "timestamp": 1734562800
  },
  {
    "username": "uduhno",
    "rating": 1.0,
    "comment": "Cards in base game are bad and RNG drawing was awful.",
    "timestamp": 1691964000
  },
  {
    "username": "hrg1281",
    "rating": 1.0,
    "comment": "Terrible. Poorly written rule book. Terrible Mechanics. Bad map development. I loved Arkham Horror the board game and this one falls so short.",
    "timestamp": 1683756000
  },
  {
    "username": "JSMA",
    "rating": 1.0,
    "comment": "Hat uns gar nicht gefallen",
    "timestamp": 1680991200
  },
  {
    "username": "supersiamesisk",
    "rating": 1.0,
    "comment": "Play the RPG or not at all. A money sink at best.",
    "timestamp": 1675292400
  },
  {
    "username": "Gamil_",
    "rating": 1.0,
    "comment": "Terrible game, entirely based on unconstrained randomness (\"chaos bag\"), meaning you can draw the same automatic failure token a theoretically infinite number of times in a row. If I ever play this again, I'm throwing half of the chits in the garbage can. Simply incompetent design.\n\nAwful rulebook.\n\nInconsistent card layout/design.\n\nPremium price for mediocre components.\n\nArt is good.",
    "timestamp": 1670799600
  },
  {
    "username": "illusionDS",
    "rating": 1.0,
    "comment": "powercreeping ccg trash",
    "timestamp": 1661551200
  },
  {
    "username": "Hineni17",
    "rating": 1.0,
    "comment": "Played this multiple times both solo and with my gaming group and simply couldn't get into it. The artificial timer built into the decks forces a style of play that my group didn't enjoy. I understand Lovecraftian horror is a no-win situation in general, but as a game there should be some opportunity to succeed that is not based almost entirely on luck. Add in that online \"experts\" give zero advice for new players beyond buying a second set and \"getting gud\". My group found it easier to punt on this one in favor of more enjoyable games.\n\nFirst game I've ever bought and sold off after playing.",
    "timestamp": 1652652000
  },
  {
    "username": "erewegoagain",
    "rating": 1.0,
    "comment": "Too hard, constantly on back foot- a challenge is good but not when you get smacked about so often",
    "timestamp": 1641596400
  },
  {
    "username": "vinayplusj",
    "rating": 1.0,
    "comment": "The promise of LCGs was that customers would not be burned out with too many purchases and too many components to track. This superficial, defective, and bad product is a big drain on money with the component creep. Though the game plays best with 4 players, the base set can only accommodate 2.\n\nThe rules are too complex and vague. There are too many fiddly bits. With all the various cards and card types, there are also tokens which make outcomes more random. Definitely not a portable game.\n\nThere are much better alternatives even if you love the theme and setting.",
    "timestamp": 1633557600
  },
  {
    "username": "christhomas226",
    "rating": 1.0,
    "comment": "Can't seem to be gripped by the story, and without that connection the game falls apart for me. I read people say the core game is boring, but if you get the expansions, the game starts to shine. Sorry, but don't buy into the idea of spending more for the game start coming together.",
    "timestamp": 1630792800
  },
  {
    "username": "danamark",
    "rating": 1.0,
    "comment": "Nope...FFG product, strike one, Asmodee, strike two and three.\nLiving Card Game? Yeah, we making a good living off cranking this stuff out. Only need 1 core set, yeah, right.\n\nMore like a pricey subscription, a cable bill.\n\nAlso, like many of FFG’s games it feels right out of the box it needs expansions.\n\nFGG being in Asmodee's control, one can expect high artificial over priced MSRP, with a fixed, limited discounts, no, will pass. No fan that only a few big high volume online retailers seem to get their products. Why is that? Forcing pressure on the rest of the retailers to drive them out of business? Would make sense if local game shop protection is what you seek?\n\nJust better ways to drop what it takes to keep it going, replay isn’t there without it.",
    "timestamp": 1618178400
  },
  {
    "username": "Arcantor",
    "rating": 1.0,
    "comment": "Honestly, I don't understand how anyone can think this game is great, because it's just shallow, flawed, and poorly made in so many ways.\n\nI don't want to spoil, so here's just spoiler-free criticism (there's a lot more criticism though!):\n\n3 of the included investigators are simply not playable! It's simple math: If you get 2 damage per round from an opponent and only take 5 damage yourself, but conversely you need 3 rounds to kill the opponent....WTF?\n\nDeckbuilding? Absolute exaggeration! There are so few different cards in here, and they are so repetitive, that it doesn't deserve the term deckbuilding at all. There are far better ones on the market!\n\nAnd finally: it's an absolute game of chance. Whether you make it to the second scenario (if you have chosen the right investigator and survive the first scenario) is a matter of luck. Buy dice and think of a shallow story around it, it's 10 times cheaper and has the same level of this \"game\".",
    "timestamp": 1614898800
  },
  {
    "username": "floyd_revolution",
    "rating": 1.0,
    "comment": "***UPDATE 2021: I finally managed to play my way through to the end of this trashfire. Never have I encountered game design that is so lazy, so unplaytested, and harboring so much contempt toward the players. This game is in desperate need of streamlining, or better yet, set it all on fire and start again from scratch, or better still, don't, just make a different game entirely. Absolute waste of time, I will never buy another FF game. ***\n\nI keep getting burned by Fantasy Flight trash. This is the fourth FF boardgame I've played, and while it isn't atrociously bad (I changed my mind, it is) like the others (Arkham Horror, Mansions of Madness, Runebound), it is definitely extremely mediocre. I feel like I've completely wasted my time after every game I play. It gets one more play, just so I can say I can completed all the scenarios (base game), then it is getting ebayed.\n\nSIDE NOTE/ How the hell is this rated as the #1 customisable game? People think this is more customisable than Magic the Gathering? What a joke.",
    "timestamp": 1613602800
  },
  {
    "username": "olivier78860",
    "rating": 1.0,
    "comment": "Needs rule rewritten to make it playable",
    "timestamp": 1609023600
  },
  {
    "username": "wingnut338",
    "rating": 1.0,
    "comment": "Core game is more boring than cutting yourself with a 52 card deck.",
    "timestamp": 1608246000
  },
  {
    "username": "JustAQuestion",
    "rating": 1.0,
    "comment": "Left me puzzling, what people like about this game... I really like games with story! But 5 enemies and 3 cards with each two sentences on is not a story at all.\nThe rulebook is horribly written, no chance to feel something like joy in your first game, because you have to study the book 2h and even then you waste another 40m with looking up some bull**** while you're playing the game for the first time. Felt like hard work. Not because it's strategically demanding but because you have to work through 15 pages which felt like 50.\n\nThe day before I played Brass Birmingham for the first time and the rulebook was easy to learn in just 30m although it's strategically much more demanding.",
    "timestamp": 1599256800
  },
  {
    "username": "Kvonville",
    "rating": 1.0,
    "comment": "Base plus some of the Dunwich Horror expansion.\n\nHonestly have never bothered to finish the first three scenarios from the base because the game flows so poorly, difficulty ramps so suddenly, and I don't understand how this is considered a game. It isn't even fun getting stomped on like Arkaham/Eldritch Horror can be, you know when you get a couple of bad breaks in a row and rapidly go from on top of the world to defeated. No the card game is death by a thousand cuts which you see coming from miles away. For example fighting a monster with a absurd amount of health knowing that it is LITERALLY impossible to defeat. Even with the best weapons you might do 2-3 damage, but are receiving 2-3 damage each round. Simple math tells me I am going to lose this exchange when it has X health and I have X-4. I guess I should just resign myself to always having to you know resign, but how is that fun? Constantly knowing that the best I can do it hopefully not die and leave the game early and ready the crap ending?\n\nAll of that being said I love the actual board games, especially Eldritch Horror.\n\nEdit: I literally gave this game away after a few more tries, downgraded fro 3->1",
    "timestamp": 1596146400
  },
  {
    "username": "TheSwoleNerd",
    "rating": 1.0,
    "comment": "TRADED",
    "timestamp": 1586815200
  },
  {
    "username": "pulla",
    "rating": 1.0,
    "comment": "Rating down 9 -> 5 (previous from 7-2017). While I initially like tha game, after playing \"Night of the Zealot\" halfway we just keep every scenario. This game is just too random, and too hard. Even with just standard difficulty and very good players.\n\nI don't recommend Arkham Horror: the Card Game.\n\nRating down 5 -> 2. Terrible and random game.",
    "timestamp": 1549666800
  },
  {
    "username": "Lowpass",
    "rating": 1.0,
    "comment": "Unacceptable price structure. With the already completely overpriced core set, you can't even play the first cycle. You need to buy another completely overpriced expansion first.",
    "timestamp": 1539640800
  },
  {
    "username": "coralsaw",
    "rating": 1.0,
    "comment": "A good game, but I cannot condone any more the predatory practices of FFG, and their attitude towards hobby gaming. The core game offers zero possibilities to deckbuild (a central mechanism of AHtcg), and you can only play some pairs of the provided investigators due to lack of provided cards. Considering that this is a card game, and that they likely get their cards for dirt cheap prices, this is even more infuriating. A second deck of cards would have cost them almost nothing. An insert would have also cost them just a little. Heck, they don't even provide baggies... Instead, they chose to sell you another product, a box to properly fit all cards, together with the thin \"nightmare decks\". What rubbish...\n\nThis is lack of respect. Pass hard, there are so many equally great games from companies that respect you as a consumer and the hobby in general.",
    "timestamp": 1536616800
  },
  {
    "username": "Sherub",
    "rating": 1.0,
    "comment": "La démo,d'un jeu potentiellement bien mais à quel prix.Le contenu de cette boite est bien insuffisant.",
    "timestamp": 1510268400
  },
  {
    "username": "Thomas Beach",
    "rating": 1.0,
    "comment": "Just for Smjj.",
    "timestamp": 1504735200
  },
  {
    "username": "Mimicracra78",
    "rating": 1.0,
    "comment": "This token's mecanic is so bad ....",
    "timestamp": 1486076400
  },
  {
    "username": "Jedit",
    "rating": 1.0,
    "comment": "Utterly random bullshit. Even the tutorial scenario is frequently made impossible by random chance.",
    "timestamp": 1480806000
  },
  {
    "username": "xen911",
    "rating": 2.0,
    "comment": "Not for us.",
    "timestamp": 1754172000
  },
  {
    "username": "iamDragoncat",
    "rating": 2.0,
    "comment": "I tried to like this game, I really did. It is just too punishing. There is no satisfying moments here. Despite the cool scenarios, drawing from the encounter deck is just too much. Every turn you have to deal with some bullshit coming your way in addition to everything else that's happening in the scenario. And yet, not even winning feels good, but more like a push and an undeserving win.\n\nAnd the whole game being a card collecting game, with so many expansions that cost large amounts of money, this game is definitely not worth it in my book, and I am thoroughly disappointed by it.",
    "timestamp": 1745704800
  },
  {
    "username": "jyhuh35",
    "rating": 2.0,
    "comment": "취향 탓인지 아무리 해봐도 재미를 모르겠다",
    "timestamp": 1739660400
  },
  {
    "username": "A_Rebours",
    "rating": 2.0,
    "comment": "Own the base game, the complete Dunwich Legacy, Curse of the Roogaroo & Carnevale. Played the base game and the first four scenarios from Dunwich Legacy before giving up.\n\nWhat an obnoxious, unpleasant little game. The narrative component is pedestrian at best and full of holes and absurdities, chief among them being the underlying system of deck building (now wait a minute, I know I packed in that lightning gun somewhere, now where on earth could it be...). What exactly is it that you are doing with the \"resource\" action in the middle of nowhere? It's not so much that you have to fill in the gaps created by the abstractions in the design, it's more that the level of absurdity precludes you from doing so. So the game essentially boils down to a series of annoying little optimization puzzles tied together by a little bit of blurb at the beginning/end of each scenario. The narrative is not emergent, it's tacked on.\n\nThere is no immersion since you're focusing on a bunch of mechanisms that basically take you away from the story, and the rules are so full of holes and so utterly disorganized (literally nothing is where you would expect to find it) that well into your fourth or fifth scenario, you will still have to stop the game now and again to check something that's not covered in the learn to play booklet. It's impossible to learn the game beforehand because the \"learn to play guide\" is incomplete, and the \"rules reference\" booklet is organized alphabetically (and also incomplete, albeit a little less so than the other booklet). Since each scenario has very limited replayability (I see none at all, but I am told otherwise), it's not a trivial point that the experience has to be spoiled by the sheer carelessness of FFG's rule writers. It's not a complicated game, it didn't have to be so sloppy.\n\nIt's no fun to lose (which will happen a lot), and it's even less fun to have to go through the motions of playing the same scenario multiple times since the puzzles are not even that interesting once you know the layout of the locations and the composition of the deck. You can always accept the \"no resolution\" a.k.a \"you're dead\" resolution, but how satisfying is that? I'm dead but my character somehow comes back from the grave to fight another day?\n\nThe game I hear is all about investing mountains of cash so that you can unlock its deck-building aspect, which apparently is crucial to enjoyment. Well then congrats to FFG and everyone involved for a monumental cash grab that would do Games Workshop proud.",
    "timestamp": 1734130800
  },
  {
    "username": "metapone",
    "rating": 2.0,
    "comment": "Play 1 solo games with GM assist (whole campaign), 1 2-player game (halfway through part 1 of an expansion campaign about the Arctic?), and 1 solo game (finished the campaign). The theme isn't bound to the mechanic much (everything boils down to GET CLUES), the fighting mechanic is fiddly, the story is bare bone and cliché, and it's hard when you always have to recheck which location has a far reach connection to another location (this is the part where I appreciate the \"board\" in \"board game\"). Action economy is tight and everything is basically a huge miserable math works.\n\n1-2 players.",
    "timestamp": 1717279200
  },
  {
    "username": "dancj",
    "rating": 2.0,
    "comment": "You are with a monster.\n\nHit it. Draw token. Fail.\n\nDraw token. Fail.\n\nDraw token. Fail.\n\nI want to leave - I can’t because I’m with a monster.\n\nHit it - draw token - succeed!\n\nBut it’s not dead yet.\n\nDraw token. Fail. Draw token fail.\n\nDraw token. Succeed. It’s dead!\n\nAnother monster has spawned.\n\nRepeat ad infinitum.\n\nShite.",
    "timestamp": 1716069600
  },
  {
    "username": "Marcsalty",
    "rating": 2.0,
    "comment": "Cull\n\nAll blinged out",
    "timestamp": 1713304800
  },
  {
    "username": "Dat_Scharger",
    "rating": 2.0,
    "comment": "Sorry. Neither the theme, the gorgeous art, nor the deckbuilding can change that this is an RNG-fest using chits as fancier dice. Most of the time your success comes down to luck, and if you would simply leave the luck-elements out... then what's left?\n\nI would certainly enjoy it more if it would exist as a digital game since that would also take care of bookkeeping and setup. However, that still wouldn't fix the gameplay. It's like a crappy roguelike with too much emphasis on RNG that doesn't make sense thematically. Also, even the greatest story gets dull if you have to experience it multiple times due to you failing multiple times. That's exactly why people think that the Roguelike-nature of Sunless Sea/Skies holds those games back. Sold it.",
    "timestamp": 1703631600
  },
  {
    "username": "Amraam555",
    "rating": 2.0,
    "comment": "Played over a week with the core set, but I could not get into and in the end, did not like at all. Gave me a headache after playing. Solo card game such as this and Lord of the rings are not my thing at all. Cool concept and easier mechanics than LOTR, but I very much dislike! Sold away for someone else to enjoy.",
    "timestamp": 1700434800
  },
  {
    "username": "zerratt90",
    "rating": 2.0,
    "comment": "Honestly was dissapointed, I owned Arkham horror 2nd ed. and, when compared, card game seemed primitive and two dimentional. Tried a couple of times and happily got rid of it. Sorry.",
    "timestamp": 1697666400
  },
  {
    "username": "Boards of Games",
    "rating": 2.0,
    "comment": "Not today satan!\n\n-a lot of fiddling in setup and sometimes gameplay\n\n-2 rulebooks, yet rules seem to be all over the place.\n\n-deep investment in money and time\n\n-very fidgety\n\n-one million things to keep track of...\n\n+ CoC!",
    "timestamp": 1691532000
  },
  {
    "username": "igroteka",
    "rating": 2.0,
    "comment": "Nope!",
    "timestamp": 1687125600
  },
  {
    "username": "SamuelTookus",
    "rating": 2.0,
    "comment": "Forgive me. I normally do not post game reviews, but I feel moved to write this one.\n\nAs God is my witness, I will never understand the froth and hype for this game. This game is undoubtedly one of the worst Lovecraft-based games, if not one of the worst games, in general, I have ever played.\n\nThe ONLY positive is the artwork. The game is pedantic and slow. Any narrative is accidental. Essentially, players are following little symbols and pulling from a bag of chance that is heavily weighted against the players. Now, let me clarify. A challenging game is a good game. This game isn't that. This game is consistent and tiresome player-loss and scenario re-do's until the players accidentally succeed...via chance bag draws. This game is not only \"not fun.\" It is the opposite of fun.\n\nIt's awful. Truly bad.\n\nAvoid it.",
    "timestamp": 1670454000
  },
  {
    "username": "Janasik",
    "rating": 2.0,
    "comment": "The cardplay didn't grab us. It seemed too heavily decided on the luck of the draw for how much effort we had to put into learning it. The story was well written, but if that was my focus I would just play the CoC RPG.",
    "timestamp": 1664661600
  },
  {
    "username": "ndecarie",
    "rating": 2.0,
    "comment": "Not a fan. The board you 'walk around on' is just more cards. Could've been a board, and would've been much better.",
    "timestamp": 1660600800
  },
  {
    "username": "Kunysz",
    "rating": 2.0,
    "comment": "Other Arkham Horror games are just better expirance",
    "timestamp": 1658268000
  },
  {
    "username": "Zohren",
    "rating": 2.0,
    "comment": "I don’t understand how this game is rated so well. It’s overly complicated to learn, it feels like it wants to be a board game, but elected for a card format for… reasons?\n\nThese things would be forgivable if the game were at least fun, but it’s not. With the “standard” Chaos Token set, 75% of the tokens are negative outcomes, and 12.5% are neutral, meaning that you often have to overcompensate with resources to avoid failing too often, making the game ridiculously difficult on just the “standard” difficulty.\n\nThe deck building aspect is mediocre at best, and the storyline is uninspired (though not bad.)\n\nYou never have any turns where you’re like “Heck yeah, that was awesome” but have plenty of turns where the layers of randomness can (and will) just absolutely obliterate you. There’s randomness in your deck, the encounter deck, and all the skill tests, but no randomness to monster attacks/damage.\n\nJust not a fun game. Go play Gloomhaven instead. Also complicated, but actually fun and strategic with actual choices.",
    "timestamp": 1639177200
  },
  {
    "username": "AltruisticLatte",
    "rating": 2.0,
    "comment": "I’m sorry, I do not understand the hype. I have no idea how this is so highly rated. Mind that I play games like MtG and am no stranger to deck building games. I was excited at the idea of the game but there’s too many issues with little joy to experience in the gameplay. There’s too many mechanics and pieces? But somehow there’s not enough pieces? If you don’t have a set of D&D dice (maybe even 4 sets) for tracking damage and ammo. The location board is too convoluted. For a card game you’re going to need a LOT of real estate to lay everything out. There’s little to no hope for success, which is what some people find fun about this game, but not me. We played 3 scenarios and didn’t enjoy any of it. Tried to give it a fair chance. If you have a way to borrow this game or play it at a board game cafe or something, do that first! Don’t spend your money until you know you’ll enjoy it.",
    "timestamp": 1639177200
  },
  {
    "username": "mlembeck",
    "rating": 2.0,
    "comment": "Short and expensive, don't know how it go this high in the rankings.",
    "timestamp": 1637708400
  },
  {
    "username": "ziph4",
    "rating": 2.0,
    "comment": "The artwork is beautiful, the storyline is exciting. The game mechanics is too often unimaginative. For example, \"finding a clue\" simply comes down to moving your investigator to a room where there are clue tokens and performing a skill check. No explanation is given what this \"clue\" is, no intellectual effort was required.\n\nWhat bothers us most, however, is that the game is unnecessary complex. Not enough design effort went into streamlining the game. Symbols and keywords are often poorly chosen. As a result, too much of the playing time is spent on flipping through the rulebook. I find it quite amazing that a game designer thinks he has done a great job when players need a 16-page learn-to-to-play book, a 30-page rules reference (the one you consult most) and a 7-page scenario-book to play the game.",
    "timestamp": 1633816800
  },
  {
    "username": "fatpie42",
    "rating": 2.0,
    "comment": "I wanted to love this, but the rulebook is horrendous and the gameplay is frustrating.",
    "timestamp": 1629583200
  },
  {
    "username": "stacie_everdell",
    "rating": 2.0,
    "comment": "This is a new purchase. I haven't broken the seal yet. Waiting for a quiet weekend to get into this gem.\n\nUpdate I: I'm two plays into the first two scenario of Night of the Zealot. I'm still trying to get all the rules down, but I'm enjoying myself. I like how the story unfolds, round by round. How there is a clear time tracker and you have to decide whether to push on or quit while you're ahead.\n\nUpdate II: I like experiencing the story more than the actual game play. Instead of moving along in a nice pace to try and solve the mystery, you are stopped every step of the way with another monster that you must fight or take on injury. You never really get a flow going, unless you consider fighting monsters a flow. Want another clue?, fight another monster. Turns out, this type of mechanic is just not my cup of tea. It's a shame, I like the story unfolding and the art is wonderful, dark but fittingly so. This, coupled with the fact that it is quite an expensive endeavor, has led me to wanting to sell or trade this one.",
    "timestamp": 1621029600
  },
  {
    "username": "cledo",
    "rating": 2.0,
    "comment": "Solo",
    "timestamp": 1613775600
  },
  {
    "username": "Agile_Drunk",
    "rating": 2.0,
    "comment": "Tried playing multiple times with varying difficulty settings and despite wanting too I just can't enjoy this game.\n\nIf you enjoy losing to odds stacked against you coupled with heavy negative RNG then this game is for you\n\nonly 2 stars because the art and theming are cool",
    "timestamp": 1613430000
  },
  {
    "username": "DSix",
    "rating": 2.0,
    "comment": "Money pit. Base box isn't even fully playable 2p you have to get a second one. And that's barely the beginning...\nForget about it, even if the game is nice, its real price is delirious.",
    "timestamp": 1610578800
  },
  {
    "username": "CrumpledFish",
    "rating": 2.0,
    "comment": "If i learned nothing else from my experience with this game, it's that deck construction is not a game mechanic that I like. That said, I played the original scenario with the suggested decks, and it was a trainwreck. In two games, I was destroyed before making it even halfway through the scenario due to poor pulls from the bag. Maybe the luck component can be mitigated with better decks or in future scenarios, but that was enough to turn me off the game.",
    "timestamp": 1609887600
  },
  {
    "username": "Foufoumoro",
    "rating": 2.0,
    "comment": "What a disappointment.\nI really don’t understand what the fuss was all about with this game.\nI’d rate it at about 3/10 if it wasn’t for the scammy economic design of the game. 35€ for only a few hours of gameplay, with ... numerous 30€ expansions with 15€ chapters (with a few dozens cards, lol). Basically what an obvious game with dlc scam design is in video game. They could have included all the expansions and chapters in the base game (wonder how the box is so big with so few content and basically no materials? Answer is easy: only one third of the box is used. ) to make it worth your money, but they had it all figured out: release scenarios and chapters at a later date, fully priced, so people need to spend ~200€ to have all the expansions and chapters.\n\nOk now with the game in itself: 3/10\nNot that bad of a game;\nDefinitely some fun to be had in some parts of a game. Coop part of the game is okay.\nDeck building would be okayish if you had more cards to chose from in the base game (about 15 cards you can add to your deck, that’s very few).\nReplayability is terrible. Of course you can start over with different characters if you feel like you failed your campaign. But overall once you played the single campaign you paid 40 € for, in about 10-15 hours max, most of the fun will be gone by already knowing what will happen. But you might want to try a different conclusion, which might add some depth to the game.\n\nThematic is not my favorite, but I guess lovecraft lovers will enjoy.\n\nOverall a huge deception, and an obvious scam when it came to the dev strategy of releasing the game with numerous fully priced expansions later on.",
    "timestamp": 1605654000
  },
  {
    "username": "celiborn",
    "rating": 2.0,
    "comment": "I keep giving this game a try because of fans' promises of its narrative and excitement, but the basic gameplay loop seems really dull to me? And the hand management / card play side of it is not that interesting since it's all about maximizing your rolls. I may not be suited for these Arkham-type games.\n\n11/16/20: 5 -> 2. I just don’t like this system. The mechanics and use of cards are very inventive (esp in Carcosa), but I find the game very tedious and random and not fun at all. Would be better as just a computer game!",
    "timestamp": 1605567600
  },
  {
    "username": "jbwilding13",
    "rating": 3.0,
    "comment": "Played once and sold it the next day. Just not my cup of tea.",
    "timestamp": 1752616800
  },
  {
    "username": "dtmoney75",
    "rating": 3.0,
    "comment": "1 Play\n\nPlayed at: 4",
    "timestamp": 1749852000
  },
  {
    "username": "JeffPreston123",
    "rating": 3.0,
    "comment": "Lovely artwork for the characters and environment. Great theme. Hideous rules. Awful rule presentation. Dreadful graphic art for symbols on cards, which required the use of a flashlight and magnifying glass to read them for this veteran gamer.\nI know a great number of people like this game, but my wife and I played it for about 5 hours and then simply came to a point where we could not follow what was supposed to happen next, and being as both our characters were within moments of dropping stone dead anyway - we packed it up and have never reopened it since. I've played games with many scores of pages of rules and dozens of games of Advanced Squad Leader (very, very long rules), but this one was a mess in my opinion.",
    "timestamp": 1747951200
  },
  {
    "username": "MorelliBuendia",
    "rating": 3.0,
    "comment": "It's very narrative and immersive, but that's just not my thing. I'd rather just read a book (and I like Lovecraft a lot). It doesn't have a lot to it gameplay wise, and I'd rather have a game that allows me to improve my deck within the session, as opposed to before and after the scenario. I guess LCGs are not my thing, which is good, because they are ridiculously expensive. I don't think I would have the patience to play this solo, and as for a 2p game, I prefer competitive play.",
    "timestamp": 1745359200
  },
  {
    "username": "deTobn",
    "rating": 3.0,
    "comment": "Never played. The cards + texts are too small.",
    "timestamp": 1743890400
  },
  {
    "username": "ncc1701jv",
    "rating": 3.0,
    "comment": "Really enjoyed this. Wife did not. Do not want to spend the $$$ on collecting it.",
    "timestamp": 1738450800
  },
  {
    "username": "gameunderprotest",
    "rating": 3.0,
    "comment": "Wait- so you want me to pay another 75 bucks to play more scenarios completed by buying another box and 6 mythos packages. The original game wasn't worth that why would I double my investment.\n\nKeep going back and trying it again but just can't seem to care about the characters, gameplay or setting.",
    "timestamp": 1733526000
  },
  {
    "username": "ninqt",
    "rating": 3.0,
    "comment": "I used to like this game alot when I was about 19-20, I do not really like it anymore. I don't really like co-ops with the whole do some things then draw a scary bad card gameplay.",
    "timestamp": 1732489200
  },
  {
    "username": "gameyoda",
    "rating": 3.0,
    "comment": "Bought this as a solo game and there's too much admin for me to enjoy.",
    "timestamp": 1728770400
  },
  {
    "username": "sykano",
    "rating": 3.0,
    "comment": "doesn't appeal at all\ndoesn't make sense concept-wise (card deck mechanic doesn't fit the H.P.Lovecraft Horror investigator setting)\nstory-driven\nno replayability\nextremely expensive (you need x core sets to play with more than 2 players or in some constellations even for 1-2 player, expensive expansions, ...)\n\nbag of tokens as randomizer sucks",
    "timestamp": 1728684000
  },
  {
    "username": "bway",
    "rating": 3.0,
    "comment": "There is a ton of Arkham horror themed games. If you are looking for that theme I would go with eldritch horror or mansions of madness instead. This deck builder is ok, but I had some issues with the pacing (seems like you allways have to rush the objective and have little time to build your deck). You are often just waiting to draw the right card to do what you need to. And laying out a grid of cards for locations just doesnt have the grand feel of connecting tiles or using a world (board) map.",
    "timestamp": 1728511200
  },
  {
    "username": "LMoriggan",
    "rating": 3.0,
    "comment": "Repetitive, while somehow tediously frustrating all at the same time; overcomplicated interactions without any true variance in these elements.\n\nI much prefer Eldritch Horror although that is not a card game. I prefer multiple other card games to this.",
    "timestamp": 1727733600
  },
  {
    "username": "Martynking3",
    "rating": 3.0,
    "comment": "Very boring.",
    "timestamp": 1727128800
  },
  {
    "username": "lecarottin",
    "rating": 3.0,
    "comment": "Don't really like it but I have it",
    "timestamp": 1725746400
  },
  {
    "username": "petchd",
    "rating": 3.0,
    "comment": "Trade/Sell",
    "timestamp": 1721253600
  },
  {
    "username": "janus23",
    "rating": 3.0,
    "comment": "Super overrated game, very repetitive and stupid gameplay. The game is actually only carried by the theme and its many fans. It's actually like a good book or novel - if you're into that genre. In an objective comparison with deckbuilding games like Dominion, Paleo or Magic, this game is clearly inferior in terms of gameplay, fun and variety of decisions.\n\nThe fact that this game ranks higher than Paleo, Dominon or Magic once again clearly shows that the ranking at bgg is still a GEEK ranking and not an objective ranking of the really best games. If you want to play a really tough, cooperative adventure game with a variety of decision-making options and a great story line, then play Robinson Crusoe.",
    "timestamp": 1712008800
  },
  {
    "username": "billharr",
    "rating": 3.0,
    "comment": "Not too good",
    "timestamp": 1708124400
  },
  {
    "username": "suufo",
    "rating": 3.0,
    "comment": "It's been a while since I've delved into the \"Ameritrash\" fiddly, rulebook heavy games. This one was worth it though, combat was difficult but satisfying. Interesting decision and nail-bitingly outcomes make for a tense experience.",
    "timestamp": 1705273200
  },
  {
    "username": "LukaszLozz",
    "rating": 3.0,
    "comment": "What is that?\nWeak euro which is hiding behind quasi mistery or history?\nCollect two resources in some limited time.\nNever again...",
    "timestamp": 1700780400
  },
  {
    "username": "Jemaima",
    "rating": 3.0,
    "comment": "Мне это совсем не понравилось. В базовой версии вы можете собрать только две колоды, и только определенных детективов. Для того чтобы играть полноценно, вам нужно купить как минимум два дополнения с детективами. В это сложно и неинтересно играть",
    "timestamp": 1698620400
  },
  {
    "username": "kisgen",
    "rating": 3.0,
    "comment": "Randomness kills it",
    "timestamp": 1697752800
  },
  {
    "username": "kevan",
    "rating": 3.0,
    "comment": "I like the legacy-as-deckbuilding a lot, allowing only a little alteration between games, and mechanically it seemed an enjoyable enough co-op puzzle, if a bit wearying when you hit an obviously unlucky draw. Less convinced about having spent £25 on a game that's deliberately not very replayable with only three rounds of legacy in the box, though.",
    "timestamp": 1684706400
  },
  {
    "username": "jjamiee",
    "rating": 3.0,
    "comment": "Relies too much on randomness drawing from the token bag. I'm sure the system is versatile from scenario to scenario, but I can't bother to finish the first one.",
    "timestamp": 1684188000
  },
  {
    "username": "PainkillerMix",
    "rating": 3.0,
    "comment": "Случайность слишком случайна. Приход карт случайный, действий мало, жетоны случайные, выход карт контактов случайный. Больше никогда не сяду в это играть.",
    "timestamp": 1680991200
  },
  {
    "username": "MangoBingo",
    "rating": 3.0,
    "comment": "Multiple layers of RNG in a very challenging game. Gameplay feels very luck driven and often leaves my party unsatisfied and dejected. Nothing worse than playing for 2 hours and losing because I pulled the wrong chip out of a bag.",
    "timestamp": 1678921200
  },
  {
    "username": "HackFin",
    "rating": 3.0,
    "comment": "The same all over again. And yet again I am disappointed - I don't know why I keep trying out Lovecraft inspired \"games\". Randomly go crazy or randomly die in a mediocre scary story. Does that even qualify as a game? Not sure.\n\nArtwork is the only good thing I can say about this game.\n\nAnd yes, I am salty. Actually pretty angry after falling again for BGG ratings and generic youtube toplists.",
    "timestamp": 1673910000
  },
  {
    "username": "Fuzzel",
    "rating": 3.0,
    "comment": "Ist okay, aber auch sehr glückslastig durch das Karten und Plätchen-Ziehen aus dem Säckele. Durch den Chaos-Sack kann es passieren, dass man - obwohl alles richtig gemacht wurde oder eine perfekte Kartenhand vorhanden war - verliert und unverschuldet in eine Verlierer-Spirale gerät... Auch das Begegnungsdeck kann sehr unfair sein und einem eine sehr gute Position zerschießen, was sehr frustrierend ist.\nAnsonsten das gleiche Spielprinzip, das man schon aus dem ah brettspiel kennt: rumrennen, proben machen um clues zu bekommen, mit den clues an anderen Orten andere proben machen. zwischendurch proben, um gegner zu bekämpfen oder sich zu bewegen....\nSehr lange Auf- und Abbauzeit. Das Setup dauert länger als das Spiel. Unzählge Karten müssen immer wieder gesucht und in\nDecks zusammengestellt werden. Sehr auswändig\nSehr gehypet und überbewertet, wie m.M. die komplette \"Arkham Horror\" Reihe von FFG; Arkham Horror, Arkham Horror Kartenspiel, Edritch Horror, Elder Sign, Villen des Wahnsinns ... allesamt mit unzähligen Erweiterungen, die das Spielprinzip aber nicht wirklich nachhaltig verbessern. Nach wie vor sehr teuer in der Anschaffung.\nFazit nach \"Nacht des Zealoten\" und \"Dunwich 1\": Es macht einfach keinen Spaß. Es fühlt sich die ganze Zeit über unfair an und völlig irrelevant, welche Aktion man ausführt.\n(T.)",
    "timestamp": 1673305200
  },
  {
    "username": "Argus3",
    "rating": 3.0,
    "comment": "This game is plain boring.\n\nIf you have item x in room y it automatically triggers a reaction, no try and error.. boring\n\nI dont understand the hype to be honest.",
    "timestamp": 1672441200
  },
  {
    "username": "SecretSauce275",
    "rating": 4.0,
    "comment": "I wanted to like it but is is a pain to set up and play solo. True solo is just so hard on you. When you build a fighter and run into a scenario where you need to find a lot of clues.\n\nMultihanded is just tedious. But i think the game is meant to have a team with a diversified skill set.\n\nPlayed base game and first three scenarios Dunwich.\nFelt obliged to play the entire cycle which I had purchased in a buying frenzy after getting hyped by some videos / podcasts.\n\nJust cutting it off is the best thing I can do.\n\nNo one to blame but myself.\n\nTo the people praising this game: WTF...",
    "timestamp": 1756418400
  },
  {
    "username": "CrabHermit",
    "rating": 4.0,
    "comment": "Supposedly better with expansions. All deck building advise comes down to \"buy expansions or additional sets\". The random failures or wins escalate, leading to the game either feeling very easy or completely impossible",
    "timestamp": 1755036000
  },
  {
    "username": "Gregram",
    "rating": 4.0,
    "comment": "Nothing here worked for me really. Story was not that interesting. It felt like one of those fantasy/scifi shows with low budget that rely on some charismatic actor or trope that's trending atm. As long as you binge watching it it's fine but when you take a break and get back suddenly all the bad things start to pop and watching becomes cringey. Combat using tokens in the bag is interesting idea as they can be modified from scenario to scenario but if I play 3 best cards and still can loose it's just too random. I get failing is part of the solo game and Cthulhu theme but here it felt really bad for me.",
    "timestamp": 1751925600
  },
  {
    "username": "lililililil",
    "rating": 4.0,
    "comment": "Deckbuilder, the endless stream of negative events is frustrating.",
    "timestamp": 1747432800
  },
  {
    "username": "Zinabi",
    "rating": 4.0,
    "comment": "Sold as tastes changed",
    "timestamp": 1746482400
  },
  {
    "username": "quoopquoop",
    "rating": 4.0,
    "comment": "Honestly whenever I tried this we were not entertained. Might have to revisit sometime in the future, but did not really enjoy.",
    "timestamp": 1744495200
  },
  {
    "username": "gildedrain",
    "rating": 4.0,
    "comment": "I really dislike Fantasy Flight card games. As much as they've tried to make them super thematic, the card game form factor ruins it for me and it feels super abstract and random.",
    "timestamp": 1740870000
  },
  {
    "username": "Beastly_Venturer",
    "rating": 4.0,
    "comment": "2 plays. Not as good a system as GoT but better than LotR LCG and pretty similar. Just not a big fan of these types of games. I've superseded such fare and my wallet feels much better because of this.",
    "timestamp": 1740265200
  },
  {
    "username": "zenworm",
    "rating": 4.0,
    "comment": "I wanted to love it, but the iconography made the set up way too fiddly.",
    "timestamp": 1739919600
  },
  {
    "username": "BlueMaxima",
    "rating": 4.0,
    "comment": "The deck construction being locked to one sphere, the chaos bag, and the random tests really just didn't work for me on this one.",
    "timestamp": 1736809200
  },
  {
    "username": "BangazBaroque",
    "rating": 4.0,
    "comment": "Spent a day reading the rulebook and learning the rules. Played the game and it felt so meh!",
    "timestamp": 1736377200
  },
  {
    "username": "Allenthar",
    "rating": 4.0,
    "comment": "The fiddliness and constant rulebook referencing really tanked my enjoyment of this game, but I can see why people really love it. I haven't gotten too far into it, but I'm hoping that Earthborne Rangers will give me more of the experience I was hoping to have from AH:TCG.",
    "timestamp": 1730329200
  },
  {
    "username": "Ed0r",
    "rating": 4.0,
    "comment": "i First thought i would Like this for the thematic and Story\nbut in the end i dont Like Deck builders and bag Pools (why Just Not use dice ameritrash Style?d3 d4 d6 d12s d20s and make this a dice fest?)",
    "timestamp": 1728511200
  },
  {
    "username": "Gehirnprothese",
    "rating": 4.0,
    "comment": "You really have to dig the narrative to enjoy this. The gameplay is heavily luck based and at best mediocre.",
    "timestamp": 1726264800
  },
  {
    "username": "b4heroes",
    "rating": 4.0,
    "comment": "The deck-building experience between scenarios is disappointing. It's also a very slow game bc you end up going to the rules reference glossary a lot.",
    "timestamp": 1715205600
  },
  {
    "username": "StoneCold002",
    "rating": 4.0,
    "comment": "Не понравилась, продано",
    "timestamp": 1708902000
  },
  {
    "username": "the_atlantean666",
    "rating": 4.0,
    "comment": "This is just silly from the first few csrds and evokes no sense of cosmic dread whatsoever.",
    "timestamp": 1706655600
  },
  {
    "username": "individyouall",
    "rating": 3.5,
    "comment": "Move, pick up items, roll dice. Boring.",
    "timestamp": 1705618800
  },
  {
    "username": "Daimler",
    "rating": 4.0,
    "comment": "LD. Ukr and Rus versions to ber released in 2018. Interesting and thematic gameplay, but heavily relies on scenarios (only one in base game). 2 copies of base games necessary to play with 3-4.\n_____________________________________________________\nFrom forums on buying path:\nI'd say a great way to maximize value would be:\n\nRevised Core (or 2 old core) -> Play.\n(Do I like it? If so, then)\nDunwich Investigators -> Try different investigators, or decks with your new cards with core investigators against the Core Scenarios/Campaign -> Play, Play\n(Do I feel like I need more scenarios?)\nDunwich Campaign -> Play, play, play some more.\n(NOW I know which I want more of - Player cards or a new Campaign - go with what you feel like from here on out, but go SLOW)\n\nsprinkle those Starter Investigator Packs anywhere above.\nAdd standalone scenarios later on in your journey - or if you have a specific use-case (i.e. you need a good one and done scenario)\nAdd something like \"return to\" boxes much later (or last) in your journey.",
    "timestamp": 1705273200
  },
  {
    "username": "andymanpants",
    "rating": 4.0,
    "comment": "I'm not the target audience for this game, so take this with a grain of salt, but I found Arkham Horror to be overdesigned and dry. The flavor is on point and I love what it does with the storytelling elements of the game, but that's the most I can say for it.",
    "timestamp": 1705186800
  },
  {
    "username": "blanket221",
    "rating": 4.0,
    "comment": "畫風有些可怕，小孩子玩可能會嚇一跳，遊戲規則有點難，透過牌組給的提示解開謎語！",
    "timestamp": 1704668400
  },
  {
    "username": "proplum",
    "rating": 4.0,
    "comment": "I really enjoyed the base box. It gets a little expensive for its content, and I don't feel the stories or the cards improve dramatically after the base box.",
    "timestamp": 1702162800
  },
  {
    "username": "Soulmirror",
    "rating": 4.0,
    "comment": "This is peculiar. I tried it out on a few occasions - and did not like the mechanics at all. It feels like a mercurial slog to get through the main plot-line.\n\nI am weirded out about not liking this. I have enjoyed similar \"gather up your deck to strengthen your character through multiple scenarios\" - kind of games such as the Pathfinder card games - all of them. Still, this just feels... undercooked, somehow shabby.\n\nI am willing to give this another shot, though. Maybe it was the company, heh.\n\nGranted, the most jarring part is the fact that one has to buy more issues to progress in any meaningful way - short of writing one's own adventures.",
    "timestamp": 1700866800
  },
  {
    "username": "mirror33",
    "rating": 4.0,
    "comment": "4.27.2020 -- played through intro mission. i'm open minded, seems neat enough, but not like interesting as a game perhaps, and so then what am i looking for? will check back in later.",
    "timestamp": 1694210400
  },
  {
    "username": "shoemoney",
    "rating": 4.0,
    "comment": "This was my first foray into an lcg-rpg-campaign-style board game. The permanent effect of character trauma was compelling, with Agent Roland Banks making it through the entire campaign only to end up so mentally scarred that any further adventuring would surely drive him over the edge. (Perhaps because librarian Daisy Walker intentionally engaged in battle with an Elder One so the team could have the time to send it back to its home dimension.) The overall story was adequate, connective tissue rather than a robust story with pacing and turning points, although the carry-over NPC elevated the narrative. The deck-building was limited but showed its potential for future campaigns. The mechanisms worked well, with a puzzley aspect to card combinations and teamwork, but this couldn’t compensate for the sameness to the majority of decision-making (namely, the skill checks). Ultimately, there was a procedural nature to each round, a dungeon-crawler aspect that isn’t for me. And deck construction outside the game doesn't really suit me, either. Caveat: the system is VAST, and there were a LOT of simple questions not answered in the rulebook, which made the learning more cumbersome than it needed to be.",
    "timestamp": 1693778400
  },
  {
    "username": "smallest_phetus",
    "rating": 4.0,
    "comment": "disappointing",
    "timestamp": 1691704800
  },
  {
    "username": "KhariYap",
    "rating": 4.0,
    "comment": "willing to give it another shot",
    "timestamp": 1689631200
  },
  {
    "username": "magicalkat1",
    "rating": 4.0,
    "comment": "I’m not a fan of deck building but my husband loves them so I’ll play with him.",
    "timestamp": 1688940000
  },
  {
    "username": "Lowengrin",
    "rating": 5.0,
    "comment": "Arkham Horror: The Card Game is somewhat similar to the earlier Cthulhu themed games from Fantasy Flight Games which initially I didn't particularly like and then learned to love, okay, enjoy. This one, however, I'm having a harder time with. I think it's because FFG have added more story through the campaign booklet and the act and agenda cards while at the same time removing the flavour that the older games have with encounter cards at each location. At the same time, they've reduced rolling a handful of dice to pulling a single token from a bag. All in all, the game is drier and more procedural than it's predecessors. Which, really, for me, isn't usually a bad thing. After all, I like Euros. And I like The Lord of the Rings: The Card Game. So I should like Arkham Horror: The Card Game. But I don't. Not really.",
    "timestamp": 1759701600
  },
  {
    "username": "HelgiSam",
    "rating": 5.0,
    "comment": "Hat uns überhaupt nicht gefallen. Verstehe den Hype nicht. Dazu ist es noch ein Geldgrab...",
    "timestamp": 1759615200
  },
  {
    "username": "AnalogSignal",
    "rating": 5.0,
    "comment": "Solo\n1-4 Players\n\nMedium-Heavy\n\nSleeved in Just Sleeves",
    "timestamp": 1759269600
  },
  {
    "username": "Ironclad_Board_Gamer",
    "rating": 5.0,
    "comment": "Ok",
    "timestamp": 1759010400
  },
  {
    "username": "Lemmingspawn",
    "rating": 5.0,
    "comment": "Feels too much like a choose your own adventure book with extra steps. I wanted to like it because I love the mythos.",
    "timestamp": 1758924000
  },
  {
    "username": "Iraperkins82",
    "rating": 5.1,
    "comment": "8/10: Really great game, almost always keeping. I may not suggest it all the time, but will never turn down a game.",
    "timestamp": 1758060000
  },
  {
    "username": "Noogs",
    "rating": 5.0,
    "comment": "I wanted to like this game more than I actually liked the game. The base box (with predetermined character decks) is fun and provides a nice narrative. But it’s short, and honestly not worth the price. But the promise of the game is there! I played through the base game twice, and was all set for a campaign. (Rating = 7)\n\nSo, I bought all the packs, got a nice storage system,… and came to realize that this is just a deck building game. That’s pretty much it. You look through a scenario deck (or give it a “draft” play through), build a deck for that scenario, see if it works, rinse and repeat. That’s the way you really need to play this. Me, I just want a prescribed character decks, and the ability to alter it in a way that narratively fun. That’s what the base game promised, but that’s not really what this game is. That felt like a bait and switch for me. (Rating dropped to 5).\n\nI get all the love for this game, but you need to enjoy deck building AS PART of playing the game. I don’t.",
    "timestamp": 1754863200
  },
  {
    "username": "Lisa_a_random_nerd",
    "rating": 5.0,
    "comment": "always drawing the same bad tokens. better solution in Gloomhaven Jaws of the Lion.\n\nSOLD / given away",
    "timestamp": 1754344800
  },
  {
    "username": "btasam",
    "rating": 5.0,
    "comment": "Our first game, the Ghoul Priest is chasing me down.\nEvasively dodging an attack, I cap off two shots in the process. My friend overcomes abandonment and proceeds to break his bat over the priest's skull. He turns to me and says, \"I just don't think I can live here anymore.\"\n\nArkham Horror: LCG offers an immersive experience, but one that was too expensive to consistently enjoy. Turned me off to FFG all together.",
    "timestamp": 1754258400
  },
  {
    "username": "uriul",
    "rating": 5.0,
    "comment": "Seems like something I could have rated much higher, but couldn't justify investment (in cost and time) for more content. Rating based on core campaign only.",
    "timestamp": 1754172000
  },
  {
    "username": "ztpirnat",
    "rating": 5.0,
    "comment": "2-Player",
    "timestamp": 1753480800
  },
  {
    "username": "magicmagic",
    "rating": 4.5,
    "comment": "To sell",
    "timestamp": 1753135200
  },
  {
    "username": "Deivid_861521",
    "rating": 5.0,
    "comment": "Maybe this is not the kind of game for me but I found no fun about many things in this game.\nFelt zero immersed in the story\nThe story is shallow for the amount of reading to setup and play\nThe action feels like no action at all\nI don't like the bag mechanic\nEvents are too disconected with the actual game situations and locations\nWeapons are unbalanced, most of then useless\nAnd so on...",
    "timestamp": 1752444000
  },
  {
    "username": "Cam5326",
    "rating": 5.0,
    "comment": "Played first campaign. There was some fun but it's very unsatisfying. I didn't feel like there was anything I could do to actually win. Too random",
    "timestamp": 1750284000
  },
  {
    "username": "ced1106g",
    "rating": 5.0,
    "comment": "No theme whatsoever. Removed the interesting Encounter cards from the Arkham Horror boardgame. Elaborate card-based skill check, with arbitrary randomizer (the Chaos tokens) tacked onto the end.\n\nThis might have worked as a cyberpunk game? Dunno.",
    "timestamp": 1749074400
  },
  {
    "username": "w33t",
    "rating": 4.8,
    "comment": "Really cool game. Rating may change due to my lack of plays. i havnt finished the first campaign yet, and will be trying to finish it up once i get back home. Fun game with interesting mechanics. Love how portable it is, but wish it came with a drawstring bag.",
    "timestamp": 1748383200
  },
  {
    "username": "Favjaro",
    "rating": 5.0,
    "comment": "Evergreen raffle donation 2025",
    "timestamp": 1746828000
  },
  {
    "username": "StormKnight",
    "rating": 5.0,
    "comment": "First play of this was fun. Second play, our characters seemed incapable of doing anything useful; a bunch of really useless abilities. \"Hey, I can evade monsters. What does this scenario require? Killing monsters\".\nTests seem very hard, even on easy difficulty, and I'm not fond of \"spend resources then see if it mattered\".\nExpansions are very customer-unfriendly.\n\n+co-op\n+Halloween",
    "timestamp": 1745532000
  },
  {
    "username": "Tall_man",
    "rating": 5.0,
    "comment": "Even though the game is knees deep in theme there are so many moving parts I keep thinking this is a board game that should maybe have been better as a book or a computer game.",
    "timestamp": 1745100000
  },
  {
    "username": "Gamsy",
    "rating": 5.0,
    "comment": "Something about playing this after having played 20+ Gloomhaven sessions just made it feel lackluster in comparison. It really is just a low score due to personal taste for my group. It's a well-designed game.",
    "timestamp": 1744495200
  },
  {
    "username": "gram_niebieskim",
    "rating": 5.0,
    "comment": "My BGG:\n10 - excellent game, always have a great time\n7 - enjoyable game, I'm willing to play again\n5 - not bad but it's not my cup of tea\n2 - won't play ever again",
    "timestamp": 1743717600
  },
  {
    "username": "ketchupandcabbage",
    "rating": 5.0,
    "comment": "TO SELL\n\nWeight: 3.54\n\nFrance",
    "timestamp": 1742252400
  },
  {
    "username": "Dalp",
    "rating": 5.0,
    "comment": "The old version base box is inadequate. You definitely need 2 of them to have some decent flowing play. Recently they changed it by releasing the REVISED set which is basically 2 old base boxes in one. Unfortunately, the scenarios in it still feels like a cheap trailer for an amazing movie. I would rate this game a 10 if you add at least 2 complete campaigns played together with a friend. It is indeed the most thematic tabletop game I have ever played.",
    "timestamp": 1742166000
  },
  {
    "username": "AmongFriends",
    "rating": 5.0,
    "comment": "Marvel Champions is just more accessible in this and it's more fun. Arkham Horror LCG has a narrative, although I argue the quality of that narrative isn't that much better.\n\nBut it also has a mechanic where you can just outright miss when you do something, an auto-fail, which is one of the most bothersome mechanics in gaming. The whole game is built around the auto-fail and it's such a feels-bad mechanic in everything.\n\nThe deck construction aspect is very fun though and is the best part of the game but the way you slowly move through your deck and might not even see all your cards is another negative. I just got new cards, let me play with them.\n\nIt's a good design but there's just too many bad design decisions that keeps bringing it down.",
    "timestamp": 1742166000
  },
  {
    "username": "dragon_liege",
    "rating": 5.0,
    "comment": "Basically a choose your own adventure card game. It really puts you in the game and can be played solo or coop. I look forward to buying the different adventures",
    "timestamp": 1741647600
  },
  {
    "username": "tscox87",
    "rating": 5.0,
    "comment": "A good game but I'm not sure it's a great one. Certainly much better than the board game. Game is a constant ominous dread that seems harder than it actually is. Campaign a bit short for the price. Solid but not a must own. I'm not sure the base set represents a very good value proposition.",
    "timestamp": 1741042800
  },
  {
    "username": "UndutifulCarrot",
    "rating": 5.0,
    "comment": "We didn't partake in the deckbuilding aspect, but with just the beginner set and without spending a big amount of money in order to customize, it just felt like an inferior version of Cthulhu: Death May Die. It shared a lot of similar concepts, but had an added resource gathering action in order to play your cards and didn't have the cool powers or fun of C:DMD",
    "timestamp": 1738969200
  },
  {
    "username": "B_Moores",
    "rating": 5.0,
    "comment": "It was okay but didnt grab me.",
    "timestamp": 1736722800
  },
  {
    "username": "E78990",
    "rating": 5.0,
    "comment": "Would love to get into it",
    "timestamp": 1735686000
  },
  {
    "username": "blahblahginger",
    "rating": 5.0,
    "comment": "This game is not for me. Something about it just did not click. Bought, played a couple of times (solo) and returned.",
    "timestamp": 1734390000
  },
  {
    "username": "Mamjor",
    "rating": 5.0,
    "comment": "Splendide visuellement, mais beaucoup trop punitif. Peu de plaisir.",
    "timestamp": 1731106800
  },
  {
    "username": "Janneman96",
    "rating": 5.0,
    "comment": "Jan",
    "timestamp": 1728511200
  },
  {
    "username": "piett2k",
    "rating": 5.0,
    "comment": "Best (coop) card game ever, cant wait for expansions",
    "timestamp": 1728338400
  },
  {
    "username": "snth",
    "rating": 5.0,
    "comment": "One of the biggest regret buys I have ever made. I spent so much money on it but it's so boring.",
    "timestamp": 1727992800
  },
  {
    "username": "Relhit",
    "rating": 5.0,
    "comment": "Liked the core game. Expansions are too expensive and hard to find. I feel FFG multiple expansions policy went too far with this one.\n\nEdit: Core game has little replayability and a mediocre story. This rate does not consider expansions, that's why for me it is a 6.\n\nExpansions 1 Dunwich",
    "timestamp": 1727128800
  },
  {
    "username": "Yondragon1981",
    "rating": 5.0,
    "comment": "Who write the rule booklet? one of the worst i've seen",
    "timestamp": 1726783200
  },
  {
    "username": "Brunop",
    "rating": 5.0,
    "comment": "Once everything is set up on the table, the game plays quite well, but the preparation is a hassle. Each scenario requires:\n\n- Preparing the deck, buying new cards with experience points, and discarding old ones\n- Reading several pages of the scenario’s story and making a few decisions\n- Recording decisions in the journal\n- Finding and shuffling various decks for the new scenario\n- Reading mythos and story cards and learning new rules for the scenario\n\nThe setup often takes longer than the actual gameplay, which isn’t ideal. Your deck often relies on a few key cards, and until you draw them, you’re mostly defenseless. The token drawing system during skill tests is also problematic. While you can influence it a bit beforehand (by using cards from your hand to improve your chances), once you draw, there’s not much you can do. You might burn three cards only to draw an auto-fail token. It’s incredibly frustrating because it often determines the success or failure of the entire mission. A much better design is when you can influence the results after the random element.",
    "timestamp": 1725573600
  },
  {
    "username": "Kalayna",
    "rating": 5.0,
    "comment": "2024: need to play and potentially cull. I have marvel champions as an LCG, and I don't think I need this one, especially since I didn't love it.",
    "timestamp": 1723413600
  },
  {
    "username": "Arlique",
    "rating": 5.0,
    "comment": "Overall Game: 8/10\nManuals: 3/10 I understand publishing a beginner/quick start guide but hiding rules therein without indexing is not the way to go. Very complex differences between cards (Assets, events, spells, traits, etc) are poorly described or not at all (there are two different ways to play/commit most cards?!)\nScenarios: 6/10 Managing Cards and Investigator decks is a nightmare (pun intended)\nSolo Play: 8/10 Fully functional and enjoyable as a solo player\nDifficulty Level: Very Difficult (thanks to poor manuals)",
    "timestamp": 1720994400
  },
  {
    "username": "rws2029",
    "rating": 5.0,
    "comment": "Not Worth the Price\n• The basic framework of the game entails moving to locations to find clue tokens that are used to advance through the stages of the game (Acts and Agendas) before too many doom tokens accumulate: clue tokens allow progress by mitigating negative outcomes.\n• There are encounter cards that represent the bad things that are happening in the story, investigator cards that represent the traits and assets of the investigators, and location cards that represent the world being explored.\n• The game is organized into campaign stories consisting of multiple packs of cards that must be purchased individually at an average price of about $25; hence, each campaign can cost around $75 to $100 or more. This is a very expensive game for a mediocre gaming experience. If you enjoy stories set in the Lovecraftian universe, you’re better off buying one of the many great novels that have been written in this genre over the last century. I recommend The Laundry Files, a recent series of books by Charles Stross. They’re a mashup of Lovecraft, spy novel, and sci-fi, and would be a much better use of your entertainment dollars.",
    "timestamp": 1720908000
  },
  {
    "username": "kmdunc008",
    "rating": 5.0,
    "comment": "Played 3 times through with two player game. Won 1 on easy, Won 1 on standard, and lost once. Every game left us with the same feeling, unsatisfied. Too much overhead, randomness, and non synergetic cards in base game. Small deck building game that had us referencing scenario rules similar to games twice its size. The game didn't feel more difficult than other Arkham Horror games. However, our ability to actually enjoy playing this game was very difficult. Base game is not worth buying if you don't plan to chase the carrot on stick expansions.",
    "timestamp": 1718748000
  },
  {
    "username": "BonesJackson",
    "rating": 5.0,
    "comment": "Easily one of the best games produced by FFG in a long, long time. An excellent Lovecraft game, with silky smooth mechanics and well crafted narrative. A wonderful evolution of the LCG system. Always excited to get this to the table.\n\nUpdate - I've determined that these \"living\" card games that FFG now seems to specialize in, just aren't for me. I dislike crafting my deck in between game, and find myself not having fun with most of them. They are exemplary designs, that blur the boundaries between board and card games. Arkham Horror in particular does some neat things with maps/locations. I respect it more than I enjoy it.",
    "timestamp": 1716933600
  },
  {
    "username": "uman2631",
    "rating": 5.0,
    "comment": "I would like this game more if it were easier to win.",
    "timestamp": 1715378400
  },
  {
    "username": "Boolbar",
    "rating": 5.0,
    "comment": "*SOLD*\nI tried but I found it much too fiddly a game for what seemed such a small amount of game play. I suspect it would be better as a multiplayer game but trying it solo left me underwhelmed. Now traded.",
    "timestamp": 1714514400
  },
  {
    "username": "dhaeman",
    "rating": 5.0,
    "comment": "Good deckbuilding and narrative. Decision space in the scenario is pretty bland though. Largely feels like I know what I'm doing for the next 1-2 turns, then some bad cards get in the way, which extends what I'm doing another 1-2 turns. So, I'm not really making that many tough decisions relative to the game's length.\n\nCan occasionally be frustrating if a really bad string of luck leads to a terrible outcome on certain scenarios, greatly disproportionately impacting the success of a campaign.",
    "timestamp": 1713218400
  },
  {
    "username": "jerms358",
    "rating": 5.0,
    "comment": "Theme was perfect, the cost of really getting into it was not for me.",
    "timestamp": 1712354400
  },
  {
    "username": "Malebranche",
    "rating": 5.0,
    "comment": "Cull. Other cooperative games based on cards are better TM Crisis",
    "timestamp": 1708902000
  },
  {
    "username": "wcordewiner",
    "rating": 5.0,
    "comment": "The Lovecraftian story shines through. But the gameplay time vs the amount of luck is what keeps me from playing this.",
    "timestamp": 1708815600
  },
  {
    "username": "Tfu76",
    "rating": 5.0,
    "comment": "Solo",
    "timestamp": 1708729200
  },
  {
    "username": "Synapsus",
    "rating": 5.0,
    "comment": "It's Not about making clever moves but exploring a Story. Not my Cup of tea",
    "timestamp": 1708642800
  },
  {
    "username": "Mumblito",
    "rating": 5.0,
    "comment": "split corner on box",
    "timestamp": 1708210800
  },
  {
    "username": "Dimo217",
    "rating": 5.0,
    "comment": "dont like the drawing token part. Especially when you play a combo and draw a void token.",
    "timestamp": 1707951600
  },
  {
    "username": "atanner12",
    "rating": 5.0,
    "comment": "Maybe I just had a bad first experience, but I don't understand why this is so highly rated.",
    "timestamp": 1703286000
  },
  {
    "username": "firebound12",
    "rating": 5.0,
    "comment": "not too much into lcg",
    "timestamp": 1702335600
  },
  {
    "username": "distanceovertime",
    "rating": 5.0,
    "comment": "Want to replay.",
    "timestamp": 1701212400
  },
  {
    "username": "Oppo28",
    "rating": 5.2,
    "comment": "This is an interesting one. I think the theming is great and the tension really builds throughout a session. When I played it solo, I came away with a positive view excited to play it again.\n\nThen, I played it at 2 player and the game totally dragged. We didn't even do custom deckbuilding, just used the suggested decks, but the game itself just took so long to resolve. For the last 30 min of the game, the sense of wanting it to end was palpable.\n\nDeckbuilding looks fun. My partner and I are going to give it one more session, and if it feels as dragging as the last session I will get rid of it. If it doesn't hook us after 2 session then it's not really worth it moving forward.\n\n6 rating is temporary, after one 1p game and one 2p game. Could go up or down depending how the next session goes.\n\n*Final Edit*: I think the game could be great but requires a very specific group as well as a dedication to the system. With just the base game, there simply isn't enough decision making in deckbuilding for 2 players. You definitely need at least 1 additional coreset (or preferably some expansion/new cards) to fully explore the deckbuilding.\n\nSince the deckbuilding/deck progress probably represents a pretty large chunk of the fun of the game, the base game on its own isn't really too good. I think it's still fun, and would definitely play it if I had a dedicated group, but ultimately it's not for me and I am trading it.",
    "timestamp": 1700694000
  },
  {
    "username": "Venetas",
    "rating": 6.0,
    "comment": "Ranking only the Core Set, it's not enough to keep engagement up.",
    "timestamp": 1762383600
  },
  {
    "username": "sparkgamer",
    "rating": 6.0,
    "comment": "Gave away\n\nThis is a good game, but just felt too unforgiving for my spouse and me. We found ourselves more frustrated than enjoying ourselves.",
    "timestamp": 1762038000
  },
  {
    "username": "ditterio",
    "rating": 6.0,
    "comment": "A very good game but I didn't like the theme and I also didn't want to go to the rabbit hole of endless expansions so I sold it after 3 plays.",
    "timestamp": 1759960800
  },
  {
    "username": "gengar1205",
    "rating": 6.0,
    "comment": "its a great game but it is EXHAUSTING To play... after each mission you feel SO TIRED",
    "timestamp": 1759701600
  },
  {
    "username": "ham_and_jam",
    "rating": 6.0,
    "comment": "Love the game though since my partner and I play together we decided to opt for the revised core set as the double player deck feels like a must to get two decent starter decks without buying any additional expansions. (Though we now have multiple, but that's beside the point)",
    "timestamp": 1759096800
  },
  {
    "username": "pupykises",
    "rating": 5.5,
    "comment": "Clue Finder: The Game. is that interesting to you?",
    "timestamp": 1758837600
  },
  {
    "username": "windforce10",
    "rating": 6.0,
    "comment": "Played Core Set + Dunwich Legacy campaign + Carcosa deluxe.\n\nLowered it from 8 to 6:\nIt gets a bit stale and samey quickly. I prefer LOTR LCG which gives me better and more interesting deckbuilding options, even with a limited cardpool.\nThe killing blow of the chaos bag is funny in the beginning, but after a few adventures when you, at the moment supreme, having invested everything (assets, allies earned, cards played or committed), in the buildup to the final confrontation, pull a Fail out of the chaos bag and thus losing a chapter or campaign without the chance to mitigate, takes the fun away.",
    "timestamp": 1756850400
  },
  {
    "username": "destro",
    "rating": 6.0,
    "comment": "s",
    "timestamp": 1756245600
  },
  {
    "username": "Termino476",
    "rating": 6.0,
    "comment": "Tradeado a Andrés",
    "timestamp": 1756072800
  },
  {
    "username": "meta3",
    "rating": 6.0,
    "comment": "Sold it because I didn't like game mechanics (same thing goes for LOTR LCG). I learned that I don't like deck building in this kind of games at all.\n\n\nSold to local gamer.",
    "timestamp": 1755727200
  },
  {
    "username": "Lightspeed_aust",
    "rating": 6.0,
    "comment": "Nope, not my cuppa tea",
    "timestamp": 1755640800
  },
  {
    "username": "Reckowning",
    "rating": 6.0,
    "comment": "The bag ruins this game for me.",
    "timestamp": 1755208800
  },
  {
    "username": "arpogan",
    "rating": 6.0,
    "comment": "I played the solo variant and had high expectations, but I ended up quite disappointed. I definitely prefer Mansion over Madness.",
    "timestamp": 1755036000
  },
  {
    "username": "Ruimtevaarder",
    "rating": 6.0,
    "comment": "So far, a three (mostly due to the theme and some for the randomness) might go higher after a few more plays.",
    "timestamp": 1754258400
  },
  {
    "username": "korzhenkov",
    "rating": 6.0,
    "comment": "Возможно стоит дать второй шанс",
    "timestamp": 1754258400
  },
  {
    "username": "Abex17",
    "rating": 6.0,
    "comment": "Core box",
    "timestamp": 1754258400
  },
  {
    "username": "byrec",
    "rating": 6.0,
    "comment": "Two Copies - 4 player. A little too hard",
    "timestamp": 1754172000
  },
  {
    "username": "VaeVictis1918",
    "rating": 6.0,
    "comment": "(#3 new) I finally caved and gave this one ago, even though I am not a big fan of Lovecraft (dont get me wrong appreciate what he did, but just not my bag per se). However, after one game (thanks FFGs tutorial), Im sold at least on trying out the Dunwich legacy.",
    "timestamp": 1753912800
  },
  {
    "username": "willbeplayin",
    "rating": 6.0,
    "comment": "I have a feeling that I'm going to be a lot poorer in the years to come.\n\nUpdate: Switched to LOTR LCG. Still poorer though.",
    "timestamp": 1751839200
  },
  {
    "username": "hihimorton",
    "rating": 6.0,
    "comment": "Just not my cup of tea.",
    "timestamp": 1751493600
  },
  {
    "username": "BradyLS",
    "rating": 6.0,
    "comment": "This is probably best at low player counts where everyone understands the rules. (Shown as or 1-2. But my experience was with 5[!] investigators in a short campaign.) At higher counts, there's downtime while the AP players and duffers puzzle out what to do. Not sure about the draw bag system, either. I would rather flip cards in a deck that gets reshuffled every round.",
    "timestamp": 1750802400
  },
  {
    "username": "Lyke53",
    "rating": 6.0,
    "comment": "To be clear this is a review on the base game ONLY (proir to any expansion gameplay, so no, I haven't played Path To Carcosa). Before I start dumping on this game I want to be clear in my 6 out of ten rating in the sense of, that, overall, I enjoy this game to a certain extent. I really like the theme and playable investigators you can be and the cards as locations, as I was always excited to go to a new location and see what was there. But I have some MAJOR problems with this game. I'm not a whimp when it comes to coop games that are very hard to beat or difficult board games in general, but this game feels annoyingly difficult to the extent where it took away from my enjoyment of the game. I really dislike the fact that monsters don't exhaust after an attack of opportunity. It makes the game feel very restricting in what you can and can't do. The chaos bag also felt uncontrollably random at times, and it was just a big downer when you really really needed to complete one specific skill check only to find out that when you draw a chaos token that makes you fail the check and all the cards and resources you devoted to that skill check are now lost and did nothing. Gloomhaven has a similar \"random\" modifier to your attacks, but it didn't feel bad because there were a lot of good things you could draw from your modifier deck. I should probably stop yapping, but I really thought this was going to be better than it was, but, even after all that being said, I still think that overall this game is fine.",
    "timestamp": 1750370400
  },
  {
    "username": "mrdollar11",
    "rating": 6.0,
    "comment": "It's a good game, but I'm very much not a fan of the deck construction. I wish I could play through the game and have the game tell me how to build my deck based on decisions I made instead of having all the freedom to modify how I like. Also, the fact that you basically get four sessions out of each relatively overpriced box leaves a bad taste in my mouth.",
    "timestamp": 1750197600
  },
  {
    "username": "Honest",
    "rating": 6.0,
    "comment": "Flavourful, but not my thing",
    "timestamp": 1748988000
  },
  {
    "username": "PMBorisStoke",
    "rating": 6.0,
    "comment": "Probably fun! I couldn't get my wife into it so I only played solo and it just didn't work for me that way.",
    "timestamp": 1748815200
  },
  {
    "username": "Robwest666",
    "rating": 6.0,
    "comment": "I can see why it is a highly thought off game, but I just cannot get in to it.",
    "timestamp": 1748383200
  },
  {
    "username": "latschediwes",
    "rating": 6.0,
    "comment": "Arkham Horror: LCG is a marriage between classical role-playing games and collectible card games. It builds a strong narrative arc from beginning to the end and creates a nice atmosphere, but I have some issues.\n\nFirst, HPL should never have entered mainstream pop culture. The guy was a racist, openly xenophobic, dealt with feelings of alienation and loneliness, he seemingly hated society along with black and jewish people and imigrants and was homophobic. That's all sad and terrible. And you take his artistic work and turn it into charming green cuddly toys and games about investigators throwing dynamite at cultists? Yeah, brilliant... All the pulpy mainstream adaptations are irresponsible dealings with the original stories and they lack complete understanding of what makes them work in the first place.\n\nSecond, organisational issues are no joke. The amount of cards that one has to manage annoyed me to no end.\n\nThird, there's a question to be posed about consumption and consumer culture. Commercialism and consumerism are teaching us that that money and pursuit of pleasure are the greatest things in life. Getting into CCGs means money upfront, getting on a chain of endless serial purchases, related dopamine rushes, collecting stuff and and all the implications of it. I don't feel like I should nurture this idea in the furture.\n\nCompared to AH 2e: The LCG tells a much more coherent story than AH 2e and the rules and the turn structure are clearer. In many ways it is the more robust and more refined game and less old-school, which is either good or bad, depending on where you stand on the issue.\n\n****\n\nPlayed again after a long break and the experience was mediocre. The latest game just reinforced my impression this game invites grinding and optimzing decks.\n\nAnd to be honest I think the whole LCG business model is a bad joke.\n\nThe second edition obviously improves some things. Above all, it's good that investigator boxes are marketed separately from scenario boxes, so that you can limit or expand the card pool for deck building depending on your own preferences.\n\nRegarding the camapigns: Dunwich is good, Carcosa is very good, Forgotten Age is meh.",
    "timestamp": 1748383200
  },
  {
    "username": "Jclancy15",
    "rating": 6.0,
    "comment": "I tend to not be the biggest fan of co-op games, especially when there is no \"hook\" and it's just trying to be a straightforward heavy strategy game. Something is lacking when your opponent is a preset program, but this is probably my favorite instance of the genre, with just enough theming flavor (via the personal deck) to add some fun.",
    "timestamp": 1747778400
  },
  {
    "username": "Mestail",
    "rating": 6.0,
    "comment": "The game-play is very rich but not my taste",
    "timestamp": 1745791200
  },
  {
    "username": "gatchaman",
    "rating": 6.0,
    "comment": "The game was OK, but I really never understood how you would ever be motivated to re-play any of the scenarios. I played them once or twice to beat them, and then I would never want to play them again. And of course it's going to be way too expensive to just play each purchase a few times.\n\nAnd the theme is one of the least interesting out there, Cthulhu has always seemed kinda dumb to me (zombies is a worse theme but other than that, I think Cthulhu is the worst).\n\nThe deckbuilding was not very interesting, although I initially liked how it simplified things. But just didn't have enough impact to feel interested in it.\n\nMarvel Champions does everything better.",
    "timestamp": 1745791200
  },
  {
    "username": "DexGeek",
    "rating": 6.2,
    "comment": "Owner: Dex & Katie",
    "timestamp": 1744754400
  },
  {
    "username": "FraSteRonk",
    "rating": 6.0,
    "comment": "I get the hype for the game, and the modular nature of how a world is created by using just a set of cards is incredible. The theme (if you are into it) is interesting and the cards interactions and character building very rewarding. However, for me a lot of the times felt just like hard work, with a lot of little rules (especially around monsters following/attacking etc...) that just broke the flow and enjoyment of the game for me. Maybe because I don't love the theme, maybe because I don't like luck (with the token draw etc...), maybe because when I first tried it I was still early on my baordgaming journey, but I just couldn't get on with it. I might give it another go at some point with fresh eyes, but for now it's not something I feel compelled to pick up again.\n\n-----\n\nFeb 2025: Traded for Mission Red Planet (Second Edition)",
    "timestamp": 1743289200
  },
  {
    "username": "adamscott",
    "rating": 6.0,
    "comment": "First two scenarios were good. I don't think I like it enough to keep going. Time investment and particularly money sink is too much for me.",
    "timestamp": 1743202800
  },
  {
    "username": "rauschpotato",
    "rating": 6.0,
    "comment": "Many plays, 4p:\nIt's a well-designed game that doesn't appeal to me. It's a cooperative campaign game where role players must lean into their strengths. The Heavy attacks, The Brain gets clue tokens, etc. I appreciate a team solving a puzzle, but the theme makes me feel we should be more selfish or devious. You can upgrade your deck a tiny bit between games, but it felt like Gun Level 1 becomes Gun Level 2. I think I like it more than Gloomhaven only because there's less admin?\n\nOverall, it's a great game that's not for me. I'd rather play Pandemic or Spirit Island.",
    "timestamp": 1742338800
  },
  {
    "username": "Hpsun",
    "rating": 6.0,
    "comment": "Honestly, I dread playing it. Not because of the deck construction or the long campaigns, but because it's so scary during a scenario.\n\nThinking of culling it from the collection, very hard to bring to the table",
    "timestamp": 1740870000
  },
  {
    "username": "azimuth",
    "rating": 6.0,
    "comment": "Arkham LCG as a whole is capable of telling fantastic stories and presenting players with a huge variety of challenges, puzzles and foes. It also requires a huge investment of money to keep those fresh stories coming, and the variety of interacting mechanisms ideas by the deluge of cards makes setting up and playing games overly cumbersome. Diving into your card collection to retrieve and set up 5 different semi-randomised decks every time you want to play is irritating, as is having to check the rules and errata for the keywords sprinkled liberally throughout the game.\n\nThis rating is for the core box experience. The three introductory scenarios are, in order, fine, flawed but entertaining, and terrible. The second two actively work against core principles that they should be teaching (mitigate randomness but fail forwards; engage with the story as much as the puzzle of the game) and should have been reworked when FFG decided to rework Arkham's release model.",
    "timestamp": 1740351600
  },
  {
    "username": "mischraum",
    "rating": 6.0,
    "comment": "At one point I just stopped playing the game. I am not sure but I guess it had too little fun for the work it involves.",
    "timestamp": 1740265200
  },
  {
    "username": "Betote",
    "rating": 6.0,
    "comment": "Reseña en español en El dado de Jack:\nhttps://eldadodejack.com/2016/12/06/arkham-horror-el-juego-d...",
    "timestamp": 1740006000
  },
  {
    "username": "Nebelwerfer42",
    "rating": 6.0,
    "comment": "I rate it a 6 because it's well produced with a clever time mechanic and the story is well written, but I don't like this game at all. I don't like games where you can get brutally slaughtered in one turn without the opportunity to prepare for such a battle.",
    "timestamp": 1740006000
  },
  {
    "username": "idculver27",
    "rating": 6.0,
    "comment": "I like the deckbuilding elements but I'm just not a TTRPG guy",
    "timestamp": 1739574000
  },
  {
    "username": "Curtess",
    "rating": 6.0,
    "comment": "More of a tutorial than a full on game. Expansions are REQUIRED to get the actual experience\n\nBest aspect: Story, characters and cards are all very detailed and creative. Love the multiple paths you can take, adds a lot of replayability\n\nWorst Aspect: SETUP TIME. It takes 900 years to get this game on the table and you have to setup EACH scenario individually, making sure you add enemy cards to different decks by looking at the rulebook and it gets stressful trying to remember what symbols go where. Enemy cards can also go into other expansion deck setups and as someone with OCD it is an utter nightmare double and triple checking if I've put everything in the correct deck. Totally a me issue though not the game itself\n\nNot worth the time or stress imo, and the expansions are costly (2 boxes needed for each is pretty scummy) but the stories and investigator cards are absolutely amazing",
    "timestamp": 1739314800
  },
  {
    "username": "SkyGlad",
    "rating": 6.0,
    "comment": "Probably a 4.5 solo for me, playing with another person rescued the rating without much affecting my opinion. It’s just too damn swingy for my solo tastes. Hard games are fine (to a point), as are easy ones (occasionally). Swingy like this? No thanks. Not solo. Also, the theme is hurt by how much I feel the need to engage in mechanical luck mitigation here. Least favorite of the three cooperative LCGs.",
    "timestamp": 1738623600
  },
  {
    "username": "ShelfHelp",
    "rating": 6.0,
    "comment": "Played once.",
    "timestamp": 1738537200
  },
  {
    "username": "RLFoster",
    "rating": 6.4,
    "comment": "Rating based on Solo Play exclusively",
    "timestamp": 1738364400
  },
  {
    "username": "lilingkai",
    "rating": 6.0,
    "comment": "It's very clever how they do the campaign with just a few cards and tokens, but I gave this away after a play through of the base and Dunwich campaigns. I thought I would like the Lovecraft horror theme, but it really just doesn't really suit me, and I never really felt a need to continue playing this or go back to it.",
    "timestamp": 1738278000
  },
  {
    "username": "Memox",
    "rating": 5.5,
    "comment": "• Review and playthroughs further down [ITA/ENG]\n\nThe mechanics are mostly derivative and the writing is really cliched (aside from the excerpts from Lovecraft's books). Other than that, it plays well despite the repetitiveness.\n\n- - -\n\nYou can watch my ITALIAN board gaming sessions (with ENGLISH subtitles) at the following link. Viewer discretion is advised: there is vulgarity, drinking, and unprofessional behavior. https://www.youtube.com/playlist?list=PL9F3VX21FeNkHgwfCqHMH...\n\nCheck out my board game / RPG / gamebook hybrid at the following link: https://clochardcorp.wixstudio.io/entertainment\n\nAlso, if you wish to get updates on my creative projects, you can support me here either for free, or with a donation that grants you with unique perks: https://www.patreon.com/clochard",
    "timestamp": 1737846000
  },
  {
    "username": "Manolito",
    "rating": 6.0,
    "comment": "Beautiful components, but not too fun if you are not the deck building type of person. For the core set, with the pre-built characters one handed, the first scenario is hard, but winnable. The second one is very hard, but still fun. The last one is just discouragingly hard. I could have dig a little deeper, but i was not very fond of this experience, although i am a big \"Arkham Horror\" fan...",
    "timestamp": 1737846000
  },
  {
    "username": "setropo",
    "rating": 6.0,
    "comment": "ECDE #12 y #23",
    "timestamp": 1737500400
  },
  {
    "username": "DoctorPhil",
    "rating": 6.4,
    "comment": "Rules and gameplay 7\nStrategic avenues 6\nMechanism strength 7\nThematic integration 8\nVariability 8\nReplayability 5\nFun factor 4\nSolo mode 8\nPlayer interaction 5\nSkill ceiling 6\n\nOverall 6.4",
    "timestamp": 1736982000
  },
  {
    "username": "NielosNl",
    "rating": 6.0,
    "comment": "Solo (2)",
    "timestamp": 1736118000
  },
  {
    "username": "paulkessels",
    "rating": 6.0,
    "comment": "just going through the rulebook made me want to sell this immediately",
    "timestamp": 1736031600
  },
  {
    "username": "drewcake",
    "rating": 6.0,
    "comment": "2/4. Co-op. CCG. Deck-building is a lot to deal with and collecting cards through expansions isn't our style. Very difficult but would likely just play Eldritch due to ease of access.",
    "timestamp": 1735513200
  },
  {
    "username": "Rheebus",
    "rating": 6.0,
    "comment": "Love this game when I'm in the right mood.",
    "timestamp": 1734390000
  },
  {
    "username": "Lengra",
    "rating": 6.0,
    "comment": "Physical box (G)",
    "timestamp": 1733526000
  },
  {
    "username": "zingano",
    "rating": 6.0,
    "comment": "Coop. Just doesn’t feel thematic to me, all about working out a response over multiple plays.",
    "timestamp": 1732921200
  },
  {
    "username": "hiimjosh",
    "rating": 6.0,
    "comment": "A fantastic story game. Sadly I insta-died several times on my play through and it left me very bitter about the randomness in the game. I ditched it for other LCGs",
    "timestamp": 1732489200
  },
  {
    "username": "leleyx",
    "rating": 7.0,
    "comment": "I liked it, but not into the whole LCG/CCG/MTG concept, I have a budget, of sorts.",
    "timestamp": 1762470000
  },
  {
    "username": "dr.morton",
    "rating": 7.0,
    "comment": "The first game by FFG that I really enjoyed in the last couple of years.",
    "timestamp": 1762210800
  },
  {
    "username": "en0t",
    "rating": 7.0,
    "comment": "Solo",
    "timestamp": 1760479200
  },
  {
    "username": "JP83",
    "rating": 7.0,
    "comment": "I plan to play in the future.",
    "timestamp": 1760220000
  },
  {
    "username": "awpTilla",
    "rating": 7.1,
    "comment": "Rated on solo plays (around 5-10 so far)\n\nThe base game is kinda neat but lacks content and the deckbuilding aspect is not realls a big part of the game.\nIf I got time and money to make this a better experience I will give this one more chance. I still love the theme and the fluent gameplay",
    "timestamp": 1760133600
  },
  {
    "username": "DrizztHarley",
    "rating": 7.0,
    "comment": "It is a lot, after decks are set up though, it is a fun game.",
    "timestamp": 1760047200
  },
  {
    "username": "ImZhe",
    "rating": 6.5,
    "comment": "Fun scenarios but lot of rng",
    "timestamp": 1759960800
  },
  {
    "username": "MoMahili",
    "rating": 7.0,
    "comment": "Keep",
    "timestamp": 1759874400
  },
  {
    "username": "MythiccRare",
    "rating": 7.5,
    "comment": "Good - Enthralling co-op constructed deck adventure with a vast catalog. Expensive.",
    "timestamp": 1759874400
  },
  {
    "username": "Tannerd",
    "rating": 7.0,
    "comment": "Doesn't get played - it's excellent, but the theme isn't for me. On the way out.",
    "timestamp": 1759788000
  },
  {
    "username": "Geor9eX",
    "rating": 6.5,
    "comment": "3.56 Cmplx/4th",
    "timestamp": 1758664800
  },
  {
    "username": "Bobby64",
    "rating": 6.5,
    "comment": "I like the deckbuilding and how the events progress. By my last session I scored it down from a 8.5.\nMy problem is, it's absolutely a \"with your board game friends\" game. If not everyone is on board it becomes a drag. Even a shorter session becomes a chore.\nI enjoyed playing at first, but at the end it reminded me why I am not on board for the narrative in any game.",
    "timestamp": 1758405600
  },
  {
    "username": "Johnny Opie",
    "rating": 7.0,
    "comment": "Initial rating after a few solo plays and one 2-player game. I can see why it is rated higher in general, but the LCG model isn't a hit for me. The base game is too limited in replayability.",
    "timestamp": 1758232800
  },
  {
    "username": "miha_lis",
    "rating": 7.0,
    "comment": "1-2 игрока",
    "timestamp": 1758060000
  },
  {
    "username": "Phenylalanin85",
    "rating": 7.0,
    "comment": "stored in Rückkehr Box\n\nÜbersicht des gesamten Contents:\nhttps://boardgamegeek.com/filepage/266925/arkham-horror-tcg-...\n\n----------\nWir haben das Grundspiel + die ersten 5 Zyklen:\n\nNight of the Zealot (Grundspiel, double checken: fehlt Rückkehrer Box?)\nDunwich Legacy [Grundbox + alle Mythos Boxen + Rückkehrer Box]\nPath to Carcosa [Grundbox + alle Mythos Boxen + Rückkehrer Box]\nForgotten Age [Grundbox + alle Mythos Boxen + Rückkehrer Box]\nCircle Undone [Grundbox + alle Mythos Boxen + Rückkehrer Box]\nDie Traumfresser (Kampagnen- & Ermittler-Erweiterung)\n\n-----------\n+ 5 Investigator Starterpacks:\nNathaniel Cho\nHarvey Walters\nJacqueline Fine\nStella Clark\nWinfried Habbamock",
    "timestamp": 1757973600
  },
  {
    "username": "SisyphusX",
    "rating": 7.0,
    "comment": "Sell 2025",
    "timestamp": 1757887200
  },
  {
    "username": "Innsbruck",
    "rating": 7.0,
    "comment": "Player Count: 1 to 2 with Original base game (1 to 4 with second copy of Original base game)\n Co-Operative Game: Everyone wins or loses together.\n\nI bought this, never played it, and sold it. I've got to stop doing that.\n\nDesigned by Nate French and Matthew Newman.",
    "timestamp": 1757714400
  },
  {
    "username": "CHabecker",
    "rating": 7.0,
    "comment": "Listed for Sale - $24 (7/2/24)\nReduced - $20 (9/5/25)",
    "timestamp": 1757282400
  },
  {
    "username": "jiistme",
    "rating": 7.0,
    "comment": "Additional Content: Invocation 2020 alternate art cards (Copycat, Jacqueline Fine, Stella Clark, Nathaniel Cho, Harvey Walters and Winifred Habbamock)\n\nAccessories: 1-4 player play mat,2018 Invocation playmat, 2018 Invocation card dividers, plano like containers, sleeved, cheat sheets",
    "timestamp": 1756677600
  },
  {
    "username": "PraxisLoki",
    "rating": 7.0,
    "comment": "Can Leave 2 - Replacement Earthborn Rangers",
    "timestamp": 1756591200
  },
  {
    "username": "RadicalDog",
    "rating": 7.0,
    "comment": "Could be higher, but unbelievably expensive to get deeper into.",
    "timestamp": 1756418400
  },
  {
    "username": "Portwills",
    "rating": 7.0,
    "comment": "Good game. Usually willing to play. It's a thematic deck-builder that is fun solo or with a friend. The biggest downside is Cthulhu has been done to death already.",
    "timestamp": 1756245600
  },
  {
    "username": "Qhorin",
    "rating": 7.0,
    "comment": "Faster and smoother than the board game, while retaining the immersion.",
    "timestamp": 1756159200
  },
  {
    "username": "BackIssueBacklog",
    "rating": 7.0,
    "comment": "I love the setting and this great living card game. Would love to find a second player to play through an entire campaign with. Wife hates the game.\n\nUpdate: The first scenario and additional player cards introduced in Dunwich Legacy solidify this game.",
    "timestamp": 1755640800
  },
  {
    "username": "antonkartashov",
    "rating": 7.0,
    "comment": "2p\n3p, 4p - w/ 2nd core set or Investigator Starter Packs\n\nComplexity: ●●● (hardcore)\nDuration: 180 mins\n\nThe best game of Arkham Horror Files. Board games with minis are much worse for dungeon crawlers because monsters often spoil the campaign plot and limit it. A card game is better for this genre (only better if played with a game master).",
    "timestamp": 1755208800
  },
  {
    "username": "drphilphil",
    "rating": 7.0,
    "comment": "Interesting game but I just can't love Lovecraft themed games that don't feel like Lovecraft stories at all. And the randomness is a tad too much for me.",
    "timestamp": 1755122400
  },
  {
    "username": "Kelsoli",
    "rating": 7.0,
    "comment": "Rules!!! I’m a true solo player and am working through the first scenario of the core set a second time (with a second character) . Game still isn’t flowing, but I have hopes of moving onto second scenario with this character (Wendy Adams), it’ll start making sense.\n\nThat being said, I LOVE rules and complexity, so I hope once it’s flowing, the game will still be fun.\n\nedit: 2 years later, and this game has only made it to the table once more. I'm looking forward to playing again but there are other games that are more fun to get to the table atm.",
    "timestamp": 1753653600
  },
  {
    "username": "Natenator77",
    "rating": 7.0,
    "comment": "This game was honestly kind of up my alley. I liked the gameplay, even though I'm not a huge fan of deck construction. I only played the core, so I didn't get the full taste of an actual campaign, but a mix of being priced out of content and worry for storage solutions made me sell this game instead of keeping it.\n\nSold in June 2025.",
    "timestamp": 1752876000
  },
  {
    "username": "kingtiger1942",
    "rating": 8.0,
    "comment": "PROBADO",
    "timestamp": 1762297200
  },
  {
    "username": "Swchiddy",
    "rating": 8.0,
    "comment": "With all of the expansions, the deck building is fun. Immersive theming.",
    "timestamp": 1761865200
  },
  {
    "username": "royalty_valens",
    "rating": 8.0,
    "comment": "Arkham Horror is one of the few games that's fun to lose. It manages to invoke the slap-dash energy of a TRPG session, with much less work and the Lovecraft-esque atmosphere is beautifully rendered throughout the production. A game that's heavy on the mind and wallet.",
    "timestamp": 1761692400
  },
  {
    "username": "SkyeHalon",
    "rating": 8.0,
    "comment": "x2",
    "timestamp": 1761084000
  },
  {
    "username": "yodadood",
    "rating": 7.5,
    "comment": "Expansions & Upgrades:\n- Investigator Starter Decks\n- The Dunwich Legacy\n- The Path to Carcosa\n- The Forgotten Age\n- The Scarlet Keys",
    "timestamp": 1760911200
  },
  {
    "username": "Robber91",
    "rating": 7.5,
    "comment": "hard",
    "timestamp": 1760479200
  },
  {
    "username": "Keirayoruichi",
    "rating": 8.0,
    "comment": "This is the type of game that you really need to sit down for a whole day and maybe, you'll get through it.\n\nIt is definitely different experience than playing a regular board game, because it has chapters and you cannot play it through in one sitting. Still, if you make the time for it, it can be a very special experience.",
    "timestamp": 1760392800
  },
  {
    "username": "werkstatton",
    "rating": 8.2,
    "comment": "Insert kinda done",
    "timestamp": 1760220000
  },
  {
    "username": "Wieked",
    "rating": 8.0,
    "comment": "Love to play this every now and then. I don't have many expantions, but it always feels like a new game each time a try a different deck/character. So it's still played around here. I Play it mostly solo and sometimes with my wife, never tried more people but I think it's best tis way anyways...",
    "timestamp": 1760047200
  },
  {
    "username": "einfach_Klaas",
    "rating": 8.0,
    "comment": "If only I had more time",
    "timestamp": 1759701600
  },
  {
    "username": "ImNotZach",
    "rating": 8.0,
    "comment": "Own 2 copies of the (old) core box",
    "timestamp": 1759442400
  },
  {
    "username": "Rymit",
    "rating": 8.0,
    "comment": "The best part of AH:LCG is the deckbuilding, offering plenty of decisions and creativity for all players, while still being tight in decisions.\n\nThen comes the actual gameplay. It is good and provides an enjoyable narrative. The encounter deck and various mechanics keep the game stressful in a fun way. Resolving actions through the chaos bag greatly enhances the atmosphere. The round-to-round puzzle is great.\n\nDifferent campaigns provide a varied experience, each bringing its own creative ideas. New mechanics sometimes expose the game’s unintuitive rules, though this is fairly forgivable in co-op. Some scenarios fall flat by being too easy, which is a real problem for cooperative games. On the other hand, some scenarios can be nail-bitingly hard, which is then offset with the game allowing you to fail forward. This way of balance is a hit or miss.\n\nThe campaign structure helps with telling the story and allows for deckbuilding progression between scenarios. Deck upgrades feel rewarding, with plenty of cool, new cards and story-based additions.\n\nMost of my games are two-handed solo, which is manageable but slowed by the rule convolutions. It works in solo but shines in groups, where deck combinations and playstyles provide awesome group tension.\n\nI do really like this system, and my issues, while annoying, can often be overlooked. Ultimately, I own every campaign and investigator expansion, with Limited deckbuilding as my favorite format.",
    "timestamp": 1759442400
  },
  {
    "username": "edrift101",
    "rating": 8.0,
    "comment": "Great game, but I'll sell this and focus on Marvel Champions...",
    "timestamp": 1759096800
  },
  {
    "username": "cortexjackal",
    "rating": 8.0,
    "comment": "Own the complete Circle Undone cycle + a few of the investigator big boxes",
    "timestamp": 1758664800
  },
  {
    "username": "Hjortfot",
    "rating": 8.0,
    "comment": "Good game, love the thema. Want to play i more Than my family/friends.",
    "timestamp": 1758664800
  },
  {
    "username": "Penguinised",
    "rating": 8.0,
    "comment": "This game only continues to climb in my esteem. It creates a wonderful play space that offers so many strategies for deckbuilding, combined with amazingly creative adventure design. A little complicated to get your head around at first, but a fun time once you do",
    "timestamp": 1758578400
  },
  {
    "username": "Song_of_Shield_Lady",
    "rating": 8.0,
    "comment": "有基础和一二循环，确实是无与伦比的作品。卡牌的玩法与剧情、关卡结合的很好。\n20250905：开始玩六循环三人局，梦境篇，好游戏，不过感觉没初见的新颖感了hhh\n20250921：成功打完六循环，梦境组+现实组两个调查队，直面两位古神，成功好结局，剧情虽直接简单但描绘细腻，反转也不错，还是很不错的。",
    "timestamp": 1758405600
  },
  {
    "username": "kwhite1",
    "rating": 8.0,
    "comment": "P",
    "timestamp": 1757887200
  },
  {
    "username": "jerevinan",
    "rating": 8.1,
    "comment": "카드와 토큰 몇개로만 진행 가능한 아컴호러\n간결한듯 하지만 복잡하고 난이도는 어려움.",
    "timestamp": 1757455200
  },
  {
    "username": "TheAvalonKnight",
    "rating": 7.5,
    "comment": "Solid living card game with a focus on narrative and theme. Very intricate for deckbuilders such as myself, though you must be willing to pay quite a bit in order to see that aspect of the game.\nI don't love the way that failing a scenario is integrated into the gameplay. Failure means you see less content and makes your deck a bit worse: I would prefer for the game to be slightly more forgiving and failure being more of a solid end to the narrative instead.",
    "timestamp": 1757282400
  },
  {
    "username": "Indy500sr",
    "rating": 8.0,
    "comment": ".compleet\nEAN 841333101633\nL3",
    "timestamp": 1756850400
  },
  {
    "username": "frasti",
    "rating": 7.5,
    "comment": "Complete cycles of Dunwich, forgotten age, path of carcosa, dream eater, edge of earth, circle undone, scarlet keys. Feast Hemlock campaign. most standalone scenario, all standalone investigators + gator promos, return to boxes for zealot, circle, carcosa, forgotten age. out of the void, midwinter gala. extras: depths of yoth, shattered, black throne, greater good, secret name\n\nhouse rules: 1; can take 1 weakness for 7 experience 2: All cards in deck are unique except 3 sets. 3: At the start of scenario after drawing initial hand, shuffle in a random banlist and random level 0 class card. If drew a banned card during play, you may cantrip 4: if using action to activate a heal, can draw any symbol from chaos bag to heal 1 more 5: Firearms can't hit ally unless critical red token drawn, melee hit one ally when miss on any symbol token\n\n25/08/30 USPS 9434636106194294637490 sharkeyx in print items along",
    "timestamp": 1756850400
  },
  {
    "username": "Biitseli",
    "rating": 8.0,
    "comment": "S",
    "timestamp": 1756332000
  },
  {
    "username": "Qumpelblase",
    "rating": 8.0,
    "comment": "Obwohl ich sehr sehr viele Lovecraft/Arkham-Spiele gespielt habe und großer Fan von themtisch kooperativen Spielen bin, hatte ich mit den meisten Spielen eher meine Probleme. Die meisten waren mir zu lang, zu aufwändig, zu aufgeplustert und zu pompös für relativ wenig Spiel und viel Zufall, was dann letztendlich drinsteckte. Außerdem bin ich auch kein großer Fan vom Cthulhu-Mythos und den dazu passenden Monstern (Schande über mein Haupt- ich bevorzuge aber lieber die klassischen Monster und kämpfe lieber gegen Werwölfte, Zombies, etc.). Trotzdem ist das Arkham Horror Kartenspiel das Spiel, in das ich in meinem Leben am meisten Kohle und (nach Gloomhaven) am zweitmeisten Zeit investiert habe. Eine kurze Rezension fällt mir hierbei sehr schwer, aber vielleicht kann ich dir auf dem langen Wege eher mitteilen, was das hier ist und wie ich es finde.\nWas genau ist das Arkham Horror Kartenspiel? Beim Arkham Horror Kartenspiel spielen wir Ermittler, erforschen Mythen und kämpfen gegen Monster. Vor Spielbeginn bauen wir uns ein Deck zusammen, mit dem wir uns kooperativ durch eine Geschichte spielen. Es gibt die Möglichkeit einzelne Szenarien zu spielen oder (teilweise ebendiese) Szenarien als zusammenhängende Kampagne zu spielen.\nWas macht das Spiel so gut? Dieses Kartenspiel schafft etwas, was bisher nur wenige Spiele für mich geschafft haben: es kombiniert für mich die drei Ts Taktik, Teamplay und Thematik. Taktik? ich habe das Gefühl, dass jede meiner Entscheidungen wichtig ist und ich mit den Konsequenzen leben muss. Spiele ich die Karte jetzt? Teilen wir uns auf? Sammel ich erstmal Ressourcen? Jede Entscheidung kann am Ende wichtig sein und das erzeugt eine tolle Spannung. Teamplay? Ich kenne mein Deck und ich kann und muss meine Entscheidungen treffen. Trotzdem beratschlage ich mich viel mit meinem Gegenüber, rätsel umher, möchte mit ihm gemeinsam das Szenario erkunden und versuche Synergien und Kombos zu schaffen. Thematik? God dammit- jede Karte macht Sinn; ich kann mir jeden Effekt bildlich vorstellen; jede Wendung bedeutet Action und hält die Spannung des Spieles aufrecht.\nWelche Rolle spielt das Grundspiel? Das Grundspiel beinhält drei Szenarien, die wirklich gut sind, um Neulinge in das Spielkonzept einzuführen und um mir das ganze Drumherum schmackhaft zu machen. Leider reichen die Karten nur für zwei Decks (und die sind dann schon sehr wild zusammengewürfelt)- das eigentliche Potenzial des Deck-Buildings und auch der immersiven Kampagnen kann man erst ausschöpfen, wenn man sich einen gesamten Zyklus gekauft haft. Dann erst macht Arkham Horror richtig Spaß. Außerdem vereinfachen die vorgefertigten Decks das Spiel für mich enorm- einfach weil ich nicht eine halbe Stunde lang ein Deck zusammenzuchen muss. Ich sage es also wie es ist: die Grundbox ist scheiße, um das Spiel zu spielen! Es reicht ausschließlich zum Kennenlernen und ist nur ein erstes Beschnuppern (wie ein Ersti-Kennenlerntag in der Uni).\nIch empfehle das Spiel uneingeschränkt jedem, der sich in ein kooperatives Spiel hineinfuchsen möchte und sich mehr Abwechslung als immer nur die gleichen Dungeon Crawler wünscht. Zu zweit ist das Spiel am besten, funktioniert aber auch zu dritt und angeblich auch alleine sehr gut). Jeder sollte sich aber im klaren sein: um das Spiel als eigenständiges Hobby so richtig ausschöpfen zu können, muss man locker 300 Euro aufwärts investieren- und das ist eine ganze Menge Asche.",
    "timestamp": 1756245600
  },
  {
    "username": "grabbagmedia",
    "rating": 8.0,
    "comment": "Night of the Zealot: Scenarios I through III\nPlus base characters. Own 2",
    "timestamp": 1756159200
  },
  {
    "username": "Kubidi",
    "rating": 8.0,
    "comment": "Players: 01 - 02\nBest: 02",
    "timestamp": 1755986400
  },
  {
    "username": "starscr3am",
    "rating": 8.0,
    "comment": "Folded Space insert. Chaos tokens in coin capsules.",
    "timestamp": 1755900000
  },
  {
    "username": "Archimicarus",
    "rating": 8.0,
    "comment": "Detractors:\n-Money-suck.\n-Intro campaign is not a good representation of the 'fail forward' nature of the other campaigns.\n\nPositives:\nExcellent variety of deck archetypes and customization, excellently constructed campaigns and story, tight rules and tight balance. Like, super good.",
    "timestamp": 1755727200
  },
  {
    "username": "Gentilhombre",
    "rating": 9.0,
    "comment": "Mi primer y único -hasta la fecha- \"living card game\". Me lo recomendaron y ha colmado mis expectativas. Lo primero, MUY divertido. Es un juego que te mantiene en tensión y ganar supone todo un reto. El tema se saborea y la historia que acompaña a cada escenario y campaña hace que el juego vaya más allá de resolver un simple puzzle. La posibilidad de diseñar los mazos y que los personajes evolucionen es otro punto a favor.\n\nLa ambientación en los mundos de Lovecraft para mi es un aliciente, aunque sea desde un punto de vista completamente \"pulp\".\n\nLa calidad gráfica, sobresaliente, como es habitual en FFG. Y por supuesto, con todas sus expansiones pasadas, presentes y futuras, es un sacacuartos de primera, lo cual también es marca de la casa.\n\nCAMPAÑAS Y ESCENARIOS QUE TENGO:\n- Carnevale de horrores\n- La maldición del Rougarou\n- Los laberintos de la demencia\n- Guardianes del Abismo\n- La masa que lo devoraba todo\n- Asesinato en el Hotel Excelsior\n- Barkham Horror: La intromisión de Miaulathotep\n- La guerra de los dioses exteriores\n- Maquinaciones por el tiempo\n- Fortuna e insensatez\n- La gala del ecuador del invierno\n- Rodaje letal\n- Escenarios de desafío (6 escenarios)\n- Campaña: El legado de Dunwich (completa)\n- Regreso a El legado de Dunwich\n- Campaña: El camino a Carcosa (completa)\n- Regreso a El camino a Carcosa\n- Campaña: La era olvidada (completa)\n- Campaña: El círculo roto (completa)\n- Campaña: Los devoradores de sueños (completa)\n- Campaña: La conspiración de Innsmouth (completa)\n- Campaña: Los confines de la tierra (completa)\n- Campaña: Las llaves escarlata (completa)\n- Campaña: La fiesta del valle de la Cicuta (completa)\n- Campaña: La ciudad sumergida (completa)\n\nFANMADE:\n- Campaña Vientos Invernales (inconclusa)\n- El Gran Hotel Oak\n- Contra el Wendigo\n- Consternación en el Constelación\n- Sed de Sangre\n- La Sinfonía de Erich Zann\n- El Ceremonial\n- Campaña: La llamada del Portador de la Plaga (completa)\n- El Fantasma de la Ópera\n- Campaña: Materia Oscura (completa)\n- Campaña: El Corazón de las Tinieblas (completa)\n- Sucesos de Arkham (5 escenarios)",
    "timestamp": 1762383600
  },
  {
    "username": "Vosty",
    "rating": 8.5,
    "comment": "Logging this after playing the base campaign and the first half of Dunwich. Mostly going to evaluate the revised base box.\n\nA very neato game. I come from the world of competitive TCGs, so I was unsure how the hell a co-op LCG would work, but I think this game not just works, but works well. Really fascinating randomization and odds pushing mechanisms all over the place seems like it would feel out of control, but I actually think that its very skill testing instead. Plus, things are generally very fail fowards. You get rewards for succeeding yes, but failing is not the end, with only minor penalties (that often make the stakes higher, and therefore more fun). In fact, I kind of love the moments that make you actively groan out loud more than anything. Reminds me of Spirit Island that way.\n\nI like the way the actively encourages a certain type of quarterbacking, while setting hard boundaries on someone dominating the entire table. Even so, there is always lots of stuff for everyone to \"do\", so we all leave a chapter feeling like we accomplished something.\n\nMy big complaints about this particular product & the learn to play experience:\n-Why why why are starter decks in the base box so bad. We played two chapters of NotZ, failed horribly in chapter two, looked up what were \"doing wrong\" online, and were extremely annoyed with the idea that you aren't supposed to play with the actual starter decks as they are, which are horribly unoptimized pieces of shit. This isn't really explicitly said anywhere in the booklet? Why are you asking me to evaluate cards / make decks before I even played the game? Do you really want me to play this piece of shit intro campaign twice?\n-NotZ chapter 3 is extremely awful bullshit lmao. This is known though.\n-As a reprint heavy 2nd edition product, its kind of bizarre that they put a bunch of staples from future sets in here, but still left Rogue the way it was. If the bad investigator wasn't enough, the selection of rogue cards just feels.... random. The class identity is not clear at all to me, other than having the highest evasion (which isn't very useful, at least in the combat heavy NotZ campaign). I already see Dunwich massively course correcting in this area, so why not the base box.\n-There is no advice on what makes a decent team composition. There isn't really a clear answer to this tbh, but they also could have just said \"Bring Seeker & Guardian\" to help out the newbies.\n-There are rules edge questions that I feel are pretty common, that the comprehensive rules is kind of ambiguous about.\n-The learn to play booklet is laid out really weird. It runs a turn in like reverse order.\n\nAll in all very fun to play, but still kind of too expensive to recommend to others. I justify it by comparing it to the price of games like MTG, but is that really where you want to be?",
    "timestamp": 1762297200
  },
  {
    "username": "1arska",
    "rating": 9.0,
    "comment": "Exciting and brutal story adventure game. Theme is great and I can't stop playing this because I enjoy the campaign elements and building the decks those makes each player's style unique each time. Mostly I play this as solo and playing two investigators has more synergy than just one. Also group of up to 4 players is blast.\n\nGood to know for new players: I recommend to buy Revised core set (or sometimes 2 x old core) instead (update: there will be new core released in 2026, check that too). Good to know is, that old core includes only one copy of each different class card. Double is better, as deckbuilding allows that. Also, Revised version automatically supports up to 4 players, includes bag and some player cards that are released in Dunwich and Carcosa expansions. Also some expansions are mandatory for the true AH:LCG experience (like Campaign and Investigator expansions).\n\nOne of all-time favourites! (Rated with the expansions)",
    "timestamp": 1762297200
  },
  {
    "username": "Shaunmood",
    "rating": 9.0,
    "comment": "This is probably the most polished of the 3 FFG LCGs. The storyline is fleshed out. The card quality is stellar. The location and exploration design is awesome. The only design flaw that I find lazy is the Chaos Token mechanic. When a game about cooperation and strategy is at the mercy of a dice roll, or in this case a lottery draw, it feels cheap. And the cop out to that laziness is that its thematic. Nothing rips you out of your immersion of being in a cellar fighting demons faster than declaring what you want to do and then having to reach in a bag and pull out a lottery ball. Also being unable to do anything because youre stunlocked by autofail tokens. Just an all around stupid addition.\n\nWith all of that complaining aside, the game IS well made and a lot of fun. Great at 2 and3 players.",
    "timestamp": 1762297200
  },
  {
    "username": "alicialaura",
    "rating": 8.5,
    "comment": "+Extra core set\n+Investigator Starter Packs (5)\n+The Dunwich Legacy Cycle\n+The Path to Carcosa Cycle\n+The Forgotten Age Cycle and Return To\n+The Circle Undone Cycle and Return To\n+The Dream-Eaters Cycle\n+The Innsmouth Conspiracy Cycle\n+Edge of the Earth Campaign\n+The Scarlet Keys Cycle\n+The Feast of Hemlock Vale Campaign\n+The Drowned City Campaign\n+Curse of the Rougarou\n+Carnevale of Horrors\n+Murder at the Excelsior Hotel\n+The Blob That Ate Everything\n+Guardians of the Abyss\n+War of the Outer Gods\n+Fortune and Folly\n+Midwinter Gala\n+Film Fatale",
    "timestamp": 1762124400
  },
  {
    "username": "Samman13",
    "rating": 9.0,
    "comment": "Loaned to Justin Wright on 7/14/2024, returned 11/1/2025",
    "timestamp": 1762038000
  },
  {
    "username": "Pevsfreedom_",
    "rating": 9.0,
    "comment": "Expansions: Everything up to The Drowned City (Chapter One).",
    "timestamp": 1761951600
  },
  {
    "username": "bjcott",
    "rating": 9.0,
    "comment": "OCTGN",
    "timestamp": 1761606000
  },
  {
    "username": "Hooloovoo42",
    "rating": 9.0,
    "comment": "ST20 2025 #11\nST20 2024 #07\nST20 2023 #08\nST20 2022 #06\nST20 2021 #08\nST20 2020 #06\nST20 2019 #04\nST20 2018 #02",
    "timestamp": 1761256800
  },
  {
    "username": "Zhikan",
    "rating": 8.5,
    "comment": "+ Expansions",
    "timestamp": 1760997600
  },
  {
    "username": "crito13",
    "rating": 9.0,
    "comment": "Great game. Easy to learn with the way the rules are set up. Excellent artwork - really immerses you into the story. Big Lovecraft fan and this game does a great job of interpreting his stories and mythos into a game. System of pulling tokens instead of rolling dice is very interesting and allows for a variety of difficulties. Double-sided cards representing locations give a sense of mystery. Player cards can be used for what they are for mitigating skill checks. Lots of variety in play.",
    "timestamp": 1760997600
  },
  {
    "username": "junshengkeh",
    "rating": 9.0,
    "comment": "Base...\n+ Return to the Night of the Zealot (2018)\n\nThe Dunwich Legacy...\n+ Campaign Expansion (2022)\n+ Investigator Expansion (2022)\n\nThe Path to Carcosa...\n+ Campaign Expansion (2022)\n+ Investigator Expansion (2022)\n\nThe Forgotten Age...\n+ Campaign Expansion (2023)\n+ Investigator Expansion (2023)\n\nThe Circle Undone...\n+ Campaign Expansion (2023)\n+ Investigator Expansion (2023)\n\nThe Dream-Eaters...\n+ Campaign Expansion (2024)\n+ Investigator Expansion (2024)\n\nThe Innsmouth Conspiracy...\n+ Campaign Expansion (2024)\n+ Investigator Expansion (2024)\n\nEdge of the Earth...\n+ Campaign Expansion (2021)\n+ Investigator Expansion (2021)\n\nScarlet Keys...\n+ Campaign Expansion (2022)\n+ Investigator Expansion (2022)\n\nThe Feast of Hemlock Vale...\n+ Campaign Expansion (2023)\n+ Investigator Expansion (2023)\n\nThe Drowned City...\n+ Campaign Expansion (2024)\n- Investigator Expansion (2024)\n\nScenario Packs...\n+ Curse of the Rougarou (2016)\n+ Carnevale of Horrors (2016)\n+ The Labyrinths of Lunacy (2017)\n+ Guardians of the Abyss (2018)\n+ Murder at the Excelsior Hotel (2019)\n+ The Blob That Ate Everything (2019)\n+ The Meddling of Meowlathotep (2020)\n+ War of the Outer Gods (2020)\n+ Machinations Through Time (2022)\n+ Fortune and Folly (2023)\n+ The Midwinter Gala (2024)\n+ Film Fatale (2025)\n\nInvestigator Starter Decks...\n+ Harvey Walters (2020)\n+ Jacqueline Fine (2020)\n+ Nathaniel Cho (2020)\n+ Stella Clark (2020)\n+ Winifred Habbamock (2020)\n\nNovella Promos...\n+ Hour of the Huntress (2017)\n+ The Dirge of Reason (2018)\n+ Ire of the Void (2017)\n+ The Deep Gate (2018)\n+ To Fight the Black Wind (2018)\n+ The Blood of Baalshandor (2020)\n+ Dark Revelations (2020)\n\nChallenge Scenarios...\n+ Read or Die (2020)\n+ All or Nothing (2020)\n+ Bad Blood (2020)\n+ By the Book (2021)\n+ Red Tide Rising (2021)",
    "timestamp": 1760911200
  },
  {
    "username": "regisburin",
    "rating": 9.0,
    "comment": "Cartes (deck building poussé), gestion de menaces, Cthulhu! Le jeu le plus immersif que j'ai, sans pour autant être réellement narratif!\n\nJUSTE INCROYABLE!",
    "timestamp": 1760565600
  },
  {
    "username": "godunow",
    "rating": 9.0,
    "comment": "Revised Edition\n+ Winifred, Jacqueline, Stella, Harvey, Nathaniel\n+ Hotel Excelsior, Karnawał Koszmarów, Śluz\n+ Dunwich [++]\n+ Carcosa [++]\n+ Na krawędzi Ziemi [++]",
    "timestamp": 1760220000
  },
  {
    "username": "mrssallyintown",
    "rating": 9.0,
    "comment": "Super fun, have great memories playing this game. Challenging, but rewarding.",
    "timestamp": 1760220000
  },
  {
    "username": "Borednomore",
    "rating": 9.0,
    "comment": "just a great great game! every expansion is completely different and adds to this whole universe..best LCG out there..and by some way!.",
    "timestamp": 1759960800
  },
  {
    "username": "vensy",
    "rating": 9.0,
    "comment": "+ Наследие Данвича\n+ Путь в Каркозу",
    "timestamp": 1759788000
  },
  {
    "username": "Whats_Next",
    "rating": 9.0,
    "comment": "Es macht so viel Spaß, aber man muss ein bisschen Zeit einplanen.",
    "timestamp": 1759701600
  },
  {
    "username": "Seewolf",
    "rating": 9.1,
    "comment": "Coop LCG / Expert\nBest 1-3 Player\nLast 09/2025",
    "timestamp": 1759615200
  },
  {
    "username": "Elysian1196",
    "rating": 9.0,
    "comment": "It’s a great game but one I don’t think is worth the steep cost to get into unless you really love it and want to make this your forever game.\n\nThe thematic integration and story crafting through gameplay scenarios cannot be understated and the fact that this game is co-op makes it a lot easier to table compared to something competitive like Netrunner. As your card pool grows, Arkham Horror really does provide you with ever increasing replayability that will keep you entertained for a VERY long time.\n\nBut then there’s the major downside of actually getting to that point. This game can feel like a fiddly, unforgiving, upkeep heavy luck fest with crazy setup time, especially if you don’t have many cards and thus are more limited in luck mitigation through deckbuilding. If I’m gonna have to pay as much money, time, and space as I need to in order to really get started, since you can’t just buy the core set, I better love this game. So for most people, this is just too much investment and not worth getting into. In fact, I bet this game’s geek score is pretty inflated due to selection bias.\n\nThe silver lining here is Table Top Simulator giving free full access to every card and every campaign. So if you do really like the sound of this game, try it first there. Arkham Horror Lcg is really good at what it wants to do and is worth it if you can see yourself playing this same game for a long time. Otherwise though, I would strongly think twice before committing.\n\nedit: okay I’ve been bit by the bug and have playing a lot both on tabletop sim and IRL. The more I play, the more I can see myself playing it even more and the rating keeps going up.",
    "timestamp": 1759442400
  },
  {
    "username": "adamtay11",
    "rating": 9.0,
    "comment": "Taylor's 100-point rating:\n\nEnjoyment - 19/20 – This game is very enjoyable to play, so much so that I play this quite a bit solo as well. I really really enjoy the theme and storytelling of this game, and it truly feels like you get immersed in a wonderfully written story that you get to unfold yourself, based on your actions. So, if I enjoyed this game so much, why didn't it get a perfect score? It's a very small knit pick, I wish there were more interesting mechanics outside of the cards you play. I'll get into this a little more in the Game Mechanics section, but keep in mind, this is the smallest of knit picks.\n\nReplayability - 12/15 – Although this game, in all reality, should get a perfect or near perfect score for replayability, I have a large issue that drops this rating 2-3 points. That issue is that the replayability, to me, seems very expansion reliant, ESPECIALLY seeing as the base game only has 3 scenarios. Most of the replayability in this games comes from two fonts, first, deckbuilding. Deckbuilding in this game creates a lot of fun and unique replayability, but it feels like you need at least 1–2-character expansions before the deckbuilding feels compelling. The second font for reliability is directly related to campaign expansions, or fan-fiction stories. I love getting a new campaign and playing through the story, and although there is some merit to replaying a campaign, I feel like it doesn’t scratch the same itch as playing a brand new story for the first time… but this requires purchasing more expansions.\n\nGame Mechanics - 14/15 – The deckbuilding/card play mechanisms of this game are really fun and keep you very engaged throughout not only a game, but an entire campaign. My one knit pick is that I wish the mechanics outside of the cards were a little more deep/interesting. It feels like combat and investigating could be a little more unique than “Go investigate at this location that has a shroud value of ‘X’, and compare your characters stat, plus card modifiers, minus chaos token, to this value”. Again, I’m getting into some serious knit picks of a game I love, but this is what’s keeping the game from a perfect mechanics score.\n\nTheme/Artwork - 15/15 – Can I give this game a 20/15 for its theme? If any game deserved to go above the cap of 15 for a rating, this would be the game. The horror elements are incredibly well implemented and really make you feel the weight of your character’s decision, and how you might feel in real life coming up against these atrocities. Although the category before this, I had a minor knit pick about the game’s mechanics, the game mechanics truly excel and make you feel like you’re a part of the world that’s being built in each campaign, and your actions truly have a role in unfolding the events of any given campaign.\n\nGameflow/Pace - 10/10 – Another perfect score there never seems to be any downtime in this game. Although play order does matter in the game, there are a few instances when players can take actions all together, but the game is still enjoyable even when you’re waiting for a partner’s turn. I believe the pacing still feels enjoyable when it’s not your turn because you all have a stake in what horrors are about to unfold. You work together as a team to beat any given scenario, and the actions of your partner can drastically change the course of actions you take when it’s your turn.\n\nFlexibility - 8/10 – The game truly plays really well anywhere between 1-4 players. The issue is the game is hard capped at 4, and would probably get a perfect score here if there was a good variant to add more players. I will say, I love this game for solo play.\n\nProduction - 5/5 – High card quality is all you can ask for in this game, and the cards are indeed high quality.\n\nEffort To Play - 4/5 – This game is relatively easy to set up but the reason it doesn’t get a perfect score is due to the complexity of storing both player campaign decks and monster decks. I’ve found a really good solution to this problem by using card dividers, but is still a good amount of work to organize.\n\nAccessibility - 3/5 – This game is quite difficult to learn, especially with the added complexities of deckbuilding and knowing which cards you could have in your deck to get you out of a rough situation. With that said, to me, it feels impossible to give a co-op game anything less than a 3, seeing as it’s much easier to teach/help in a game when I’m on the same team as the people I’m teaching. This allows us to essentially dive right into the game and answer questions as they arise.\n\nTotal Score: 90/100\n\nHere's my ratings reference if you want to know what each metric means to me:\nhttps://1drv.ms/w/s!ArFa02CatjgkhLFXx_D7binitdMglw?e=jlOOMl",
    "timestamp": 1759356000
  },
  {
    "username": "Wretched Git",
    "rating": 9.0,
    "comment": "The genius of this game is that the multiple locations (mapped out by location cards) creates a true adventure board in front of you -- a board that changes with each scenario",
    "timestamp": 1759269600
  },
  {
    "username": "Josestroyer",
    "rating": 9.0,
    "comment": "It is a very good game, but it has a lot of expansion and you need to put effort in creating the decks for the different campaigns. The more time you invest, the better reward.",
    "timestamp": 1759096800
  },
  {
    "username": "Gdau",
    "rating": 8.5,
    "comment": "The first game that I have played solo that actually feels like it was designed to be played this way. The story telling and immersion in the cthulu mythos is brilliant. A very atmospheric and engaging game",
    "timestamp": 1758578400
  },
  {
    "username": "DJGT",
    "rating": 9.0,
    "comment": "Revised Core Box, but will buy more \"old\" Cards/Boxes",
    "timestamp": 1758578400
  },
  {
    "username": "Follower_21",
    "rating": 8.5,
    "comment": "✅ Outstanding immersive gameplay\n✅ Beautiful art and solid, varied mechanics\n✅ Enjoyable \"meta-gaming\" and deck-building requirements.\n\n❌ Hard to get past the disappointing realization that this game is not, in fact, all that thematic. For exemple, Investigate is a skill check and not an actual puzzlee, then you pick up a token. You are not, in fact, investigating.\n❌ Very expensive—core set offers light content for the price.\n❌ Writing quality disappoints. My expectations were too high based on online fan enthusiasm.\n❌ Very sanitized approach to cosmic horror—avoids many themes developed by Lovecraft, Moore and others, as well as any uncomfortable themes that could deepen the experience.",
    "timestamp": 1758060000
  },
  {
    "username": "surrutia",
    "rating": 9.0,
    "comment": "in sw aliances",
    "timestamp": 1757973600
  },
  {
    "username": "extatix",
    "rating": 8.5,
    "comment": "I own just about everything, but for some reason I haven't start digging into anything beyond the core set for now. A shame, as I really dig this game. I should just find the motivation to get going.\n\nEdit November 2020: I now played the first \"real\" campaign and I'm totally hooked.",
    "timestamp": 1757368800
  },
  {
    "username": "ebaynetflix",
    "rating": 9.5,
    "comment": "This is a rating on the entire collection; the core set is a 7 at best.\n\nMJ Newman is the most talented writer and designer in board games. She can bring both the streets of Paris and the horrors of waking up in an alien body. Hundreds of hours played at multiple player counts, and it remains my favorite game. This will never leave my collection.",
    "timestamp": 1762628760
  },
  {
    "username": "LizGamerGirl",
    "rating": 10.0,
    "comment": "Got two copies of the base game for deck building purposes.\n\nPreordered the season 2 core box 11/5/25",
    "timestamp": 1762297200
  },
  {
    "username": "robert_huang",
    "rating": 10.0,
    "comment": "Night of the Zealot\n- Return to Night of the Zealot\n\nThe Dunwich Legacy\n- Miskatonic University\n- The Essex County Express\n- Blood on the Altar\n- Undimensioned and Unseen\n- Where Doom Awaits\n- Lost in Time and Space\n- Return to the Dunwich Legacy\n\nThe Path to Carcosa\n- Echoes of the Past\n- The Unspeakable Oath\n- A Phantom of Truth\n- The Pallid Mask\n- Black Stars Rise\n- Dim Carcosa\n- Return to the Path to Carcosa\n\nThe Forgotten Age\n- Threads of Fate\n- The Boundary Beyond\n- Heart of the Elders\n- The City of Archives\n- The Depths of Yoth\n- Shattered Aeons\n- Return to the Forgotten Age\n\nThe Circle Undone\n- The Secret Name\n- The Wages of Sin\n- For the Greater Good\n- Union and Disillusion\n- In the Clutches of Chaos\n- Before the Black Throne\n- Return to the Circle Undone\n\nThe Dream-Eaters\n- The Search for Kadath\n- A Thousand Shapes of Horror\n- Dark Side of the Moon\n- Point of No Return\n- Where the Gods Dwell\n- Weaver of the Cosmos\n\nThe Innsmouth Conspiracy\n- In Too Deep\n- Devil Reef\n- Horror in High Gear\n- A Light in the Fog\n- The Lair of Dagon\n- Into the Maelstrom\n\n- Edge of the Earth Campaign Expansion\n- Edge of the Earth Investigator Expansion\n\n- The Scarlet Keys Campaign Expansion\n- The Scarlet Keys Investigator Expansion\n\n- The Feast of Hemlock Vale Campaign Expansion\n- The Feast of Hemlock Vale Investigator Expansion\n\n- The Drowned City Campaign Expansion\n- The Drowned City Investigator Expansion\n\nStandalones\n- Curse of the Rougarou\n- Carnevale of Horrors\n- Guardians of the Abyss\n\nPromos/Books/Investigators\n- Blood of Baalshandor/Dexter Drake\n- Harvey Walters\n- Nathaniel Cho\n- Winifred Habbamock\n- Jacqueline Fine\n- Stella Clark\n\nPnP Proxies for commonly used cards\nPnP Signature Replacement cards for Jenny, Roland, Carolyn, Silas, Norman\n\nPnP Parallel Scenarios/Investigators\n- Read or Die/Parallel Daisy\n- All or Nothing/Parallel \"Skids\"\n- Bad Blood/Parallel Agnes",
    "timestamp": 1762297200
  },
  {
    "username": "blobe",
    "rating": 10.0,
    "comment": "The best from ffg series, vastly superior to middle earth or the pantiesuniverse. Campaings varies in quality but i'd rather play this than anything else, on any given day.\nNeed a DEDICATED group tho",
    "timestamp": 1762210800
  },
  {
    "username": "hopcake",
    "rating": 10.0,
    "comment": "Sets of this are on permanent rotation with my playgroup on an every-other Friday basis. Super fun",
    "timestamp": 1762124400
  },
  {
    "username": "Spouth",
    "rating": 9.5,
    "comment": "2 original Core + 1 revised Core + All cycles from Dunwich to Drowned City + All 5 Investigator decks + All Standalone scenarios.\n\nFantastic game.\nHave played it across multiple groups ranging from 2p to 4p and have found each player count enjoyable with different challenges.\n\nNot a huge fan of true solo but have enjoyed my time during solo runs.\nThe game shines with a group.",
    "timestamp": 1761606000
  },
  {
    "username": "SteiniNagli",
    "rating": 10.0,
    "comment": "2 x Core Sets\n1 x Revised Core Set\n\nExp. 1 - The Dunwich Legacy\n- Mythos packs 1-6\n\nExp. 2 - The Path to Carcosa\n- Mythos packs 1-6\n\nExp. 3 - The Forgotten Age\n- Mythos packs 1-6\n- Return to The Forgotten Age\n\nExp. 4 - The Circle Undone\n- Mythos packs 1-6\n- Return to The Circle Undone\n\nExp. 5 - The Dream Eaters\n- Mythos packs 1-6\n\nExp. 6 - The Innsmouth Conspiracy\n- Mythos packs 1-6\n\nExp. 9 - The Feast of Hemlock Vale\n- Investigator Expansion\n- Campaign Expansion\n\nInvestigator Starter Decks\n- Nathaniel Cho\n- Jaqueline Fine\n- Stella Clarke\n- Harvey Walters\n\nScenario Packs:\n- Curse of the Rougarou\n- Carnevale of Horrors\n- Guardians of the Abyss\n- Fortune and Folly\n- Film Fatale",
    "timestamp": 1761084000
  },
  {
    "username": "Felwin",
    "rating": 10.0,
    "comment": "LANG -- 2:30 Stunden -- Komplexität 3-\nOkay @ 2-3 -- Good @ 2-3 -- Best @ 2-3\nZeloten-Kampagne I+II+III\nLetztes Spiel 10/2025",
    "timestamp": 1761084000
  },
  {
    "username": "AfarOca",
    "rating": 10.0,
    "comment": "Jugadores: 2\nTiempo: 60 - 120\n\nPARTIDAS GANADAS/PERDIDAS\nNavir 13/6\nOca 13/10\nCondor 0/1\nDreamlandesa 0/1",
    "timestamp": 1760911200
  },
  {
    "username": "soulsnatch",
    "rating": 9.5,
    "comment": "full package (in Korean edt)",
    "timestamp": 1760824800
  },
  {
    "username": "Sursulapitschi",
    "rating": 10.0,
    "comment": "This is by far my favourite game.\n\nSo far we played the Corebox + Dunwich Legacy + Path to Carcosa + Forgotten Age + Circle Undone + Edge of the earth + Scarlet Keys + Guardian of the Abbys\n\nOwn: Corebox, Dunwich Legacy, Path to Carcosa, Forgotten Age, Circle Undone, Dream Eaters, Insmouth Conspiracy, Edge of the earth, Scarlet Keys, Feast of Hemlock Vale, Drowned City.\nReturn to: Night of the zelots, Dunwich, Carcosa, Circle Undone, Forgotten Age\nInvestigators: All of the campaign ones + Nathaniel Cho, Stella Clark, Harvey Walters, Winifred Habbamock\nOne-Shots: Guardians of the Abbys, Blob that ate everything, Film Fatale\n\nSleeves: 61 x 88",
    "timestamp": 1760738400
  },
  {
    "username": "leon10293",
    "rating": 10.0,
    "comment": "just try it and you will never play other card game",
    "timestamp": 1760652000
  },
  {
    "username": "krivalis",
    "rating": 10.0,
    "comment": "Gina",
    "timestamp": 1760565600
  },
  {
    "username": "StupidRatCreature",
    "rating": 10.0,
    "comment": "see Revised Edition",
    "timestamp": 1760565600
  },
  {
    "username": "Rag82",
    "rating": 10.0,
    "comment": "absolute BRUTAL on new players - best 2-(to4)-player-coop I've played so far! (sleeping gods still on the shelf)\nSO much content to explore, SO atmospheric, such nice and challenging gameplay-meachnisms... just LOVING it!",
    "timestamp": 1760479200
  },
  {
    "username": "Yanastos",
    "rating": 10.0,
    "comment": "Amazing immersive experience. Great game, big selection of fun cards and campaign scenarios.",
    "timestamp": 1760479200
  },
  {
    "username": "Frankidinapoli",
    "rating": 10.0,
    "comment": "Vender. Solo",
    "timestamp": 1760392800
  },
  {
    "username": "phunter",
    "rating": 10.0,
    "comment": "+Dunwich Legacy deluxe & full cycle (+Return to)\n+Path to Carcosa deluxe & full cycle(+Return to)\n+The Forgotten Age deluxe + revised Campaign (+Return to)\n+The Circle Undone deluxe\n+Edge of the Earth Investigators and Campaign\n+Carnevale of Horrors\n+Murder at the Excelsior Hotel\n+The Blob that Ate Everything\n+Parallel Investigators",
    "timestamp": 1760306400
  },
  {
    "username": "Nick_Fletcher",
    "rating": 10.0,
    "comment": "My personal favorite game of all time. I can always just come back to this game and find it engaging. With the way the investigators each have their own deck building restrictions + the freedom of deck building afforded by the cooperative gameplay style vs. competitive tcgs makes for one of the most rewarding deck construction experiences I've had in a card game. The scenario and campaign variety that the system and components afford is astounding. The core gameplay loop is a lot of fun and the deviations and modifications of it are even better. I love the tension/horror the game builds into it with the doom clock with the agenda deck, the chaos tokens adding variability to your tests, and the encounter deck ability to throw a wrench in your plans. Just a great game that I'd highly recommend anyone to play a full expansion campaign of to really get a feel for what it has to offer.",
    "timestamp": 1760306400
  },
  {
    "username": "ReggieBomb33",
    "rating": 9.5,
    "comment": "Original version, not the revised core set",
    "timestamp": 1760133600
  },
  {
    "username": "mantler",
    "rating": 10.0,
    "comment": "1. Hemlock Vale\n2. Carcosa\n3. Innsmouth/ Cyclopean foundation\n4. Dunkle Materie\n5. Vergessene Zeitalter\n6. Ages unwound\n7. Gebrochene Kreis\n8. Versunkene Stadt\n9. Traumfresser\n10. Dunwich\n11. Scharlachroten Schlüssel\n12. Zealot\n\nRande der Welt noch offen",
    "timestamp": 1760047200
  },
  {
    "username": "Ryokunn",
    "rating": 10.0,
    "comment": "Tentative score of 8 based off the tutorial scenario. Once a full campaign is played I'll re-assess my rating.\n\nUpdate 9/23/25\n\nTotal 10/10. After playing through Dunwich twice and Path to Carcosa once, this is a solid and tense experience. Character progression, narrative story beats, and branching paths make this the best campaign game I've played.\n\nThis game has quickly become the one I always want to play. With 6 new campaigns to dive into, it's always at the front of my mind when I have free time.\n\nSide note- Additionally added \"Murder at..\" scenario, which is absolutely top notch, to the DL campaign. Scenario packs are with it when seeded into a campaign.",
    "timestamp": 1760047200
  },
  {
    "username": "blaklyte",
    "rating": 10.0,
    "comment": "Core Box:\n- 2x Original Core\n- Revised Core Box\n\nCampaign Expansion:\n- Dunwich Legacy\n- The Path to Carcosa\n- The Circle Undone\n- The Feast of Hemlock Vale\n\nInvestigator Expansion:\n- Dunwich Legacy\n- The Path to Carcosa\n- The Forgotten Age\n- The Circle Undone\n- Edge of the Earth\n\nScenario Pack:\n- Murder at the Excelsior Hotel\n- The Labyrinths of Lunacy\n\nReturn to boxes:\n- Return to the Night of the Zealot\n- Return to the Dunwich Legacy\n\nInvestigator Starter Pack:\n- Nathaniel Cho\n- Winifred Habbamock\n- Harvey Walters\n\nNovella:\n- Ire of the Void",
    "timestamp": 1759960800
  },
  {
    "username": "lovedayrobijn",
    "rating": 10.0,
    "comment": "The game that got me into games. Will always love this game.",
    "timestamp": 1759960800
  },
  {
    "username": "koutynhu",
    "rating": 10.0,
    "comment": "LIVING CARD GAME\nSubtype: Card Game / Campaign\n\n # Rating and Comment for - Arkham Horror LCG - as a whole # \n\n- Cooperative Deck-Building & Storytelling LCG Game (1-4 Players) [Best:2]\n- Theme: Cthulhu Mythos\n- Complexity:3.26\n\n*Own:\n\nOLD FORMAT\n\n1. The Night of the Zealot (1st Ed) Core Box x2 + Return Box\n2. Dunwich Legacy full cycle (1st Ed) + Return Box\n3. Path to Carcosa full cycle + Return Box\n4. The Forgotten Age full cycle + Return Box\n5. The Circle Undone full cycle + Return Box\n6. The Dream Eaters full cycle\n7. The Innsmouth Conspiracy full cycle\n---------------------------------------------------\nNEW FORMAT\n\n8. Edge of the World Campaign + investigators Boxes\n9. The Scarlet Keys Campaign + Investigators Box\n10. The Feast of Hemlock Vale Campaign + Investigators Box\n11. Waiting for the Drowned City\n\n**Extras:\n\nStandalone Scenarios:\n1. Curse of the Rougarou\n2. Carnevale of Horrors\n3. The Labyrinths of Lunacy\n4. Guardians of the Abyss\n5. Murder at the Excelsior Hotel\n6. The Blob that Ate Everything\n7. BArkham Horror (Special Scenario)\n8. War of the Outer Gods\n9. Machinations Through Time\n10. Fortune and Folly\n11. The Midwinter Gala\n12. Waiting for Film Fatale\n\nClass Starter Decks:\n- (5) Nathan Cho, Harvey Walters, Wini Habbamock, Jacqueline Fine & Stella Clark\n\n\nSummary:\nIf you enjoy the LCG games and Cthulhu Mythos, definitely a must have!",
    "timestamp": 1759788000
  },
  {
    "username": "petherman",
    "rating": 10.0,
    "comment": "x5 core sets",
    "timestamp": 1759788000
  },
  {
    "username": "ahkat",
    "rating": 10.0,
    "comment": "Own 3 copies",
    "timestamp": 1759701600
  },
  {
    "username": "Vinnyvinvinvinvin",
    "rating": 10.0,
    "comment": "I was introduced to this game by the same cousin who introduced me to hobby board games as a whole and I can safely say that he continues to have good taste. I love the gameplay, the story so far, and the progression system. I'm itching to play more!",
    "timestamp": 1759356000
  }
]