[
  {
    "username": "ultimoratio",
    "rating": 1.0,
    "comment": "UPDATE: Feb 2025 \n\nAnnoying. A dull game about analysing the best solutions. I'm even MORE annoyed as I want to like this game with its wonderful production from Days of Wonder and its old school design style.\n\n============================\n\nOne of a kind game. The auction for turn order is interesting. The production is so nice and well done - as you would expect from Days of Wonder.\n\nBut the game is AP inducing and the player interaction isn't solid enough for me. Everything is tactical, but with little strategic choices for me to grasp on.",
    "timestamp": 1739142000
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "Oh no, even mancala can be made worse?",
    "timestamp": 1720821600
  },
  {
    "username": "TEN27",
    "rating": 1.0,
    "comment": "I disliked every aspect of this game. I usually try to find redeeming qualities, but I honestly couldn’t with this game. It’s the only game my fiancé and I have ever tried playing, and physically had to stop playing because it was just awful (to us!).\n\nPlease don’t take my review as a statement that you will hate the game, many people love it. But jeez… I would happily never play this again.",
    "timestamp": 1652824800
  },
  {
    "username": "Frozen Flesh",
    "rating": 1.0,
    "comment": "I came here, because of all the people rating games like KD:M or Hate with a 1, just because of their mature theme.\nI’m offended by how boring the theme of this game is!",
    "timestamp": 1547074800
  },
  {
    "username": "LeHavreFanatic99",
    "rating": 1.0,
    "comment": "Total stinker with us.\n\nI kind of get how people can enjoy it, but I do not enjoy the constant exercise of counting guys and squares. I also feel like there are too many mechanisms between tribe, action space, and then djinn power.\n\nAll in all just boring and would not willingly play again.",
    "timestamp": 1520204400
  },
  {
    "username": "ovelesslay",
    "rating": 1.0,
    "comment": "no",
    "timestamp": 1519858800
  },
  {
    "username": "tang tang",
    "rating": 1.0,
    "comment": "best game of 2014!!\n\nWorse game of 2017\nEdited : Another expansion , sultan of blah blah. stop milking a dead cow, 5 tribes !!",
    "timestamp": 1506376800
  },
  {
    "username": "Pro_player",
    "rating": 1.0,
    "comment": "boring, ugly piece of crap !",
    "timestamp": 1437516000
  },
  {
    "username": "WilcoxDave",
    "rating": 2.0,
    "comment": "The mechanics were fun and not too difficult. This game seemed to work well with my Dallas group.",
    "timestamp": 1745272800
  },
  {
    "username": "khepriq",
    "rating": 2.0,
    "comment": "sweatshops still exist in 2025. nothing happens. john company did better",
    "timestamp": 1739314800
  },
  {
    "username": "NormandyWept",
    "rating": 2.0,
    "comment": "I’m one of the people that struggles to see possible moves remotely quickly in this game, making me a pain to play with, and I’d rather not inflict that in myself or indeed anyone else at the table.",
    "timestamp": 1721685600
  },
  {
    "username": "esfive",
    "rating": 2.0,
    "comment": "Pretty basic, boring worker placement. Board game form of MANCALA with funny rules. Simple mechanics. Idk why people call this a euro, it’s mancala. They basically took mancala and applied the chip rules from wonderlands war to made up factions, leaving the war part behind. Weak",
    "timestamp": 1712440800
  },
  {
    "username": "turbotix",
    "rating": 2.0,
    "comment": "Einmal und nie wieder, schlechter als Monopoly",
    "timestamp": 1690581600
  },
  {
    "username": "Sir Pent",
    "rating": 2.0,
    "comment": "I'm not a fan of the theme. And some of the paths to victory seem unbalanced compared to others.",
    "timestamp": 1671058800
  },
  {
    "username": "Colour wolf",
    "rating": 2.0,
    "comment": "Slaves - what a stupid decision compounded by edgelords going on about snowflakes.",
    "timestamp": 1605913200
  },
  {
    "username": "Geeken",
    "rating": 2.0,
    "comment": "AP prone",
    "timestamp": 1579993200
  },
  {
    "username": "TForever",
    "rating": 3.0,
    "comment": "It's just too light. It's not that hard to land where you need to go.",
    "timestamp": 1744408800
  },
  {
    "username": "MarshallStaxx",
    "rating": 3.0,
    "comment": "Awful. A bad time, had by all.",
    "timestamp": 1736895600
  },
  {
    "username": "BoardGamingCouple",
    "rating": 3.0,
    "comment": "3/5\n\nFive Tribes makes Mancala more modern & arguably more fun; however, this game is best played without bidding & at 2 players. Too random with more players & takes way too long. The bidding system is bloat. The secret scoring is good though. With these restrictions we would rather play an easier game to setup & teardown like Finca.",
    "timestamp": 1735254000
  },
  {
    "username": "sloehand",
    "rating": 3.0,
    "comment": "There is just way way way too much down time for my taste. In between turns can take 5 minutes per player, with AP prone peeps taking even longer. It is a brain burny and interesting take on the worker placement genre as you are optimizing in a pick up, deliver and pick up again scenario. But mathing through all the options is far from fun.",
    "timestamp": 1704927600
  },
  {
    "username": "Bobit",
    "rating": 3.0,
    "comment": "Seemed too solitaire and focused on short-term strategy.",
    "timestamp": 1702335600
  },
  {
    "username": "Starcadian",
    "rating": 3.0,
    "comment": "Not for me. I'm too spoiled at this point by better games at this length and complexity. The mechanisms are interesting, but the whole thing is just kind of repetitive and boring. Two types of people who would be more interested in this game are beginner hobbyists, and maybe tournament players, because this game does have a certain mathematical precision to it that would work well in a competitive arena.",
    "timestamp": 1691964000
  },
  {
    "username": "hoonga",
    "rating": 3.0,
    "comment": "만칼라 게임. 다인플은 장고 지옥이라 2인 베스트.",
    "timestamp": 1687903200
  },
  {
    "username": "Ziggybits",
    "rating": 3.0,
    "comment": "Have every exp.",
    "timestamp": 1675810800
  },
  {
    "username": "logopolys",
    "rating": 4.0,
    "comment": "Mancala-style tactical game. Huge point salad, lots of downtime. Looks like a mess when it's set up.",
    "timestamp": 1759356000
  },
  {
    "username": "TyDeL",
    "rating": 4.0,
    "comment": "I feel bad with this rating, it's a really clever idea and system... that I actively hate playing.\n\nThe actual moves could be fun, a mancala where you're activating special abilities and getting powers and bidding for turn order... except it's a sea of options where every single meeple placed on every tile can have a butterfly effect of repercussions. There's a near infinite number of options to start with, and you have to bid at the start based on the best move you could take knowing that no matter how long you stare at the board, there's a better option you could have picked.\n\nWhere you place the meeples matter, where you take the meeples from matter, what you setup for your opponents matter. Don't forget about assassins that can reach across the board. In two players you have to bid twice so you need to potentially see double turn combos. As the game progresses, it tightens like a noose, the moves matter more, the auctions get tenser.\n\nThis is a game of knowing you're missing best moves. It's the nightmare of anyone with a modicum of AP.",
    "timestamp": 1741042800
  },
  {
    "username": "Atagaka",
    "rating": 4.0,
    "comment": "I was excited to play it hearing all the good reviews - but I was disappointed. I found myself waiting for the game to end.",
    "timestamp": 1738450800
  },
  {
    "username": "kraedy",
    "rating": 4.0,
    "comment": "Game state changes too much on a turn that I felt like I couldn't do any planning until it was my turn. Leads to too much AP and downtime, and just wasn't for me.",
    "timestamp": 1733180400
  },
  {
    "username": "parpari",
    "rating": 3.7,
    "comment": "This not bad game. However; the problem is this game is one the most AP inducing game that I have ever played because players have a lot of options on their turn. Plus; they can not plan their turn because tactical nature of the game. All these options even do not create good dynamism because every player aim is the same each turn. That why I do not know who the audience of this game? Trajan has similar mechanism but blow this out of the water.",
    "timestamp": 1733094000
  },
  {
    "username": "Ryan Keane",
    "rating": 3.5,
    "comment": "Too dry and mathy for me. I'm not a fan of mancala style spatial planning anyway, nor am I a fan of turn order bidding, especially when money used to bid directly converts to points. The hidden money and end game scoring made it hard for me to really know who was winning, so even though there is a lot of player interaction, apart from the competition for more yellow meeples I was primarily focused on the math-heavy comparing of which of all my options will get me the most points. Not a fan of Istanbul either, but I rate that just a tad higher.",
    "timestamp": 1726610400
  },
  {
    "username": "btasam",
    "rating": 4.0,
    "comment": "Death by a thousand choices. I think it's probably best for players who enjoy intuitive gameplay because a) all decisions generate points of some kind and b) there's little opportunity for understanding the impact of those decisions.",
    "timestamp": 1718056800
  },
  {
    "username": "berniethered",
    "rating": 4.0,
    "comment": "AP cursed\n\nI do like the 2 player draft for order with 2 pawns. that is cool.",
    "timestamp": 1715292000
  },
  {
    "username": "wkover",
    "rating": 5.0,
    "comment": "We stopped at Two because crowds frighten me. Also because too many tribes can sometimes lead to racial tension and spontaneous breakdancing.",
    "timestamp": 1761519600
  },
  {
    "username": "Termino476",
    "rating": 5.0,
    "comment": "Regalado a Ale",
    "timestamp": 1756072800
  },
  {
    "username": "Zengoeroe",
    "rating": 5.0,
    "comment": "The mancala mechanic sounded absolutely fabulous, however, I did not like what the game did with that mechanic once I've played it and I'm convinced that using the mancala mechanic differently it could be amazing.",
    "timestamp": 1754690400
  },
  {
    "username": "Ginewra",
    "rating": 4.8,
    "comment": "bga",
    "timestamp": 1754085600
  },
  {
    "username": "Joka61",
    "rating": 5.0,
    "comment": "BR 2014",
    "timestamp": 1752876000
  },
  {
    "username": "g4bor",
    "rating": 5.0,
    "comment": "family collection\n\nThe kids are enjoying it so far and that's fine, but at the end of the day it's a rather dull Euro under a thin layer of Arabian Nights paint.\n\n+ Whims of the Sultan",
    "timestamp": 1751493600
  },
  {
    "username": "mikesanerd",
    "rating": 4.8,
    "comment": "The mechanics of this game are pretty good, but I found it super boring to play. I think it is just too abstract and non-thematic for me to get into it. For me, this game is in the same category as games like Splendor and Chess, which I also think are good but not very fun.",
    "timestamp": 1751407200
  },
  {
    "username": "Jasper_Scott",
    "rating": 5.0,
    "comment": "Played this game at the weekend, and I feel this is a very good game.\nI played a three player game and there was some instances of analysis paralysis but overall it was a very fast flowing game.\nWhen i first introduced it to the group, people were not impressed (i feel the look of the game put them off), but once they started to play everyone had a great time and everyone commented positively on the game afterwards.\nEvery move you are gaining something.\nVery much recommend this game.",
    "timestamp": 1750629600
  },
  {
    "username": "toine216",
    "rating": 5.0,
    "comment": "March '25 - Played async on BGA. Not interested in working out all the permutations of optimizing my turn, even asynchronously, so I definitely wouldn't want to play this in person for the risk of sitting through the AP people always mention with this game. I could see most of the fun being in the turn order auction and determining when to bid high for a big turn. Unfortunately the actual turns are the bulk of the game and I didn't find them that enjoyable.",
    "timestamp": 1742598000
  },
  {
    "username": "GypoNolan",
    "rating": 5.0,
    "comment": "Hmmm I think it's been too long since we've played this to collect my thoughts. It seemed like everyone was playing a different game, and some relief more on luck than others. The challenge of finding a desirable move whilst not creating moves for others is interesting but also a bit AP inducing. I would need to play more to see if you can balance many different strategies in the same game, or if you want to specialize as I did. The specialization wasn't that fun.",
    "timestamp": 1740610800
  },
  {
    "username": "aaj94",
    "rating": 5.0,
    "comment": "Five Tribes is an incredibly tactical game. Every turn, you will be scoping out the game board for the best possible turn, and then bidding on the turn order (which brings in some nice bluffing and planning -- it's possible to way overbid for turn order). Because of this, it can be prone to analysis paralysis, but this doesn't happen often if you keep players moving.\n\nI sprinted to a tight win in our latest game because I specialized on the market almost to the exclusion of everything else. I've seen other players win with Djinns, with conservative bidding, and with great area control on the board. The great part is, you need to focus on multiple victory point engines in addition to your primary one, because one specialty won't be enough to bring you to victory.\n\n(Your brain might also work better with Yamatai -- mine did!)",
    "timestamp": 1734562800
  },
  {
    "username": "tectactoe",
    "rating": 5.0,
    "comment": "Could imagine this being a nightmare for AP prone people/groups. Which is part of the reason I've never acquired a copy or had a strong desire to do so. I'm glad it finally made its way over to BGA, though, because the game is great; easy to learn but difficult to master, with a strategic depth that continues to grow the more I play. Perfect for asynchronous play because, yeah, I've sat there for 15 minutes before trying to puzzle out and calculate the most optimal move and that ain't gonna fly on game night.",
    "timestamp": 1733785200
  },
  {
    "username": "hiimjosh",
    "rating": 5.0,
    "comment": "A good game but not one that really inspires me. I'd happily play again and enjoy would likely it. Might need the expansion",
    "timestamp": 1732489200
  },
  {
    "username": "Hoarderoncredit",
    "rating": 5.0,
    "comment": "I am selling this one. I gave it a try a couple of times and it just fell flat. It feels like work. I don't see the fun part, especially after being spoiled with all the other better games with similar complexity and length. It's too mathy, themeless and it takes too long to think about the optimal move. A good example of an overrated game.",
    "timestamp": 1731970800
  },
  {
    "username": "Oezz",
    "rating": 5.0,
    "comment": "I really like the theme, art and components. Djinn are cool! I enjoy the gameplay, but don't really find it captivating. I also hate AP and this game tends to provoke a serious amount in other players. Pulling off a huge move feels amazing, but they are few and far between.",
    "timestamp": 1719180000
  },
  {
    "username": "Roozbeh17sep1989",
    "rating": 5.0,
    "comment": "2024/05/09",
    "timestamp": 1715464800
  },
  {
    "username": "Euroman",
    "rating": 6.0,
    "comment": "Great game with interesting choices. Suggest a timer for the AP prone. Also suggest just taking turns without bidding in a 2-player game because having two turns in a row will really get the AP going for some.",
    "timestamp": 1762615200
  },
  {
    "username": "ditterio",
    "rating": 6.0,
    "comment": "A very unclear game. I hated it.",
    "timestamp": 1755208800
  },
  {
    "username": "onceplayed",
    "rating": 6.0,
    "comment": "initial bga rating. i think it could be quite fun but must be right mood and right people. depending on people you better bring timers for this game because it has a lot of easily calculable options. it plays like a more complex version of splendor.",
    "timestamp": 1754085600
  },
  {
    "username": "dougfoolery",
    "rating": 6.0,
    "comment": "Interactive tactical puzzle with innovative use of the Mancala mechanism. The different ways to score are well balanced and their efficiency changes with how the meeples are laid out. I find the number of options overwhelming and board state changes so dramatically each turn, that it is almost paralyzing to play. Great table presence and I like the Arabian theme even if it is loosely implemented.",
    "timestamp": 1753653600
  },
  {
    "username": "kivi2004",
    "rating": 6.0,
    "comment": "All Cards Sleeved",
    "timestamp": 1753394400
  },
  {
    "username": "aresil",
    "rating": 6.0,
    "comment": "2p",
    "timestamp": 1752530400
  },
  {
    "username": "Mersion",
    "rating": 6.0,
    "comment": "With expansion",
    "timestamp": 1750111200
  },
  {
    "username": "DaBiebs",
    "rating": 6.0,
    "comment": "Only played once, but intrigued and would play again. I remember it sort of like engine builder meets tic tac toe",
    "timestamp": 1749420000
  },
  {
    "username": "Vladi4ka24",
    "rating": 6.0,
    "comment": "Слишком много вариантов и долгое ожидание хода.",
    "timestamp": 1747605600
  },
  {
    "username": "speter22",
    "rating": 6.0,
    "comment": "A very satisfying puzzle. Definitely falls into the camp of \"what gives me the most points this turn\" instead of \"what can I do to build up my engine for later.\" The bid for turn order, the meeple assassinations, and the ways you can mess with the mancala to the detriment of your opponents give this game just enough fire to elevate the experience beyond a pure efficiency puzzle, too. I think it's probably good at all player counts, and I don't think it gets quite as AP-prone as others have experienced. And that's coming from me, the quintessential turn turtle.\n\nI'm bummed by the execution of the theme, though - the implementation of slaves is distasteful and not really engaged with (they're gained in the same manner as other goods, used just as a wild resource, and that's it), and some of the art on the Djinns is too male-gaze-y (which is nothing new in board games, but it deserves to be called out every time anyway).",
    "timestamp": 1746655200
  },
  {
    "username": "Jackdanielgta",
    "rating": 6.4,
    "comment": "Good condition.\nFirst Edition.\nBox: Very minor shelf wear\nCOmponents: Great condition",
    "timestamp": 1746482400
  },
  {
    "username": "JohnWaffles",
    "rating": 6.0,
    "comment": "I can see why this is so highly rated, but the game as a whole is a little too point salad-y for me to want to return to regularly.",
    "timestamp": 1746223200
  },
  {
    "username": "Aruwen",
    "rating": 5.5,
    "comment": "initial rating after one play",
    "timestamp": 1745272800
  },
  {
    "username": "spencyrrh",
    "rating": 6.0,
    "comment": "2025-04-08 (1 play at 2 | BGA | rules scratched in play):  6 \n\nYou bid money for turn order in a mancala variant on a shared 6x5 grid of tiles with five different shared pieces represented by coloured meeples. On your turn, you take one tile's meeples, dropping them off one per tile at a time, moving orthogonally. When down to the last meeple in your hand, you take it and all meeples matching it from the final tile. If the tile clears, you claim that tile for its VP. Either way, you take that meeple's action: get VP; buy different types of bonus card; get money; or remove other meeples. Variability in setup and decisions allows for a googol of gamestates.\n\nThe game enjoys middling rules overhead, but very high emergent complexity. Every decision you make could set up your opponent(s), and you make dozens of multivalent decisions every turn. Play this with crunchers if you want to lose both your game and the entire evening. The setting miraculously achieves both absence and offensiveness. I feel it needed fewer of everything: types of resource; cards; meeples; rules, etc.. Nothing you do feels like anything, and an hour can pass without comment or chuckle. Despite it offering a Spen-core adjective salad: 'tactical, highly interactive, Euro-abstract spatial puzzle', I feel ambivalent. I would not turn it down with the right opponent, because it diligently tickles my puzzle sulcus. But I anticipate most sessions of it sapping my will to live.\n\nI like the look, but find the game has too much colour for its identity and readability. It worked okay on BGA. An extremely dry, brainiac game like this doesn't match the Days of Wonder candy cane gloss.\n\nThe rules go down okay. 2p seems ideal to avoid slowdown.",
    "timestamp": 1744236000
  },
  {
    "username": "totero",
    "rating": 6.0,
    "comment": "Medium - Abstract - 7.0 Includes - Artisans of Naqala",
    "timestamp": 1742770800
  },
  {
    "username": "martyparty",
    "rating": 6.0,
    "comment": "PLAY 2025",
    "timestamp": 1742166000
  },
  {
    "username": "Supercapy",
    "rating": 7.0,
    "comment": "Un juego estratégico TOP, con muchas maneras de conseguir puntos a las que tendrás que prestar atención de manera simultánea. Las estrategias de los genios le dan un plus de variabilidad. La mecánica del Mancala le da un aire fresco que lo diferencia de los típicos juegos en los que puntuas por varios frentes. El arte es precioso. Lo recomiendo mucho.",
    "timestamp": 1762470000
  },
  {
    "username": "MorelliBuendia",
    "rating": 6.5,
    "comment": "The meeple movement mechanic is very original,. I've played it at 2p and 3p, and it works great. However, if you try to find the optimal move every turn, it might take some time, since you need to evaluate the whole board, which changes with every turn. Therefore, avoid playing this with people with AP.\n\nMogul Scale: 2/B.",
    "timestamp": 1761692400
  },
  {
    "username": "WVinz",
    "rating": 7.0,
    "comment": "2.85",
    "timestamp": 1761606000
  },
  {
    "username": "SgtHatred",
    "rating": 7.0,
    "comment": "Includes the fakirs and dhenim mini expansion",
    "timestamp": 1761170400
  },
  {
    "username": "rkleopold",
    "rating": 7.0,
    "comment": "!!!!! Goes",
    "timestamp": 1760738400
  },
  {
    "username": "eldub",
    "rating": 7.0,
    "comment": "I understand why this game is revered, but I just sucked at it, and my partner got tired of it after like 10 plays or so, but I think I'd probably pick it back up at the right price secondhand.",
    "timestamp": 1759442400
  },
  {
    "username": "boardwanderer",
    "rating": 7.0,
    "comment": "A great modern take on the mancala game (or Bantumi for those who've owned Nokia phones during the 2000s like me). I'm eager to explore other strategies that can be pursued here since there's alot. Because there is alot, it is required that you think about what you'll do during your turn during other players' turns since the risk of AP is very high with so many options available. This is best kept at lower player counts as a result with 3P Max.",
    "timestamp": 1758924000
  },
  {
    "username": "Beefy79",
    "rating": 7.0,
    "comment": "Tried at T&V",
    "timestamp": 1758146400
  },
  {
    "username": "bald_bull",
    "rating": 8.0,
    "comment": "– Whims of the Sultan\n– The Artisans of Naqala",
    "timestamp": 1762684440
  },
  {
    "username": "SunnyD44",
    "rating": 8.0,
    "comment": "Played a two player game. Really enjoyed the strategy in deciding your move but also considering what the other player would do so you don't benefit them too much. There are many ways to earn points, this is the sort of game that multiple plays you will get better and can try different strategies.",
    "timestamp": 1762297200
  },
  {
    "username": "VudyD",
    "rating": 8.0,
    "comment": "D-1\nJ-1",
    "timestamp": 1762038000
  },
  {
    "username": "ismailegler",
    "rating": 8.2,
    "comment": "Mr Cathala brings joy with a deep satisfaction with this one. One of his masterpieces. Never sold. Never old. Always fun and a bit of satisfaction with solid mancala system",
    "timestamp": 1761865200
  },
  {
    "username": "Eugeniosaracino",
    "rating": 8.0,
    "comment": "Esp) Muy buen juego clásico. De los mejores títulos del autor",
    "timestamp": 1761778800
  },
  {
    "username": "artman_russian",
    "rating": 7.5,
    "comment": "1 партия. Оценка предварительная.",
    "timestamp": 1761606000
  },
  {
    "username": "bainewedlock",
    "rating": 8.0,
    "comment": "Rated after two 3-player games.\nVery enjoyable and not as AP-prone as expected, ~1h per game.",
    "timestamp": 1760997600
  },
  {
    "username": "PBandJellyfish",
    "rating": 8.0,
    "comment": "@RV",
    "timestamp": 1760824800
  },
  {
    "username": "Marthinoth",
    "rating": 8.5,
    "comment": "Fisico\nBGA",
    "timestamp": 1762124400
  },
  {
    "username": "Timstikkers",
    "rating": 9.0,
    "comment": "Wonderful game. Art style straight from the 90’s makes me feel nostalgic",
    "timestamp": 1761865200
  },
  {
    "username": "sevs88",
    "rating": 8.8,
    "comment": "Mancala with a reason for picking up meeples and laying them out. Has a bit of analysis paralisis since you can't really preplan your turn much, the board is constantly changing.",
    "timestamp": 1761606000
  },
  {
    "username": "hockeyjones",
    "rating": 8.5,
    "comment": "98\n\nLast play in 2015",
    "timestamp": 1761170400
  },
  {
    "username": "Jjky62",
    "rating": 9.0,
    "comment": "I'd cross the desert to play this.",
    "timestamp": 1760392800
  },
  {
    "username": "manman1",
    "rating": 9.0,
    "comment": "an excellent puzzle game with a great set of mechanics. The balance of bidding for turn order, with finding high paying moves makes for a dynamic and interesting game. More players tend towards a shorter game as valid moves run out faster. plays best at 4, but works with 3. Only held back by the limited player number",
    "timestamp": 1760220000
  },
  {
    "username": "flpii",
    "rating": 8.5,
    "comment": "Great implementation of mancala mechanism. VERY AP prone, as you can't really plan your move on the opponent's turn. Probably best as a 2p game, as you can set yourself up for two turns in a row.",
    "timestamp": 1759528800
  },
  {
    "username": "Tanhauser69",
    "rating": 8.5,
    "comment": "Un rato bonito y lo mejor en cuanto a mecanismo de mancala (aparte de otros). Gana muchísimo con el tiempo.",
    "timestamp": 1759356000
  },
  {
    "username": "Quadenstein",
    "rating": 9.5,
    "comment": "Very distinct rules. This is not a worker placement game, but a worker de-placement game! The color of the meeples (=\"tribes\") you remove determines your action. I like it very much.\n\nPerfect for 2 players. Plays in less than 60 minutes. A clever djinn management is an important key to win this game.\n\nThe expansion \"Artisans of Naqala\" brings some fresh ideas, including a sixth tribe.",
    "timestamp": 1761429600
  },
  {
    "username": "MissP1ggy",
    "rating": 10.0,
    "comment": "Interesting spacial game play, many strategies, gorgeous, thinky and very different from other games. + Artisans expansion. Dutch summary: https://boardgamegeek.com/filepage/213761 Dutch solo rules: https://boardgamegeek.com/filepage/218065",
    "timestamp": 1760565600
  },
  {
    "username": "Roby73",
    "rating": 10.0,
    "comment": "Magnifique",
    "timestamp": 1759874400
  },
  {
    "username": "angstyzebra",
    "rating": 10.0,
    "comment": "Mancala Tactical Strategy\n\nExpansion:\nHomebrewed 5th player",
    "timestamp": 1758578400
  },
  {
    "username": "OGRussHood",
    "rating": 9.5,
    "comment": "My 2025 Top 250: #185\nMy 2019 Top 200: #162\nMy 2018 Top 100: #70",
    "timestamp": 1758492000
  },
  {
    "username": "BionicBeaver",
    "rating": 9.9,
    "comment": "I have the Artisans expansion.",
    "timestamp": 1758232800
  },
  {
    "username": "AlPacino11",
    "rating": 9.8,
    "comment": "It belongs to the rare case when my great expectations are fulfilled! Great abstract puzzle like game!",
    "timestamp": 1757887200
  },
  {
    "username": "Jalanaga",
    "rating": 10.0,
    "comment": "1-4x",
    "timestamp": 1757628000
  }
]