[
  {
    "username": "tectactoe",
    "rating": 1.0,
    "comment": "Thought I'd love this one because of the theme. And I do like the theme, I guess, but I don't think it translates well to the gameplay. Or at least it doesn't inform the gameplay in a way that makes things intuitive. Felt convoluted at times and found myself just \"going through the motions\" at others. Needs a few more plays for a more accurate assessment but my initial thoughts are largely indifferent.",
    "timestamp": 1761519600
  },
  {
    "username": "Scifi66",
    "rating": 1.0,
    "comment": "Med-heavy worker placement game by Mindclash. Way too long for what it offers. Even longer if you have to teach it. The bling is nice but it's a pretty boring worker placement game at its heart.\n+ Mech plastic figures are awesome\n- Overstays its welcome (>3 hours)\n- Factions lock your strategy\n- Resource cube colours are too similar\n- Table hog",
    "timestamp": 1750716000
  },
  {
    "username": "lililililil",
    "rating": 1.0,
    "comment": "Automata",
    "timestamp": 1747432800
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "Time travel for resources? That's.... just a loan. You put loans in your game, congratulations.",
    "timestamp": 1736377200
  },
  {
    "username": "hamsternice",
    "rating": 1.0,
    "comment": "Something I won't enjoy because the game and the components alone are too busy and too complicated so many phases with a complex array of the board with so much going on you don't know where you are going plus futuristic or anything sci-fi will bore me immediately. I could not do this game.",
    "timestamp": 1695247200
  },
  {
    "username": "ijoaqi",
    "rating": 1.0,
    "comment": "Extremely boring for me. But I'd give it another chance",
    "timestamp": 1617487200
  },
  {
    "username": "ionas",
    "rating": 1.0,
    "comment": "Dead boring point salad indirect interaction denial with a meaty luckfest added on top like a strawberry pie with bacon.",
    "timestamp": 1571004000
  },
  {
    "username": "Dynatron",
    "rating": 1.0,
    "comment": "Couldn't get into it, too convoluted.",
    "timestamp": 1520895600
  },
  {
    "username": "elestren",
    "rating": 1.0,
    "comment": "KS collector arrived totally blown up and since March the editor supposed to send back a box pretended to forget and cheated the sleeve ...",
    "timestamp": 1500674400
  },
  {
    "username": "TertiaVigilia",
    "rating": 2.0,
    "comment": "You just try to collect points before time runs out. No immersion, no interaction (despite taking away each other's valuable action spaces). I simply lost interest after a while and couldn't bring myself to play it again.",
    "timestamp": 1747432800
  },
  {
    "username": "Vitho",
    "rating": 2.0,
    "comment": "Very hard to explain : players must anticipate each turn what they will do ... like a poker.\n\nSold 2021-03-03: Grat but, too long to prepare.",
    "timestamp": 1700348400
  },
  {
    "username": "Schroederek",
    "rating": 2.0,
    "comment": "I'm not sure how you could take a theme as awesome as doomsday time travel and make it more boring Very little player interaction. It's not even a compelling worker placement game. Great artwork though.",
    "timestamp": 1688680800
  },
  {
    "username": "GarfieldKlon",
    "rating": 2.0,
    "comment": "Very interesting mechanism with the time travelling. But unfortunately this is a heavy multiplayer solitaire. And it needs so much time to explain :/\n\nBecause of that, no interaction and too long explanation I will never play it again.\n\n\nTheme:           Very little\nGameplay:        A lot of possible actions\nInteraction:     Almost no interaction\nArtwork:         Could have been better\nLuck:            Very little (dice rolling)\nStrategy:        Multiple strategies possible\nComponents:      Ok, nothing special\nPlay duration:   Ok\nEasy to teach:   A lot and time travelling is complicating at first sight\nRules quality:  not read\nSetup time:      Ok\nNo downtime:     Ok\nReplay value:    Different strategies possible",
    "timestamp": 1668639600
  },
  {
    "username": "BloodyMe",
    "rating": 2.0,
    "comment": "The game is nicely designed and offers many options, but I won't play it again because it is too complicated for my taste.",
    "timestamp": 1585951200
  },
  {
    "username": "wafflebun",
    "rating": 2.0,
    "comment": "I think for what it is, it's an okay middle weight euro game -read worker placement- however the time travel system theme is tacked on and only is present in a thinly veiled loan system, and overproduced mechs (if you got the extras).\n\nHowever it lacks any real depth or interaction. The worker placement aspects are too open in terms of people caring about the same resources. Secondly it's limited in how much presence it takes once into the second or third round individuals will have had better tech that makes the main board less interesting other than to develop more tech.\n\nAnother middle manager game that I can easily part with.",
    "timestamp": 1581980400
  },
  {
    "username": "AmandaDesignsGames",
    "rating": 2.0,
    "comment": "This is so overproduced it actually infuriates me. Not only that, but it feels like they did the opposite of streamlining: they tried to make everything as complicated as possible, adding layers upon layers of rules to hide the lack of strategy in this very standard worker placement. The theme is interesting, so are the worker types, and the retheme of loans to \"warps\", but mechanically, it doesn't hold up. Most WYG titles achieve twice that depth in a quarter of the rules.",
    "timestamp": 1567634400
  },
  {
    "username": "GhostInside",
    "rating": 2.0,
    "comment": "Played once at a convention. It felt MASSIVELY over-produced and over-complicated.\nSlow, grueling, not interesting, not fun.\nIt was like every time you want to take any action, there was game mechanic standing in your way specifically put there to force you to take an extra 4 steps to achieve anything productive.\n\nAnd this is from a guy who LIKES big, long games with a bunch of complexity.\n\nThis experience was so bad for me I kept hoping there was some form of player-elimination in the rules (there isn't) so I could intentionally tank the game.\n\nYou know you have found a game that doesn't resonate with you when your win condition is being able to walk away from the table and never look at it again.",
    "timestamp": 1560808800
  },
  {
    "username": "baah",
    "rating": 2.0,
    "comment": "Only one game, with extension.\nSuffered all the game long, rules are long to explain, got no thrill from the game. I was the only one who could counter an opponent from ending the game, and after 3h30 I was fed up, so I didn't and the end was a relief.\n\nI understand some people might like this game, I can't say there's a flaw or any problem in the game, but for me it was a real pain to play Anachrony.",
    "timestamp": 1516575600
  },
  {
    "username": "Failedhaiku",
    "rating": 3.0,
    "comment": "Poor game design and balance.",
    "timestamp": 1734303600
  },
  {
    "username": "olymacfoogal",
    "rating": 3.0,
    "comment": "Yet another overly complicated worker placement that goes for decision space obfuscation by design. I much prefer worker placement games with less rules that are more intuitive and have clear paths to victory. Not do these 10 steps while someone else does 10 different steps and you score points for a bunch of the stuff you were gonna do anyway. The theme is cool so kudos for that, but I'd rather wrestle with the impacts of the other people's decisions than the mechanical puzzle of the game. There is so much you need to do here that someone else taking your spot just doesn't really hurt that much, you go and do something else. Most people love every iteration of this stuff tho so what do I know. My expectations were too high given the praise I kept hearing.",
    "timestamp": 1730674800
  },
  {
    "username": "Maglinkinpark",
    "rating": 3.0,
    "comment": "This game stands as the quintessential example of an over-complicated and ultimately hollow Eurogame. Each turn feels repetitive, lacking any meaningful sense of progression or development, which drains the experience of excitement or satisfaction. Instead of feeling like you’re building towards something grand, you’re stuck in a monotonous cycle, where every decision feels like a slight variation of the last.\n\nWhat’s more frustrating is how often you find yourself diving back into the rulebook, both during your turns and while waiting for others. The rules are so convoluted that even after multiple plays, you can’t escape the constant need to double-check details, which disrupts the flow of the game and keeps you from fully immersing yourself in the experience.\n\nTo add insult to injury, the game’s production feels like it’s trying too hard—everything from the components to the design feels overly elaborate, as if complexity for complexity’s sake was the goal. Instead of enhancing the game, this over-the-top approach only serves to underscore its weaknesses. Rather than creating a rich, engaging experience, the game feels bogged down by its own weight, leaving you wondering if all the effort was really worth it.",
    "timestamp": 1724450400
  },
  {
    "username": "LloydGM",
    "rating": 3.0,
    "comment": "Drags",
    "timestamp": 1715551200
  },
  {
    "username": "Evidence8",
    "rating": 3.0,
    "comment": "Not as thematic as we wished it to be. Why shpuld you play this over all the other Worker Placement All-Satrs? Don't see the point.",
    "timestamp": 1707606000
  },
  {
    "username": "SoloGamingDad",
    "rating": 3.0,
    "comment": "I think this is a fine game with a kind of cool theme, but I don't see what all the excitement is about. It's solid worker placement, which is nothing special in itself, wrapped up in a fine gauzy somewhat pretty and somewhat overdone dress. And it does a fine job, just really not amazing. Some of that pretty dress actually gets in the way sometimes. All of which is to say this game is made by Turczi: there's lots of extra complications and furls laid on top of something that works fine. The extra stuff detracts from my fun. I still sometimes want to play, but once is enough, which means I never really internalize the rules. Playing with expansions means bopping around between multiple sections of three or four rulebooks, and solo adds more sections. It's a pain that detracts from my fun.",
    "timestamp": 1692396000
  },
  {
    "username": "brownsound",
    "rating": 2.9,
    "comment": "Przerost formy nad treścią.",
    "timestamp": 1690495200
  },
  {
    "username": "Rontuaru",
    "rating": 3.0,
    "comment": "Not until Anachrony has it been so lucidly clear to me why Turczi's claim to fame is his solo mode designs. This was such a snoozer, that I may as well have been playing alone.\n\nI placed workers to gather resources to fulfill contracts...again, and again, and again...and I could not care less about the minutiae of how my opponents were doing just as I do, in barely different fashion. I can tolerate this trait in the service of a greater game, but Anachrony presents this singular gameplay loop in absence of anything remotely interesting, resulting in an experience that is beyond mundane. The toy factor of the exosuits does some real heavy lifting, and the only other purportedly unique bit (the 'time-travel') is a contrived resource loan.\n\nThe only thing it thematically impressed upon me was the desire to evacuate myself from the play about halfway through the game.",
    "timestamp": 1683669600
  },
  {
    "username": "atmpoison",
    "rating": 3.0,
    "comment": "The graphic aspect of the game does not help.\nToo long.\nA large number of components and preparation, for an experience that other games get with much less.",
    "timestamp": 1682200800
  },
  {
    "username": "logopolys",
    "rating": 4.0,
    "comment": "Science Fiction Game\n\nWorker-placement game that doesn't really sell its theme of time travel. Some neat mechanics with having to wake workers up, but at the same time, that mechanic does feel like the game is making you do extra work to get to the fun parts of the game, which is never a good sign.",
    "timestamp": 1760652000
  },
  {
    "username": "Killi",
    "rating": 4.0,
    "comment": "Hated it both times I played.\n\nOver rated.",
    "timestamp": 1756504800
  },
  {
    "username": "okonomichiyaki",
    "rating": 4.0,
    "comment": "this game made me realize i'm not missing anything from these modern heavy euros. maybe they're just not for me, but the supposed tight integration of mechanics and theme fell totally flat for me",
    "timestamp": 1738191600
  },
  {
    "username": "lewix",
    "rating": 4.0,
    "comment": "일꾼 놓기이면서 독특한 개념(미래 자원을 가져와 사용하는 것)이 특징인 게임. 뭔가 해야 할 것이 체계적으로 준비되어 있긴 한데 실제 하면 뭔가 할 것이 없는 느낌이 드는 게임... 목적성이 직관적이지 않아서 그런 것 같긴 하다...\n\n확장을 껴서 했는데 부실한 설명서, 주사위에 의해 주어지는 항목이 너무 큰 점으로 인해 애매한 상황이 발생하였고 시간으로 인해 중단함.",
    "timestamp": 1726956000
  },
  {
    "username": "Cone Defense",
    "rating": 4.0,
    "comment": "Overwrought and convoluted worker placement game. The ideas of time travel with a bit of push your luck are interesting, but it doesn't change the fact that this is a bear to teach with not enough coming back out for your effort.",
    "timestamp": 1726005600
  },
  {
    "username": "Duke_Rufus",
    "rating": 4.0,
    "comment": "Oh my lawd. This SUCKED. The opposite of elegant. Kickstarter promo glut at its zenith",
    "timestamp": 1725228000
  },
  {
    "username": "Persereus",
    "rating": 4.0,
    "comment": "Very dry.\nTheme could be also about taking a credit and you have to pay back",
    "timestamp": 1724104800
  },
  {
    "username": "kikerl",
    "rating": 4.0,
    "comment": "Nothing that hasn't been made (much better) a hundred times before. Too much chrome and gimmicks (the \"buying from the future\" mechanic is not as good as it sounds) try to hide a clunky and boring (for me) gameplay.\n\nAnd this is at Nr. 49 of the BGG classification...\n\nGave it as a gift to a friend who wanted to try the solo system. Good riddance...",
    "timestamp": 1715724000
  },
  {
    "username": "Andikon",
    "rating": 4.0,
    "comment": "I had a hard time finding *basic* rules in the handbook. I wish it had more explicit statements instead of having to deduct an answer from other statements or search in forums.\n\nOverall, I never got into any flow or had positive experiences during my few (solo) games.",
    "timestamp": 1709334000
  },
  {
    "username": "shmonkey",
    "rating": 5.0,
    "comment": "Base Game Solo with Chronossus and Chronobot from fractures: The game itself seems like more complex but standard worker placement faire. There is a nice resource management aspect to it, as well as tableau building. There is asymmetry between starting resources, leader cards, A and B sided player boards, and A and B side evacuation conditions. Once you start playing, the game seems pretty standard. THe time system does just feel like a loan, with increasing penalties the longer it takes to pay it back.\n\nThe chronobot and chronossus play pretty similarly, although the chronobot edges it out a little and plays a little more humanlike and variable. Both very solid and easy to use AI systems.\n\nReally makes the game shine. Base anachrony is fairly meh, but fractures really adds a ton with blinking and a new player board. lots of rules overhead but the only way to play IMO.\n\n\nFractures really opens up the decision space. multiplayer is really fun and i hope to be able to explore more of this in the future. 3p tightened things up considerably, and i found myself with available workers but no useful actions to assign them to. I passed out of those rounds early, and got decimated. The game is a lot of fun. Still lots of icons to reference, I think the iconography and language independence of this one is a net negative, since i spent half of my play buried in the original and fractures appendices. Ultimately im going to sell because I dont feel like the game provides a good enough experience for the amount of shelf space the infinity box takes up",
    "timestamp": 1759874400
  },
  {
    "username": "selvalabelva",
    "rating": 5.0,
    "comment": "Brainburn         Longevity    \nLuck impact       Rules/Setup  \nInteraction       Involvement  \n\nAftertaste           Enthusiasm   \n\n Great at all player count\n Rated base game w/o additional modules\n Confrontation: indirect\n\n Feels samey without expansions",
    "timestamp": 1751320800
  },
  {
    "username": "Barthi",
    "rating": 5.0,
    "comment": "Christmas Present 2020\n\nSold January 2025",
    "timestamp": 1746914400
  },
  {
    "username": "Jimbojumbo",
    "rating": 5.0,
    "comment": "Point salad with an apocalypse theme that ties well into the mechanics.\n\nI enjoyed the different worker classes and time travel mechanic.\n\nThe factions are just ok, lightly asymmetric with minimal art and storytelling.\n\nWorst game I’ve seen for colour-blindness, I struggled to differentiate 3 of the five colours, the cubes themselves are ok but the graphic design on the board and cards are washed out and look similar to me.",
    "timestamp": 1746396000
  },
  {
    "username": "FD22",
    "rating": 5.0,
    "comment": "An anachronistic game. It might have been good in 2017, but boy has this aged badly...\nWorker placement and cube trasformation galore in an athematic, inconsistent setting. A game of the past.",
    "timestamp": 1742943600
  },
  {
    "username": "shayan_sa",
    "rating": 5.0,
    "comment": "without fractures of time, there is nothing special about Anachrony. It is slow, boring, long tablu building. With fractures it becomes a good game, However it is still too long, and your tablu is still not that itneresting.",
    "timestamp": 1739487600
  },
  {
    "username": "Beastly_Venturer",
    "rating": 5.0,
    "comment": "4 plays. With every play you tend to see how much this game is a mishmash of mechanisms that don't meld together to create a strong game. Piecemeal.",
    "timestamp": 1737500400
  },
  {
    "username": "RollPatrol",
    "rating": 5.0,
    "comment": "Started a couple of times but the game bores me to hell so far",
    "timestamp": 1736290800
  },
  {
    "username": "tolhs",
    "rating": 4.5,
    "comment": "2023:+1",
    "timestamp": 1733958000
  },
  {
    "username": "ajie426",
    "rating": 5.0,
    "comment": "2020年9月8日初玩感受：\n玩的是中文版的时空乱序，结果掀桌了，自带的模组都没加。\n优点：游戏背景和代入感不错。\n缺点：几个工放位很散，而且没有combo，感觉不管做什么收益都差不多。\n当时觉得可以打7分。\n2024年11月11日应小伙伴强烈要求再开一局（3人），感受：\n1、摆出来真好看，猛拍了一组照片。\n2、加了时间裂隙扩展，玩了好久（2个多小时）才到第三时代。有了闪现之后行动太多了，上次玩不知道是谁掀的桌，反正这一轮是我哈哈哈！虽然我用了扩展派系“联合派”，刷了一堆的天才，每轮他们行动完后我都能动蛮久，但是也没有爽感只觉得累。\n3、感觉这游戏两个人玩就好。\n实在是不喜欢，它在我心里只值5分了，以后不会再开。",
    "timestamp": 1731279600
  },
  {
    "username": "Takhyon",
    "rating": 5.0,
    "comment": "I enjoyed my first play of Anachrony, despite thinking it's overcomplicated for what the game is. I enjoyed the second play less, and the third play even less. Each subsequent play the the flaws of the game started to become more apparent, and now I have arrived to a point where I think this is genuinely a bad game I don't want to play again. Not surprising considering Turczi's fingerprints are all over it and I typically despise his stuff.\n\nI reckon I was initially impressed by the concept of the different worker types and the tight worker placement it provides, leading to interesting sequencing considerations about which workers to use, when to use them, and where to use them since you can also keep taking actions on your player board once you have built it up. This is by far the best part of the game. Even the much applauded time travel gimmick is just a loan mechanic with a fancier name, though I have to give it to the game that the way it's been executed makes it feel more thematic.\n\nUnfortunately though the game is convoluted and overdesigned. It's so phase-y, has so many clumsy design choices and complexity for complexity's sake, but the game loop is actually relatively mundane. You get resources, you find a way to convert said resources to victory points. It's just been disguised as something extraordinary because there's so many different mechanisms and icons and bits and pieces, but it's all smoke and mirrors. So many other, more robust and better games, achieve much more with much less. Some of them you can probably even play in the timeframe it takes to only setup Anachrony.",
    "timestamp": 1727992800
  },
  {
    "username": "honk3d",
    "rating": 5.0,
    "comment": "+3 np\nM",
    "timestamp": 1726610400
  },
  {
    "username": "annsk8r",
    "rating": 5.0,
    "comment": "YAWN! Beautiful artistically, but the game play is tedious. One \"turn\" is made up of multiple phases and in one of the phases, players go until everyone passes...end result is one turn is 30-45 minutes. Variable player powers feel totally unbalanced and pointless. I don't normally post negative comments, but because of the raves this game has gotten, I was afraid if I didn't I'd forget how much I dislike it and accidentally buy it. It's not awful, but it's highly forgettable which is not what you want for a game of this length and price point.",
    "timestamp": 1726524000
  },
  {
    "username": "purplecow55",
    "rating": 5.0,
    "comment": "A turn based worker placement game where you can take out loans from yourself. Each turn you need to have 'platforms' for your workers to actually be placed on worker placement board, or non-platform worker placement spaces on your player board.",
    "timestamp": 1721426400
  },
  {
    "username": "grasa_total",
    "rating": 5.0,
    "comment": "I enjoyed some amount of my first play, and am only rating this so low because the final score revealed that my whole approach to the game was futile... I think? Maybe I had the right idea and just executed it poorly. Hm.\n\nAt any rate, win or lose this did not have, for me, the fluid verve of Lacerda's games or the spontaneity and adaptation of Suchy's Woodcraft, to name two similar designers I've gotten to try recently. It just had a lot of planning, and lots of moments to feel bad if you planned wrong. And I never felt like I was traveling through time, which is pretty much the whole appeal! (I did feel, a little, like I was outfitting a team to survive in harsh conditions, so that part of the theme comes through.)\n\n[1 play]",
    "timestamp": 1721167200
  },
  {
    "username": "BoomDooger",
    "rating": 5.0,
    "comment": "Chels: 5\nAnt: 5\n\nAnother Mindclash under the belt, and we're left with a similar feeling: that was a lot of work for not much reward. The worker placement and resource collection works well, and leads to some of the best decisions - how many suits do I want to power up, can I afford an time travel loan or a plan B, do I have the right kinds of worker - creating the kind of crunch and brain loops that are the hallmarks of this kind of weight. The theme is fun too, and much of the action is evocative of that theme in a pleasant way.\n\nAt the end of the day, though, multiple parts of the game feel non-essential in a way that increases fiddling without any satisfaction (the breakthrough mini-game, the time time travel messiness, the dice rolling for paradoxes). It's as if the designers wanted to fill every crevice of the game with more stuff, overwhelming the player with distractions, rather than giving players room to breathe and make dynamic choices. A shame, as the dual worker placement system is quite solid.",
    "timestamp": 1719698400
  },
  {
    "username": "Trevor03",
    "rating": 5.0,
    "comment": "Full disclosure, I may not be the target for this game, as I tend not to love heavy-ish games with lots of pre-planning and punishment if you miscalculate.\n\nTo me, Anachrony felt like a reasonably standard worker placement game, with a lot of fiddly rules and exceptions built in. It extends the game length (anywhere from 2.5-4 hours at 4p depending on your group), but doesn't extend the fun. The juice needs to be worth the squeeze, and I didn't feel like the enjoyment factor here was anywhere close to high enough to justify the crunchiness and length of it. YMMV of course, as the game certainly has its share of fans.\n\nWould have liked it more if it was less AP-prone, and had more player interaction beyond the standard \"you took my spot\" and the slight bit of interaction with your pieces on the time travel area.\n\nHowever, it does feel well designed, and for the right person (who likes heavy games and a bit of theme) this could be a 10/10 game.",
    "timestamp": 1717538400
  },
  {
    "username": "debelbot",
    "rating": 5.0,
    "comment": "A lot of oversized components and interconnected mechanisms with a supposedly epic sci-fi theme, but the game feels smaller than it looks.\n\nI like the worker management systems: the different worker types combined with the exo-suits for sending them to the central board.\n\nBuilding on your player board is key and in theory should allow you to build an engine. In practice, both the build action spaces and the buildings selection is too limted for you to create a satisfying engine.\n\nThe impact and the evacuation mechanism are clever and make the 2nd part of the game tenser.\n\nI expected a bit more from the main board actions. Getting workers is good. But the building spaces are critical to the point that everything else feels secondary and only in service to building.\n\nThe super projects are weak and require too much extra effort: having to go back in time, acquiring the right breakthrough tokens and then take the already highly contested build action. It doesn't feel worth it if it's not linked to your evacuation condition.\n\nThis is one of the rare cases where I actually dislike the asymmetry in the factions as it feels more limiting than enabling - pushing you down a specific path (hence the names, I guess). But to me that detracts from the gameplay and frustrates my desire to explore different strategies. Especially since everything is so tight and there aren't too many ways to get points.\n\nThe art is ok and the iconography is mostly clear, but even after 20 plays we still need to reference the super projects, technologies and some buildings.\n\nThe rules are hard to teach and the playing time is too long.\n\nThe fractures of time expansion definitely improves the game and adds a nice timing element of blinking around for extra actions.\n\nBut even with it, the game just feels too tight, prescriptive and anticlimactic. A high concept game that to me fails in the execution.",
    "timestamp": 1711494000
  },
  {
    "username": "Auroric",
    "rating": 5.5,
    "comment": "Anachrony just doesn't hit for me. It is a fairly interesting puzzle: the loan mechanic, how many exosuits to power up and when, the time travel, etc, all these make make for a very deep decision space. The variable starting powers and ability to craft your own worker spots makes for tons of different approaches, but ultimately I just don't find this kind of game super exciting. The theme is neat but doesn't totally grab me, if anything I think it makes it come across as more complicated than it is. For me there just isn't anything here that feels super fun.\n\nIf you love worker placement with tons of depth, Anachrony is great at what it does, and you'll probably really like it. For me it's objectively a good game, but it doesn't produce the kind of experience that I love in board gaming. I think when it comes to worker placement I prefer something a bit more elegant and streamlined like Viticulture, or a bit more interactive like Dune: Imperium. If I'm playing something complex I'd prefer that complexity comes from interaction with the other players, rather than systems within systems of efficiency math.",
    "timestamp": 1762470000
  },
  {
    "username": "xionc",
    "rating": 6.0,
    "comment": "Modern classic that I wanted to try and finally had a chance to. It didn't disappoint Edit: after 4 players game I decrease to 6 as the game could not end",
    "timestamp": 1758924000
  },
  {
    "username": "heatbbx",
    "rating": 6.0,
    "comment": "+ Anachrony Expansions Set\n+ Miniatures",
    "timestamp": 1753653600
  },
  {
    "username": "mikhail_wind_rises",
    "rating": 6.0,
    "comment": "Игра, отражающая культуру потребления в мире настольных игр. Понамешано кое-как механик, друг с другом они вяжутся плохо, куча компонентов плюс, конечно же, огромные миниатюрки... рабочих. Тема чувствуется притянутой к механикам игры за уши. Путешествия во времени работают просто как кредит, даже скорее как просто бонус, который можно получить...\nБезвкусная игра, которая пытается выглядеть крутой и интересной, но за кучей компонентов и оформлением скрывается скучный, вторичный и вообще плохо работающий игровой процесс",
    "timestamp": 1753048800
  },
  {
    "username": "LabRat002a",
    "rating": 6.0,
    "comment": "Anachrony is a worker placement game, and not a bad one, but I prefer more streamlined games. But turns don't take long. You send workers out to the shared board in space suits, create buildings in your own personal bubble that your workers can visit without space suits, borrow resources from your future self in a bootstrap paradox, and squeeze out what points you can after the city is smashed with a meteor. At it's core it's worker placement and point salad. At the start there are so many options. Each character has different starting resources and an ability. You also have a different way to score when you evacuate (which doesn't stop you from playing workers either). Buildings usually have a spot for a worker and possibly a cost in addition to that worker. They might have a special effect. They have various points for building the building, but sometimes also give points when you send a worker to them too. While you have borrowed from your future self, there is a risk of paradoxes and anomalies until your future self pays your past self (despite the whole thing being a bootstrap paradox). Whoever has the most still on loan from their future self each era, or tied for most, must roll the paradox die. They most likely will receive 1 paradox, but may gain 0 or 2 as well. Once you have 3 paradoxes, you clear them and add an anomaly to one of your open building locations. It will be -3 points if you don't clear it by the end of the game, and blocks you from building there. Players can gain breakthroughs by sending their worker to a location that lets them roll the break through dice. They can set either the shape or symbol die to a specific face and roll the other. Then gain the matching breakthrough token. Each breakthrough token is worth 1 point, and additionally 2 points for each set of circle, triangle, square. But often the breakthrough tokens will be spent to build superprojects instead. Superprojects are like buildings and have abilities, but they take two building locations of space, are worth more points, and instead of using the cost of the location have a resource cost of the tile and a breakthrough cost (either 2 specific shapes or 1 specific shape + symbol combination). You also have to have your time focus on the era that the superproject is next too. Time travel is weird in the game. You need to get a building that lets you move your time focus back up to a number of spaces. If you need to go further back, you need more such buildings. And generally you need to activate them with workers like other actions. But they send you back, not forward. So if you need to do multiple things in the past in the same round, you must do them in reverse order with multiple time travel buildings. For example, for your future self to pay your past self and remove the loan that is triggering paradoxes, you must time travel back to the time era where you past self borrowed the resource and then actually lose the resource from your future self. I saw that mechanism and thought that it would be better if I simply did not borrow from my future self so that I don't have to go back in time and repay myself. But you get 2 points each time you repay yourself, so the game encourages it. Though maybe you could still make as many points avoiding that and doing something else. It just felt weird that it was built into the game that you should be borrowing from yourself and risking anomalies and paradoxes just for the points. It's sort of Bill & Ted's Excellent Adventure logic that your past self just borrows what they want and then your future self has to make sure they go back and bring the resource later. If you don't there is -2 points for each resource you didn't repay. You can also apparently repay them at the end of the game without going back and without earning the points. Though you want to pay them back fast to avoid gaining paradoxes & anomalies. At the end of each round, you jump back to the current time automatically. It didn't seem like there was a way to move forward in time ever. The game ends in 7 rounds or when all blocked location tokens are out. Near the end of the game, the city is hit by a meteor and some of the shared board locations gain extra abilities but become one time use. A location also opens for scoring your evacuation points if you meet their requirements. The last player to evacuate gets -3 points. It's unclear to me whether the characters are supposed to know the city is going to be destroyed with a meteor. We are time travelers after all, but we can't jump to the future. But there's no reason why our future self couldn't have told our past self. In which case we are just building up a city knowing it will be destroyed in order to squeeze as many points out of it as possible. It can be punishing in its worker placement aspects. You need to be ready to pay the right resources at the right location and/or time. But there are tons of good buildings, so if one is taken before you can get it, there will be others. But there could be moments where you are building towards a superproject, leaving adjacent locations open for it, and taking the actions to get the 1 or 2 breakthroughs and the several resource cubes necessary for it, only to have it taken or the building and copy action locations already filled. Though breakthroughs are still points on their own. You also have 4 kinds of workers. Not every location can use every worker and some workers have bonus abilities at certain locations. Your workers also don't come straight back to your supply after each round. Most will go to a sleeping side, and you must spend an action to wake them up, generally costing morale (-2 points) or lots of water and a worker and increasing morale. If all your workers are sleeping, you must spend morale to wake them up. So it's good to leave one worker awake to wake up the others. The shared board spaces include build a building or superproject, gain a worker (one of the ones that come up this round) and the associated bonus (2 water, 1 energy core, or victory point), gain a breakthrough token, copy one of those 3 that is already filled, gain resource cubes (1 next to the space and 1 other that came up this round), gain water, or trade resources (just adjacent resources in the conversion wheel, 1 time per action), and evacuation (after the meteor). Any number of workers can be on the gain water, trade resources, and evactuation locations. The gain resource cubes locations have 3 worker spots. There are 2 copy spaces, 1 costs 1 water and 1 costs 2 but makes you the start player. Then the build, gain worker, and gain breakthrough locations have 2 spaces each in a 2 or 3 player game and 3 spaces each in a 4 player game, and the extra spaces have water costs too. So the game may feel different at different player counts. There are lots of choices and at the start of the game it can be daunting, not knowing how to value each thing. But getting locations for workers, the resources to build those locations, and more workers is useful. You need to balance your actions so that you don't have workers without locations nor locations without workers. The game also has end game goals. Such as most water, furthest on the time travel repair track, most workers, etc. Those are good to aim you in a direction. I've played a lot of worker placement games and it is a great mechanic, but this game doesn't stand out to me to recommend it over others. It has those tense moments you want in a worker placement game. But having so much choice for the buildings helps mitigate the actions you spend building towards a building that someone else takes first. But it can still be critical to get to a location before you are locked out of it. The time travel aspect didn't really make the game better to me. I didn't like being encouraged to borrow from my future self just to get some points when I otherwise wouldn't borrow. Or rolling a die to find out whether you got 0, 1, or 2 paradoxes (though you can usually assume its 1) or which breakthrough you got. Especially if I was borrowing to get a certain building only to have someone else take it first. But the game wasn't too long. The symbology wasn't great. There are a lot of possible effects with their own symbology. And it likes to use triangles for multiple things. The red circle with a line through it made it difficult to see the symbol behind it. But I picked up the main symbols quickly and we just had to look up the unique ones as they came up. The miniatures for the space suits are great. The worker tokens slip into them and it's clear who owns which. You never place a worker on the shared board without the space suit, so you always know whose is whose. How many space suits you have each turn is also a choice left up to the player. For each space suit you don't prep, you gain a water. If you need more than the first 3 space suits, you need to spend energy cores for each extra. And after the meteor, only the first space suit is free. In practice, that mechanic just meant you really had to decide everything you wanted to do that round up front. You don't want to prep a space suit if you aren't going to use it. Similarly, when you borrow from your future self, all players simultaneously do that secretly so you don't know for sure if you will likely be the one rolling the paradox die for that era. You can borrow 0, 1, or 2 resource kinds, including water, each color cube, each worker, and a prepped space suit. It doesn't really fit the theme that you can only borrow from your future self at the start of a round either. I'd prefer the game was more laid back with that. But the game does work well.",
    "timestamp": 1752530400
  },
  {
    "username": "aresil",
    "rating": 6.0,
    "comment": "1st 82 vp with facture of time",
    "timestamp": 1752444000
  },
  {
    "username": "Demmiurge",
    "rating": 6.0,
    "comment": "Продаю",
    "timestamp": 1750802400
  },
  {
    "username": "Gamil_",
    "rating": 6.0,
    "comment": "Great game, great components, easier than it appears.\n\nStorage is just absolute garbage, though. This would otherwise be an easy 8.\n\nUpdate: The big box makes the storage (and thus setup) slightly better, but it's still pretty terrible, so no increase in the score. Trickerion's big box does a *vastly* superior job at helping with setup and teardown.",
    "timestamp": 1749938400
  },
  {
    "username": "Yokiboy",
    "rating": 6.0,
    "comment": "This is a good worker placement game. It's not a thematic game. The time travel comes down to being an interest free loan from yourself later in the game that rewards VP when repaid. The four types of workers, the exo-suits to go the the central capital board, and personal boards for the workers without exo-suits make for a lot of neat options.\n\nSadly I'm not a fan of the few random elements in such a long eurogame. My biggest dislike is the \"rolling\" building display, where I always feel like I reveal a much better building for one of my opponents than what I've just built.",
    "timestamp": 1749074400
  },
  {
    "username": "enavico",
    "rating": 6.0,
    "comment": "+ Peculiar theme, for a eurogame\n+ Nice components and good ergonomics\n+ The power up phase forces you to plan ahead\n\n= Factions are not *that* asymmetric, in the end\n= Time travel is just a loan mechanics\n= Luckily the die roll for paradoxes is not a mandatory rule...\n\n- I expected the last rounds after the impact to be more tense\n- The clockwise turn order may represent a problem, in such a heavy game: I would have preferred a Caylus-like mechanism\n- The entire game revolves around the building action: turns feel repetitive in their development\n- I guess the game could be better only if played with expansions",
    "timestamp": 1743372000
  },
  {
    "username": "Aladin1k1",
    "rating": 6.0,
    "comment": "BBG Top50 2025 (Christoph): 27",
    "timestamp": 1743289200
  },
  {
    "username": "KvdBergh",
    "rating": 6.0,
    "comment": "Another big, sprawling and thematic game by the makers of Trickerion. Just like Trickerion there is a great amount of depth to the game and yet it plays surprisingly smooth. The actions are actually pretty simple but it is in the choices where the complexity lies.",
    "timestamp": 1739487600
  },
  {
    "username": "Demram",
    "rating": 6.0,
    "comment": "English version.",
    "timestamp": 1738623600
  },
  {
    "username": "Iron_Salamander",
    "rating": 6.0,
    "comment": "Another decent surprise. An interesting take on worker placement and resource management, with a theme that is engaging, although like most Euros, the theme isn't all that strong, but it is at least present. Lots of choices to make, the game wasn't short, but it did move at a decent pace, so would be ok with playing it again.\n\nDid play it again and dropped it a bit. It's still decent enough, and so far is the only Mindclash game besides Voidfall that isn't a dreadful, tedious slog, or like in Astra's case, ok but rather dull, but it's still not very exciting. At least the theme is cool, and it has some integration with the mechanisms which is rare for a Euro.\n\nOh, as usual, the weight rating is too high. This game is not that heavy.",
    "timestamp": 1738537200
  },
  {
    "username": "Tfu76",
    "rating": 6.0,
    "comment": "Solo",
    "timestamp": 1736636400
  },
  {
    "username": "VaultBoy",
    "rating": 6.0,
    "comment": "Enjoy the way the time travel mechanisms works. Interesting worker placement with the use of suits.\nHas a lot of bits: cubes, tiles, tokens, workers and that's before the expansion contents.",
    "timestamp": 1736204400
  },
  {
    "username": "camidon",
    "rating": 6.0,
    "comment": "Deeply strategic game. Relatively simple gameplay but choices are almost overwhelming. Well designed and produces. Food mythos. Yet I’m not sure this is for me. Playing solo was a challenge on the wrong side of the fun line. Definitely worth some more plays. We’ll see.\n\nTRADED",
    "timestamp": 1734908400
  },
  {
    "username": "Jesse Terrell",
    "rating": 5.9,
    "comment": "(bga.) I want to like this more than I actually do.",
    "timestamp": 1733439600
  },
  {
    "username": "ImZhe",
    "rating": 6.5,
    "comment": "Very good game that has variable set up which makes games feel different due to the different goals that each Path has. The modules, especially doomsday, add a good amount of depth to the game and it even has a solo mode to boot. The miniatures are fantastic and make the game a lot smoother to play since you don't have to fiddle with extra tokens on the board.\n\nHowever, as far as worker placements go I prefer Argent. In Anachrony, it feels like your goals are pre-defined by the path you chose. A large chunk of your victory points comes from your evacuation conditions, which stay the same every time you pick the same Leader to play. Half of the points are shared, which is nice because you need to adjust your plan so you aren't losing out on all of the shared objectives and superproject cards, but one of your main goals will always be to just go for your evacuation condition. In Argent, the character you choose doesn't affect your game plan as significantly as Anachrony, so it feels like you are more free to pursue whatever goals you want according to the board setup.\n\nOverall a great game and would be willing to play it every now and then. Would like to see how the upcoming expansions will change the game up.",
    "timestamp": 1761606000
  },
  {
    "username": "MissP1ggy",
    "rating": 7.0,
    "comment": "VERY cool game! But long with 4.",
    "timestamp": 1760911200
  },
  {
    "username": "orangecat17",
    "rating": 7.0,
    "comment": "Placeholder rating. Subject to change",
    "timestamp": 1760565600
  },
  {
    "username": "Vevi",
    "rating": 7.0,
    "comment": "Alapjáték, ecopancél minik, Fractures Time kieg\n35000\nAngol",
    "timestamp": 1760392800
  },
  {
    "username": "Mr Mjeh",
    "rating": 7.0,
    "comment": "Anachrony is a terrific game. The game seemed to be fairly complex with a lot of planning required, but all in all that part's not bad - certainly not frustrating - and what results is a really fun worker placement with a theme that is worked out rather nicely",
    "timestamp": 1760220000
  },
  {
    "username": "Sondari_Wobble",
    "rating": 7.0,
    "comment": "1-4 spillere",
    "timestamp": 1759615200
  },
  {
    "username": "Bkoons",
    "rating": 7.0,
    "comment": "w/ Exosuits",
    "timestamp": 1759269600
  },
  {
    "username": "Tom_Sandy",
    "rating": 7.0,
    "comment": "Really like this game.\nIt`s really hard to get the machine going and the race to go first and grab resources.\nTravel back in time and take resources , fantastic.",
    "timestamp": 1756764000
  },
  {
    "username": "Chudej",
    "rating": 7.0,
    "comment": "Quite basic worker placement with a couple of twists that are more interesting thematically than mechanically.",
    "timestamp": 1756764000
  },
  {
    "username": "jasonxerri",
    "rating": 8.2,
    "comment": "2-4 Players (w/ All Expansions)",
    "timestamp": 1762383600
  },
  {
    "username": "VikingBurger",
    "rating": 8.0,
    "comment": "Gyönyörű.\nNagyon részletes lore, ami sokat segít a beleélésben.\nTetszik a munkások \"felébresztése\", valamint a különböző munkások különböző területeken való alkalmazhatósága.\nAz időutazás mechanikája nagyon ötletes.\nVáltozatos játékok, több út a győzelemhez.\nJó, ahogy felpörög a becsapódás után, izgalmas, hogy nem tudni melyik lesz az utolsó forduló.\nA frakciók/vezetők talán nem a legjobban balanszoltak, de nem vészes.",
    "timestamp": 1761606000
  },
  {
    "username": "MegaWestWolf",
    "rating": 8.0,
    "comment": "I really like what this game is doing. My only gripe with it is that I had some expectation as to what it would look like when it was pitched to me. This was not what I thought it would look like.",
    "timestamp": 1761606000
  },
  {
    "username": "mesanthropos",
    "rating": 8.0,
    "comment": "1-4 Best: 3",
    "timestamp": 1761429600
  },
  {
    "username": "thorbot",
    "rating": 8.0,
    "comment": "First impressions: Brilliant theme well integrated into tight worker placement and resource management. Excited to play again. Painted minis expansion helps with immersion greatly.",
    "timestamp": 1760911200
  },
  {
    "username": "tempar",
    "rating": 8.0,
    "comment": "Fun, right, interesting choices.\nPlayed without the dice.\n1 paradox instead of role.\npay 1 extra water for the science places and take what you want.",
    "timestamp": 1760738400
  },
  {
    "username": "Carter_Burke",
    "rating": 8.0,
    "comment": "UPDATE: Reduced rating from 9 because with ‘fractures of time’ now the game (and box) is too big, it never gets played.\n\n\nRating after five SOLO games without miniatures. ;-) I’m giving this an 8 for now.\n\nIt’s huge theme and table presence make it look more difficult than it is. At its core, this is a medium-weight worker placement. But to call it that is a dis-service.\n\nTime travel is brilliant and thematic - ok, could be called a “loan” system but you can loan resources, recruits, water, or exosuits — it’s more than just a loan system.\n\nThe ChronoBot is BRILLIANT; one of the best Automa’s I’ve played against. Simple to use. Gives you an idea what it might do (like looking at a real players board) but always surprises me. Close scores (except if I do something stupid strategically).\n\nConsidering buying the miniatures. Will see how this game goes on the table with real people first. Will be teaching this by the theme rather than mechanics.\n\n\nPurchased after Recommendations by ‘No Pun Included’ and Chris @ The Secret Cabal. Tom Vasal has high praise for Anachrony too.\n\n3-minute reviews recommendation.\n#7 in Top 100 (2018) “best solo mode for any worker placement or euro game”.",
    "timestamp": 1760652000
  },
  {
    "username": "WadeB1977",
    "rating": 8.0,
    "comment": "Worker placement time travel game with a doomsday clock; I get to play this about 1-2 times per year but it has a solo option so maybe 1-2 times as solo. Well balanced heavy worker-placement game with several good modules.",
    "timestamp": 1759788000
  },
  {
    "username": "fragia",
    "rating": 7.9,
    "comment": "Filippo",
    "timestamp": 1759528800
  },
  {
    "username": "Wyte Cell",
    "rating": 9.2,
    "comment": "Great! Heavyweight, brain-burner!",
    "timestamp": 1762618380
  },
  {
    "username": "ditterio",
    "rating": 9.0,
    "comment": "Rules: https://boardgamegeek.com/filepage/137453/anachrony-final-ru...\n\nSummary for base game and all the expansions: https://boardgamegeek.com/filepage/144029/anachrony-holistic...\n\nQuick start: https://boardgamegeek.com/filepage/145614/anachrony-quick-st...\n\nI have to win against:\n\nAmena\nCaractus\nCornella\nHaulani\nSamira\nValerian\nWolfe\nZaida\n\nGreat game!",
    "timestamp": 1762297200
  },
  {
    "username": "Scooby1696",
    "rating": 9.0,
    "comment": "1 x Grundspiel gespielt. Super gut verständlich, nach einmal erklären.",
    "timestamp": 1761084000
  },
  {
    "username": "federik21",
    "rating": 9.0,
    "comment": "Nice worker placement game, but with asymmetrical factions and a time-travel twist.\n8/10 base game, 9/10 fractures of time\n\nPersonal mindclash rank: 5th (2nd with FoT)",
    "timestamp": 1760911200
  },
  {
    "username": "bunnyOo",
    "rating": 9.0,
    "comment": "its a fun game don't be a afraid . I'm not sure about expansions but i have alot of them , will update when i get to them .\n\noverall its workerplacment with some planning and fun decision-making.\nits not a 10 because it take a lot to get in to and tear down and its duration is long.",
    "timestamp": 1760306400
  },
  {
    "username": "royaljayhawk",
    "rating": 8.9,
    "comment": "Anachrony is a standout in the worker placement and engine-building genre, delivering a deep, thematic experience centered around time travel and resource management with a hint of programming. The distinct loan mechanic of borrowing resources from the future adds a brilliant strategic twist that rewards careful planning and timing, while the sci-fi theme is richly woven into every aspect of the game. Its combination of modular expansions and asymmetrical factions ensures high replayability and fresh challenges with each play.\n\nThough its complexity and icon-heavy rule system and learning curve might be intimidating, once internalized, Anachrony offers satisfying depth and tension that keep players engaged for long, thoughtful sessions. The quality of components and miniatures is excellent, enhancing the immersive feel. This game really scratches the itch for cerebral, heavily strategic Euro games with thematic flair.",
    "timestamp": 1760306400
  },
  {
    "username": "Mertbitmez",
    "rating": 8.5,
    "comment": "Just played the base game and it's safe to say that this game is one of the best worker placement games around. I will add Fractures of Time expansion in our next gaming session.",
    "timestamp": 1760133600
  },
  {
    "username": "fska",
    "rating": 9.0,
    "comment": "+ organizer\n+ Fractures of Time\n+ metal resources (cubes)\n+ acrylic tokens (base and expansion)",
    "timestamp": 1759788000
  },
  {
    "username": "Kaiserchico",
    "rating": 9.0,
    "comment": "An asymmetrical game with original mechanics.\nGives its best in 3 players.",
    "timestamp": 1759528800
  },
  {
    "username": "leandar",
    "rating": 9.5,
    "comment": "amazing",
    "timestamp": 1761951600
  },
  {
    "username": "HugoCruzVilla",
    "rating": 10.0,
    "comment": "+ Anachrony: Fractures of Time = 2 plays\n+ Anachrony: Exosuit Commander Pack = 2 plays",
    "timestamp": 1761606000
  },
  {
    "username": "Shady Bits",
    "rating": 10.0,
    "comment": "Still on shelf of opportunity, Sept 2019.\n\nLearning it Sept. 30, 2025!",
    "timestamp": 1761429600
  },
  {
    "username": "monochromepenguin8",
    "rating": 9.5,
    "comment": "Really enjoyable tight worker placement game.",
    "timestamp": 1761170400
  },
  {
    "username": "BionicBeaver",
    "rating": 10.0,
    "comment": "I also have the Fractures of Time expansion and the Exo Suit minis.\n\nTravelling through time to borrow from your future self and causing paradoxes because of it, is just plain genius.\n\nBest with 3 or 4 people.",
    "timestamp": 1758232800
  },
  {
    "username": "kingslayer007",
    "rating": 10.0,
    "comment": "My #1 game. I absolutely love each and everything about Anachrony. The theme, the mechanics, the integration of them all, simply beautiful!",
    "timestamp": 1757973600
  },
  {
    "username": "Lecaro",
    "rating": 9.5,
    "comment": "Kurzrezension:\n\"Anachrony\"... ein - von den Regeln her - tatsächlich simples 'Arbeiter Einsatz' Spiel. Durch den relativ hohen Planungsaufwand und der Vielfalt an Möglichkeiten aber eher in der höheren Komplexität anzusiedeln.\nThematisch befinden wir uns in der Zukunft und übernehmen ein Volk der Menschheit, die sich in unterschiedliche Richtungen weiterentwickelt hat. Die Technologie ist weit fortgeschritten, sodass ein herannahender Komet entdeckt wurde, der das Potenzial hat, die Erde zu zerstören. Zudem wurde eine Technologie entwickelt, die es ermöglicht, in der Zeit zu reisen. Mithilfe dieser Zeitportale können die Spieler Material und Personal aus der Zukunft \"leihen\", müssen die Leihgabe aber zurückbezahlen, sobald die Zukunft erreicht wurde.\n\nSpielablauf:\nDie meisten Phasen in \"Anachrony\" werden von allen Spielern parallel gespielt. Die ersten beiden sind reiner Verwaltungsaufwand, in der dritten geht es aber bereits zur Sache. In ihr entscheiden die Spieler, wie viele 'Exosuits' sie aufladen möchten. Damit entscheiden sie gleichzeitig, wie viele Aktionen sie in der Hauptphase des Spiels überhaupt zur Verfügung haben werden.\nEs folgt eine weitere Planungsphase - in der sich die Spieler Material aus der Zukunft leihen können - bis es schließlich zum eigentlichen Hauptteil der Runde kommt, in deren Phase die Spieler reihum Arbeiter einsetzen und Aktionen auszuführen dürfen.\nDie angeworbenen Arbeiter gibt es in vier verschiedenen Klassen, die bestimmte Aktionen besser, bzw. überhaupt durchführen können. Die allgemeinen Felder auf dem Spielbrett dürfen die Arbeiter nur mithilfe eines aufgeladenen 'Exosuits' aufsuchen, da die Atmosphäre des Planeten toxisch ist.\nMit den allgemeinen Aktionen können neue Arbeiter angeworben, Ressourcen abgebaut, Forschung betrieben und Gebäude errichtet werden.\nDie Gebäude werden auf dem eigenen Spielertableau platziert und stellen häufig weitere Aktionsfelder zur Verfügung, die sogar ohne 'Exosuit' genutzt werden können.\nNach vier solcher Runden schlägt der Komet ein und ändert damit ein paar Dinge für alle Spieler:\n1. Das Aufladen von Exosuits wird teurer.\n2. Die zentralen Aktionsfelder erhalten Bonnies, können dafür aber nur noch ein einziges Mal im Spiel genutzt werden, bevor sie endgültig zerstört sind.\n3. Der Einschlag ermöglicht die Evakuierungs-Planung, welche Spielmechanisch eine Punktewertung für das zu diesem Zeitpunkt erreichte Spielziel darstellt und von jedem Spieler maximal einmal genutzt werden darf.\nNachdem alle Aktionsfelder auf dem Spielfeld endgültig kollabiert sind, die siebte Runde beendet wurde oder alle Spieler ihre Evakuierung vorbereitet haben, endet das Spiel mit der Schlusswertung, in der unter anderem die allgemein ausliegenden Ziele gewertet werden.\nDer Spieler mit den meisten Punkten konnte sein Volk am besten anführen und gewinnt das Spiel.\n\nErweiterungen:\nIm Grundspiel sind bereits zwei Module enthalten, die ich leider noch nicht ausprobieren konnte.\nEines erlaubt, die eigenen 'Exosuits' zu verbessern.\nDas andere den Kometeneinschlag hinauszuzögern, bzw. frühzeitig einschlagen zu lassen!\n\nDas \"Exosuit Commander Pack\" erweitert das Grundspiel lediglich um Miniaturen der 'Exosuits', die anstelle der Plättchen auf dem Spielplan eingesetzt werden. Sie verändern weder die Regeln, noch erweitern sie diese.\nDennoch finde ich diese Erweiterung für das Spiel beinahe essenziell, da sie es - rein optisch - sehr aufwertet und zudem eine bessere Übersicht über bereits genutzte, sowie aufgeladene 'Exosuits' der Mitspieler bietet. Für mich ein Must-Have!\n\nDie \"Fractures of Time\" Erweiterung führt die Spieler noch ein wenig weiter in den Zeitstrudel des \"Anachrony\" Kosmos. Das neue Material, welches der Asteroid auf die Erde und durch die Zeit gebracht hat, hatte Auswirkungen auf die Pflanzenwelt. Diese mutierten Pflanzen können jetzt genutzt werden, um Mikrosprünge durch die Zeit durchzuführen. Spielmechanisch bedeutet das, dass bereits eingesetzte Arbeiter von ihrem Feld auf ein anderes, freies Feld gesetzt werden dürfen, um die dortige Aktion ebenfalls zu nutzen. Die entsprechenden Arbeiter werden dafür sofort aus ihrem Vehikel geholt und auf die erschöpfte Seite gelegt, während ihre 'Exosuits' auf dem Aktionsfeld verbleiben. Für alle Spieler ist der zuvor belegte Platz jetzt wieder frei. Jeder Mikrosprung muss allerdings mit der wertvollen, neue, 'Flux'-Ressource bezahlt werden und birgt obendrein die Gefahr, manche Spielelemente gesperrt zu bekommen.\n\"Fractures of Time\" bietet den Spielern noch mehr Möglichkeiten, ihre Spielzüge zu planen. Es sind weniger aufgeladene 'Exosuits' nötig, um die Aktionen der Stadt zu nutzen. Dafür müssen die Spieler mit einer neuen Gefahrenquelle umgehen.\nIch hatte einen großen Respekt vor der Erweiterung, da sie mir sehr komplex erschien. Sie fügt sich aber sehr leicht in die Regeln und auch in die Zeitreise-Thematik ein und macht mir sehr viel Spaß. Die Erweiterung führt zu keiner höheren Spielzeit, sondern erhöht lediglich die Optionen der Spieler. Ich liebe sie sehr.\n\nMeinung:\nIch finde den 'Arbeiter-Einsatz' Mechanismus verknüpft mit dem Planungselement in „Anachronie“ einfach genial. Das Thema hakt hier und da ein wenig, aber das tatsächlich störende sind die immer wieder kommenden Paradoxmarker, die derjenige erhält, der auf den vergangenen Zeitepochen die meisten Warpplättchen angesammelt - also am meisten aus der Zukunft geliehen hat.\nRein thematisch möchte ich viel aus der Zukunft leihen, was ja auch der Clou des Spiels ist, oder? Dafür werde ich aber bereits in der nächsten Runde bestraft, ohne vorher die Möglichkeit erhalten zu haben, meine Schulden zu tilgen!\nIn der Grundregel sind die zu erhaltenen Paradoxmarker zudem von einem Würfelwurf abhängig, der 0 bis 2 anzeigen kann. Dieser Würfel kann auch weggelassen werden und der entsprechende Spieler erhält einfach grundsätzlich ein Paradox, was die Planung vereinfacht und ich sehr empfehle.\nDies hat auch alles seinen mechanischen und thematischen Sinn und führt im schlimmsten Fall zu einer Anomalie, die - durch eine relativ teure Aktion - aber auch wieder loszuwerden ist. Eine Möglichkeit seine Schulden zu tilgen, bevor es zu Anomalien kommt, würde ich dennoch begrüßen, denn leider führt diese Bestrafung oft dazu, dass Spieler die Zeitreise überhaupt nicht nutzen und so - meiner Meinung nach - am Thema vorbei spielen!\nNichtsdestotrotz ist „Anachrony“ ein großartiges Spiel, das mit einer relativ kurzen Spielzeit (zumindest für ein solches Kaliber) daherkommt. Die Erfahrung nach jeder Partie lässt das Spiel immer weiter in meiner Gunst steigen und ist definitiv ein ernst gemeinter Tipp für Liebhaber komplexer Spiele geworden. Und auch die Erweiterungen sind richtig gut designt. Sie fügen Mechanismen ein, die das Spielgefühl, ohne viele zusätzliche Regeln, stark verändern können.\nIn einer Zwei-Spieler-Partie gehen sich die Kontrahenten etwas aus dem Weg, da das Spielbrett zu viele Möglichkeiten bietet. Zu dritt und zu viert erhöht sich die Interaktion, was ich bevorzuge. Durch die parallele Planung erhöht sich im Gegenzug die Downtime nur geringfügig. Ich würde „Anachrony“ jederzeit in jeder Spielerkonstellation herausholen und auf den Spieltisch packen.\nIch liebe dieses Spiel einfach!",
    "timestamp": 1757887200
  },
  {
    "username": "Ph0rnizzle",
    "rating": 10.0,
    "comment": "Solo only",
    "timestamp": 1757282400
  },
  {
    "username": "Kuma367",
    "rating": 10.0,
    "comment": "With Fractures of Time",
    "timestamp": 1757196000
  }
]