[
  {
    "username": "larrydurbin",
    "rating": 1.0,
    "comment": "A fabulous production from Fantasy Flight Games. A lot of cool minis and game pieces. However, the cumbersome and clunky game play take it from a fabulous game to a simple box of toys. If I wasn't a Star Wars fan I would never play it. Totally overrated on BGG. Another shining example of BGG's flawed system. Is the rebel base here? Go fish. Is the rebel base here?? Go fish. Blah , blah , blah.",
    "timestamp": 1757800800
  },
  {
    "username": "zmartianov",
    "rating": 1.0,
    "comment": "This game glorifies civil wars",
    "timestamp": 1754604000
  },
  {
    "username": "NavayaTCG",
    "rating": 1.0,
    "comment": "Won't play because it's a 4 hour game",
    "timestamp": 1750024800
  },
  {
    "username": "MrHallen",
    "rating": 1.0,
    "comment": "Played it andd found it boring, the mechanics are really slow and the fighting with the ships are not memorable. the figs were awesome tho",
    "timestamp": 1702767600
  },
  {
    "username": "Risvalvolo",
    "rating": 1.0,
    "comment": "non capisco come faccia ad avere questo riscontro. per me è ingiocabile",
    "timestamp": 1673823600
  },
  {
    "username": "murphzone",
    "rating": 1.0,
    "comment": "We have some good 2 player games. I don't have a ton of people willing to play them, so this might have to wait awhile before undertaking.",
    "timestamp": 1596751200
  },
  {
    "username": "thatspyguy",
    "rating": 1.0,
    "comment": "Completely over rated. This game is absolute trash.",
    "timestamp": 1582585200
  },
  {
    "username": "mxke",
    "rating": 1.0,
    "comment": "All that hype for a game that boils down to dice rolls. Sad and doesn't deserve your money or time.",
    "timestamp": 1503266400
  },
  {
    "username": "elimneth",
    "rating": 1.0,
    "comment": "bof ...",
    "timestamp": 1472162400
  },
  {
    "username": "Parodious",
    "rating": 1.0,
    "comment": "Ug, another overproduced FF Ameritrash game propped up by its IP, complete with tiny cards, plastic miniatures, too many tokens, and clunky mechanics.",
    "timestamp": 1471384800
  },
  {
    "username": "Antch007",
    "rating": 2.0,
    "comment": "Boring star wars",
    "timestamp": 1754258400
  },
  {
    "username": "Brandon04",
    "rating": 2.0,
    "comment": "I waited years to try this game. When I finally got to see it set up and attempt a session, I realized it was a real clunker. I'm sticking with Outer Rim.",
    "timestamp": 1743116400
  },
  {
    "username": "trodat123",
    "rating": 2.0,
    "comment": "another convoluted \"put all known and popular mechanism in it\" game which drags...",
    "timestamp": 1712700000
  },
  {
    "username": "Aazmp",
    "rating": 2.0,
    "comment": "Too random, especially for rebels, whos has luck (of draw/throw) as the only game mechanism. Would not be so bad if it was shorter. First play can be very long if no one knows what cards exist and a lot of them just unset the others.",
    "timestamp": 1676502000
  },
  {
    "username": "alchemyocelot",
    "rating": 2.0,
    "comment": "initial impression : wow! After a few games: meh. Too random, overly annoying combat mechanics. Moving on...",
    "timestamp": 1669244400
  },
  {
    "username": "Spindone",
    "rating": 2.0,
    "comment": "fights takes soooo long. Really boring Game and Rebels just need to spam Spaceships into their main base. Thats it.",
    "timestamp": 1663020000
  },
  {
    "username": "KastlaPiwa",
    "rating": 2.0,
    "comment": "To complicated, to much to read, 2vs2 is just 1vs1 with arguing. Player need to play like 4 times (2 times with each faction) to learn tactics and possibilities.",
    "timestamp": 1652824800
  },
  {
    "username": "aphyer",
    "rating": 2.0,
    "comment": "A half-hearted knockoff of War of the Ring, substantially worse-designed than its predecessor, with poorly-thought-out mechanics that cause a mix of dull and degenerate play. Not worth playing.",
    "timestamp": 1650751200
  },
  {
    "username": "Scooperman",
    "rating": 2.0,
    "comment": "I'm not a Star Wars fan so the theme has next to no interest for me. Without that fan approach it became apparent to me very quickly that there is little actual game in the box, certainly nothing to justify the lengthy play time.\n\nWhat is in the box is an exercise in down time as the Rebel player sits and waits for the Empire to read all their cards, churn through calculating the production and moving large numbers of plastic pieces around the board.\n\nThrow in a simplistic, clunky dice resolution system for combat and mission tests and this is a hard pass for me from here.",
    "timestamp": 1642806000
  },
  {
    "username": "B3rthold",
    "rating": 1.5,
    "comment": "+ thematisch asymmetrisch\n- Kampfsystem nervt\n- Produktion langweilt",
    "timestamp": 1588024800
  },
  {
    "username": "smurfodeth",
    "rating": 3.0,
    "comment": "Thematically rich and satisfying, but takes longer to play than I’d prefer.",
    "timestamp": 1752876000
  },
  {
    "username": "btasam",
    "rating": 3.0,
    "comment": "Initial thoughts after 2 plays.\n\nWhile I admit, I cannot help but compare this to WotR, Star Wars: Rebellion feels very meh to me.\n1) I am not a fan of the combat; let's be honest, this game's strength lies in the intrigue of a hidden rebel base.\n2) The missions feel disjointed from the narrative; usually gives off this worker placement vibe when playing.\n3) The single victory condition and fairly uniform galaxy makes for a lackluster drudge.\n4) The game takes forever... combat only makes it worse.\n\nThe errata is enormous and I'm not surprised.",
    "timestamp": 1735513200
  },
  {
    "username": "robochase6000",
    "rating": 3.0,
    "comment": "rough first teach, probably heavily affected my rating",
    "timestamp": 1722808800
  },
  {
    "username": "Procyon_lotor",
    "rating": 3.0,
    "comment": "Thrifted $4",
    "timestamp": 1707692400
  },
  {
    "username": "mOCHU035",
    "rating": 3.0,
    "comment": "10/10/19\nStrong thematic binding. The hide-and-seek aspect of the game is mildly interesting. Otherwise a rather dull 2p in all honesty. Need to evaluate it after 1 more play on the other side of the table.",
    "timestamp": 1695333600
  },
  {
    "username": "Qerris",
    "rating": 3.0,
    "comment": "Boring, not satisfying hide and seek. Takes too long time in comparison to what it offers. Dice without any reroll mechanisms are bad. If it would take 2h less and give any option to mitigate bad luck it would be good game. One of my worst boardgame experiences (even though i'm SW fan).",
    "timestamp": 1690495200
  },
  {
    "username": "Beedun",
    "rating": 3.0,
    "comment": "My favorite I.P., but a crappy game. Meh.",
    "timestamp": 1682287200
  },
  {
    "username": "Lamarc_Gasoldridge",
    "rating": 3.0,
    "comment": "More long and complicated than it needed to be, we felt the juice was not worth the squeeze. They strategy was not as complex as the rule set. However it has potential. The most asymmetrical competitive 1v1 game I have played, which is ambitious, but leads to balance problems.",
    "timestamp": 1681682400
  },
  {
    "username": "BarticusBane",
    "rating": 3.0,
    "comment": "It's just clunky for the sake of it, all the additional rules, and complications and mechanics feel tedious, not fun, the combat is excruciatingly boring and uninteresting to the point where you actually want to avoid combat because of how much it sucks to do. This isn't because it's too complicated or long, I love long and complicated but It has to be fun, something like war of the ring is a great example. I'd say if you're in this for that tense hide and seek feeling, get sniper elite, but if you want a long complex wargame, go for war of the ring, this game is the worst version of both of those things. DO NOT BELIEVE THE HYPE",
    "timestamp": 1680732000
  },
  {
    "username": "jsforella",
    "rating": 3.0,
    "comment": "boring. the first few turns determine the victor in almost every game and then it is just slowing down the inevitable. lame.",
    "timestamp": 1679954400
  },
  {
    "username": "SteoanK",
    "rating": 4.0,
    "comment": "So much in this game. May end up keeping it. It is missing the turn order marker for some reason.",
    "timestamp": 1760392800
  },
  {
    "username": "ValerianofEternia",
    "rating": 4.0,
    "comment": "Pros :\n• A good adaptation of Star Wars into a board game\n• The Leader system for taking actions across different planets is cool\n• Asymmetric cat-and-mouse gameplay\n\nCons :\n• The combat system is light-years away from the epic Star Wars battles\n• Very long playtime, with a boring first half and a fun second half\n• A lot of randomness with cards and dice\n\nConclusion :\nA game for Star Wars fans that would be much better if it were half as long.",
    "timestamp": 1759269600
  },
  {
    "username": "cheshire_cat",
    "rating": 4.0,
    "comment": "Games overstays its welcome for about 3 hours. Would be excellent game if could be played under 1 hours. Play Watergate or Twilight Struggle instead.",
    "timestamp": 1748728800
  },
  {
    "username": "gunnerCRO",
    "rating": 4.0,
    "comment": "Based on one play but probably not going back to it. I personally didn't have that much fun with it. Between card draw and dice rolling there is more randomness that I care for in the game. Literally in turn one I rolled 4 dice that all showed empty result in a combat that I was heavily favored (and naturally lost). In the deck there was a clump of, what it seem, great cards that I never got to play. Unlucky? Maybe. Not sure I want to come back for another try. I was playing against experienced player so take that for what you will. What it came down to, for me, is that the game is too long. When I'm unlucky and have to keep playing for another 2 hours it doesn't feel great. I can see other people enjoying it much more, especially if you like the theme.",
    "timestamp": 1746828000
  },
  {
    "username": "shmonkey",
    "rating": 4.0,
    "comment": "Liked the concept, everything was certainly thematic. We need to go thru a whole game at some point, but it does drag, a la war of the ring. Even with the theme, i am not the target audience for these long epic games.",
    "timestamp": 1738191600
  },
  {
    "username": "Joey_A",
    "rating": 4.0,
    "comment": "Meh...a watered down War of the Ring with a Star Snores pastiche. Leaders just teleport anywhere in the galaxy to do things and stuff. Army building is a queue system making your production delayed for x turns. Not particularly a fan of that, but I'm not dinging it for this, as it's simply me stating preference, and it's not a flaw inherently in design. Cards could be for any game, not really feeling the theme in the cardplay.\n\nAll those gripes aside, the theming works well enough in the asymmetrical balance between the two factions. Space and land battles simultaneously is very fun. Risks for the rebels can be enticing to take, sometimes a pyrrhic victory is a good strategy. Empire doesn't quite feel as big and stompy as they ought, they're mostly too stretched thin for that, which is it's own risk/reward system. The game of Clue to find the rebel base is okay, but the rebel side is where the fun is. Empire side doesn't quite have enough going on, and this is the biggest crime the game commits.\n\nI don't actively detest this game, but I don't like it, either. The empire faction and cardplay need souped up, then I think I'd find it less of a blandfest.",
    "timestamp": 1735167600
  },
  {
    "username": "ciceroni",
    "rating": 4.0,
    "comment": "Too long and fiddly for my tastes which also makes it very hard to table it more frequently.",
    "timestamp": 1728684000
  },
  {
    "username": "mischraum",
    "rating": 3.5,
    "comment": "It is really a good game albeit a little to heavy for me if I am not in top condition",
    "timestamp": 1727906400
  },
  {
    "username": "pingus",
    "rating": 4.0,
    "comment": "Feels like a mediocre area control with a bluffing component.\nNo idea where and when I was supposed to have fun and I didn't.",
    "timestamp": 1709334000
  },
  {
    "username": "brownsound",
    "rating": 3.5,
    "comment": "Mechanizm walki i większość głównych założeń tej gry skreśla ją w moich oczach. Nikt mnie na to już nie namówi.",
    "timestamp": 1690063200
  },
  {
    "username": "Moosekretz",
    "rating": 5.0,
    "comment": "Pros:\nThematic, epic, asymmetric game-play, hide and seak.\n\nCons:\nRules can be a extremely fiddly, combat seems to bog down the game, length, luck of draw & dice rolls, need to know possible cards to make viable strategy, can feel like \"who fails the least\" rather than who was clever... length\n\nTraded in...",
    "timestamp": 1760306400
  },
  {
    "username": "Nodens",
    "rating": 5.0,
    "comment": "The 'Solo - a Star Wars story' of boardgames. It's fine. It looks nice. It ticks boxes. I'm bored.",
    "timestamp": 1756418400
  },
  {
    "username": "Scifi66",
    "rating": 5.0,
    "comment": "If you love Star Wars this could be your big box asymmetrical game (for me that is Twilight Struggle or WotR or Polis depending upon the opponent).\n+ Star Wars in a box\n+ The Deathstar model\n+ Asymmetry\n- Just too long, I'm a quick player and even with it already setup it took 5 hours\n- Combat system is a low point\n- Suffers from low replayability I've played once as Rebel, I could possibly play again as Empire but otherwise no.",
    "timestamp": 1751061600
  },
  {
    "username": "melancholia66",
    "rating": 5.0,
    "comment": "игра с крутой механикой, но не моя вселенная. второй раз играть не буду",
    "timestamp": 1739833200
  },
  {
    "username": "Negoc",
    "rating": 5.0,
    "comment": "Played 3 times now. Won all.\nGame has no flow. Cant understand the hype.\nAlso cant see those expansion makes it even better takes.",
    "timestamp": 1737154800
  },
  {
    "username": "jgoyes",
    "rating": 5.0,
    "comment": "2016-08-29\n\nInitial Rating: 7.0 (August 2016)\n\nI was a fan of Star Wars right up until the last movie (The Force Awakens which I despise but that’s other topic ) but I still have fond memories of the books, the PC game and previous movies. Besides, Star Wars: Rebellion is a game well regarded here on BGG so I was keen to play it.\n\nAs is usual from FFG, the game components are outstanding, the miniatures are very detailed and they look great on the board. The art is very good as well.\n\nThe theme is great as I love the original trilogy.\n\nThe game´s rules aren’t very complex, but there are many rules. You can explain them under 20 minutes. Both rulebooks seem intimidating at first, but they are far easier to understand than I initially expected. Gameplay is around 3 and a half hours.\n\nThe decisions needed to play the game aren’t trivial, but aren’t that hard either. As the Empire you have to move your armies through the galaxy looking for the Rebel base. As the Rebel player you have to hide your base as best as you can. Both players have to decide which mission to accomplish and whose leaders to assign (or oppose) to each mission (that’s the best part of the game). I also enjoy the cat and mouse dynamics between the factions. The Galactic Empire is very powerful military wise while the Rebel Alliance has very meager resources. In my game, the Rebel Alliance didn’t win a lot of combats but almost win the game nonetheless. Combat isn’t as important as I initially thought. Star Wars: Rebellion is a deception game.\n\nThe feeling of playing and controlling both Death Stars is amazing!, it has an epic feel to it .\n\nCombat is ok and easy to understand. There is some luck with the dice, but most of the time the expected result happens, that is, I don’t feel the game has a lot of uncontrollable luck, you can prepare for it. There is much more uncontrollable luck with the cards (missions, projects, tactics).\n\nTo me, Star Wars: Rebellion is only a two player game, with more players the game slows down and the downtime increases to unmanageable levels.\n\nOn the bad side, from my very limited perspective, it seems winning with the Rebel Alliance is much easier than with the Galactic Empire due to a mission card that the rebel player always has at hand (the one that lets him move his base to 4 or up to 8 different systems if you use two leaders). I need more plays to verify this claim, but if true, that could hamper my desire to play the game many times. It seems playing with the Empire requires a lot of finesse while playing with the Rebel alliance is easy and straightforward. I like asymmetric games, but so far, it seems to me both factions aren’t balanced. I need more plays to see if this is an issue for me or not. The rebel victory doesn’t feel very thematic, they can get away with lots of mistakes and, as moving the ships through the galaxy is so slow, time is on their side.\n\nBottom line, Star Wars: Rebellion is a good Ameritrash game. These days I no longer enjoy that genre as much as before but I enjoyed the game. For now, it is a borderline 7.0 to me and I have not yet decided if I should keep it in my game collection or not. I need more plays to see if the rebels can escape as easily as they did in our game. I want to play it again soon. Much better than War of the Ring though.\n\nCurrent Rating: 7.0\n\n\n2024-12-26\n\n• It’s been a long time since I last played Star Wars: Rebellion. I really tried to play it, as my gaming system insisted this one should be the next game to play, but my heart is no longer in the game. These days, I prefer to play much less confrontational games, and I almost (though there are exceptions) play no games that have “dudes on a map.”\n\n• As I wrote above, I’m very disenchanted with the Star Wars universe, and since the game is thematic, I no longer desire to play it. Star Wars went from being my favorite topic in the world to a complete red flag for me.\n\n• If I’m going to spend 3+ hours on a game, I prefer it to be a heavy Euro game.\n\n• I decided to sell the game along with its unplayed expansion, and, in some capacity, I feel I’m making a mistake as the game is so well-regarded here on BGG (it’s a TOP TEN game, after all), but I think I will be happier if I take this weight off my shoulders. This year, I have been trying to be much more ruthless with the games I cull.\n\n• Star Wars: Rebellion is no longer among my favorites games of 2016.\n\nCurrent Rating: 5.0",
    "timestamp": 1735254000
  },
  {
    "username": "tolhs",
    "rating": 4.5,
    "comment": "2024:+1",
    "timestamp": 1733958000
  },
  {
    "username": "gidorah",
    "rating": 5.0,
    "comment": "05.2018\n\nRebellion is a sprawling, theme-forward game in FFG tradition. There are half a dozen or more decks, just as many chits, two boards, cardboard standees, and plastic miniatures.\n\nThe missions feel like the most enjoyable part of the game despite the fact that their success is based on dice-rolls. Movement is extremely limited, which is good for the Rebels as their forces are so limited but bad for the Empire as it can feel like you’re just crawling at a snail’s pace. Recruiting new leaders felt just ho-hum: I guess I’ll take Chewie because he gives me more fists for my next fist skill-check. Yay… The project cards are cool because they let the Empire do some pretty powerful things, while the objective cards give the Rebels something to do other than evading the Empire.\n\nI think Star Wars fan will find an immersive experience and be able to tell each other new variants on a well-trodden story; for someone looking for a similar gaming experience, I’d rather play Mind MGMT.",
    "timestamp": 1725919200
  },
  {
    "username": "James DeBenedetti",
    "rating": 5.0,
    "comment": "With the exception of Rogue One, the post-original trilogy movies have managed to kill my once strong interest in Star Wars.",
    "timestamp": 1724364000
  },
  {
    "username": "krit1789",
    "rating": 5.3,
    "comment": "Cat and mouse with extended card plays and dice rolling combats. Intricate design, but I'm far from being a huge Star Wars fan.",
    "timestamp": 1724104800
  },
  {
    "username": "Kodeir",
    "rating": 5.0,
    "comment": "Rebellion does for the Star Wars original trilogy what War of the Ring did for the Lord of the Rings trilogy. Rebels have to fight a guerrilla war while the empire rolls over whatever gets in its way. All in all, it's super thematic, though some cards, while thematic, are a bit too powerful and swingy. I'm not a huge fan of these kind of games anymore, but have to admit it's a good game.\n\nRating: \nOptimal number of players:\n2\n3\n\nFor more information on how I rate games, go to my profile",
    "timestamp": 1722117600
  },
  {
    "username": "willbeplayin",
    "rating": 5.0,
    "comment": "5/10.\n\nHow on earth is this game the overall #9 of all time on BGG? We bought it recently at a good price and played it twice, once on each side and just today I just sold it forward. Clearly me and Corey Konieczka don't get along, since I soured on SW: Outer Rim quite fast too. I recently bought Forbidden Stars (haven't yet played it) and I do like Warrior Knights and Twilight Imperium, don't get me wrong, but it's when he's the sole designer, there's a lot of disparity in our way of thinking.\n\nFirst of all, the rulebook is abysmal, even by FFG standards. I've always hated FFG rulebooks - they are so incredibly vague, badly formatted and usually lack examples. Even the appendix booklet doesn't answer the rules questions precisely. We had to abandon our first game after maybe 3hrs, since rules questions and mishaps happened so often that the game grinded down to a halt and there was no reason to continue on. There's also a lot of weeding to be done, if you want to find an answer to a particular questions here on BGG forums.\n\nEven with the expansion, the combat remained the weakest part of the game. By the second play, the game already started repeating itself - same missions, same objectives, same everything.\n\nIn short, for us it just didn't work. We're both SW fans and have watched everything (even The Acolyte, which is one of the worst shows I've seen in a long time). I bet that people who have rated this so high have only played it once or twice. I've seen a lot of copies on second hand markets too recently, so the popularity seems to be fading.\n\nThis is not the game you are looking for.",
    "timestamp": 1721340000
  },
  {
    "username": "sharkker",
    "rating": 5.0,
    "comment": "Only play with Angus or kids\nOversized game",
    "timestamp": 1720994400
  },
  {
    "username": "FilthyTroll",
    "rating": 5.0,
    "comment": "Too fiddly, too many rules, not much fun. Horrendous teach.",
    "timestamp": 1719007200
  },
  {
    "username": "cinnzel",
    "rating": 5.0,
    "comment": "Me da lástima no haber disfrutado del juego de tablero más aclamado del universo \"Star Wars\". Me pareció demasiado farragoso el desarrollo de la partida y pese a resultar muy inmersivo, por el enorme tamaño del despliegue en mesa, no me sentí \"dentro\" del juego en ningún momento.",
    "timestamp": 1716847200
  },
  {
    "username": "BearDot25",
    "rating": 5.0,
    "comment": "First impression: I had fun with this, but I’d be lying if I didn’t say I was a bit disappointed. I love Star Wars, and obviously this is well-regarded, so my expectations were pretty high. And it has a lot of great elements: the hidden base, the leadership system, and the missions in particular stick out.\n\nHowever I felt myself wanting the game to end by hour 4… it starts getting repetitive/annoying when you can’t find the rebel base yet are overwhelmingly dominating with troops. Plus, the combat is so long/on rails that it really slows things down.\n\nI’d definitely give it another shot, especially with the expansion, but there are many other 1v1 games at this length I’d rather play.",
    "timestamp": 1715205600
  },
  {
    "username": "Instinct8",
    "rating": 5.0,
    "comment": "The Axis and Allies of Star Wars meaning it's quite asymmetrical and unbalanced at times and also pretty complicated",
    "timestamp": 1709074800
  },
  {
    "username": "Bonzerone",
    "rating": 5.0,
    "comment": "An excellent game for those who are prone to overthink, for me is just too damn long and, sadly, boring.\n\nI'm gonna sell it soon.",
    "timestamp": 1705273200
  },
  {
    "username": "Akis1900",
    "rating": 5.0,
    "comment": "If I buy it I change the rules and make it a quick fun star wars war game. But it's very expensive.",
    "timestamp": 1699743600
  },
  {
    "username": "CHOCOxMOES",
    "rating": 5.0,
    "comment": "I can see why this is a game that people would like, but this is not my thing and I will probably not play again.\nToo complicated for me, cumbersome battle mechanism. Too much set up time.",
    "timestamp": 1694728800
  },
  {
    "username": "simon_dt",
    "rating": 5.7,
    "comment": "Played two games as rebel faction (2p vs 2p) and I felt frustrated all the time. It could be due to our little knowledge of mechanics or our weak strategy, but the game didn't leave me with the urge to re-play it. Two were the main issues for us: 1. The luck of the outcome of the battles! We felt like our effort to prepare the battles were completely erased by the chances; 2. Play-time was way too long. Considering that I usually tend to have AP, in this context paralysis is more frustrating because I cannot see material improvement on the game-board. And the game at the 5th hour just felt like \"Yeah, whatever! I don't care which action we should do\".",
    "timestamp": 1762124400
  },
  {
    "username": "Zhod",
    "rating": 6.0,
    "comment": "2p",
    "timestamp": 1760479200
  },
  {
    "username": "Iraperkins82",
    "rating": 5.7,
    "comment": "7/10: A good game, would play and suggest with the right people, if I never played it again I wouldn't lose any sleep. First layer where it could well leave my collection.",
    "timestamp": 1758060000
  },
  {
    "username": "ditterio",
    "rating": 6.0,
    "comment": "I've played this game once but it really felt flat. We played a few rules wrong and it was very late also so I really want to give this game a second chance.",
    "timestamp": 1755208800
  },
  {
    "username": "queer_meeple",
    "rating": 6.0,
    "comment": "Playing the base game is just not that much fun anymore. This is one of the few games that I will always play with the expansion.",
    "timestamp": 1754258400
  },
  {
    "username": "minitj",
    "rating": 6.0,
    "comment": "1 партия на двоих за 3:15.\nПартия играется на мой взгляд слишком уж долго для такого «репетативного» игрового процесса, во многом из-за кучи фидлинга на фазе производства, где нужно искать иконку на поле, потом искать на своём планшете что же это за корабль\\юнит и потом в кучи серого пластика найти нужную микро-модельку и поставить в нужную цифру и так нужно сделать 6-7 раз(в зависимости от количества захваченных планет). И даже с наигрышем это никуда не уйдет из этой игры, потому что часто в неё не поиграешь и иконки эти не выучишь, да и оно просто нормально не считывается с карты.\n\nИгровой процесс в целом норм и с наигрышем наверное появляется битва умов, когда знаешь «чего хочет оппонент» и пытаешься закрыть ему ходы, но не настолько интересный, чтобы прощать игре такое больше время партии и бесячий фидлинг на фазе производства. Сыграл бы ещё пару партий, чтобы попробовать за повстанцев и сыграть финальную осознанную партию с пониманием игры за обе стороны.",
    "timestamp": 1753048800
  },
  {
    "username": "Inshane",
    "rating": 6.0,
    "comment": "To include: Rise of the Empire expansion",
    "timestamp": 1750111200
  },
  {
    "username": "redisher",
    "rating": 6.0,
    "comment": "So, have I already put this ship into production or not?",
    "timestamp": 1749765600
  },
  {
    "username": "bucketofcorgi",
    "rating": 6.0,
    "comment": "Only because of the sheer playtime and setup/wrap-up.",
    "timestamp": 1748469600
  },
  {
    "username": "Jrmmstein",
    "rating": 6.0,
    "comment": "Le jeu est selon moi overrate. C'est pas mauvais, mais il vieilli mal en comparaison avec tous les autres jeux similaire.",
    "timestamp": 1746136800
  },
  {
    "username": "Ursus5150",
    "rating": 6.0,
    "comment": "(B)",
    "timestamp": 1739401200
  },
  {
    "username": "Mattias",
    "rating": 6.0,
    "comment": "This is a surprisingly good game. I didn't have any expectations and was pleasantly surprised. Very nice handling of the theme and luckily no references to the prequel or sequel trilogies.\n\nThe split rulebook is however a disaster. Please bring back the old Avalon Hill days of concise rules writing.\n\nIf I were to rate the game with regards to the rulebooks it would have a much lower rating (think “4”), but I’ll give it a pass for the great integration of theme.\n\nAll models painted.",
    "timestamp": 1738450800
  },
  {
    "username": "horrorofthedark",
    "rating": 5.5,
    "comment": "Too much luck for me, after 2 hours the game was decided by a lucky 1 in 10 guess. If Empire guesses where the base is and can reach it next turn, Rebels can not do anything against it",
    "timestamp": 1735254000
  },
  {
    "username": "Strakatus",
    "rating": 6.0,
    "comment": "A very intense and thematic experience. Lots of fun and very tense. A definite must-play... if you have minimum 4 hours to burn",
    "timestamp": 1732834800
  },
  {
    "username": "flyingpeanut",
    "rating": 6.0,
    "comment": "Very good grasp of the theme rebels vs imperials.\nVery fun to move around minis and use actions.\nit gets a bit dragged out sometimes and feels a hussle.\nIt can get very random. Especially battles.\nit is practically a 1v1 that you can share some sides with multiple people. But it is ok with 3-4, but definitely not ideal .\nOverall not worth the price for the experience, unless you love minis and star wars.",
    "timestamp": 1732748400
  },
  {
    "username": "kamomillatee",
    "rating": 6.0,
    "comment": "This game is a experience and overall I enjoyed it.\nCan't still rate it high because of:\n- how slow the game is (not complaining about the length but what you actually do during that length)\n- one of the worst combat mechanics known to man\n- serious down time issues as rebellion player does everything first and then it's imperium turn.\nGood things were:\n- it's thematic and creates fun moments\n- I kind of like the cat and mouse mechanic",
    "timestamp": 1732748400
  },
  {
    "username": "weakcaribou33",
    "rating": 6.0,
    "comment": "A great game. The lower score has more to do with it taking a long time to teach, really only working as a two player game, and the high complexity scaring off players. It would be higher if it was easier to get people to play with.",
    "timestamp": 1730847600
  },
  {
    "username": "Fropod",
    "rating": 6.0,
    "comment": "Great gaming experience. Could easily see this higher with the improved combat system from upcoming expansion.",
    "timestamp": 1729980000
  },
  {
    "username": "PizzaChip",
    "rating": 5.5,
    "comment": "Star Wars: Rebelia mnie nie porwała. Mechanika jest spoko, wykonanie bardzo ładne, ale sama rozgrywka totalnie mnie wynudziła. Grałam Imperium, podobno łatwiej, a i tak ciężko w pierwszej partii było pojąć skutki moich decyzji. Słyszałam o tej grze tyle pochwał, że chyba miałam zbyt wygórowane oczekiwania. Gra wkurzyła mnie swoją losowością i różnorodnością. Kilka typów jednostek i statków, każda inaczej atakująca, masa planet. Trochę nie wiedziałam za co się zabrać i jaką akcję wykonać. Niby to nie wina gry, ale odczucia miałam słabe. Chętnie spróbuję jeszcze kiedyś, choć tym razem podejdę do rozgrywki z dystansem.\n\nOcena po 1 partii w 2 osoby. Czas gry = 2:21 h.",
    "timestamp": 1729634400
  },
  {
    "username": "Valcurdra",
    "rating": 6.0,
    "comment": "Played once, really enjoyed it and clearly a well designed game.\n\nI love it when games incorporate thematic storytelling elements seamlessly into game play mechanisms. This game does that all over the place and it really creates the feeling of playing out the movies.\n\nWhilst the game is 11 out of 10 for theme, it felt like only a 6 or 7 out of 10 for creating interesting game play decisions. A lot of the game play is pretty simple and the combat in particular feels a little light for my tastes.\n\nHad fun and would play again, but didn't leave me with a \"must play again\" feeling.",
    "timestamp": 1727215200
  },
  {
    "username": "HadleighMoon",
    "rating": 7.0,
    "comment": "6 might be a bit harsh. It is quite a good game. Tense in places. The combat system however really lets it down. Also you run into games where the Rebel player knows they have it in the bag and has to wait for the game to go through the motions.",
    "timestamp": 1760738400
  },
  {
    "username": "gamer-stu",
    "rating": 7.0,
    "comment": "I want to love it. I especially like sending leaders on missions. But... it is overwrought with perhaps one or two too many mechanics thrown in. The combat system is just awful. I am not a fan of the small tactics cards in particular: dice are fine, cards are fine... but both? It doesn't bother me that combat is \"different.\" It bothers me that it is super fiddly for very little payoff. This, coupled with the possibility of an early planetary invasion insta-win, hurts the game for me.",
    "timestamp": 1759269600
  },
  {
    "username": "Ico77",
    "rating": 7.0,
    "comment": "+ GALAKTISCHER KAMPF - Fan-Erweiterung für Star Wars Rebellion & Aufstieg des Imperiums",
    "timestamp": 1758146400
  },
  {
    "username": "Rafa44",
    "rating": 7.0,
    "comment": "Comes with the expansion, a foam insert and a battle playmat",
    "timestamp": 1756936800
  },
  {
    "username": "sealgo",
    "rating": 7.0,
    "comment": "Game mechanics itself are decent but work well for the atmosphere the game is trying to create. The whole experience is great, but takes a bit too long for me (+ this is what makes this hard to get to the table, hence I sold it).\n\nIMO this game is a lot about the experience, not about who wins or about making many interesting decisions.",
    "timestamp": 1756764000
  },
  {
    "username": "marinexx",
    "rating": 7.0,
    "comment": "This is a 7.1-7.2 game. Very overpriced but fairly cool looking. It was kind of boring because it was way too lengthy and it feels like it is created with theme over functionality in mind. Balancing out the fanboyism though!",
    "timestamp": 1756677600
  },
  {
    "username": "Pum_",
    "rating": 6.5,
    "comment": "Beautifully themed and fundamentally nice game mechanics, but too biased to the Imperial player. Imperial strategy is simple and straightforward to execute, whereas Rebel strategy is difficult and pretty much impossible to achieve with equally experienced and skillful players. Expansion looks like it specifically addresses this problem by making Imperial start strength weaker, and giving Rebels some less difficult to achieve objectives. Expansion combat system seems better.",
    "timestamp": 1756504800
  },
  {
    "username": "EpicEzBoy",
    "rating": 7.0,
    "comment": "After few plays for me not feel so great. Rebels are more interesting side.",
    "timestamp": 1755208800
  },
  {
    "username": "MasterCinz",
    "rating": 7.0,
    "comment": "Including:\n+ Rise of the Empire",
    "timestamp": 1754863200
  },
  {
    "username": "Dorsett_Case",
    "rating": 7.0,
    "comment": "Box C: Enthält \"Aufstieg des Imperiums\"",
    "timestamp": 1754776800
  },
  {
    "username": "bald_bull",
    "rating": 8.0,
    "comment": "– El auge del Imperio\n\n+ Enf.",
    "timestamp": 1762684440
  },
  {
    "username": "Ryyva",
    "rating": 8.0,
    "comment": "The game is too long. Halfway through, the rebel player can often tell who'll win based on the board state, but must the game goes on for at least 1 or 2 more hours.\nBut... it's still good, and unique",
    "timestamp": 1762038000
  },
  {
    "username": "Menschenmatthias",
    "rating": 8.0,
    "comment": "Exceptionally thematic, great mechanics, epic feel, tense, combat system only bearable with expansions, I miss a player aid, rules are fiddly.",
    "timestamp": 1761951600
  },
  {
    "username": "tempar",
    "rating": 7.5,
    "comment": "Played With the expnasion with Maayan.\nEpic, thematic but very long",
    "timestamp": 1761343200
  },
  {
    "username": "Mikestribe",
    "rating": 7.8,
    "comment": "Acrylic standees for ships and leaders to make it really pop",
    "timestamp": 1761170400
  },
  {
    "username": "invader_sAu",
    "rating": 8.4,
    "comment": "2p",
    "timestamp": 1761170400
  },
  {
    "username": "Har0ldinh0",
    "rating": 8.0,
    "comment": "Loads of fun. most fun had as two teams of two. listening to each side discuss theories and plans",
    "timestamp": 1761084000
  },
  {
    "username": "rudalf",
    "rating": 8.0,
    "comment": "Big Table",
    "timestamp": 1760565600
  },
  {
    "username": "superhumain",
    "rating": 7.9,
    "comment": "Very thematic and exciting game that evokes a lot of the iconic movies story beats and themes. All in all, it's a really fun system.\n\nUnfortunately, the battle system was disapointing and amonted to an auto-battler where the player with the most powerful army had the better chance. Fortunately, I've heard the expansion fixes that, so I would like to try it. Some points are also deducted for the luck of the draw (or dice throws) having too much influence. As an example, only two missions are drawn each round and some are more crucial than others.",
    "timestamp": 1760306400
  },
  {
    "username": "Mr Mjeh",
    "rating": 7.5,
    "comment": "Terrific 2-player game in which players enact a cat and mouse game with the crazily powerful Empire vs the nifty and sneaky Rebels, who turn out not to be so weak as they look.",
    "timestamp": 1760220000
  },
  {
    "username": "Connduit",
    "rating": 9.0,
    "comment": "2",
    "timestamp": 1761951600
  },
  {
    "username": "Imsevimse",
    "rating": 9.0,
    "comment": "Truly epic, with extraordinary gameplay and top-notch production. The asymmetry between the Rebels and the Empire is perfect. The only weak spot is the combat cards, which the Rise of the Empire expansion fixes. It’s fairly tough to learn or teach, but absolutely worth diving into!",
    "timestamp": 1761692400
  },
  {
    "username": "Evertore",
    "rating": 9.0,
    "comment": "sleeved + insert tbp",
    "timestamp": 1761519600
  },
  {
    "username": "alcofa",
    "rating": 9.0,
    "comment": "On of the best experiences i ever have in a board game. So immersive and so deep. The dice fest is just fun. Seek and Hide all times. Great, great game.\n\nUpdate: after 3 yers, come back to table. My 15 old love this game and always play wrong with the empire. So many minis and have a huge table presence. No w with the expansion the combat system improve at a high level and this one stills in my top 1 of SW BGs.\n\n+ Star Wars: Rebellion – Rise of the Empire",
    "timestamp": 1761519600
  },
  {
    "username": "neural_net",
    "rating": 9.0,
    "comment": "Very thematic, very cinematic. The new combat rules are pretty good, I don't know the old one.\n\nOnly drawbacks are the setup and play length, some fiddliness.",
    "timestamp": 1761343200
  },
  {
    "username": "nhmc",
    "rating": 9.0,
    "comment": "If you are a Star Wars Original Trilogy fan, this is so SO good.\n\nBe aware that an important part of overall strategy is to coordinate leader missions and fleet movements so that leader bonuses stack, and also to force your opponent into difficult choices between moving their fleet or opposing your mission. This is awesome and highly thematic but sort of glossed over in the learn to play rules.\n\nWe like playing with streamlined combat rules which have been discussed elsewhere. This variant does not use tactics cards, instead leader tactic values let you re-roll that many dice each combat round. 2 lightsaber dice can be spent to block a single hit that round ('future' hits that round can be blocked if you are the attacker), and 3 lightsaber dice can be spent prevent the enemy retreating this round. A single lightsaber die has no effect. Shield generators block one hit per round instead of drawing tactics cards. This speeds up overall play time quite bit and stops combat from becoming a slog.",
    "timestamp": 1761343200
  },
  {
    "username": "DeKerstman",
    "rating": 9.0,
    "comment": "2 players only. 120-180 minutes, Star Wars in a box!\n\nRating based on a solo run through and two games, once with my son and once with a friend. VERY cool game and very thematic. Once you have played a few rounds, it plays rather intuitive.\n\nGiven the length (3 hours easily) and only 2p, it won't hit the table much, but still very happy that this one is in my collection.",
    "timestamp": 1760911200
  },
  {
    "username": "Horsebanger",
    "rating": 9.0,
    "comment": "One of my fave asymmetrical games",
    "timestamp": 1760911200
  },
  {
    "username": "awpTilla",
    "rating": 9.3,
    "comment": "Epic experience!",
    "timestamp": 1760133600
  },
  {
    "username": "hockeyjones",
    "rating": 9.3,
    "comment": "36\n\nLast play in 2017",
    "timestamp": 1759615200
  },
  {
    "username": "jidar",
    "rating": 10.0,
    "comment": "Fabulous. Feels like I'm in the Star Wars universe.",
    "timestamp": 1762648260
  },
  {
    "username": "AJ_800",
    "rating": 10.0,
    "comment": "Star Wars: Rebellion (2016)\n\nPlayer Agency ✅\nSolid Rules ❌\nWorth the Overhead ✅\n\nDespite not being a big Star Wars fan, this is my favourite 2-player game of all time.\nThe mechanisms blend with the theme to create an immersive experience with significant strategic depth.\nThe game has its flaws: the lack of a competitive bidding system or reputation adjustment for faction means that balance tends to favour the Empire; combat can feel fiddly and uninspiring (at least in the base game) and; the rules have a lot of issues.\nHowever, despite these flaws, the game provides a deeply engaging experience with thematic stand-up moments.",
    "timestamp": 1762210800
  },
  {
    "username": "The_Philosophers_Die",
    "rating": 10.0,
    "comment": "Best non collectible two player game. A tremendous experience! But do not even consider the so called 4 player mode. It is a fraud.",
    "timestamp": 1762124400
  },
  {
    "username": "Exodusland",
    "rating": 10.0,
    "comment": "The first time I saw boardgamegeek.com this was the first title I was interested in. The game is fun, if you like sci-fi in general or Star Wars. We play with 2 players only and it is fun! In my opinion the expansion is a must have. The battles usually take quite some time (with more ships) and sometimes the dices provided with the game are not enough.\n\nFirst game with reading all the rules took 6 hours. We are now playing 2 or 3 hours tops. Plenty of cards, plenty of choices. With over 7 games I feel there are a lot more depth to it since there are cards I didn't even see so far.",
    "timestamp": 1761865200
  },
  {
    "username": "frank20a",
    "rating": 10.0,
    "comment": "Greek Guild Secret Santa 2024",
    "timestamp": 1761692400
  },
  {
    "username": "WisElf",
    "rating": 10.0,
    "comment": "+\nЗвёздные Войны. Восстание. Рассвет Империи",
    "timestamp": 1761084000
  },
  {
    "username": "Antios08",
    "rating": 10.0,
    "comment": "just the perfect game to play with 1 or 3 friends (If they like strategic board games and Star Wars)",
    "timestamp": 1760997600
  },
  {
    "username": "Rogue128",
    "rating": 10.0,
    "comment": "Highest Rank: 5 in 2017",
    "timestamp": 1760997600
  },
  {
    "username": "ExcellentRaven",
    "rating": 10.0,
    "comment": "best weuro ever. So gorgeously frustrating. Only less thematic than WotR, which is highest praise. Don't get stuck in groupthink, try new strategies. This is a keeper. I've had starwars haters love it.",
    "timestamp": 1760911200
  },
  {
    "username": "duboiskk",
    "rating": 10.0,
    "comment": "Is the expansion mandatory for giving it a 10? Nah, the base game is such a perfect game of asymmetry and tension, it's a riot for any fan of the original trilogy.",
    "timestamp": 1760738400
  }
]