[
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "It's serviceable. Slightly more wacky romp than efficiency builder. But to me, building decks seems to slow it down and get players to look away from each other, so it doesn't pull me in as much as it could.",
    "timestamp": 1730070000
  },
  {
    "username": "eladnl",
    "rating": 1.0,
    "comment": "The game lacks human interaction - every player is busy counting 5 cards for his/her turn and is literally disconnected from any other player. I find this aspect very difficult and the game turns to be boring due to lack of communication between players. I wanted to end the game as fast as possible and that determined my strategy. The good thing was that the other 2 players were nice people.",
    "timestamp": 1654898400
  },
  {
    "username": "ben_hutchison",
    "rating": 1.0,
    "comment": "Typical ameritrash, lots of light and color almost hides the poorly tuned gameplay and lack of meaningful decisions.\n\nIts meant to be a deck builder, but an armada of arbitrary rules means thats 50%+ of cards on offer are impossible or irrational to purchase on any given turn.",
    "timestamp": 1618437600
  },
  {
    "username": "Tranced",
    "rating": 1.0,
    "comment": "Too messy and complicated with very poor rulebook. Extremely difficult to wrap your head around.",
    "timestamp": 1581807600
  },
  {
    "username": "Medvick",
    "rating": 1.0,
    "comment": "Hated the game; press your luck, can be over in 10 minutes if someone does the cheap action and turns back around and boom game over. Horrible and boring.",
    "timestamp": 1577746800
  },
  {
    "username": "JimmyEWorld",
    "rating": 1.0,
    "comment": "tap this 1",
    "timestamp": 1567548000
  },
  {
    "username": "wingnut338",
    "rating": 1.0,
    "comment": "Wow over rated game. No real decisions the cards you draw dictate what you can buy and where you can go...",
    "timestamp": 1566684000
  },
  {
    "username": "mdean",
    "rating": 1.0,
    "comment": "No player interaction, push your luck, not my favorite combo. Not too bad though, pretty simple and easy to play. Kind of sucks you can't do anything once you get out of the dungeon except hope everyone dies.",
    "timestamp": 1561240800
  },
  {
    "username": "Euroman",
    "rating": 2.0,
    "comment": "Another boring deck-building game.\nI keep trying them, but they are all the same repetitious undertaking. Play some cards, add one or two, play more cards, rinse and repeat. What fun is player elimination? What fun is one person getting deep into the dungeon while another languishes far behind? Just dumb and boring. Will not play again.",
    "timestamp": 1762658220
  },
  {
    "username": "BoardGamingCouple",
    "rating": 2.0,
    "comment": "2/5\n\nclank is a fun family game, but it is too random and fiddly to setup. there are some broken strategies that exist. the deckbuilding severely lacks as trashing cards is very rare. the expansions dont add much.\n\nclank in space has a much better theme. the gameplay is better and it prevent the broken strategy of the base game. the gameplay can run a bit long and the setup is still fiddly. missing trashing effects. the expansions add some fun elements.\n\nclank catacombs is better than clank, but it can be entirely too random as you make the board as you go.\ngood improvement on the original.\n\nthe best clank expansions are the character packs. player powers are awesome in any game. it makes the game high replayable. 300+ plays.\n\nclank legacy is a different experience. see legacy review. the eternal game board is more interesting than clank.",
    "timestamp": 1735254000
  },
  {
    "username": "Dampy",
    "rating": 2.0,
    "comment": "never again",
    "timestamp": 1712959200
  },
  {
    "username": "trodat123",
    "rating": 2.0,
    "comment": "deckbuilding is not one of my favourites so the push your luck aspect couldn't save this one for me. Too long for the push your luck feeling and not engaging enough to justify this to be a longer game",
    "timestamp": 1712700000
  },
  {
    "username": "ashkai",
    "rating": 2.0,
    "comment": "A mediocre and pretty repetitive deck building game with a race mechanic included.\n\nNot for us despite trying some coop variants.",
    "timestamp": 1678489200
  },
  {
    "username": "Entropology",
    "rating": 2.0,
    "comment": "In some ways a step up in deckbuilding, adding the board and different goals at different times is a nice change of pace. However, classic problem of culling came back with a vengeance. One player got a way to cull the clank cards out of her deck on the first turn. In this game that issue is doubly bad, not only is your deck leaner and more efficient, you're removing negative cards, it's a double win. Thus, they never added cubes, never had to worry about health and won 80 to 20 to 0. The game was literally never in doubt after the first turn. Why the $#% can't designers see this problem?!?\n\n[Edit]: Played again, no culling this time, thought it might go better. Nope, random chance left one player with excellent card buys, the other two with nothing. He made it to the bottom and returned before either other player could make it to the mid-board market. The double randomness of a rotating market and deck building/draw, BLECK!",
    "timestamp": 1671490800
  },
  {
    "username": "foxx",
    "rating": 2.0,
    "comment": "Combines mechanisms that work best with 2 with mechanisms that work best with more than 2. Leaving this bad at all player counts.",
    "timestamp": 1629324000
  },
  {
    "username": "ErickRPG",
    "rating": 2.0,
    "comment": "This was just no fun. Whether it be the deck building, the way the board looks, or the way the game plays. It felt like I was forcing myself to like this game. So I sold it.",
    "timestamp": 1601503200
  },
  {
    "username": "shawnmackay1593",
    "rating": 3.0,
    "comment": "See my description of Clank in Space.",
    "timestamp": 1746655200
  },
  {
    "username": "TForever",
    "rating": 3.0,
    "comment": "Light deck building dungeon crawl. You can go deeper for more treasure, but I feel you can calculate when the other plays are in trouble, so you can bail to keep your score. It's medium at best.",
    "timestamp": 1745359200
  },
  {
    "username": "ultimoratio",
    "rating": 3.0,
    "comment": "Don't see the point of this when you have Clank Catacombs. But acknowledging that Catacombs stood on the shoulders of its predecessors.",
    "timestamp": 1742770800
  },
  {
    "username": "Pickto",
    "rating": 3.0,
    "comment": "2-4",
    "timestamp": 1742252400
  },
  {
    "username": "Sister_Ruth",
    "rating": 3.0,
    "comment": "Random card market makes it impossible to properly plan. Dominion and Quest for El Dorado's market mechanics are far better than this.\n\nBesides that, a major contention I have is the inconsistent frequency of dragon attacks. The ideal scenario is a moderate to constant frequency, but I've had multiple plays where the dragon rarely attacks at all. Apart from being a boring experience, many powerful cards are balanced only by how much noise the player accumulates when using them, which is completely irrelevant if the dragon rarely attacks. I suppose it's fine if the game wants to occasionally reward a reckless strategy of accumulating noise, but it makes for boring gameplay and, anecdotally, it's happened more often than not.\n\nBeyond those issues, the mechanics of the game itself are just so dull. It's a simplistic, run-of-the-mill, somewhat derivative deckbuilder coupled with a board that provides minimal player interaction.\n\nIn essence, the game is dookie.",
    "timestamp": 1740697200
  },
  {
    "username": "pwoloszun",
    "rating": 3.0,
    "comment": "Mediocre, uninspiring, forgettable.\nI can play again with kids but this is nothing I need own or will ask to play.\n\nKnizias The Quest for El Dorado is a different, but waaay better racing game.",
    "timestamp": 1726264800
  },
  {
    "username": "kiwipaul",
    "rating": 3.0,
    "comment": "was disappointing to me, seems predictable and lacks variation.",
    "timestamp": 1722376800
  },
  {
    "username": "Bechara",
    "rating": 3.0,
    "comment": "Feels like a party game bloated with complexity.",
    "timestamp": 1701298800
  },
  {
    "username": "FlurkyTurkey",
    "rating": 4.0,
    "comment": "Too much RNG with the dragon health. Deck building is somewhat fun though. But this game just feels messy and way too chaotic.",
    "timestamp": 1759010400
  },
  {
    "username": "nic7410",
    "rating": 4.0,
    "comment": "12 new",
    "timestamp": 1757541600
  },
  {
    "username": "IsolatedPawn",
    "rating": 4.0,
    "comment": "The deck building here feels more like accumulation, and getting good cards is more important than achieving any kind of synergy or planning for the board state. And for a game that thematically calls out for an exciting ending, it’s an anticlimactic experience, where players just linger above the safe line collecting points, until someone takes enough damage to venture out and end the game. Players then count up points from a plethora of sources and it ends with a whimper.",
    "timestamp": 1755813600
  },
  {
    "username": "Hruberen",
    "rating": 4.0,
    "comment": "It's alright, but it doesn't appear to have much in the way of choice for a player",
    "timestamp": 1748124000
  },
  {
    "username": "eddieb",
    "rating": 4.0,
    "comment": "I prefer in space as I love space series",
    "timestamp": 1746568800
  },
  {
    "username": "smurfodeth",
    "rating": 4.0,
    "comment": "Takes longer than I’d prefer, and isn’t particularly interesting mechanically, but I’ve played plenty of games that I hate more.",
    "timestamp": 1745791200
  },
  {
    "username": "melalimelo",
    "rating": 4.0,
    "comment": "Pour moi, la mécanique ne fonctionne pas.\nIl faudrait que les attaques de dragon soient obligatoires/ cadencées.\nPour maximiser les points, nous avons pris le parti de ne pas acheter de cartes donjon pour ne pas réveiller le dragon (achat non obligatoire). Inutile de se mettre volontairement des bâtons dans les roues. On a joué en compétitif avec les attaques de gobelins et les cartes permanentes sans risques. Le dragon n est arrivé que lorsque le premier joueur est sorti.\nEn conséquence, jeu fade et sans aucune pression ni intérêt. Dès la lecture des règles, absolument évident qu il ne faut pas réveiller le dragon. Comme c est possible en respectant les règles, pour moi le jeu ne fonctionne pas. En seconde partie, nous avons mélangé les 2 deck de cartes et c était plus amusant. La règle est à revoir je pense. Un avis qui en vaut un autre.",
    "timestamp": 1742770800
  },
  {
    "username": "DanKill",
    "rating": 4.0,
    "comment": "much prefer the space version",
    "timestamp": 1742770800
  },
  {
    "username": "Schr0dinger85",
    "rating": 5.0,
    "comment": "I’ve only played it on TTS, and that was very early in my board-gaming journey. I thought it was fine — good for a laugh among friends. I like deckbuilding, and here the map adds some interaction while the dragon brings in a push-your-luck element.\n\nAfter the third play, though, I started to notice how unbalanced and a bit shallow/repetitive it was. I don’t think I’d play it again; I’d rather go for The Quest for El Dorado.",
    "timestamp": 1762297200
  },
  {
    "username": "Archimicarus",
    "rating": 5.0,
    "comment": "For my taste, Clank does not allow quite the amount of time to engine-build as I like to experience in a deckbuilder. Whereas in Dominion the final turns will have you cascading through your deck and feeling like you really did the thing, Clank has you ekeing just a few synergies through before the game ends just a bit too soon to feel satisfied with what you've built.",
    "timestamp": 1755727200
  },
  {
    "username": "Ralsekx",
    "rating": 5.0,
    "comment": "Luck, luck, luck, and yes, more luck.",
    "timestamp": 1748901600
  },
  {
    "username": "Eliya84",
    "rating": 5.0,
    "comment": "A take it or leave it game. Not really fascinating.",
    "timestamp": 1747864800
  },
  {
    "username": "redreg7",
    "rating": 5.0,
    "comment": "I can see why people like this but the theme and map traversal is in a style that is not for me. Ironic given my favourite game is by the same designer.",
    "timestamp": 1747432800
  },
  {
    "username": "getareaction",
    "rating": 5.0,
    "comment": "Bought at LoBsterCon in May 2025. Rating based on one play.",
    "timestamp": 1746309600
  },
  {
    "username": "Birdie86",
    "rating": 5.0,
    "comment": "Haven’t played enough to give an accurate rating",
    "timestamp": 1741993200
  },
  {
    "username": "dosxtres",
    "rating": 5.0,
    "comment": "3",
    "timestamp": 1741906800
  },
  {
    "username": "Redgarz",
    "rating": 5.0,
    "comment": "Diferentes mapas, diferentes cartas, cada vez puedes jugar a ir a unas cartas concretas distintas, con distintas estrategias de rutas o de tesoros que conseguir. Risas aseguradas con los ataques del dragón y saliendo pronto de la mazmorra viendo desde un punto seguro como los demás intentan sobrevivir. Echo en falta más cartas con interacción entre jugadores y es demasiado azaroso, pero totalmente recomendado. He jugado la expansión submarina y de la momia, ambas igualmente geniales.",
    "timestamp": 1739055600
  },
  {
    "username": "rutherford82",
    "rating": 4.7,
    "comment": "The deckbuilding is a tad subpar, but the adventure map is really fun. Would rather play Near and Far instead.",
    "timestamp": 1729980000
  },
  {
    "username": "Salvatortoise",
    "rating": 5.0,
    "comment": "I’ve played this twice and have come to the conclusion that it is a luck fest and I will actively avoid playing it ever again. It may be a fun game for people who are New to the hobby but that’s about it. Certainly cannot hold a candle to Dominion",
    "timestamp": 1728424800
  },
  {
    "username": "Oninohugo",
    "rating": 5.0,
    "comment": "Simple and engaging deck builder but fails on tension promisses and luck of the draw.",
    "timestamp": 1727301600
  },
  {
    "username": "Kiro",
    "rating": 5.0,
    "comment": "2 - 4",
    "timestamp": 1725228000
  },
  {
    "username": "Pekuis",
    "rating": 5.0,
    "comment": "May 2021: 7\nJul 2024: 5",
    "timestamp": 1721685600
  },
  {
    "username": "lttlkng",
    "rating": 5.0,
    "comment": "Knight",
    "timestamp": 1717884000
  },
  {
    "username": "BonesJackson",
    "rating": 5.0,
    "comment": "I never loved Clank despite it being popular among my friends. I'd gladly play it, but I never would suggest it. I think the static board layout felt samey and the same few strategies would emerge each time we pulled it out.\n\nUpdate - Catacombs seems to have fixed most the major issues I had with the original version.",
    "timestamp": 1717106400
  },
  {
    "username": "michelzvic",
    "rating": 6.0,
    "comment": "❌ BUSCHI",
    "timestamp": 1762038000
  },
  {
    "username": "Kaibaman209",
    "rating": 6.0,
    "comment": "Need to play with competitive people",
    "timestamp": 1761084000
  },
  {
    "username": "logopolys",
    "rating": 6.0,
    "comment": "Overall, I felt underwhelmed by the game. I didn't feel like I had as much control over my deck as many deck-builders, and I didn't feel like the interaction on the board was very interesting. As it is, this was just a game that failed to satisfy me as a dungeon game or as a deck-building game. If anything, it just made me want to play Trains, a game with a much more interesting deck/board interaction.",
    "timestamp": 1759269600
  },
  {
    "username": "demug",
    "rating": 6.0,
    "comment": "prefer clank catacombs",
    "timestamp": 1759096800
  },
  {
    "username": "Miniboss1",
    "rating": 6.0,
    "comment": "Good Game. Turns take a bit too long and not much interaction between the players.",
    "timestamp": 1759096800
  },
  {
    "username": "Auroric",
    "rating": 6.0,
    "comment": "I'm a big deck building fan, and tacking on the race, push your luck, and dungeon looting elements is just a really neat, fun mix. Very unique blend, with a theme and ruleset that makes makes it friendly and approachable.\n\nThat said, it gets stale fairly quick. There's not a ton of depth to the deck construction, and almost no ways to trash all the junk cards you start with. I've frequently found myself not wanting to buy any middling cards that will just clog up my deck more, while also not able to move anywhere useful. Do-nothing turns feel bad, and I feel like this was a weird design oversight. It desperately needs more mitigation. I also wish there was some form of direct interaction; for a game with these mechanics it feels very weird that it's almost multiplayer solitaire. There's a lot of potential here but I don't care in the least what other players are doing, it's mostly random anyway.\n\nI'd like to try the newer versions, as I really like what this game is going for. Ultimately though my opinion has lowered quickly, and I think it just doesn't have enough depth or real strategy to really grab me. Still a great lighter game for folks who are slightly less critical and like the sounds of it.",
    "timestamp": 1757541600
  },
  {
    "username": "FrancoisX",
    "rating": 6.0,
    "comment": "Nothing revolutionary but quite fun with three players. It's a bit long with 4 and with 2 players, there is less potential to manipulate the timing.",
    "timestamp": 1757109600
  },
  {
    "username": "coxy_fc",
    "rating": 6.0,
    "comment": "8+ best 3\n\nDidn't live up to the hype first play. The card play is nice but the board layout is clunky and odd. The theme with the \"dragon\" track is pretty much as themeless as any euro that is described as themeless...",
    "timestamp": 1756764000
  },
  {
    "username": "mlbdude",
    "rating": 6.0,
    "comment": "X",
    "timestamp": 1756677600
  },
  {
    "username": "Johnnyhoboy",
    "rating": 6.0,
    "comment": "Also owned by friends",
    "timestamp": 1756159200
  },
  {
    "username": "cinnzel",
    "rating": 6.0,
    "comment": "Un juego de construcción de mazo fresco y desenfadado con un importante factor de forzar tu suerte. En “Clank!” puedes explorar una mazmorra, robar artefactos al temible dragón, poner la zancadilla a tus oponentes y salir a la superficie en menos de una hora de juego.",
    "timestamp": 1755381600
  },
  {
    "username": "ToreDenmark",
    "rating": 6.0,
    "comment": "Good game. Tons of fun.",
    "timestamp": 1755295200
  },
  {
    "username": "sykano",
    "rating": 5.8,
    "comment": "deckbuilding game with a board\nsort of \"Dominion\" with a board and a theme\n\n+ innovative ?\n+ second board included as advanced variant\n- quite abstract and a bit illogical\n- artworks (board looks almost like a prototype)\n- very luck-dependent (what cards are revealed to buy when it's your turn, attack triggers, secrets, damage cubes out of the bag (!!), ...), you can do everything right and still just die when your cubes are drawn\n- player elimination\n- sleeved cards don't fit in inlay (maybe ffixed in later printings who knows)\n- heavily card-based (sleeves necessary)\n- very expensive\n\nI find this a bit lacking in comparison with \"Clank in Space\" which is a bit more complex. Also, the space theme seems to work better for me for this kind of game.\n\nThey say there is a dragon, but you don't see it and it just causes random damage.\nWhy is there no dragon pictured on that board?\n\nIt's odd that you get a lot of CLANK while doing nothing, just from stumbling. I really think this should be only on strong cards or from a few general effects.\nAnd it's super odd, that you can get damage from your CLANK way later after you made noise in the dungeon when you're already far away.",
    "timestamp": 1754344800
  },
  {
    "username": "Moosetoo",
    "rating": 5.5,
    "comment": "3+ plays\n\nClank is a good game, but it is not to my tastes when it comes to deckbuilders. What I enjoy in deckbuilding games is the ability to form clever combos and develop a unique strategy over the course of a game. In Clank, it feels like the composition of your deck is largely out of your control. Opportunities to prune cards are few and far between, and you must rely on the card river to provide something useful when your turn comes around.\n\nMy favorite part of Clank is definitely the tension surrounding navigating the dungeon, though I think the sequel, Clank Catacombs, does this better by allowing players to discover the dungeon as the game progresses.",
    "timestamp": 1754172000
  },
  {
    "username": "Griffted",
    "rating": 6.0,
    "comment": "Heads-down and not funny enough.",
    "timestamp": 1753826400
  },
  {
    "username": "gr9yfox",
    "rating": 6.0,
    "comment": "The concept sounds great when I played it I found it too streamlined. It often slows players down and the cards don't allow for satisfying turns or clever card play.\nYou have to use all the cards you draw in a turn. The majority of the cards don't interact with each other, they just give you currency (\"money\", movement, attack), so the optimal move is often apparent (move here, buy this card, pass).\nWhen you walk into crystal caverns you can't continue moving forward, which brings lots of turns to a halt in the early and end game.\nI do like the race aspect and the ever present threat that the dragon brings.",
    "timestamp": 1752184800
  },
  {
    "username": "pers0n",
    "rating": 6.5,
    "comment": "2-4p, 30-60min",
    "timestamp": 1762660200
  },
  {
    "username": "rivo",
    "rating": 7.0,
    "comment": "One play.",
    "timestamp": 1762210800
  },
  {
    "username": "Imsevimse",
    "rating": 7.0,
    "comment": "Overall, the presentation is fine, but I was unimpressed with the card abilities, and the static paths are a serious miss. Only played with two players—likely better at higher counts. I’d probably enjoy later entries in the series more.",
    "timestamp": 1761951600
  },
  {
    "username": "tynaut2",
    "rating": 6.5,
    "comment": "I enjoy the deck building of Clank! but swapping out for Catacombs added some additional variety I was looking for in the game.",
    "timestamp": 1761606000
  },
  {
    "username": "RougeHemlock",
    "rating": 7.0,
    "comment": "Deckbuilding mixed with dungeon delving. Get in, get treasure, get out. The longer you stay the more treasure you get but the more likely you are to get killed. Involves a level of big picture push-your-luck as a result. Everything this does though, Clank Catacombs does better (except for expansion integration). Until Mistborn came out, this was easily my favorite deckbuilding game. Still second favorite. I suspect once Mistborn gets expansions though it will continue to widen that gap. Just play Clank Catacombs though if you only pick one version of Clank.",
    "timestamp": 1760824800
  },
  {
    "username": "Apollox5280",
    "rating": 7.0,
    "comment": "Sold as I never found a reason to return to it, I've got other light games that I'd rather pull out.",
    "timestamp": 1760824800
  },
  {
    "username": "rkleopold",
    "rating": 7.0,
    "comment": "Keep",
    "timestamp": 1760738400
  },
  {
    "username": "Mcl2512",
    "rating": 7.0,
    "comment": "+ Abenteurergruppe\n+ Versunkene Schätze\n+ Expeditionen & Tempel der Affenlords",
    "timestamp": 1760652000
  },
  {
    "username": "moujique",
    "rating": 8.0,
    "comment": "Light, easy, challenging game good to play with family, friends or coworkers.",
    "timestamp": 1762615740
  },
  {
    "username": "YoLYcmqZ",
    "rating": 8.0,
    "comment": "Thoughts: So much fun—love the light deck building. Play both base game and Sunken Treasures; each brings a unique challenge. Only played IRL at 2 and it's solid. Played at 3 on digital and the computer almost always wins. Catacombs looks interesting but this will do for us! Push-your-luck with the dragon adds great tension.\n\nTag(s): Deck Builder, Push-Your-Luck, Adventure\nBest Player Count: 2-4, {3-4}\nRating: 8, +0.0\nOwn: Physical, Digital\n+ Clank!: Sunken Treasures (Digital only)",
    "timestamp": 1762608000
  },
  {
    "username": "FarawayPictures",
    "rating": 8.0,
    "comment": "Brilliant game.\nLot's of fun with strategy as you build a deck to explore a dungeon.",
    "timestamp": 1762590000
  },
  {
    "username": "Maggiemay6",
    "rating": 8.0,
    "comment": "2.22\nDeck Builder\nPoint to point movement",
    "timestamp": 1762297200
  },
  {
    "username": "bamftw",
    "rating": 7.5,
    "comment": "+ Adventuring Party\n+ Cards from Acquisitions Incorporated\n+ Catacombs",
    "timestamp": 1762124400
  },
  {
    "username": "Suleckja",
    "rating": 8.0,
    "comment": "Clank does such a unique thing as a deck-builder in that the useless cards actually trigger a timer for the dragon to come and attack! Such a cool concept. A great deck builder.",
    "timestamp": 1762124400
  },
  {
    "username": "Codiac2600",
    "rating": 7.5,
    "comment": "I have to admit that I slept on this game and I wish I hadn't. Deck building plus bag building plus a little bit of point optimization. So good.",
    "timestamp": 1762124400
  },
  {
    "username": "mafkegel",
    "rating": 8.0,
    "comment": "- Sleeved cards (Dragon Shield Clear Matte)\n- 3D printed token holder: https://makerworld.com/nl/models/1040295-clank-catacombs-tok...",
    "timestamp": 1762038000
  },
  {
    "username": "juampiok",
    "rating": 9.0,
    "comment": "JUEGASO!, lo juego mucho con mi hija le encanta, a mi tambien buildingdeck increible.",
    "timestamp": 1762470000
  },
  {
    "username": "ditterio",
    "rating": 9.0,
    "comment": "Solo: https://boardgamegeek.com/filepage/149374/clank-automa-solo-...",
    "timestamp": 1762297200
  },
  {
    "username": "weceq",
    "rating": 9.0,
    "comment": "#family\n#players\n#medium",
    "timestamp": 1762038000
  },
  {
    "username": "Olympian78",
    "rating": 9.0,
    "comment": "BGBSA, late 2025",
    "timestamp": 1761951600
  },
  {
    "username": "screwy81",
    "rating": 9.0,
    "comment": "Nominee\nGame of the Year 2017",
    "timestamp": 1761951600
  },
  {
    "username": "RevSavage",
    "rating": 9.0,
    "comment": "Missing",
    "timestamp": 1761865200
  },
  {
    "username": "Flo00",
    "rating": 9.0,
    "comment": "+ Sunken Treasures\n+ Mummy's Curse\n+ Gold and Silk\n+ Temple of the Ape Lords\n+ Adventuring Party\n+ Brawn vs. Boots promo\n+ Wishing Wall promo\n+ Siren promo\n+ Dire Wolf promo\n+ Door to before promo\n+ Snack Table promo\n+ Trailblazer promo",
    "timestamp": 1761519600
  },
  {
    "username": "SinnedYam",
    "rating": 9.0,
    "comment": "Best: 3 Players",
    "timestamp": 1761519600
  },
  {
    "username": "Dragano",
    "rating": 10.0,
    "comment": "Sleeves ✅",
    "timestamp": 1760220000
  },
  {
    "username": "P3te",
    "rating": 10.0,
    "comment": "Gold and Silk, Temple of Apes, Adventuring Party, Sunken Treasures, Mummy's Curse",
    "timestamp": 1758664800
  },
  {
    "username": "gizmobj",
    "rating": 9.5,
    "comment": "One of the first ten games I bought when re-entering the hobby. Very enjoyable and always look forward to playing.",
    "timestamp": 1757109600
  },
  {
    "username": "darKOR",
    "rating": 9.8,
    "comment": "that is a fun deck-builder, maybe more fun then Dominion, perfect tension/playtime - when comes this with a modular gameboard? edit: Clank! In! Space!: A Deck-Building Adventure",
    "timestamp": 1756936800
  },
  {
    "username": "murzim",
    "rating": 9.5,
    "comment": "US 2016\n\nGreat deckbuilder with a board with a push your luck mechanism attached to it. You need to run through a dungeon , picking up artifacts on the way, trying to make it safely back up out of the dungeon before the dragon gets mad. Really good and enjoyable to play! My 6-year old son would play this all day long and even though he doesn't know english, he knows what all cards do by memorizing them. Highly recommended family game! Just pure fun. I try to avoid it with 4 players though as it takes too long then for what it is imo - but 3 players rocks!\n\nPERSONAL NUMBER 3\n\nKEEP",
    "timestamp": 1756677600
  },
  {
    "username": "teebzzz",
    "rating": 10.0,
    "comment": "2-4P\n3B\n2-4C",
    "timestamp": 1756591200
  },
  {
    "username": "Jsheebz",
    "rating": 10.0,
    "comment": "Probably my favorite deck builder",
    "timestamp": 1755986400
  },
  {
    "username": "Mikeymirabella",
    "rating": 10.0,
    "comment": "Fast intuitive deck-building paired with compelling push-your-luck dungeon dwelling, and a cinematic theme/ \"Clank\" mechanism make this an easy gateway game to tabletop gaming for anyone with friends who may have played video games or dabbled in some CCGs and you want to show them what board games can be",
    "timestamp": 1754604000
  }
]