[
  {
    "username": "SpielzusammenGER",
    "rating": 1.0,
    "comment": "Not a good game at all. It is overhyped and overpitched by people who want to justify their bad purchase decision.\nHere is why it is not a good game:\n\n1.) Trick tacking does not work in a cooperative way. Trick tacking by nature is competetive.\n2.) Any game, emphasis on the word game, that does not allow players to talk to each other is not a game. I have observed over multiple years bow that this game is liked by people who are socially awkward and have difficulties talking in general. Making the overall play experience even worse than it already is. Games are a social thing. Any silent games, like SkyTeam or this, are not games. They are solomode solitaire scrypt games for people that prefer silence over social fun.\n3.) The manual is terrible. I am a German and even the German manual is freaking bad. UX/UI are convoluted and the rules are not easy to understand. This is a \"game\" where you need to watch three let's plays online in order to understand it.\n4.) Again, it is a trick taking game and nothing new. This \"game\" is like the German card game 66 but just bad clunky rules layer on top with some imaginary missions.\nHow is \" you must collect 7 yellow\" a mission? They resell the same game with a different theme each year!! And people buy it!! You can make your own missions!\n\nThis \"game\" is beyond bad. It is foul.\nThe praise for this game is an insult to all game creators that put effort into their games.\nDo not play , do not purchase!!",
    "timestamp": 1761429600
  },
  {
    "username": "luwie",
    "rating": 1.0,
    "comment": "New to boardgames/cardgames but damn I just got so frustrated with the rules because of how badly designed that I was just going around in circles. ChatGPT helped me understood this game better than anyone else. How the rules were explained in accurate ways, then sometimes vague ways can be so misleading.",
    "timestamp": 1761429600
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "I dislike how there's so many trumps, kinda bypasses all the co-operation because you can just use one of those in an emergency. And you communicate silently with a token, huh? This just leads people to play the game lifelessly and quietly, like it's a soulless puzzle to solve.\n\nHuh, it reminds me of Codenames now. Why did I think of that horrible title?",
    "timestamp": 1752098400
  },
  {
    "username": "lililililil",
    "rating": 1.0,
    "comment": "Casual",
    "timestamp": 1747432800
  },
  {
    "username": "Acharnement",
    "rating": 1.0,
    "comment": "Nothing at all connected to the theme. The \"setting\" and \"missions\" are merely window dressing. It is simply a trick-taking card game. The cooperative element is mostly removed as inter-player communication is supposed to be limited. Definitely will not play again.",
    "timestamp": 1714600800
  },
  {
    "username": "SeaBirder",
    "rating": 1.0,
    "comment": "Not fun",
    "timestamp": 1707346800
  },
  {
    "username": "drinksandmeeples",
    "rating": 1.0,
    "comment": "Not for me. I'm happy for anyone who enjoys it but I didn't find anything enjoyable in this game.",
    "timestamp": 1704236400
  },
  {
    "username": "Zwal",
    "rating": 1.0,
    "comment": "Since Deep Sea, there is no reason to play this Version.",
    "timestamp": 1685138400
  },
  {
    "username": "klebinaldo",
    "rating": 1.0,
    "comment": "Pandemic Effect.\nI can't understand how these co-ops can rank high in the Family game category.\nReason: Medium Heavy difficult/complex.",
    "timestamp": 1672786800
  },
  {
    "username": "Guadhero",
    "rating": 1.0,
    "comment": "Disliked the game. The concept of it is very boring and honestly doesn’t make sense. Instructions make it more confusing than it needs to be. Very easy game. Not a fan.",
    "timestamp": 1659823200
  },
  {
    "username": "joven11",
    "rating": 1.0,
    "comment": "I somehow just hate the idea of yet another trick-taking game in which you're not allowed to talk.\nAnd the theme is a joke!",
    "timestamp": 1646866800
  },
  {
    "username": "GaiaHero",
    "rating": 1.0,
    "comment": "Omega boring, if you have been banned from a casino for card counting maybe you will like this.",
    "timestamp": 1623794400
  },
  {
    "username": "cewbacca",
    "rating": 1.0,
    "comment": "How can anyone like this, if you do then what is wrong with you? Just play Fox in the Forest okay? This sucks. I did play a few games and with different people too, no matter who I was with they agreed this game is awful.",
    "timestamp": 1623794400
  },
  {
    "username": "oVVVVVo",
    "rating": 1.0,
    "comment": "Completely bugged ... undoable after mission 8 unless you are pretty lucky",
    "timestamp": 1619128800
  },
  {
    "username": "karcsi87",
    "rating": 1.0,
    "comment": "Worst game what i have ever played",
    "timestamp": 1614121200
  },
  {
    "username": "xyoxyo",
    "rating": 1.0,
    "comment": "I could feel how boring this game is even by just reading the rulebook.",
    "timestamp": 1606258800
  },
  {
    "username": "jorgnaumann",
    "rating": 1.0,
    "comment": "I hate trick-taking. My friends assured me they found the trick-taking game I would love. I tried it... I hate it.",
    "timestamp": 1605999600
  },
  {
    "username": "deemster",
    "rating": 1.0,
    "comment": "A dull card game with a theme pasted on.",
    "timestamp": 1605826800
  },
  {
    "username": "Gatekeeper3000",
    "rating": 1.0,
    "comment": "I can’t stand trick taking games and I’m not a fan of silent games like magic maze. So this game got all the things I hate in a game in one glorious production. I never want to ever play this again. I knew what I was getting into. And still hated it. Second worst game ever made next to Sorry.",
    "timestamp": 1604876400
  },
  {
    "username": "ArcOfTheBrotherment",
    "rating": 1.0,
    "comment": "I like co-op games but just making sure one person or the other takes the correct trick can be hardly called a game at all. I simply cannot understand why it is receiving such a high rating.",
    "timestamp": 1588456800
  },
  {
    "username": "Wolcik",
    "rating": 2.0,
    "comment": "Digital version available (BGA)",
    "timestamp": 1758751200
  },
  {
    "username": "Robtrot",
    "rating": 2.0,
    "comment": "No theme at all.... I don't enjoy this. Play fellowship of the ring if you want coop trick taking.",
    "timestamp": 1739314800
  },
  {
    "username": "Shadow Vessel",
    "rating": 2.0,
    "comment": "One of the worst gaming experiences I've ever been subjected to. I had no idea what was going on and couldn't figure out a decent strategy with what to play to help the rest of team win their tasks. It's won awards and seems highly regarded on here so I'm happy to accept the problem is me (with zero trick taking experience) and not the game, but geez, what a terrible experience this was; I play games to have fun, not to be repeatedly reminded how dumb I am.",
    "timestamp": 1732489200
  },
  {
    "username": "trodat123",
    "rating": 1.5,
    "comment": "The idea of playing a trick-taking game cooperatively seemed very absurd to me... luckily it really played out as bad as the idea was",
    "timestamp": 1714428000
  },
  {
    "username": "Trevorbatman",
    "rating": 2.0,
    "comment": "Present from a well-meaning relative. (\"The people in the store said that it is a very popular game\") I am sure that it is a great game as long as you like trick-taking. Unfortunately, I do not like the taking of tricks.",
    "timestamp": 1712095200
  },
  {
    "username": "Shrimpchipz",
    "rating": 2.0,
    "comment": "Don't like trick taking theme",
    "timestamp": 1710543600
  },
  {
    "username": "GoldenHorse",
    "rating": 2.0,
    "comment": "Kinda lame",
    "timestamp": 1707519600
  },
  {
    "username": "morrisdata",
    "rating": 2.0,
    "comment": "I know this is not a popular opinion but this game missed to many marks for all the hype. In the end I gave it away, maybe someone else will love it as much as all the reviewer$ do. Perhaps without all the hype the expectations would not have been so hi, this does account for some of the lower review. I suppose with less hype maybe I would have given it a 4, maybe.",
    "timestamp": 1694383200
  },
  {
    "username": "cvdasf",
    "rating": 2.0,
    "comment": "Really don't love this game. Very confusing.",
    "timestamp": 1693432800
  },
  {
    "username": "DrBrooks",
    "rating": 2.0,
    "comment": "This game gives me an excuse to go to the kitchen and make snacks. Hated it.",
    "timestamp": 1689804000
  },
  {
    "username": "LoyalLight",
    "rating": 2.0,
    "comment": "Sell/Trade",
    "timestamp": 1682892000
  },
  {
    "username": "PokeGamer",
    "rating": 2.0,
    "comment": "One of the worst trick taking games I have played if not the worst.",
    "timestamp": 1674774000
  },
  {
    "username": "Sir Pent",
    "rating": 2.0,
    "comment": "Really disappointed since this has such rave reviews. But in a 5-player game it is REALLY easy for a situation to occur by as early as the 3rd level which is mathematically impossible to win. It happened to us twice in a row and reflects poor design.",
    "timestamp": 1671058800
  },
  {
    "username": "StrznSpock4ever",
    "rating": 2.0,
    "comment": "Played once with folks online - super toxic and made the game a miserable experience. Rating may increase if played with more tolerable people.",
    "timestamp": 1652565600
  },
  {
    "username": "sofriedrich",
    "rating": 2.0,
    "comment": "Tried it several time sin several groups. Always a flop. Boring.",
    "timestamp": 1636066800
  },
  {
    "username": "Bombadillo",
    "rating": 2.0,
    "comment": "I like trick taking games but hate with a passion those games that forbid any kind of communication between players: it’s unnatural and takes away all the fun of playing games.\n\nThis is why I can’t stand The Crew: here the lack of communication - or, rather, its strictly regulated form of communication - is central to how the game works and in a sense it is the game. With open communication there would be no real challenge, hence there wouldn’t be The Crew either.\n\nBut I really hate being gagged or prevented from talking about anything I want to, the same reason why I hated half-decent games like Hanabi, Magic Maze, even Gloomhaven, for the awkward way it handles how critical pieces of information are shared with the other players.\n\nSo, although I found The Crew somewhat compelling, I also disliked playing it and would rather play a non cooperative trick taking game, which at least allows any kind of conversation.",
    "timestamp": 1632088800
  },
  {
    "username": "GameCat3",
    "rating": 2.0,
    "comment": "This very well may be a good game for you -- IF you enjoy cooperative and trick-taking games. For me, I find my mind simply unable to grasp \"trick-taking\", and so this game is not for me and I will likely never play it again. And that is okay. It is also ok if you love it and play it everyday -- but Gamecat can not recommend.",
    "timestamp": 1630188000
  },
  {
    "username": "Egwood",
    "rating": 2.0,
    "comment": "I've never liked trick-taking games (apart from Windows 95 hearts), so I was excited for a co-op game. It just didn't work for us, hated it.\n\nFortunately found Claim to be the trick-taking game in my collection.",
    "timestamp": 1629842400
  },
  {
    "username": "rayzg",
    "rating": 2.0,
    "comment": "I don't care for co-ops to begin with. I've also had too many unpleasant gaming experiences with this game in particular.\n\nYou really need players with equal experience with trick-taking games for this to work. And for casual card gamers who do play trick-taking games, they might get really confused with this game as the objectives are very different -- it's about a specific player winning a certain card in a trick, not winning a majority of tricks.\n\nSo be very cautious about introducing this game to those new to trick-taking.",
    "timestamp": 1627164000
  },
  {
    "username": "bgfreek",
    "rating": 2.0,
    "comment": "Maybe I just don't like trick-taking games, but I found this pretty boring. You get your tasks, and you try to carry them out. The space theme is gimmicky and unrelated to the game. They could have used lots of other themes just as successfully.",
    "timestamp": 1623276000
  },
  {
    "username": "Scifi66",
    "rating": 3.0,
    "comment": "Deep Sea is better with the mission cards, speeds up play.\n\nCo-op trick taking filler - it's mostly fun. Players with zero knowledge of trick taking will need 2 rounds but then good to go. Best at 4, can be somewhat frustrating if you are a Bridge player or knowledgeable trick taker.",
    "timestamp": 1761256800
  },
  {
    "username": "darkk_",
    "rating": 3.0,
    "comment": "A cooperative trick-taking game with missions. 50 different missions keeps the game from being a normal deck of cards. Players cannot coordinate mission strategy, which is good upgrade from The Mind.\n\nCaptivating ❌\nEngaging ✅\nReplayability ❌\nRules ✅\nQuality ❌",
    "timestamp": 1760392800
  },
  {
    "username": "Kantai",
    "rating": 3.0,
    "comment": "An interesting trick taking game, but the play is a little awkward and the objectives a bit rough",
    "timestamp": 1754776800
  },
  {
    "username": "Ginewra",
    "rating": 3.0,
    "comment": "bga",
    "timestamp": 1752703200
  },
  {
    "username": "Gumstep",
    "rating": 3.0,
    "comment": "Gave to Gypsum Library",
    "timestamp": 1749333600
  },
  {
    "username": "Captain Quirk",
    "rating": 3.0,
    "comment": "Boring.",
    "timestamp": 1743976800
  },
  {
    "username": "btasam",
    "rating": 3.0,
    "comment": "Do you remember when Michael Caine was explaining the three parts of a magic trick?\n\nThe first part is called \"The Pledge.\" The game shows you something ordinary: a deck of cards, a trick taking mechanic. The second act is called \"The Turn.\" The game takes this ordinary something and makes it do something extraordinary: cooperative trick taking with no talking. Now you're looking for the secret to why two Crew games can crack the Top 40 and no other cooperative trick taking games can land inside the Top 1000... but you won't find it, because of course you're not really looking. You don't really want to know. You want to be fooled. But you wouldn't clap yet. Because making something unique isn't enough; you have to play it again. That's why every game has a third act, the hardest part, the part we call \"The Prestige\".\n\nAll that to say, the Crew has no prestige. Don't get me wrong, I'm glad that we are discovering trick taking games, but \"the eventful journey through space extends over 50 exciting missions\" is a flat-out lie. This latrine filled disappointment of a game uses arbitrary missions as a framework for reason. We need to complete 5 tasks because the mission tells us we need to fix five sensors on a satellite orbiting Uranus. Hail Hydra!\n\nWhen the emotional investment is this low, the difference between winning and losing feels miniscule. It's almost as if the realization of no theme is more discouraging than simply playing a game with no theme. Witnessing the letdown on so many faces parallels that of a bad magic trick.",
    "timestamp": 1739833200
  },
  {
    "username": "Pandori3",
    "rating": 3.0,
    "comment": "When I play cooperative games, I generally don't like them very much because the fun is largely dependent on the players I play with.",
    "timestamp": 1739660400
  },
  {
    "username": "niper007",
    "rating": 3.0,
    "comment": "I played quite some missions in this game and thought they were all very easy and was left with the thought \"Is this it, when does the game become interesting?\"\n\nOne of the most disappointing games I played after I heard so many people love it. I guess the real problem is not the game itself but that it is just not for me and that is ok.",
    "timestamp": 1732662000
  },
  {
    "username": "Ideology",
    "rating": 3.0,
    "comment": "One play is one session, multiple missions",
    "timestamp": 1730242800
  },
  {
    "username": "quietcorn",
    "rating": 3.0,
    "comment": "This is a trick taking co-op game where a certain number of goal cards are drawn with the idea that players need to make their way through the set of cards making sure that the right people get the right cards in their score piles. This is probably about as interesting as a trick taking game is going to get, but the whole central idea of trick taking games is not something I'm interested in or have ever enjoyed.",
    "timestamp": 1718920800
  },
  {
    "username": "LucentRivers",
    "rating": 3.0,
    "comment": "Too thinky for a warm-up game, and too shallow for a main game. I may have a bias in that I'd never have a group of people willing to play the whole campaign, so for me, after purchasing this game I quickly realized it has no place on my shelf. I most often play with just my partner. It does have a 2-player variant, but we just found it tedious and boring, and slow-paced. I prefer Fox in the Forest: Duet for 2-player co-op trick taking, and its regular version for 2-player competitive trick-taking.\n\nEach mission gives you \"tasks\" to fulfill, and let me tell you, they feel like tasks, not like a game. They're also very arbitrary since there's a random element involved. The theme and gameplay do not go well together. Aside from the text in the booklet, it never feels like gameplay has anything to do with space exploration. It could've been anything, slaying monsters, exploring, collecting something. The theme is very tacked-on and I don't like that in a game, and the story was boring. I think the \"story\" just baits completionists into a game that would never make it to the table again otherwise.\n\nSince you can't communicate cards, it's just kind of a communication killer, making everyone feel a bit in \"quiet mode\" and too focused to carry on conversation. I hate it when a game kills the possibility of socializing.",
    "timestamp": 1712700000
  },
  {
    "username": "dimas1972",
    "rating": 3.0,
    "comment": "buñuelo",
    "timestamp": 1704409200
  },
  {
    "username": "jenntleh",
    "rating": 3.0,
    "comment": "Well not a solo so at the bottom of my score range. I do try to play multi-handed to get the feel of the type of games. Not sure it works with this one as its interaction is the game. I don't click with it still when I tried. Probable will leave my collection.",
    "timestamp": 1704150000
  },
  {
    "username": "Fundle",
    "rating": 3.0,
    "comment": "coop sucks",
    "timestamp": 1702508400
  },
  {
    "username": "Technarius",
    "rating": 3.0,
    "comment": "Not fun at all. Just my opinion, because this game unites 2 mechanics, which i dont like: Trick-taking and Cooperative Gamplay.",
    "timestamp": 1683237600
  },
  {
    "username": "BallenFam",
    "rating": 3.0,
    "comment": "Played first time at Treehouse in Sheffield, UK. We did not play it and will probably not since the 2-player variant is just a \"dummy\" player. Rules seem to be more complicated than the game needs to be.",
    "timestamp": 1679094000
  },
  {
    "username": "Milorad31",
    "rating": 3.0,
    "comment": "Not as good and engaging as i hoped it to be the game became too repetitive for me. Cant see myself willingly playing again.",
    "timestamp": 1678834800
  },
  {
    "username": "cesartustro",
    "rating": 3.0,
    "comment": "No es mi rollo. Bazas cooperativo.",
    "timestamp": 1677452400
  },
  {
    "username": "TGorson",
    "rating": 3.0,
    "comment": "Nicht mein Spiel",
    "timestamp": 1677193200
  },
  {
    "username": "jackycola",
    "rating": 4.0,
    "comment": "Werde stichspiele niemals mögen und das hier hat es nicht ändern können.",
    "timestamp": 1759874400
  },
  {
    "username": "alialkabah",
    "rating": 4.0,
    "comment": "not a big fan of trick taking I guess.. this is the biggest everyone has their own taste in games, I'v seen nothing but praise for this being in a lot of peoples top 10 or top 20, for me its least 10. I tried to like it but I couldn't and that's fine",
    "timestamp": 1757973600
  },
  {
    "username": "brnineworms",
    "rating": 4.0,
    "comment": "Maybe trick-taking games are not for me",
    "timestamp": 1755813600
  },
  {
    "username": "sykano",
    "rating": 4.0,
    "comment": "cooperative trick-taking game with lots of different missions\noverrated\ndoes nothing for me\nThere are so many trick-taking games, I really don't need a cooperatove one.\n\nabstract, no theme there\nmediocre components\n\ncan go frustratingly wrong\n\nreminds me a bit of \"Hanabi\"\nI hate coop games where you are not allowed to communicate.",
    "timestamp": 1753567200
  },
  {
    "username": "Hinmatt",
    "rating": 4.0,
    "comment": "The concept of a cooperative trick-taking game with limited communication is quite interesting.\nUnfortunately in every failed attempt to win a level there is one person who makes the decisive mistake. If it's the same person several times, it can be quite demoralizing for that person and can make them feel stupid. And the other players can get annoyed towards that person or even blame them for having to play the level again.\nI don't like that dynamic.\nThe concept itself is interesting for a short while, but in my opinion competitive trick-taking is just much more fun.",
    "timestamp": 1750111200
  },
  {
    "username": "ggruetze",
    "rating": 4.0,
    "comment": "Not a fan of trick taking, limited communication or most co-ops so this was a solid miss on all fronts",
    "timestamp": 1747951200
  },
  {
    "username": "brw12",
    "rating": 4.0,
    "comment": "1 play\n\nOne of the greatest failures of theme ever. The space theme simply has nothing at all, in any possible way, to do with the gameplay. \"You have to repair your control antenna!\" No, there's just an annoying, completely arbitrary requirement that Alice win a pink Four before Bob wins a green Three. \"Now you receive long-awaited email from your loved ones!\" No, now there's yet another requirement that Alice win a yellow Five before Bob wins a blue Two.\n\nI'm sure there's some way that this eventually becomes fun -- it's hard, we're all in it together, etc. -- but man, does it take a lot of energy and concentration for something that feels fairly pointless.\n\nI also have to mention the instructions, which are perhaps the very worst instructions I've ever encountered in a board game.\n\nThe rules of The Crew are very simple, and could be explained in literally two minutes, and probably 200 words. But the written instructions are almost spectacularly over-complicated. They're some of the worst I've ever seen, and which made it take me a long time to try out the game with others, and made me lose sight of some details during our first play.\n\nThe instructions manage to take something straightforward like trick-taking with trumps and stretch out the explanation for what you can and can't play to what seems like an epic poem, including at least one sentence that is just factually incorrect and contradicts what they say elsewhere, and at least one crucial detail (how the order of players' picks of task cards is determined) left out.\n\nThey should just say:\n1. the first card establishes the trick's suit\n2. you have to play a card in that suit if you can\n3. the highest card in the trick's suit takes it...\n4. ...UNLESS a rocket card was played, in which case the trick is taken by the highest rocket card\n\nI promise you, my explanation above uses 1/5 of the words that the formal instructions use, and is 300% clearer.\n\nIt's so hard to prepare to play this for the first time. There's no \"here's what to set up for your first part\" instructions. There's no graphic depicting the table for your first setup. Really just awful design.\n\nThe actual gameplay has some intriguing tactics, but starts to feel repetitive quickly. My group -- which, really, is precisely the sort of casual-but-game-for-anything group this sort of game is geared towards -- started with enthusiasm, but after four missions, lost interest. No one was eager to return to the game.\n\nLightness (1)-Heaviness (5) rating: 3",
    "timestamp": 1746223200
  },
  {
    "username": "thorbot",
    "rating": 4.0,
    "comment": "We played this a few times and it just doesn't really interest me. Need to play more to rate, but there are just so many other better games it's hard to sacrifice the time for this one when I know there's one I'd rather play more.",
    "timestamp": 1743631200
  },
  {
    "username": "Beastly_Venturer",
    "rating": 4.0,
    "comment": "I'd rather go play Wizard or another trick taking game than this. Not terrible but not great either.",
    "timestamp": 1741820400
  },
  {
    "username": "lewix",
    "rating": 4.0,
    "comment": "정통 트릭테이킹 룰 기반 협력게임",
    "timestamp": 1740438000
  },
  {
    "username": "DaytonBoardGamer",
    "rating": 4.0,
    "comment": "Not a huge fan of games that limit communication. Coop games should encourage collaboration, not restrict it.",
    "timestamp": 1734649200
  },
  {
    "username": "Yokiboy",
    "rating": 4.0,
    "comment": "I love cooperative games, and have a few trick-takers that I adore, but this just didn't click for me. My chronic pain was a bit high while trying to learn the game, but I love conversation during play so much that this just isn't my type of cooperative challenge. Pass.",
    "timestamp": 1728338400
  },
  {
    "username": "jpborquez",
    "rating": 4.0,
    "comment": "Pas mom genre du tout...",
    "timestamp": 1727388000
  },
  {
    "username": "godlikephysique",
    "rating": 4.0,
    "comment": "Not a fan of trick taking so this does nothing for me. It's decent for a few rounds but I could never play through the whole book.",
    "timestamp": 1723500000
  },
  {
    "username": "wildpack",
    "rating": 3.5,
    "comment": "Innovative, interesting, challenging.\nHowever, not \"fun\".",
    "timestamp": 1720389600
  },
  {
    "username": "gizmobj",
    "rating": 4.0,
    "comment": "Definitely need to try to get this to the table more often. Nothing against the game but there are so many more that I would rather play. Packs small which is why it is still in my collection.",
    "timestamp": 1715724000
  },
  {
    "username": "Harry Tuttle",
    "rating": 4.0,
    "comment": "Did not give this much of a chance, but the lengthy mission structure led me to believe that there was a real theme and story here and there definitely is not. Co-op game with very limited communication allowed. There are clearly lots of people having fun with this game, but I'm not sure how they're doing it.",
    "timestamp": 1711062000
  },
  {
    "username": "Sammmy70",
    "rating": 4.0,
    "comment": "Did not work at all with my game group.",
    "timestamp": 1707606000
  },
  {
    "username": "ChaoticDumbass",
    "rating": 4.0,
    "comment": "I can think of many trick taking games I'd rather play. After two plays I see no reason to waste any more of my life on this game.",
    "timestamp": 1707433200
  },
  {
    "username": "exhaustedbagel",
    "rating": 4.0,
    "comment": "Meh. Not for me. I get bored but my friends will definitely make me play again because they love it.",
    "timestamp": 1703286000
  },
  {
    "username": "agrenon0418",
    "rating": 5.0,
    "comment": "Limited communication co-op games are not my thing. I played a 3 player game of this and we played through the first 10 missions but we were cheating the whole time. We couldn't help ourselves from saying things that implied what we had and shouting out things like \"whoever has the red 8 play it now\". I feel like I would've hated the game if we couldn't do that. So the game we played was fine, but I definitely don't like the game the way it's supposed to be played.",
    "timestamp": 1762692480
  },
  {
    "username": "Wario1962",
    "rating": 5.0,
    "comment": "018",
    "timestamp": 1762124400
  },
  {
    "username": "royalty_valens",
    "rating": 5.0,
    "comment": "My first trick-taker. While the co-op mechanic is interesting it turns out when I hang out with my friends I do want to talk to them. The campaign is ok.",
    "timestamp": 1761343200
  },
  {
    "username": "RougeHemlock",
    "rating": 5.0,
    "comment": "Neat take on trick-taking.",
    "timestamp": 1760824800
  },
  {
    "username": "abaloo",
    "rating": 5.0,
    "comment": "A essayer",
    "timestamp": 1760479200
  },
  {
    "username": "Medikus81",
    "rating": 5.0,
    "comment": "Gyermekkoromban Snapszeren nőttem fel. Az ütős - vivős játékok az ereimben csordogálnak. Sajnos a Crew nem ilyen. Tetszik az ötlet, hogy csináljunk egy ütős - vivős kooperatív játékot........., de számomra a történet is és a játékmenet is vontatott.",
    "timestamp": 1760479200
  },
  {
    "username": "Sidekicken",
    "rating": 5.0,
    "comment": "I can see that people like this. Myself, I'm not a big fan of the combination trick taking, low communication and co-op.",
    "timestamp": 1760220000
  },
  {
    "username": "emoprzemoc",
    "rating": 5.0,
    "comment": "We've started 3 campaigns, twice with the same group, and we haven't finished a single one of them. Well, the third one was with our guest whom we don't see very often, but the other two? We started playing - once on BGA and the second time with a physical copy - and got through about 10 missions and we never could 'force' him to play with us again and it basically made me skip any trick-taking hits in the recent years, especially the cooperative ones.\n\nSure, we could just try the 2-player variant and at least beat the campaign once, but it didn't look as fun. Finally, we sold the game, after a few years, and unless we form a new gaming group with people more eager to play cooperative trick taking games, I doubt I'll try any of 'The Crew' games or LotR-themed trick taking games.\n\nBut I had fun during those few plays we had and I DID want some more, so I can't give it any 'bad' rating (1-4).\n\n+ combines classic trick-taking mechanic with a cooperative rules\n+ campaign-based game; there's even some narrative, but of course, the game is really abstract\n+ nice artwork - cards have bits of a bigger picture\n+ has a 2-player variant (haven't tried it though)\n+ haven't played anything like this before\n\n- not everyone likes coop games. not everyone likes trick taking. and this game is both! and i didn't have a group to play it with :c",
    "timestamp": 1759960800
  },
  {
    "username": "anwarkin",
    "rating": 5.0,
    "comment": "Si todos los jugadores están con ganas de jugarlo, será super divertido. Pero tiene ese aspecto que necesitas que todos estén igualmente involucrados, si no se hace pesado para esas personas que sólo querían pasar un rato.",
    "timestamp": 1759874400
  },
  {
    "username": "AndBobsYourUncle",
    "rating": 5.0,
    "comment": "Meh. Would try again, but think I prefer competetive trick taking games.",
    "timestamp": 1757628000
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 5.0,
    "comment": "The Crew is not a game that I want a steady diet of. I can enjoy a hand or two. But my co-players often seem content to spend more time on this game than I care to.\n\nI will never ask for it at a game night, when I have a chance for a full board game experience.\n\nNon-essential",
    "timestamp": 1757541600
  },
  {
    "username": "MergatroidSkittle",
    "rating": 5.0,
    "comment": "I think it could be fun if played with a good group of people who are really into trick taking games. But my biggest problem with the game is the theme feels totally disconnected from the mechanics. The game could just as easily be played with playing cards, and I'm guessing that's how it was developed. All of the story is in the description for each mission.",
    "timestamp": 1755900000
  },
  {
    "username": "softhook",
    "rating": 5.0,
    "comment": "V difficult",
    "timestamp": 1754690400
  },
  {
    "username": "rodigeun",
    "rating": 5.0,
    "comment": "Purged - Not Good",
    "timestamp": 1754431200
  },
  {
    "username": "syphon",
    "rating": 5.0,
    "comment": "The game is...decent and plays quickly. It's not the most thematic game in the world, though.\n\nAs a result, my enthusiasm for playing is often a bit muted.\n\nUpdate: Lowered from a 6 to a 5, due to the game coming with a free lecture about how I have played 'wrong'.",
    "timestamp": 1751752800
  },
  {
    "username": "Jiefu",
    "rating": 5.0,
    "comment": "Good as long as players have experience in trick taking games like hearts.",
    "timestamp": 1751148000
  },
  {
    "username": "nicksquatch",
    "rating": 5.0,
    "comment": "This was solid, but after playing the second edition it fell pretty fast. Too hard to set simple challenges, can't really be played unless you use the scenarios.",
    "timestamp": 1750370400
  },
  {
    "username": "fibscher",
    "rating": 5.0,
    "comment": "-Stichspiele kann ich nicht gut spielen",
    "timestamp": 1747605600
  },
  {
    "username": "silenceisgolder",
    "rating": 5.0,
    "comment": "This is a filler game that doesn't really work with non-hobbyists as a filler, so while I appreciate the design and I think it could be really fun, I've never really managed to have a great experience with it.",
    "timestamp": 1747087200
  },
  {
    "username": "Vexpac",
    "rating": 5.0,
    "comment": "My rating is based on the ease of play with my group. We love trick-taking games, so this seemed like a no-brainer. Unfortunately, it didn't float with my group.",
    "timestamp": 1746309600
  },
  {
    "username": "cs4b4",
    "rating": 5.0,
    "comment": "2-5 player",
    "timestamp": 1746050400
  },
  {
    "username": "gamer2024",
    "rating": 5.0,
    "comment": "really enjoyed this BUT you REALLY need to have the right people playing who pay attention and I would cap it at 3 people. And willing to take your time if on higher complexity missions.",
    "timestamp": 1744495200
  },
  {
    "username": "Torkrin",
    "rating": 5.0,
    "comment": "Best:4 players",
    "timestamp": 1744322400
  },
  {
    "username": "cubntin",
    "rating": 5.0,
    "comment": "2-5 Players",
    "timestamp": 1743289200
  },
  {
    "username": "mawilson4",
    "rating": 5.0,
    "comment": "A pretty straightforward cooperative trick-taking game, which to me feels like the same thing over and over, just with progressively more difficult parameters by which you win and a hilariously pasted-on narrative. I dislike how much this feels like a logic problem to me, which puts it in the realm of puzzle games instead of those card games with light psychological elements and more organic, situational hand management considerations.\n\nIt's also susceptible to alpha-gamer nonsense in the form of second guessing decisions after the fact. I frequently don't feel like I'm playing the game, but rather guessing at what someone else wants me to play (and will be upset if I don't play). That's a group dynamic issue, but games that allow for such dynamics are not exempt from blame.\n\nIt lacks The Mind's visceral immediacy, the elegance of more standard trick-taking games, and the variance of the most innovative trick-taking games. I'm in the minority in my indifference to it, and wish its many fans years of fun with the game. But across a few different play groups, I haven't been able to glean any real fun out of it.\n\nReview:\nhttps://bumblingthroughdungeons.com/the-crew-the-quest-for-p...",
    "timestamp": 1743116400
  },
  {
    "username": "dosxtres",
    "rating": 5.0,
    "comment": "4",
    "timestamp": 1741906800
  },
  {
    "username": "dukane",
    "rating": 5.0,
    "comment": "I think this game is a great game for those that like trick taking games, and it does limited communication in cooperative games well. I totally see why so many rate this, and it's deep sea version highly.\n\nHowever for me, I'm not a fan of 'play until you're done' games because I tend to want to be done with this after 20 minutes and I know several people who could play this well beyond that.\n\nAlso, if you play with seasoned veterans of trick taking games, you may find yourself upsetting the table for playing \"wrong\" and that can be off putting. I'd rather play poorly and lose than play poorly and screw up everyone else's game (one of many reasons I'm not a huge fan of co-ops).",
    "timestamp": 1741129200
  },
  {
    "username": "Krysis2552",
    "rating": 5.0,
    "comment": "xx",
    "timestamp": 1739487600
  },
  {
    "username": "meerkatmobgames",
    "rating": 5.0,
    "comment": "This made me realize I don't really like trick taking games.",
    "timestamp": 1738105200
  },
  {
    "username": "Alerosa3",
    "rating": 5.0,
    "comment": "Última partida: 2022-07\nEn el Club Dante",
    "timestamp": 1736204400
  },
  {
    "username": "Omnisapien",
    "rating": 5.0,
    "comment": "Co-op Conquer",
    "timestamp": 1735858800
  },
  {
    "username": "BoardGamingCouple",
    "rating": 5.0,
    "comment": "5/5\n\nStandard tricks, but co-op. Nothing revolutionary or ground breaking. Tricks is a classic for a reason. 100+ plays.",
    "timestamp": 1735254000
  },
  {
    "username": "chanyuekong",
    "rating": 5.0,
    "comment": "2-5",
    "timestamp": 1734908400
  },
  {
    "username": "ubRtstcl",
    "rating": 5.0,
    "comment": "Generally too difficult of a strategic concept for casual gamers to grasp.",
    "timestamp": 1734044400
  },
  {
    "username": "feimeitan",
    "rating": 5.0,
    "comment": "Didn't like the lack of communication aspect",
    "timestamp": 1733785200
  },
  {
    "username": "littlechandler",
    "rating": 5.0,
    "comment": "I generally like limited communication games. I hate predictive bids in trick takers, which unfortunately the tasks in this game are.",
    "timestamp": 1733698800
  },
  {
    "username": "porcine",
    "rating": 5.0,
    "comment": "Ötletes és okos kártyajáték, egyszerű szabályokkal. Sajnos engem nem fogott meg.",
    "timestamp": 1733612400
  },
  {
    "username": "Bal_505",
    "rating": 5.0,
    "comment": "Short, simple, challenging, and relatively fun. If I'm going to play a theme-less cardgame I prefer the aesthetics of a standard deck of cards though",
    "timestamp": 1733353200
  },
  {
    "username": "abdbla",
    "rating": 5.0,
    "comment": "just get crew: deep sea mission instead",
    "timestamp": 1732834800
  },
  {
    "username": "JeepMomma",
    "rating": 5.0,
    "comment": "Co-op trick taking, Will didn't care for it",
    "timestamp": 1731366000
  },
  {
    "username": "Suleckja",
    "rating": 6.0,
    "comment": "We played some of the easier missions first but I just don't like limited communication games. Willing to try a few more missions to actually showcase what the game has to offer but limited communication is definitely not my go-to mechanic, but I love trick takers.",
    "timestamp": 1762124400
  },
  {
    "username": "Freydey",
    "rating": 6.0,
    "comment": "2-5 Coop",
    "timestamp": 1761343200
  },
  {
    "username": "hiimjosh",
    "rating": 6.0,
    "comment": "The Crew is a game I was really excited for, and while I like it a lot it is entirely overhyped. The feeling I get here is very different from other trick takers. This feels closer to Hanabi or The Mind to me than it does say Tichu. The trick taking itself is quite basic and many of the challenges are variations on the same idea. Our group has played this a lot this month - easily over 50 rounds - going late into the evenings. I like the challenge of the game, but I will say that the cooperative part really, really grates on me. Seeing someone blow their communication on something useless or do silly things with the trick over and over gets pretty annoying. That said, I am enjoying the game - just maybe not quite as much as I expected to\n\nEDIT: I both really like The Crew and really hate The Crew. I like the feeling of shared success. I like the hard trick-taking choices. I don't like how repetitive it is. I don't like groaning when someone misplays. I don't like trying to get someone to take a particular card constantly.",
    "timestamp": 1760479200
  },
  {
    "username": "Reflex777",
    "rating": 6.0,
    "comment": "Sold",
    "timestamp": 1759615200
  },
  {
    "username": "abicsab",
    "rating": 6.0,
    "comment": "Our group isn’t quite ready for it. It hasn’t really clicked with us yet.",
    "timestamp": 1758405600
  },
  {
    "username": "seb_48784",
    "rating": 6.0,
    "comment": "After 1 games IRL: This is a preliminary rating — I need to play it again. I remember feeling unsure about what I was supposed to do and just relieved that I didn’t mess anything up, so we ended up winning. It’s too early to give a final verdict.",
    "timestamp": 1757196000
  },
  {
    "username": "TaijiJohn",
    "rating": 5.5,
    "comment": "I am not into trick-taking games, but this one is pretty good.\n\nI reduced my rating from 7.0 to 6.5 as I am not enjoying the higher level requirements as much.\n\nUpdate 20250905: Reduced from 6.5 to 5.5. I don't really enjoy this game anymore.",
    "timestamp": 1757109600
  },
  {
    "username": "CptSteveRogers",
    "rating": 6.4,
    "comment": "2-5 / :3-5: / [4]",
    "timestamp": 1757109600
  },
  {
    "username": "buderix80",
    "rating": 6.0,
    "comment": "Nice game.",
    "timestamp": 1756332000
  },
  {
    "username": "Lord Heisemberg",
    "rating": 6.0,
    "comment": "Un vrai challenge pour chaque partie de ce jeu coopératif original. Je n’avais pas été emballé par la première partie, mais les suivantes ont été très sympa !\nMalheureusement, ne pas y jouer pendant un certain temps nous a fait perdre de l'intérêt pour ce jeu et il n'est plus jamais ressorti au bout de quelques semaines.\nÀ noter que le suivi des parties en fonction de ses groupes de joueurs est également géré via l’app gratuite « Crew Counter ».",
    "timestamp": 1755986400
  },
  {
    "username": "juasri",
    "rating": 6.0,
    "comment": "//",
    "timestamp": 1755554400
  },
  {
    "username": "Head_Meatball",
    "rating": 6.0,
    "comment": "Really good way to teach people strategy for card games like Oh Hell, Hearts, and Bridge.",
    "timestamp": 1755295200
  },
  {
    "username": "dougfoolery",
    "rating": 6.0,
    "comment": "Cooperative trick taking game with creative missions that get progressively more challenging. Trying to math out the best card to play without communication is an addictive group puzzle. Docking points for game not working at the advertised 2 (too fiddly) and 5 (some missions don't work) player count.",
    "timestamp": 1754604000
  },
  {
    "username": "patateman44",
    "rating": 6.0,
    "comment": "Coop c'est mort",
    "timestamp": 1751580000
  },
  {
    "username": "Odegaard1999",
    "rating": 6.0,
    "comment": "4 Players\nPlay Time: 20 Min",
    "timestamp": 1751493600
  },
  {
    "username": "selvalabelva",
    "rating": 6.0,
    "comment": "Brainburn         Longevity    \nLuck impact       Rules/Setup  \nInteraction       Involvement  \n\nAftertaste           Enthusiasm   \n\n Played at 3 player count only\n As a co-op, experience is group dependant",
    "timestamp": 1751320800
  },
  {
    "username": "philosophus",
    "rating": 6.0,
    "comment": "I know that many love this card game but it just hasn't clicked for us, yet...",
    "timestamp": 1750629600
  },
  {
    "username": "Zenfire",
    "rating": 6.0,
    "comment": "The Crew is a fine cooperative trick-taking game. The only problem is that dont like cooperative games, especially the ones which just you an abstract score at the end (like Hanabi).\n\nPlayed: 5+ times.",
    "timestamp": 1749592800
  },
  {
    "username": "chaniatreides",
    "rating": 6.0,
    "comment": "2022?",
    "timestamp": 1749420000
  },
  {
    "username": "ripley3",
    "rating": 6.0,
    "comment": "Partite : 1",
    "timestamp": 1747864800
  },
  {
    "username": "Weltmacht",
    "rating": 6.0,
    "comment": "I'm illiterate when it comes to trick taking games and therefore dislike this game. Tried it twice. Should give it another try sometime",
    "timestamp": 1747864800
  },
  {
    "username": "DoctorPhil",
    "rating": 6.2,
    "comment": "Criteria (out of 5)\nRules complexity 5\nPlaytime/complexity ratio 4\nStrategic avenues 2\nMechanism strength 3\nThematic integration 1\nVariability 4\nReplayability 4\nFun factor 3\nSolo mode\nPlayer interaction 3\nElement of mastery 2\n\nOverall 6.2 out of 10",
    "timestamp": 1747778400
  },
  {
    "username": "Jmccue",
    "rating": 6.0,
    "comment": "An innovative take on trick-taking, making it cooperative and giving structure (which can be played as a campaign of sorts) in the form of the missions and tasks. If I didn't already enjoy trick-taking I don't believe this game would change that. I thought for all the hype that this game would offer more. It is a solid game, plays VERY quickly and is easy to teach.\n\n*Update: I don't find myself coming back to this game. I find the reason I like trick-taking is the tension between you and your opponent(s), which this game lacks as a co-op. It doesn't feel fulfilling to play trying to meet certain criteria rather than beat your opponent. There are games like Skull King, Fox in the Forest, and Wizard, along with the classic deck of cards trick-takers that do it better.\n\nI sold the game then found another copy at a thrift store and picked it up again. Hanging onto it for now but I don't seem to be reaching for it.",
    "timestamp": 1747173600
  },
  {
    "username": "elputovader",
    "rating": 6.0,
    "comment": "N-JUL-20\nCUARTO DE JUEGOS\n#OPBO May25",
    "timestamp": 1747173600
  },
  {
    "username": "maritn",
    "rating": 6.0,
    "comment": "Abstract trick taking game, but coop.",
    "timestamp": 1746568800
  },
  {
    "username": "Terry Egan",
    "rating": 6.0,
    "comment": "There are any number of trick-taking games that offer clever twists and turns on the long-established genre, but few that radically alter the concept enough to be called revolutionary. The Crew, in its various forms, breathes new life into the trick-taking arena by introducing a cooperative element. The theme is razor thin, but the cooperative play is innovative and engaging. Kudos for originality, balance and at least a strong attempt at an engaging theme. UPDATE: The goals in Quest for Planet Nine start to get very same-y very quickly, while the goals in later versions of the game are more varied, interesting and challenging. At this point, I would rather own those.",
    "timestamp": 1746309600
  },
  {
    "username": "sharkker",
    "rating": 6.0,
    "comment": "Family game",
    "timestamp": 1745532000
  },
  {
    "username": "eddy_sterckx",
    "rating": 6.0,
    "comment": "2023-02-11 : First play. Whist with both more information and more variety through the challenges. As a whist veteran of many years I liked it better than I thought I would. All the hard-core whist stuff is still largely applicable and can be used in this game.\n2024-04-13 : Finished all 50 scenarios, took us 71 plays, which I think isn't bad.\n2025-04-18 : 86 logged plays and for me it's played out a bit",
    "timestamp": 1745013600
  },
  {
    "username": "McLudo2811",
    "rating": 6.0,
    "comment": "2019",
    "timestamp": 1744927200
  },
  {
    "username": "darkfinale",
    "rating": 6.0,
    "comment": "Co-op trick taking. Best played with friends. Not my type of game so would not actively suggest.",
    "timestamp": 1744495200
  },
  {
    "username": "larryjrice",
    "rating": 6.0,
    "comment": "FIRST IMPRESSION:\n\nThis appears to be a solid entry as a cooperative game using the trick taking mechanic. Trying to use your lone communication opportunity at the right time and place is key. Four player is likely the sweet spot.",
    "timestamp": 1743976800
  },
  {
    "username": "Doctor_Fistro",
    "rating": 6.0,
    "comment": "Posible Salida",
    "timestamp": 1743890400
  },
  {
    "username": "ourmove123",
    "rating": 6.0,
    "comment": "Great numerical trick-taking game.\n\nA lot of varied challenges, but may feel like boring gameplay for some.\n\nBest with experienced groups.",
    "timestamp": 1743804000
  },
  {
    "username": "Avid_Equinox",
    "rating": 6.0,
    "comment": "Co-op trick taking game with limited communication\n\n+ Different objectives and hands each time means it has good replayability\n+ Decision of what to communicate is important/satisfying when it works\n+/- massively different round difficulty based on how many objectives are same colour",
    "timestamp": 1743804000
  },
  {
    "username": "AhabXXX",
    "rating": 6.0,
    "comment": "Nice challenge with the right group.",
    "timestamp": 1743202800
  },
  {
    "username": "nadigames93",
    "rating": 6.0,
    "comment": "To sell in UK.",
    "timestamp": 1742770800
  },
  {
    "username": "NamaTiti",
    "rating": 6.0,
    "comment": "This game is very fun if you enjoy this kind of trick taking game, or very boring if you don’t like that kind of stuff.\n\nI think that this game has great potential, but I often found myself bored out of my mind every time I played this. I feel if it had a different theme, like Star Wars, lord of the rings, or something else and incorporated the theme into the game, and improved on the mechanics of the game it could be decent. But most people enjoy a simple game and this game does that very well. It is easy to teach and fun for first timers, I just don’t enjoy it.",
    "timestamp": 1741388400
  },
  {
    "username": "jonsbane",
    "rating": 6.0,
    "comment": "It's weird to me how many times people just haven't clicked with this game and it either hasn't been able to get to the table or has flopped when it does.\n\nFor me this game has now been fired and replaced by the Fellowship of the Ring trick taking game, as I can't see myself needing to have two games that occupy the same niche.",
    "timestamp": 1739746800
  },
  {
    "username": "Der Gwiedo",
    "rating": 6.0,
    "comment": "Trick taking game played cooperatively. The player who gets the rocket of value 4 is the captain. The taking of tricks always revolve around this captain in one way or another. The crew (all players) receive an assignment, determined by 1) the booklet 2) card(s) turned of a specific colour and a specific value. There are 50 assignments in total in the booklet. The challenge is to get as far as possible.\nPlayers can only communicate once per assignment by showing 1 card and indicating whether this card is the highest of that colour in the player's hand, the lowest or the only one.",
    "timestamp": 1739660400
  },
  {
    "username": "JAC578",
    "rating": 6.0,
    "comment": "Fun trick taking game. Ran its course.",
    "timestamp": 1738450800
  },
  {
    "username": "CarsonChandler",
    "rating": 7.0,
    "comment": "Group dependent, but really satisfying with the right one.",
    "timestamp": 1762652040
  },
  {
    "username": "Neryx",
    "rating": 7.0,
    "comment": "Casual",
    "timestamp": 1761951600
  },
  {
    "username": "Song_of_Shield_Lady",
    "rating": 7.0,
    "comment": "挺不错的合作打牌吃墩游戏，在不交流的情况下，要准确的透露自己的卡牌信息，以吃到应该吃的牌完成任务。剧本做得挺好，不同关友小机制。",
    "timestamp": 1761778800
  },
  {
    "username": "Ychor",
    "rating": 7.0,
    "comment": "2023: 6 plays\n2022: 9 plays\n===\nGame of the Month (May, 2023), 6 plays\nGame of the Month (April, 2022), 6 plays",
    "timestamp": 1761692400
  },
  {
    "username": "Tina_T",
    "rating": 7.0,
    "comment": "2025.\nOnly playing 2player version, which makes it easier to complete missions, but we are having a lot of fun!\nThe theme and the little story throughout the campaign are nice, but i dont see the connection to the mechanics of the game.\n\n Bought in Essen 2025 Auction.",
    "timestamp": 1761606000
  },
  {
    "username": "JeffCC",
    "rating": 6.8,
    "comment": "[D]",
    "timestamp": 1761256800
  },
  {
    "username": "uwe_sauerland",
    "rating": 7.0,
    "comment": "Kenner SdJ 2020",
    "timestamp": 1760047200
  },
  {
    "username": "Jordan_Varbev",
    "rating": 7.0,
    "comment": "TT, Co-op\n#3*, #4**, #5",
    "timestamp": 1759269600
  },
  {
    "username": "Analytical",
    "rating": 7.0,
    "comment": "[Adult - Weight:Family - Players:2-5 (Best:4) - Size:Mini - Time:Short]\n\n*Trick-Taking / Cooperative*",
    "timestamp": 1759269600
  },
  {
    "username": "dtmoney75",
    "rating": 7.0,
    "comment": "3 Plays\n\nPlayed at: 2 & 3",
    "timestamp": 1759269600
  },
  {
    "username": "atlas64gaming",
    "rating": 7.2,
    "comment": "AUGUST 2024: 82ND\nFEBRUARY 2024: 75TH\nAUGUST 2023: 72ND",
    "timestamp": 1759096800
  },
  {
    "username": "EdCherie",
    "rating": 7.0,
    "comment": "Hard to bring it back to the table, but still enjoying it.",
    "timestamp": 1759096800
  },
  {
    "username": "mortandade",
    "rating": 7.0,
    "comment": "DE",
    "timestamp": 1758751200
  },
  {
    "username": "puCrepeaP",
    "rating": 7.0,
    "comment": "Fun trick playing, not quite as good as the sequal",
    "timestamp": 1758751200
  },
  {
    "username": "Dice Mage",
    "rating": 7.0,
    "comment": "5",
    "timestamp": 1758578400
  },
  {
    "username": "keekohmygod",
    "rating": 7.0,
    "comment": "Mayday USA\nMayday Mini Euro",
    "timestamp": 1758492000
  },
  {
    "username": "Nathaniellllll",
    "rating": 6.7,
    "comment": "Good cooperative game. Feels a bit like a throwaway game after you've played through all the missions.",
    "timestamp": 1758405600
  },
  {
    "username": "Justnow86",
    "rating": 7.0,
    "comment": "Nice trick-taking game with the twist of having to work together to overcome more and more difficult situations ins space. There are just better trick-taking games out there...",
    "timestamp": 1758146400
  },
  {
    "username": "peterlevi",
    "rating": 7.0,
    "comment": "4 (3)\n(open)\n\nGood, but it feels similar to, and I like that one better, to the classic trick-taking card game \"Oh, Hell\". I am also not a huge fan of the cooperative nature of The Crew.",
    "timestamp": 1758060000
  },
  {
    "username": "Ione29",
    "rating": 7.0,
    "comment": "Best trick-taking game I have personally played. The coordination you have to have with your friends only elevates it even further.",
    "timestamp": 1757973600
  },
  {
    "username": "nicol800",
    "rating": 7.8,
    "comment": "About as good as I expected, but didn't wow me. I'd have been more impressed if I hadn't already played a fair amount of Sail, so it didn't feel as unique as it was when it came out.",
    "timestamp": 1762626960
  },
  {
    "username": "Papinek",
    "rating": 7.7,
    "comment": "Brontoscharfes Spiel ! Extrem gute Unterhaltung mit einer exzellenten Spielidee ! Amüsant und trotzdem leichter Brainburner !",
    "timestamp": 1762597020
  },
  {
    "username": "madtimmy",
    "rating": 7.8,
    "comment": "sleeved",
    "timestamp": 1762383600
  },
  {
    "username": "emptycupoz",
    "rating": 8.0,
    "comment": "For sale: $25. Cooperative trick taking is unique and a lot of fun",
    "timestamp": 1762124400
  },
  {
    "username": "Quadenstein",
    "rating": 8.1,
    "comment": "Inexpensive. Easy rules. Big fun to play. 50 cooperative rounds. Best at 4 players. Per round 5-10 minutes.",
    "timestamp": 1762038000
  },
  {
    "username": "ismailegler",
    "rating": 7.7,
    "comment": "very exciting even it has no connection between the theme and gameplay. Sometimes it satisfies a lot sometimes not. Depends on your day and your chance with the cards",
    "timestamp": 1761692400
  },
  {
    "username": "opti_mind",
    "rating": 8.0,
    "comment": "Awesome 1st iteration of the The Crew Games with the trick-taking card mechanic taken to the next level, that was slightly overshadowed by it's better brother called The Crew: Misssion Deep Sea",
    "timestamp": 1761606000
  },
  {
    "username": "ElQuappo",
    "rating": 8.0,
    "comment": "zu verkaufen (?)",
    "timestamp": 1761429600
  },
  {
    "username": "JammyDodger3579",
    "rating": 8.0,
    "comment": "Fabulous coop experience. To be played with people of similar skills, lest experienced players get frustrated at beginner mistakes",
    "timestamp": 1761429600
  },
  {
    "username": "OralBob",
    "rating": 8.0,
    "comment": "Sleeves, Insert, Unplayed",
    "timestamp": 1761256800
  },
  {
    "username": "runningmax70",
    "rating": 8.0,
    "comment": "Molto bello in 3, in 4 difficile, in 5 impossibile",
    "timestamp": 1761170400
  },
  {
    "username": "PBandJellyfish",
    "rating": 7.6,
    "comment": "@TX",
    "timestamp": 1760824800
  },
  {
    "username": "Iraperkins82",
    "rating": 8.2,
    "comment": "Love this game! At the same time it is missing something that would make it a 10...\n\nIn this case I have the next version (mission deep sea) - which is clearly better.",
    "timestamp": 1760824800
  },
  {
    "username": "whitecatplays",
    "rating": 8.0,
    "comment": "Comfort coop.",
    "timestamp": 1760738400
  },
  {
    "username": "DarthHenryAllen",
    "rating": 7.5,
    "comment": "A cooperative Trick Taking game that's novel and entertaining.\n\nHouse records:\n69 (Courtney/Henry/Belle 1st play through)",
    "timestamp": 1760565600
  },
  {
    "username": "mexo",
    "rating": 7.5,
    "comment": "inkl. 1st Player Mini",
    "timestamp": 1760392800
  },
  {
    "username": "rigacu",
    "rating": 8.0,
    "comment": "Preko",
    "timestamp": 1760220000
  },
  {
    "username": "WadeB1977",
    "rating": 8.2,
    "comment": "Co-op game that uses Spades to weave together different missions that get tougher and tougher as players work through the 50 missions. With the simple trick-taking mechanism, this game manages to present a compelling socially interactive experience that few games capture.",
    "timestamp": 1759788000
  },
  {
    "username": "Salty4",
    "rating": 8.0,
    "comment": "my new favorite trick taking game; the communication limit is the genius of this game",
    "timestamp": 1759183200
  },
  {
    "username": "gianlucadario87",
    "rating": 7.5,
    "comment": "B_D3",
    "timestamp": 1758751200
  },
  {
    "username": "Icekommander",
    "rating": 9.3,
    "comment": "The cooperative trick-taking game I've always wanted. Played this a bunch with multiple different groups and enjoyed it every time.",
    "timestamp": 1762666020
  },
  {
    "username": "smriera",
    "rating": 8.5,
    "comment": "Genial juego de bazas cooperativo.",
    "timestamp": 1762470000
  },
  {
    "username": "Koennen",
    "rating": 9.0,
    "comment": "Fun with the right group. Could serve as an introduction to trick-taking, but works better with prior experience.",
    "timestamp": 1762383600
  },
  {
    "username": "Cleb044",
    "rating": 9.0,
    "comment": "If you like trick taking games, you will like the Crew. I do not know what else to say. This is probably the best trick taking game I have played in a long while, and the customizable missions makes this game easy to adjust for the difficulty that the group is ready to handle.\n\nIt does play pretty well at 3 and at 5. 4 is definitely best though.",
    "timestamp": 1762210800
  },
  {
    "username": "Rubia",
    "rating": 9.0,
    "comment": "Includes all the Geekup bits also.",
    "timestamp": 1762124400
  },
  {
    "username": "Trevor03",
    "rating": 9.0,
    "comment": "Exactly the kind of co-op game I love. Each of you has full control over your contribution to the game, and yet the stress remains low because even if you screw up and play poorly, you can quickly just restart the mission.\n\nAn absolute beauty.",
    "timestamp": 1762038000
  },
  {
    "username": "zepa77",
    "rating": 9.3,
    "comment": "Also UK Edition 2020",
    "timestamp": 1761778800
  },
  {
    "username": "ditterio",
    "rating": 9.0,
    "comment": "Solo: https://boardgamegeek.com/filepage/190857/solo-running\n\nExtra missions:\n\nFirst mission:\nDistribute the playing cards and, in turn starting with the commander, announce how many tricks the crew member on your left will take. The mission is accomplished when all tricks have been played and all announcements were correct.\n\nSecond mission:\nDraw 4 tasks. All 4 tasks must be fulfilled in 4 consecutive tricks.\n\nThird Mission:\nPlace the blue 1, 2, 3 and 4 task cards in the middle of the table instead of drawing 4 random cards from the task deck.\n\nExtra missions: https://boardgamegeek.com/filepage/303589/oktoberfest-inspir...\n\nStill the best tricktaking game",
    "timestamp": 1761692400
  },
  {
    "username": "DrMinzlauer",
    "rating": 9.0,
    "comment": "Super schönes und spaßiges Koop-Spiel. Wir hatten jede Menge Freude damit. Macht allerdings nur richtig spaß, wenn man immer mit den gleichen Leuten spielt, sonst muss man immer neu beginnen.",
    "timestamp": 1761606000
  },
  {
    "username": "Chris_boardgames",
    "rating": 8.5,
    "comment": "# HM",
    "timestamp": 1761429600
  },
  {
    "username": "Verena20",
    "rating": 9.0,
    "comment": "Michel, Jonas, Verena 20.-25.12.24 Episode 1-16\n\n18.1.25\nMichel, Jonas, Verena Mission Nr 18 geschafft\n\n25.1.25 Michel, Jonas, Verena Mission 22 geschafft\n\n27.1.25 michel, Jonas, Verena Mission 25 geschafft, 1× P\n\n2.2.25 Michel, Jonas, Verena Mission 28 geschafft\n\n4.2. Mission 29 geschafft\n\n9.2.25 Mission 30 nach Anläufen nicht geschafft\n\n10.2. Mission 30 geschafft\n16.2. Mission 32 geschafft\n\n24.2. Mission 33 geschafft\n\n21.3. Mission 34 nach 2 Anläufen geschafft\n21.3. Mission 35 nach 3 Anläufen (und 1 Notsingnal) geschafft\n25.3.25 Mission 36 nach 2 Anläufen gewonnen\n5.6.25 Mission 37 beim 3. Anlauf geschafft\n10.6.25 Mission 38 mit 3. Anläufen geschafft\n21.7.25 Mission 39 geschafft (direkt in 10 Min)\n18.8.25 Mission 40 beim 7. Versuch nicht geschafft\n\n25.10.25 Mission 40 beim 9. Versuch geschafft",
    "timestamp": 1761343200
  },
  {
    "username": "hockeyjones",
    "rating": 8.6,
    "comment": "91\n\nPlayed in 2021",
    "timestamp": 1761170400
  },
  {
    "username": "pmmeyer",
    "rating": 9.0,
    "comment": "Very fun trick-taking game. Worth the hype.\n\nNote: Successfully completed a three-player campaign run through.",
    "timestamp": 1760652000
  },
  {
    "username": "strongbadia",
    "rating": 9.0,
    "comment": "X",
    "timestamp": 1760565600
  },
  {
    "username": "WaffleBoi",
    "rating": 9.0,
    "comment": "This is a great co-op game. The variability is fantastic. The need to think as a team without being able to communicate gives this game a unique feel.\n\nThe game is good when played casually. But what really makes it shine is getting a consistent crew together and trying to play through all 50 missions. The missions are super fun and challenging to work through. The story text isn't much but it's mildly entertaining to have some semblance of a storyline as you progress through missions.\n\nCurrent progress: 30/50",
    "timestamp": 1759788000
  },
  {
    "username": "totalhenshin",
    "rating": 9.0,
    "comment": "I really can't think of another co-operative game that gives this Vulcan mind meld with you and the other players. Maybe this is what bridge partners have been having for years and are scoffing at nerds like me finally catching on, but I feel like this game DOES give that on-ramp of just a smooth journey to understanding your fellow players, through the limited communication and also a clearly defined goal. The MDS version is superior just due to the greater variability in mission structure and goals, but both are great. The (second) best trick-taking game I've ever played.",
    "timestamp": 1759701600
  },
  {
    "username": "fabulani",
    "rating": 9.0,
    "comment": "Played once so far, and already see the vision: really really fun and exciting game. Can't wait to get more missions done!",
    "timestamp": 1759615200
  },
  {
    "username": "GrandPseudonym",
    "rating": 9.0,
    "comment": "Best with 3\nBest with 4\nGood with 5\n~15 Minutes\nLightweight\nCo-op\nAbstract\nStrategy\nPuzzle",
    "timestamp": 1759183200
  },
  {
    "username": "redisher",
    "rating": 9.0,
    "comment": "I didn't expect to get so much pleasure from the game.",
    "timestamp": 1759183200
  },
  {
    "username": "Derianhorgen",
    "rating": 9.0,
    "comment": "SpielboxRating 6-10, av. 8,57",
    "timestamp": 1758924000
  },
  {
    "username": "krushton",
    "rating": 10.0,
    "comment": "Great coop game. I really enjoy the trick-taking puzzles. Good filler game too.",
    "timestamp": 1761865200
  },
  {
    "username": "mimiwo",
    "rating": 10.0,
    "comment": "Sometimes easy, sometimes painful, co-op trick taking is great!",
    "timestamp": 1761865200
  },
  {
    "username": "Alaena",
    "rating": 10.0,
    "comment": "Never leaving my collection  David agrees)",
    "timestamp": 1761429600
  },
  {
    "username": "Tabletoptreks",
    "rating": 10.0,
    "comment": "The Crew: The Quest for Planet Nine ?✨\n\nWe’d heard about The Crew for a little while before finally picking up a copy, and wow — it lives up to the hype! Bethany grew up playing competitive trick-taking games like Rook, but this was our first time diving into cooperative trick-taking, and it’s been such a blast playing this with our friends. Instead of trying to outscore each other, you’re working together to accomplish missions that get progressively harder.\n\nThe limited communication is what makes the game so tense and fun. You can’t openly talk about your hands — instead, you place a single communication token on one card each round as a clue. From there, it’s almost like you have to read your teammates’ minds. Every success feels like a little victory, and every failure just makes you want to reshuffle and try again.\n\nThe progressively more challenging missions are loosely tied to a space exploration story. Combined with classic trick-taking, the missions make the game feel endlessly fresh — no two rounds ever feel the same.\n\nThe design and art are straightforward and functional, letting the gameplay shine (with nice accessibility touches like symbols for players who are color blind). If you already know trick-taking, you’ll pick it up right away. If not, there’s a bit of a learning curve, but it’s absolutely worth the effort.\n\nFor us, The Crew is a must-play for anyone who already enjoys trick-taking & a great info into the genre, if not — a very creative game that turns trick-taking which is so often competition & makes it into true cooperation.\n\n⸻\n\nGame Info\n• Publisher: Kosmos\n• Year: 2019\n• Designer: Thomas Sing\n• Artist: Marco Ambruster\n\n⸻\nOur Tabletop Treks Rating\n• Replayability: 10/10\n• Engagement: 10/10\n• Design & Artwork: 8.5/10\n• Theme & Immersion: 8.5/10\n• Flow & Accessibility: 8.5/10\n\nOverall: 9.5",
    "timestamp": 1760133600
  },
  {
    "username": "Zouzou825",
    "rating": 9.5,
    "comment": "A good game to play with family. But this kind of game needs the team to be the same, otherwise it's pretty challenging to continue the adventure. Small stories for each stage are pretty fun.",
    "timestamp": 1759788000
  },
  {
    "username": "Angelaksg",
    "rating": 10.0,
    "comment": "Con poco mucho, es increíblemente estratégico y desafiante... Un verdadero juego cooperativo. Maravilloso ?",
    "timestamp": 1759701600
  },
  {
    "username": "hylian_marq",
    "rating": 10.0,
    "comment": "The campaign is so good. Locked in and beat it with my wife and Brother in Law",
    "timestamp": 1759615200
  },
  {
    "username": "ValerianofEternia",
    "rating": 10.0,
    "comment": "Pros :\n• A cooperative trick-taking game with limited communication, rare and innovative\n• Elegant puzzle with simple yet deep rules\n• Mission-based campaign with increasing difficulty\n\nCons :\n• Not intuitive for players unfamiliar with trick-taking mechanics\n• When a mission fails due to one player’s mistake, it can create frustration, especially if errors are repeated\n• May feel less fun or a bit flat compared to competitive trick-taking games that have tension between opponents\n\nConclusion :\nMy favorite trick-taking game that works really well with the right group of players.",
    "timestamp": 1759356000
  },
  {
    "username": "ferg0013",
    "rating": 10.0,
    "comment": "Great trick taking game. My favorite actually.",
    "timestamp": 1758664800
  },
  {
    "username": "Bobvatar",
    "rating": 10.0,
    "comment": "Excellent quick little trick taking game - has a great \"one more turn\" feel. Everyone I've played it with has enjoyed it. My friends and I have played over a hundred rounds now and we always have a good time playing this - even when we end up in losing streaks.",
    "timestamp": 1758060000
  },
  {
    "username": "kwhite1",
    "rating": 10.0,
    "comment": "P",
    "timestamp": 1758060000
  },
  {
    "username": "Parapon",
    "rating": 10.0,
    "comment": "Never get tired of it",
    "timestamp": 1756332000
  },
  {
    "username": "lock4815162342",
    "rating": 10.0,
    "comment": "replaceable by https://boardgamegeek.com/boardgame/324856/crew-mission-deep...\ncol_bring\nIn Photo Box\nCooperative",
    "timestamp": 1755813600
  },
  {
    "username": "greyboop",
    "rating": 10.0,
    "comment": "Played to completion",
    "timestamp": 1755813600
  },
  {
    "username": "Rowe166",
    "rating": 10.0,
    "comment": "Small/Card Game",
    "timestamp": 1755640800
  },
  {
    "username": "pfctsqr",
    "rating": 10.0,
    "comment": "I typically don’t like cooperative games, but this is frickin brilliant.",
    "timestamp": 1755208800
  },
  {
    "username": "jernejs",
    "rating": 10.0,
    "comment": "Super fun and quick coop card game you just don't want to stop playing.",
    "timestamp": 1755208800
  },
  {
    "username": "enowit",
    "rating": 9.5,
    "comment": "It plays like spades, but it's cooperative (what?!). 50 different missions to get through, so you play with your group until you get tired. Then next time you play, just pick up where you left off, or play again from the beginning. It never gets old!",
    "timestamp": 1755208800
  },
  {
    "username": "NateStraight",
    "rating": 10.0,
    "comment": "The Crew is the greatest hobby game of all time, full stop. It is just beautiful to experience how its one weird trick (the task deck) combined with a seemingly endless set of possibilities for how tasks might be drafted or a hand played creates an infinite universe of cardplay puzzles of incredible depth. It demands so much of its players, but delivers in kind.\n\nMy god it’s full of stars!! ⭐️",
    "timestamp": 1754863200
  },
  {
    "username": "ViciousVicVicious",
    "rating": 10.0,
    "comment": "5 players",
    "timestamp": 1754604000
  }
]