[
  {
    "username": "sweetol",
    "rating": 1.0,
    "comment": "unthematic, not good as pg, not complete and fast as tm. unfan/unnecessary changes. cults still suck",
    "timestamp": 1762210800
  },
  {
    "username": "Scifi66",
    "rating": 1.0,
    "comment": "Firstly AoI is a decent enough Euro as it is a reworking of the Terra Mystica engine adding innovations+books...but 3.5 hours for a 4p game is just too long for the decision space it offers. For that time commitment check out 18xx higher interaction and a richer decision space. But my main gripe is comparing AoI to its progenitor TM-> it's twice as long, much looser, more expensive and really superfluous as it's a similar experience. Why does there need to be yet another version (v1.5?) of what is essentially the same game?",
    "timestamp": 1761951600
  },
  {
    "username": "Orbesteanu",
    "rating": 1.0,
    "comment": "Rarely you experience such a garbage of a game. Questioning a lot of design choices, not fun at all during gameplay, and terrible unbalance tiles and benefits…awful! I wouldn t recommend this even to my closest enemies.",
    "timestamp": 1761778800
  },
  {
    "username": "cotomel",
    "rating": 1.0,
    "comment": "Uninspired rehash for the 3rd (4th) time. Same criticisms as TM-GP-etc.",
    "timestamp": 1732748400
  },
  {
    "username": "spencyrrh",
    "rating": 2.0,
    "comment": "2023-12-15 (1 play at 3 at Ludoquist): Not as heavy as I expected, but pretty long, and pretty heavy. The problem is less that any one thing is hard to understand, and more that there's just far too much shit on the table. Too many types of building; too many resources; too many tracks; too many trays of goodies to choose; and all affected by the modern Euro iconography nonsense virus.\n\nHowever, a much, much bigger problem quickly becomes clear. The core action selection (with a smaller side in resource conversion) puzzle is one of the better of its type, I think. But why on Earth would I choose to spend three hours after the teach with my head down, trying to figure out the most optimal combination of action choices? What the hell are we all doing in this hobby? If you find yourself taking this box off the shelf, go home and play a solo video game.\n\nYou'll be seeing my back if you put Terra Mystica or Gaia Project in front of me. I think I'd like to try Terra Nova, but to be honest, maybe I shouldn't. Maybe it's just not for me. It's fundamentally not a game you play with others. I played this with two friendly strangers, and I couldn't get them to talk to me. We had to focus on this the whole time.\n\nI would probably have still rated the game higher, but I just couldn't see it all. The play area is much too large, and much too saturated with the same colours. The iconography does what it can, but good luck parsing that.\n\nI came second, mostly after following a strategy clearly left for me by generous and more experienced players. I think it was fairly competitive during the game, but the winner ended up with a fair lead. I wasn't very motivated to do well. I just wanted to try and make a decision and take my turn without spending ten minutes thinking about it.\n\nI like the big wooden bits. Nice knobbly chess pieces.",
    "timestamp": 1744322400
  },
  {
    "username": "captainamazo",
    "rating": 2.0,
    "comment": "This game took 5 hours, which is about right. This is not a game style I like and will not ever play again (hence the rating). It is more for people that like advanced grocery shopping.",
    "timestamp": 1741474800
  },
  {
    "username": "Florik",
    "rating": 2.0,
    "comment": "After 8 games played, I am giving up trying to like this mess of a game. The whole TM family is, sadly, not for me.",
    "timestamp": 1727733600
  },
  {
    "username": "Iron_Salamander",
    "rating": 2.0,
    "comment": "Terra Mystica again basically. More tiresome mechanisms combined into a sum that is far less than its parts. Another bland 'game' that is less engaging than work, and less satisfying. Avoid.",
    "timestamp": 1699225200
  },
  {
    "username": "Baron Frog",
    "rating": 3.0,
    "comment": "Takes Terra Mystica and makes it worse... for me, at least. The mechanics of this one completely elude me and I'm left with a confused feeling all the way through the game, which I cannot wait to finish.",
    "timestamp": 1742079600
  },
  {
    "username": "drgnmstr44",
    "rating": 3.0,
    "comment": "played this three times and only liked it once. if players don't build near you, you loose out on a lot of what the game has to offer. it's definitely not balanced at 5 players, where were to two times I hated playing. It feels like a game I should like but absolutely won't play this with 5",
    "timestamp": 1738018800
  },
  {
    "username": "brownsound",
    "rating": 3.0,
    "comment": "Zawiodłem się. Gaia Project znacznie lepiej robi wszystkie te rzeczy.",
    "timestamp": 1721512800
  },
  {
    "username": "Duke_Muell",
    "rating": 3.0,
    "comment": "Another Terra Mystica......i will play with friends at the end i play it alone.",
    "timestamp": 1721512800
  },
  {
    "username": "Vismeep",
    "rating": 4.0,
    "comment": "More of the same isn’t necessarily better – and isn’t per definition innovative.\n\nBack in 2012, Terra Mystica was quite innovative about terraforming, asymmetric factions, resource management in a rondel and upgrading of buildings. This mix made it unique in the world of boardgames. Moreover, while the rules and mechanics were quite simple, the way to victory could be a tense, sometimes even mean interactive competition. Kudos to the creative inventors!\n\nIn fact, Terra Mystica has exactly the mechanics it needs to function – nothing artificially plastered upon; in addition, it strikes a good balance between interaction and solitaire gameplay; and finally, thanks to the simple rules and mechanics, downtime is not really an issue. An elegant game. Above all, as it comes with 14 asymmetric factions, it takes at least 14 plays to know all the facets of the game – and most probably a couple more to master each of the factions. Again, kudos to the creative inventors!\n\nAnd then comes Age of Innovation. Praised by many as the better Terra Mystica. But why exactly?\n\nAge of Innovation comes with asymmetric faction abilities mixed randomly (“for unlimited replayability” – as if the average Terra Mystica player had outplayed the 14 factions and would master all of them blindly), with unique abilities to add to your faction during the game, with the additional resource “books” and with some other new stuff. The brilliant core mechanics of the game stay the same, but unfortunately, due to the new stuff, the focus on these gets lost, and thereby also the elegance of the game.\n\nIn result, what Age of Innovation does is what so many games and expansions nowadays do: Plaster artificial, unneeded mechanics on top of a game that would be perfectly working without them, thereby making the game a multiplayer-solitaire experience that prioritizes individual rewards over tough interaction and is heavy on downtime if just one player at the table is a bit of a thinker.\n\nThe reason for this is the same why a once-successful Netflix series is prolonged eternally, or why successful music bands of the last century are still touring at the age of 80: Money! Cash! Dinero! In the boardgame-industry, this is where creative game designers become creative game promoters, and nerdy gamers become nerdy customers, driven by the fear of missing out. Do I want that? You know the answer.\n\nSo my simple conclusion on Age of Innovation: It's just a damn shame that the brilliant minds behind Terra Mystica spent their energy and creativity trying to find a way to make more money from their successful game instead of trying to give us gamers a new and unique masterpiece. I will continue to play Terra Mystica. Age of Innovation is banned.",
    "timestamp": 1745272800
  },
  {
    "username": "ljtrigirl",
    "rating": 4.0,
    "comment": "No more versions of Terra Mystica, please",
    "timestamp": 1744322400
  },
  {
    "username": "mrbunkers",
    "rating": 4.0,
    "comment": "Terra Mystica redux. Prime Euro goodness of this is your thing.",
    "timestamp": 1741302000
  },
  {
    "username": "Ginewra",
    "rating": 4.3,
    "comment": "bga",
    "timestamp": 1739660400
  },
  {
    "username": "Trigonomical",
    "rating": 5.0,
    "comment": "1 play down. Hour to learn the rules and 2.5 hours to play the game at 3 player. Great game, a lot to learn and improve my next play. Bought at Gen Con 2023.\nUpdate - No one was every interested to play again, with our memories having a muted impression of this game. Civolution is a much better investment for this type of game.",
    "timestamp": 1760911200
  },
  {
    "username": "paulastoria",
    "rating": 5.0,
    "comment": "Boring",
    "timestamp": 1755468000
  },
  {
    "username": "yoyomanhihi",
    "rating": 4.5,
    "comment": "Not a fan of this series of games, as this is a pure euro with not many interaction and no come back mechanics. A beginner won't even have the illusion that he can beat an experienced player, even by chance. To me, this is a bit anticlimatic.\n\nHowever, if you love the other games of the series, you will love this one.",
    "timestamp": 1754172000
  },
  {
    "username": "iplaybgnaked",
    "rating": 5.0,
    "comment": "It's just Terra Mystica with a significant amount of setup variability, which is a great improvement as it presents different challenges and more to think about with each play while still retaining what made the original so great. Despite being a great game (minor balance issues with the factions and tech aside) I've cooled on it simply because this style of euro no longer excites me.",
    "timestamp": 1753740000
  },
  {
    "username": "chibiowl",
    "rating": 4.5,
    "comment": "I prefer Gaia Project",
    "timestamp": 1752962400
  },
  {
    "username": "joanmoreno",
    "rating": 5.0,
    "comment": "Un Terra Mystica más bonito pero excesivo y aún más redundante en sus mecánicas. Ahora hay que hacer un draft tedioso antes de comenzar para elegir terreno, facción y habiilidad, por no hablar del desequilibrio bestial de algunas losetas y facciones, algo difícil de entender a estas alturas cuando pasó algo parecido con Terra Mystica.\n\nEl tema de las innovaciones, libros, etc. al final es más de lo mismo solo que ahora ocupa el doble en la mesa y hay que explicar más cosas. Casi que prefiero el original.",
    "timestamp": 1747000800
  },
  {
    "username": "Apos",
    "rating": 5.0,
    "comment": "Latest game of a Terra Mystica series is heavy modern euro - with all its flaws.\nIt's over-complicated system of cumbersome actions, actions that do very little. Game feels like \"just another\" engine building game that delivers points in all possible ways to a player.\nI miss interesting factions from original TM w/ expansion, I miss deep gameplay of Project Gaia, I miss snappy, fast and most interesting gameplay of them all - Clans of Caledonia, which imho is the best of \"the series\".\nAoI is the longest, and least fun of them all. In 2012 TM was innovative and interesting game with its little flaws. AoI took step back I feel - added complexity, to do less as a player. Average point salad, without theme. Abstract and dry.",
    "timestamp": 1746655200
  },
  {
    "username": "jmsmith2434",
    "rating": 5.0,
    "comment": "Includes Folded Space insert",
    "timestamp": 1743544800
  },
  {
    "username": "5mokus",
    "rating": 6.0,
    "comment": "Good, modular but annoyingly abstract optimalization problem.\nDon't have the willingness to reach a level where I want to interact with others.",
    "timestamp": 1761256800
  },
  {
    "username": "goray",
    "rating": 6.0,
    "comment": "太复杂",
    "timestamp": 1756159200
  },
  {
    "username": "Forgeforgeforge",
    "rating": 5.5,
    "comment": "marginally but not transformatively better than terra mystica. Certainly better than gaia. Solves none of the problems. Points are uninspiring. It is however very cool to get in on the ground floor of discovering what combos are broken in this game. Terra mystica is essentially unplayable given how worked to death the strategies are.\n\nIt seems like nothing interesting ever happens in these games? This is an n-dimensional puzzle where very rarely are you and an opponent competing in the same direction at the same time, before veering off into decision spaces that are just not visible to each other at all.\n\nJust like TM the draft is the most impactful and meaningful decision you'll make all game, and then its mostly very mechanical proving who drafted the best hours ago. If you get out drafted early and have clearly lost, and there's one slow player at the table, this might the most miserable gaming experience you have had all year.\n\nI understand the appeal, but once a game has 'build orders' it gets far enough away from what I like about board games that I'd rather just be playing broodwar on pc.\n\nAt least they got rid of earth 1 favor tile.\n\nIt's bonkers to me that the illusionist's shipped in the state that they did, and that there was even a second of resistance from the developers that they're broken.\n\nStill fun. I recommend the 4-3-2-1 snake draft.\n\nAt the end of the game you look at the ~10 point spread and ask \"what did they do right, what did they do wrong?\" and the answer is just gone.\n\n\n\nEdit: the priest steps bonus strategy has proven to be risky broken and needs fixing immediately for the game to be worth playing",
    "timestamp": 1754517600
  },
  {
    "username": "Motirius",
    "rating": 6.0,
    "comment": "J'ai un sentiment bizarre avec AOI. D'un coté je lui reconnais énormément de profondeur et un bon équilibrage mais d'un autre coté ça me fait vraiment penser à un jeu à la Karadoc. Enormément de règles, énormément de matériel, énormément de spécificités. En gros, c'est vraiment un jeu pour gros joueurs et il faut prévoir large niveau temps pour peu qu'on joue avec des gens qui hésitent beaucoup (et là pour le coup ils ont matière à hésiter).",
    "timestamp": 1752098400
  },
  {
    "username": "rastrom",
    "rating": 6.0,
    "comment": "Demasiado parecido a Terra Mystica como para que valga la pena. Y de los 3 me quedo con Gaia Project",
    "timestamp": 1751320800
  },
  {
    "username": "TForever",
    "rating": 6.0,
    "comment": "Middle weight game. Area control, engine building, and a little resource management.",
    "timestamp": 1744408800
  },
  {
    "username": "theBruceGuild",
    "rating": 6.0,
    "comment": "it's a sandbox Terra Mystica.",
    "timestamp": 1743890400
  },
  {
    "username": "Olafslomp",
    "rating": 6.0,
    "comment": "Owned by Jeroen. Too long",
    "timestamp": 1743202800
  },
  {
    "username": "Xyt4n",
    "rating": 7.3,
    "comment": "+ + good map building elements\n+ ruthless\n- boring building art style\n- - very unthematic play\n- - factions are boring gameplay wise\n- - the science board is a boring game element\n- - I dont like the typical eurostyle restricted interaction in form of take-away and indirect influence\n- - - to much point salad gaming for me",
    "timestamp": 1762653480
  },
  {
    "username": "yroeht",
    "rating": 7.0,
    "comment": "Much prettier than Terra Mystica (I really like the player colors), offers more variability. The draft seems like it makes the game fair. Introduces books, which can be spent to build \"neutral\" buildings.",
    "timestamp": 1762470000
  },
  {
    "username": "verandi",
    "rating": 7.0,
    "comment": "The standout feature of AoI vis-a-vis its predecessors is the drafting of the component parts of your faction during setup. That's a super cool mechanic, but otherwise AoI is basically Terra Mystica with some added chrome that arguably distracts from the essence of what made the original great. Truth be told I've barely played Terra Mystica in the 6 years since Gaia Project came out. Gaia is one of my favorite games of all time and - as much as I'm enjoying playing AoI right now - Gaia is still better IMO. The complexity of Gaia is just more interesting, whether it be the technology tracks, power token management, the modular map, etc.",
    "timestamp": 1761170400
  },
  {
    "username": "Galgor",
    "rating": 7.0,
    "comment": "I don’t know why I would play this if I can play Terra Mystica instead…",
    "timestamp": 1759528800
  },
  {
    "username": "skraem",
    "rating": 8.0,
    "comment": "I assumed I would not like this. Thought Gaia was a 7. But its a solud 8+ for me with the variability in powers. Might get samey after a bit, but enjoying it a lot now.",
    "timestamp": 1762038000
  },
  {
    "username": "ygram",
    "rating": 8.0,
    "comment": "Twp plays: Really good euro game. Most of the time turns are fast but at some point there was too much downtime with 5 players. One thing that took extra time was when players would need to chose from a large set of reward tiles, I guess that will go away with more plays.\n\nI think this is better than Gaia Project that I have tried once, but can't really put my finger on why.",
    "timestamp": 1760911200
  },
  {
    "username": "DeKerstman",
    "rating": 8.0,
    "comment": "1-5 players (best with 4), 90-180 minutes. Heavy (4.26).\n\nSuccessor to Terra Mystica and Gaia Project.\n\nRating based on 1 solo play. There is a lot going on, curious if we can get this one to the table, especially at 2+.",
    "timestamp": 1760824800
  },
  {
    "username": "NateClark",
    "rating": 8.0,
    "comment": "More going on than in Terra Mystica but this does not make it better. Still a solid design but the TM experience is purer.",
    "timestamp": 1759442400
  },
  {
    "username": "danielwahlen",
    "rating": 9.0,
    "comment": "Thanks Ghost Turkey 2025!",
    "timestamp": 1762640400
  },
  {
    "username": "Papinek",
    "rating": 8.5,
    "comment": "Eine wirklich mehr als gelungene erweiterte Terra Mystica Version ! Eine exzellente Soloversion ! Das Spiel funktioniert mit jeder Spieleranzahl ! Das Artwork ist hervorragend ! Die Qualität des Haupttableaus lässt leider etwas zu Wünschen übrig ! Der Spielspaß ist immens !\n1000 Dank Helge ! Ein Meisterwerk !!",
    "timestamp": 1762598400
  },
  {
    "username": "ditterio",
    "rating": 9.0,
    "comment": "Solo Helper: https://brdgm.me/age-of-innovation/#/",
    "timestamp": 1762297200
  },
  {
    "username": "Noboe",
    "rating": 9.0,
    "comment": "It is a great game. Although I do not like the new design very much, especially innovation display looking like a prototype, the gameplay is very good and it is a better version of Terra Mystica for me.",
    "timestamp": 1761865200
  },
  {
    "username": "Jesenberg",
    "rating": 9.5,
    "comment": "B",
    "timestamp": 1762383600
  },
  {
    "username": "dnykim87",
    "rating": 10.0,
    "comment": "The only heavy game that I owned. It is not as hard as I thought but it definitely takes time to finish and play well.",
    "timestamp": 1762124400
  },
  {
    "username": "fisha",
    "rating": 10.0,
    "comment": "Jó volt. Kicsit féltem tőle, hogy egy értelmetlen újrakiadás, de már az hatalmas javítás, hogy van külön térkép a különböző játékosszámokra, illetve, hogy a fajok nem kötődnek a területekhez, így külön draftolhatóak.\nA könyves rész, kicsit felesleges bonyolítás szerintem, de érdekes plusz aspektust visz a játékba. TM-et nem ismerőknek tanítani azért horror lehet. Már az alapjáték se volt könnyű falat, de itt azért még legalább 2 új dolgot el kell magyarázni.",
    "timestamp": 1761606000
  },
  {
    "username": "AdalynIris",
    "rating": 9.7,
    "comment": "This is a eurogame that combines the typical resource management with area control, and this is a very interesting combination, that makes it different to so many euros based on exchanging cubes.\nIt is a great game to play with people and solo.\nIt is unavoidable to compare this game with Terra Mystica (TM) and Gaia Project (GP), which are basically the same game, but with some variations. I have not played TM. Compared to GP I have not decided which one I like best. Regarding mechanisms I think GP is better because of the technology track that allows to be improving. Technology track in AoI is boring, just going up to get points at the end. However, GP is so dark and ugly that I get bored before starting just looking at the board. Also AoI is more tied and area control is more important, whereas in GP technology building is the key point.\nIn summary, I fully recommend to include one of these three games in your collection.",
    "timestamp": 1760306400
  }
]