[
  {
    "username": "QueenOfBread",
    "rating": 1.0,
    "comment": "CGE supports transphobia.",
    "timestamp": 1761778800
  },
  {
    "username": "Scifi66",
    "rating": 1.0,
    "comment": "Space themed Eurostew. On the plus side the central part of the board rotates but that interesting spatial puzzle is diminished by chaotic play.\nxMany random elements (cards/rotation/alien discovery) make early game resource tightness a crapshoot.\n-Gigantic point salad, icon buffet, table hog, rich get richer.\nxHeads down MPS, mostly just take other's VP spots.\nxxLong and dragged due to player AP. 3p was over 3 hours excluding setup, teach, teardown. Don't play with 4p! Two of five turns I passed early and sat around meditating, waiting for other players to pull their thumbs out. In the wrong group this could be a stamina marathon.",
    "timestamp": 1759960800
  },
  {
    "username": "NosWazzen",
    "rating": 1.0,
    "comment": "Sigh. Euroslop",
    "timestamp": 1751234400
  },
  {
    "username": "SSEBASSmg",
    "rating": 1.0,
    "comment": "In a game of multiple \"combos\".\nYou can't combo your mission cards when you trigger them because you can only choose one of them.\nIs ridiculous!!",
    "timestamp": 1747432800
  },
  {
    "username": "Normal_st",
    "rating": 1.0,
    "comment": "1\\10 for balance. Game is fine, but it's point salad at it's worst... Downtime with 4 players is huge, game is... just \"counting the victory points\", not fun.\n\nOh, and game is very random, very chaotic, it's just... a mess. Again, it's not inherently bad, just a mess.",
    "timestamp": 1738796400
  },
  {
    "username": "Oddipus",
    "rating": 1.0,
    "comment": "Games get bad scores because they are too simple, well, then I feel like giving this 'popular' game a 1 because it's too much of everything. I hope nobody ever asks me to play this. Zero interest.",
    "timestamp": 1735945200
  },
  {
    "username": "cotomel",
    "rating": 1.0,
    "comment": "Yearly checklist euroslop.",
    "timestamp": 1732834800
  },
  {
    "username": "BeansForTrade",
    "rating": 2.0,
    "comment": "I won my first game against an experienced player, which speaks volumes.",
    "timestamp": 1762383600
  },
  {
    "username": "hiimjosh",
    "rating": 2.0,
    "comment": "An overwrought engine-builder which, despite having a few interactive elements, fails to avoid the snowballing trap that these games typically devolve into\n\n+ The economy is tight\n+ The aliens are a really cool twist; I had no idea they were coming in my first game\n+ The orbiting mechanic is cool in every game that does it; it's no different here\n\n- The rules are a nightmare\n- The game is super long, and I could hardly care what you do on your turn; it's a shame because the first half of the game feels rather speedy\n- There are a few hints of interesting mechanics which lead to minor alliances and leeching, but they are never fully explored with any maturity\n- The snowballing is out of control; the game suffers badly from a rich-get-richer with things like score track bonuses\n\nNot my thing. It's a relatively straightforward action combo-er with some nice logistical issues here and there and some little bits of leeching from your friends, but it is largely a very messy design which throws you in a sea of effects and says \"make the most of it\". You do have to wonder how much that giant deck of cards influences the winner. I tend to want to play more deliberate games with tighter spaces rather than slopped out ones which I unfortunately feel SETI is more like. What's with these games dipping their toes into great ideas but never really exploring them to any depth? It'll have its fans, and playing at experienced tables who could play swiftly wouldn't be terrible.\n\nEDIT: No, I take it back - it's terrible. I hate this and everything it stands for. I'll go home and read a book instead.",
    "timestamp": 1760133600
  },
  {
    "username": "Bomingwang",
    "rating": 2.0,
    "comment": "Terrible game experience. Low strategy, meaningless doing plans for future turns and rounds. Extremely bad card designs. I don't know why this game exist and received so much high rates. way too overrating. What a shame for wasting such a great background topic.",
    "timestamp": 1750975200
  },
  {
    "username": "alandric",
    "rating": 2.0,
    "comment": "What a disappointment.",
    "timestamp": 1746914400
  },
  {
    "username": "tbrofromspace",
    "rating": 2.0,
    "comment": "Pulling a JB here and reviewing online mid-game. Game loses 2 stars for it's poorly designed round structure, ark nova correctly realized that it is not fun in an explosive combo flip luck game to make people sit and watch while everyone else has explosive turns. Just play that game if you're looking for 3.5 hours of card-fiddling. I'm down with a low-interaction euro, but not ones that pretend there is interaction because the board is shared and then encourage people to take 10 minutes a turn mathing out the optimal use of limited resources.\n\nThe alien discovery mechanic is incredibly unfun. Rather than feeling like discovery, it feels like you played the incorrect part of the game. Because of my position in turn order I had to sit and watch people score like 30 points after the first discovery. Unlike Shackleton Base, where the variable corporations change the decision space of the game, these aliens essentially are concerned with contracts. It's really important for us to discover those exofossils because WE CAN TURN THEM INTO POINTS\n\nYou ramp up (of course) and catch up, but overall there is little to be gained from trying to predict where other players are going to act with the dumb majority rules.\n\nArea majority euro mechanics should be banished to the phantom zone",
    "timestamp": 1743804000
  },
  {
    "username": "smurfodeth",
    "rating": 2.0,
    "comment": "What a slog. If someone wanted to purposefully design a game I would hate, it would look an awful lot like this. It's an overly-bloated design that contains at least two expansions worth of content crammed in from the get-go (one of which introduces a whole new subsytem with its own mound of rules overhead midway through an already prolonged playtime), not to mention it's yet another game with hundreds of unique and dubiously balanced cards with no meaningful way to mitigate the luck of the draw. I'm honestly confused as to how this is receiving so much hype, but I'm not even remotely interested in sitting around a giant mélange of components and sub-boards with three other people as we spend four hours playing four simultaneous solo games, so I'm very much not the target audience. Overall, it feels like yet another inbred child in the ongoing devolutionary chain begat by Terraforming Mars: the same, but worse.",
    "timestamp": 1742425200
  },
  {
    "username": "quietcorn",
    "rating": 2.0,
    "comment": "In this game, players are launching probes which fly through space to reach planets. Once they do, they can be used to go to oribit, which gives some rewards and allows you to tuck an income card, or you can land on the planet which comes with some rewards and allows you to place a marker in a yellow box which relates to the discovery of aliens. As you play, your actions grant you data tokens which click into the bottom area of your board. Once full, you can discard them to fill a blue alien discovery space. The last element is you can place tokens into these area majority scan boxes, which when resolved allow the winning player to occupy a red alien discover space. Once an alien has all three of their boxes occupied, they grant a card reward to the three participating players and they reveal a new mechanism that everyone needs to chase after.\n\nIn practice, this is a game of intense frustration. The planet map has a cool multi-level rotation element that rotates regularly throughout the round, often winding up in a position where you are no longer able to resolve your intended action. Often games that fluctuate so much between turns offer an interesting tactical experience, but in this game money and energy resources are incredibly tight, so that you often have to just pass your move rather than pivot strategy. The cards in the game also range dramatically from wildly powerful to totally useless, so draw luck can be a major factor in doing well.\n\nThe majorities game played through the scan action to get the red alien discover spaces is very uninteresting. The spaces only resolve when totally full and ties are broken in favor of who gets there later. This makes it, in our plays. one of the least used actions. Even when it is used it's extremely chaotic as to which boxes you can play into as you get one for a section in line with earth, but also a semi-random one based on whatever color cards are in the display at that moment. A technology you can buy makes it even more unpredictable as it allows someone to discard a card from their hand to get a third marker in a matching space.\n\nI hope I never have to play this again. Every round was incredibly long and every plan was frustrating to execute. This game sapped my energy completely. It's not that other players are consciously blocking you in this game, it's that the results of their effects are unpredictable and strong enough that they can completely negate what you can even hope to accomplish. At it's core, aside from all the very specific problems, it's a game that demands you play tactically but restricts your resources so tightly that you can't pivot.",
    "timestamp": 1740956400
  },
  {
    "username": "LeBoom",
    "rating": 3.0,
    "comment": "I'll echo other's thoughts, the scanning broke the game for me in a bad way. I absolutely love games with the huge deck of card mechanic...they are among my favorite. I played this a few times, then with my daughter the gamer and neither of us cared to play it any more. Maybe we just don't get it....but we don't get it. YMMV.",
    "timestamp": 1757023200
  },
  {
    "username": "FrancoisX",
    "rating": 3.0,
    "comment": "Point salad horror",
    "timestamp": 1756332000
  },
  {
    "username": "KIJUER",
    "rating": 3.0,
    "comment": "Aliens make it pointlessly complex for zero additional satisfaction. Too long, too slow, too boring.",
    "timestamp": 1750888800
  },
  {
    "username": "Darkhan90",
    "rating": 3.0,
    "comment": "The game is very tight to the point that you only want to pass quickly to get to the next round to get one money to maybe play a card (if you don't see from the first turn that you need to invest in income). Not at all a good feeling to have. So basically you fuck up your first turns, you are screwed.\nIt smacks you in the face all game for bad choices made at the beginning of the game (and it's a LONG game), and also if you have bad luck with cards.\nTo have a somewhat decent game, you need to spend the first 2 rounds ( out of 5, so almost half the game) building your income, or you'll feel starved for resources the entire time, and pass early while the others might be playing a few more turns.\nThe game duration is quite long, so spending 2 rounds to just do income before getting actually to more interesting stuff is annoying. Gimme a prelude module and drop the duration to 3 rounds.\n\nIt's too much of everything euro, a point salad and very incoherent and the mechanisms don't seem to integrate very well. And this is enhanced mid game by the discovery of alien tiles which adds more distraction, more to the point salad.\nThe alien tiles are pretty much useless, there are just some tracks, nothing interesting. The game is all about finding aliens, and this is all they could come up with? Pretty lame to be honest.\n\nHave i mentioned it's a very long game? Well, if someone takes 1 card from you, moves the dial or maybe scans your sector, well your entire planned turn/round is gone, you have to rethink everything, and with the tightness of resources, this can take a very long time because you have to calculate everything to the last dollar. God forbid you play it with AP prone people.\n\nAlso the balancing seems way off. The scanning doesn't seem worth it at all. It can be very tricky to win a sector and if you started to work on a sector and lost it, you lost a significant investment.\nEven if you invest in scanning technologies, you can't guarantee you'll win a sector. You'll need to do at least 2 scans, so someone can always grab it from you.\nSpeaking of technologies, if you go ham on scanning technologies, you HAVE TO also get the blue ones, because otherwise the blue data tokens you get from scanning are useless. There is a lot of work needed to get these techologies. To be forced to get 2 types of technologies for a single action to feel relevant is nuts.\n\nThe theme is cool and very present in the mechanics, to the point that it seems that's all they tried to do with the game, make everything very thematic and the gameplay, well, whatever it results at the end, that's it.",
    "timestamp": 1749938400
  },
  {
    "username": "Vretalegenden",
    "rating": 3.0,
    "comment": "Overhyped, messy and boring",
    "timestamp": 1744581600
  },
  {
    "username": "boomingsooner",
    "rating": 3.0,
    "comment": "I'm not sure I get it. This game just didn't ring much for me. I love big stacks of cards to work through, but scanning is a slog at lower player counts... I wanted to LOVE this game, but I just don't care if I ever play it again.\nDoesn't have the magic that Terraforming Mars or Ark Nova have. Just my 2 cents.",
    "timestamp": 1744322400
  },
  {
    "username": "tigermuppetcut",
    "rating": 3.0,
    "comment": "Overly complicated multiplayer solitaire, overly long exacerbated by rule on passing and others can play on. Does nothing meaningful that other games don’t do in a fraction of the time and complexity (bar the rotating solar system, which both adds and detracts IMO)",
    "timestamp": 1742684400
  },
  {
    "username": "Mangraz",
    "rating": 4.0,
    "comment": "For a game supposedly so complex, a lot of success depends on the mission cards you draw. I don't play games that require multiple plays to really \"get\" often, but this one's definitely the worst of them.\nAbsolutely stunning artwork though.",
    "timestamp": 1760392800
  },
  {
    "username": "Gerisone",
    "rating": 4.0,
    "comment": "Well, I finally got around to playing it.\nLet me start by saying that the game looks really good. I’d even say it feels like decent quality — surprisingly so, considering it’s from CGE. Of course, there’s no insert to be found (as usual for them), but a Petinsert took care of that for me. The box, though, is flimsy and thin — also typical. Anyway, that’s enough about the looks.\n\nOn my first play I managed to score 124 points — no idea if that’s good or bad. \nI’m writing this based on just one game, so keep that in mind.\n\nFor me, the theme fell off right after setup, like a dirty pair of underwear. \nAt no point did I feel like I was researching extraterrestrial life. The game wasn’t about that at all — it was about how to stretch the tiny amount of resources you get. Not about how much you can do, but about how much you can’t do. It’s extremely tight. I know many people love that kind of design, but it just threw me off right from the first round. I found it tiring more than anything.\n\nI wouldn’t put it on the same shelf as Ark Nova (which still ranks as one of my biggest disappointments), but I doubt this one will hit the table very often either.\nWe both got up from the game — it was my first play — and just sighed. “Yeah… it’s fine, but there are a thousand games better than this.”\n\nI’d much rather sit down to play Pulsar, which is far less random than this one if I’m in the mood for a euro.\nThere’s definitely a bit of disappointment in me again — I fell for the hype, though thankfully that happens less and less these days.\n\nVerdict: Boring, exhausting, overhyped, overrated.",
    "timestamp": 1760220000
  },
  {
    "username": "Killi",
    "rating": 4.0,
    "comment": "The most over rated game that has came out recently. I just don't get it.\n\nPlayed it once, never again.",
    "timestamp": 1756504800
  },
  {
    "username": "Zaungast",
    "rating": 4.0,
    "comment": "Activity in infinite space phoned into a game by point salad on tracks. Too many spots with too many direct victory points make the game feel irrelevant.",
    "timestamp": 1751666400
  },
  {
    "username": "verandi",
    "rating": 4.0,
    "comment": "I don't care for games driven by a big deck of cards with lots of info on them. Sending probes to planets is cool, but on the whole SETI fails to pique my interest. Just not my type of game. A slow and boring engine builder with no novel ideas. Bleagh.",
    "timestamp": 1749765600
  },
  {
    "username": "buderix80",
    "rating": 4.0,
    "comment": "Too long to many mechanics thrown in one pot. The aliens just adds another mechanism to make it more complicated. But would try it again.",
    "timestamp": 1748815200
  },
  {
    "username": "MDJD",
    "rating": 4.0,
    "comment": "I like certain aspects of the game, but at the end of the day there are some very poor design choices that ruin the experience.\n\nCompensation for going last in the first round is woefully inadequate. Because there is a race to secure the best position on end game scoring goals, going last is a massive disadvantage. Further, rewarding the players who have the most points with even more end game points seems to me very silly.\n\nThe final nail in the coffin is that the cards are wildly imbalanced. As a consequence, luck of the draw is enhanced significantly. For a 2.5 hour game, that’s just unacceptable.\n\nEasily my least favorite CGE game of the last few years.",
    "timestamp": 1748383200
  },
  {
    "username": "silenceisgolder",
    "rating": 5.0,
    "comment": "This one tipped for me from a modern euro I could sort of get behind into a slog about which I stopped caring around midway through the fourth round. There is a lot to enjoy here for me ... the resource management is not tight by any means -- certainly not tight enough to be interesting -- but it integrates well with the cards in a way that keeps the focus on the board, which I appreciated. The solar rotation thing is anti-thematic (the least predictable thing in the game is the most predictable thing in real life) but adds some tension to the prioritization and sequencing. The alien reveals are fantastic and, for me, felt like a super fresh way to add some variety to the game. The flow was really quite good early on. It lost me at the end because it, like every other game of the last five years or so, insists on doling out more actions to players as the game goes on, so the great, tense, flow gives way to long downtimes and, for me at least, the game just stopped being fun. I can't wait for this trend to be over.",
    "timestamp": 1762297200
  },
  {
    "username": "ionas",
    "rating": 5.0,
    "comment": "A lot of luck\nA lot of AP\nA lot of downtime\nRandom take that\nRandom player interaction\nMostly lacks of non-random/non-opportunistic player interaction\nBeautiful components and integrated theme",
    "timestamp": 1760565600
  },
  {
    "username": "pulla",
    "rating": 5.0,
    "comment": "Rating down 8 --> 5. I really don't like this game. There's no engine to build and I keep losing despite what I try. (I'm not used to losing this much)\n\n(Original rating of 8 from 7-2025)",
    "timestamp": 1758578400
  },
  {
    "username": "purplecow55",
    "rating": 5.0,
    "comment": "A heavier euro on the lower end where players are selection actions to deploy probes travel our solar system in order to get traces of aliens to score points.\nThis reminds me of a heavier point salad, like barcelona or windmill valley.",
    "timestamp": 1757023200
  },
  {
    "username": "shammois",
    "rating": 5.0,
    "comment": "Love the theme, but I don't think it comes through strongly. It's subjectively too heavy for me to really feel the fun and it's more like a modern euro dense puzzle, with occasionally-ponderous pacing and always-lengthy playtime. SpaceCorp is long but it feels explorative. Eclipse is long but feels immersive. SETI's aliens add some wrinkles but the predominant thing they visit upon humankind is another way to score points, and to me that feels like SETI's biggest disappointment - the most dramatic part of the narrative is a series of tracks to put markers in. I do like the puzzle, but I would have loved a simpler version and focused more on narrative and less on complexity.",
    "timestamp": 1756418400
  },
  {
    "username": "exparrot",
    "rating": 5.0,
    "comment": "Its got quite a lot going on. I like the changeable solar system and the landing on planets/moons. I like the 'signals' from space, but the aliens feel like overkill. Too much to do and an mish mash of stuff that all generates you points.\nCards are wildly different in power level and resources are tight. Downtime (and the game overall) is long and it is practically multiplayer solitaire.\nThat said it was interesting enough that I might play again, albeit, potentially without the aliens.",
    "timestamp": 1755554400
  },
  {
    "username": "metelo",
    "rating": 5.0,
    "comment": "Yeah.. More Terraforming. At least it has some other interesting mechanics attached. But still feels too close to TfM for my liking",
    "timestamp": 1753567200
  },
  {
    "username": "Flickeringfairy",
    "rating": 5.0,
    "comment": "Lost, but close race. Very complex to learn.",
    "timestamp": 1750629600
  },
  {
    "username": "Jddragonfly",
    "rating": 5.0,
    "comment": "Complex to learn, came in last, close game",
    "timestamp": 1750629600
  },
  {
    "username": "Haze1975",
    "rating": 5.0,
    "comment": "Massively overstays its welcome! Way to much luck of the draw for such a long playtime...",
    "timestamp": 1749938400
  },
  {
    "username": "neatbender",
    "rating": 5.0,
    "comment": "There’s definitely something intriguing about this game, but overall, it falls short of greatness. The biggest issue lies in its length, over-tightness in resources, and the presence of what I’d call \"random, unintentional interaction\"—arguably the worst kind, when I why the galaxy is spinning is just so random. While the game encourages playing with more people, this often results in chaotic mayhem. Actions unfold haphazardly, and although you're meant to seize opportunities as they arise, those opportunities sometimes never come at all. I had high hopes that this has more euro in it than Terraforming Mars or Ark Nova, sadly it doesn't.",
    "timestamp": 1749074400
  },
  {
    "username": "johnjon",
    "rating": 5.0,
    "comment": "Repetitive. Feels like a round or two too long... which is saying something the game is only five rounds.",
    "timestamp": 1747778400
  },
  {
    "username": "tempar",
    "rating": 5.0,
    "comment": "Too much buzz.\nThe game looks great.\nToo long.\nToo much frustration because of lack of resources and no exciting actions. The game is long but if feels you do so little.",
    "timestamp": 1747173600
  },
  {
    "username": "PoisonJamUK",
    "rating": 5.0,
    "comment": "First impressions: tediously slow (possibly just my group) and so much luck with the start cards and every top-deck draw after this. The latter would be a lot less painful if it wasn't for the former!\n\nResources are tight and building an engine is painfully slow and expensive.\n\nI was relieved when it was finally over.\n\nWould play again of others wanted to, but I wouldn't request it.",
    "timestamp": 1747087200
  },
  {
    "username": "TheMiddleAgedGamer",
    "rating": 6.0,
    "comment": "i did 2 tnbigsn on my tunrns and everyone else did 10 then i lsot.",
    "timestamp": 1762615020
  },
  {
    "username": "nosukepu",
    "rating": 6.0,
    "comment": "I was completely hooked for the first few plays, but once I figured out the system, my desire to replay it dropped off sharply.\nIt’s definitely a masterpiece for the first few games, but beyond that, it really depends on the person.",
    "timestamp": 1762038000
  },
  {
    "username": "Olisaurus",
    "rating": 6.0,
    "comment": "This is in a family of games I typically don't enjoy very much.\n\nI can see, why many people like it: many things going on, bazillions of nice pieces, optimization puzzles.\nBut for me it's too long and other games (e.g. trick tackers) are just better.",
    "timestamp": 1762038000
  },
  {
    "username": "Iron_Salamander",
    "rating": 6.0,
    "comment": "This was a pleasant surprise, in that it wasn't another yawn inducing Euro, and was actually enjoyable, but suffered from going on too long when it should have been done, and there was too much AP by 2 of our 4 players, and 1 in particular.\n\nThe theme is good, and that helped too. It's a slick production and not as yawn inducing as most Euros are.",
    "timestamp": 1761865200
  },
  {
    "username": "FiveEels",
    "rating": 6.0,
    "comment": "Frankly not very impressed. Certainly a _fine_ game, and the revolving solar system worked with the gameplay but the game had little wow factor, was not particularly memorable. Super surprised about the hype on this one.\n\nNot something I really want to play a second time.",
    "timestamp": 1761519600
  },
  {
    "username": "Cpt_Pugwash",
    "rating": 6.0,
    "comment": "Spiel von Marbers",
    "timestamp": 1760565600
  },
  {
    "username": "thereelaristotle",
    "rating": 6.5,
    "comment": "I'm shocked this game is reviewed so highly and I say this as someone who highly regards Arnak and Terraforming Mars which this seems to borrow some feel and depth from.\n\nThe gameplay feels extremely tight and almost scripted early on, either you have some great card to play or you want to make it to an income planet in turn 1 and you really don't have enough resources to try anything else. Then around the middle of the game the aliens start flipping over and provide some additional flexibility but ultimately they still manage to feel a little bland.\n\nThe theming doesn't come through for me somehow, I never remember the name of a card, they all seem derivative and uninspired. The aliens failed to provide a spark either.\n\nThe scan action, while powerful is very bland in action. The technologies are interesting but they are mostly static game to game so you can kind of fall into safe patterns with what to take. The end game scoring tiles are vanilla and feel almost like a tacked on after thought.\n\nEven moving the probes around is kind of just expensive point to point movement with the gimmick of trying to time the solar system movement.\n\nOne small pet peeve is going through your turn and accruing a list of things you need to do at the end of your turn, placing dummy markers, picking an achievement, etc.\n\nI wouldn't say no to playing this and I'd have an okay time, but it's very much an indistinguishable face in the crowd, that has somehow been strapped to a rocket pointed at the top 10.\n\nComponents are pretty good, art in general is boring. I don't love that distant stars ring just keeps sliding around.\n\nThe straight forward ruleset is a plus for this game, good book, everything is clear and there isn't a lot of edge cases.\n\nOn paper I should have liked this, but it left me pretty cold. I didn't even find there to be a real issue with 2P which was a concern of mine, but it seemed to work fine.\n\nPlay: 5\nPracticality: 8.5\nParts: 9\n\nOverall: 6.45",
    "timestamp": 1760392800
  },
  {
    "username": "LogantheBard",
    "rating": 6.0,
    "comment": "Good mechanisms and theme - didn't like that I passed and the other players played 25% more game than I did",
    "timestamp": 1759874400
  },
  {
    "username": "colinthil",
    "rating": 6.0,
    "comment": "Played once and enjoyed it, but felt very similar to many other heavy euros I experienced. I would always favor more elegant alternatives.",
    "timestamp": 1759701600
  },
  {
    "username": "GypoNolan",
    "rating": 6.0,
    "comment": "One play where there were some significant rules errors that made resources tighter. I think the theme is more evocative than in many similar euros, and I enjoyed the visual presentation. I'm not entirely sure about the mechanisms or overall experience, but playing around with a big deck of diverse card effects can be fun ala Terraforming Mars etc. Probably not worth all the hype though",
    "timestamp": 1759615200
  },
  {
    "username": "Sneaky Petey",
    "rating": 6.0,
    "comment": "Feels like it goes on a turn too long. By the end, it feels like you’re just doing more of the same. Everything gets maxed out by the end, so I don’t feel much urge to return. Still, it’s a smooth, clean, and intelligent design. A pleasure to play, but doesn’t feel sticky.",
    "timestamp": 1759269600
  },
  {
    "username": "Celloman",
    "rating": 6.0,
    "comment": "Observations after first game: Game balance issue. Too much time spent unlocking the aliens, two little time left in the game once they are unlocked. Also, the alien races are pretty uninspired.",
    "timestamp": 1758751200
  },
  {
    "username": "Destrio",
    "rating": 6.0,
    "comment": "Tight efficiency game with some race and area majority. The theme is near but I find that I'm competing with the game more than the other players at the table.",
    "timestamp": 1758146400
  },
  {
    "username": "kaemp",
    "rating": 6.0,
    "comment": "SETI has a gorgeous board and components – it looks like you’ve got your own NASA mission on the table. The cards are full of cool facts, so you’re secretly learning while playing (and can show off later).\n\nOn the flip side, the game is pretty long and complex – sometimes it feels like you score points just for breathing. This “point salad” style might click with some, but others could get lost.\n\nGreat components, clever concept, but be ready to invest time, patience, and players who can handle a more complicated space mission.",
    "timestamp": 1757714400
  },
  {
    "username": "jerkman",
    "rating": 6.5,
    "comment": "First impression only",
    "timestamp": 1762558320
  },
  {
    "username": "pintman",
    "rating": 6.5,
    "comment": "Golden geek 2024 Heavy Game of the year\nSpiel 25 angespielt. Mäßig begeistert.",
    "timestamp": 1762470000
  },
  {
    "username": "JePhRo91",
    "rating": 6.5,
    "comment": "I haven't gotten a chance to dive in. Score will most likely increase with a few more plays. Don't want to play solo but I don't have anyone to play this with.",
    "timestamp": 1762383600
  },
  {
    "username": "Napattack",
    "rating": 7.3,
    "comment": "3.74\n1-4\nBest at 3\n160 (480)",
    "timestamp": 1761951600
  },
  {
    "username": "mhgregersen",
    "rating": 6.9,
    "comment": "Gift from Mom, sister and family",
    "timestamp": 1761778800
  },
  {
    "username": "ooba",
    "rating": 7.0,
    "comment": "The game's fairly easy to explain, very thematic and so replayable with all those cards. However, it is one round too many and drags on - especially at the four player count.\n\n\nThat said, I always said I'll take a final call on SETI when the inevitable expansion comes out. And it looks like the expansion fixes a lot of the base's issues - the game is now only 4 rounds, scanning has more options and the assymetric orgs look great. The rating is bound to improve after adding in the expansion.",
    "timestamp": 1761778800
  },
  {
    "username": "Zhod",
    "rating": 7.0,
    "comment": "4p",
    "timestamp": 1761343200
  },
  {
    "username": "tag995",
    "rating": 8.0,
    "comment": "Might be too long for 4p, scanning is a bit unsatisfied at 2p but plays better than I expected. Prefer 2-3p.\n\nArt and illustrations are delicate, the flavor texts on the cards based on facts and theory are perfectly connected to the theme.\n\nResources are tight initially, leading to some difficult decisions in first two rounds, after that, players can accomplish a lot more.",
    "timestamp": 1762666860
  },
  {
    "username": "Alien3000",
    "rating": 8.4,
    "comment": "+ Epansion SETI: Space Agencies (2025)",
    "timestamp": 1762614960
  },
  {
    "username": "malittle",
    "rating": 8.0,
    "comment": "易学，规则清晰，时间长但唔会闷，有d爽",
    "timestamp": 1762611300
  },
  {
    "username": "Alfdis",
    "rating": 8.0,
    "comment": "Interesting game with a unique theme. Works well.\n\nThe gift from my 2024 BGG Secret Santa",
    "timestamp": 1762470000
  },
  {
    "username": "Ollip",
    "rating": 7.8,
    "comment": "This game nearly plays in the same league as TM, except the downtime which is cruel at 4 P.\nItˋs very thematic and has an overwhelming table presence.\nWe played 4,5 hours (+additional 45 explanation) on our first 4p Game. You have to wait 5-15 minutes for your next turn without having much to do. Sometimes it happens that you have to think over your planned move at the beginning of your turn because the circumstances changed right before. Surely this all depends on the players perfectionism and experience. Unplayable with 4 P because of much AP.\n\nYour are not that dependent on the right Cards in the right moment as it is in TM, but some cards are quite strong.\nTheme and material is extraordinary.",
    "timestamp": 1762470000
  },
  {
    "username": "ingg",
    "rating": 8.0,
    "comment": "타오바오 미플박스 오거나이저 287위안 (카드 홀더추가구매)",
    "timestamp": 1762470000
  },
  {
    "username": "Ari88",
    "rating": 7.5,
    "comment": "Rating after initial play. I can see this going up to 8.",
    "timestamp": 1762383600
  },
  {
    "username": "Michael_Ho",
    "rating": 9.0,
    "comment": "Pluto promo card\n\nSpellenvariant, 57.- €\n06/2025",
    "timestamp": 1762614480
  },
  {
    "username": "Papinek",
    "rating": 9.3,
    "comment": "Ich weiß nicht, was das orange Band \"Deutsche Ausgabe\" auf dem Karton zu suchen hat, aber wahrscheinlich hält man die Deutschen, nach den Ergebnissen der letzten Bundestagswahlen, für zu blöd ! Glücklicherweise habe ich die französische Version gekauft ! Auch die Kritik, die Spieldauer betreffend, kann ich nicht akzeptieren ! Bei den Kritikern handelt es sich meistens um extrem gestresste Arbeitnehmer, die schon während des Spiels mit den Gedanken im Büro sind ! Wenn man spielt, spielt man, auch wenn der Pizzaservice 3x konsultiert werden muss ( Twilight Imperium ). Im Spiel 2p haben wir für jeden Sektor die rechten Daten entfernt und wir scannen mit dem jeweils eigenen Satelliten, wenn sich einer im Sonnensystem befinden sollte - sonst natürlich von der Erde aus ! Klappt wunderbar ! Man kann sogar noch einen neutralen Spielstein entfernen, die Außerirdischen kommen zur rechten Zeit ! Das absolute Highlight ist das 4p game ! Lieblingsaußerirdische : Die fiesen Exertiens ! Ich musste nur die qualitativ schrecklichen Datenspielsteine aus Plastik auswechseln ! Das Spiel ist genial ! Vielen Dank Tomáš - ein Meisterwerk !",
    "timestamp": 1762603620
  },
  {
    "username": "Marcymaru",
    "rating": 9.0,
    "comment": "+ Pluto promo card\n(FS insert)\n+ Space Agencies expansion\n+ Gateway to Mars promo card\n+ Space Agencies promo card\n+ DLR promo card\n\nFAQ",
    "timestamp": 1762297200
  },
  {
    "username": "nicoleku",
    "rating": 9.0,
    "comment": "Grates Games since Ark Nova",
    "timestamp": 1762297200
  },
  {
    "username": "Phenylalanin85",
    "rating": 9.0,
    "comment": "Deutsch.\nMit Promokarte \"Pluto\".\nMit Erweiterung Raumfahrtorganisationen.",
    "timestamp": 1762124400
  },
  {
    "username": "magic_erwt",
    "rating": 8.5,
    "comment": "Expansions\n● Space agencies",
    "timestamp": 1762038000
  },
  {
    "username": "clawp1995",
    "rating": 9.0,
    "comment": "3D Insert\nGamegenic Sleeves 66 x 91 Value Pack (200 pack)\n3D Printed:\n- Money\n- Energy",
    "timestamp": 1761951600
  },
  {
    "username": "misskitten",
    "rating": 10.0,
    "comment": "You are working to find traces of intelligent life through three main methods; launching and moving probes around space to orbit/land on planets/moons, aiming your telescope into space and studying signals from far off regions of space, and analysing the data you collect with your computer. There's engine building with the technology tiles that upgrade those three actions, multi-use cards that can be played, tucked or discarded for various effects. At some point players will have found enough traces of life to discover alien races to study or communicate with (depending on the race).",
    "timestamp": 1762383600
  },
  {
    "username": "chen1272",
    "rating": 10.0,
    "comment": "The combination of card construction, scanning and login, technology selection and alien mechanisms is very clever. What is important is that the sense of inclusion in exploration is very strong",
    "timestamp": 1762383600
  },
  {
    "username": "Badgerhoy",
    "rating": 10.0,
    "comment": "Rather fantastic.",
    "timestamp": 1762383600
  },
  {
    "username": "TristanGeeraert",
    "rating": 10.0,
    "comment": "Rating based on one play only, but I think it was incredible. Really looking forward to buying this game myself.",
    "timestamp": 1762297200
  },
  {
    "username": "BionicBeaver",
    "rating": 9.9,
    "comment": "The asymmetrical corporations and quick start with the new expansion could easily bring this to a 10.",
    "timestamp": 1762210800
  },
  {
    "username": "josh2550",
    "rating": 10.0,
    "comment": "Cool theme. Lots of interesting decision points. If you like continually calculating/estimating the expected points return on different lines of play, the game's economy of resource exchange will be pretty engaging. For people not used to euro style games it may come across as a bit heavy at first, but the player aids are the best I've ever seen in a game.\n\nI love how every game resource has a variety of different uses. Rarely do I feel like I got \"unlucky\" with a bad hand of cards, etc. Actually, the power level of the cards is somewhat flat/uniform, which I enjoy. You win the game via a large number of incrementally advantageous tactical decisions, not because you drew a broken card or got lucky in the turn order.\n\nI think they did a phenomenal job with the aliens. You want the aliens to be impactful on the trajectory of the game, but not so overpowered that their discovery completely nerfs a player who had chosen a somewhat incompatible strategy before the aliens were discovered. It is often worth going out of your way to do alien-specific stuff instead of something else, but often just barely. Really brilliant balancing act in the design.\n\nProduction value of the components is great, though the lack of any insert is puzzling. You'll likely want to buy a 3rd party organizer insert, as otherwise the numerous components are all just piled in the box with baggies and setup/takedown is a bit of a chore.\n\nI am not the biggest euro-point-salad enjoyer, but I really like this game. The only euro I've enjoyed at this level is (coincidentally?) another space themed game, Lacerda's \"On Mars\", though that one is a bit too heavy to be enjoyable for many of my friends. After 40+ plays of SETI I am still excited to play. Has a great solo mode as well (unlike \"On Mars\", where the automata doesn't work very well). Make sure you have a big table to play on, though. I have a 4 ft diameter circular card table and it only just barely fits everything.",
    "timestamp": 1762124400
  },
  {
    "username": "willbeplayin",
    "rating": 10.0,
    "comment": "One of the best euros of recent years. It's an open point-salad sandbox with multiple ways to win. We played two (2!) 2p plays back-to-back inside 2½hrs, I hadn't played before and the owner of the game had played once, so with fast players the game flies by and it's not a lengthy game everyone says it is. Our 4p games take only 2hrs, so 25-30min per player is accurate with fast, experienced gamers that aren't AP prone. I've played multiple 3p plays in 75mins.\n\nThe game just keeps getting better with repeated plays and the new expansion is a must-have. Had the privilege to test it online, it's fantastic and I don't even usually like player powers but it offers so much more and is a must-include in all future SETI plays.\n\nOver 100 plays already, SETI sure is an amazing game and my GOTY 2024.",
    "timestamp": 1762038000
  }
]