[
  {
    "username": "zmartianov",
    "rating": 1.0,
    "comment": "This game promotes the exploitation of workers to influence government outcomes",
    "timestamp": 1754604000
  },
  {
    "username": "Scaaat",
    "rating": 1.0,
    "comment": "Let me preface this by saying I'm a big fan of a few of felds games, he isn't a bad designer.\n\nThe board dictates what tiles you pick, the dice dictates the things that you will \"optimally\" do, this game plays you, you do not play the game.\n\nDuring my 5th (and hopefully final) play, I was still looking to see what tiles do what, literally the only game this has happened to me this deep in.\n\nBonus negative points because this is rated so high and I was forced to count so many points. Easily EASILY the worst feld game. The fact this is so highly regarded makes me sick.",
    "timestamp": 1753999200
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "Ever heard of Buridan's Ass? That's kind of eurogames in general, nobody can decide what to do so they sit there for hours thinking about equal options. So I guess this game gives players dice to limit their options a little, but they're still paralyzed by choice.\n\nI guess it's okay, there's a lot of worse euros. Especially afterwards, they really went overboard.",
    "timestamp": 1746914400
  },
  {
    "username": "bernstein82",
    "rating": 1.0,
    "comment": "no interaction => boring",
    "timestamp": 1704582000
  },
  {
    "username": "Marcsalty",
    "rating": 1.0,
    "comment": "Special Edition on the way",
    "timestamp": 1695160800
  },
  {
    "username": "Jobul_is_happy",
    "rating": 1.0,
    "comment": "wanna play forever",
    "timestamp": 1682028000
  },
  {
    "username": "BestBunza",
    "rating": 1.0,
    "comment": "COULDN'T EVEN PLAY.",
    "timestamp": 1669590000
  },
  {
    "username": "FutureSpec",
    "rating": 1.0,
    "comment": "Edit 2022-03-27: lowering to a 1 from a 2, because I honestly hate this game. I hate the colors, the artwork, the unclear iconography/rules. Blech.\n\nThe epitome of a dry, math-problem Euro game with zero theme.\n\n1) too much looking up \"what does this building do again?\"\n\n2) colors that are way too similar; I don't even have color blindness and I strained at times to distinguish between them\n\n3) no player interaction! Well, barely any. Toward the ends of rounds you end up racing for the last of resources that are running out. But there's zero direct interaction, so I became checked-out when it wasn't my turn.",
    "timestamp": 1648335600
  },
  {
    "username": "christhomas226",
    "rating": 1.0,
    "comment": "Boring",
    "timestamp": 1641337200
  },
  {
    "username": "ys6168",
    "rating": 1.0,
    "comment": "It depends almost luck. Dice will lead your game. Not your strategy.",
    "timestamp": 1628719200
  },
  {
    "username": "jrsquee",
    "rating": 1.0,
    "comment": "plays as beige as it looks",
    "timestamp": 1611010800
  },
  {
    "username": "jamespedid",
    "rating": 1.0,
    "comment": "Let's just combine a horrible pool of luck with boring and bland mechanics and hope that the game is good. Unfortunately it isn't; the games are repetitive, the boards are boring and uninspiring. The theme is cardboard. Way better games out there to play seriously.",
    "timestamp": 1586210400
  },
  {
    "username": "chrboesen",
    "rating": 1.0,
    "comment": "Multi-player solitaire. Played 2 times.",
    "timestamp": 1583276400
  },
  {
    "username": "Frozen Flesh",
    "rating": 1.0,
    "comment": "I came here, because of all the people rating mature themed games like KD:M or Hate with a 1, just because of their mature them.\nThis games theme is boring!",
    "timestamp": 1547074800
  },
  {
    "username": "kosterix",
    "rating": 1.0,
    "comment": "CoB looks as bland and as flat as it plays. Really tried to understand why the explaining gamer wanted to play this.\n\nScore seas together, yay, score sheep together, yay, score any combination together, yay. I hate point salad games in general, and Stephan Felt games in particular, and this one is the best example why. Roll dice, play cards by applying impossible to remember iconography, and when you do you count most sheep, most pastures, most lakes and be done with it. I don't understand what anybody sees in this crap.\nWill actively avoid having to play this, all felt games feel like I wasted an hour of my life, and I don't like that at all.",
    "timestamp": 1520377200
  },
  {
    "username": "sgosaric",
    "rating": 1.0,
    "comment": "Hi! This is my original comment:\nComplex, painless, themeless.\n\nThe games I don't get intrigue me, they are elusive, they involve people in such a way that produces unpredictable outcomes (emergant). This is not such a game. There is no theme worth naming such, there is no interaction - you're just staring at your own board (okay, yes, there's rich interaction which involves grabbing a tile from the market before someone else does).\n\nWhat this is: a spatial puzzle you must solve by managing random elements and special powers of some tiles. That's all of it. And it manifests as a victory point salad, which seems to me like laziness on designer's part. Or it's just another step from conflict into the friendly euro zone when you get instant gratification for nothing.\n\nIt's a sissy game.\nWhich means it tries very hard to hide the fact that it is indeed a game.\n\nAnd I realised I was giving some colder Uwe Rosenberg's design hard time unjustifiably. Uwe's game have focus and even in their prussian coldness, they're charming in that old german way. This has no focus (victory point salad) and no charm either. It's that aunt that let you eat everything you wanted and you didn't end up any better for it.\nLater comment:\n\nBack in the day people were talking about euros again and some guy called Feld and something called \"a victory point salad\". Of course, me being clever, I was sure what they're talking about. Then I played Burgund von Burgund and ... Oh! A realization dawned. So that's a victory point salad! It's not about points at all, I mean, yes it's about points from everywhere, but it's not the points that matter (they're everywhere!), but the dilution of tension. I couldn't have imagined that even the tiny amount of tension and interaction in workerplacements could be diluted further. But hey, if anybody could do it, Feld's your man. (He's also the man to make an auction be about optimisation, but that's another game).\nBut what you really want to read is this: Item for GeekList \"Worst. Game. Ever.\"",
    "timestamp": 1516402800
  },
  {
    "username": "Jedit",
    "rating": 1.0,
    "comment": "I have no idea why this is #12. It's a basic worker placement game, except where you can place your workers is determined randomly. There's no way I'd ever play this over Caylus or half a dozen other similar games.\n\n11/7/14: revised rating from 4 to 1 after finding out the player boards were not created equal. It's now definitely a broken game.",
    "timestamp": 1405029600
  },
  {
    "username": "thed0n100",
    "rating": 1.0,
    "comment": "Long and boring. Despite what people may say a 4 player game always takes three hours to play. I had the misfortune of a four hour game when I played this.",
    "timestamp": 1399240800
  },
  {
    "username": "Pro_player",
    "rating": 1.0,
    "comment": "Way too long with a 4 player game !!\n\nThe mechanic is good, but just plain boring.\n\nNot the best Stefan Feld game.\n\nIf you like mathematics and love spread sheets kind of game, then maybe this game is for you.\n\nThis is definitely a 2 player game by far.\n\nThemeless, blend, bad artwork...\n\nEnough said...",
    "timestamp": 1389308400
  },
  {
    "username": "latschediwes",
    "rating": 2.0,
    "comment": "I can say that modern Euro games are nowhere near my cup of tea. The structure of these type of games wants to produce a self-centered experience, based on achievement and separation, between my stuff and your stuff. It seems to me like symbols of our daily lives, of our cultural conditioning, where our own ambitions, the separation through various forms of attachements, is considered an extraordinary good thing with a purpose.\n\nThe amount of human stuff is ZERO, the game dilutes tension, it makes good play indistinguishable from bad play and the the board looks like a naked molerat. Unfortunately, it's probably not intended as a parody.",
    "timestamp": 1754085600
  },
  {
    "username": "Nodens",
    "rating": 2.0,
    "comment": "Sits at about the exact opposite end of what I'd call a fun game. Might work for you if you don't really like social interaction. Astonishingly ugly.",
    "timestamp": 1752444000
  },
  {
    "username": "Playtina",
    "rating": 2.0,
    "comment": "I don't like math in games – and this game unfortunately has lots of it",
    "timestamp": 1750456800
  },
  {
    "username": "gamer2024",
    "rating": 2.0,
    "comment": "Really didn't like it, way too much confusion",
    "timestamp": 1742684400
  },
  {
    "username": "Merrickbr",
    "rating": 2.0,
    "comment": "Good, with plastic component organizer",
    "timestamp": 1738882800
  },
  {
    "username": "Jorerbor",
    "rating": 2.0,
    "comment": "It has functioning rules and game play. The theme is dreadful, game progression is unexciting, game play is incredibly uninteresting.",
    "timestamp": 1736722800
  },
  {
    "username": "igroteka",
    "rating": 2.0,
    "comment": "Played it, didn't like it.\nOther people seem to enjoy it, though. Good for them!",
    "timestamp": 1715464800
  },
  {
    "username": "Kodeir",
    "rating": 2.0,
    "comment": "A drafting game in which drafting is governed by dice rolls. The key factor in drafting is knowing when to pick things you need, as well as when to pick what your opponents need. Here you pick what the dice tell you to pick. Drafting decisions are trivialised, and what remains is a pretty bland spatial puzzle. To make matters worse, the game's length and set up times are egregious.\n\nI know most people enjoy this, but I utterly fail to understand why. This may be my most controversial rating, but also has been my biggest disappointment in all my years as a board gamer.\n\nRating: \n\nFor more information on how I rate games, go to my profile",
    "timestamp": 1709334000
  },
  {
    "username": "Sikko",
    "rating": 2.0,
    "comment": "A drag with 4 players...",
    "timestamp": 1702940400
  },
  {
    "username": "Skippan",
    "rating": 2.0,
    "comment": "Eye bleeding drawings",
    "timestamp": 1684101600
  },
  {
    "username": "Drulymok",
    "rating": 2.0,
    "comment": "It's a frustrating game: I can't set a strategy and it forces me to a block of analysis.",
    "timestamp": 1673910000
  },
  {
    "username": "GregDarcy",
    "rating": 2.0,
    "comment": "This version is NOT colourblind friendly. The 2019 version is much better - for me at least.",
    "timestamp": 1666044000
  },
  {
    "username": "asfhgwt",
    "rating": 2.0,
    "comment": "Has tiny components that cause eyestrain, a too-busy board, zero fun factor, too many ways to get points, and I'm sick of these each-player-has-a-player-mat-and-you-build-your-own-village games; they are exercises in mutual masturbation, to quote a friend. This one also takes far too long to play as well.",
    "timestamp": 1653602400
  },
  {
    "username": "biscuits409",
    "rating": 2.0,
    "comment": "Cool but kind of bland I guess.",
    "timestamp": 1623103200
  },
  {
    "username": "igeorgiev42",
    "rating": 2.0,
    "comment": "Point salad boredom. This game finally convinced me to swear off any and all Stefan Feld's games, now and in the future.",
    "timestamp": 1607554800
  },
  {
    "username": "riogames",
    "rating": 2.0,
    "comment": "Although I find the game OK and I am willing to play it, the component quality, like most all Ravensburger games is lacking and detracts from the enjoyment of playing the game.",
    "timestamp": 1583449200
  },
  {
    "username": "TedW",
    "rating": 2.0,
    "comment": "If multi-player solitaire, point salad, lack of coherent theme and excruciating downtime are your thing, I give you CoB.\n\nFor the life of me I cannot fathom why this game is so highly regarded.",
    "timestamp": 1577314800
  },
  {
    "username": "johnclark",
    "rating": 2.0,
    "comment": "Another Feld, another fail. Point salad with extreme downtime. Watching people think is unfun. Yawn. 4/10 for two players. Absolutely awful with four. Do the dice make too much luck? I dont care. Are there multiple paths to victory? I dont care. The game is so dull I just want it to be over. My only turn planning is what will take the shortest time so it will be over faster.",
    "timestamp": 1559944800
  },
  {
    "username": "JGRno5",
    "rating": 2.0,
    "comment": "I would normally rate this game 8 or 9. However, the difficulty in reading the artwork causes me IMMENSE difficulty. What is really annoying is that THIS ATTEMPT TO BE ARTSY WAS SO UNNECESSARY. This is an otherwise great game RUINED by the artwork.",
    "timestamp": 1558994400
  },
  {
    "username": "tectactoe",
    "rating": 3.0,
    "comment": "Put off playing this for a long time because of how ugly it looks on the table. Alas, I've rather enjoyed learning how to (finally) play. Though I will only entertain it in a digital format - the physical setup is a nightmare that costs significantly more than the gratification delivered by the game. The \"dice-as-worker\" mechanism works well here, especially given the various ways you can mitigate unfavorable rolls. Maybe some balance issues with certain yellow tiles? (Haven't played enough to really know for sure.)",
    "timestamp": 1761519600
  },
  {
    "username": "spencyrrh",
    "rating": 3.0,
    "comment": "2025-04-11 | 8 plays at 2, 3 & 4 | BGA | rules scratched in play:  3  \n\nOn your turn, you roll two dice and use their faces to draw tiles from matching lots, play tiles to matching lots on a player board, 'sell' matching sets of goods, or buy 'workers' (essentially just a pip of die roll mitigation). Some tiles give you points; some give you points if paired with other tiles; some give you extra semi-turns; some give you workers; some let you take goods; etc.. You get extra points if you complete sections on your player board.\n\nThe game offers a neat puzzle with potential for satisfying combos, and many varying routes to victory. In a small way, you can cobble together an engine for stronger turns. But fundamentally, you play a tensionless solo puzzle with plenty of downtime wherein you manage dozens of fiddly bits featuring barely visible imagery in dreary colours and an absent theme in order to build a completely charmless tableau. The game represents everything I abhor in this hobby. Hate-drafting rarely feels possible and when it does, it normally means setting yourself back. The game plays very smoothly, and puzzle-lovers seem to find it especially stimulating. I don't find myself actively wishing for meteor impact during play, but I would happily never think about this game again.\n\nThe original looks boring and the new edition looks too saturated. Both probably work fine.\n\nThe rules tick over nicely, but the game suffers from a typical boring Euro disease: an excess of icons when in fact you need every tile explained in language. Higher player counts will slow the game, wasting more of your time.",
    "timestamp": 1750543200
  },
  {
    "username": "Jertlemiah",
    "rating": 3.0,
    "comment": "What is with this 8.0 score beyond nostalgia?\nNo one in my group had fun with this one and the entire game dragged on",
    "timestamp": 1746396000
  },
  {
    "username": "TForever",
    "rating": 3.0,
    "comment": "If the game was meaner, I think it would be a great game, but you can manipulate the dice to whatever roll you need.",
    "timestamp": 1744408800
  },
  {
    "username": "diamondvise",
    "rating": 3.0,
    "comment": "Everything a board game shouldn't be. It's one of the least fun board games I've ever played. Pure mechanics for their own sake.",
    "timestamp": 1741215600
  },
  {
    "username": "blank_generation",
    "rating": 3.0,
    "comment": "Incredibly dull. MPS snooze-fest.",
    "timestamp": 1730761200
  },
  {
    "username": "Flatirons",
    "rating": 3.0,
    "comment": "Chris J., Kevin G., and Justin L. own it.\nOn BGA.\n\nSetup (0-Slow | 4-Quick): 0/4\nEasy to teach (0-Hard | 4-Easy): 1/4\nPlayer Interaction (0-Solitaire | 4-Plenty): 2/4\nDowntime (0-Long | 4-Short): 0/4\nLuck Influence (0-Swingy | 4-None/Counterable): 1/4\nReplayability (0-Barely any | 4-Almost infinite): 2/4\nFun (0-Boring | 4-Heck Yeah): 0/4",
    "timestamp": 1718229600
  },
  {
    "username": "Nicolas Weiss",
    "rating": 3.0,
    "comment": "I was unfairly predisposed to be wary of the name \"Stefan Feld\", one possessive consonant away from the local psychiatric ward and the kind of insensitive jokes you can imagine. Also, the designer had become popular for victory point salads and multiplayer solitaire, admittedly as-far-away-from-my-thing as it gets. Still, I got eventually curious to fix that gap in my board gaming education, and it was easy enough to find someone willing to play The Castles of Burgundy, a more-than-a-decade-old game in a BGG top 20 that was otherwise increasingly biassed towards the cult of the new.\n\nThis went both better and worse than I expected.\n\nFor all the advertisement of a mid-heavy Eurogame game and the sheer amount of setup, CoB follows a pretty simple structure: roll a couple dice, then use each die to pick/build/sell a thing that matches the die result or trade the die for a bunch of die result modifier tokens for future use. Then it's just an exercise in checking the player aid for understanding what the beige buildings do and the rulebook for the yellow tiles. The action economy is pretty simple: it normally takes two actions to place anything on the scoring part of your tableau, so try to find ways to have it only take one action, and figure out how much you're ready to spend resources prioritising a boatload of ways to make victory points.\n\nI clearly do understand why the game has a large public, and that it's satisfying to slot a shape of the correct colour into a shape of the correct colour to complete an entire coloured area that then poops a bunch of VPs to signify you did well and got dibs on that colour. I just don't find that attaching an optimisation puzzle and a Pavlovian reward to match-the-colours is enough to sustain my interest: I'm here to play with other people, not to play with myself with other people! And on that department, The Castles of Burgundy is infuriating, because it contains just enough pretence of player interaction that people will defend (out of a sincere belief) that it's actually a genuine multiplayer game; but actually whether you get to calls dibs on a highly desired tile (say, an early silver mine) has almost nothing to do with your opponents’ position (they'll snatch it on the first reasonable opportunity), and almost everything to do with the amount of resources you'll be willing to spend to do so if the dice don't go your way. So, you know, other players are merely a randomising gizmo for your moves.\n\nOverall, made me feel like I was playing an overcomplicated version of Kingdomino. Good for those who genuinely enjoy the complication.",
    "timestamp": 1709506800
  },
  {
    "username": "kensie",
    "rating": 3.0,
    "comment": "boring :-(",
    "timestamp": 1704927600
  },
  {
    "username": "Desigual",
    "rating": 3.0,
    "comment": "Dice rolling isn't my favorite mechanism, but this game it's really clever where the strategic factor is quite heavier than the luck factor. Poor components. A good game to play from time to time.",
    "timestamp": 1697839200
  },
  {
    "username": "wkover",
    "rating": 3.0,
    "comment": "Our game went like so:\n\nI take a 30-second turn, and I grow increasingly bored while others take 5-minute turns. Though I did learn in my burgeoning agony that my nails need trimming, the ceiling needs washing, and everyone else in the room is having more fun than I am.\n\nSpeaking of praying for a heart attack, I do not need to play another game where the game's winner is determined by massive endgame swings in VP due to bonus/multiplier tiles. Sure, if I cared about these spoiler tiles I could go for them myself. But I don't.\n\nSo if I see you coming with CoB I'll be running the opposite direction. Nothing personal.",
    "timestamp": 1688853600
  },
  {
    "username": "trawlerman",
    "rating": 3.0,
    "comment": "I don't like dice in my Euros. That's my own hang-up. You do you.",
    "timestamp": 1687989600
  },
  {
    "username": "lee elektrik",
    "rating": 3.0,
    "comment": "Charmless and drab. The dice-limited action selection will rarely give you an interesting decision and at the same time severely limit any potential for strategic play. Doesn’t really matter either way; If you at first think there might be various strategies, you are gravely mistaken. This game is so absurdly long that you will need to do _all_ the stuff, just to use up your heap of actions. It’s hard work and looks boring on top. Player interaction includes the (very) occassional hate draft, but mainly consists of reminding each other to go faster, to at least somewhat reduce the exasperating downtime.",
    "timestamp": 1673305200
  },
  {
    "username": "sashiuma",
    "rating": 3.0,
    "comment": "2.99",
    "timestamp": 1669762800
  },
  {
    "username": "Lordstrategos777",
    "rating": 3.0,
    "comment": "If I'm going to play a Euro where dice do something I would rather play Space Base, Merchants of the Dark Road, or even Machi Koro.",
    "timestamp": 1662933600
  },
  {
    "username": "tylrprtr",
    "rating": 3.0,
    "comment": "I'm not sure what I'm missing here. This game is so well liked universally, yet it simply did not click with me. What soured me more than the art was the way buildings worked. The buildings each have their own special power, which meant that it was impossible to play without having the manual in hand. This ruined the game for me.",
    "timestamp": 1660687200
  },
  {
    "username": "sareneFactorial",
    "rating": 3.0,
    "comment": "everyone gets tons of points for 90 minutes and no one knows why anyone lost. i understand why \"feel-good\" abstractions like point salads are used but they are not for me",
    "timestamp": 1659909600
  },
  {
    "username": "Bazzisbazz",
    "rating": 3.0,
    "comment": "See Comment 2019 Version.\n\nSame like the 2019 version, but one point lower because the art is even less readable.",
    "timestamp": 1657836000
  },
  {
    "username": "Stan_Goose",
    "rating": 3.0,
    "comment": "",
    "timestamp": 1657490400
  },
  {
    "username": "dl1ngo",
    "rating": 4.0,
    "comment": "Nice design, but where are the castles and why in Burgundy?",
    "timestamp": 1755208800
  },
  {
    "username": "Username2024",
    "rating": 4.0,
    "comment": "Dreadful experience at 4 players (some with tendency towards AP)\nLong,boring and uninteresting.\nI was looking forward to it ending.\n\nI would like to try it again but with only two players or solitary, we'll see.\nMaybe the hype was too great or this game is not for me",
    "timestamp": 1751234400
  },
  {
    "username": "Beastly_Venturer",
    "rating": 4.0,
    "comment": "5 plays. Never could get into this one. Never really understood all the hype. Very bland.",
    "timestamp": 1740783600
  },
  {
    "username": "doctoryes0",
    "rating": 4.0,
    "comment": "The definition of a game that has not withstood the test of time.\n\nT1 first player takes the mine, then ships. Take ships to stay ahead on turn order so you can get the second mine. Place more tiles than your opponent. Win.\n\nIt's so incredibly stupid.",
    "timestamp": 1738450800
  },
  {
    "username": "LetsGetTrivial",
    "rating": 4.0,
    "comment": "I have no idea why this is rated so highly. Yes, there are some neat opportunities for cool combos, but the repetitive nature got old very quickly. Maybe not good with four players?\n\nMy definition of a point salad game.",
    "timestamp": 1736377200
  },
  {
    "username": "Rhogarj",
    "rating": 4.0,
    "comment": "A game with some great mechanics, but unfortunately brought down by the long set up and tear down between each round and by the very small and indistinguishable iconography on the hexes.",
    "timestamp": 1723068000
  },
  {
    "username": "onthemix",
    "rating": 4.0,
    "comment": "Aucun intérêt pour les joueurs confirmés.\nTrop long pour du familial.\nRevendu direct",
    "timestamp": 1720216800
  },
  {
    "username": "MikeBwithoutadot",
    "rating": 3.5,
    "comment": "Another soullless euro that seems to suggest more control than you actually have (quite some luck due to dice rolling)\nAs usual with Feld games, the theme is totally pasted on, it's just mechanics. It lacks interaction for me. Apparently people think this is Stefan Feld's best game. It's not 'awful' but with all those great games out there (by other designers) I really rather don't want to play this (or any other Feld game) again. Way too meh to deserve the hype.",
    "timestamp": 1717797600
  },
  {
    "username": "SecretSauce275",
    "rating": 4.0,
    "comment": "based on App play",
    "timestamp": 1711580400
  },
  {
    "username": "klane",
    "rating": 4.0,
    "comment": "Dry, boring game. Takes too long for what it is. Point salad.\nLuck factor is too big for my taste.\nNot enough interaction between the players.",
    "timestamp": 1710543600
  },
  {
    "username": "thebaysix",
    "rating": 4.0,
    "comment": "Overall I've found it fairly drab and repetitive. Mildly strategic, but there are more interesting games out there that scratch that itch. The spatial planning is probably the most appealing thing here. You couldn't give the 6 goods names, could you- you just went and named them Good 1, Good 2, etc...!!?!??",
    "timestamp": 1700780400
  },
  {
    "username": "thrasymedes",
    "rating": 3.8,
    "comment": "A very well-designed game that just isn't my cup of tea.\n\nEdit: On further play, this is really much too long relative to how interesting it is. Might be that the vineyard expansion made it worse.",
    "timestamp": 1700262000
  },
  {
    "username": "Segraham92",
    "rating": 4.0,
    "comment": "BGA",
    "timestamp": 1698879600
  },
  {
    "username": "AlexSpielrebell",
    "rating": 4.0,
    "comment": "Some ppl like it, I cant get warm with the game. Too much randomness for me, the theme is tacked on, strategy is rather limited for me.",
    "timestamp": 1691100000
  },
  {
    "username": "iplaybgnaked",
    "rating": 4.0,
    "comment": "Good entry level euro that's become uninteresting to me after everything else I've played.",
    "timestamp": 1686434400
  },
  {
    "username": "JSMA",
    "rating": 4.0,
    "comment": "Langweillig",
    "timestamp": 1680991200
  },
  {
    "username": "JasonSaastad",
    "rating": 4.0,
    "comment": "Favorite review\ntactical contest\nmoderate skill:moderate luck\n\n dramatic dice \n strategically shallow\n\"thumbsdown: tediously tactical\n incidental interaction\n\nI can be convinced to play if all players are using the same board",
    "timestamp": 1675983600
  },
  {
    "username": "NurseJosh",
    "rating": 4.0,
    "comment": "It seems like a good game, but I just didn't enjoy it as much as I thought I would've",
    "timestamp": 1675897200
  },
  {
    "username": "Udai",
    "rating": 4.0,
    "comment": "too many unique buildings. not for me.",
    "timestamp": 1674082800
  },
  {
    "username": "Ephorus",
    "rating": 5.0,
    "comment": "What I like:\n- Cozy feel-good game in which everything generates points.\n- Nice optimisation of what do I have (dice, workers, available tiles) and what can I make out of it.\n\nWhat I dislike:\n- Mostly no interaction and as said everything generates points.",
    "timestamp": 1761951600
  },
  {
    "username": "kataclysm",
    "rating": 5.2,
    "comment": "It's fun. Lots of choices every turn, but they are limited to some extent by the D6s rolled, which I think minimizes AP. There are a lot of interdependent points-grabbing opportunities. When I looked at the player boards before my first play, I saw the D6 symbols and thought everyone's land would end up the same, an on-rails game. That's not so. Probably the funniest part of this game is the animals tiles—that is, taking the animals tiles you know would give a huge bonus to your opponent.\n\n(Lost in the fire)",
    "timestamp": 1761170400
  },
  {
    "username": "pupykises",
    "rating": 5.0,
    "comment": "a '5' does seem kinda harsh for a game that was really just...meh. look, i have tried it several times. i have no idea how this is so captivating to so many. i don't begrudge them. it's just...i mean, really? really?? it isn't the look. i play beige games with fantastic choices and interesting decisions all the time. not once did i feel like i made an interesting decision. good on ya, i guess.",
    "timestamp": 1758837600
  },
  {
    "username": "kendallgrubbs",
    "rating": 5.0,
    "comment": "About as exciting as the name.",
    "timestamp": 1758751200
  },
  {
    "username": "federik21",
    "rating": 5.0,
    "comment": "First played in 2023, I can't see it's uniqueness and why it is considered so good. Obviously, not the theme.",
    "timestamp": 1755468000
  },
  {
    "username": "mazmaz",
    "rating": 5.0,
    "comment": "Rated with trade routes, goats and park promos. Extra boards and promos welcomed for experienced players. Base game rating: 7\n\nBest with 3 players.",
    "timestamp": 1751234400
  },
  {
    "username": "Marius n Milan",
    "rating": 5.0,
    "comment": "2017 Prague Hraz\nN",
    "timestamp": 1747951200
  },
  {
    "username": "geoffder",
    "rating": 5.0,
    "comment": "Not a fan of solitaire point salad euros, but at least it plays quickly and is relatively simple compared to many in its genre. As an async game on BGA it isn't so bad, just a puzzle played a bit at a time. I'm much less interested in setting up, teaching, and playing such a non-Interactive game in person though. At least Cascadia is a breeze for when that type of game is needed for the crowd and mood at hand.",
    "timestamp": 1747778400
  },
  {
    "username": "Sunnyfield",
    "rating": 5.0,
    "comment": "★★★☆☆\nA crowd pleaser.\n\nArguably Stefan Feld's most popular game. I can see why, but it still does not cut the mustard for me.\n\nThis game is so well-known that I will not cover how it plays. I will straight go to what I think it does well and what I dislike about it.\n\nThe Castles of Burgundy is a typical eurogame with your own player boards, the solo puzzle that you are trying to solve and its very abstract theme. And there you have my dislikes: no interaction, an optimisation puzzle and too abstract for my liking. It overstayed its welcome by about two rounds. I was minmaxing all my moves towards the end.\n\nStill, playing it was a soothing experience. The planning of where to place which tiles and when. Using modifiers and special abilities to shape the solution to your puzzle. It sure did tickle an intellectual itch, the same way solving a Sudoku puzzle does to me.\n\nThe Castles of Burgundy is a pure eurogame and a very satisfying one at that. There is a time and place for this type of game, which means for me: once a year at most.",
    "timestamp": 1745186400
  },
  {
    "username": "smurfodeth",
    "rating": 5.0,
    "comment": "I know this thing is still massively popular, but it has never grabbed me. I do hate it less than many games I could say that about, though.",
    "timestamp": 1743202800
  },
  {
    "username": "selvalabelva",
    "rating": 5.0,
    "comment": "Brainburn         Longevity    \nLuck impact       Rules/Setup  \nInteraction       Involvement  \n\nAftertaste           Enthusiasm   \n\n Best at 2 players\n Rating inclusive of expansions gameplay\n Replayability further improved with expansions\n Confrontation: multiplayer solitaire\n\n Flimsy component quality cheapens enjoyment\n Setup and maintenance without organizer is miserable",
    "timestamp": 1742511600
  },
  {
    "username": "WilcoxDave",
    "rating": 5.0,
    "comment": "2-4",
    "timestamp": 1741647600
  },
  {
    "username": "mawilson4",
    "rating": 5.0,
    "comment": "A Euro game that sands off any of the sharper edges that might make it exciting in any way, shape or form. There's little meaningful interaction, or exciting hook other than, I suppose, the ephemeral dopamine hit every time you get nudged up on the victory point track (a feeling I've become numb to in gaming unless it's accompanied by real, in-game tension). The art is a frequent target for criticism here, but for me, the feeling of the gameplay matches the muted beige tones throughout the components, and it's THAT which makes me indifferent. I can look at the design and admire its clockwork elegance. That doesn't mean it will excite me, though.\n\nI also don't dislike all Feld games. I quite enjoy one due to its higher levels of interaction. And a couple others are quite decent. Why Burgundy is his most renowned is a bit of a mystery to me. It has less of a statement to make—mechanically or narratively—than nearly any other game I can think of that's rated as highly.",
    "timestamp": 1740956400
  },
  {
    "username": "Chris Sjoholm",
    "rating": 5.0,
    "comment": "Not my cup of tea. I don't find the process of the game all that interesting, and there are so many variables that it's very difficult to gauge progress.",
    "timestamp": 1740092400
  },
  {
    "username": "donotadjust",
    "rating": 5.0,
    "comment": "I know I am in an absolute minorty but I just do not like CoB. I try it again every once in a while and every single time I bounce right off it.",
    "timestamp": 1739833200
  },
  {
    "username": "I_made_a_username",
    "rating": 5.0,
    "comment": "Pros: different types of tiles enables different strategies across repeat plays, rolling dice to inform what to draft is a neat and fun mechanism, lots of different abilities with yellow buildings,\n\nCons: slow game with 3-4 people, theme is meh, has the feel of a dry euro without the deep mechanisms to distract you from that lack of pizzaz, not pretty to look at if you are playing the original version",
    "timestamp": 1738623600
  },
  {
    "username": "stuffbybez",
    "rating": 5.0,
    "comment": "1-feb-2568\n\nI'm not sure I like Stefan Feld's designs but maybe I would if I played them more.\n22:37\nI think I particularly wanted to learn this one because of it's reputation and also someone in BKK mentioned that they love it. But now I can't remember who said that.\n22:38\nI find it kinda interesting, but personally I don't find it compelling/exciting/fun right now.\n22:51\nI'd like to give it another go but not immediately.",
    "timestamp": 1738364400
  },
  {
    "username": "Mundungu",
    "rating": 5.0,
    "comment": "This game is the quintessential 5/10, middle of the road. I prefer not to play it, but won't turn it down most of the time. The game feels pretty bland overall and doesn't particularly excite me at any point.\n\nA big issue with the game is the die rolls do matter a lot. There are so many situations where I need to roll a certain number, and roll doubles of the worst number. You are forced into losing half of your turn to workers, and fall behind as a result. This can be mitigated by planning your outs, but it can only go so far.",
    "timestamp": 1738105200
  },
  {
    "username": "setropo",
    "rating": 5.0,
    "comment": "ECDE #19 y #28",
    "timestamp": 1737500400
  },
  {
    "username": "BangazBaroque",
    "rating": 5.0,
    "comment": "I don’t get it. But I’ve kept it in the collection to try again another time.",
    "timestamp": 1736377200
  },
  {
    "username": "makarren",
    "rating": 5.0,
    "comment": "There is not a incredible game, but it works. Easy to learnt, hard to master. A bit bored to play after a few games.",
    "timestamp": 1735254000
  },
  {
    "username": "tolhs",
    "rating": 4.6,
    "comment": "2024:+0.5",
    "timestamp": 1733958000
  },
  {
    "username": "mattyd777",
    "rating": 5.0,
    "comment": "Solid game, but not one I often play due to game length, and not one you can pick up and play without rehashing rules.\n\nUpdate: Traded in Feb '18 Math Trade",
    "timestamp": 1732316400
  },
  {
    "username": "DonWalker",
    "rating": 5.0,
    "comment": "Initial rating: 6 (05/2023)\n\nUltimate boring game, way to overhyped!",
    "timestamp": 1731538800
  },
  {
    "username": "Kempeth",
    "rating": 5.0,
    "comment": "Pros: Having your actions tied to your rolled numbers provides a decent puzzle. It narrows your options just enough that you can't blindly implement your plan but not enough that you can't realistically pursue anything. It's also snappy enough to not overstay its welcome and allows for different approaches.\n\nCons: Despite there being different things to focus on and different map layouts to contend with I don't see this game bringing anything new to the table after the first game.\n\nIf you thrive on battling other player on a familiar battlefield then you'll likely rate this game higher but that's simply not enough for me.",
    "timestamp": 1727388000
  },
  {
    "username": "smaug007",
    "rating": 4.9,
    "comment": "I've now been taught the rules and better understand the game (as opposed to the failed attempts to learn it myself). The game felt a little cold, fiddly, and mechanical.",
    "timestamp": 1726351200
  },
  {
    "username": "joanmoreno",
    "rating": 5.0,
    "comment": "Un juego del que mucha gente habla maravillas pero que a mí me dejó muy frío (aunque jugarlo en una tienda con una copia tan echa polvo que daba asco manosear tampoco ayudó). Recuerdo mecánicas desconectadísimas de la temática. Le daría otra oportunidad porque quizás el contexto de la partida no era el mejor.",
    "timestamp": 1725400800
  },
  {
    "username": "Redward",
    "rating": 5.0,
    "comment": "I would have to play this again before forming a confident opinion but based on my first play I really don't like this game. It felt far too abstract and puzzley. Although I don't care for the expression this is the very definition of a JASE to me.\n12/20/13 (1 play)",
    "timestamp": 1722376800
  },
  {
    "username": "quietcorn",
    "rating": 5.0,
    "comment": "In this game dice are rolled, then you spend a die to draft a tile from the area matching the number on the die used. There are firsties bonuses for completing areas of contiguous colors, but the larger the area is the more it's worth.\n\nThe turn order adjustment mechanism is somewhat frustrating as it relies on a particular type of tile being available and placable. The randomness really starts to bite being later in turn order and having your action options vanish. The graphic design is also very poor. The game visually looks very bland, and many grey tiles have buildings on them, each with their own unique ability yet no iconography on the tile indicating what the ability is.",
    "timestamp": 1722290400
  },
  {
    "username": "dderidex",
    "rating": 5.0,
    "comment": "\"Point salad\" accurately describes this. Not a bad game, I suppose, but so much going on and the theme isn't super engaging to me, so it doesn't rate highly for myself.",
    "timestamp": 1717624800
  },
  {
    "username": "heathbarATL",
    "rating": 5.0,
    "comment": "(BGA) Great use of dice to build out your kingdom. Not very thematic. The bad art and iconography makes many tiles hard to distinguish. Fairly fun but also repetitive.",
    "timestamp": 1716501600
  },
  {
    "username": "Qumpelblase",
    "rating": 5.0,
    "comment": "Die Abläufe sind meines Erachtens spannend und bieten sehr oft interessante Entscheidungen. Besonders schön ist, dass das Spielbrett zum Spielende brechend voll ist und man tatsächlich ein stattliches Königreich besitzt. Leider zieht sich das Spiel etwas in die Länge und ist dabei etwas monoton- andere Dice-Placement-Spiele fühlen sich da doch etwas frischer und vorallem moderner an. Auch wenn sich eine große Fangemeinde an diesem Spiel erfreut, hatte ich einfach das Gefühl, dass die ganze Mechanik in anderen Spielen optimiert wurde und dieses Spiel einfach nicht mehr zeitgemäß ist. Deshalb in unserer Spielrunde leider ein Flop.",
    "timestamp": 1715810400
  },
  {
    "username": "ultimoratio",
    "rating": 5.0,
    "comment": "One of the few Felds that has some strategic elements to it.",
    "timestamp": 1715119200
  },
  {
    "username": "JamesT",
    "rating": 4.5,
    "comment": "Multiplayer solitaire. Granted, lots of neat stuff is going on and the game has lovely production values, but I'd really rather play a game in which I care what the other players are doing.\n\nI also really don't like having to constantly consult the rulebook or player aids to figure out what the iconography for each yellow tile means.",
    "timestamp": 1714082400
  },
  {
    "username": "TimNT",
    "rating": 5.0,
    "comment": "zu viel Glücksspiel",
    "timestamp": 1713477600
  },
  {
    "username": "Flavorman2000",
    "rating": 5.0,
    "comment": "Game plays too long. 5 rounds is too much, 4 or more likely 3 rounds would probably be enough. Also way too many options. Constantly have to re-read the rules while I was playing to figure out what the knowledge tiles did or different house tiles did. Played it 3 times, not sure what all the fuss is all about? 3 times might have been enough for me on this one. Point Salad, not a fan of Feld games.",
    "timestamp": 1711753200
  },
  {
    "username": "adealisadeal",
    "rating": 5.0,
    "comment": "Its a decent game that I think is trying to do too much. In my opinion, get rid of the trading goods mechanic, and just make it plain tile laying. I saw it in some ways as a more advanced azul with more ways to score points. Instead, the goods makes it seem kind of like goods trading, kind of like azul, but not really sticking to anything. Ill say it again, just make this game tile laying, and its 10 times better. However, since there is so much more with the goods and dice, I just don't think its good.",
    "timestamp": 1710457200
  },
  {
    "username": "boardmathias",
    "rating": 5.0,
    "comment": "A little bit to heavy on the luck side, but to random.",
    "timestamp": 1710457200
  },
  {
    "username": "sculley",
    "rating": 6.0,
    "comment": "I expected (hoped, perhaps) that I would like this more than I do. After a half dozen plays it just seems to not be my thing.",
    "timestamp": 1762297200
  },
  {
    "username": "JSaa",
    "rating": 6.0,
    "comment": "A bit too (dice) luck based on my taste comparing to overall game weight.",
    "timestamp": 1762210800
  },
  {
    "username": "Emil1979",
    "rating": 6.0,
    "comment": "Like the game, so many paths to victory and options/choices on your turn. Wish this was reskinned to something more interesting as the theming and art is very weak.",
    "timestamp": 1761519600
  },
  {
    "username": "ImZhe",
    "rating": 5.5,
    "comment": "Personally don't really enjoy the dice mechanism",
    "timestamp": 1760911200
  },
  {
    "username": "Mr Mjeh",
    "rating": 6.0,
    "comment": "Decent but oh so similar to all other Feld games. Furthermore, takes much too long for what it offers.",
    "timestamp": 1760220000
  },
  {
    "username": "Oloovi",
    "rating": 6.0,
    "comment": "I see why people like this but I didn't get excited from this.",
    "timestamp": 1759788000
  },
  {
    "username": "m4p3t",
    "rating": 6.0,
    "comment": "BGA",
    "timestamp": 1759356000
  },
  {
    "username": "mhinto",
    "rating": 6.0,
    "comment": "2-4 players.",
    "timestamp": 1759096800
  },
  {
    "username": "AndBobsYourUncle",
    "rating": 6.0,
    "comment": "Own the Special Edition with Sundrop.\n\nNot sure how I feel about this. Being last place the entire time made for a poor first experience, came in far behind everyone else.\n\nHighest Score 181 so far.",
    "timestamp": 1758578400
  },
  {
    "username": "jellyfishjoe",
    "rating": 6.0,
    "comment": "Organizing the chits is a pain without bags, and having to look up what each yellow tile does in the rules is less than ideal. Both problems are easily solved with some upgrades, but I wasn't playing enough to warrant the effort, so sold.",
    "timestamp": 1756936800
  },
  {
    "username": "bunnyOo",
    "rating": 6.0,
    "comment": "to solitaire for me.\n\nhonestly take my rating with a grain of salt, most people love this game.\n\nI'm personally not into it.\n\nno big critiques , jus not for me like terra isn't either.",
    "timestamp": 1756936800
  },
  {
    "username": "themikeman",
    "rating": 6.0,
    "comment": "BGA: Much more fun than I thought it would be. Satisfying to fill out the board and collect the right tiles. Strategy seems to play out similarly every game, and I would not want to deal with all the tiles in real life. (8)\n---\nAfter many more plays, there is much more strategy than at first glance. My decision points have been whether to go for animal dominant strategy and whether to get certain yellow tiles that can open up some constraints. (8)\n---\nI'll still play this once in a while on BGA, but updating the score to reflect that I probably wouldn't want to play this in person due to setup and point counting woes. Even online, it's getting a little tiring as the arc of the game plays out similarly: open early game trying to establish the soft direction that you're going and then a constrained mid-end game where you're hoping for the right dice to come up to fill out your board. It's not a bad loop, just not one that I want to experience over and over again. (7)\n---\nIn person play was just as expected. Setup and component maintenance was a pain. Yes, bags and organizers would help but the gameplay isn't exciting enough to merit more investment. (6)",
    "timestamp": 1756936800
  },
  {
    "username": "janglemangle",
    "rating": 6.0,
    "comment": "its a euro... admittedly good. much like concordia, it's dry to the bone and hardly sees play\n\nbut unlike concordia, not every turn feels good. instead of \"oh yeaa, im doin the best i can be!!\" i think \"im a fool!! foolish!! gaahh!!\"",
    "timestamp": 1755208800
  },
  {
    "username": "Fiele",
    "rating": 6.0,
    "comment": "I think it's a ok game not more: I rather play something else.",
    "timestamp": 1755036000
  },
  {
    "username": "jrgalaxy",
    "rating": 6.0,
    "comment": "Just find it kind of boring... But still enjoy it once and a while?",
    "timestamp": 1754863200
  },
  {
    "username": "Destrio",
    "rating": 6.0,
    "comment": "Ultimately I had to move this on as tile-drafting and tile-laying on a very abstract board efficiently lost appeal. For my euro efficiency games, the puzzle has to be more complicated to hold interest.\n\nCritically acclaimed by BGG on the whole and my first Feld game. Going to this from Kingsburg felt like a next step toward Euro gaming.\n\nPros: Fun dice management mechanism. Few actions per turn makes this game easy to play. Variable board setup between the 5 phases of the game. Comprehensive rulebook.\n\nNeutral: Cheaper quality components keep cost down, but not bad quality. Building the estate isn't like going up a tech tree.\n\nCons: small cardboard chits and symbols which make it hard to read in some lighting. Lack of plastic bags and useless box tray make component separation and game setup a problem.\n\nDespite the variable setup, the game doesn't seem that deep strategically.",
    "timestamp": 1754776800
  },
  {
    "username": "HypnoticSpecter",
    "rating": 6.0,
    "comment": "Solid, easy to learn Euro game that's dryer than sandpaper. Only got it to the table once sadly, but it was an enjoyable experience",
    "timestamp": 1754690400
  },
  {
    "username": "Arnar146",
    "rating": 6.0,
    "comment": "bga",
    "timestamp": 1754517600
  },
  {
    "username": "Xyt4n",
    "rating": 5.5,
    "comment": "+ plays smoothly\n+ its nice to see your empire expanding\n+ while very simple, it has some depth for a few games\n+ combo play\n- plays very generic, like a typical euro point salad\n- gets samey fast\n- not much creative play possible\n--- multiplayer solitaire, focus on your tableau building. Not a very communicative time with humans\n\nAlternative: Better than Azul, worse than Keyflower",
    "timestamp": 1753567200
  },
  {
    "username": "Natt_Bjorn",
    "rating": 6.0,
    "comment": "Zamki z Burgundii: BIG BOX",
    "timestamp": 1753308000
  },
  {
    "username": "peteg1001",
    "rating": 6.0,
    "comment": "Ordered the upgrade set on kickstarter, eagerly anticipated!\n\n\nUpdate July 2025. No doubt a lavish update on the original, but it is quite a complex point salad of a game and I genuinely feel this is almost purely a game of luck, and perhaps a test of your ability to remember a complex scoring system. I am sadly not a fan, perhaps I shouldve tried the original online first or at least watched some how to play videos before spending all that money.",
    "timestamp": 1752444000
  },
  {
    "username": "willbeplayin",
    "rating": 6.0,
    "comment": "Excellent euro pointsalad with nice dice mechanics and multiple paths to victory! We've only had couple of games with 2 players and both times we actually misplayed a bit and noticed it at the end. When you get the hang of it, the turns go by really, really fast.\n\nSlight minus from the oddly coloured tiles and for me the board and the tiles could be a bit bigger actually. Tons of replayability with the different game boards and enough randomization so that each game is totally different.\n\nShows it age though and runs way too long.",
    "timestamp": 1751839200
  },
  {
    "username": "qoizu",
    "rating": 6.0,
    "comment": "Digital",
    "timestamp": 1750543200
  },
  {
    "username": "NotThatSalem",
    "rating": 6.0,
    "comment": "It's fine. Plenty of better games or there.",
    "timestamp": 1749592800
  },
  {
    "username": "getareaction",
    "rating": 6.0,
    "comment": "Reminded me strongly of Terra Mystica, but with a fractionally more accessible theme.",
    "timestamp": 1747778400
  },
  {
    "username": "Zouzou825",
    "rating": 6.0,
    "comment": "It's one of the famous euro game, but the luckines play an over important role here. Sometimes you may get stucked by your bad luck dices and your opponent takes very precious lands.\nI really doubt this game is so highly rated simply because of nostalgia. This is definitely my lowest scored SF game.",
    "timestamp": 1747605600
  },
  {
    "username": "CannonFodderTed",
    "rating": 6.4,
    "comment": "If you can make it past the learning curve of the iconography, this game is pretty good. Do not judge this simply based on the \"dice game\" roll & write version as the base game is far better. The strategies behind the different ways to collect victory points makes this interesting but what really hits the mark is the multiple ways to mitigate your dice rolls and the combos you can pull off if you do your actions in the right order. BUT, that is also this game's weak point because these decisions can easily trigger analysis paralysis. Often times I would have a whole plan mapped out in my head then when it got to my turn I either totally forgot how to execute my plan or I would have to change my plan because someone else took what I needed. The ability to mitigate the dice almost gives you TOO many options sometimes because for only having two dice, their are an incredible amount of ways you can play out your turn. Sometimes the simple actions feel like a waste. Their is an incredible amount of depth if you want to actually try looking at your opponent's boards and try to mess them up by taking what you think they need. Overall, quite an impressive design of a game. A bit fiddly with the iconogrophy, but once you get past that, it's quite enjoyable and quite a brain buster.",
    "timestamp": 1746482400
  },
  {
    "username": "Krisspear",
    "rating": 6.0,
    "comment": "Fun dice placement game. Would play again, but I don't need it in my collection.",
    "timestamp": 1745704800
  },
  {
    "username": "McLudo2811",
    "rating": 6.0,
    "comment": "2011",
    "timestamp": 1744927200
  },
  {
    "username": "DoubleMintDave",
    "rating": 6.0,
    "comment": "fine euro that is unfortunately hideous. also limited player interaction for a game that can go surprisingly longer than you'd expect.",
    "timestamp": 1744840800
  },
  {
    "username": "Gamegrunt",
    "rating": 6.0,
    "comment": "Go store find at half price. An excellent game especially for two. A four player game with experienced players might not seem overlong, but with new players it seems too long in game length.\n\nFound a copy at a low price and couldn't pass it up. So, after an 8 year hiatus, CoB is on the menu again. However, I downgraded my rating to a \"6\" due to my inescapable conclusion that CoB is simply too long for what it is.",
    "timestamp": 1744754400
  },
  {
    "username": "scarabaeus",
    "rating": 6.0,
    "comment": "Zu zweit eigentlich ein passables Spiel, ansonsten gibt es bessere Spiele. Grafisch völlig misslungene Neuauflage von Alea...",
    "timestamp": 1744149600
  },
  {
    "username": "boredaf",
    "rating": 6.0,
    "comment": "It was pretty interesting. Played with 3 other people and it was pretty long. If played with only 2 probably would have rated higher",
    "timestamp": 1742684400
  },
  {
    "username": "abhiroo",
    "rating": 6.0,
    "comment": "My first Feld, and it was as dull and unwieldy as I expected it to be.\n\nThe premise is deceptively simple - on each turn, roll 2 dice to get two action points values that you can then spend on acquiring tiles to your hand, placing tiles from your hand into your personal tableau, acquiring die modifiers, or selling goods tiles you may have accumulated during the game.\n\nFrom this basic setup, Feld gives you a veritable buffet of point sources to choose from - tiles upon tiles upon tiles replete with a plethora of icons and powers that are impossible to keep track of without a glossary, let alone learn how to ‘combo’ effectively in the manner the designer intended unless you’ve played the game dozens of times.\n\nSince each player’s tableau is so busy and convoluted, there’s little-to-no possibility of actually peering at your opponents’, attempt to parse theirs’ and engage in any sort of meaningful player interaction. You’re far too wrapped up in your own little puzzle of understanding and optimizing the combos in your own tableau.\n\nAt the end of the day, this was a classic Euro that promised little, and delivered even less.",
    "timestamp": 1741820400
  },
  {
    "username": "Aleogod",
    "rating": 5.5,
    "comment": "—> Castle of Burgundy Special Edition (2023)",
    "timestamp": 1741734000
  },
  {
    "username": "Zaungast",
    "rating": 6.0,
    "comment": "Casual game. Quality somewhere between under- and overproduction would have been appreciated.",
    "timestamp": 1740265200
  },
  {
    "username": "moneybee517",
    "rating": 5.5,
    "comment": "I don't get the hype? I feel the connections between the dice mechanism and building your city pieces doesn't result in interesting combos or escalates the feeling of becoming more powerful (unlike say White Castle).\n\nAdmittedly I am a theme/story first person, so this very dry euro and art style doesn't pull me in at all.\n\n2 players",
    "timestamp": 1738278000
  },
  {
    "username": "resolvecherry",
    "rating": 6.0,
    "comment": "Fine puzzle but nothing particularly exciting - wouldn't object too strongly to playing, but would never suggest it. I'm confident it's well-designed but nothing about it gets my heart racing, it feels pretty dry and flat throughout the entire game.\n\nThis edition, despite being a little \"uglier\" than the 2019/23 ones, I find somewhat easier to parse visually.",
    "timestamp": 1737846000
  },
  {
    "username": "Kater_Inna",
    "rating": 7.0,
    "comment": "3",
    "timestamp": 1761778800
  },
  {
    "username": "Zedronar",
    "rating": 7.0,
    "comment": "BGA",
    "timestamp": 1761606000
  },
  {
    "username": "Narieto",
    "rating": 7.0,
    "comment": "probably to go",
    "timestamp": 1760479200
  },
  {
    "username": "Murraculous",
    "rating": 7.0,
    "comment": "A solid 2-player Euro. But prone to analysis paralysis (with the wrong players), taking far too long (especially at higher player counts), and luck of the dice having a big impact on your experience. Not one I’m hankering to play on a regular basis over other Eurogames.",
    "timestamp": 1760306400
  },
  {
    "username": "Hovien",
    "rating": 7.0,
    "comment": "Library",
    "timestamp": 1759960800
  },
  {
    "username": "MorelliBuendia",
    "rating": 7.0,
    "comment": "Some people argue that it only makes sense as a 4p game, with all the tiles. I would NEVER play this at 4.\n\nAs a 2p game it is great. It can be played in less than an hour, it is very entertaining, and pretty replayable.\n\nI sold it some years ago and then a friend lent it to me recently. We played a 3p game and it felt too long, but then we played several 2p games and it's a very good medium euro. In case you want less randomness, maybe it would be good to take out half the tiles and display them so you can expect what can come out, but we don't really think it's necessary.\n\nMogul Scale: 2/B.",
    "timestamp": 1759528800
  },
  {
    "username": "Adripg3",
    "rating": 7.0,
    "comment": "2025",
    "timestamp": 1759356000
  },
  {
    "username": "Ironclad_Board_Gamer",
    "rating": 7.0,
    "comment": "Collection",
    "timestamp": 1759010400
  },
  {
    "username": "atlas64gaming",
    "rating": 7.0,
    "comment": "FEBRUARY 2025: 59TH",
    "timestamp": 1758492000
  },
  {
    "username": "gram_niebieskim",
    "rating": 7.0,
    "comment": "My BGG:\n10 - excellent game, always have a great time\n7 - enjoyable game, I'm willing to play again\n5 - not bad but it's not my cup of tea\n2 - won't play ever again",
    "timestamp": 1758060000
  },
  {
    "username": "bnordeng",
    "rating": 7.0,
    "comment": "I enjoyed this as I usually enjoy Feld games. There are a lot of little pieces working together and enough flexibility for players to do what they want to do, but I'm not sure that long term replay-ability will be great.\n\nAfter the second play, I think replay-ability might actually be there. However, I've realized that it really just is a big game of maximizing in the moment. I thought my wife would enjoy this game and she liked it okay in the first play, liking it more in the second play for her.\n\nI don't dislike CoB, but the more I play it the less I like it. I've traded away my copy and then tried it again a year later and it was okay but not good enough. I'm probably done with this game.\n\nThe first ever game to reappear in my collection by my purchase after I got rid of it... a used copy in excellent condition was available at a reasonable price. I'm looking forward to playing it again.\n\nMy rating for this game has gone from 8 to 6 to 8 and now I've put it at a 7. That feels like where it belongs. It's not a great game, but pretty good. I'll keep it and probably play it once or twice per year.",
    "timestamp": 1758060000
  },
  {
    "username": "iyanel",
    "rating": 7.0,
    "comment": "Juego buenardo, feo de cojones y un coñazo de separar las losetitas hexagonales del demonio a menos que tengas un pedazo inserto.",
    "timestamp": 1757628000
  },
  {
    "username": "cmdb002",
    "rating": 7.0,
    "comment": "While not the most new game (artwork certainly tells its age), the game still plays well. The strategy is definitely one that rewards maximizing turns and being flexible. The ability to string actions together like a chain using the dark green tiles or the tan tiles is definitely a benefit throughout the game. This is balanced by turn order (determined based on who has the most boats built) and resource abundance (coins and workers).\n\nThere is a lot to think about here which keeps it coming back and the turns are quick so you aren't sitting around too long. If there were any complaint, it would be the dice. The dice rolls do impact things. There are ways to counteract that, but ultimately, if you get some nice timely rolls, that will usually lead to some additional points.",
    "timestamp": 1756764000
  },
  {
    "username": "samsagace418",
    "rating": 7.0,
    "comment": "I hate dices. That being said, even if I am frustrated by some rolls, I just keep coming back for more. I really like that each game feels rather unique.",
    "timestamp": 1756591200
  },
  {
    "username": "Sitnam",
    "rating": 7.0,
    "comment": "It's alright. I suck horribly at it and don't know why, but I know it's my fault. That's a good early sign for gamers that something has legs.",
    "timestamp": 1755813600
  },
  {
    "username": "Ternal2",
    "rating": 7.0,
    "comment": "R3",
    "timestamp": 1755727200
  },
  {
    "username": "Oddball_FR",
    "rating": 7.0,
    "comment": "Après une partie. Intéressant et sympa, mais un peu trop long (à 3 joueurs). Les setups sont un peu ennuyants. A essayer à 2 joueurs pour voir.\nmechanical (nice ones) but themeless ... 0 immersion",
    "timestamp": 1755727200
  },
  {
    "username": "adi_venturer",
    "rating": 7.0,
    "comment": "Really good medium weight Euro game! The theme is painted on but the mechanics are really good and the design very tight. Would be down to play more.\n\n(Plays: 2)",
    "timestamp": 1755554400
  },
  {
    "username": "Rabo",
    "rating": 7.0,
    "comment": "B",
    "timestamp": 1754776800
  },
  {
    "username": "jcsan7",
    "rating": 8.0,
    "comment": "Pros: simple yet unique turn structure, satisfying gameplay, strategic, tactical, spatial, multiple board layouts, charming in its quirkiness\n\nCons: set up; length (50+ actions per player...); limited variety without expansions\n\nNeutral: I'm fine with the art and components, even if it's a bit dry",
    "timestamp": 1762210800
  },
  {
    "username": "laserdeathray",
    "rating": 7.8,
    "comment": "Played on BGA",
    "timestamp": 1762124400
  },
  {
    "username": "ismailegler",
    "rating": 8.2,
    "comment": "perfectly balanced dice & tile placement.\nhowever graphics make me feel distant in 21st century.",
    "timestamp": 1761865200
  },
  {
    "username": "San Il Defanso",
    "rating": 8.0,
    "comment": "For many years I thought I didn't like Stefan Feld, until I realized that I did like Castles of Burgundy...and Notre Dame...and In the Year of the Dragon. So while I'm not a particular fan, I've found a niche for his particular German design style. CoB isn't my favorite by him (that is likely In the Year of the Dragon), but is definitely the best one to start with. It's a more laid-back experience, and gives off lots of fun rewards for all the little ways to score points. You feel like you are always doing SOMEthing, which is more than can be said for Dragon or Notre Dame. It's also a good two-player experience, which makes me wonder why there are comparatively few Eurogames that fill that niche.\n\nAnyway, Feld really cracked something open here in how he uses dice. Games like this often struggle with a massive number of options, but the dice keep you focused on just a few each turn. That's clever! And while the game is too long, it at least has a length that gives the player plenty of runway for making something happen.\n\nIt's not perfect, of course. It really is too long, and I think that's one reason it has proven a hit on BGA and Yucata.de: it plays REALLY well async. And while it does okay with the castle-building feeling it's a pretty drab theme. But this is still a fun game, and one that has proven quite influential over the last 10-15 years.",
    "timestamp": 1761865200
  },
  {
    "username": "Jesenberg",
    "rating": 8.0,
    "comment": "B",
    "timestamp": 1761256800
  },
  {
    "username": "logopolys",
    "rating": 8.0,
    "comment": "alea number 14\n\nI don't usually go in for dice games, but this was oddly satisfying. Largely, I can probably attribute such satisfaction to the sheer quantity of things that any individual die roll could interact with. There were some tough decisions, which I liked, and some strategic pay-offs that needed to be planned, which were odd since almost all of the game play was tactical. The endgame is a little bit of a mess (read: points salad), but generally pretty entertaining.",
    "timestamp": 1761084000
  },
  {
    "username": "Minh_Nguyen",
    "rating": 7.5,
    "comment": "Awaken Realms reprint (just cardboard tiles & sundrop castles). The deluxe production and expansion content should hopefully breathe some life into this game. Base game is fun in the same way that sudoku is fun; neat logical sequences, but ultimately becomes extremely same-y, at least the way that I play the game.\n\nUpdate: A really fantastic experience playing with this edition. Rating probably goes up to 8, maybe 8.25. One minor minor complaint is that the VP track doesn't really handle miniatures well when two players are on the same spot. Also, having moving castles on the boat track is a bit of a headscratcher, breaks a bit of immersion.",
    "timestamp": 1760997600
  },
  {
    "username": "Hynnot",
    "rating": 7.5,
    "comment": "VENDER",
    "timestamp": 1760911200
  },
  {
    "username": "Northern_Gamer",
    "rating": 8.0,
    "comment": "Favourite Feld game so far. I even got non gamer to play this, and they loved it. Straight forward rules. An excellent game.",
    "timestamp": 1760738400
  },
  {
    "username": "cypar7",
    "rating": 8.0,
    "comment": "Too long, not enough variety.",
    "timestamp": 1760738400
  },
  {
    "username": "Say_Yoho",
    "rating": 8.0,
    "comment": "PIFFed to\n\nBruceJackson",
    "timestamp": 1760306400
  },
  {
    "username": "igor_f",
    "rating": 8.2,
    "comment": "2-4\nNoEng",
    "timestamp": 1760220000
  },
  {
    "username": "TheNameless0ne",
    "rating": 8.0,
    "comment": "tokens bagged; some xpacs unpunched; all in main box",
    "timestamp": 1760133600
  },
  {
    "username": "jackcoostow",
    "rating": 8.0,
    "comment": "Actually have the replempented version",
    "timestamp": 1759960800
  },
  {
    "username": "botticus",
    "rating": 7.5,
    "comment": "I have aesthetic/functional complaints about every version of this game but it's solid mechanically. Generally consider it a solid 7 but the solo in the special edition bumps it up a bit. Not sure if it will be worth keeping that behemoth box though.",
    "timestamp": 1759701600
  },
  {
    "username": "gapstone3",
    "rating": 8.0,
    "comment": "Went up to Special Edition & rehomed in UK Maths Trade.",
    "timestamp": 1759528800
  },
  {
    "username": "Ddyraw",
    "rating": 8.0,
    "comment": "Played online but never IRL, could see it as a good family game, but not one that got tabled much.",
    "timestamp": 1759442400
  },
  {
    "username": "BirdfluNuggetz",
    "rating": 8.0,
    "comment": "Timeless classic. I'll play it any time.",
    "timestamp": 1759442400
  },
  {
    "username": "FOTCH",
    "rating": 8.0,
    "comment": "Great mix of Troyes, 7 Wonders and Through the ages.",
    "timestamp": 1759356000
  },
  {
    "username": "CotB",
    "rating": 9.0,
    "comment": "Rankings\n31st Best Game 2018\n23rd Best Game 2019\n20th Best Game 2020\n25th Best Game 2021\n32nd Best Game 2022\n28th Best Game 2023\n26th Best Game 2024\n17th Best Game 2025",
    "timestamp": 1762606560
  },
  {
    "username": "RVW0711",
    "rating": 8.8,
    "comment": "Haven't played this game enough. I suspect with more plays, the rating might rise slightly, as it seems right up my alley.",
    "timestamp": 1762383600
  },
  {
    "username": "Karotka",
    "rating": 8.6,
    "comment": "Players: 2 / 3 4\nLength/Weight: 30-90 minutes/2.97",
    "timestamp": 1762383600
  },
  {
    "username": "Nuvium",
    "rating": 9.0,
    "comment": "excellent",
    "timestamp": 1762297200
  },
  {
    "username": "Timstikkers",
    "rating": 9.0,
    "comment": "Wait other people have turns in this game too? Let me place this tile first and we'll discuss...",
    "timestamp": 1761951600
  },
  {
    "username": "Sly_Quick",
    "rating": 8.8,
    "comment": "~20th Aniversary Edition~\nContains Expansions - 2,5,8,6,9,10\n\n(Folded Space Insert)",
    "timestamp": 1761951600
  },
  {
    "username": "rongbeo93",
    "rating": 8.5,
    "comment": "One of my favorite Stefan Feld designs, The Castles of Burgundy is a charming euro that doesn’t look like much but packs a serious punch. The gameplay is deep and satisfying, full of clever combos and strategic planning, with just the right amount of tactical flexibility when the dice don’t go your way. Despite my consistently terrible rolls, I always have a great time playing this classic.",
    "timestamp": 1761865200
  },
  {
    "username": "jeffrey_a_meunier",
    "rating": 9.0,
    "comment": "It's much less complicated than it looks. After learning it one time, you won't need to refer to the rule book except to look up the tile effects.\n\nThis game is a lot more fun than I thought it would be.\n\nEdit: After 9 plays, increasing from an 8 to an 8.5.\nEdit: After 13 plays it's probably my favorite game right now.\nEdit: After 30 plays it's not my favorite but I'll still give it a go when my wife wants to play it.",
    "timestamp": 1761778800
  },
  {
    "username": "ditterio",
    "rating": 9.0,
    "comment": "Classic! The special edition with all the expansions makes it even better.",
    "timestamp": 1761692400
  },
  {
    "username": "Chris_boardgames",
    "rating": 8.9,
    "comment": "#2",
    "timestamp": 1761429600
  },
  {
    "username": "Derianhorgen",
    "rating": 9.0,
    "comment": "SpielboxRating 7-9, av. 8,10",
    "timestamp": 1761429600
  },
  {
    "username": "fourquartets",
    "rating": 9.0,
    "comment": "Insert:\nMeeple Realty\n\nExpansions:\n2nd Expansion – New Hex Tiles\n4th Expansion – Monastery Boards\n5th Expansion – Pleasure Garden\n8th Expansion – Trade Routes\n10th Expansion – Solo\n\nNotes:\nThis never sees IRL playtime but I don't care. It's a classic, I love it, and I'm happy for it to take up space on my shelf. If you have not had a chance to play this game, seek it out online or in person but make sure to give it a couple plays. I actually bounced off it the first time, but with an understanding of the tiles and the flow of the game, it's a brilliant, tense, Euro puzzle.\n\n[SF]",
    "timestamp": 1761429600
  },
  {
    "username": "Dave316",
    "rating": 9.0,
    "comment": "A game that I sold years ago early on, but am SO glad to have repurchased. Loving it so much this time around and is just a classic. Looking forward to more plays as there is a lot of game here with some addictive gameplay through combos that feel so satisfying.",
    "timestamp": 1760824800
  },
  {
    "username": "wooloo1",
    "rating": 9.0,
    "comment": "A stone cold classic deserving of all its accolades, and I am no fan of MPS optimization puzzles. Burgundy is just so lean and buttery smooth, yet full of juicy decisions. It's also Exhibit A that theme in modern euros is over-rated.\n\nDraw bags are a good quality of life improvement for randomizing the tiles.",
    "timestamp": 1760824800
  },
  {
    "username": "RisingHellkite",
    "rating": 8.5,
    "comment": "Fantastic game. Only down sides are the size of tiles and general astetic being not the most exciting. But has it where it counts with awesome game play and replay ability",
    "timestamp": 1760652000
  },
  {
    "username": "strongbadia",
    "rating": 9.0,
    "comment": "X",
    "timestamp": 1760479200
  },
  {
    "username": "YoLYcmqZ",
    "rating": 9.0,
    "comment": "Thoughts: Love this game. Combos are satisfying when you chain action after action and everything clicks. Play a ton on BGA—quick and engaging. Wish it hit the table more IRL. Maybe the setup doesn't feel worth the payoff compared to heavier games? Either way, it's excellent and always delivers.\n\nTag(s): Dice Drafting, Engine Builder, Classic Euro\nBest Player Count: 1, 2-4, {2}\nRating: 8, +1.0\nOwn: Physical, Digital, BGA\nVersion: The Castles of Burgundy: SE",
    "timestamp": 1760392800
  },
  {
    "username": "Euroman",
    "rating": 9.0,
    "comment": "Be a 10 if it weren't for the dice. Best with 2 or 3.\nToo much downtime and too long with 4 players.",
    "timestamp": 1760392800
  },
  {
    "username": "Ari88",
    "rating": 8.5,
    "comment": "Upgraded to Special Edition in 2023",
    "timestamp": 1760306400
  },
  {
    "username": "baguio_beans",
    "rating": 10.0,
    "comment": "K",
    "timestamp": 1762657620
  },
  {
    "username": "Darigaaz",
    "rating": 10.0,
    "comment": "My favorite game ever. Yes it is ugly but the game balance and mechanism is perfect to me. What appeals the most to me is how it succeed to have quite a lot of chance in it while providing way for the player to waork around this chance. In fact this is the core purpose in the game : take the best decisions to maximize your chance and reduce the impact of bad chance.",
    "timestamp": 1762629720
  },
  {
    "username": "davidxiang",
    "rating": 10.0,
    "comment": "骰子驱动，好玩！",
    "timestamp": 1762383600
  },
  {
    "username": "mimiwo",
    "rating": 10.0,
    "comment": "Prefer with two, but good with more. Lots of strategy and variation",
    "timestamp": 1761865200
  },
  {
    "username": "rywoods",
    "rating": 10.0,
    "comment": "Everything clicks. Everything feels good. Lots of decisions in relation to what will benefit you in future rounds and keeping your options open, not just what seems best at the time.",
    "timestamp": 1761778800
  },
  {
    "username": "LuisEstepa",
    "rating": 10.0,
    "comment": "Juegazo pero mejor a dos para evitar entreturno, ademas la interacción es baja asi que añadir tirmpo extra no tiene sentido.",
    "timestamp": 1761778800
  },
  {
    "username": "bonster20",
    "rating": 10.0,
    "comment": "[won in an auction; got two goods and all hex tile drawstring bags from BGG Store]\n[upgraded to Special Edition and sold at garage sale]",
    "timestamp": 1761778800
  },
  {
    "username": "shaveandahaircut",
    "rating": 10.0,
    "comment": "[125 plays] This is a great tech tree dice game, and anyone who plays it like solitaire is going to lose. You have to make a plan and develop/adjust that plan in accordance with what your opponent is doing. I really enjoy this one.\n\nYucata implementation is responsible for the huge number of plays. Fast and elegant, so much less upkeep than playing tabletop, and a meditative quality to the turns. It's the gaming equivalent of raking a zen garden with lemonade on the bench and a nice summer breeze out in the yard.\n\nOriginally played on the Civil War Trip October 2012. Most recent play Oct 2025",
    "timestamp": 1761778800
  },
  {
    "username": "HelgiSam",
    "rating": 10.0,
    "comment": "Elegant game. Love the old-fashioned version without useless bling-bling.",
    "timestamp": 1761606000
  },
  {
    "username": "BrutusA",
    "rating": 10.0,
    "comment": "Aesthetic: 2\nMechanism: 2\nInvolvement/length/fluid: 2\nReplayability: 2\nOther: 2",
    "timestamp": 1761519600
  },
  {
    "username": "Rasdel",
    "rating": 10.0,
    "comment": "A game that keeps giving. The look grows on you eventually. Mechanically it is incredible, having a dice centric mechanism where each roll is an opportunity to a flood of points just feels amazing every turn.",
    "timestamp": 1761519600
  },
  {
    "username": "Eldard",
    "rating": 10.0,
    "comment": "An excellent and challenging development game, and one of the games that elevated Stefan Feld into the A-list of game designers. Luck-of-the -dice is a factor, though that can be mitigated to some extent through the spending of 'worker' tokens. The wide variety of icons may be overwhelming to the new player at first, but familiarity doesn't take long to develop. It's not one of my favorite eurogames, but I definitely enjoy playing it.",
    "timestamp": 1761343200
  },
  {
    "username": "el_crosso",
    "rating": 9.9,
    "comment": "Yeah, what can we say? Is it Stefan's best? We do think so and, besides looking not too good even, the label classic is there for a reason. The different tactics to go for, no game is the same, easy rules, but still, very much a game for gamers and non-gamers alike is a great achievement. Must have classic from Feld",
    "timestamp": 1761084000
  },
  {
    "username": "Edydex",
    "rating": 10.0,
    "comment": "Have the extra boards and White Castles expansions - great game",
    "timestamp": 1760392800
  },
  {
    "username": "dwacker",
    "rating": 9.5,
    "comment": "I'm not sure if this is my favorite Feld game, but it is probably the one that I play the most. It is fantastic with two. In fact, I do think it is his best game for two. I am always amazed what this designer can do with dice, which comprise my least favorite game mechanics.",
    "timestamp": 1760220000
  },
  {
    "username": "syedshowmic",
    "rating": 9.5,
    "comment": "Note:\nPhysical copy (base)\nBGA (base)\n\nOrganizer: not required\n\nCull:\nRelegation zone",
    "timestamp": 1759960800
  },
  {
    "username": "Mr_Boardgames_com",
    "rating": 9.7,
    "comment": "Les Châteaux de Bourgogne est l’un des meilleurs jeux de sa catégorie, offrant un équilibre parfait entre hasard et stratégie, une grande rejouabilité et une profondeur tactique remarquable, le tout sublimé par une édition visuellement réussie.\n\nL'avis complet : https://mr-boardgames.com/jeux-inities/les-chateaux-de-bourg...\n\nReview also in english",
    "timestamp": 1759788000
  },
  {
    "username": "gpli_11",
    "rating": 10.0,
    "comment": "Your options are guided by fortune of your dice as you expand your estate in pursuit for prosperity.\nEach turn leaves me agonising over whether to open a new trading sea route, grow my livestock, invest in knowledge, or construct buildings.\n\nThough often dismissed as ugly, I always had a soft spot for its charming watercolour presentation.\n\nThis was the game that ignited my Feld fanaticism and it will always hold a special place in my collection.",
    "timestamp": 1759442400
  },
  {
    "username": "FaytParkour",
    "rating": 10.0,
    "comment": "Castles of Burgundy is a masterpiece that I’ve changed my mind on over the last few years. It has elegant design, and the new special edition has a solo mode that works great. Check it out!",
    "timestamp": 1759183200
  }
]