[
  {
    "username": "V1vi",
    "rating": 1.0,
    "comment": "10+",
    "timestamp": 1757282400
  },
  {
    "username": "zmartianov",
    "rating": 1.0,
    "comment": "This game promotes duels between two people",
    "timestamp": 1754604000
  },
  {
    "username": "Mageknight12",
    "rating": 1.0,
    "comment": "7 Wonders Duel gives the illusion of choice, but most options are clearly suboptimal, funneling players into narrow paths. Military and science victories sound exciting but are rarely viable, making them feel more like distractions than real strategies. Overrated",
    "timestamp": 1750456800
  },
  {
    "username": "Kigerspirit",
    "rating": 1.0,
    "comment": "I honestly do not see how this game is ranked so highly, unless people secretly just like destroying other people’s souls. My first couple of plays were great! I could see all the hype! Then, 10-20 games in, I began to see just how unbalanced yet obvious the game play is. Literally one missed card in the first phase and you’re screwed with no hope of ever catching up to the runaway leader. Some “Take That” is fine, just not to the point that I start questioning all of my previous life decisions.",
    "timestamp": 1748469600
  },
  {
    "username": "Scifi66",
    "rating": 1.0,
    "comment": "Two player 7 Wonders adaption. Hugely over-rated by bgg, it shouldn't be in the Top 20 games of all time! Note it is definitely better (3) in an online implementation like BGA as you don't have to deal with the annoying setup. However its flaws remain apparent after 15 face to face and 10 online games it is on the trade pile.\nx Wonders giving another turn upon completion are auto picks\n– During the game the yellow cards are just too good, they free the need to take basic/advanced resource cards and give access to more money. The resource tightness of original 7 Wonders disappears here.\nx Too much luck for my taste, turn up a card that your opponent wants and game over.\n– On table, considerable setup time for each age versus total gameplay time",
    "timestamp": 1737586800
  },
  {
    "username": "Zulkijind",
    "rating": 1.0,
    "comment": "LOTR edition better",
    "timestamp": 1736982000
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "I was expecting something slightly better than 7 Wonders. Instead it's 7 Wonders with a ton of garbage cluttering it up. And I guess that bothers me more than the empty minimalistic original, now there's crap everywhere making it even less interesting than before. Like it's trying to be a Civ game but got completely lost along the way, probably from visiting Euroland. Even the promise of the circular borrowing/attack system is lost (though I don't think it was executed that great), now it's just boring transactions with the bank.\n\nHate to say it, but maybe the original 7 Wonders was better.",
    "timestamp": 1731538800
  },
  {
    "username": "Rexelf",
    "rating": 1.0,
    "comment": "Worst game ever.",
    "timestamp": 1718402400
  },
  {
    "username": "mokujin141",
    "rating": 1.0,
    "comment": "After having played over 650 different board games, I can still say that 7 Wonders Duel is one of the worst I have ever played. It's not even really a game. It is more of an activity since it is so on rails that it simply plays itself.\n\nIf you are looking to recreate the 7 Wonders experience at 2 players, I highly recommend using the 2 player rule set that came with the original 7 Wonders.",
    "timestamp": 1714600800
  },
  {
    "username": "Arnaud3013",
    "rating": 1.0,
    "comment": "Based on blocking other player, we hate that.",
    "timestamp": 1699743600
  },
  {
    "username": "dakotamassie",
    "rating": 1.0,
    "comment": "Is there anyway i can rate this game a zero?",
    "timestamp": 1692914400
  },
  {
    "username": "gameyspirits",
    "rating": 1.0,
    "comment": "Boring... snore....",
    "timestamp": 1684792800
  },
  {
    "username": "Akado",
    "rating": 1.0,
    "comment": "Very similar to 7 Wonders in that your first game is kinda a lost cause, since you have no idea what works or is viable, and there are suboptimal moves that severely diminish your effectiveness if taken (but aren't obvious to a first-time player).\n\nAfter playing again, I think the draw has a large influence on the games, resulting in some games that feel lost the entire way and never really getting better. With 3 plays, it felt like there is a \"best\" way to play, and I don't really feel that will lead to longevity, so I do not need to own this.\n\nI don't enjoy how the first player has a clear advantage in Age 1 (they get first choice of all revealed cards plus initial six).\n\nI don't enjoy how \"extra turn wonders\" are amazingly better than anything else.\n\nI don't enjoy how unfun the game can be to be revealing all the cards for your opponent in Age I, and then seeing them rack up tons of science cards, and knowing the entire rest of the game you have a sword hanging over your head. Simply because you didn't go first, or couldn't afford to burn an ETW to reverse a random decision before the game started.\n\nI simply don't enjoy this game, nor what it offers.",
    "timestamp": 1680559200
  },
  {
    "username": "Rexbordercollie",
    "rating": 1.0,
    "comment": "Garbage game, pure luck",
    "timestamp": 1679266800
  },
  {
    "username": "DanDV",
    "rating": 1.0,
    "comment": "This game is a bimbo. Good looking design and components that amount to zero depth. After a few games, it moves lightning fast because the choices are just obvious, and the game quickly becomes entirely dependent on card draws. What a disappointment. It is so highly rated here on BGG, and my local game store staff raved about it. Honestly, cribbage produces more excitement and strategy. Backgammon even!",
    "timestamp": 1669158000
  },
  {
    "username": "DSix",
    "rating": 1.0,
    "comment": "This game is all setup and no pay off.\n\nInteraction is low and nothing really happens.\n\nGo play something else.",
    "timestamp": 1664402400
  },
  {
    "username": "Gemaskerde Muchacho",
    "rating": 1.0,
    "comment": "My first 1 I gave to a game ..\nWhat a horrible experience...\nJust stupid luck...\nTake a tile take a tile take a tile ..",
    "timestamp": 1636844400
  },
  {
    "username": "jiifigment",
    "rating": 1.0,
    "comment": "This is NOT 7 wonders! Not even close! We've played that game a ton for years and own every expansion. It is our family fave by far! We bought this because of the rating on this website. Played it 3 times, thinking it could not possibly be as one-dimensional as it initially seems. If you don't get resources in age one you're doomed. 7 wonders has many avenues to win. In this version, science is too limited, so not a real option. Progress tiles are nearly impossible to get. The chain construction symbols unavailable to you at least 50% of the time if you're playing an intelligent player. So the only way to win is to get lucky and have resources available to you early on, and collect them. We are unlikely to ever play this again. Cute little portable package though. Not fond of the mini cards. I wish I could return it.",
    "timestamp": 1614121200
  },
  {
    "username": "Msquared",
    "rating": 1.0,
    "comment": "I really enjoy the original Seven Wonders, but I hate this version. I don't like the mechanics and I utterly hate that the game can end abruptly.",
    "timestamp": 1607641200
  },
  {
    "username": "Jirot",
    "rating": 1.0,
    "comment": "Hrál jsem 5x. Zklamání. Hra nemá spád, nemá žádnou logiku, pravidla jsou divně vykonstruovaná a nelogická. Prostě děláte nějaké úkony, ale bez emocí, protože úkony nedávají hlubší smysl, nevíte proč je děláte. Nezaujala mě ničím a nemám chuť jí hrát dál, protože mám silný pocit, že v ní nic neobjevím. Oproti jiným hrám, které se opakovaným hraním stále rozvíjí a zkušenostmi objevujete nové strategie je toto špatná hra. Když k tomu připočítám absolutně nejasná pravidla (i v diskuzích je vidět, že každý to hraje trochu jinak) a nulový spád/napětí tak je výsledek totální odpad. Nechápu místní hodnocení.",
    "timestamp": 1605654000
  },
  {
    "username": "TheShays",
    "rating": 1.0,
    "comment": "It was too unbalanced whoch made it practically unplayable. We tried three times and then sent it back. I hated it.",
    "timestamp": 1596319200
  },
  {
    "username": "chrboesen",
    "rating": 1.0,
    "comment": "Multi-player solitaire. My daughter age 10 liked it a little. Played 10 times.",
    "timestamp": 1583362800
  },
  {
    "username": "NemoG",
    "rating": 1.0,
    "comment": "Hated the game, as if you get a certain card in round 1 you won the game no matter what. not well balanced.",
    "timestamp": 1555711200
  },
  {
    "username": "bevatron",
    "rating": 1.0,
    "comment": "Lots of luck, especially when you get forced to pick a card, which reveals so many goodies for your opponent.",
    "timestamp": 1540418400
  },
  {
    "username": "BlueSapphire",
    "rating": 1.0,
    "comment": "This game is waaaaay too mean. I'd much rather just play 7 Wonders.",
    "timestamp": 1532383200
  },
  {
    "username": "StercusCaput",
    "rating": 1.0,
    "comment": "I do not understand why people love this game. If anyone asks me to play, I will challenge them to a duel.",
    "timestamp": 1514588400
  },
  {
    "username": "diukon",
    "rating": 1.0,
    "comment": "Card games are bad.",
    "timestamp": 1506290400
  },
  {
    "username": "Hoss Cartwright",
    "rating": 1.0,
    "comment": "Kaka in a box. Only good for cats to sleep in. No other purpose here.",
    "timestamp": 1467410400
  },
  {
    "username": "Sirell",
    "rating": 2.0,
    "comment": "Honestly, this game is what it looks like when you play solitaire with two people. The game mostly plays itself when you calculate the cards that you can take and what your opponent can take - the only factor of consideration are the face-down cards, which essentially means that either the game is already decided through careful calculation of cards, or you Heart-Of-The-Cards topdeck and turn over a facedown card that helps you win. Feels like there's not a lot of room for skill expression.\n\nYou can use your Wonders to circumvent that to some extent by skipping your opponent's turns, but me and my wife have personally found it hard to be excited about playing this game when you're just slowly watching yourself lose... until you turn over a card that demolishes your opponent's careful calculation and you just coast to a win due to RNG.\n\nPrefer Splendor Duel as a two-player game - there's much more agency there.\n\nI do not understand this game's high rating and popularity at all.",
    "timestamp": 1762383600
  },
  {
    "username": "AGRBloom",
    "rating": 2.0,
    "comment": "This was our first board game year ago and at the time i think this was not a great choice. I am willing to try this game again in near future because i heard only the best about it but definitely do not buy this as your first choice",
    "timestamp": 1748642400
  },
  {
    "username": "au4au4g4",
    "rating": 2.0,
    "comment": "300/700",
    "timestamp": 1740870000
  },
  {
    "username": "EpicFrenzy",
    "rating": 2.0,
    "comment": "Say what you want but I honestly hate it. So much better 2 player games out there to be honest. Feels like a mockery of 7 wonders due to constant rock paper scissors type picking. Also zero card drafting, which I think is fundamental to the fun of 7 wonders. The hate drafting is a big turn off for me. Avoid if you are a peaceful player or cooperative player like myself.",
    "timestamp": 1737932400
  },
  {
    "username": "BoardGamingCouple",
    "rating": 2.0,
    "comment": "2/5\n\nafter repeated plays, very boring. the game is very random and luck dependent. It takes awhile to play for what it is. Fiddly setup. played 100+ times.",
    "timestamp": 1735254000
  },
  {
    "username": "Rasp727",
    "rating": 2.0,
    "comment": "Too drawn out to set up for what you get out of it.",
    "timestamp": 1734217200
  },
  {
    "username": "Carlcast",
    "rating": 2.0,
    "comment": "Juego exclusivo de 2 jugadores, mítico por ser uno de los mejores juegos exclusivos a 2 . Lo intente varias veces y no me encajó, muy azaroso y desbalanceado para ser un duelo. Hay mejores juegos para mi forma de ver, es mi opinión.",
    "timestamp": 1722463200
  },
  {
    "username": "mike_inprinciple",
    "rating": 2.0,
    "comment": "Extremely mean game. That makes it uninteresting for me. Might be a great game for others. For me it's not fun at all.",
    "timestamp": 1715724000
  },
  {
    "username": "Capitolcpt",
    "rating": 2.0,
    "comment": "Didn't vibe. Felt overly built for the sake of strategy.",
    "timestamp": 1702767600
  },
  {
    "username": "NormandyWept",
    "rating": 2.0,
    "comment": "There's no actual game here. Between two opponents who have understood the overly-convoluted rules as well as one another, the game will be decided by the luck of the unseen card you have to flip for your opponent.",
    "timestamp": 1702767600
  },
  {
    "username": "Luneaire",
    "rating": 2.0,
    "comment": "I'm perplexed by the high rating of this game on BoardGameGeek. It gives you the illusion of having choices, but in reality, it often boils down to a stark binary outcome: either you dominate or get dominated. There's little room for a middle ground or a chance to stage a comeback.",
    "timestamp": 1698879600
  },
  {
    "username": "drunkcrunkfranken",
    "rating": 2.0,
    "comment": "Trite game. Just another bland euro with no teeth. Catch-up mechanics on top of catch-up mechanics so you can pretend that you had a tense match when the game is designed to have artificial Δ1VP endings. Setup is also overly fiddly and convoluted for what you get.",
    "timestamp": 1694642400
  },
  {
    "username": "Maakt niet uit",
    "rating": 2.0,
    "comment": "Tried it multiple times since it is rated so good. But the annoying little cards that cannot be picked up from the table kept laying it out over the years. Every time I did though, I discovered that seeing the cards you'd like to play but not being able to is more annoying than anything else. The game is so involved with luck where it suggests strategy that it makes me itch. I love strategy games, but this is a luck game at it's core. Nothing is as frustrating as trying to make chains and not being able to, having wonders that require resources that you can never produce or trying to get matching science cards that your opponent simply trashes because they do not even have another option to play. How can this be called strategy if you only ever have about 3 to 5 moves to pick from?",
    "timestamp": 1693346400
  },
  {
    "username": "Cheucheuh",
    "rating": 2.0,
    "comment": "So much Luck. No strategy.",
    "timestamp": 1693087200
  },
  {
    "username": "mcflurriez",
    "rating": 2.0,
    "comment": "This game is actually broken, the first player advantage is beyond repair. After playing a lot of games with various house rules to try and tweak it in the right direction, there is no saving it. I have no idea why this made top 20 games.",
    "timestamp": 1688421600
  },
  {
    "username": "Yokiboy",
    "rating": 2.0,
    "comment": "This one felt like much more of a game than the original, and I'd be willing to play it again. You are faced with some interesting decisions, and gameplay was fairly tense. It still doesn't compare to the type of two player games I love, and therefore my desire to play it some more is nill.",
    "timestamp": 1678575600
  },
  {
    "username": "penguinbirdies",
    "rating": 2.0,
    "comment": "This game has depth and tons of strategy but has 0 fun factor. Drawing a card each turn is mechanically as fun as watching water evaporate from your driveway. This game is a prime example of how strategy does not always equal fun. Games need to be first and foremost FUN! Definitely not a game for people that enjoy fun things in life and more for someone that just loves spending a weekend alphabetizing and filing their previous ten years of various statements.",
    "timestamp": 1676761200
  },
  {
    "username": "disposable.superhero",
    "rating": 2.0,
    "comment": "6/27/2020 changing from 9 to 8 because this is a\"game that \"enjoy playing and would suggest\" but I am not sure I \"always enjoy playing it\".",
    "timestamp": 1675983600
  },
  {
    "username": "JSMA",
    "rating": 2.0,
    "comment": "Langweilig\nKartenglück",
    "timestamp": 1672786800
  },
  {
    "username": "Philbeert",
    "rating": 2.0,
    "comment": "Sold via Facebook",
    "timestamp": 1661032800
  },
  {
    "username": "Sergey159",
    "rating": 2.0,
    "comment": "Просто не зашла...",
    "timestamp": 1660773600
  },
  {
    "username": "Miaaaaa",
    "rating": 2.2,
    "comment": "2",
    "timestamp": 1652306400
  },
  {
    "username": "buderix80",
    "rating": 2.0,
    "comment": "It's okay. Nothing mind blowing. Boring. The draftig is kind of a lucky mechanism, that ends in hate draftig. Not for me.\nWon't play it again.",
    "timestamp": 1650405600
  },
  {
    "username": "Gudradain",
    "rating": 2.0,
    "comment": "I don't know what went wrong here... The game had great promises and everything fell apart.\n\nWe started playing and one player would always finish with a huge advantage in resources after the first round. At this point, the game was basically over but we still had to play the second and third round.\n\nThere are 3 win conditions: point, military and science\n\n- Military is skewed in favor of the player with the most resources since that player will be able to buy the best/most cards and it's easy to stop a player from doing it so it's not a real win condition.\n- Science is easy to stop so it's not a real win condition\n- Point is skewed in favor of the player with the most resources since that player will be able to buy the best/most cards\n\nSo, in the end there is only one win condtion: \"who has the most resources\".\n\nYou can only get resources in round 1 and round 2. Buying resource in round 2 will be harder if you don't have as much as the other player in round 1.\n\nSo, in the end, the game is usually done by round 1 and will just drag on for 2 more rounds.",
    "timestamp": 1625781600
  },
  {
    "username": "DanFred",
    "rating": 2.0,
    "comment": "Played once and didn't care for it at all. I like card drafting games, but there are much better ones out there.",
    "timestamp": 1621720800
  },
  {
    "username": "werekin",
    "rating": 2.0,
    "comment": "Unsatisfying follow-up to the sensational card drafting experience. There was so much potential here with cleverly expanded trade rules, card placement for draft picks and solidly maintained iconography. Sadly this game has fallen flat with almost everyone I've played it with. This is largely due to the ill considered \"opponent skips turn\" outcome attached to building half of the wonder cards. Taking bonus turns from fulfilling the resource order requirements on wonder cards is so slanted in favour of the player who gets to these first, that in unsettles almost all games of Duel. Whoever imagined this was still a serviceable idea in 2015 needs to be taken out to the barn and shot! It joins the ranks of title I've researched, bought, played, taught and had to flip. Stick to the original game, which many still consider a classic and features a playable 2 player mode.",
    "timestamp": 1612652400
  },
  {
    "username": "KaSaKakaDemola",
    "rating": 2.0,
    "comment": "SU&SD recenzja, stara ale wciąż aktualna - \"brak seksu\" w trzeciej epoce, szkoda rozkładać.",
    "timestamp": 1607900400
  },
  {
    "username": "s-man",
    "rating": 2.0,
    "comment": "Played twice, two horrible experiences. Doesn't do the original any justice at all.",
    "timestamp": 1604530800
  },
  {
    "username": "Hardysmom",
    "rating": 3.0,
    "comment": "I cannot comprehend the love people have for this game. I can never get the cards/resources I need in order to build anything and when I do, my opponent ends up getting that card that lets him take something away from me. And there I sit, for the remainder of the game, not being able to build a dang thing. HATE this game. Tossed it into the \"get rid of it\" pile.",
    "timestamp": 1759615200
  },
  {
    "username": "vyntoo",
    "rating": 3.0,
    "comment": "Not for me.",
    "timestamp": 1748728800
  },
  {
    "username": "demiesta",
    "rating": 3.0,
    "comment": "Just no, basic 7 wonder ia okey but this i dont like.",
    "timestamp": 1745445600
  },
  {
    "username": "TForever",
    "rating": 3.0,
    "comment": "2 player games never happen, but the game itself is not hard. It's just a filler game. It's okay.",
    "timestamp": 1744408800
  },
  {
    "username": "tetranitride",
    "rating": 3.0,
    "comment": "The antithesis of fun",
    "timestamp": 1736031600
  },
  {
    "username": "maqister",
    "rating": 3.0,
    "comment": "OMG this game is an absolute garbage, I completely don't understand acolytes.",
    "timestamp": 1735340400
  },
  {
    "username": "CatContentCreator",
    "rating": 3.0,
    "comment": "Sicherlich eines der besten Spiele für 2 Spieler!\n\nMan muss es allerdings mehrmals im Jahr auf den Tisch bringen, um die überbordende (und nicht immer eindeutige) Ikonographie sowie die eine oder andere unklare Regel im Kopf zu behalten. Sonst wird es für das, was das Spiel bietet, zu langatmig und man verbringt zu viel Zeit mit der Anleitung. Ich muss sagen, dass ich dieses Problem bei keinem meiner anderen Spiele habe, obwohl diese in der Regel viel komplexer sind.\n\nBei den Erweiterungen empfehle ich Agora deutlich vor Pantheon. Der Solo-Modus ist mit den Erweiterungen nicht kompatibel.",
    "timestamp": 1733094000
  },
  {
    "username": "ChrisBach",
    "rating": 3.0,
    "comment": "I find it not very engaging or interesting. You take cards, the other one takes card, you dodge some cards or take some you don't want. At least for me it's better than not playing anything but if there is any alternative I wouldn't choose it.",
    "timestamp": 1732575600
  },
  {
    "username": "vinayplusj",
    "rating": 3.0,
    "comment": "Played on Board Game Arena.\n\nThis is the \"Amerigame\" version of 7 Wonders for passive aggressive couples to take out their resentment on each other. 7 Wonders Duel distills the weaknesses of original game with few of the positives. The 2-player version in the original 7 Wonders is in my opinion superior to this overly hyped and Unbalanced game.\n\nFor new players, the preponderance of destructive cards and wonder powers make the game too mean with all the \"take-that\" burning of opponent resources, money etc. The extra punishment of increasing the resource prices after being denied the resource cards is just too much.\n\nAfter the initial plays, the display of face-down and face-up cards is prime material for Analysis Paralysis. Thankfully, I played this game on boardgamearena where the code took care of tracking things. Once the players are experienced in the game, it plays itself after some initial turns as the ideal route does not change.\n\nThe theme is weak as there are other similar games that are more fun. There are way too many games with this \"Take that!\" mechanics available much cheaper. Even if you really love the theme, get the parent game instead.",
    "timestamp": 1731366000
  },
  {
    "username": "chuckberry",
    "rating": 3.0,
    "comment": "Clever, but too chess-like and attacking for our taste.",
    "timestamp": 1719093600
  },
  {
    "username": "Flip_Turn_Gaming",
    "rating": 3.0,
    "comment": "Wife and I didn't enjoy it, left a bad taste in our mouths, not a game for us.",
    "timestamp": 1717452000
  },
  {
    "username": "PoisonJamUK",
    "rating": 3.0,
    "comment": "I just find the action of drafting cards while simultaneously trying to reveal the fewest options for your opponent completely tedious.\n\nThere's also too much luck in the game with the hidden cards.\n\nOn the plus side, it plays quite quickly and the different paths to victory keep things interesting.\n\nWill likely never play this again. Would rather play Azul as a 2p drafting game every time.",
    "timestamp": 1714600800
  },
  {
    "username": "JRThalman",
    "rating": 3.0,
    "comment": "Tied thrice over - just play regular 7 wonders. There's tons of great 2 players games out there, but for me, this isn't one.",
    "timestamp": 1707346800
  },
  {
    "username": "VultR",
    "rating": 3.0,
    "comment": "Only played once, I think if I play it more it'll get better and funner.",
    "timestamp": 1705878000
  },
  {
    "username": "anubys1984",
    "rating": 3.0,
    "comment": "Really wanted to like this game. The componets have great quality, the artwork is great, but the gameplay feels way too flat. In many cases you can choose from two or even one card. It will leave our collection after 11 plays.\n\nUPDATE:\n2323/12/12\nSold after 11 plays.",
    "timestamp": 1702335600
  },
  {
    "username": "tolhs",
    "rating": 3.0,
    "comment": "2023:+0.5",
    "timestamp": 1701558000
  },
  {
    "username": "Sh0rtz",
    "rating": 3.0,
    "comment": "Balance issues. Starting player advantage.",
    "timestamp": 1696629600
  },
  {
    "username": "theagricolan",
    "rating": 3.0,
    "comment": "From a design perspective, it’s reasonably well balanced and paced. The problem is that meaningful decision points are so few and far between, it just puts me to sleep. Most of the time you’re simply executing commitments you made in the initial draft, with only a very occasional tactical consideration.\n\nAlso, the constant counting and recounting of card costs based on the varying cost of resources is quite drudging annoying for what should be a quick-paced game.",
    "timestamp": 1693260000
  },
  {
    "username": "smallest_phetus",
    "rating": 3.0,
    "comment": "Disgusting game recommended for people who find boredom fun",
    "timestamp": 1691704800
  },
  {
    "username": "Vitho",
    "rating": 3.0,
    "comment": "Good : like chess, you have to do a lot of computations to win. With random hidden resources (cards) but also a lot of visible cards : good for those who hates dices.\n\nSold April 2021",
    "timestamp": 1691359200
  },
  {
    "username": "Abizaas",
    "rating": 3.0,
    "comment": "7 Wonders Duel provides an engaging gameplay, but the significant output randomness resulting from card reveals can lead to unsatisfying experience.",
    "timestamp": 1691013600
  },
  {
    "username": "minitj",
    "rating": 3.0,
    "comment": "Была куплена на фоне общего хайпа, множество отзывов и обзоров, что это топовая дуэлька!\nСыграл первые партии, подумал интересненько, но не прям вау, топовая игра, но утешал себя, типо, чего ожидать то, от маленькой игрушки? Быстрая игра, да ещё и с разными вариантами решений для победы, нормас, ща попробуем и так сыргать и эдак!\nОднако, когда оба игрока понимают, как она работает, а это произошло через 5-10 партий, вы не можете достичь победы по направлению науки или войны. Ваш соперник знает сколько в игре Символов науки, тем более, если в жетонах науки не лежит доп символ, вам и максимальный рандом на закрытых картах не поможет. Достижение победы через научные символы требует, чтобы вы выбирали зелёные карты с различными символами всегда, т.к их всего 2шт в игре, однако выбирая их на старте игры, вы вынуждены делать выбор не в пользу остальных хороших карт типо ресурсы\\склад , поэтому вы по умолчанию отстаёте от оппонента. А всё что ему требуется для победы над вами, это во время 2-ой и 3-ей эпохи сбросить несколько зелёных карт, причём в 2-3 эпоху у него уже имеется хорошая добыча ресурсов и он не навредит себе этим, а даже получит компенсацию в виде денег. А вы по прежнему отстающий, что в итоге привёдет к подсчету ПО и проигрышу. Точно такая же история с войной, вам требуется по возможности не упускать ни 1 карты войны, иначе не хватит, а вашему сопернку достаточно начиная со 2-ой 3-ей эпохи(смотря на ситуацию на треке), покупать по 1-ой карте в каждой эпохе(иногда 2) и у вас не будет возможности победить, даже используя все чудосвета на войну. Поэтому каждая партия скатывалась в подсчёт победных очков, где определяющим фактором победы являлось то, какие карты откроются в ваш ход, каким вы ходите и как сыграете чудо света, это быстро надоедает. Чувствую себя обманутым, т.к ожидал увидеть разнообразие стратегий, но к сожалению этими методами можно обдурить только новичков, не знающих, что достаточно купить пары карт в нужную эпоху.\nДополнение Агора немного исправило это, добавив дополнительный путь к победе и не много рандома. С ним стало не много интереснее играть, в большей степени из-за рандома на картах заговорщиков. В общем от игры хотелось что-то новенького и дополнение с этим справилось, однако эффект длится не долго, играть в эту игру не хочется, принцип остался тем же, не дай сопернику сильно отдалится на любом из треков и переходи к подсчёту ПО.\nВероятнее всего в неё необходимо играть сразу с 2-мя дополнениями, Пантеон и Агора, может быть там действительно получится играть по разному.\nМоя основная претензия к игре, что она заявляет вариативность\\разнообразие в тактиках победы, но к сожалению это не так.",
    "timestamp": 1685916000
  },
  {
    "username": "Oninohugo",
    "rating": 3.0,
    "comment": "Handcuffed gameplay erecting a system on the shortcomings of Jaipur, tedious setup and systematically predictable winner early.",
    "timestamp": 1684879200
  },
  {
    "username": "Nicolas Weiss",
    "rating": 3.0,
    "comment": "Duel solves some of my problems with the original 7 Wonders, and introduces a whole suit of new ones in the process.\n\nThe teaching is still a bit laborious given the minimalism of the gameplay. The playtime still assumes a brisk pace, but while the decision tree is larger than the original (more wonders, more lookahead of future plays), you're not limited by the slowest of up to 7 players for every single move. Guild cards are still a bit naff in their swinginess, but that the game is zero-sum, counterpicking and discarding for money what's favourable to your opponent is a viable option here. The tech tree is less of a bother, because there are fewer cards and you see the overwhelming majority of the deck first-hand every single game. The more convoluted scoring has been replaced by alternate paths to instant victory and small special power unlocks, and player interaction skyrockets from pretending it exists to being all the game is about.\n\nUnfortunately, the kind of interaction the game is all about isn't super thrilling, which stems from two problems.\n\nFirstly, two coins turns out to not be a massive consolation prize for discarding, and the game (or at least the early-to-mid-game, until one player is strong in yellow cards) is as such still skewed towards building your engine. On one hand, I understand this, because Duels would otherwise be a bloodbath of aggressive counterpicks running contrary to the intended engine build design. On the other hand, as a result, there doesn't seem to be a lot of the liminal scenarios between picking a card to build because it's the best/cheapest for you and picking a card to discard because your opponent getting it is far worse than you getting your best personal-to-build option.\n\nMore importantly, the game is zugzwang-heavy and very Nim-like, in that for any given card, one player is guaranteed to have control over getting dibs on it if they wish so. (My first session involved a military victory early into the second age that my opponent couldn't find a way to prevent. This was an unusually unlucky deal, but is indicative of less drastic versions of the problem in more regular games.) This is in theory tempered in two ways. The first one, which I think is the correct approach, is the proportion of wonders that grant an extra turn, allowing you to reverse the Nim scenario at will once you can build the wonder. (The theology science token I'm far less keen on, because managing to grab it is essentially already a reward for being advantaged by turn order.) It is, however, a once-per-game event, that guarantees pick on one card, but that the opponent can flip back later, and then it becomes a war on who has the most of this type of effect. The second solution - no doubt devised to steer the game as far away from combinatorial as possible - is to deal half the cards face down until uncovered. And that's where I think the entire game crumbles, because a too large amount of the plays essentially essentially come bundled with a swingy die roll about how much your opponent just got a free meal from you just revealed for them. A feature which... is also subject to the zugzwang nature of the game.",
    "timestamp": 1682892000
  },
  {
    "username": "BallenFam",
    "rating": 3.0,
    "comment": "Played first time at LetsXape in Newark, UK. We waited to rate after we gave the game a 2nd shot months apart. We did not like the forced conflict that the game has and the lack of uniqueness that each player has as a civilization, since each civilization has 4 wonders from different cultures to build.",
    "timestamp": 1679094000
  },
  {
    "username": "MystLgnd",
    "rating": 3.0,
    "comment": "Concept is there, but way too linear. If you attempt anything else or are in bad luck, prepare to get punished for 10 painful minutes.",
    "timestamp": 1674514800
  },
  {
    "username": "ultimoratio",
    "rating": 3.0,
    "comment": "Good game, but I just prefer simpler but punchier 2 player only games - as personal preference. Despite the card pyramid setup, the choices are far too limited and sometimes the moves are too obvious. The strategy in the game is too linear and the only way to interact with one another is to obstruct their chosen strategy. The row of face down cards is just arbitrary and contributes nothing to the depth of the game - very gimmicky! Still, the strategy is interesting to pursue with good tactical depth.",
    "timestamp": 1672009200
  },
  {
    "username": "GorditaCrunch93",
    "rating": 3.0,
    "comment": "Sold",
    "timestamp": 1667602800
  },
  {
    "username": "RougeHemlock",
    "rating": 4.0,
    "comment": "Also have an expansion.",
    "timestamp": 1760824800
  },
  {
    "username": "dj_koen",
    "rating": 4.0,
    "comment": "This game is mid as hell",
    "timestamp": 1759528800
  },
  {
    "username": "Knurrdachs",
    "rating": 4.0,
    "comment": "Hat für mich exakt die gleichen Probleme wie das große Spiel...komplett unausgewogene Karten nur jetzt mit noch mehr Glückselementen....",
    "timestamp": 1756418400
  },
  {
    "username": "Kiely",
    "rating": 4.0,
    "comment": "Wer es mag, okey... Nichts besonderes. Nichts für die Top 100. Karten hinlegen, fertig. Ist wohl Geschmackssache. Furchtbar ist es auch nicht. Okey halt.",
    "timestamp": 1756072800
  },
  {
    "username": "Kaengi",
    "rating": 4.0,
    "comment": "I only played one round and that was already enough for me.\n\nAfter the first phase it was already so scuffed, i knew i had no way of a comeback and i lost with less than a third of my opponents points.\n\nI was just pummeled into the ground from the start, no good look for a duel game.\n\nAlso the tug-of-war mechanic for the military seems utterly useless, i don't see that ever winning a game, it's just such an endless grind.",
    "timestamp": 1754949600
  },
  {
    "username": "verandi",
    "rating": 4.0,
    "comment": "2p is a very crowded space and not something I do frequently. I can see the appeal as a spouse game, but it didn't really do much for me. I thought the Lord of the Rings remake was a bit better in any event.",
    "timestamp": 1752098400
  },
  {
    "username": "ciceroni",
    "rating": 4.0,
    "comment": "My low rating is probably influenced by the high expectations I had, due to this game getting that much high praise. In our games, the choices felt pretty obvious, the tug-of-war of the military condition was more annoying than interesting and the \"science\" victory felt way too hard to achieve.",
    "timestamp": 1748296800
  },
  {
    "username": "Folofl",
    "rating": 4.0,
    "comment": "This game is banned in our household haha",
    "timestamp": 1748210400
  },
  {
    "username": "BangazBaroque",
    "rating": 4.0,
    "comment": "Seriously don’t get all the fuss about this one. I’ve kept it though to try again. Maybe I missed how it’s amazing.",
    "timestamp": 1744408800
  },
  {
    "username": "ten_oclock_scholar",
    "rating": 4.0,
    "comment": "This is a clever design, but for whatever reason it just seems bland and joyless to me. Not at all what I was expecting from such a highly rated game.",
    "timestamp": 1738278000
  },
  {
    "username": "shoemoney",
    "rating": 4.0,
    "comment": "For the first few games, this felt like chess with multiple paths to victory. For each move there is at least one counter-move; and you can win with military supremacy, scientific supremacy, or a civilian victory in points. The main feature is the innovative facedown/faceup central draft structure that keeps cards locked in until unlocked, which introduces heavy elements of both hate-drafting and force-revealing. Strategic discarding and trashing has rarely been so important. And it has a GREAT insert. And yet. Despite my initial enjoyment, the game became a bit samey and confrontational, much like chess (apologies, chess fans!), as we developed heuristics and a meta which made the interesting-ness (read: difficulty) of the decisions drop away precipitously. The military and science strategies became more defensive annoyances and distraction tactics than legitimate paths, unless you had specific Wonders, and usually even then. Caveat: There are a lot of icons, which will take a game to internalise. Full disclosure, I find the back and forth of tug-of-war games to be quite tedious, hence my aversion to area majority (with some notable exceptions).",
    "timestamp": 1738278000
  },
  {
    "username": "KarenAB",
    "rating": 4.0,
    "comment": "Purchased because it (hopefully) appeals to David - card drafting, competition for resources, two instant win conditions",
    "timestamp": 1736118000
  },
  {
    "username": "alangager",
    "rating": 4.0,
    "comment": "\"At the moment when it is build, the card grants you 1 coin to for each of the element represented constructed in the city which has the most of that element.\" Not only the typos but it doesn't tell you want to do when there is a tie.\nFor such a complicated game, the instructions are really, really bad.",
    "timestamp": 1735945200
  },
  {
    "username": "MatroidX",
    "rating": 4.0,
    "comment": "Positives: I like the addition of instant-win conditions (military and science), and the card stack revelation is a neat idea: more planning and less chance-based. Trading with bank is also good (though pricing is bizarre thematically-speaking). I also like how free builds are now indicated by icon instead of by text - much better interface than the original 7 Wonders!\n\nNegatives: I still find the game more tactical than strategic (often making 2-way comparison choices, and just computing, which means much of the gameplay is simple computation), though the card revelation does mitigate this by adding a nice planning-ahead component which the original lacked. Still a few too many icons for my taste, but better than the original in this regard too.\n\nConclusion: If you like the original, you'll probably like this one and vice-versa. This one's a bit better if you want more strategy/planning, but in practice it will be decided by player count.",
    "timestamp": 1735686000
  },
  {
    "username": "bowdy",
    "rating": 4.0,
    "comment": "Too draw dependent - if you don't have the coin flip go your way, you have no way to come back. I prefer splendour duel to this.",
    "timestamp": 1734130800
  },
  {
    "username": "ZeeDeveel",
    "rating": 4.0,
    "comment": "Kinda boring, samey, just building stuff, lots of arranging of cards. Instead of the draft you layout cards in different formations depending on the Age, felt very forced. This game was designed for 7 people.",
    "timestamp": 1734130800
  },
  {
    "username": "latschediwes",
    "rating": 4.0,
    "comment": "I liked it better than 7 Wonders, but it was far too insignificant to make a lasting impression or to trigger fascination. However, my memory is hazy after all these years.",
    "timestamp": 1733958000
  },
  {
    "username": "Maced",
    "rating": 4.0,
    "comment": "No idea why this game scores so high. Played it many times. It is a solid 4 due to being nothing special and wishing I was just playing the actual 7 Wonders game instead.",
    "timestamp": 1733526000
  },
  {
    "username": "casaraeal",
    "rating": 4.0,
    "comment": "Gave to jade and aaron",
    "timestamp": 1733180400
  },
  {
    "username": "theDrakan",
    "rating": 4.0,
    "comment": "Bad balance.",
    "timestamp": 1733007600
  },
  {
    "username": "apuity",
    "rating": 4.0,
    "comment": "Complexified 7 wonders despite removing the fiddliness of resource management and interplayer trade seen in the original. Scientific and military supremacies are now introduced, preventing players from beelining their victory condition while paying no heed to what else is happening on the board. The element of surprise is still maintained as every other layer of cards are dealt facedown. Overall, a vast improvement upon the original",
    "timestamp": 1732921200
  },
  {
    "username": "threefold_crown",
    "rating": 4.0,
    "comment": "Based on one play, there weren't a lot of interesting decisions. Maybe I got the luck of the draw. I always had everything I needed, and never did I worry about money or resources, and then I won.\n\nI like when I was able to take the card that would clearly benefit my opponent, or to decline to take the card that would open the way to the card my opponent needed.\n__________\n\nAnother play hasn’t brightened my judgement. Diverse elements that don’t congeal into one, engaging experience.\n\nNow that I’ve played Cathala’s Sea Salt & Paper, I know this designer is capable of very good things. 7WD should be worth revisiting. (8/16/23)",
    "timestamp": 1729807200
  },
  {
    "username": "Zaungast",
    "rating": 4.0,
    "comment": "They say this is the best two-player game. It’s not. Like every two-player game this one is well beaten by any good multi-player game suitable for two, for example Ark Nova, Castles of Burgundy, Wingspan, Quest for El Dorado, and Azul (descending complexity).",
    "timestamp": 1729375200
  },
  {
    "username": "GreenPear",
    "rating": 4.3,
    "comment": "+ EXP: Pantheon",
    "timestamp": 1729288800
  },
  {
    "username": "Valcurdra",
    "rating": 4.0,
    "comment": "Decent drafting game that is massively overrated due to branding, however I wouldn't say no to a game.\n\nThe hate drafting in duel is a little too strong actually paying you in gold to trash a card.\n\nAnother major issue is the nature of the board layout allows you to too easily manipulate your opponents options and set them up.\n\nApparently there are expansions that address the issues above but I have never played them, I'll re rate if I do.\n\nUltimately, there are way way better drafting games out there",
    "timestamp": 1727215200
  },
  {
    "username": "DanZDK",
    "rating": 4.0,
    "comment": "Played with Annie",
    "timestamp": 1726437600
  },
  {
    "username": "SK00MA",
    "rating": 4.0,
    "comment": "I love card games. I do not love this card game. I just do not understand why its so popular. It is just ok for me. I love complex interaction and crazy combos from card games like mtg. This game just lacks for me every time I play it. I think it has to much going on and is therefore not good at any one thing.",
    "timestamp": 1718229600
  },
  {
    "username": "maqu_",
    "rating": 4.0,
    "comment": "Eh. We've tried but really can't get into this one.",
    "timestamp": 1717020000
  },
  {
    "username": "fergaliciousMe",
    "rating": 5.0,
    "comment": "not really my cup of tea. I didn't really feel like building an empire, but rather a mediocre engine for mid-game benefits. The availability of cards is quite random to the point where it tends to feel more of a take that / \"let me grab this so my opponent frees up this row\" rather than following a thought-through strategy",
    "timestamp": 1762587300
  },
  {
    "username": "Ephorus",
    "rating": 5.0,
    "comment": "What I like:\n- Three different ways to win, which keeps the tension high. Science and military victories add pressure and force you to stay alert, even if you're focused on points.\n- It's surprisingly interactive.\n\nWhat I dislike:\n- The turn order can be problematic at times.\n- Depending on the draft, one player can end up with a more powerful set of wonders.\n- Tableau building is satisfying, but ultimately, I'd rather play in a shared space. At least the cards come from a shared space, which leads to important timing decisions.\n\nThe logged play count is a bit exaggerated, as my partner probably played 10–20 games via my BGA account. Overall, it's a game we both enjoyed, but we've played it to death.\n\nWhy I culled it:\nI have no interest in the expansions, and our tastes have generally changed over time. This game was a great two-player entry-level game when I was still interested in Euro games. I'd still recommend it and even play it if someone requested it, but it's not a game I want to own.",
    "timestamp": 1762038000
  },
  {
    "username": "Maftiosi",
    "rating": 5.0,
    "comment": "23 Grundspiel\n20 Pantheon\n20 Agora\n16 Insert\n5 Sleeves\n19 Münzen\n5 Promos\n14 Metallfiguren\n-----\n122 €",
    "timestamp": 1761865200
  },
  {
    "username": "peterkkelly",
    "rating": 5.0,
    "comment": "2 player\n30 min\nPLAY AT CAFE/CLUB",
    "timestamp": 1761343200
  },
  {
    "username": "kystas",
    "rating": 5.0,
    "comment": "'7 Wonders: Duel' feels surprisingly much like 7 Wonders without the drafting mechanism AND it's of course faster to play. It's quite smooth and designed quite nicely, BUT it just feels quite... harmless? I owned it quite a time, but found lately that I don't have any kind of desire to play it any more -> sold it.",
    "timestamp": 1759615200
  },
  {
    "username": "Tina_T",
    "rating": 5.0,
    "comment": "2024.\nBeautiful and quick game.\nStrategically too light (add expansion?) and feels like too many forced moves due to the layout.\n\n Traded Lost Cities for it.\nRated after fewer than 3 plays.\nSold.",
    "timestamp": 1757368800
  },
  {
    "username": "coxy_fc",
    "rating": 5.0,
    "comment": "10+",
    "timestamp": 1756764000
  },
  {
    "username": "Darlingo",
    "rating": 5.0,
    "comment": "It's a very clever way to simulate draft for two players. It's by no means bad, but as I travelled further in my board gaming journey, it just does not feel interesting anymore. Great experience for beginners plus though.",
    "timestamp": 1755381600
  },
  {
    "username": "byrec",
    "rating": 5.0,
    "comment": "Good game, I just don't like 7 wonders very much. Its theme is bland and doesn't do anything exciting.",
    "timestamp": 1754172000
  },
  {
    "username": "gutrie_es",
    "rating": 5.0,
    "comment": "Sinceramente no entiendo como este juego está tan arriba en el ranking, para mi es un juego excesivamente sobrevalorado: escoges una carta, el otro escoge una carta y se repite hasta que alguien gana. Si, solo es eso.\n\nTensión cero y decisiones justas, no sea que haya que pensar mucho. Hay juegos de dos mucho mejores en mi estantería aunque supongo que tendrá su público familiar.",
    "timestamp": 1753135200
  },
  {
    "username": "BBorneo",
    "rating": 5.0,
    "comment": "i didnt like how much the game played itself, the priorities are quite self explanatory and unless the players are very close in skill level the game is quite boring. still the game is fine and im curious about the improvement made by the LOTR reimplementation",
    "timestamp": 1752703200
  },
  {
    "username": "lbyczy",
    "rating": 5.0,
    "comment": "For me, the level of abstraction is too high for a civilization game. Nice illustrations on the cards and a functional insert that organizes the game elements.",
    "timestamp": 1752012000
  },
  {
    "username": "Yshaaa",
    "rating": 5.0,
    "comment": "7 Wonders Duel is easy to learn, quick to play. It is nice to introduce someone new to the hobby.\n\nThat said, for me, the game became repetitive very quickly. It lacks the kind of complexity and intense competition that I personally enjoy in board games.\n\nIf you prefer light, fast games, this could be a solid option. But for those who seek highly strategic and long and lasting competitive experiences, 7 Wonders Duel may not deliver enough to stay interesting in the long run.\n\nPersonal rating: 5/10",
    "timestamp": 1751925600
  },
  {
    "username": "silenceisgolder",
    "rating": 5.0,
    "comment": "A cool rework of the original. Perhaps a bit calculable, but playing fast and loose helps me enjoy the tension of managing the opportunities out there.",
    "timestamp": 1751925600
  },
  {
    "username": "High_Hopes_NC",
    "rating": 5.0,
    "comment": "I like the idea of this game whenever I spend a long time off it, I just find that as soon as the game starts, I become ridiculously bored and lose any kind of interest I had moments ago. Drafting just isn't such a great mechanic for me as it seems to be for others, especially not when its half open half luck of the draw.",
    "timestamp": 1751752800
  },
  {
    "username": "manguiafazzula",
    "rating": 5.0,
    "comment": "On passe un bon moment sur ce jeu dont la note aurait pu être 6 ou 7 s'il n'était pas presque identique au précédent opus. En effet, les victoires par suprématie, promesse du jeu, sont quasi impossible tant le contre jeu est facile à mettre en place : il suffit généralement de prendre ou vendre deux ou trois cartes rouges ou vertes pour anéantir les espoirs de victoire avant la limite. Passé cette étape, le jeu est alors quasi identique à son grand frère à l'exception qu'il n'est jouable qu'à deux. le jeu souffre alors de la comparaison avec son aîné.",
    "timestamp": 1749765600
  },
  {
    "username": "SoloGamingDad",
    "rating": 5.0,
    "comment": "A mindless, simple time-killer. Less of a game and more of a sorting activity. Very overrated.",
    "timestamp": 1748901600
  },
  {
    "username": "eddieb",
    "rating": 5.0,
    "comment": "Was good first game. never ever wanted to play again. But better than regular 7 wonders.",
    "timestamp": 1746568800
  },
  {
    "username": "GANDON",
    "rating": 5.0,
    "comment": "I have played this game 9 times - not counting several solo sessions on the app’. I still do not understand what is the justification for such a high rating. The game is very mechanical, plays super quickly and I cannot seem to remember a single moment in my games when I felt either excited or stressed or simply happy for achieving something. I find it boring and lifeless.",
    "timestamp": 1746309600
  },
  {
    "username": "tbrofromspace",
    "rating": 5.0,
    "comment": "Reviewed",
    "timestamp": 1743631200
  },
  {
    "username": "PipePintCross",
    "rating": 5.0,
    "comment": "2 Player",
    "timestamp": 1742770800
  },
  {
    "username": "TGorson",
    "rating": 5.0,
    "comment": "Grundsätzlich ein gutes Spiel. Kurz, knackig, genug Tiefe, unterschiedliche Wege zum Sieg, guter Wiederspielwert, gut zu transportieren, einfache Regeln.\n\nGeht nach einigen Partien dennoch etwas unter im Vergleich zu unseren anderen Spielen und kommt z.B. für das knackige Spiel Zwischendurch aus unserer Sicht leider nicht an Carcassonne ran.",
    "timestamp": 1742511600
  },
  {
    "username": "toadles",
    "rating": 5.0,
    "comment": "It's fine, it just lacks the spark to make it great. Better than OG 7 Wonders.",
    "timestamp": 1742338800
  },
  {
    "username": "Seewolf",
    "rating": 5.0,
    "comment": "Civilization / Family\nOnly 2 Player\nLast 10/2022",
    "timestamp": 1740783600
  },
  {
    "username": "g4bor",
    "rating": 5.0,
    "comment": "+ Agora\n+ Pantheon",
    "timestamp": 1740092400
  },
  {
    "username": "Scaaat",
    "rating": 5.0,
    "comment": "This game got me into 2p games, so I will say it holds a place in my heart. Overall concept is good. My main issue is I feel like a set strategy could easily develop, wonders that give you a bonus turn are clearly priorities, war and science wins are few and far. I’m going keep messing with stratagies, rating may change.",
    "timestamp": 1740006000
  },
  {
    "username": "Ginewra",
    "rating": 5.2,
    "comment": "bga",
    "timestamp": 1739746800
  },
  {
    "username": "nicholie",
    "rating": 5.0,
    "comment": "Work",
    "timestamp": 1739487600
  },
  {
    "username": "photoben",
    "rating": 5.0,
    "comment": "A lot of game for the money. Plays smooth, and being able to win in three different ways is a great mechanic.",
    "timestamp": 1738882800
  },
  {
    "username": "buzzlife",
    "rating": 5.0,
    "comment": "I need to give this another try, I didn't love it, it had some cool mechanisms, but I don't think I fully understood it.",
    "timestamp": 1737241200
  },
  {
    "username": "djsturz",
    "rating": 5.0,
    "comment": "Wore off on me after a few plays. The resources and points feel at odds mechanically with the military and science aspects, which are more fun.",
    "timestamp": 1736204400
  },
  {
    "username": "rjones53",
    "rating": 5.0,
    "comment": "Quite unbalanced and too lucky. The destroy opponent card abilities are broken especially if done early.",
    "timestamp": 1736031600
  },
  {
    "username": "frenchyoman",
    "rating": 5.0,
    "comment": "Jeu qui est hasardeux avec mort subite possible (guerre ou science) qui n'a rien à faire dans un jeu intermédiaire. Si on joue avec les extensions ça rajoute un temps fou avec toujours autant de hasard. Faites un Yams à la place ce sera plus sympa.",
    "timestamp": 1735599600
  },
  {
    "username": "larrydurbin",
    "rating": 5.0,
    "comment": "We simply love the OG too much to give it up. The 2p variant in original 7W is fantastic. This version is good, just not much to look at on the table. That is a deal breaker for us.",
    "timestamp": 1735426800
  },
  {
    "username": "tectactoe",
    "rating": 5.0,
    "comment": "A wonderful 2-player game. I'm one of the weirdos who prefers this game without any of the expansions. I think it offers a balanced 2-player experience and creates enough meaningful decisions over its relatively short length.\n\n+7 Wonders: Pantheon [3.0] The Pantheon board is neat, the way that Divinity cards can be placed strategically to be cheaper for you and more expensive for your opponent (but aren't necessarily safe) is clever, and the ability to avoid drafting a card on your turn throws a huge wrench into learned 7WD mechanics. But, again, I prefer the base game for its simplicity and remarkably brisk flow.",
    "timestamp": 1733871600
  },
  {
    "username": "MeepleSmuggler",
    "rating": 5.0,
    "comment": "I cannot believe this game is rated so highly. I take a card, you take a card, I take a card, you take a card. That's all it is, there's very little you have to work for.",
    "timestamp": 1733871600
  },
  {
    "username": "gogomaester",
    "rating": 4.9,
    "comment": "Good mechanics, but sometimes very frustrating luck based. - e.g. the needed cards are not in play.\n\nI just lost a game with my SO. I was 1 warband away and 1 symbol away from victory but she beat me on points. The symbol nor any other army was in play.",
    "timestamp": 1733871600
  },
  {
    "username": "tearexgames",
    "rating": 5.0,
    "comment": "LIKE NEW - played once.",
    "timestamp": 1733266800
  },
  {
    "username": "kyhre",
    "rating": 5.0,
    "comment": "Silky smooth and accessible. I like the different win conditions. The drafting system is intriguing. There’s a nice mix of long and short term planning. I can see that this would grow with further play. First impressions didn't really wow me enough to make it likely I'll devote a lot of time to it.\n\nIt’s dryish, mildly fiddly, few big moments, not very emotional. Unthematic.\n\nWould sell for 3000 ISK",
    "timestamp": 1732575600
  },
  {
    "username": "ninqt",
    "rating": 5.0,
    "comment": "It's fine. Wouldn't choose to play again of my own accord.",
    "timestamp": 1732489200
  },
  {
    "username": "Desiderata",
    "rating": 5.0,
    "comment": "It's better than playing the original 7 Wonders as a 2-player game, but it's still a bit dull. Maybe the expansions improve it, but it's just not fun enough for me to want to play it more. Sold.",
    "timestamp": 1731884400
  },
  {
    "username": "Mamjor",
    "rating": 5.0,
    "comment": "N’a jamais fonctionné chez nous.",
    "timestamp": 1731106800
  },
  {
    "username": "Qayooti",
    "rating": 5.0,
    "comment": "The military aspect is unsatisfying and completely ruins the game for me, it doesn’t feel good to win to it or lose to it and feels like a nuisance most of the time. I especially do not want to teach it to someone as it feels mean for an entry level 1v1 game.",
    "timestamp": 1730588400
  },
  {
    "username": "hiimjosh",
    "rating": 5.0,
    "comment": "EDIT: God, after 15 plays I finally see the rule that discarding for coins gives you money based on the number of yellow cards and paying for resources with coins is based on the number of those resources your opponent has. Okay - need to process this information.\n\n---\n\nBleh. Okay, where to start. 7 Wonders: Duel is aliased to \"hype\" in the board game dictionary which should've been a red flag from the start. It was reasonably priced at a FLGS though so I picked it up. The components were very underwhelming. The cards are *tiny*, thin, and started warping easily (Repos' games all seem to do this). The cards constantly shifted whenever we tried to remove any from the draft pyramid. Most importantly though, I just didn't find the game interesting or challenging. Perhaps it's a consequence of us being total noobs playing it, but there wasn't much tension. By the end of the game we had enough money and power to do whatever we wanted and the game devolved into finding simple ways to force moves so we could get what we wanted. I think that's what really bothers me: it's like playing chess where you only have to consider about three or four different moves (but they are all similar and it's really easy to reason about the later affects of those moves). It just didn't appeal to me at all: too boring, too easy. I like that it's different than other games I have but like Patchwork I just don't understand the hype around the game\n\nEDIT: I had seller's remorse. I must've missed something 5 years ago when I first played this. Nope - still hate it\n\nThe issue with this game is that it's really just a personal player boards game with drafting in the center. Oh, look a rules technicality because of your engine. Well, there goes the whole game I guess. Games like Innovation can get away with this because I only have to read a couple of cards and all the possibilities are spelled out right in front of me.\n\nEDIT: Tried to give this yet another chance, but this game is just bad and lacks dynamics. It forces you into its randomness and there is soooo much of it. One of the worst drafting systems ever. The game is also so, so cluttered with stuff all over.",
    "timestamp": 1729980000
  },
  {
    "username": "esayitch",
    "rating": 5.0,
    "comment": "1) Draft cards to build your civilization.\n2) Along three eras, players openly draft cards from the table, from a specific layout, for resources, points, science, and military. The game has 3 victory conditions, and so has some tug-of-war influences.\n3) I loved: Pretty quick while feeling meatier than it is. Playing it on the app that handles calculating the cost of missing resources is pleasant. The three victory conditions are a stroke of genius.\n4) Could be improved: Highly calculable at certain points, taking the choice out of the players' hands. Forward planning is not really worth it due to the chaos of subsequent eras. The game largely devolves into who can parse each era better, and use the extra turn powers better to change the drafting tempo to their advantage.\n5) I have a love-hate relationship with this game. It sees a burst of play on the app for a couple of weeks every year (much like classic 7W), and then I get frustrated when I realize there is no real \"game\" here and uninstall it again.",
    "timestamp": 1729029600
  },
  {
    "username": "krushnad",
    "rating": 5.0,
    "comment": "Picking your way through history, the future mostly known, getting in the way of your opponent but in a knowing sort of way, calculating resource conversions and some small points of tension. Splendor Duel does it better. Traded.",
    "timestamp": 1728770400
  },
  {
    "username": "WeLuvBGs",
    "rating": 5.0,
    "comment": "My husband and I definitely land in the minority opinion, but we weren't huge fans of this game. We didn't find it very intuitive or easy to learn, and the gameplay seemed to easily fall into \"the rich get richer\" pitfall where bad choices early in the game can cause a snowballing of one person getting more resources & points and the other less. The way to end the game early by collecting enough military strength seemed an odd rule, too, that felt disjointed. The possibility of the game ending early or going the full time just didn't seem cohesive in this particular case.",
    "timestamp": 1726956000
  },
  {
    "username": "peakhope",
    "rating": 5.0,
    "comment": "\"Too combative for my tastes, but a very clever design. I can see how this is halfway between 7W and 7WA\"\n\nWhat I like:\n- Interesting decisions when drafting cards\n- Supremacy insta-wins add tension\n\nWhat I don't like:\n- Fair amount of hate drafting\n- Some cards straight up destroy opponent cards",
    "timestamp": 1725660000
  },
  {
    "username": "CydPL",
    "rating": 5.2,
    "comment": "K.",
    "timestamp": 1725487200
  },
  {
    "username": "Minori6",
    "rating": 5.0,
    "comment": "Slightly annoying to setup.",
    "timestamp": 1724018400
  },
  {
    "username": "Meloni",
    "rating": 5.0,
    "comment": "Played & really did not enjoy. Athene https://boardgamegeek.com/image/7664108/meloni",
    "timestamp": 1720908000
  },
  {
    "username": "TheBoxGhost69",
    "rating": 5.0,
    "comment": "Pretty simplistic and repetitive",
    "timestamp": 1720562400
  },
  {
    "username": "jonesy792",
    "rating": 5.0,
    "comment": "Despite being billed as a head to head duel, it lacks tension and bite with only very minor and indirect interactive elements.\n\nRadlands is a far superior alternative !",
    "timestamp": 1717192800
  },
  {
    "username": "FiveEels",
    "rating": 5.0,
    "comment": "Just wasn't that exciting / didn't click with us. Good game, but didn't hold our attention. Possible with more plays we would have understood the nuance but... yeah just would rather play other games.",
    "timestamp": 1715378400
  },
  {
    "username": "Flummoxa",
    "rating": 5.0,
    "comment": "Need to play again to give more accurate rating. Wasn't a bad time but doesn't stand out.",
    "timestamp": 1715032800
  },
  {
    "username": "SteveD.",
    "rating": 5.0,
    "comment": "BGG SSanta 2020\nHoopla MT G 2024 (The Pillars of the Earth: Builders Duel)",
    "timestamp": 1714341600
  },
  {
    "username": "Xyt4n",
    "rating": 6.0,
    "comment": "+ very good 2 playee implementation of the original. Its in core the same game\n+ very confrontative\n+ a bit more decisions than the original\n- - luck dependent and snowball effect possible\n- - military sucks in this variant",
    "timestamp": 1762682520
  },
  {
    "username": "elijah234",
    "rating": 6.0,
    "comment": "Workmanlike is how I would describe this game. Gets the job done but nothing really that excites.",
    "timestamp": 1762609140
  },
  {
    "username": "songdivision",
    "rating": 6.0,
    "comment": "“OK—will play if in the mood” says the BGG 6 star description. This is by no means a bad game. But I don’t love it and it’s leaving my collection. Setup is a tad too finicky for what it offers. Success feels too arbitrary for a serious head-to-head. I’m sure I could learn to mitigate that with a lot of effort, but I don’t want to put the effort in.",
    "timestamp": 1762470000
  },
  {
    "username": "Kinnnus",
    "rating": 6.0,
    "comment": "2",
    "timestamp": 1762038000
  },
  {
    "username": "Regimeta",
    "rating": 6.0,
    "comment": "Duel achieved what the original 7 Wonders lacked - a great 2-player experience. The mechanics of the original 7 Wonders are well implemented for two players.",
    "timestamp": 1761256800
  },
  {
    "username": "eddy_sterckx",
    "rating": 6.0,
    "comment": "2025-10-20 : First play. I'm not much into 2-player games, but this one works - and is actually better than the original 7 Wonders.",
    "timestamp": 1760997600
  },
  {
    "username": "rubiks777",
    "rating": 6.0,
    "comment": "Heavy on symbology but easy to teach if you've played it once. Was a little confusing playing with two players for the first time having not read the rules ahead of time. However, was able to teach my 7 year old with no issues after having played through the game once.\n\nUpdate: The more plays of this, the less I want to play it. It's a fine game but the main mechanics don't leave a lot to be interested in for me.",
    "timestamp": 1760824800
  },
  {
    "username": "toastytoast",
    "rating": 6.0,
    "comment": "Perfect after work game to play with my Wife. May have to pick up the expansion to add a little more complexity!",
    "timestamp": 1760565600
  },
  {
    "username": "david_os",
    "rating": 5.5,
    "comment": "Clever adaptation of the classic played at Wellycon 2022. Especially like the improved military system, but I dunno... 2-player adaptations of boardgame franchise behemoths are just a bit too late stage capitalism gone wild for me to really get behind.",
    "timestamp": 1760306400
  },
  {
    "username": "Gary_James_Gearik",
    "rating": 6.0,
    "comment": "The 'normal' one is much better in my opinion.\nOn the other hand, there are much better 2-player games.\nStill not bad",
    "timestamp": 1760220000
  },
  {
    "username": "purvisa",
    "rating": 6.0,
    "comment": "I have not played the award-winning original, and I bought this because I am most often in a 2-player setting. The game kept getting excellent ratings, and while searching with my girlfriend for a good game to expand what we played, once more this was on the lips of the shopkeeper, so here it is.\n\nPlayers take turns getting and playing cards, or turning them into currency to get other cards. The game itself is a pretty well-paced city building exercise that has engine-building components, but it also has a combat element that can force players to turn outward at inconvenient times. The cunning player could even force an opponent to respond at a moment that necessarily causes the responder to open up further opportunities in the overlapping grid of cards from which players select each turn.\n\nBe careful not to sleep on the Progress Tokens that can modify the entire game if you can secure them. Beware, too, that at least one of these—Economy—can tip the scales radically. I have yet to see a player get it and lose.\n\nThe setup is moderate, taking a few minutes to break everything out, select what is in and what is out, and more. The re-boxing is a little bit faster, but not much.",
    "timestamp": 1759960800
  },
  {
    "username": "identisick",
    "rating": 6.0,
    "comment": "Owe a lot to this as a gateway into the hobby and will keep for sentimental reasons but can't see going back to it",
    "timestamp": 1759788000
  },
  {
    "username": "Stingart",
    "rating": 6.0,
    "comment": "Just OK.",
    "timestamp": 1759615200
  },
  {
    "username": "Holzmichel01",
    "rating": 6.0,
    "comment": "It's been a while since I traded this away, but my impression was that I like regular 7 Wonders better as the game system gets more interesting with higher player counts, and that the Duell version here is, well... fine.\nNot bad, not great, but ok.\n\nIt's obviously more confrontational, and when sharing the deck only with a second player, you can strategize more, which is good... but at the same time you feel more screwed by unlucky card constellations.\nThe used drafting mechanism leads sometimes to unavoidable, forced situations.\nGames are very close, and when you win you think \"nice that it all worked out\", but when you lose you just think \"alright, I couldn't get that one card, not sure what I could've done better\"... which is not a good sign after losing a game imo, esp. for a game that takes itself more seriously and one that is not just a lucky, lighthearted filler, where it would be more forgivable.",
    "timestamp": 1759442400
  },
  {
    "username": "logopolys",
    "rating": 6.0,
    "comment": "Two-Player Game\n\nA shorter but not necessarily lighter version of 7 Wonders. Again, it captures all of the trappings of a Civ game without much of the actual content, but that's balanced against the fact that it's actually fun to play. A twist on drafting, there's still hidden information and risk with allowing cards to be flipped up. Great two player balance.",
    "timestamp": 1759356000
  },
  {
    "username": "mondauge",
    "rating": 6.0,
    "comment": "A good (open) drafting and tableau-building game, but not something that I would suggest over Race for the Galaxy, Innovation or Glory to Rome.\n\nI had a look at the expansion materials (did not play) and they seemed to be clearly overdoing it. Just adding too many remotely connected subgames...\n\nStill, reasonable game and I would not mind trading for it. (Update: Bought it.)",
    "timestamp": 1759269600
  },
  {
    "username": "numnumzing",
    "rating": 6.0,
    "comment": "2인 갓겜이라길래 사서 해봤다. 셋팅과 룰이 간단한 점이 장점이지만 그만큼 플레이 후 포만감이 좀 떨어지는듯.. (잘 못해서 그럴수도) 문명이라는 테마성도 그리 높지는 않은거 같고..",
    "timestamp": 1759269600
  },
  {
    "username": "rharn",
    "rating": 6.0,
    "comment": "Adds a lot of direct player confrontation compared to the original game, which I enjoy. The revealed/unrevealed draft mechanic seems good on paper, but kinda leads to uninteresting play patterns imo.",
    "timestamp": 1759183200
  },
  {
    "username": "TyDeL",
    "rating": 5.5,
    "comment": "I tried this game so many times for how hyped it has been (top 20 on BGG?!), I just don't get it. It's clearly not for me. It's mildly interesting the decision of taking a card and exposing options to your opponent, but like the original it's still so drawn out and fiddly for how basic your decisions are.\n\nI'd rather play Consipiracy: The Abyss for having a spatial puzzle that you create as you play and not have to setup and pick through, that game buzzes along with more agency in your push your luck.",
    "timestamp": 1759183200
  },
  {
    "username": "ValerianofEternia",
    "rating": 6.0,
    "comment": "Pros :\n• Solid adaptation of the original game for two players\n• Multiple victory conditions and several wonders per player\n• Original drafting system\n\nCons :\n• Tug-of-war and hate-drafting mechanics aren't particularly fun\n• With experience, choices become obvious and repetitive, with a meta that reduces enjoyment\n• Expansions add complexity and reduce fluidity\n\nConclusion :\nA solid game that falls short of the strategic depth of its big brother.",
    "timestamp": 1759010400
  },
  {
    "username": "Arseny_Vasily",
    "rating": 6.3,
    "comment": "duel version of his big brother, revealing this game even better",
    "timestamp": 1758837600
  },
  {
    "username": "Katenic333",
    "rating": 6.0,
    "comment": "RESERVED SOPHIE",
    "timestamp": 1758751200
  },
  {
    "username": "Der_Rentner",
    "rating": 6.0,
    "comment": "+ Pantheon",
    "timestamp": 1758492000
  },
  {
    "username": "Alaena",
    "rating": 6.0,
    "comment": "It was OK, but not as interesting as regular 7 Wonders. I would rather play with the dummy player.",
    "timestamp": 1758232800
  },
  {
    "username": "vdwoord",
    "rating": 6.0,
    "comment": "I don't really like, but my wife does, so she can play it with our eldest son as he likes it also",
    "timestamp": 1757628000
  },
  {
    "username": "julienpetitfrancais",
    "rating": 6.0,
    "comment": "The game is beautiful and interesting but for me who loves immersion and ancient history, there is something missing in terms of mechanics that gives us the illusion of making coherent and realistic choices. Here we are clearly on the pure and hard points race... It's a shame but maybe that's what makes it accessible and famous",
    "timestamp": 1757541600
  },
  {
    "username": "graybeard76",
    "rating": 6.0,
    "comment": "Can easily get too cutthroat for my taste. But tried one game where both players agreed to not use the military actions (get coins instead, for example), and found it a little more enjoyable.",
    "timestamp": 1757109600
  },
  {
    "username": "IsolatedPawn",
    "rating": 6.0,
    "comment": "Solid design, and I do get the thematic feeling of one city-state competing against another in the ancient world. My rating for this has fallen over time, as the decision space can feel narrow/forced more often than I’d like, and because both expansions make it unlikely I'll play base 7WD again, at least outside of a teaching situation.",
    "timestamp": 1756677600
  },
  {
    "username": "Hutchicken",
    "rating": 6.0,
    "comment": "Sold",
    "timestamp": 1756245600
  },
  {
    "username": "weidox",
    "rating": 6.0,
    "comment": "Uninspiring. Comparable to original 7 Wonders at 2 players (which was the only working player count anyway).",
    "timestamp": 1756159200
  },
  {
    "username": "trilamb",
    "rating": 6.0,
    "comment": "GIVE AWAY",
    "timestamp": 1755468000
  },
  {
    "username": "kvarclovag",
    "rating": 6.4,
    "comment": "BGA meg az app segít számolni. Az asztalon nehezebb több kártya költségét kiszámolni, pedig néha az is kellhet a jó döntéshez. Ketten számolva a lapok árát talán nem számoljuk el, de figyelni kell rá.\n\nA legjobb hangulatú 7 csoda, de az rossz érzés, amikor jó pár körrel előre már látszik a katonai vagy tudományos végzet. És az is, hogy a nyersanyagok miatt kerülhet az egyik játékos nyomorúságos helyzetbe, amikor szinte csak eldobni tud.\n\nA csodák sorsolását érdemes úgy módosítani, hogy mindkét játékosnak 2 újrahúzós csodája legyen, vagy legalábbis ne lehessen 3:1, mert akinek több van, annak sokkal nagyobb az esélye a győzelemre. Ha a csodák válogatásánál 1-2-1, helyett 1-1-1-1-et választunk, az már megakadályozza a 3:1-et. Családi játéknál esetleg a totális nyersanyagfölényt is érdemes házi szabályozni. Vannak hozzá rajongói csodák, érdemes azokat is kipróbálni.\n\nhttps://boardgamegeek.com/thread/3438106/new-2025-fan-expans...\n\nHázi szabállyal és rajongói csodákkal talán 7 pontot érdemel, az eredeti szabállyal csak 6-ot.",
    "timestamp": 1755381600
  },
  {
    "username": "bdeink",
    "rating": 6.0,
    "comment": "A clever take on the drafting mechanic for two players. We played this a lot early on in our board gaming «career», but I rarely want to play 7 Wonders Duel anymore.\n\nThe game does get a little bit too heavy on the iconography, especially when it comes to the special abilities of wonders and gods. Unless you play often, it's best to keep the rulebook handy.\n\nWe always play with the Pantheon expansion, which introduces more flexibility by essentially letting you skip your card draw by spending a turn on the pantheon instead.\n\nIncl. the following promos and add-ons:\n- 7WD: The Messe Essen\n- 7WD: Statue of Liberty (2nd Ed.)\n- 7WD: Stonehenge\n- 7WD: Sagrada Familia\n- 7WD: Metal Coins\n- 7WD: Metal Conflict Pawn",
    "timestamp": 1755122400
  },
  {
    "username": "dddoni",
    "rating": 6.0,
    "comment": "Lucky draw for instant win.",
    "timestamp": 1754690400
  },
  {
    "username": "shtiv",
    "rating": 6.0,
    "comment": "Crazy overrated game. It's fine? Because of the limited options available to you throughout the game or very much feels like you're going through the motions as you go through the game.\n\nScience really isn't a very strong strategy and military is mostly just a distraction tactic. There's a fair amount of luck involved with the game, from what cards will be revealed for you to select to the guild cards that may or may not be present in your game, potentially denying one player huge points and granting another player the win!",
    "timestamp": 1754431200
  },
  {
    "username": "TittleSkittle",
    "rating": 6.0,
    "comment": "This is an awesome game! They came out with an OFFICIAL solo variant on their website as well and its so easy to implement and its SUPER hard haha. Such a great game.",
    "timestamp": 1754431200
  },
  {
    "username": "Antch007",
    "rating": 6.0,
    "comment": "Fiddly, lots of computations. Playable okay only in digital format",
    "timestamp": 1754258400
  },
  {
    "username": "summerherekids",
    "rating": 6.0,
    "comment": "This turned out to be a lot more cutthroat game than I was expecting. Uninspiring art, weak theming, and gameplay that I just didn't enjoy very much made this an experience I wasn't able to really get into.",
    "timestamp": 1754258400
  },
  {
    "username": "KanChri",
    "rating": 6.0,
    "comment": "10",
    "timestamp": 1754172000
  },
  {
    "username": "Takhyon",
    "rating": 6.0,
    "comment": "Fairly decent implementation of the core ideas of 7 Wonders into a two player experience. I like the different victory conditions and different wonders in concept a lot. However I think the game has a few very fundamental design flaws that become apparent after you have played it several times. Or perhaps I just ruined this game for myself by overplaying it to a point of reaching a meta which was not enjoyable.\n\nHow the drafting works from an open display and the tempo with it creates a bit of a weird dynamic. More than actual tableau-building, the whole thing often becomes solely about hate-drafting and discarding cards while waiting for the final military card / science symbol to be uncovered. This whole tug-of-war aspect just makes the game way less fun for me.\n\nThis combined with the lack of hidden information and the very rigid turn structure means that the game starts to feel deterministic, almost to a point that it plays itself. It loses it's ability to really surprise you, since both players are easily able to see the best available option each turn and you sort of just end up going through the motions.\n\nI think these issues might have been addressed in the expansions, but they also just sort of make the game a lot more fiddly and frankly a bit bloated as well.",
    "timestamp": 1754085600
  },
  {
    "username": "selwyth",
    "rating": 6.0,
    "comment": "Not bad for 2-player, with potential for forced moves, and the 3 sudden-death victory conditions keeping you on your toes.\n\n4+2",
    "timestamp": 1753308000
  },
  {
    "username": "smurfodeth",
    "rating": 5.5,
    "comment": "I prefer this to regular 7 Wonders by a substantial margin.",
    "timestamp": 1752876000
  },
  {
    "username": "Coralouwho",
    "rating": 6.0,
    "comment": "#LetterNumber\n#2P\n#BGA #Tutorial",
    "timestamp": 1752703200
  },
  {
    "username": "VioletSquirrel",
    "rating": 6.0,
    "comment": "[lost sparkle]\nafter 10ish plays (mostly on BGA), mar/25\n\ndeus is preferred choice as catan+7wonders mix",
    "timestamp": 1752616800
  },
  {
    "username": "bootleby",
    "rating": 6.0,
    "comment": "Rating is for play on BGA only. I can't imagine thinking the in person set up and administration would be worth it, but I think the online game is pretty fun.\n\nThe threats around Military & Science give a push your luck element that I think is fun and tense. The availability of certain wonders and certain cards makes it so you can't blindly rely on one strategy and have to make interesting decisions around timing (certain wonders let you play twice in a row) and location of when you want to take a card.\n\nI think two of my friends do have this game in the flesh and I know one has played it a bunch. Maybe it really isn't that annoying to set up and track costs in person? I'm not sure I'd be willing to find out.",
    "timestamp": 1751839200
  },
  {
    "username": "willbeplayin",
    "rating": 6.0,
    "comment": "Rated higher than the original 7 Wonders. Great two player game with lots of options on how to win the game. Both expansions are a must-have for this game.",
    "timestamp": 1751839200
  },
  {
    "username": "Eeeville",
    "rating": 6.0,
    "comment": "7 Wonders: Duel is the attempt to make 7 Wonders into a better game than the 2-player variant included with the main game. As with most people, I definitely see this as a success. In fact, I like it a lot more than 7 Wonders. The main reason for this, is that it keeps the basics of 7 Wonders (drafting, resources, military, science, guilds, unique wonders, etc.) but amps up the tension of the game. How does it do this?\n\n-Instead of Science and Millitary just being VP paths in 7WD, they can instantly end the game in victory for the person that focuses on it.\n\n-The pool drafting of where there are some cards face-down and some face-up (and how these are flipped up) can be really nerve wracking. Especially when opponents are going for Military/Science victory.\n\n-Resource management is even trickier since resources opponents acquire make your deficiencies in those specific resources, more expensive to deal with.\n\n-Each player starts with 4 wonders each. That said, the game is called 7 Wonders for a reason... As soon as a player builds their fourth Wonder, that denies their opponent from ever building their fourth.\n\nThe replay value of this game is fairly decent. You don't use all of the science progress markers, guilds or wonders each game. There are also 3 cards randomly removed from the 3 age decks. This is my one negative of the game. It can be disappointing to learn that you were planning on going for Science/Military victory and that option is not really available to you based on the cards randomly removed from the deck. Overall, this is decent 2-player game. There are other 2-player game I prefer.",
    "timestamp": 1751580000
  },
  {
    "username": "Sister_Ruth",
    "rating": 6.0,
    "comment": "Decent attempt at a two player drafting game, but options seem limited when you usually only have a choice between 1-3 cards. This isn't a board game genre that shines at two players, and thus, I'd prefer many abstract and card games over this one.",
    "timestamp": 1751580000
  },
  {
    "username": "postkarma",
    "rating": 6.0,
    "comment": "It's very short - I'm guessing the expansions add some length. Yes, they do. Still falls short... time and game play. Dull.",
    "timestamp": 1751493600
  },
  {
    "username": "EllenCaroline",
    "rating": 6.0,
    "comment": "used to own",
    "timestamp": 1750802400
  },
  {
    "username": "muchiflapopo",
    "rating": 6.0,
    "comment": "El juego consiste en escoger cartas de un arbol. El escoger según que cartas permite liberar nuevas cartas del arbol. Gracias a los iconos de las mismas podras construir maravillas, luchar, conseguir simbolos de ciencia o directamente puntos de victoria.\n\nYo: Este es un juego que le encanta a todo el mundo. Al jugar 90% a dos jugadores nos lo recomendaron y a mi pareja le encantó. Pero después de 20 partidas yo sigo sin verle el atractivo.\nNo sabria especificar donde encuentro el problema. Una de las criticas que se le indica al juego es que a veces no tienes más remedio que beneficiar al contrario desbloqueando nuevas cartas. Es cierto, pero eso no es lo que genera mi descontento, pero si que es cierto que no encuentro nada de tensión en el draft de cartas. Otra de las criticas que he encontrado es la interacción en la linea de batalla. Esto para mi no es un problema puesto que la interacción y cierto grado de \"puteo\" es algo que agradecemos en un juego.\nPor lo tanto solo queda reconocer que es que no me parece divertido (quizás debido a la falta de tensión que siento jugando), y es por ello que poco a poco lo hemos ido dejando de jugar",
    "timestamp": 1748037600
  },
  {
    "username": "EdoardoMer",
    "rating": 6.0,
    "comment": "Too mean for me",
    "timestamp": 1747346400
  },
  {
    "username": "Mmdevos",
    "rating": 6.0,
    "comment": "printed solo and applestore",
    "timestamp": 1746914400
  },
  {
    "username": "speter22",
    "rating": 6.0,
    "comment": "It’s fun, and beautifully short, but there were way too many non-decisions for me. It’s high rating makes me think that there must be some depth that hasn’t presented itself in my few plays of it. Several times during my plays, I had the option of taking one of two or three cards, and each time it felt painfully obvious which one needed to be taken. Also had a couple games get decided on the random flip of a card.\n\nIt’s presenting itself as a meaty short game with meaty decisions, but it felt like the game happened to me instead of me playing the game (or my opponent, for that matter).",
    "timestamp": 1746655200
  },
  {
    "username": "Kaczim",
    "rating": 6.0,
    "comment": "Świetna gra dwuosobowa,sama spisuje się nieźle,ale z dodatkami to już WOW!!!",
    "timestamp": 1745618400
  },
  {
    "username": "spencyrrh",
    "rating": 6.0,
    "comment": "2025-04-25 | 6 plays | BGA | rules scratched in play:  6  \n\nYou draft one card at a time on your turn, either paying for and taking its listed benefit, selling it for coins, or playing it face down as a resource towards one of four wonders. The structure and iconography takes after 7 Wonders, but reconfigures the deck and victory conditions for a 2p contest. Two resource types get axed. You draft four wonders each at the start. You can now win instantly by having nine more military symbols than your opponent, or collecting a set of six science symbols. You take it in turns to draft from a shared and mostly open pyramid of cards, and some wonders give you two turns in a row.\n\nSome problems linger from 7 Wonders. Blue cards suck. You need resources late, but fight for them early, and new players will have no idea which to prioritise. A small number of strategies dominate. Coins feel too abundant. Aggressive yellow and brown card play, and science victories, seem favoured. But the new routes to victory enliven the setting and tension. I miss them in 7 Wonders. Sadly, the player count kills it for me. You'd want to play this a lot with the same worthy opponent(s), and I likely won't. I find myself on the fence about the original game. This one drastically reduces player range and increases setup faff. It forces the game into competition with both huger and more elegant 2p experiences. I would admire this game a lot more if it had been incorporated into the other.\n\nIt looks nice, but this ubiquitous colourful painterly semi-realistic Euro art fatigues me.\n\nThe rules run clean, but the game contains a lot of icons.",
    "timestamp": 1745532000
  },
  {
    "username": "Darigaaz",
    "rating": 7.0,
    "comment": "Not my favorite two-player game (probably because I've never been a fan of 7 Wonders, waiting forever for everyone to choose their card), but it does the job.",
    "timestamp": 1762629120
  },
  {
    "username": "Lindemann08",
    "rating": 7.0,
    "comment": "En solo",
    "timestamp": 1762625700
  },
  {
    "username": "d3stinyman",
    "rating": 7.0,
    "comment": "not sure why but I fell out of love with the game and never got to table it after a few games. it is good, and I used it with the expansion pantheon, but it requires a bit of setup and table space. I think the setup is the main reason why I did not feel like playing it again, I guess I'm lazy.",
    "timestamp": 1762624020
  },
  {
    "username": "GaryCollins68",
    "rating": 7.0,
    "comment": "Not too long, constant tension and decision-making, variety. 7WD is an excellent 2-player game. When you think you lost on bad luck, think back and you'll see you could have played better. Very cool.",
    "timestamp": 1762609200
  },
  {
    "username": "Quail_Daddy",
    "rating": 7.0,
    "comment": "Took a bit to get into, there is lots of symbology and little rules to remember for little gameplay. It is quick though and does provide for some interesting choices but the game feels very abstract and dry. Not for us.\n\nUpdate: revisited this after almost 5 years and enjoyed it more than I remembered, there is a bit of luck but it seems to ebb and flow as the game goes on. The various paths to victory all seem equally valid.",
    "timestamp": 1762470000
  },
  {
    "username": "front_ed",
    "rating": 7.0,
    "comment": "Drafting, Duel, Engine-Building, Euro",
    "timestamp": 1762470000
  },
  {
    "username": "JammyDodger3579",
    "rating": 7.0,
    "comment": "It's good. Light and simple tableau builder. Plenty of interaction, you're constantly paying attention to what the other player wants/has",
    "timestamp": 1762124400
  },
  {
    "username": "THE_GODFATHER",
    "rating": 6.5,
    "comment": "X",
    "timestamp": 1761951600
  },
  {
    "username": "LemonToAKnifeFight",
    "rating": 7.0,
    "comment": "Pros:\n-easy to learn\n-for everyone\n-fast\n-fun\n\nCons:\n-sometimes too random",
    "timestamp": 1761951600
  },
  {
    "username": "Moonpie13",
    "rating": 7.0,
    "comment": "I started out wondering if this game was balanced after my first couple of games when whoever got the 12 gold & extra turn wonder ran away with the game, but things seem to have evened out with subsequent plays. Fun game. Plays quicker than one would think and it allows for proper strategic and tactical decision-making.",
    "timestamp": 1761951600
  },
  {
    "username": "juspichi",
    "rating": 7.0,
    "comment": "Gave to SC",
    "timestamp": 1761519600
  },
  {
    "username": "tjbizzle",
    "rating": 6.5,
    "comment": "Ever since I got LotR Duel, I just strictly prefer that version since it has the 3 win conditions and isn't a point salad.",
    "timestamp": 1761519600
  },
  {
    "username": "hazegiant",
    "rating": 7.0,
    "comment": "Pantheon expansion has changed my rate to 9",
    "timestamp": 1761429600
  },
  {
    "username": "docspouse",
    "rating": 7.0,
    "comment": "2 players",
    "timestamp": 1761084000
  },
  {
    "username": "Gaymover",
    "rating": 7.0,
    "comment": "2/10",
    "timestamp": 1760997600
  },
  {
    "username": "dthipp",
    "rating": 7.0,
    "comment": "Sold on FB Marketplace.",
    "timestamp": 1760911200
  },
  {
    "username": "Harveymcglenn",
    "rating": 6.5,
    "comment": "Pretty good. Sufficient amount of decisions. Deep enough. Playing out turns a large number in advance, not to strategize but to math out who will have what available is not fun, especially at the end game.",
    "timestamp": 1760911200
  },
  {
    "username": "mingrkli",
    "rating": 7.0,
    "comment": "Welcome to 7 Wonders Duel the head-to-head version of the classic 7 Wonders and other like 20+ different versions but we don't talk about that XD. It's built entirely for two players. It’s all the glory, none of the waiting for six other people to finish drafting. If you like building civilizations, flexing your ancient empire’s power, and maybe crushing your opponent under the weight of your perfectly crafted wonders than this game is for you!\n\nThe game plays out over three Ages, each packed with cards that can boost your resources, military strength, or scientific progress. You’ll use these to grow your civilization, unlock powerful wonders, and (hopefully) leave your opponent in the historical dust.\n\nHere’s the twist instead of drafting cards at the same time like in the original, both players pick from a pyramid style layout of face-up and face-down cards. You can only grab a card if it isn’t covered by another, so timing and planning are everything. Sometimes you’ll even get a bonus move that lets you snatch another card right away a perfect moment to ruin your opponent’s day.\n\nThere are three ways to win:\nMilitary victory push your army all the way to your opponent’s capital. Instant win.\nScientific victory collect six of seven unique science symbols. Boom, brainpower triumphs.\nCivilization victory if neither side dominates militarily or scientifically, you tally up points and see who history remembers.\n\nWhether you’re conquering cities, building wonders, or outsmarting your rival with a single perfectly timed grab, 7 Wonders Duel is pure, intense, chess... like thing XD, fast, clever, and oh so satisfying when your opponent realizes you’ve just snatched their victory right out from under them.",
    "timestamp": 1760565600
  },
  {
    "username": "Medikus81",
    "rating": 7.0,
    "comment": "Egy jó kis játék. Semmiképpen sem kiemelkedő, de javaslom a kipróbálását. Számomra az ikonográfiája kicsit zavaros itt-ott és mivel nem kerül le sokat a polcról, gyakran fel kell eleveníteni az ikonok jelentését a szabálykönyvben. Ezt leszámítva könnyen emészthető. Ha egy könnyed laza kikapcsolódásra vágyom 2 fővel mindössze 30-40 percben, akkor van hogy a 7csoda párbajra esik a választás.",
    "timestamp": 1760479200
  },
  {
    "username": "designsbybriana",
    "rating": 7.0,
    "comment": "I like 7 wonders duel better than regular 7 wonders. It is a nice two play game, among multiple rounds.",
    "timestamp": 1760133600
  },
  {
    "username": "zasizo",
    "rating": 7.4,
    "comment": "A 7 csoda kétfős verziója. Elsőre talán nehéz belejönni, kb a 3. játéktól kezd tudatos lenni, mit miért csinálunk, de sokkal izgalmasabb ez, mint az alap = csoda. Pláne, ha a kiegészítő Pantheon játékot is bevetjük, amit érdemes.\nMi a 2. játéktól kezdve csak azzal együtt játszottuk, az sokat hozzáad.\n\n------------------\n2022.\nAzóta beszereztünk a rajongói kiegészítőt (Leaders = Vezetők), valamint a hivatalos, új kiegészítőt is (Agora).\n\nKár, hogy régen játszottunk 7W-t, mert nehezünkre esik újra felvenni a régi fonalat.",
    "timestamp": 1760133600
  },
  {
    "username": "Derianhorgen",
    "rating": 7.0,
    "comment": "SpielboxRating 8-8, av. 8,00",
    "timestamp": 1760047200
  },
  {
    "username": "shmonkey",
    "rating": 7.0,
    "comment": "7 wonders duel is vastly superior to the original 7 wonders. a clever solitaire style system where certain cards are buried adds timing considerations and advance planning to your moves. The mechanics are much more straightforward than in 7 wonders and rely significantly less on set collection. I would happily play this.\n\nNote: This was given to me and while i enjoy the game, I would also readily move it on to make space. In 2025 I should make it a point to try each of the expansions and decide how to proceed. Last Play 2024-11-29",
    "timestamp": 1759874400
  },
  {
    "username": "mjacobsca",
    "rating": 7.0,
    "comment": "I think I just like regular 7 Wonders best. This game is same theme, a couple similar mechanics, but it's not the original.",
    "timestamp": 1759096800
  },
  {
    "username": "DeadDomino",
    "rating": 7.0,
    "comment": "Rating after 1 play\n\nI think I can see why it's so popular. It feels like 7 Wonders but the drafting seems more meaningful. I'm not super excited to play it again though.",
    "timestamp": 1759010400
  },
  {
    "username": "Rasdel",
    "rating": 7.0,
    "comment": "I really like this one over 7 Wonders. I actually like it more as a base game that when adding expansions to be honest.",
    "timestamp": 1759010400
  },
  {
    "username": "AngryBunny07",
    "rating": 7.0,
    "comment": "Last played: 2021-03",
    "timestamp": 1759010400
  },
  {
    "username": "FirstToFall",
    "rating": 7.0,
    "comment": "S'alright",
    "timestamp": 1758837600
  },
  {
    "username": "archite",
    "rating": 8.0,
    "comment": "It's fun to hate draft =) though I understand it's not everyone's cup of tea. 7WD offers a clever tug-of-war, where you have to stay focused on what your opponent is drafting into their tableau.\n\nPantheon adds even some variability to the game while Agora can sometimes be extremely mean. Both expansions enhance the game.\n\nSoooo much better than classic 7 Wonders. | With Thi",
    "timestamp": 1762686780
  },
  {
    "username": "bigfootjedi",
    "rating": 8.0,
    "comment": "Bruno Cathala is a genius and this version of seven wonders is fantastic. But I'm just not compelled to play this with other games in my collection. So I rate this slightly lower than it probably deserves.",
    "timestamp": 1762653180
  },
  {
    "username": "Zhovijalno",
    "rating": 8.0,
    "comment": "Setup to play time ratio, as well as the feel of incompleteness without expansion is the only reason why this is not a 10.",
    "timestamp": 1762652040
  },
  {
    "username": "KummiRub",
    "rating": 7.5,
    "comment": "A decent but basic game, I played it once and ne er again.",
    "timestamp": 1762470000
  },
  {
    "username": "Kamil2310",
    "rating": 8.0,
    "comment": "+ 7 Wonders Duel: Agora – Tu Quoque Fili promo card\n+ 7 Wonders Duel: Statue of Liberty\n+ 7 Wonders Duel: The Messe Essen Promo Card\n+ 7 Wonders Duel: Sagrada Familia\n+ 7 Wonders Duel: Stonehenge\n+ 7 Wonders Duel: Agora (English 2021)\n+ 7 Wonders Duel: Pantheon (English 2016)\n+ 7 Wonders Duel: Metal Coins\n+ 7 Wonders Duel: Metal Conflict Pawn\n+ 7 Wonders Duel Pantheon - Metal Minerva Pawn\n+ Custom Plywood Insert\n+ Sleeves\n\n\nIt is a very well-balanced duel game. Expansions add more options and a new win condition. They are not mandatory, but add a point and a half to the overall score. Promos add variety, and metal pieces add a better feeling to components, but aren't necessary.",
    "timestamp": 1762470000
  },
  {
    "username": "BlueMissed",
    "rating": 8.0,
    "comment": "A really quick two-player card game that has many different strategies but is also easy to understand and play.",
    "timestamp": 1762383600
  },
  {
    "username": "korosuuu",
    "rating": 8.0,
    "comment": "???",
    "timestamp": 1762383600
  },
  {
    "username": "K0U30SH",
    "rating": 7.8,
    "comment": "2 player game",
    "timestamp": 1762297200
  },
  {
    "username": "Tigropigro",
    "rating": 8.2,
    "comment": "Alcune partite con Stefy",
    "timestamp": 1762210800
  },
  {
    "username": "jann1",
    "rating": 8.0,
    "comment": "Love to play with my girlfriend while travelling. Thanks to little space table required and the fact that I can put the whole game in a tiny box I 3d printed is super. Curious about the expansions, as the base game I feel like will get stale soon",
    "timestamp": 1762210800
  },
  {
    "username": "bnordeng",
    "rating": 8.0,
    "comment": "This is a quality two player experience that is very well designed for two players. It resembles 7 Wonders in a lot of ways with the types of cards and scoring and resources, but I find the two player version much more engaging.",
    "timestamp": 1762210800
  },
  {
    "username": "Nanferun",
    "rating": 8.0,
    "comment": "One of the first and best 2 player \"duels\" game\n\nWorking similir as his big brother original 7 wonders, but drafting from the table.",
    "timestamp": 1762124400
  },
  {
    "username": "Zronos3008",
    "rating": 8.0,
    "comment": "Pise",
    "timestamp": 1762124400
  },
  {
    "username": "Zerarch77",
    "rating": 8.0,
    "comment": "A great 2P re-interpretation of 7 Wonders. The multiple victory conditions and powerful progress tokens make the game significantly more interesting. Unfortunately the scoring system is still a mess and you're given a notepad instead of a score track.",
    "timestamp": 1762124400
  },
  {
    "username": "Souljay",
    "rating": 8.0,
    "comment": "Solid game with simple enough rules to not get too bogged down and quick enough games to enjoy. I will say though that after two games I'm usually done with it for awhile though as it feels a little intense even though it's a relatively short game. I look forward to trying the expansions.",
    "timestamp": 1762124400
  },
  {
    "username": "weceq",
    "rating": 8.0,
    "comment": "#family\n#players\n#medium",
    "timestamp": 1762038000
  },
  {
    "username": "Sly_Quick",
    "rating": 8.4,
    "comment": "+ Agora Expansion\n+ Pantheon Expansion\n\n(Folded Space Insert)",
    "timestamp": 1761951600
  },
  {
    "username": "Crushar",
    "rating": 8.0,
    "comment": "Sleeved\nLaserox Insert",
    "timestamp": 1761951600
  },
  {
    "username": "michla",
    "rating": 8.0,
    "comment": "pl: 7 Cudów Świata. Pojedynek",
    "timestamp": 1761951600
  },
  {
    "username": "lbleicher",
    "rating": 7.5,
    "comment": "Better than the original, instant winning conditions are much better than all that bean counting.",
    "timestamp": 1761865200
  },
  {
    "username": "TigerXRay",
    "rating": 8.0,
    "comment": "M",
    "timestamp": 1761865200
  },
  {
    "username": "Julien_Mikadi",
    "rating": 7.7,
    "comment": "Great duel ! I'd like to play more of it.\n2 players",
    "timestamp": 1761778800
  },
  {
    "username": "Eugeniosaracino",
    "rating": 8.0,
    "comment": "Gran implementación confrontativa del 7W. Muy recomendable!",
    "timestamp": 1761778800
  },
  {
    "username": "Amarinaro",
    "rating": 8.0,
    "comment": "imb",
    "timestamp": 1761692400
  },
  {
    "username": "VikingBurger",
    "rating": 8.0,
    "comment": "Talán a legjobb középnehéz két fős játék.\nÉrdekesebb a draft, mint az eredetiben, többféle győzelmi feltétel, extra képességek a fejlődéskorongokkal. Szuper.",
    "timestamp": 1761606000
  },
  {
    "username": "WVinz",
    "rating": 8.0,
    "comment": "2.22",
    "timestamp": 1761606000
  },
  {
    "username": "PermaFrost88",
    "rating": 8.0,
    "comment": "Has great tension between denying your opponent of resources and doing what benefits you.\n\nDue to the way the drafting works out, there is too much luck in which cards gets revealed for your opponent. However, I find that to be acceptable in lighter games, where this does apply.",
    "timestamp": 1761606000
  },
  {
    "username": "Parzival1979",
    "rating": 8.0,
    "comment": "Very fun head to head game you can play in a short amount of time.",
    "timestamp": 1761606000
  },
  {
    "username": "Karahkwa",
    "rating": 9.2,
    "comment": "fast, smart, and 2 player. one of the best head to head games under 40 minutes.",
    "timestamp": 1762666560
  },
  {
    "username": "Dubdubb82",
    "rating": 8.7,
    "comment": "great head to head game. lots to keep an eye on without being overwhelming",
    "timestamp": 1762594500
  },
  {
    "username": "Gorcho",
    "rating": 9.0,
    "comment": "sl",
    "timestamp": 1762470000
  },
  {
    "username": "Tann1e",
    "rating": 9.0,
    "comment": "Fast paced, easy to learn. One of the best 2 player games ever.",
    "timestamp": 1762383600
  },
  {
    "username": "ditterio",
    "rating": 9.0,
    "comment": "7 WONDERS DUEL (1-2 players)\nPANTHEON (2 players)\n\nSolo rules: https://boardgamegeek.com/boardgameexpansion/310215/7-wonder...\n\nSolo app for the solo rules: https://app.boardandgamer.com/7wonders-duel-solo/\n\nleaders fan expansion rules: https://boardgamegeek.com/filepage/177744/7-wonders-duel-lea...\n\nleaders fan expansion cards: https://boardgamegeek.com/filepage/177745/7-wonders-duel-lea...\n\nhow to play leaders fan expansion: https://boardgamegeek.com/video/267585/leaders-fan-expansion...\n\nPlayer aid for all expansions: https://boardgamegeek.com/filepage/274487/7-wonders-duel-pla...",
    "timestamp": 1762297200
  },
  {
    "username": "davidxiang",
    "rating": 9.0,
    "comment": "打不过女朋友系列",
    "timestamp": 1762124400
  },
  {
    "username": "cosmobozo",
    "rating": 9.0,
    "comment": "A modern classic, and a must-have if you enjoy two-player strategy games. The three different win conditions add tension and long-term planning (because combat and science card generally require different resources), while the drafting structure for cards require tactical decisions to get the cards that you need without giving the same chance to your opponent. The decision space strikes the right balance: you have options, but they are never overwhelming and the turns are quick. Luck is a factor (due to the placement of cards) but this can be mitigated to an extent.\n\nAfter a while, the best strategy becomes fairly obvious and you can play on auto-pilot. At this point, get one the two expansions: they really open the game, remove most of the luck factor, and make the game replayable pretty much forever.",
    "timestamp": 1762038000
  },
  {
    "username": "Menschenmatthias",
    "rating": 9.0,
    "comment": "Best 2player duelling game imho, beautiful artwork, engaging, high replayability, fiddly rules (duel of middleearth is much more streamlined)",
    "timestamp": 1761951600
  },
  {
    "username": "Luiz_Struijk",
    "rating": 8.5,
    "comment": "Perfect balance and I can play with my 8 years old kid",
    "timestamp": 1761778800
  },
  {
    "username": "jagiell82",
    "rating": 9.0,
    "comment": "Especially with Panteon and/or fan made Leaders",
    "timestamp": 1761778800
  },
  {
    "username": "Svtx_08",
    "rating": 9.0,
    "comment": "Owned",
    "timestamp": 1761692400
  },
  {
    "username": "Freak_C64",
    "rating": 9.0,
    "comment": "2 player game",
    "timestamp": 1761692400
  },
  {
    "username": "opti_mind",
    "rating": 9.0,
    "comment": "Phenomenal implementation of many mechanics with different endgame triggers, smart pyramid drafting, and ease of play. The King of 2 Player Games.",
    "timestamp": 1761692400
  },
  {
    "username": "GoldenOlaf",
    "rating": 9.0,
    "comment": "Solo",
    "timestamp": 1761606000
  },
  {
    "username": "austintehguy",
    "rating": 9.0,
    "comment": "2; 30 min",
    "timestamp": 1761519600
  },
  {
    "username": "Eldored",
    "rating": 8.5,
    "comment": "Owned (Mobile), also Owned (Physical)",
    "timestamp": 1761519600
  },
  {
    "username": "rinanagashima",
    "rating": 9.0,
    "comment": "THIS GAME IS AMAZING! It's just as amazing as the full version of the game. 7 Wonders was one of the first games I fell in love with, after Azul.",
    "timestamp": 1761519600
  },
  {
    "username": "LukeDee",
    "rating": 9.0,
    "comment": "Probably one of the best 2-player games there is. Easy to learn. Perfect game time for one or two games.",
    "timestamp": 1761519600
  },
  {
    "username": "threeofsix",
    "rating": 8.5,
    "comment": "Great strategy game that doesn't require thinking 5+ moves in advance. Quick turns, tough decisions, multiple paths to victory. Feels like Civilization without map movement. Each turn is quick and almost always feels productive. Expansions look really neat. One of my preferred 2-player games.",
    "timestamp": 1761429600
  },
  {
    "username": "ChrisMukherjee",
    "rating": 9.0,
    "comment": "Great duel game with multiple win conditions: military supremacy, scientific supremacy, or if neither of those conditions are met, whoever has the most points when the game ends.\n\nThere are two main downsides for us. Firstly, the theme and art are a bit dry. Secondly, we don't enjoy the point salad where you need to tally up points if no one wins via the two main win conditions.",
    "timestamp": 1761429600
  },
  {
    "username": "Pawllik",
    "rating": 8.8,
    "comment": "Geschätzte 20+ mal gespielt.\nLeider fehlt dem Spiel auf langer Sicht etwas strategische tiefe. Es ist schwer sich für eine Strategie festzulegen, da man sehr auf das Kartenglück zählen muss.",
    "timestamp": 1761429600
  },
  {
    "username": "cavapoo",
    "rating": 9.0,
    "comment": "This is a good 2-player game. There is enough interaction to make it like a duel but not so much as to have a negative experience because of the confrontational nature of the duel.\nThe more I play this game, the more I learn what I like about it. Timing is very important in this game as there are multiple ways to win this game or to prevent the opponent from winning the game. I love that there is timing in drafting the cards, in building monuments, and in clubbing multiple moves in a single turn.",
    "timestamp": 1761429600
  },
  {
    "username": "yxd20250823",
    "rating": 9.0,
    "comment": "规则很简单，开一局很快，不过需要考虑的很多，很有策略性",
    "timestamp": 1761429600
  },
  {
    "username": "Lozar",
    "rating": 9.0,
    "comment": "Best duel game. Take the right cards, block your opponent and build your wonders before so you can get the advantage and win the duel.",
    "timestamp": 1761429600
  },
  {
    "username": "Reeflexx",
    "rating": 8.9,
    "comment": "32.95$",
    "timestamp": 1761343200
  },
  {
    "username": "hockeyjones",
    "rating": 8.8,
    "comment": "68\n\nplayed in 2019",
    "timestamp": 1761170400
  },
  {
    "username": "TheGreyKing",
    "rating": 9.0,
    "comment": "One of the best, if not the best two player card game. It plays quickly and isn't too complicated. There's so many good game design choices running throughout the game, like how simple taking a turn is, but how much complexity stems from the choices. It does get a little same-y after about 50 plays, but adding expansions brightens it up again for many more plays!",
    "timestamp": 1761170400
  },
  {
    "username": "Neysmeey",
    "rating": 9.0,
    "comment": "▪7 Cudów Świata: Pojedynek – Sagrada Familia\n▪7 Cudów Świata: Pojedynek – Messe\n▪7 Cudów Świata: Pojedynek – Stonehege\n▪7 Cudów Świata: Pojedynek – Statue of Liberty\n\n▪drewniany insert",
    "timestamp": 1760824800
  },
  {
    "username": "CarsonChandler",
    "rating": 9.5,
    "comment": "This was our go-to game when we were first married! We probably played it over 30 times together. We love the tension in the card drafting and everything else in this game too.",
    "timestamp": 1762649160
  },
  {
    "username": "Daaaaaaa",
    "rating": 10.0,
    "comment": "Tremendo",
    "timestamp": 1762297200
  },
  {
    "username": "loop5",
    "rating": 10.0,
    "comment": "One of the best 2 player games there is right now",
    "timestamp": 1762124400
  },
  {
    "username": "mimiwo",
    "rating": 10.0,
    "comment": "Hard to top the original, but...better in every way? I suppose not if you have multiple friends",
    "timestamp": 1761865200
  },
  {
    "username": "NikiasonBoards",
    "rating": 10.0,
    "comment": "super spannendes 2-Personenspiel mit unglaublicher Abwechslung und Vielfältigkeit. Einfach genial!",
    "timestamp": 1761429600
  },
  {
    "username": "YikSiu",
    "rating": 9.5,
    "comment": "good game",
    "timestamp": 1761343200
  },
  {
    "username": "Freydey",
    "rating": 10.0,
    "comment": "2 Versus",
    "timestamp": 1761343200
  },
  {
    "username": "Verdesin08",
    "rating": 10.0,
    "comment": "1. Tengui",
    "timestamp": 1761343200
  },
  {
    "username": "Northrend",
    "rating": 10.0,
    "comment": "Une adaptation parfaite en mode de 7 wonders en mode deux joueurs.\n\nPas besoin de connaître l'original pour y jouer mais vous serez en terrain connu si vous avez déjà joué à son aîné.\n\nLe jeu se veut quand même assez différent par ses conditions de victoire, instantanées pour deux d'entre elles, qui obligent à guetter attentivement ce que fait son adversaire. Une part de hasard avec les cartes face cachée qui peut néanmoins selon moi être contenue dans une certaine mesure par ses propres choix de cartes pour, a minima, limiter les potentiels dégâts si son adversaire est chanceux sur ce qui sort lors de son tour.\n\nDes avantages scientifiques très intéressants et dont la disponibilité varie selon les games puisque seule une sélection de jeton sera disponible à chaque partie, donnant là encore une certaine latitude dans notre stratégie pour atteindre la victoire.\n\nUn jeu à avoir dans sa ludothèque selon moi.",
    "timestamp": 1761256800
  },
  {
    "username": "Nights1515",
    "rating": 10.0,
    "comment": "With both expansions this is a top tier game ?",
    "timestamp": 1761170400
  },
  {
    "username": "DewDurtTea",
    "rating": 10.0,
    "comment": "Sleeved",
    "timestamp": 1761084000
  },
  {
    "username": "Kwnanan",
    "rating": 10.0,
    "comment": "Ένα από τα καλύτερα παιχνίδια για 2 παίκτες. Εύκολοι κανόνες συνδυάζονται υπέροχα με στρατηγικό βάθος για ένα απολαυστικό αποτέλεσμα.\nΤο 7 wonders duel είναι ένα από τα παιχνίδια που παίζω πάντα εύκολα και ευχαριστιέμαι σε κάθε περίπτωση.",
    "timestamp": 1760306400
  },
  {
    "username": "SammySnijbonen",
    "rating": 9.5,
    "comment": "The game has a few clever ways in its set-up to ensure that every game plays out differently (Wonder selection, placing and unlocking a 'structure' of building cards, different science chits, etc.).\n\n 7 Wonders: duel refines the graphic design of its older brother 7 Wonders.\n\n It takes up more table space than its box makes you think it does, but it's still a great game to take with you on vacation.\n\n The three paths to victory almost feel like a mini-game. In a game with two players of roughly the same skill level, victory will probably be decided on points. This entices you to push yourself a bit more to try and win a military or science victory, without lagging behind on points. All this keeps you 'on the edge'.\n\n----\n\n The downside of the three paths to victory is that a more experienced player will easily defeat a beginner. On the other hand, this speaks volumes about the game's luck factor too.\n\nAlso includes:\n- 7 Wonders Duel: The Messe Promo Card\n- 7 Wonders Duel: Metal Conflict Pawn\n- Ex ludis by Miguel Coimbra\n- 7 Wonders: Metal Coins\n- 7 Wonders Duel + Pantheon: Folded Space Insert",
    "timestamp": 1759701600
  },
  {
    "username": "boobymaster",
    "rating": 10.0,
    "comment": "Brilliant 2-p game, infinitely enjoyable",
    "timestamp": 1759615200
  },
  {
    "username": "CicutaGames",
    "rating": 10.0,
    "comment": "Es un muy buen juego para jugar de a dos personas. Es un buen punto medio si no quieres algo liviano, pero tampoco algo que dura tanto tiempo. Premia la rejugabilidad, al conocer las cartas incrementa la tensión de cada carta revelada. Las expansiones lo hacen crecer más aún, donde ya se puede llegar a sentir un juego muy completo y con harta profundidad en las decisiones",
    "timestamp": 1759356000
  },
  {
    "username": "Bazmondo123",
    "rating": 10.0,
    "comment": "A fabulous game and one of my wife's and my favourites.\n\nPlayed with metal coins, broken token insert, metal military and gate token, and the Pantheon expansion makes this game a 10 for us.\n\nA wonderful, tactical 2-player experience.\n\nWe love that there are multiple paths to victory.",
    "timestamp": 1759269600
  },
  {
    "username": "paddy101",
    "rating": 9.5,
    "comment": "Lots of choices and strategy in a 2 player game. And its quite fast paced as well.",
    "timestamp": 1759096800
  },
  {
    "username": "AverageDipper",
    "rating": 9.5,
    "comment": "2",
    "timestamp": 1759096800
  },
  {
    "username": "Peppie_Geek",
    "rating": 9.5,
    "comment": "Insert - Folded Space\nSleeved - DS Clear/Matte",
    "timestamp": 1758751200
  },
  {
    "username": "ScoutDan",
    "rating": 9.5,
    "comment": "An easy to learn, highly strategic two-player competitive game. My 10-year-old daughter really enjoys this game. I also played with Pantheon and Agora expansions. They added different dimensions of strategy and winning conditions.",
    "timestamp": 1758664800
  },
  {
    "username": "evangelionys",
    "rating": 10.0,
    "comment": "Had lots of fun playing it",
    "timestamp": 1758664800
  },
  {
    "username": "realpikkio",
    "rating": 9.5,
    "comment": "The gameplay mechanics feel like a polished/improved version of the original game.\nIn particular I prefer how science is handled here, and the war mechanic is more interesting as well.\nI also prefer the fact that you draft/select 2 Wonders per player rather than having them fixed by your civilisation, as it gives a lot more replayability value.",
    "timestamp": 1758319200
  },
  {
    "username": "Guilive",
    "rating": 10.0,
    "comment": "Favorite duel game",
    "timestamp": 1758060000
  },
  {
    "username": "tokkinho",
    "rating": 10.0,
    "comment": "hands down, the best two player game in my collection. without expansion, this is a nail-biting, thinky, yet swift, game. add an expansion (i recommend adding only one per game, not both) this becomes a much heavier and more complex affair. love the theme. love the game!",
    "timestamp": 1758060000
  },
  {
    "username": "Brett_Matze",
    "rating": 10.0,
    "comment": "2 Spieler\n+ 2 Erweiterungen: Agora & Pantheon",
    "timestamp": 1757973600
  },
  {
    "username": "Lironcareto",
    "rating": 10.0,
    "comment": "Probably my favorite 2-player short and small game. Even better than the bigger 7 Wonders, keeping all its flavor, and way more competitive.",
    "timestamp": 1757973600
  },
  {
    "username": "kwhite1",
    "rating": 10.0,
    "comment": "P",
    "timestamp": 1757887200
  },
  {
    "username": "Lecaro",
    "rating": 9.5,
    "comment": "Kurzrezension:\n\"7 Wonders Duel\" ist der kleine Bruder des ersten 'Kennerspiel des Jahres': \"7 Wonders\". Das ursprüngliche Spiel hatte ebenfalls einen Zweispielermodus, der aber nicht wirklich funktionierte. Die Mechanismen der Duellvariante sind ganz anders und doch sehr ähnlich!\n\nSpielablauf:\nVor der ersten Runde werden acht Weltwunder zwischen den beiden Spielern gedraftet. Im Verlauf des Spiels dürfen aber nur sieben davon errichtet werden.\nPro Spielrunde werden Kartenreihen ausgelegt, wobei Karten der unteren Reihen über denen vorheriger Reihen liegen. Der aktive Spieler darf immer nur freie Karten nehmen, also diejenigen, auf der keine andere Karte liegt. Liegen nach dem Nehmen verdeckte Karten frei, werden diese sofort aufgedeckt.\nBeim Nehmen passieren verschiedene Effekte:\n- Gelbe Karten erwirtschaften meist Gold oder vergünstigen den Ressourcenkauf.\n- Braune und graue Karten stellen Ressourcen zur Verfügung, die wiederum zum Bau von blauen (Siegpunkte), grünen (Wissenschaft) oder roten (Militär) Karten gebraucht werden.\nDie genommene Karte kann entweder in die eigene Auslage gelegt, für Münzen abgeworfen oder mit ihr ein Weltwunder errichtet werden. Sobald die letzte Karte aus der Auslage genommen wurde, endet das Zeitalter und das nächste wird aufgebaut.\nDas Spiel kann auf drei Arten enden: Nachdem das dritte Zeitalter, also die dritte Kartenauslage durchgespielt ist, gewinnt der Spieler mit den meisten Punkten. Vorzeitig ist es zu Ende, wenn ein Spieler eine bestimmte Menge Militärsymbole sammeln konnte und seinen Gegner damit überrumpelt. Die dritte Möglichkeit besteht im Wissenschaftlichen-Sieg, wenn es einem Spieler gelingt sechs verschiedene Wissenschaftssymbole zu ergattern.\n\nErweiterungen:\nDie erste Erweiterung \"Pantheon\" fügt dem Spiel Götter hinzu. Sie werden in einer Auslage oberhalb des zentralen Spielbretts gelegt und können mit den neuen Aktionen beeinflusst werden, womit sie dann dem entsprechenden Spieler Vorteile im Spiel bringen. Diese Aktionen liegen auf den verdeckten Karten des zweiten und dritten Zeitalters. Immer derjenige, der ein Aufdecken provoziert, erhält die Gunst der Götter, was die Wahl der Karten noch spannender macht!\nFür Anfängerrunden stellen diese erweiterten Optionen aber zu viel Möglichkeiten zur Verfügung. Daher kann ich nur eine Empfehlung für geübte Spieler des Grunddspiels aussprechen.\n\nDie zweite Erweiterung \"Agora\" bringt Politik ins Spiel. Dazu wird unterhalb des zentralen Spielbretts ein Politikbrett ausgelegt. Auf ihm sind Parlamentsmitglieder, die von den Spielern mit einer neuen Kartenart beeinflusst werden können. Zusätzlich bietet die Politik eine neue Siegmöglichkeit, wenn es einem Spieler gelingt alle Politiker zur gleichen Zeit auf die eigene Seite gezogen zu haben, was nicht einfach, aber durchaus möglich ist.\nDiese Erweiterung ist ebenfalls nicht für Anfänger geeignet, da sie sogar noch mehr Optionen wie die Erste bietet. Kenner und Experten bietet sie aber noch mehr Abwechslung und Entscheidungsmöglichkeiten, die für den eigenen Spielzug berücksichtigt werden müssen. Immerhin muss eine zusätzliche Siegmöglichkeit im Blick behalten werden.\nIch fand sehr lange das Grundspiel, so wie es ist, völlig ausreichend. Nachdem ich aber noch einige Partien mehr gespielt habe, empfinde ich die beiden Erweiterungen durchaus gut und nehme eine der beiden, manchmal sogar beide sehr gerne mit hinein, wenn mein Gegenüber ebenfalls ein Kenner des Grundspiels ist.\nFür mich zwei sehr gelungene Erweiterungen eines sehr guten Grundspiels.\n\nMeinung:\n\"7 Wonders Duel\" ist wohl eines, wenn nicht sogar das beste Zweispielerspiel in meinem Spielschrank.\nEs nutzt den von mir geliebten Draftmechanismus auf eine vollkommen neue und für zwei Spieler gut funktionierende Art. Zudem sind die Effekte der Karten und die Matrix in der diese ausliegen so abgestimmt, dass es immer wieder spannend ist, welche Karte ich aus der Auslage nehme und welche ich damit meinem Gegner zur Verfügung stelle. Hinzu kommen die recht teuren Wunder, die ebenfalls errichtet werden können und sehr mächtige Bonnies zur Verfügung stellen.\nMir gefällt das Spiel außerordentlich gut und ich schlage keine Partie aus, wenn sich eine Gelegenheit dazu ergibt.\nDie beiden Erweiterungen fügen dem Grundspiel weitere Optionen hinzu, die ich nur Spielern empfehlen kann, die das Grundspiel bereits sehr gut bis auswendig kennen.\n\"7 Wonders Duel\" ist perfekt. Ich liebe es!",
    "timestamp": 1757887200
  }
]