[
  {
    "username": "Scifi66",
    "rating": 1.0,
    "comment": "Another of the medium heads down Euros that didn't register. Wouldn't return to it.\n+ Different valid point strategies available - cards, combat and exploring.\n+ Hint of a story in the campaign game.\n- Theme is pasted on\n- Board is cluttered\n- Random card draw is extremely annoying\n- Doesn't have the exciting arc that you feel in Great Western Trail\n- Tiny stacked discs on player boards are too small\n- Game felt long even with rushing end game >2.5 hours without including setup or pack away",
    "timestamp": 1750975200
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "Lake Maracaibo has the most lightning strikes on the planet! That's not in the game, I learned it elsewhere. Here you're just collecting coins and VPs while ignoring everything interesting.\n\nOn the bright side, you can rush the ending if you want this over faster. Most games don't allow you that mercy!",
    "timestamp": 1725314400
  },
  {
    "username": "KvdBergh",
    "rating": 1.0,
    "comment": "Great game, I give it an 8 for gameplay, but a 1 for theming. Why do we keep going back to the same old well of subjugating natives and slave labor? You could have picked any other theme.",
    "timestamp": 1671922800
  },
  {
    "username": "Mayasty",
    "rating": 1.0,
    "comment": "Another game of genre: „let’s put maximum abstract elements to the rulebook and let’s pretend they all work together”. But all of this is simply a fake to keep euro geeks excited. After dozens of similar heavy non-sense euros I worked out my own strategy to play such games and not get crazy. I don’t calculate anything because in such overabundance of abstract factors it’s not possible to play consciously. How can you evaluate in the middle of the game whether the advance on one track is more profitable than erecting the building? You can’t. Especially when almost each element of the game may give you VPs. So, when I play such games I don’t calculate anything. I just do what I can afford, what the game offers best at given moment and what doesn’t require too much thinking to keep downtime on minimum level (read: to end up this nightmare as quickly as possible). And I observe the final results. If I win when I play with euro geeks who calculate every single move than I know the game sucks. This one I won! Full stop.\n\nP.S. And you know what’s the funniest thing? After 1 hour of listening to the rulebook explanation I gave up last 15 minutes due to overall boredom and exhaustion. So I didn’t learn how to use assistants and synergy tokens. Never mind. They both turned out to be perfectly useless for my victory. 15 minutes of my live saved :-)",
    "timestamp": 1654984800
  },
  {
    "username": "ultimoratio",
    "rating": 1.0,
    "comment": "Another boring modern Euro with little player interaction and so many mini games taped together, where efficiency is the name of the game.\n\nGood or even great for some, but this is just absolutely dull to me nowadays when I can just play any Splotter title.",
    "timestamp": 1646262000
  },
  {
    "username": "mw60",
    "rating": 1.0,
    "comment": "The game is awash in symbols that require constant head scratching and referral to the rulebook. This makes it difficult to learn and ultimately only works if you play it frequently enough to remember what the icons mean. At least the cards have some text. Clearly not well thought out from the user interface perspective.",
    "timestamp": 1604185200
  },
  {
    "username": "Nomorepiratedgame",
    "rating": 1.0,
    "comment": "For working with Yoka, a company known for its plagiarism of Bang!",
    "timestamp": 1585090800
  },
  {
    "username": "kplayer1177",
    "rating": 1.0,
    "comment": "There's only 2 non-white characters in this game among multitudes of characters that are very white. Is it racist? I don't know but I really don't like that.",
    "timestamp": 1581116400
  },
  {
    "username": "Fevin",
    "rating": 2.0,
    "comment": "Une lisibilité inexistante, tu passe 80% de ton temps à chercher ce que tu peux faire et 20 % à vraiment choisir. Répétitif, tu fais 4 tours identique. Les choix, cartes, effets ne sont pas intéressants. Tu attends longtemps ton tou. C'est la foire au trigger; Dom' à fait un octo-coup avec 7 triggers consécutifs long à résoudre.",
    "timestamp": 1756936800
  },
  {
    "username": "TrevorJr26",
    "rating": 2.0,
    "comment": "I'm so disappointed by this game. The gameplay: pretty standard euro game with maybe one unique mechanism that also happens to be a ballache. The art: truly one of the ugliest I've ever seen, looks like it was made in Microsoft Word. This isn't old school artwork, it's just bad artwork and there's no excuse these days. The rest: they really made a game about the caribbean and made everyone white except the 'native' card. The designer is on record as saying it's just meant to be like pirates of the caribbean. Ok then why are we painstakingly simulating the naval force of Britain, Spain and France then? I never bothered with the campaign system, seemed superficial and just makes the setup even worse. Terrible rulebook as well. Gave it a few goes and didn't even want to finish our last game. So glad to have offloaded it.",
    "timestamp": 1713132000
  },
  {
    "username": "Tonkary",
    "rating": 2.0,
    "comment": "The complexity of this game is thoroughly off putting. I'm not averse to complex gsmes, I regularly play such, but it feels like the designers must have never actuslly played it before release, its impossible to understand without constantly referring to the rules, and impossible to enjoy as a result. I hope to never see this game again.",
    "timestamp": 1703372400
  },
  {
    "username": "Bechara",
    "rating": 2.0,
    "comment": "Too many mechanics, feels very disconnected. Theme makes zero sense and takes too long for what it offers. Art is boring.",
    "timestamp": 1701385200
  },
  {
    "username": "Greenflash21",
    "rating": 2.0,
    "comment": "Opened the box... Looked at 2000000000 Pieces. Closed box and took it to the local game store to have",
    "timestamp": 1640559600
  },
  {
    "username": "Trigonomical",
    "rating": 2.0,
    "comment": "The colonizing theme without consequence and lack of diversity within the game cards really just ruined the experience for me. The rules tried to state they abstracted the horribleness out of the game which seemed even more like whitewashing the whole situation while continuing to exploit the region and events of history for personal gain. I guess I want a game that is more considerate and less callous about these things.",
    "timestamp": 1636585200
  },
  {
    "username": "michel_w",
    "rating": 2.0,
    "comment": "Boring, long, repetitive and complicated point salad. No theme. Won't play again.",
    "timestamp": 1634421600
  },
  {
    "username": "Pura_Vida",
    "rating": 2.0,
    "comment": "Don't understand why anybody would want to play a game with a theme like this. In 2021.",
    "timestamp": 1632088800
  },
  {
    "username": "SaphariGames",
    "rating": 3.0,
    "comment": "Mechanically an 8\n-5 ranks for trivialization of colonialism and the genocide of indigenous peoples in theme",
    "timestamp": 1753221600
  },
  {
    "username": "PotatoKing_",
    "rating": 3.0,
    "comment": "욕심이 과했다 - 바구니에 넘쳐흐르는 물",
    "timestamp": 1750629600
  },
  {
    "username": "Ephorus",
    "rating": 3.0,
    "comment": "What I like:\n- I can see how the game might appeal to players who enjoy sandbox-style Euros with lots of paths to explore. There’s a sense of freedom in how you approach the game, and some of the card synergies can be satisfying when they click.\n\nWhat I dislike:\n- It’s just too much. Too many subsystems, too many effects, too many icons, too many steps to do anything. It’s not that I mind complexity — but here, it feels bloated. Like the design kept adding layers without asking whether they actually improved the experience.\n- The game falls into that “standard Euro with a generic theme” category. The setting is barely there, and the mechanics don’t do much to bring it to life. The combat system especially feels abstract and disconnected — powerful, yes, but thematically flat.\n- The quest action feels underpowered. It’s supposed to be one of the more thematic parts of the game, but it rarely feels worth the action. Meanwhile, combat is often the most efficient path, which just reinforces how off-balance the systems can be.\n\nFinal thoughts:\nMaracaibo tries to be a grand, sprawling Euro with lots of replayability and strategic depth. And to be fair, some players love that. But for me, it ended up feeling like a collection of half-connected systems, all competing for attention. There’s ambition here, but not enough cohesion. I respect what it’s trying to do — I just don’t have the patience for it anymore.",
    "timestamp": 1750284000
  },
  {
    "username": "NotEntitled",
    "rating": 3.0,
    "comment": "Too complex.",
    "timestamp": 1745013600
  },
  {
    "username": "btasam",
    "rating": 3.0,
    "comment": "Maracaibo falls in as a fairly standard euro with a generic theme and maybe just a little too much going on. Many of the subsystems are interesting but fragile depending on card synergy and pacing. The campaign adds variable locations which incentivize players in directions that feel fresh, but I wouldn't buy this for the story.\n\n- Revealing prestige cards is poorly designed\n- Removing goods from ship feels derivative and arbitrary\n- The atrocious rulebook. (i.e. quests (exploring quests p.7, fulfilling quests p.9, quest structure p.15, and quest requirements p.23).",
    "timestamp": 1735513200
  },
  {
    "username": "BoardGamingCouple",
    "rating": 3.0,
    "comment": "3/5\n\nMaracaibo was a lot of fun. There were several different things going on. The theme isn't really there sadly. There are far too many fiddly components for setup time. The gameplay takes a bit too long.\n\nCheck out Pirates of Maracaibo or Great Western Trail El Paso.",
    "timestamp": 1735254000
  },
  {
    "username": "tectactoe",
    "rating": 3.0,
    "comment": "Love the card play and the \"freedom\" of the rondel, though one gets the notion that fighting for the influence tracks is possibly too important while things like quests not important enough and that the former is always a strong strategy and the latter always a weak one, making several turns throughout the game feel mechanical and one-note. I've not played nearly enough to make a total determination but fighting definitely seems dominant. Sometimes insurmountable. But it could be similar to something like e.g. military strength in THROUGH THE AGES - yes, clearly very strong, and you will get destroyed if you ignore it, but you can find many other mainlines to victory as long as you keep pace (somewhat) and don't fall \\too\\ far behind. The \"disc removal\" mechanism is one I admittedly like a lot (though it was done with much greater effect already in GREAT WESTERN TRAIL). End of round procedure is a little clunky. Some of the various card synergies are fascinating if you can pull them off successfully.",
    "timestamp": 1734217200
  },
  {
    "username": "iplaybgnaked",
    "rating": 3.0,
    "comment": "Enjoyable but mostly dull and unremarkable rondel point salad tableau building race, for all of the rules and fiddly setup the game itself is fairly simple and as a result the decisions are too obvious and straight forward to be an interesting optimization puzzle. Unfortunately the one exciting thing about the game, the multi use cardplay, is hampered by the too strong luck of the draw as the game goes by too quickly with competent players for there to be enough turns for the randomness to even out.",
    "timestamp": 1732143600
  },
  {
    "username": "Beastly_Venturer",
    "rating": 4.0,
    "comment": "1 play. Was really disappointed with this one. PoM is a better implementation and plays a little quicker too.",
    "timestamp": 1744236000
  },
  {
    "username": "SvenUilhoorn",
    "rating": 3.5,
    "comment": "Phew, this is harsh. This was one of the worst board game experiences I've had so far. I have to say we watched a \"how to play Maracaibo\" and I've bought the game second hand with the uprising expansion in the box as well, so that may have caused a slight bit of frustration.\n\nThe video was already pretty bad with the guy going through things so fast that it felt more like a video you can watch when you've played the game ten times two years ago than explaining it to new players. We double checked everything with the rule book and some things were graphically different than the rules, some parts seemed to be missing of there were more. Not a solid start, but hey.\n\nStarted \"just doing things\". We didn't feel any connection to the theme at all; the combat I cannot explain thematically at all, the trading and then taking a brown disc from your ship..? I'm clueless. The cards and their background color for which you have a bit of a reference (which feels like an afterthought), an absolute overload of icons, a kind of unclear game flow that took us pretty much nowhere.\n\nIt's pretty hard to review a game that I never really managed to understand; I don't know why I'm doing what I'm doing, and it felt pretty frustrating. I'm looking for a good thread that explains the game flow a bit more clearer, then one more game, or it's the same road that Carnegie took for me: a sale.\n\nPretty much five hour flew by and we hardly finished one and a half round. Lisboa previously took the badge for \"no idea what I'm doing and I'm not having fun\", but even in the first game I had some \"I'm doing something genius\" moments.\n\nThis didn't.",
    "timestamp": 1737241200
  },
  {
    "username": "neural_net",
    "rating": 4.0,
    "comment": "Everything is fantastic gameplay-wise, I like the artwork and UX too. Setup/teardown time is too long and there is some fiddliness with the wooden discs. This is the only reason why it's not a 10.\n\nThe sandbox nature makes me very excited, I hope we can play the campaign soon.\n\nUpdate 1:\nAfter several play, it seems you always have to build around 5 core strategies (quest hunters and compasses, master builders with lot of village actions, exploring, combat, assistants). If you don't choose one of them, you're screwed. I don't really like this aspect, but still a nice game with a good variety of cards and entertaining races (round, explore track, nation tracks).\n\nCampaign's story is not interesting, but the new game mechanics/tiles are really cool.\n\nUpdate 2:\nIt just gets worse and worse after every session. Most of the time the initial hand will determine your strategy and other players strategies as well. You just have to execute it without meaningful decisions, and the worst thing is, your opponents doesn't have any way to interact with that. Only exception is compass strategy, where you can hate pick quests...but most of the time it's just too expensive to waste a turn on a hate pick.\n\nExplore track is more detached than Terra Mystica's cult track. It bugs me so much now.\n\nOriginal rating: 9\nNew rating: 7.5\nNew rating: 5\n\nI'm sad, this game promised so much in the first 2 plays. A eurogame with this weight shouldn't allow detached mechanisms, solitaire gameplay and narrow strategic options.",
    "timestamp": 1732489200
  },
  {
    "username": "ashkai",
    "rating": 4.0,
    "comment": "Decided it was not meant for us upon reading the rulebook.\n\nThis did not change even when the coop expansion came out.",
    "timestamp": 1730934000
  },
  {
    "username": "OscarBismarck",
    "rating": 4.0,
    "comment": "It felt it was just Jamaica with some war aspect into the game.",
    "timestamp": 1730847600
  },
  {
    "username": "ScotchYeti",
    "rating": 4.0,
    "comment": "Solo rating: 5, multiplayer: 6\n\nPlaying solo in the app it's really hard to keep the overview. It took some time to understand how the different point tracks work and it doesn't help that Jean has a very particular style.\n\nIn a Multiplayer game it's better but for me it's too much, or rather the many parts destroy the theme. E.g. I don't see me winning as a \"smuggler\" who fights for England. No, you have to keep an eye on the other mechanics too in a rather abstract manner.",
    "timestamp": 1727301600
  },
  {
    "username": "Arnold_Lyon",
    "rating": 4.0,
    "comment": "An over-rated game, in which you navigate by sight without being able to establish a strategy for the whole game due to an obscure scoring method. Nice material, though.",
    "timestamp": 1719612000
  },
  {
    "username": "hiimjosh",
    "rating": 4.0,
    "comment": "(Played at 4p)\n\nI think I like this more than GWT (yay, no deckbuilding). But - my goodness - there is so much crap in this design. It's a mess. Multi-step conversions for the sake of it. Maybe I will eventually like it, though I have no patience anymore for this kind of thing. Do you want to invest 20 hours to learn how to start to play something competently? With very few exceptions, I don't.",
    "timestamp": 1716069600
  },
  {
    "username": "vdwoord",
    "rating": 5.0,
    "comment": "Played this with some friends (a 4 player game) and I didn't enjoy it. I like Pirates of Maracaibo way better.",
    "timestamp": 1762210800
  },
  {
    "username": "swordman123",
    "rating": 5.0,
    "comment": "-1",
    "timestamp": 1758060000
  },
  {
    "username": "ksd_d",
    "rating": 5.0,
    "comment": "長いゲームにしてはマルチ性がやや低いと思います。",
    "timestamp": 1756418400
  },
  {
    "username": "Joeristoef",
    "rating": 5.0,
    "comment": "Geekmarket",
    "timestamp": 1754517600
  },
  {
    "username": "Drelorean",
    "rating": 5.0,
    "comment": "too low on theme and too heavy on the points salad for me.",
    "timestamp": 1752012000
  },
  {
    "username": "HBGlover",
    "rating": 5.0,
    "comment": "I play this from time to time and never feel like I'm going to grok it all the way. I enjoy it but can't compete.",
    "timestamp": 1748037600
  },
  {
    "username": "tbrofromspace",
    "rating": 5.0,
    "comment": "Maracaibo asks \"what if Great Western Trail, but fun?\" The answer will surprise you.",
    "timestamp": 1743631200
  },
  {
    "username": "tristandevanthery",
    "rating": 5.0,
    "comment": "Compliqué pour rien.",
    "timestamp": 1736463600
  },
  {
    "username": "UndutifulCarrot",
    "rating": 5.0,
    "comment": "A bit of a miss for us. It seemed like a game that was complicated merely by the sheer amount of choice and therefore actions you could take. The gameplay loop was a bit of a miss for us. It was thinky but not really engaging",
    "timestamp": 1733612400
  },
  {
    "username": "MissP1ggy",
    "rating": 5.0,
    "comment": "Very good, interesting game.\nenglish summary: https://boardgamegeek.com/filepage/200291/maracaibo-quick-ru...",
    "timestamp": 1724191200
  },
  {
    "username": "LeBao",
    "rating": 5.0,
    "comment": "I play several Pfiser games. This to me prove that Pfiser design (and deck building in general) is not for me, I see why people like game like GWT, Mombasa or this but I just find the deck building element is not for me. But, I still enjoy this game over GWT, it's kinda solid and kinda fun to play, willing to play it occasionally like 2/year.",
    "timestamp": 1717970400
  },
  {
    "username": "cinnzel",
    "rating": 5.0,
    "comment": "Recupera mecánicas que ya habían triunfado en Great Western Trail o Mombasa en un juego ágil y con buena sensación de progreso, aunque poco intuitivo. Muchísima rejugabilidad para los que les gusta repetir juego hasta la extenuación, incluyendo también una campaña con mucho contenido propio.",
    "timestamp": 1716847200
  },
  {
    "username": "yiechow",
    "rating": 5.0,
    "comment": "Only played once and feeling a little bit boring.",
    "timestamp": 1715205600
  },
  {
    "username": "willhigh_bg",
    "rating": 5.0,
    "comment": "I'm not fan of multiple-purpose card design, e.g. La granja. It make things complicated and full of different icons on one card sometime confuses me. Though, this is a fair-fine game to me. No particular creative design that surprises me.",
    "timestamp": 1714082400
  },
  {
    "username": "Aahz74",
    "rating": 5.0,
    "comment": "Really enjoyed the game initially (probably 7-8 score) but after playing the campaign: (1) I wasn’t impressed with the campaign itself, and (2) it really burned me out on playing this game. Honestly, I don’t really need to play the game ever again.",
    "timestamp": 1713909600
  },
  {
    "username": "Mykander",
    "rating": 5.0,
    "comment": "While a good game the setup, both initial and if replaying immediately afterwards, is ridiculous.\n\nIn addition the story isn't notable or worth playing through and top decking one of a few critical early cards is likely game winning.",
    "timestamp": 1708210800
  },
  {
    "username": "Herald Selenay",
    "rating": 6.0,
    "comment": "Pirates with a solo mode, but might be too heavy...",
    "timestamp": 1762210800
  },
  {
    "username": "Dlearn",
    "rating": 6.0,
    "comment": "Strange mishmash of GWT mechanics with too many icons. No clear theme and have some poorly balanced cards. There are better games to play than this.",
    "timestamp": 1761606000
  },
  {
    "username": "Auroric",
    "rating": 6.0,
    "comment": "Point salad, mostly solitaire, rondel efficiency game with a dry and questionable theme.\n\nI was recommended this one because Great Western Trail is one of my favourite games. This one is very different, but still has the rondel movement and activation of the space you land on, but with more of a tableau building element. I like how much variability there is in the setup, cards, quests, etc, and there's tons of different strategies that all seem viable.\n\nUltimately though, I'm not a big fan of Maracaibo. It feels dry, unexciting, and the theme is definitely problematic for many people. Much of the game feels tacked on, and there's nothing that really grabs me or piques my interest. It also feels very solitary; even though there's plenty of small interactive points, none of them feel very intentional or impactful. There's objectively a well designed game here, but I would much rather play GWT. This is much less charming to me.",
    "timestamp": 1760565600
  },
  {
    "username": "Avid_Equinox",
    "rating": 6.0,
    "comment": "Feels like a great western trail copy-paste job...\nI'd rather play GWT as the building interaction on the shared board has been removed in this design (I prefer games with direct player interaction).",
    "timestamp": 1760306400
  },
  {
    "username": "bivaterl",
    "rating": 6.0,
    "comment": "Took off wishlist. Still like theme and play is fine, but fiddly, takes forever to setup (with expansion, yet without expansion, requires a very busy favor track for each country). Most complex, and while not bad and would replay, won't be looking to add this to the library.",
    "timestamp": 1758405600
  },
  {
    "username": "Killi",
    "rating": 6.0,
    "comment": "Okayish game. Probably won't play again.",
    "timestamp": 1756504800
  },
  {
    "username": "willbeplayin",
    "rating": 6.0,
    "comment": "Not an instant out-of-the-gate classic like GWT was but after few plays the game plays a lot smoother. There's a lot of small rules here and there and the board/player aids don't really help the issue. The rulebook is quite bad too and some rules are really not at all intuitive.\n\nSurprisingly the best thing, after the multi-use cards, is the legacy element which I've enjoyed to my surprise. Not for the story, for the varied board state.\n\nAfter several plays, it kept getting better and better. However the more we played, it got a bit stale and there's one thing in the story that really made me dislike the campaign.",
    "timestamp": 1751839200
  },
  {
    "username": "Kilerazn",
    "rating": 6.0,
    "comment": "Heavy. Lots of icons",
    "timestamp": 1750716000
  },
  {
    "username": "dtmoney75",
    "rating": 6.0,
    "comment": "1 Play\n\nPlayed at: 3",
    "timestamp": 1749852000
  },
  {
    "username": "Iron_Salamander",
    "rating": 6.0,
    "comment": "Decent game to be sure. Wasn't expecting it to be as fun as it was, but also felt a bit slow, although that may be from inexperience. Rating likely to climb if it moves faster in future plays.",
    "timestamp": 1747605600
  },
  {
    "username": "traemyn",
    "rating": 6.0,
    "comment": "I am not very good at these types of games.",
    "timestamp": 1747000800
  },
  {
    "username": "Pacres",
    "rating": 6.0,
    "comment": "Se me hace repetitivo la propia partida",
    "timestamp": 1747000800
  },
  {
    "username": "speter22",
    "rating": 6.0,
    "comment": "Great Western Trail’s younger, more ambitious brother. It’s got systems upon systems that layer on top of one another in very interesting ways, and the core gameplay loop is really pretty exciting for a euro. Typical of chunky games like this, there are dozens of strategies you could try, and it seems to me that it probably has a lot of replayability for a low-interaction affair.\n\nIt’s a perfectly good euro game, but it gives me a similar feeling as GWT does, and it takes longer, has more rules, turns are way slower, and it has less player interaction (which GWT doesn’t have much of to begin with). Maracaibo’s theme is also much, much worse. It’s colonial Caribbean setting does nothing to engage with its subject matter, which makes you wonder why they chose such a problematic theme in the first place. I mean, it kind of comes across as a fun tropical romp, but you didn’t need to set it in this time and place to get that across! It’s just kind of weird and comes across as a bit lazy, IMO. The rest of the design definitely isn’t lazy - it’s actually a bit too much. An elegant euro game, this is not.\n\nThe only thing I think that it has over GWT is the tableau building, which can be really interesting and fun, but I don’t think there will ever be a time that I’ll play this over GWT.",
    "timestamp": 1746655200
  },
  {
    "username": "heathbarATL",
    "rating": 6.0,
    "comment": "(BGA) Obtuse strategy and questionable theme, but it's a pretty good game.",
    "timestamp": 1745013600
  },
  {
    "username": "juanuxdelux",
    "rating": 6.0,
    "comment": "Dormitorio kallak 5x5 en 5x2",
    "timestamp": 1744236000
  },
  {
    "username": "dunedragn",
    "rating": 6.0,
    "comment": "8.5",
    "timestamp": 1740697200
  },
  {
    "username": "kesulin",
    "rating": 7.0,
    "comment": "Buen juego euro. Lo interesante es la gestión del tiempo de ronda con la mecánica de saltos del barco.\n\nPuede que el camino para puntuar este descompensado hacia las batallas.",
    "timestamp": 1762124400
  },
  {
    "username": "eniac_g",
    "rating": 7.0,
    "comment": "Culmination of his previous games yet I prefer GWT or Mombasa over this one.\nFeels less fluent, lots of iconography and quit some ambiguous rules.\nHard one to teach and not a game you'll play well or appreciate after one go at it.",
    "timestamp": 1761692400
  },
  {
    "username": "Lowengrin",
    "rating": 7.0,
    "comment": "My rating for it is still soft. Sometimes I find myself really agonizing over my decisions (in a good way) and others I'm either tuning out (or getting frustrated) because the game is running on the long side (even though we've trimmed off at least thirty-minutes from our first few plays). Like Great Western Trail before it, Maracaibo is a rondel game. This time it's set in the Caribbean, but it's a pasted on theme so don't expect it to give the sense of swashbuckling and daring-do. Even combat is abstracted to moving disks and placing cubes. Playing using the campaign cards adds a bit of variation between games, but I don't find they add all that much to the game. In fact, they tend to slow down the game and this offsets the plus they get for novelty. All in all, I do enjoy Maracaibo more than Great Western Trail, but as Pfister's games go, I still prefer Mombasa.",
    "timestamp": 1761692400
  },
  {
    "username": "Brot_und_Spiel",
    "rating": 7.0,
    "comment": "Bin mit dem Spiel noch nicht richtig warm geworden.\nGreat Western Trail ist Klasse - Maracaibo für mich noch nicht.\nMuss es mal mit meinen GWT-Kumpels spielen.",
    "timestamp": 1760824800
  },
  {
    "username": "SteoanK",
    "rating": 7.0,
    "comment": "I've played a lot on the app but still really enjoy this game. I may end up selling it one day given that Boonlake is getting an expansion and I would still be able to play this on the app version.",
    "timestamp": 1760392800
  },
  {
    "username": "Lightspeed_aust",
    "rating": 7.0,
    "comment": "Four games in so far playing solo. Set up is a pain in the ass and I could see lots of incorrect scoring due to confusing iconography. Obviously have to compare to GWT, which I think is a fantastic game.\nAt this point, definitely prefer GWT, partly because the theme is stronger and icons and scoring are simple.",
    "timestamp": 1760220000
  },
  {
    "username": "DevOpsProDude",
    "rating": 7.0,
    "comment": "58x88 - 377\n\nPlayed on BGA.",
    "timestamp": 1760047200
  },
  {
    "username": "DoctorPhil",
    "rating": 7.4,
    "comment": "Criteria (out of 5)\nRules complexity 3\nPlaytime/complexity ratio 4\nStrategic avenues 4\nMechanism strength 4\nThematic integration 4\nVariability 4\nReplayability 3\nFun factor 4\nSolo mode\nPlayer interaction 3\nElement of mastery 4\n\nOverall 7.4 out of 10",
    "timestamp": 1759356000
  },
  {
    "username": "kkjdaniel",
    "rating": 8.0,
    "comment": "Good game, but replaced by Pirates of the Maracaibo for me.",
    "timestamp": 1762297200
  },
  {
    "username": "Bayushi Sezaru",
    "rating": 8.0,
    "comment": "Alexander Pfister seems back to a heavyweight right up my alley!\nThis is a game which contains lots of elements of older games (it reminds me of both Mombasa and Great Western Trail), bit has a very distinctive gameplay.\nPlayers sail their ships in the Caribbean, moving from port to port and executing different actions every time they reach one, sometimes depending on the distance traveled).\nThere is a lot happening, with various interconnected mechanics, and it may need several games to wrap the head around...\nIt seems, anyway, one of those games where you’re trying to polish your efficiency to the maximum, competing indirectly for goals.\n\nTentative rating: 8.",
    "timestamp": 1762210800
  },
  {
    "username": "Garath_",
    "rating": 8.0,
    "comment": "Colorful, different strategies to victory, very replayable - and enjoyable.",
    "timestamp": 1762210800
  },
  {
    "username": "annabel398",
    "rating": 7.5,
    "comment": "Sold at Bat City 2 Nov 2025",
    "timestamp": 1762124400
  },
  {
    "username": "louisj2016",
    "rating": 7.5,
    "comment": "Expert++",
    "timestamp": 1760824800
  },
  {
    "username": "Kangri",
    "rating": 8.5,
    "comment": "Un excellent jeu dont le thème est parfaitement exploité : de l'aventure, des choix difficiles, un rythme qui dépend de ses adversaires. En revanche, deux gros défauts : la rédaction des règles est vraiment tordue et l'installation est très pénible, notamment pour constituer les différentes pioches (même avec un insert). Mais une fois sorti, beaucoup de plaisir à jouer en multi comme en solo avec un mode campagne bien ficelé et un plateau qui évolue sans être détruit.",
    "timestamp": 1760824800
  },
  {
    "username": "mixmixmix",
    "rating": 8.0,
    "comment": "Great euro with multiple paths to victory, wrapped around a race engine as players sail around the Caribbean, taking about 15 actions. Players can work to unlock extra abilities on their player board as they use cards to deliver goods, or pay to play to their tableau to gain income and abilities. The game includes a story mode where each game continues a special deck of cards. Pirates may very well surpass this for general enjoyment of gameplay.",
    "timestamp": 1760306400
  },
  {
    "username": "Tannerd",
    "rating": 8.0,
    "comment": "Such an odd game. It never plays quite how people expect, but it does click for me. Suspect Pirates has usurped it.",
    "timestamp": 1759788000
  },
  {
    "username": "Zephyr_Falcon",
    "rating": 9.0,
    "comment": "9",
    "timestamp": 1762686900
  },
  {
    "username": "Napattack",
    "rating": 8.8,
    "comment": "3.91\n1-4\nBest at 3\n120 (720)\n#65",
    "timestamp": 1762383600
  },
  {
    "username": "ditterio",
    "rating": 9.0,
    "comment": "Complete compact rules: https://boardgamegeek.com/filepage/202235/action-andy-maraca...\n\nMaracaibo solo helper: https://brdgm.me/maracaibo/#/",
    "timestamp": 1762297200
  },
  {
    "username": "Blackhowler",
    "rating": 8.5,
    "comment": "Spiel19, Essen 2019.\nAlexander Pfister",
    "timestamp": 1762124400
  },
  {
    "username": "Dozwa2902",
    "rating": 9.0,
    "comment": "played",
    "timestamp": 1761084000
  },
  {
    "username": "Indiana__Jones",
    "rating": 9.0,
    "comment": "El juego de rondel que más disfruto por las diferentes posibilidades que se establecen en cada ruta, ampliadas por la configuración variable del tablero en cada partida. Además, la variedad y la versatilidad de las cartas lo convierten en uno de los juegos de desarrollo de cartas que más disfruto en todos los sentidos. Todas las acciones son divertidas y enlazarlas y conseguir bonos y recompensas de final de partida es muy satisfactorio, así como el juego mental a la hora de desatar la ronda.\n\n* LO MEJOR: La infinita variabilidad en cuanto a cartas y configuración del tablero.\n\n* LO PEOR: El track de naciones está desequilibrado hacia arriba y el de la jungla hacia abajo.",
    "timestamp": 1759874400
  },
  {
    "username": "Mr_Boardgames_com",
    "rating": 8.5,
    "comment": "Maracaibo est un jeu de stratégie complexe offrant une grande variété de possibilités. Le mélange de mécaniques, comme le placement d’ouvriers, la gestion de main et la construction de moteur, en fait un titre riche et profond. Le mode histoire apporte une touche narrative intéressante, modifiant le plateau de partie en partie pour une immersion accrue.\n\nCependant, l’ergonomie souffre de quelques défauts. Le plateau personnel, les cartes ou le plateau principal surchargés d’icônes, peuvent être déroutant au début. De plus, la qualité des illustrations laisse à désirer. Ces éléments peuvent freiner l’apprentissage initial. La mise en place est aussi très longue.\n\nLe jeu offre une grande liberté d’action, ce qui peut mener à des parties assez longues, surtout à quatre joueurs. L’interaction est principalement indirecte, chaque joueur développant sa propre stratégie mais la mécanique des nations sera commune à tous les joueurs. Une excellente idée, il faudra s’adapter aux autres joueurs. Cela va de même pour le tempo du jeu qui sera donné par les joueurs.\n\nEn somme, Maracaibo est un excellent jeu pour les joueurs expérimentés, prêts à investir du temps pour maîtriser ses subtilités. Si l’ergonomie perfectible ne vous rebute pas, vous apprécierez la profondeur de ce titre et la richesse de ses choix stratégiques.\n\nL'avis complet sur : https://mr-boardgames.com/jeux-expert/test-et-avis-de-maraca...\n\nReview also in english",
    "timestamp": 1759788000
  },
  {
    "username": "abtrube",
    "rating": 9.0,
    "comment": "2/1/20 Crooke, Dan, Jimmy",
    "timestamp": 1759701600
  },
  {
    "username": "mathieulabelle73",
    "rating": 9.5,
    "comment": "Maracaibo adopts a similar round structure to the excellent Great Western Trail, where players move along a track, deciding when and where to stop in order to perform various actions. However, Maracaibo is more focused on card play rather than deck-building and introduce a bit more interraction trought majority game play. It is a highly refined game, likely complex to explain, but the theme is engaging and immersive. Mr. Pfister continues to solidify his reputation as one of the top game designers of all time, with Maracaibo adding to his impressive portfolio of standout titles (including Mombasa).",
    "timestamp": 1761951600
  },
  {
    "username": "shafaegalo",
    "rating": 9.5,
    "comment": "Love the campaign mode in this game! Very challenging but with every game changing I keep coming back for more.",
    "timestamp": 1761606000
  },
  {
    "username": "el_crosso",
    "rating": 10.0,
    "comment": "+ Tons of options and strategies to pursue.\nEasy ruleset and an excellent rulebook.\nText and iconography on the cards, it makes so much sense.\nCampaign mode is amazing and isn’t too heavily woven into the game itself either.\nSolo mode is a blast and variable difficulty.\nMulti-use cards are always a great option to have in a game.\n\n- While you have ton’s of choices, there is some randomness in the game you should be aware of\nThe little wooden discs aren’t the best component choice ever.\nYou can’t ignore the influence track, it is a dominant place to gather a lot of victory points.",
    "timestamp": 1761084000
  },
  {
    "username": "kukolyadam",
    "rating": 10.0,
    "comment": "Personal favourite.",
    "timestamp": 1760997600
  },
  {
    "username": "dougfoolery",
    "rating": 10.0,
    "comment": "A classic Pfister design with a mix of rondel movement, multi-use cards and tableau building. The game has a tight economy but feels open in terms of strategical options. The multi-use cards make for a delightful hand management puzzle, as you will need to consider how best to utilize your hand base on the state of your economy and position of your ship. The twist of a round ending (often prematurely) for everyone when one player reaches the end of the rondel, creates a lot of player tension as you will have to keep an eye out for how fast your opponents go. Love the use of legacy tiles to ensure each game plays differently from the next. Painful set-up aside, this is a masterpiece I am always excited to play.",
    "timestamp": 1759183200
  },
  {
    "username": "akikone",
    "rating": 9.5,
    "comment": "Excellent economic game. The first couple of plays might feel overwhelming because there's so much to take in. As the captain of your ship you are free to set the course, pick your contracts, goals, allies and even upgrade your ship to suit your needs. Many of the mechanisms are interconnected but it all works together well and there are always multiple strategies you can begin pursuing.\n\nThe story mode serves the game well, not taking the focus off the core gameplay, but slowly revealing new elements to make every game feel just a bit different, which keeps frequent players on their toes.",
    "timestamp": 1758837600
  },
  {
    "username": "davidjanda",
    "rating": 10.0,
    "comment": "La Armada\nEigenes Denkmal Promo-Karte\nDer Aufstand",
    "timestamp": 1758146400
  },
  {
    "username": "CastleGeorge",
    "rating": 9.6,
    "comment": "Amazing game from Alex. This one felt different and fun. The mechanism is very easy to learn and quick to play. There are so much variability and many ways to win. Love the smooth and easy to manage solo AI also.\nEdit: Now that I've played the campaign it is night and day with the gaming experience. The replayability is cranked up to the next level and so many more way to play the game. This of course add AP but when playing solo it's perfect.",
    "timestamp": 1756677600
  }
]