[
  {
    "username": "Slunko",
    "rating": 1.0,
    "comment": "Just to be clear, this 1 star is here only and exclusively due to the fact that this game costs 2x what Gloomhaven costed me, and while I could forgive a few faults then, when the game was new and Isac (the creator) didn't have the funds to make everything perfect, there's simply no excuse for the faults anymore;\n\nSimple fact is that I've paid 250€ for a game, which comes with inserts made of THE WORST fragile plastic imaginable. Aldi meat is packed in a higher grade plastic box. This is beyond ridiculous. The damn thing, despite the box not having any apparent damage, came warped and is very much, obviously so, unable to support the game pieces. I'd forgive it with a small, cheaper game, but 250€ for THE WORST damn quality materials is unforgivable. Did they have to cut every damned corner and cut every damn cost while charging us the damn game's weight in silver?!\n\nAnd since when is it even acceptable, that games -can- ship in such a state, and we're expected to, and it's perfectly normal to everyone, that we have to fork over another 100+€ for inserts, just so I can play the damn thing.\n\n\nEDIT 1:\n\nAfter playing this game for a while it becomes apparent that this really is just an expansion of Gloomhaven. It's more of the same, BUT with some extra mechanics tagged on that really don't justify themselves.\n\nThe drop in quality (alongisde a massive price hike) is also egregious. The map, for instance simply no longer aligns with the stickers (the default or the removable extra pack, which you have to buy as an extra addon!). The seams of the map don't align with the sticker cuts so they all look displaced on an already busy map or they fold and come off the map when you fold the map itself.\n\nSo far, there's been disappointment and annoyances alongside \"simply more Gloomhaven\", but at worse quality.",
    "timestamp": 1761343200
  },
  {
    "username": "Esyhpe",
    "rating": 1.0,
    "comment": "Repetitif, mais dans le froid",
    "timestamp": 1747864800
  },
  {
    "username": "Limadunia",
    "rating": 1.0,
    "comment": "Nothing justifies the price, nothing ... Maybe consider lowering the price so you can sell more because people can afford it? I hate game that only market for rich western US/UK etc countries, especially for a game that's basically only playable once, no replayability unless you love repetition.",
    "timestamp": 1746914400
  },
  {
    "username": "pickboy87",
    "rating": 1.0,
    "comment": "Update: I don't lightly rate games a 1. I really have to not like a game to be given that. Even games I don't care for end up as a 2 or a 3. I have tried week after week to like this game. I just don't. It's actively making me dread my wednesday game nights. I'm 21+ scenarios in which is like 65-80 hours. It's eaten up months of my precious game nights. The characters are not fun, the scenarios are long and drawn out. The turns where you miss are obnoxious. The turns where you get locked out of doing anything is annoying. Enemies have shields/flying or retaliate. It's like fuck me, this sucks to attack anything. Your hand becomes weaker and weaker. The characters I've played have all been \"micro-manage the boardgame\". Items are less useful and far too expensive. You don't share anything with others you're banding with. The story is boring and verbose. The town phase is just too much. I just do not like this game. I'll still play Gloomhaven (possibly, although this is starting to sour me on xhaven), but once we're unfortunately done with the campaign since the other 3 players like it, this is going in the trash. It's not replayable and I don't want anything to do with this.\n\n-----------\n\nI'll try to keep this super brief. Basically it's Gloomhaven on steroids. There is more to do, more scenarios, more monsters, more in depth characters, etc. That's all super cool.\n\nHOWEVER...jesus fucking christ is there too much shit in this box. If you thought Gloomhaven was bad, this just cranks it up to an 11.\n\nCharacters - Fun concepts, but far, far, far more fiddly and less interesting than previous ones.\n\nStory - Eh, Gloomhaven was pretty disjointed, but this feels overwrought and uninteresting. Like they hired more writers, but it just becomes tedious and uninteresting after a few paragraphs. Nothing really sets the stage.\n\nMonsters - Again, fun, but why include like 4-6 different types on maps to just snag one or two for scenarios? Like it's a waste of time to have to find each one, open the bag, shuffle the deck, find the card, organize it, randomize the token, etc. It's just too much.\n\nObstacles, Token, Etc. - It's just an avalanche of pieces and each one is different and you'll need three of them, oh, but it's in a different compartment, oh, but we moved it over there because there is no room on the table. How many did we need? Where do they go? Which book are you looking at? AHHHHHHHHHH!\n\nThe legacy part of this is also frustrating. Too much can't really be undone and it becomes incredibly hard to play with another group. I really wanted to like this more than I have. It's got some cool concepts, but none meld together and too much shit in every sense of the word.\n\nI'd so much rather play Oathsworn each time over this. Even the base game of Gloomhaven I still very much enjoy. This just doesn't work for me even if some of it I like while others just feel like bloat.",
    "timestamp": 1743631200
  },
  {
    "username": "fourhundredbillion",
    "rating": 1.0,
    "comment": "Too little, too late.\n\nAlso, Jaws of the Lion proved that Gloomhaven should be streamlined, not upscaled. Too much game.",
    "timestamp": 1741474800
  },
  {
    "username": "cotomel",
    "rating": 1.0,
    "comment": "Same criticism as GH.",
    "timestamp": 1732834800
  },
  {
    "username": "Cratgon",
    "rating": 1.0,
    "comment": "Flophaven",
    "timestamp": 1726696800
  },
  {
    "username": "djg314",
    "rating": 1.0,
    "comment": "This game is proof that more is not better. Compared to the excellent game Gloomhaven, Frosthaven has dozens of additional steps in each scenario the slows the game down and turns what might have been fun into 'let's just try to get to the end' because it's so uninteresting. Characters are not well designed, the bookkeeping slows the pace to a crawl, and the scenarios did not seem to be properly playtested. My playgroup survived 30-40 scenarios before we decided that no amount of financial commitment was worth the travesty called Frosthaven.",
    "timestamp": 1722117600
  },
  {
    "username": "Ghost85",
    "rating": 1.0,
    "comment": "Al for mye lesing, søvner før enn er halveis.\nSynes den er Dårlig balanser.\nTil tider så tørt at enn trenger glidemiddel for og ikke få brannsår ved flytting",
    "timestamp": 1717970400
  },
  {
    "username": "larrydurbin",
    "rating": 1.0,
    "comment": "Gloomhaven was boring so I figured why bother.",
    "timestamp": 1711494000
  },
  {
    "username": "HappyDeath",
    "rating": 1.0,
    "comment": "slightly better than gloomhaven but i was already burned out on gloomhaven so this just kind was a long play feel bad, gave up on it after 3 missions, play oath sworninstead. Jaws of the Lion really was my favorite gloomhaven.",
    "timestamp": 1709852400
  },
  {
    "username": "Beedun",
    "rating": 1.0,
    "comment": "Yay - more boring for people. All I can say is MEH",
    "timestamp": 1708988400
  },
  {
    "username": "Pozman",
    "rating": 1.0,
    "comment": "2 years late on delivery, not by external factors, but by his own bloody mistakes, that deserves a 1. It's the owner's fault the delay is so big as first he wants to make the game 'inclusive', a game with fantasy beings, really?\nThen he changes from deliverer of the insert because of the CEO being ACCUSED of sexual harassment (in Europe you are innocent until proven otherwise, but apparently in the US is an accusation enough to convict someone). Two completely stupid decisions which will make I will never back an other game of Cephalofair Games.",
    "timestamp": 1689372000
  },
  {
    "username": "Stevo_NS",
    "rating": 1.0,
    "comment": "overly complicated frosty gloomhaven is awaiting to be replaced with a second edition.",
    "timestamp": 1685829600
  },
  {
    "username": "MSD1978",
    "rating": 1.0,
    "comment": "All the same garbage as Gloomhaven, but now with ice! So amazing!",
    "timestamp": 1683669600
  },
  {
    "username": "Mystic_Mouse",
    "rating": 2.0,
    "comment": "I'm not voting for the TTS but for the board game. This is tedious and a grind, and I don't care for the story or art. The card puzzle is sometimes fun when I'm not playing solo and sometimes frustrating when someone has taken my action, and I have to re-use the two cards in a non-efficient way. I'd rather play a myriad of other dungeon crawlers.",
    "timestamp": 1762576920
  },
  {
    "username": "ScottyKarate83",
    "rating": 2.0,
    "comment": "Love the game but main issues are (1) enormous number of errors in the game and (2) scenarios and classes feel very, very gimmicky compared to Gloomhaven. Very fun but IMO Gloomhaven is better.\nEdit: the more we play this the more we miss playing Gloomhaven.\nEdit2: we tried again two years later. It's still bad. Gloomhaven is a fun dungeon crawler and frosthaven is like an overlong boring game of chess.\nEdit3: another year passes. We tried again, will be the last time. We'll return to Gloomhaven but Frosthaven is a disaster.",
    "timestamp": 1762383600
  },
  {
    "username": "Momo_Monster",
    "rating": 2.0,
    "comment": "Backed kickstarter.\nRating it a one for the fuckery involving the organizer.",
    "timestamp": 1756850400
  },
  {
    "username": "Musuh",
    "rating": 2.0,
    "comment": "- Multiple delays\n- Changes in lore, components\n- cultural consultant for a fantasy game??????????????\n- city phase is lame\n- nothing really new, just another Gloomhaven for money\n\nSet aside these problems the game is great, cant wait each week to play!",
    "timestamp": 1728424800
  },
  {
    "username": "cheshire_cat",
    "rating": 2.0,
    "comment": "I did love Gloomhaven. It allows you to make smart moves and great synergies and when you do them you feel great.\nFrosthaven is more demanding. Playing it feels more like hard work. You are not allowed to make smart moves and find great synergies. You are required. Which leads to feeling not smart but stupid and miserable.\nTo finish the last scenario we played so far, we required to\n1. Play it on easy\n2. Have a deliberate strategy\n3. Have a very specific ability that is not level 1 available and only available to a single class from so far opened\n\nand it was still hard. And it wasn't even a difficulty 3 scenario.\nFrosthaven changed expectations and is way tougher.\nAlso while I like the idea of the town phase it is a chore mostly. Complexity went too far into video game territory in the non-scenario part. Yes, it is still manageable to do by hand and I hate app-assisted games, but it seems like this will be more suited as a video game.\n\nActually, I hope the new Haven RPG system will get some cool video games. Maybe some collaboration with Larian?\n\nWe stopped Frosthaven after 12 scenario. It is endless frustration and pain even if we win scenarios.",
    "timestamp": 1713564000
  },
  {
    "username": "ViewOfDelft",
    "rating": 2.0,
    "comment": "Another offering for players with the imaginary of an 8 year-old. Boring to the extreme, a simplistic theme, but the real problem is the design: it needs so many tweaks and rules and minirules that it makes the game more complicated (but not more complex) than it should be. The designer tries to tell a story, but it is limited to the narrative of a children's book.",
    "timestamp": 1703804400
  },
  {
    "username": "DaveEnder",
    "rating": 2.0,
    "comment": "Scenario design is as good as ever, but the game is so clunky and heavy (figuratively and literally) in every aspect beyond the actual scenarios. If you want the Gloomhaven experience, play a friend's copy of Gloomhaven, or, even better, just buy Jaws of the Lion and play it in its best, most filtered form, with an ACTUAL tutorial for new players. Frosthaven is a failure of thinking \"more is better!\" and you should avoid it (unless you want to buy my copy).",
    "timestamp": 1687384800
  },
  {
    "username": "Prometheus1384",
    "rating": 2.0,
    "comment": "Was going to Kickstart this originally, then Isaac Childres got stupid and decided that fantasy, fictional races and fictional stories were somehow \"harming people\" in real life. Then two years later, he starts attacking people on social media with no evidence and claiming Nintendo stole Zelda's story from him.\n\nHe's a dick. Avoid his games.",
    "timestamp": 1685829600
  },
  {
    "username": "Goldaurock",
    "rating": 2.0,
    "comment": "Lost confidence in the publisher, swaping the product he promised and i paid for.\nCancelled my pledge",
    "timestamp": 1680645600
  },
  {
    "username": "hurricanewww66",
    "rating": 2.0,
    "comment": "It is not better than Gloom Haven.",
    "timestamp": 1679612400
  },
  {
    "username": "ClassicFrog",
    "rating": 2.0,
    "comment": "so bad, rules upon rules upon rules, game system is slow and clunky all the exciting things happen between encounters encounters make you want to never play again. so boring. the high scores and good reviews make no sense to me.\n\nits like someone wanted a video game but made a board game instead and you have to manage everything.",
    "timestamp": 1677366000
  },
  {
    "username": "Elanif",
    "rating": 2.0,
    "comment": "We finished the first scenario. At least the character design is more interesting than gloomhaven's. The gameplay is the same but with more status effects. Unfortunately I drew a mission with 2 checkmark that required me to hug the wall, which made using the banner spear guy even more boring, while we had 4 players and 5 summons cluttering the map. Nobody dropped below half health and it was the same usual slog.\n\nThe whole monster movement, focus, element handling thing makes it clear that this game's better version would be a digital one.\n\nWe arrive at frosthaven and we draw an event that asks wether to defend ourselves from fish men or not, we decide to defend ourselves, the fish men attack frosthaven with 20 power. We have to read rules about building and defending frosthaven like it's clash of clans and like we've been elected mayors the moment we walked in. All our soldiers die and our buildings break. We spend all we got from the first scenario to fix the damage.",
    "timestamp": 1676674800
  },
  {
    "username": "BannKieMoon",
    "rating": 2.0,
    "comment": "I am a *haven hater",
    "timestamp": 1674428400
  },
  {
    "username": "bhamilton0607",
    "rating": 2.0,
    "comment": "The kickstarter went off the rails.",
    "timestamp": 1663624800
  },
  {
    "username": "ciuffo",
    "rating": 2.0,
    "comment": "More of the same.\nwon't KS this project after reading the page",
    "timestamp": 1586469600
  },
  {
    "username": "localghost8080",
    "rating": 3.0,
    "comment": "The same core gameplay experience is the same as Gloomhaven with some minor improvements. A mountain of new systems thrown on top. So many systems. Too many systems. They each add too much complexity for too little payoff. Setup is a chore. Book-keeping is a chore. Too many fiddly bits to keep track of.",
    "timestamp": 1757455200
  },
  {
    "username": "pjolmstead",
    "rating": 3.0,
    "comment": "Sorry, but this was slow. Nothing was interesting. After 6 plays, we mercifully quit.",
    "timestamp": 1749938400
  },
  {
    "username": "Evidence8",
    "rating": 3.0,
    "comment": "After 19 missions the boredom stepped in. It is all just the same. The card system isn't as enjoyable. It's not keeping you on the toes, story is meh. Really disappointet. We liked it in the beginning but it really got stale fast.",
    "timestamp": 1737932400
  },
  {
    "username": "Cone Defense",
    "rating": 3.0,
    "comment": "This is a really interesting euro twist on dungeon crawling. There are certainly some interesting mechanisms and some solid level up concepts. I also love how you track health and stats on the one enemy card as well as the hand management part of this game. That said, I feel like the overhead for this game coupled with my lack of enthusiasm for campaigns makes this a miss for us.\n\nBox size score adjustment: - 3",
    "timestamp": 1724882400
  },
  {
    "username": "Scifi66",
    "rating": 3.0,
    "comment": "Gloomhaven was a breakthrough design, whilst not perfect it breathed new life into a staid dungeon crawler genre.\nJotL was a fantastic package, streamlining setup and providing an enjoyable and manageable steak sized campaign.\nThis enormous beast of a box has played the MORE! card, more of everything but at a cost of usability and approachability. If you love Gloomhaven and simply want more complex characters, more fiddly upkeep, more difficulty in setup/tear down, more narrative linking the scenarios, more side systems, Frosthaven is your answer. It turned out this wasn't for me.",
    "timestamp": 1724796000
  },
  {
    "username": "Ste_rex",
    "rating": 3.0,
    "comment": "Adjusting my rating down from an initial 9 to a 3 after playing for a year and now being finished with it, unfortunately there's a lot more wrong with this game than there is right and it vastly outstays it's welcome",
    "timestamp": 1711753200
  },
  {
    "username": "Sophsky",
    "rating": 3.0,
    "comment": "Probably the most disappointing experience of my adult life. We loved Gloomhaven so were really looking forward to this. Unfortunately the many flaws mean it has overall not been a fun experience.\n\nThe biggest issues are\n1. The story is extremely poorly written to the point it essentially doesn't exist. The actual writing content is bad, like a 12 year old wrote it, the pacing is appalling. We find out about the big bad 3 scenarios from the end, which isn't even really an end. It doesn't have an ending.\n2. It is designed for 4 players and is not well balanced if you have 2 players. Several scenarios we had to replay over on a lower level but could clearly tell with 4 players it would have been trivial, either because monster spawn hit points or movement didn't scale correctly with character count.\n3. Special rules. I get it, kill all monsters got a bit dull in gloomhaven. But special rules for the sake of it often became like managing a small accounting firm.\n4. Randomisation of events doesn't work well. We didn't have the first town guard upgrade until 3 scenarios from finishing and didn't have the trial deck until the last scenario. What's the point in having functions that you don't get to use unless replaying scenarios?\n\nUltimately we didn't play the final scenario because it looked like a nightmare to set up and manage and we didn't want to. The game had ground our spirits down so far we just gave up and read the conclusion after over a year of time invested into it. And that conclusion was meh. What has been the point.\n\nWe had some fun but over time it just became more and more frustrating and tedious. Sorry cephalofair, we're through.",
    "timestamp": 1711753200
  },
  {
    "username": "ExplodingSnail",
    "rating": 3.0,
    "comment": "Frosthaven is an evolution of Gloomhaven and I'm not sure I like it's new form. It feels much more of a chore to play through and a lot of the new elements start off feeling novel but soon become rote and repetitive. The settlement phase is a prime example with most people just zoning out, looking at their phones or letting out an audible sigh when we have to go through this part.\n\nThis also feels much more semi cooperative than Gloomhaven with everyone doing their own thing with the only real interaction is through tripping someone up, them taking the thing you need or getting in your way.\n\nThe loot game is also a step backwards; coins were great in Gloomhaven as you could use them back in town to purchase new items. Now, everything you pick up is trash and making you feel more like a garbage man than an adventurer.",
    "timestamp": 1710802800
  },
  {
    "username": "Epinephrine",
    "rating": 3.0,
    "comment": "Rating it a 3, but it's a very split rating.\nThe underlying mechanics are still good, and in fact have been slightly improved from Gloomhaven (which I gave a top rating to), making it a great tactical skirmishing RPG thing. The new character designs are often complex in unnecessary ways, and there is an over reliance on placing overlay tiles which makes it harder for many combinations of characters to play together due to competing over the resource of featureless hexes. In Gloomhaven we generally couldn't wait to play the new characters, but in Frosthaven that is a relatively rare feeling. My adult group hems and haws, not really finding them enticing, with one player reaching back to pilot a Gloomhaven class as none of the available options are interesting to her. At home with my children it's no better, one of them is playing her second Gloomhaven class in Frosthaven, and the other is planning to play a Gloomhaven class next, despite our having 5 unplayed unlocked classes. We have only 4 classes left to unlock at home, and I doubt that those last 4 will be much more enticing.\n\nStory is slightly improved, the lore is a bit better.\nThe new method of unlocking characters is poorly done, and the new outpost phase is a slog that I'd skip given the chance. Splitting the resources/loot into several types of material and also many herbs introduces unnecessary variance in what your mercenaries might have; one group of mercenaries in my home game had an excess of hides but a continual lack of metal, while in another game at a friend's house we have very balanced material resources, but have one specific herb that we never seem to find. Why not just use coins and exchange them for need materials?\nTwo huge frustrations are the inability to tell a story with any foreshadowing, and the puzzles.\nFor the foreshadowing, I am referring to the plot, the character unlocks, and the events.\nEvents (road, outpost, etc.) Still mostly fall back on the Gloomhaven standard of \"pick A or B, but you can't really tell which will be the good result\"; some events now use the character traits on cards (e.g., strong, persuasive, etc.) And where this works it does feel better, like you have correctly interpreted the message (some foreshadowing, Yay!), but these events are not common, and sometimes use the \"wrong\" attribute. One example suggests that I've option might be to convince the NPC of your plan or something, which sounds clearly like the \"persuasive\" trait would be helpful, right? Wrong! Isaac expected you to threaten them, even though that isn't implied anywhere on the card, so the correct trait is \"intimidating\".\nThis lack of foreshadowing extends to many of the class unlocks, which may make sense in hindsight, but are otherwise random.\nBut by far the worst aspect of this game are the puzzles. The reaction to the puzzles in Gloomhaven was from what I saw largely negative, with people exasperated at having to do a crazy amount of sitting symbols in card art it hidden on the map to unlock a bonus, but at least it wasn't required. You could skip it and not really notice anything lacking from the game. In Frosthaven, Isaac doubles down on puzzles, making them a required part of the campaign. The puzzles are poorly designed for the most part, the best of these being a simple cypher to decode. Others are as nonsensical as the puzzles in Gloomhaven, with no built in hints. Having introduced the calendar, Isaac could have added a hint system overtop of the puzzles (add xxx.x to the calendar in 3 weeks, this is a hint on the puzzle you just started) but instead there is nothing to advance things. A game like pandemic legacy does this repeatedly - if you don't have the previous bit solved and wouldn't be able to advance, plot events catch you up.\n\nThe puzzles are frustrating, I'm trying to avoid \"spoiling\" them, though it is very generous to assume that any appreciable portion of players will enjoy them. They ruin a game that was among the most enjoyable otherwise. I'm only about 2/3rds of the way through the puzzle book, but each one I find makes me more angry with the crappy puzzles we are meant to solve. I would not play this game again, and will likely not buy any follow up. I think Isaac developed a really neat game engine and is a good designer of mechanics, but is not a great story teller, and is a horrible puzzle designer. The fact that an escape room owner weighed in on Reddit about how badly these puzzles are done is exactly the point.",
    "timestamp": 1698530400
  },
  {
    "username": "Fuzzleton",
    "rating": 3.0,
    "comment": "Gloomhaven had bloated set-up times, and then a fun gameplay loop of wacky secret objectives skewing optimal performance and preventing quarterbacking.\n\nTaking a bloated game and adding additional bureaucracy homework made it significantly less inviting to play.",
    "timestamp": 1697407200
  },
  {
    "username": "duskdweller78",
    "rating": 3.0,
    "comment": "Vote is the average between:\n- 8 for the game\n- 1 for the production quality, my copy arrived with a ton of serious issues and in general there's already an incredible quantity of errata\n- 0 for customer support, I've yet to receive an acknowledgement of my inquiry sent months ago.",
    "timestamp": 1697234400
  },
  {
    "username": "pavelgerda",
    "rating": 3.0,
    "comment": "As a huge fan of Gloomhaven, I was surprisingly heavily disappointed by Frosthaven! To set the stage: we've played through almost all Gloomhaven scenarios + Expansion + Jaws. We usually played at +1 difficulty with leaning to +2 at higher characters levels. We love challenge! However, Frosthaven feels under-tested, not challenging. We faced too many moments that could be easily fixed by proper testing! Unfortunately, the game became a chore at some point that it became difficult to convince everyone to continue playing. Here are some details:\n- Gloomhaven was always a complicated game, but Frosthaven is over-complicated. The complexity comes out of nowhere. We use the app (Secretariat) which is fantastic! But the complexity comes from rules where the app can’t help us. Instead of making rules easier to understand and more logical, developers added even more rules which override each other. For example, “empty” hex is now a complex mechanic which consists of “feature-less” hex and “figure-less” hex. Even though, we completed Gloomhaven, we often found ourselves not knowing how to resolve a situation. The amount of time we use Google/BGG/Reddit to check details is ridiculous.\n- Class mechanics are unnecessary complex for some classes and very easy for others. Even worse, the class balance is all over the place. On top of that, playing many classes is frustrating. All you do is wait until the perfect moment to finally use your basic mechanic. Indeed, GH didn’t have the perfect class balance either, but I don’t remember such huge gaps between characters.\n- What makes it worse is the change to starting level of new characters. You can start at a level equal to 1/2 prosperity (opposed to 1=1 in GH). Therefore, we had level 1 characters at the same party as level 7 character. Together with poor class balance, it adds to frustration.\n- Too many scenarios have long special rules. It’s nice to have an additional spark to “kill them all” but having half a page explaining additional effects is too much. I mean, it’s fun having such effects once in a while but FH is full of it. On top of that, most of special rules sections are badly written and counter-intuitive. We had to Google almost every scenario with special rules to understand nuances.\n\nOverall, I can’t recommend purchasing Frosthaven. At least, not until the 1st revision (2nd printing). The game requires thorough playtesting. If you’re new to X-haven games, get Gloomhaven! It is still complex, deep and interesting game!",
    "timestamp": 1687816800
  },
  {
    "username": "jswinton",
    "rating": 3.0,
    "comment": "I loved Gloomhaven and really liked JoTL. While FH has made some improvements, the whole package is a significant step down. Biggest complaints:\n\n- The puzzles in the puzzle book are mostly awful and gate game progression so you can't just ignore them. If someone hadn't posted hints on reddit, this game would have been tossed in a bonfire months ago.\n- Yes, the puzzles are worse than Forgotten Circles (though slightly less intrusive)\n- The classes for the most part just feel like work instead of fun.\n- Some of the classes feel so limiting that certain scenarios are likely impossible with the wrong combination, which sucks b/c those scenarios may gate retiring/replacing those characters.\n- Did I mention the puzzle book?\n- While I do like the addition of the town building, with the combination of the characters being more complex, the sessions times seem overly long.",
    "timestamp": 1687730400
  },
  {
    "username": "fish1123581321",
    "rating": 3.0,
    "comment": "waiting to get it forever",
    "timestamp": 1685916000
  },
  {
    "username": "Slaverzguild",
    "rating": 3.0,
    "comment": "Not likely to play \"Frosthaven\" ever again. Maybe if someone else owned it and was willing to host a series of game nights and make sure the game was set up before I arrived and do all the bookkeeping so I didn't have to.\n\n\"Gloomhaven\" was already a beast with too much fiddling and too little game. \"Frosthaven\" turns the fiddling (set-up, tear-down, bookkeeping) up to 11, and turns down the gameplay.\n\nIt's now much faster and easier to retire characters... but that's not a good thing. I want to get attached to a character and keep them around for a while.\n\nI don't know... \"Frosthaven\" exhausts me just thinking about it. I think \"Gloomhaven\" and especially \"Jaws of the Lion\" are superior games, and I never mustered the fortitude to slog through the entirety of \"Gloomhaven\". \"Jaws of the Lion\" I did complete, and have played with multiple groups. I know I would never finish \"Frosthaven\" even if I wanted to.\n\nIf what you're really after is more \"Gloomhaven\" check out the amazing fan expansion, \"The Crimson Scales\", instead.",
    "timestamp": 1683842400
  },
  {
    "username": "Jon_dArc",
    "rating": 4.0,
    "comment": "Many frustrating regressions compared to Gloomhaven—feels almost like a first attempt that GH polished and refined. Scenario design especially has moved away from Gloomhaven’s strengths—Kill All Monsters scenarios with few or no special rules continue to be significantly better than other scenarios, but there are a lot fewer of them this time.\n\nIf this had come out before Gloomhaven it would have been the best thing I’d ever played, and my views may yet change with time, but two steps forward, eight steps back leaves a bad taste in the mouth.",
    "timestamp": 1760392800
  },
  {
    "username": "skifreak737",
    "rating": 4.0,
    "comment": "The heroes are ridiculously more complex to play than the original game. Why do that?\nThe entire building mechanism is just unnecessary. There are other games that do that better. We ignore it. Too much bloat, not as much fun.\nSome of the hex tiles are odd colors and difficult to tell what they’re supposed to be.\nEDIT: we’ve played 98 scenarios thus far. The number of very scenario mechanisms suck the fun right out of the game. Long ago we decided to skip them entirely and forget the campaign. We also completely ditched the town building and defense. Now we just play the scenarios in order, skipping the super-fiddle ones.\nLowering rating to a 4. I only play it because my gaming buddy loves it. He wouldn’t love it if he had to figure out all the fiddliness and if he knew how often I modify things to make them less fiddle. I’ve also house-ruled potions and amount of items that can be carried. So we have a small deck of cards as we close in on Level 9 of our 4th characters — and THAT is FUN!! (We also upped the level for the enemies.)",
    "timestamp": 1750024800
  },
  {
    "username": "TheDanielSan",
    "rating": 3.5,
    "comment": "I'm not sure what to rate this at the moment. It's a good dungeon crawler, but definitly to much of everything...\n\nUpdate\nWe decided to sell our game after being 18 scenarios in.\n\nYou will definitly love the game, if you played and enjoyed Gloomhaven.\n\nAlso this game does nothing wrong directly. I might have another perspective if I were 20 years younger, but I'm lacking the luxus to replay 4h scenarios multiple times, because I have managed my card play a little bit wrong and get exhausted a few moves before the scenario is done.\n\nAlso I had the feeling that at some point the game wants us to fail and just go to collect some ressource multiple times, before being able to progress.\n\nAs a result, we started bending the rules at some point and tried to find workarounds around the game mechanics.\n\nBut that makes the whole thing pointless at some point.\n\nThe rating, reflects, that the game does not actually do that much wrong, but it's just too much of everything and I probably wouldn't necessarily want to play it anywhere anymore.\n\nIt lacks however some love... For the inserts, for the organization, the materials tend to bend a bit, the board starts to become somewhat loose, stickers for the rulebook you cannot remove a millisecond after hitting the smallest point of a page, lack of story (compared to other campaign games these days its a joke). There is no love in this game. It was designed from head, but not from passion.",
    "timestamp": 1747346400
  },
  {
    "username": "TheSlov",
    "rating": 4.0,
    "comment": "I really dislike the changes they made to this game, and some of the promised but undelivered items (like the Map Book used in Jaws of the Lion instead of the map tiles).\n\nComparing to the OG Gloomhaven, you'll be grinding more for resources to actually craft your town AND weapons AND items. It's an alright mechanism but this could be handled digitally via companion app instead of actually stickering resource cards. What I hate is that money/coins is WAY harder to come by, and so far after going about 50% of the game there are less than 4 sticker upgrades we made to our class cards. You will also be using money for multiple things making it a very necessary resources that (I guess) is thematically hard to come by as thematically nobody cares about money in the frozen wastes EXCEPT it's required...it's as if it's somehow dangerous to give players resources and let them be used and have the players have fun.\n\nThe classes are more boring in this edition, and there are less \"strong\" classes, as in they are more balanced, but I'd rather see classes be a bit more specialized in what they do rather than balanced. Just my 2 cents. Also after playing Gloomhaven fully, and then Jaws of the Lion, and now Frosthaven I am quite tired of the design choices and mechanisms in this game. The encounters also feel...similar but that's it's hard to make 70ish missions feel mostly special or memorable. Still, I'd rather replay Gloomhaven fully then start another Frosthaven campaign.",
    "timestamp": 1743717600
  },
  {
    "username": "Greedful",
    "rating": 4.0,
    "comment": "Soooo bloated, I think this may actually be worse than Gloomhaven. A good example of how to worsen a board game experience instad of innovate on past success.",
    "timestamp": 1743202800
  },
  {
    "username": "Forgeforgeforge",
    "rating": 3.9,
    "comment": "A better game mechanically, but If you're bored of gloomhaven this won't change your mind. Gloomhaven was ultimately broken once you got the hang of it, but the fun, like literally any rpg ever made, was in learning how to break it. Frosthaven has so thoroughly filed off all the exploitable edges that there's few exploits left to discover for yourself. This game feels like a job now.\nIt's the same problem rpg video games and even dnd now have, where they've been ruined by the Internet spilling their secrets. Instead of employing the man spamming class guides on the subreddit, they should have gagged him.\n\nThere's still conceptual darling classes like the geminate that are wildly OP once you realize the gimmick is not actually any kind of restriction.\n\nNeeds more wacky map effects, you should be building a rube Goldberg machine of scenario hazards and slippery ice and spike traps. The new balance seems to discourage you from cheesing the map layout, which is the most fun to be had in this combat system. Every other enemy seems to be flying now. In terms of visual clarity the map tiles are a huge step down from gloomhaven, what is ice/snow/bluestone is impossible to tell. What is hazardous/trap/difficult is extremely unclear and even the meaning of any piece of cardboard constantly changes between scenarios.\n\nNew chaff based loot mechanics remove the last bit of dopamine. Oh boy, a wooden plank for christmas.\n\nThe map and calendar and vehicles and all that, cool, add half an hour more cardboard and sticker admin each session. Honestly playing dnd would be less work.\n\nYou better have a room dedicated to this game.\n\nAll the crabs look the same.",
    "timestamp": 1736722800
  },
  {
    "username": "Clads",
    "rating": 4.0,
    "comment": "Technically this is bigger and better than Gloomhaven. It has all the bells and whistles and then some.\n\nMy experience only ever comes from playing Gloomhaven and Jaws of the Lion with 2 players.\n\nFrosthaven feels incredibly more difficult with 2 players. Some of the starting characters should not be starting characters - some are too antisynergistic with each other that 2 players are forced to optimize their characters instead of playing what they want.\n\nI have never felt disheartened playing gloomhaven - even after failing a scenario, however unlikely - I cannot say the same for frosthaven - failing scenarios - changing characters - and failing the same scenario again - the game does not seem optimized with 2 players in mind - and that's okay for some people - but not for this review.",
    "timestamp": 1728079200
  },
  {
    "username": "booma2xs",
    "rating": 4.0,
    "comment": "After 68 missions worse than gloomhaven. Every char plays like a crippled hero this is so annoying. The respawning of monsters in missions is beyond annoying. I have to play the game with gloomhaven chars otherwise I would stop playing it.\nScenario 61 is so bad I hate it.\nthegame gets worse and worse.",
    "timestamp": 1726351200
  },
  {
    "username": "psyven",
    "rating": 4.0,
    "comment": "The rules videos advertised on the publisher's own site are nearly 2 hours long. That's just explaining the rules. The goal here is to make a huge world that you can dig into. That's cool, but the various little exceptions (crafting items can't be taken from the frosthaven supply, but herbs can... okay?) mean you have to go around remembering ALL SORTS OF LITTLE THINGS just to play the game. If you don't do it correctly, because it's a legacy/campaign game, your error can compound.\n\nWay too heavy for what the game is. Way too much effort to immerse through fiddly bits rather than imagination and smoothness. Way too expensive and bulky.\n\nBut still a good game. I'd play it again.",
    "timestamp": 1722549600
  },
  {
    "username": "MrBaggins",
    "rating": 4.0,
    "comment": "I think the design philosophy of this game can be summed up as: let's make players feel bad about their choices. Loved Gloomhaven and Jaws of the Lion, but after about 30 missions I think we're probably giving up on Frosthaven. Have tried it with 2, 3 and 4 players and all have serious problems, but the game is especially unfun as a two player game.\n\nMany scenarios are poorly designed for two players. For example quite a few scenarios require splitting the party, either at setup or due to a need to reach multiple distant objectives in a limited time. That's fine if you're both playing fast-moving jack-of-all-trades characters (blinkblade/drifter) but what if you're not? Punishing players for choosing to play a fun-looking class is certainly a choice, but not a good one.\n\nI agree with a lot of what others have said: difficulty is spikey and missions are often completely unfair due to certain specific OP monster cards (e.g. focused stabs has movement now!; summons that shuffle-in and are immediately redrawn after being played, etc.)\n\nOther choices seem downright baffling, such as locking upgrades behind a specific personal quest.\n\nThat said, there are a some additions and changes from GH which I really liked: the stamina potion nerf-yes, it was broken; different winter/summer event decks; item upgrade chains; and the design and story of the new characters and monsters. Seriously, those shrikes are nightmare fuel. Well done.\n\nUlimately, I think what makes me want to put down this game is that the best part of the game, the rich story and dynamic world, are always kept just out of reach of the players. \"Want to hear how the quest-line ends? Give it one more try and two hours later there's a 33% you might actually get to hear it. But probably, you won't. Better luck next game night. That is not fun.",
    "timestamp": 1695420000
  },
  {
    "username": "PraneFuji",
    "rating": 4.0,
    "comment": "Finding the outpost phase and friction around character development to be a slog that's been repeatedly bogging down play sessions.\n\nMissions have been fun so far, but until we get a proper app for campaign tracking, running outpost attacks, tracking buildings, and crafting, EDIT: Running into a lot of missions where core rules are discarded by a designer, and things are poorly explained in the scenario text, and people are ultimately guessing on the forum. Lowering this further as this becomes a trend.\n\nIn general it feels like 10 systems were added to justify 10 currencies, to make a much more balanced game, and it's suffers a great deal from it.\n\nI wouldn't recommend it as someone who completed gloomhaven. The game was also developed around this weird culture around spoilers that leads to more fiddly elements of lookup, with some missions taking place across 4 different random pages in two different books.\n\nPuzzles (not like combat puzzles) take on greater stakes in this game. The character classes both more \"balanced\" and more complicated to run, and often less fun to play. Note that it is nice that you can pull in older gloomhaven characters, maybe the one or two you never unlocked, and still play with those less contrived classes.\n\nI would hold off until frosthaven has more support / more dedicated homebrew systems from the community to remove more of the unnecessary friction.",
    "timestamp": 1690927200
  },
  {
    "username": "Fuzzel",
    "rating": 4.0,
    "comment": "Noch komplexer und umfangreicher als GH. Umfangreichere Stadtphase. Fisselige Sonderregeln in den einzelnen Szenarien. Langweiligere Helden. Missionziele regelm.: \"Alles töten\". Sehr teuer (260 Euro+). Der Erfolg einer Mission hängt (wie auch bei GH und JOTL) stark von den gezogenen Gegnerkarten ab. Fernkampf, Betäuben usw. führt i.d.R. in den Untergang ....\n-> Lieber JOTL, das mit 25 Missionen (inkl Intro) und vier sehr gut aufeinander abgestimmten Helden den Bedarf an diesem Genre stillt > oder im Extremfall GH (gebraucht für 80 zu haben) versuchen. Warum sollte man sich DANN noch FH antun? Es gibt so viele andere gute ähnliche Spiele, die man probieren sollte .... Oathsworn, Stars of Akaios, Sword & Sorcery, Middara, Chronicles of Drunagor, Burncycle ...\nDeutsche Version geplant:\nQ423 Deutsche Version\nStand 13.03.2023",
    "timestamp": 1690668000
  },
  {
    "username": "nmarsceill",
    "rating": 4.0,
    "comment": "One of the bigger disappointments of this game is the rulebook. The rule book appears to be written as if you already know how to play or if reading it once is all you will ever do. If you have a question it can be very difficult to find the answer. If you retain information super well then perhaps a single read through is good enough for you.\n\nIf you don't retain everything and want to look stuff up the index which is oddly a few pages in from the back often doesn't have entries for things you think it would and many generic entries have 5 - 10 places you will need to check to find - or sometimes not find - the answer. The table of contents can also helpful in trying to find a source to check for a rule.\n\nThe game comes with a getting started guide but I feel like it needs to guide you a bit further. I think if you cannot easily find a rule its probably better to just make a house ruling than.\n\nThe good news is there is a large playerbase and people will build out good FAQ and guides here. Many times I feel like the whole \"keep something secret\" goes too far and create confusion mean while some of the spoilers are in plain sight and leave you scratching your head if you missed something.\n\nUpdate: Many months into playing this game, I think the information for people looking at this game that most important.\n1. Characters are more complex but also more compelling than Gloomhaven.\n2. The loot/resource system is really cool and i prefer it over straight gold. I do have things I don't like, such as how resources can be pooled but then not used. I also find the more stuff you have, the more complex the recipes the harder it is to compare and evaluate your choices.\n3. I still find the rulebook frustrating and I've had to go through the errata and just find and mark everything because the mistakes can be extra confusing. We've switch to a ton of community resources to help us, so I suggest those 100%. We have had to look at spoilers to figure other things out.\n4. The organizers are bad, we have ended up with half the built in organizer, half the folded space organizer, and then printing a bunch of labels and cheat sheets to organize everything.\n5. Games feel much longer than gloomhaven - some of its set up/tear down but I think most of the scenarios are just longer.\n6. My room mate keeps asking me if I've read spoilers because he feels like the plot is non existent so far, like what is the \"Big Bad\" going to be. Right now its more like a collection of plot lines and Winter is the big bad. I'm not sure thats any different than Gloomhaven was.\n\nLast Words: The best version of GH is still JOTL in my opinion, if you've never played GH play that first. If you liked GH, and you want more this is fine. It could be better but just like V1 of my review trust the community will make it better for you.",
    "timestamp": 1684447200
  },
  {
    "username": "FistWizard",
    "rating": 4.0,
    "comment": "Unbalanced for two players and tedious puzzles that lock the campaign missions. A real step backwards from the previous two games.",
    "timestamp": 1680300000
  },
  {
    "username": "Carter_Burke",
    "rating": 4.0,
    "comment": "Gloomhaven v1.5. More of the same. More KS hype.\n\nYou could either play this for a year (or two) to completion, OR go play the other BGG top 98 games… (JotL included) and have your shelf/life back. ?",
    "timestamp": 1676847600
  },
  {
    "username": "Bananenhase",
    "rating": 5.0,
    "comment": "***Everything after the original Gloomhaven, except JotL, so far has been a big letdown.***\n\nFirst impression was that it is an overall improvement over gloomhaven.\nAfter playing for a while I would say that gloomhaven is more fun to play and I would choose it over frosthaven.\n- new rules and systems that seem to hinder players and reduce the fun.\n- The outpost-phase is too much of a hassle without any real benefit.\n- Story arcs are locked behind outpost-events. So you have to wait and can't play through a storyline and have to start too many different stories, that aren't that interesting.\n- 250€ and only 8 elite standees is a joke, especially when there is a scenario early on that starts with 9 elites (4P) and spawns elites every round and the game tells you to look for a substitue for these standees.\n- crafting items was interesting at first until you unlock items that require other items and just list numbers as materials and you have to look through the whole pile of items to see what item you need.\n- retiring your character feels unrewarding compared to gloomhaven. In gloomhaven you looked forward to a new character and imagined what mechanics fit the icon and anticapeted playing the new character. In frosthaven you get to open a numbered enveloped and unlock boring stuff for the outpost-phase.\n- many characters require a setup turn to play ideal, so every turn 1 looks the same.\n- scenarios are more complex and take longer and enemies are stronger so the game becomes more diffucult. Which in my opinion is less fun.\n- summons were buffed and still (mostly) useless.\n- everything on the map is blue/grey. There is very little diversity compared to gloomhaven.\n- starting characters are very interesting and feel well balanced.\n- I like the way how loot works in this game. But you could've just share your gold in gloomhaven instead of following a stupid rule that's no fun, but that's just my opinion.\n* update after ~25 scenarios: too many characters use terraintiles and feel way underpowered.\n- multiple print errors in the scenario book.\n- some scenarios feel too diffuclt or borderline impossible with certain characters.\n\nThis game is a textbook example of how to not make a sequel",
    "timestamp": 1762638240
  },
  {
    "username": "fzabava",
    "rating": 5.0,
    "comment": "Sold - too complex to get into.\n\nWith Token Insert.\n\nWowsa! Had 1st tutorial all setup to play. Read through the rules. Have played Gloomhaven quite a bit. Had no idea how to play my hero cards. Did not understand what the cards were even telling me my actions actually were.\n\nTaking the game down. Don't know what I'm going to do with this beast of a game. What a letdown.\n\nInitial ranking because too difficult to even begin playing the starting mission.",
    "timestamp": 1756418400
  },
  {
    "username": "Crystulas",
    "rating": 5.0,
    "comment": "I was excited to back this and play it but it is very repetitive in quest type",
    "timestamp": 1753653600
  },
  {
    "username": "Marty S",
    "rating": 5.0,
    "comment": "Way too much extra overhead larded onto the Gloomhaven chassis. Crafting, much more convoluted retirement requirements, glacially slow and frustrating loot/item acquisition. Chromehaven.",
    "timestamp": 1752444000
  },
  {
    "username": "ApostropheN",
    "rating": 5.0,
    "comment": "(Scroll down for two later-gameplay edits to this review that dropped it from an 8 down to a 5 for us; hopefully it doesn’t go lower before we make it to the end.)\n\nWe’re on year two of playing this. For the most part, we're still enjoying it. For the majority of the combat mechanics, character cards (enhancement), and the like, it improves on most of the things we struggled with in Gloomhaven—notable exception: Oozes, which still ruin scenarios on a regular basis—but a few of the changes left us scratching our heads.\n\nThe biggest wins are in the characters, who feel a bit more balanced than Gloomhaven, and their thematics. We originally enjoyed how unlocking characters is story-based, not retirement based (with the retirement bonus turning to buildings for the Outpost)—but that lost its charm a year or so into playing when we still hadn’t unlocked half the new characters.\n\nThe setting feels more \"alive,\" and having a stake in our own settlement helped grounding us more than in Gloomhaven. The loot system of using a deck, and crafting, has us more invested in picking up loot than before, as well—looting is way better than just coins.\n\nAlas, crafting started off weak and slow and it might be our character choices, and potions were even worse. It’s the equivalent of RNG, but our journey through unlocking potions (which is entirely random based on the ingredients you manage to loot) was absolutely painful. It took forever for us to end up with a healing potion (and we were unlocking whatever we could, just never had the right combos).\n\nThe encounter cards split into season and road/outpost make for a more immersive experience, and while we've only bumped into a couple of scenarios where we've hit a wall (again, Oozes are still broken, and we're houseruling them twice over: waiting for both their shuffle cards to come up before shuffling them, and just copying damage on new spawned split oozes). We’ve also started playing on \"Easy\" which still feels difficult depending on our quartet of characters (the \"closest character gets pummelled by massive number of attacks on round one\" problem).\n\nOn the downside, the iconography on the cards is sometimes less intuitive (push and pull, for example), and multiple tiles are so close to each other it's frustrating looking for the right ones (cave \"door\"?). The time-per-session is was raised by the extra steps of the Outpost phase, which isn't inherently bad, exactly, but does sort of put a tedium tone to things after finishing a scenario, so we decided to skip it one session and then began playing with the Outpost Session as our starting point, and then playing a Scenario and stopping once we’ve finished the scenario (so, basically, we \"finish\" the previous scenario before we start a new one, then leave the Outpost Phase to be handled again next time).\n\nOne really sore point is—as we're playing with four players—the incomprehensible limit of two of each craftable item, especially the potions, which meant only two of the four of us can have any type of item. We're making them with ingredients we find ourselves. How can we only make two of each? It makes zero sense (and yes, I get the real-world reason: it would mean more cards) but I’d rather have had less options but enough cards to actually equip four players.\n\nAdded to this is the frustration of playing a new character after retirement with the slower scale of levelling via Prosperity—when our first character retired, the other three characters were level four, but even at Prosperity 3, my retired character meant I'm had to play a level one character, who routinely got one-hit-knocked out/required discards due to low hit points. Gloomhaven allowed characters to start at a level equal to or lower than the Prosperity level, but Frosthaven slows that down to half the Prosperity (rounded up) which meant starting at level 2 didn't happen until Prosperity 4… which was a long time coming.\n\nFinally, \"masteries\" are obnoxious. If you've got a player who loves the challenge of trying to earn their masteries, prepare to have a frustrating experience of their character making very sub-optimal choices while they try to earn that extra checkmark doing things that make little-to-no sense. It's like an extra-frustrating Battle Goal, only far more tedious to watch unfold.\n\nEdit to add: Bumping this down from 8 to 7 to 6. Having now played through the game for two years in real world, and entering year three of the game (we just started our third Summer), our four-player group has hit consensus that the \"problem\" of Frosthaven is mostly in how much more complicated everything feels on a scenario basis—far less \"Defeat all enemies\" (which wasn’t a broken situation) and quite a few more \"here are the scenario goals\" (which feels like fixing something that wasn’t broken).\n\nIt's by no means as bad as Forgotten Circles was, but—for example—Scenario 71 where there are *seven* enemy types, three of which use one battle deck while fighting the other four as well as the players, during an escourt mission, with summons happening on odd and even rounds and... Each round of combat took ages to figure out. If we hadn't had one of the unlocked classes with a particularly good one-two combination of cards to grant movements to allies, it would have taken at least another hour to play, we estimate, and could easily have ended for naught in a failure. Basically, when we see \"Complexity Three\" rank for a scenario, we find ourselves groaning in anticipation of much less fun, and a lot more \"okay, wait, what happens this round?\"\n\nFurther Edit to add: We’re on our third year of playing this, and we’re at the point now where we’re skipping it as many weeks as we’re playing it, because we have to be very much in the mood for the frustration that comes with so many of the scenarios, and add to that the puzzle book and… honestly? If it weren’t for people online, our entire group would have just given up. The puzzle book is *awful*, and it gatekeeps the story from concluding. Paths are locked until you use the puzzle book. Don’t like badly designed (and error-inclusive) puzzles? Then you’re done with Frosthaven unless you go seek out spoilers online. Worse, and especially if you—like us—generally only play, say, a scenario a week or every other week or so, these puzzles become even more unsolveable. As a not-so-random example, the clue you need for the solutions to one of the puzzles is in the concluding text of a scenario we played *two years ago*. Why would we remember that? The puzzle book alone has tanked this experience for us—its inclusion might be great for people who like escape room style puzzles, but if you don’t and were enjoying Gloomhaven and Jaws of the Lion, surprise! Frosthaven includes impenetrable puzzles now.",
    "timestamp": 1750197600
  },
  {
    "username": "totokeke",
    "rating": 5.0,
    "comment": "If you love RPG and Base-Building game, this game is a must-have game for you. However, If you hate heavily set-up and status tracking, this is not the one.",
    "timestamp": 1745359200
  },
  {
    "username": "ultimoratio",
    "rating": 5.0,
    "comment": "Gloomhaven 2.0. If you didn't like the first one, nothing here that is ground-breaking that fundamentally changes the game.",
    "timestamp": 1739228400
  },
  {
    "username": "Memox",
    "rating": 4.5,
    "comment": "Writing is more disjointed than before and a bit too pretentious. Theme is uninspired as well. There are however some new, interesting mechanics, although most of them work better on paper and, ultimately, they make the game more unnecessarily complex.",
    "timestamp": 1737846000
  },
  {
    "username": "Seewolf",
    "rating": 5.0,
    "comment": "For Sale",
    "timestamp": 1734217200
  },
  {
    "username": "Harroguk",
    "rating": 5.0,
    "comment": "Near perfect condition.\nNo stickers applied.\nWill trade but in person only, it weighs a ton.\nReplaced by Frosthaven.",
    "timestamp": 1733266800
  },
  {
    "username": "SharpOranges",
    "rating": 5.0,
    "comment": "I don't think this series needed to be bigger than it was, but here we are. The town building aspects after each chapter are hard to get into if you are a newcomer to an already ongoing campaign, and still don't add any story to engage you.",
    "timestamp": 1731279600
  },
  {
    "username": "Fredholm",
    "rating": 5.0,
    "comment": "About 20 scenarios in, I've lost interest in this game. It's just too long, too fiddly, and too fragmented for me.\n\nThe balance in each scenario is pretty good so far. My group of two - Deathwalker and Geminate - has only had to replay one scenario and it's mostly been close run but the story progresses so, so slowly and the outpost events add next to nothing except bureaucracy.\n\nApparently you need to complete around 100 scenarios and with almost 3.5 hours per scenario - setup and maintenance included - that's just not a commitment I'm willing to make.",
    "timestamp": 1727215200
  },
  {
    "username": "Duke_Rufus",
    "rating": 5.0,
    "comment": "My lord, the things people will do to avoid playing d&d.",
    "timestamp": 1724968800
  },
  {
    "username": "OathToEmbers",
    "rating": 5.0,
    "comment": "Barely got through the starting part of the game. The rules were all over the place. The cards were difficult to understand. The icons were everywhere. I couldn't find certain icons in the rule book... I LOVED GLOOMHAVEN, LOVED IT! But we couldnt do this. After opening the first door, it took us almost 20 minutes to set up the next spot between four of us. I lost excitement in this so quickly that we gave it away after playing the first three times playing.",
    "timestamp": 1723845600
  },
  {
    "username": "rhyeen",
    "rating": 5.0,
    "comment": "Absolutely loved Gloomhaven. Everything is improved for Frosthaven...so why just a 5 for me? I can't convince myself to play it. It's just... too much. The additional downtime phase really slows things down and combat hasn't been streamlined in any way to make up for it. Each session is going to be about 3 hours, and that's just too long for my table.\n\nI played it once. It felt like Gloomhaven but with more hassle and I haven't had the courage to get it out again.",
    "timestamp": 1716156000
  },
  {
    "username": "TheChills",
    "rating": 5.0,
    "comment": "Far too slow, leveling and unlocks are slower than they were in gloom and the new building and Outpost stuff adds more complication and game slow down. The game really suffers for it. Our group lost interest after months of playing (no losses, fairly ideal play) and grew bored when sessions just really felt the same. They needed to ramp up progression, not slow it down more.",
    "timestamp": 1711666800
  },
  {
    "username": "Piankhi",
    "rating": 5.0,
    "comment": "Frosthaven feels worse than Gloomhaven in almost every way.\n\nThe loot system was changed to add a lot more complexity and busy work setting up the loot deck for every scenario. Just have to sort and shuffle essentially ~5 decks every scenario.\n\nThe new town phase is a lot of busy work with more mediocre writing. Lots of steps and rules involved. This phase would have been a bit better if it were more streamlined to be quicker.\n\nThe overall writing/story is not good. Worse than Gloomhaven. Super generic groan inducing writing. When a choice is given, the better / more rewarding choice seems to be to always do the action that is more 'nice'. Promote peace an harmony among those who hate each other.\n\nThe strive for class balance has greatly increased, which kind of makes everyone feel just weak. A great thing about Gloomhaven was how you could find strategies or combinations of actions that made you feel rather OP if pulled off right. Now in Frosthaven, you feel like no matter how hard you try, there is not much you can do. Maybe this changes for a few of the locked classes I haven't seen yet.\n\nAlmost every scenario has Special Rules. No longer is it just about having fun playing the normal way. Scenarios now have to have some weird gimmick to limit how you play or hinder your actions. This ties back into the bad writing of the story in that the mechanics reinforce the idea that 'you must be this specific kind of person' (Scenario 55). And they don't even reward you for following in the exact spirit of the scenario. Instead you are essentially penalized. A lot of the fun has just been sucked out of playing.\n\nI'm not sure how well the scenarios are really balanced as I've always played 2 player. Between the overbalanced classes, and maybe underbalanced gimmicky scenarios, the game feels quite a bit harder overall.\n\nSpeaking of rules, the overall set of basic rules have just been expanded upon to add a lot more complication.\n\nThe cardboard overlay tiles also have a lot more specific meanings/uses based on scenario, so you constantly have to keep checking and remembering what the tile means for the specific scenario you are running. They should have worked better to include more unique overlay tiles that are more visually distinct so it is easier to set up each scenario and easily know at a glance the meaning of each.\n\nThe first printing also has a lot of errors that make things confusing. There is a giant Errata you can go through and mark up lots of cards to make corrections. They should have provided free replacements of all the incorrect / missing content.\n\nTLDR: Gloomhaven but with a lot more rules, busy work, worse writing, and less fun classes. Would be better as a video game.",
    "timestamp": 1710284400
  },
  {
    "username": "Fflic",
    "rating": 5.0,
    "comment": "It should be Gloomhaven and more, but is somehow Gloomhaven and less. The Outpost part of the game seems an unnecessary addition. Many of the battles are unbalanced. Clearly impossible to playtest every possible player set-up. Some lazy scenarios that are just spawn monster X here and then repeat X times.",
    "timestamp": 1701990000
  },
  {
    "username": "Tarquinsuperbus",
    "rating": 5.0,
    "comment": "Not played yet",
    "timestamp": 1699311600
  },
  {
    "username": "staalealien",
    "rating": 5.0,
    "comment": "Dungeon crawler. With interesting mechanics, not innovative, but is it interesting. The reason I don't like it is because it is too long, with alot of stories sure, but the stories are not intriguing to me. Every fight seem a little similar to the last one. Played 10 scenarios, before I said enough is enough. I understand why other people like it, I just prefer other games when time is tight.",
    "timestamp": 1698706800
  },
  {
    "username": "caroll_markus",
    "rating": 5.0,
    "comment": "Some 15 scenarios in we're considering to quit for good. We loved Gloomhaven and JotL, both 10/10, played through 80+ scenarios and 12+ characters as 2 players and had a great time, despite the high time investment for setup and tear-down and all else around it... But Frosthaven? This just went overboard, too much of everything, too long Outpost phases (nice the first few times but then turning into a chore), too many special rules in scenarios bogging down the game flow, too many components, sheets, books, decks to manage. All that and our feeling that at 2 player count some scenarios are just frustratingly difficult (even with characters that should work together really well) had me start to dislike Frosthaven - after so much initial excitement, what a disappointment...",
    "timestamp": 1695592800
  },
  {
    "username": "msegall1",
    "rating": 5.0,
    "comment": "Adds a lot of weight and fidiliness versus Gloomhaven in a way which is not enjoyable - would not play again solo due to excessive management.",
    "timestamp": 1692828000
  },
  {
    "username": "pekac45",
    "rating": 5.0,
    "comment": "I absolutely hate this game. Mainly because I have 200+ games in my library and my friends only want to play this shite. The puzzle book is so annoying, why do I need to solve riddles and remember random pieces of trivia. So infuriating.",
    "timestamp": 1691877600
  },
  {
    "username": "FlussBurrito",
    "rating": 5.0,
    "comment": "too expensive, too much of everything.",
    "timestamp": 1690495200
  },
  {
    "username": "wmshub",
    "rating": 5.0,
    "comment": "Yup. At least as good as gloomhaven. Just after the first encounter - I hear the story line is stronger in Frosthaven so I'm excited to see that.\n\nUPDATE:\nHuge downrating. Scenario 0 was a nice easy intro. Then scenario 1 was brutally hard, a loss and a replay, for expecience gloomhaven players. Scenario 2, we got an hour in then had an insta-lose based on a card flip that we couldn't prevent in any way. This kind of crap is not fun. Somebody screwed up the playtesting bad.",
    "timestamp": 1690495200
  },
  {
    "username": "rob_vz",
    "rating": 5.0,
    "comment": "I have played and own Jaws of the Lion and think it is a great game. The snowy outpost setting in Frosthaven is appealing. But a more manageable package like JOTL would have been an easier sell.\n\nWith three of the top ten “thematic” games on BGG taken up by Gloomhaven, I think it is a civic duty to simply balance-vote this, to bring some sanity to proceedings.",
    "timestamp": 1687212000
  },
  {
    "username": "Shad47",
    "rating": 5.0,
    "comment": "+ The Lore\n+ Cool characters with different mechanics\n+ Tactical combat\n- Shuffling decks too often\n- Creating the loot deck is a pain\n- End up not blessing or cursing to not have to remove the cards in the deck\n- Not friendly with new players : How am I going to make someone like this game when he plays a supposedly easy character that only had time to summon a flag and a torch bearer and never managed to make any combo with his cards. After 4 hours of setting up and playing he will be like \" yeah looks interesting but no not for me\"\n- Too many ugly small tiles, you will end up using random tiles for doors or obstacles, having just few colored tiles would have done the job\n- Too many map tiles that are almost the same, it just feels tons of them were added so you can waste time searching for the right one\n- Bad box manager that doesn't fit all in it properly and ends up damaging some components\n- Is this a legacy game? I bought the removable sticker set for nothing 'cause in the end you will have to tear up things, put stickers everywhere, even in the rule book, cards, name it. I just don't understand why do you have quests choices, the game can't be replayed.\n- Needs better management of monster types or you will also search for the ones you need during way too long time.\n- Bad and useless story, just adds up more time for absolutely nothing.\n- Bad balance on characters and quests.\n- I don't feel invested into the outpost at all.\n- Too slow on leveling, you don't have the will to spend that much time to level up character that will leave anyway and you have limited fun using the same tactics all over again. I DON'T WANT TO GRIND in a game.\n- Items feel like trinkets and you are never excited about them, nor the loot... spending that much time on setting up and playing to end up building a mining camp that can give me one ressource IF I PAY for it isn't kinda exciting.",
    "timestamp": 1686261600
  },
  {
    "username": "Stuket",
    "rating": 5.0,
    "comment": "Kickstarter. Got hit by FOMO and had to pledge. But I have plenty left to do in Gloomhaven and don't actually need this one...\n\nEdit 1: Arrived over two years late. I've lost all enthusiasm while waiting. It's a very hyped thing in a very big box that will collect dust somewhere where I can store it (along with Envelope-X, a metal coin, solo scenarios, removable stickers and two boxes of sleeves). If someone suggests we play this type of game I'll bring out Jaws of the Lion, not this behemoth. I've paid a lot of money for something I really don't like. Stupid me. Rating it at 2.\n\nEdit 2: Played a few scenarios now. It's \"Gloomhaven 2.0\". A few rules have changed, it's a bit more complex, but basically the same game. Just as Gloomhaven it takes forever to set up and plays very slowly with rules that are a mess. Frosthaven is a little better than Gloomhaven, but I still prefer Jaws of the Lion (they all have the same mechanic, but Jaws is easier and faster). I might still bring this one out on occation, but I know I will never finish it. Adjusting rating to 5.",
    "timestamp": 1683842400
  },
  {
    "username": "Weird WWII",
    "rating": 5.0,
    "comment": "Just more of the same.",
    "timestamp": 1679266800
  },
  {
    "username": "CongratulatoryWisdom",
    "rating": 5.0,
    "comment": "Frosthaven seems great, however it is simply too much for me. I am still playing Gloomhaven's campaign after several years while also enjoying playing multiple other standalone board games. I'd never pick copy of Frosthaven up due to those reasons. Plus, after one play, the character decks seem more complex in ways I don't find particularly interesting.\n\nFrostpunk requires dedicated play, as well as masses of space; time; thought; commitment; patience; insert research. There is too much here for me to care about when other games tend to do everything better, and likely in a more streamlined manner. Frosthaven likely has amazing strategic and tactical depth, but I won't ever see that.\n\nIf this was the sole game I'd play for several years I'd get well into it. As it isn't, Frosthaven seems bafflingly large, even compared to Gloomhaven.\n\nFrosthaven could be great for the right group who aren't already commited to dozens of other board game experiences. For me? I'll get back to my Gloomhaven campaign when I have the energy and time!",
    "timestamp": 1676674800
  },
  {
    "username": "Strajder",
    "rating": 6.0,
    "comment": "Boring euro game dressed in RPG clothes.",
    "timestamp": 1761606000
  },
  {
    "username": "R_J_",
    "rating": 6.0,
    "comment": "Overall just very disappointed with this. TLDR: lots of complexity but not more interesting decisions or emergent gameplay story for any of the additions. I’d recommend 5 - 10 other games over this, just way too much bloat.\n\nRecommendations over this:\nfateforge, tidal blades 2, oathsworn, Agemonia, sleeping gods 2, Arydia, The Elder Scrolls: Betrayal of the Second Era\n\nDetails: The best parts are from gloomhaven, and everything that has been added on top is a bloated mess that adds hours to running the game.\nThe tiles not being books shows no learning from all the glowing reviews from jaws of the lion and listening to a vocal minority who say they will design scenarios and require unlimited freedom of map tiles to do that… maybe, but multiple map books would also allow for that,\nThe loot bloated into a loot deck, more shuffling, no more interesting (plus: I killed a sun demon, it dropped a pelt on the ground… pretty unthematic).\nThe puzzle book with puzzles that… aren’t interesting. I’d rather play the puzzle of the combat than a side project that doesn’t belong in this game.\nThe hundreds of standees but no organiser for them. The hundreds of terrain pieces but depending on the scenario will be different terrain, so instead of having a reminder on the token, you have to look back at the scenario book to see what kind of terrain it is - how did this make it through to final product?!\nMore status effects but they aren’t more meaningful and old overpowered effects are still there - looking at you stun - I could go on… but then this would become bloated too… you get the picture. More for the sake of more, with little or no thought as to why.\nIt’s just so bloated, and why not? Gloomhaven was as well (although not so much as frost) - it’s just that there are now alternative campaign games that are refined, have less set up, and the same level of satisfying coop dungeon crawling gameplay. Because other designers looked at gloomhaven and thought they could do it cleaner and more streamlined, and that would be the inovation as well as lead to more fun/less work. Personally I agree with this.\noverall, This game feels like 2 steps forward, one step back. What a wasted opportunity to iterate in meaningful ways.\nThe main positive I have is that the game was clearly play tested more, so more of the classes are fun and engaging, but there were plenty of good classes in gloomhaven, so you could skip the less interesting ones.\nDon’t get me wrong, I still have a good time playing this half of the time, but I’m rolling my eyes at the ridiculous bloat the rest. Thank god for the free community made app making this easier to play (the fact that the official one is paid for is laughable, compared with smaller budget campaign games who make free companion apps).",
    "timestamp": 1759010400
  },
  {
    "username": "Ordsten",
    "rating": 6.0,
    "comment": "The thing about Frosthaven is that it is just... so so much. A single session of play is usually a commitment of around 4 hours for just us two players. The characters (even the low difficulty ones) are so complex that decisions are always changing but not in a zippy dynamic way but a slow plodding one. And then the town phase sometimes feels as though it takes as long as the scenario we just ran. I love the idea of moving the focus away from simple money and toward resources, and I love the idea of interesting and complex characters but in practice it just feels exhausting.\n\nAnd most of the time, I'd rather play Gloomhaven which has scenarios that usually take half as long to setup and play. Frosthaven is a game that I feel like I should like more, it should be a direct upgrade of Gloomhaven, but in practice it just feels like a more bloated version.",
    "timestamp": 1754517600
  },
  {
    "username": "SKN_TNS",
    "rating": 6.0,
    "comment": "I've played Gloomhaven, Forbidden Circles, Jaws of the Lion, and Frosthaven with two of my family members. And after its all been said and done, I feel like I've played much more of this game than I needed to. I do like the design of the game, but the experience of playing it is unpleasant. There is so much to keep track of and fiddle with. The game has solo scenarios, which are designed to be played by just one person, and I've only played ~3 of the at least 8 characters that I could have done the solo scenario for; because playing this game solo felt like a chore. I'd never play this game with only two people, and I'd never play it if I had to set it up and put it away every session. I'd like this more as a video game than I do as a board game.",
    "timestamp": 1754431200
  },
  {
    "username": "uglystru",
    "rating": 6.0,
    "comment": "I played through Gloomhaven twice (yes, I bought two copies and played through them with different groups). I was so excited for Frosthaven, but after a few sessions I was EXHAUSTED. There’s so much more setup and tear down, and Frosthaven does this “outpost phase” in between scenarios where you go to town and deal with a bunch of bs and more setup/teardown. It’s so much to track. Then, doing scenarios feels like even more of a chore because you have to bounce around the scenario books like a “choose your own adventure”, spending 20-30min digging through and trying to figure out what is linked with what. At one point, I got so lost and nobody in my group could figure out what was linked with a certain scenario in the book because it was missing a reference link, so the scenario just ended with no context. Also, the scenarios themselves are much more complex with MUCH more to track (I remember one in particular being an elevator mission where map tiles were inaccessible, deadly, or changed advantage/disadvantage based on the round you were in). Did not make any sense for a board game to do that. The game practically requires a DM, or someone who is willing to spend all the time explaining what to do and taking the hour to set everything up (and then the extra hour to take everything down).\n\nOverall, FH as a board game is not good and is not worth all the effort. I’m sure it’ll be great in a digital format but jesus, it is an absolute mess in physical form.",
    "timestamp": 1754344800
  },
  {
    "username": "Martfarypka",
    "rating": 6.0,
    "comment": "The setup and putting everything back to the box is too long. Also, the amount of things you need to remember to do is crazy. This game is unplayable if you have a job. I used to love this universe but this game is just something completely unreasonable.",
    "timestamp": 1753826400
  },
  {
    "username": "Spouth",
    "rating": 6.0,
    "comment": "1st Edition + Solo Scenarios\n\nMy group and I have found this less satisfying and more time consuming than Gloomhaven.\nMost scenarios have increased rules complexity with very little payoff.\nMore paperwork and post session processing than my group prefers.\nWe don't dislike the game but would likely not replay it once we are done.\n\n(EDIT - March 2025)\nMid way through campaign and the group has lost interest in continuing. Sadly, the additional complexity and play time has killed this campaign for my group.\n\nI doubt I will be in a position to finish this campaign as the existing group has given up and any new groups will likely play Jaws or Gloomhaven instead.",
    "timestamp": 1753653600
  },
  {
    "username": "Olafslomp",
    "rating": 6.0,
    "comment": "Owned by Heather",
    "timestamp": 1752876000
  },
  {
    "username": "Trevor03",
    "rating": 6.0,
    "comment": "Only played one scenario as a fill-in for a party that was 50+ missions deep, so take my rating with a huge grain of salt. And it was a particularly upkeep-heavy mission according to them.\n\nBut holy, does FH add in a multitude of new things to bloat the game. While all the characters seemed super interesting and unique, the other added elements seemed like exceptionally high bloat: tedious outpost system, odd scenario objectives, upkeep galore, special mastery goals, general complexity increase, item crafting seemingly a bit too RNG, etc.\n\nI saw some reviews saying one step forward, two steps back. Sounds about right from the little bit I experienced.",
    "timestamp": 1747778400
  },
  {
    "username": "TheTomTraveller",
    "rating": 6.0,
    "comment": "Includes:\nFolded Space Insert\nSolo Scenario\nRemovable Stickers\nSurface Book",
    "timestamp": 1746741600
  },
  {
    "username": "Edysseus Games",
    "rating": 6.0,
    "comment": "A missed opportunity. If you haven't played Gloomhaven / Jaws of the Lion, my rating would go up to 8.",
    "timestamp": 1745618400
  },
  {
    "username": "lowkey2_2",
    "rating": 6.0,
    "comment": "Exciting at first, but overly complicated scenarios and poor balance for two players led to increased frustration.",
    "timestamp": 1741388400
  },
  {
    "username": "Kythrid",
    "rating": 6.0,
    "comment": "Like father like son ... ;7",
    "timestamp": 1740265200
  },
  {
    "username": "tempar",
    "rating": 5.5,
    "comment": "based on jaws of the lion",
    "timestamp": 1739833200
  },
  {
    "username": "kylpo",
    "rating": 6.0,
    "comment": "Same comments as Gloomhaven, but much worse with its town phase and item crafting. Just adds waaaaay too much bs to the game.\n\nHaving said that, the new characters seemed really interesting. Would love to play them on digital Gloomhaven if that ever happens.",
    "timestamp": 1737241200
  },
  {
    "username": "MustardJonny",
    "rating": 6.0,
    "comment": "We really wanted to love it like we loved Gloomhaven, but in all honesty we really couldn't. Every class is so complex and frustratingly hard to set in motion, cooperation and crazy plays can still (rarely) happen, but they don't feel as rewarding as they should. The outpost fase is so excruciantingly long and boring we gave up playing on three separate occasions. The 90-180 minutes sessions indicated on the BGG tend to be, in our experience, much much longer. It felt like work.",
    "timestamp": 1735686000
  },
  {
    "username": "ClevelandGooner",
    "rating": 6.0,
    "comment": "Took a step backwards from Gloomhaven. Complexities of the game bogged it down. I get what they were trying to do. Did not succeed imo.",
    "timestamp": 1734908400
  },
  {
    "username": "CaptainShamus",
    "rating": 6.0,
    "comment": "Edit: -1 point, the typos are annoying but scenario 28 sent me over the edge. No excuse for those typos!\n\nBig fun game, lots to do, huge variety in characters, I've unlocked half so far and all feel different which is good! I would only suggest this game to someone if they didn't have a big box campaign already but to enjoy the complexity of FH they'd ironically need to have several 'big boxes' under their belt - JotL would be my go to recommendation.\n\nI'm currently bingeing my way through a scenario a day which has built up and kept my momentum for 'wanting to play'. FH is definitely one of those games that you can find an excuse to not play as it takes a lot of effort but with consistency (waiting to start a new job!) and that I've learnt cleaning up immediately after a scenario and either completing or setting up the outpost phase helps get right into the next session. Best is completing the outpost phase and setting the next scenario up so you can immediately 'play'.",
    "timestamp": 1729720800
  },
  {
    "username": "LAL_Champion",
    "rating": 6.0,
    "comment": "I have a really hard time unpacking this beast",
    "timestamp": 1729548000
  },
  {
    "username": "Grobian",
    "rating": 6.0,
    "comment": "Upgraded from 9 after a dozend sessions. I loved Gloomhaven and this keeps the gameplay goodness but has much better storytelling. Great!",
    "timestamp": 1728424800
  },
  {
    "username": "Harbard",
    "rating": 6.0,
    "comment": "Gloomhaven with more rules, as if it was not already enough... Got tired of it after 7 maps",
    "timestamp": 1726178400
  },
  {
    "username": "Sikko",
    "rating": 6.0,
    "comment": "After our group of 4 has played around 20 scenarios of the campaign, I corrected my rating down to a 6. Why?\n\n-Some of the scenarios are insanely imbalanced and not fun.\n\n-Some of the new enemies are insanely imbalanced and not fun.\n\n-Some of the characters are insanely imbalanced and not fun.\n\nWe had some scenarios which dragged on forever and after we thought we finally did it, the game spawned another round of the same enemies with weird additional goals to fulfill. It feels like someone tried to make the scenarios interesting, by making them more fiddly, complicated, and convoluted. I somehow miss the \"boring\" scenarios of Gloomhaven.\n\nWe encountered enemies which had no weak point and were dealing damage to ALL players directly over distance without attacking, while maintaining a HUGE HP pool. Each time we encountered this type of enemy, the scenarios was lost in no time, because players were losing cards left and right. This type of enemy would be interesting as a single boss with scale able-stats, but not in a group a four of these.\n\nWe have a player with a character which is so stupidly useless that it hurts. Not only that the character fails to help with the enemies, it even deals friendly fire from time to time, if the player does not take care. This player has also a hard time to earn XP at all.\n\nAll of this feels not play tested and disappoints me for a \"2.0\" version of a well established and tested game.",
    "timestamp": 1717452000
  },
  {
    "username": "perles75",
    "rating": 6.0,
    "comment": "I've been playing this with the two people I played Gloomhaven with plus a 4th and we are more or less at a third of the game, I think. Opinion is mixed but the general mood has been \"frustration\".\n\nI appreciate why the authors went onto that path to differentiate it from Gloomhaven, but I don't think they hit the mark.\nEach scenario feels extralong and exhausting and many are very finicky with all those special rules to consider, counters to keep track of and so on. In the end it feels like a chore more than fun, although there are some fun mechanics here and there.\nThe pace is also weird. I understand the reason for linking the opening of the new characters to events or scenarios rather than an automatic new character when someone else retires, but we always have the feeling we can be short of choices at any moment. On the plus side, several characters including the starting classes have nice mechanics.\nI personally like the Outpost phase and tbh it's not that long: the Outpost event is quick as well as doing the rounds of buildings, and the rest is not that different from Gloomhaven. Also here however I don't think that all the mechanics are worth the fuss; outpost attacks for example don't add as much as they are worth.\n\nThe combination of overcomplicated specific scenario rules with the length of each scenario makes it simultaneously easier to lose scenarios for small things and getting frustrated to restart it, sucking a lot of the fun out of the game. Often we're just exhausted for little reward. If a game like this doesn't make you excited to book the next game session almost every time we play, there's something wrong.\nMinus points for the number of errata that show sloppy work before publication.",
    "timestamp": 1717279200
  },
  {
    "username": "kraedy",
    "rating": 6.0,
    "comment": "Frosthaven is the poster child for more not necessarily being better.\n\nPlayed 80ish scenarios, unlocked almost all the content. I think Gloomhaven is the better game by a significant degree.\n\nFrosthaven is harder, more complicated, and has more stuff, but it's more tedious to play. Lots of issues with poor quality components, poorly explained rules, mistakes and errata, scenarios that feel designed for digital and play poorly with physical components, etc. It's a good game when it works, but it's not a great game. I had fun with it, a LOT of fun at times. I also had a lot of discussions, arguments, and frustrations with the unclear rules. Some of the classes are game-breakingly broken too, and had to be house ruled out of play as they are too tedious or too powerful. One or two of the classes felt like they fundamentally didn't work as a concept.\n\nThere's too much downtime and too many components. Set up/tear down time is too long for the play time of a scenario. Many of the scenarios feel like they either weren't playtested, or were only playtested digitally - a good chunk of them feel bad with physical components.\n\nI loved the idea of the outpost phase, but I don't think it quite worked. Sticking things to the board is fun, seeing the outpost develop is great, but the payoff isn't - we were swimming in resources and rarely ever had an interesting decision to make, just more and more upkeep to deal with each scenario.\n\nThere's elements of greatness here, but all those elements are already in Gloomhaven. If I was to play either again, I'd be strongly pushing for Gloomhaven.\n\nThis would be better as a video game.",
    "timestamp": 1713650400
  },
  {
    "username": "Reimius",
    "rating": 6.0,
    "comment": "Played a couple sessions already with a friend. Sooooo complicated (people say OG GH is simpler, so maybe I should have played that first), but I think once I grok it, this game will be a higher rating.\n\nWe definitely messed up some stuff on the first couple scenarios that made the game much easier. We're not going to redo those scenarios and just keep moving on like nothing happened lol.\n\nAfter quite a few plays (10+ scenarios by now), I'm content leaving this game as an 8. I was expecting a much better game due to Gloomhaven being so praised. There are a couple dungeon crawler type games I much prefer over this one.\n\nAfter much deliberation, Eric and I have decided this game is just not for us. It felt extremely repetitive, and some hero combinations are just not that good. Going to give it away due to being a legacy game and the resale value is not good for partially played.",
    "timestamp": 1712181600
  },
  {
    "username": "snackiecakes",
    "rating": 6.0,
    "comment": "A good and very ambitious game that added to but did not evolve the formula of Gloomhaven. The classes are great, the card combat is great, but the scenarios and admin are much worse. I strongly recommend Gloomhaven and Jaws of the Lion, and if you still have time, Frosthaven could be worth a play.",
    "timestamp": 1708124400
  },
  {
    "username": "Jason245",
    "rating": 6.0,
    "comment": "1/31/2024 update: I am now around 25 scenarios in... the fiddilyness only gets worse as you unlock more and more unnecessary fiddle, the frosthaven outpost phase gets longer with less enjoyment and honestly the writing gets worse and the puzzlebook went from an exciting idea to a complete dreadful terror as soon as I saw it.\n\nI am 6 scenarios into a campaign. It takes Gloomhaven to the next level, adding a new outpost phase which makes you feel more vested into the town which is nice. The way new characters unlock now also feels more meaningful. Scenarios so far have been pretty consistent with Gloomhaven (mostly kill all the badies, which I was hoping would change) but there are new intricacies as well as new mechanics and some things that add more excitement, but also more to keep track of and more fiddlieness. While the loot deck in design seems cool, in form it gets a little clunky and annoying, but maybe it is just something I need to get used to. This would be rated a 9 by me similar to Gloomhaven, except that the game is very unpolished in many meaningful ways, specifically: There are a ton of things that were printed incorrectly or not very clearly (from missing the letter \"i\" all over the place to envelopes having the wrong contents to whole masteries being subject to misinterpretation given how they were not clearly defined). While I do not own the game in my campaign, I feel kind of bad for the person who bought it because the game they waited years for what was supposably edited and proofed to perfection only to discover that it has production editing and quality control errors all over the place and Cephalofair has more or less said that there will be nothing done to fix all this stuff.\n\nAfter playing more scenarios, and digging deeper in the game, I have also come to the conclusion that most of the writing in this game is uninteresting and forgettable. It is way too wordy and in no way designed to be read out loud. Almost all the text feels like someone's high school attempt at a writing project with each section of text being an example of someone trying to add words just to meet some minimum word count. Gloomhaven had this issue as well, but I feel like in Frosthaven someone said \"lets add a lot more bad writing because we can\". I have read along with the audio app at times and also attempted read it out loud myself, I have noticed several instances where the audio readers have had to clean up language on the fly. At times I have felt that the poorly written and excessive passages have actually extended the time of us wrapping up a session without adding any value or actually decreasing the enjoyment.",
    "timestamp": 1706742000
  },
  {
    "username": "t_ovatum",
    "rating": 6.0,
    "comment": "enough already.\n\nthe core gameplay is pretty decent but is it good enough to warrant a long campaign? not in my opinion. i played Gloomhaven quite a few times and found it similarly pretty good but didn't love it enough to continue with it. it's incredibly overrated to me.\n\ni do appreciate the mythos which is fairly original instead of relying on the familiar Tolkien-esque assortment of elves, dwarves, orcs, etc. but i just don't think anything about it is compelling enough to warrant playing it more than 15 times but that's just me.\n\nthe new content is cool. the new classes and mainly the Outpost system are neat but it's not going to win me over.\n\nif you loved Gloomhaven and want more, this is totally for you. if you didn't love it, i don't think you will love this one either.",
    "timestamp": 1706050800
  },
  {
    "username": "Archinerd",
    "rating": 6.0,
    "comment": "The good; co-op, I like the double card mechanic, interesting non-vanilla characters.\n\nThe bad; long setup, gimmick scenarios, incomprehensible lore, tedious town phase, slow progress.\nIt's fine, but I'm really just waiting for my friends to move on to something else.",
    "timestamp": 1705878000
  },
  {
    "username": "fallout11",
    "rating": 6.0,
    "comment": "Not as fun at Gloomhaven, but quite a bit more complicated. Too many nerfs, and the crafting mechanics feel very tacked on. Not a bad game but significantly harder to get a group to play it.",
    "timestamp": 1700953200
  },
  {
    "username": "Atomic Twills",
    "rating": 7.0,
    "comment": "Legacy",
    "timestamp": 1761084000
  },
  {
    "username": "Hymn_of_Limbo",
    "rating": 6.5,
    "comment": "Closing in on the end of this one, and the end of Haven games for me. After three of them I've completely lost patience with the minutiae, confusion, errata, dependence on 3d printed pieces to streamline things, uneven character and mission design, uninteresting single-use weapons and armor (how that makes any sense I'd love to know), an outpost phase that is more fiddly than game, event cards with no indication of outcome or end up being anything but eventful, and on and on.\n\nThe shine has worn off of these beasts. When my group gets together there's always some ridiculous design choice that gets us bitching. To be fair, I can't imagine designing a game this big, but that's part of the problem. A smaller, more polished game would be much better. As exciting as the first exposure is to the card play and sprawling campaign, I think we'll look back on these as stepping stones for better games.",
    "timestamp": 1760997600
  },
  {
    "username": "Doomfarer",
    "rating": 7.0,
    "comment": "First of all, I love this game, but to be honest after several plays I'm no so sure it's that much better than Gloomhaven that I thought at first.\n\nThe characters are super cool but quite hard to play well at first. Almost too convoluted at times, I would have liked more \"normal\" characters with less game changing abilities/powers. Some unique ones yes, but all 17 characters doesn't have to be that unique. This uniqueness also makes party compositions hard, especially in a 2P game. To be honest, some of them are really not fun at all (looking at you Banner Spear) to an extent I never felt in GH.\n\nI like the town building part too, but there's just a little too much bookkeeping going on for it to really shine. Anyway, it is cool to see the town grow during the game.\n\nLastly, the one who came up with the loot deck idea that you have to rebuild from scratch every single scenario should be publicly ridiculed in the FH town square.\n\nThe more I play the less I like it, too much work and bookkeeping and often too hard scenarios to be worth it.",
    "timestamp": 1760565600
  },
  {
    "username": "Yzrac",
    "rating": 7.0,
    "comment": "Like gloomhaven but better!",
    "timestamp": 1759788000
  },
  {
    "username": "GuydoVonSwoon",
    "rating": 7.0,
    "comment": "Nice strategic and challenging dungeon game, outpost phase is really tedious and many dungeons have a lot of extra rules that need attention. I'm 15 scenarios in and at the point I'll problaby go skip the tedious parts from the outpost phase and just play the dungeons. I liked Gloomhaven more as its less tedious and more straight forward, but since i have this beast, i'll try to finish it rather quick. Characters have a lot of situational rules, which further increases tediousness. I rather use GH characters.",
    "timestamp": 1758405600
  },
  {
    "username": "GattoNero25",
    "rating": 7.0,
    "comment": "plus vinyl stickers and coin",
    "timestamp": 1758319200
  },
  {
    "username": "logan3825",
    "rating": 7.0,
    "comment": "I laughed, I cried. It was much better than Gloomhaven... I'm going to play it again and again.",
    "timestamp": 1756764000
  },
  {
    "username": "Dante_Molari",
    "rating": 7.0,
    "comment": "Another step forward from JotL, really like the Evolution of x-haven games. This time missions are again significantly better from JotL and the characters more interesting to play. Also nice to have a town stage between missions and improved (but still limited and relatively fast) storytelling",
    "timestamp": 1756764000
  },
  {
    "username": "Cabbage1012",
    "rating": 6.5,
    "comment": "After 36 plays:\n\nImprovements over Gloomhaven:\nGreat new characters, more interesting scenarios, better events, I like crafting items\n\nNegatives:\nMore complicated scenario rules, unnecessarily long story sections, by year 2 the outpost phase is long & tedious, 2p balance is too tight and unfair in a few scenarios, the mandatory puzzle book has some poorly designed puzzles",
    "timestamp": 1755727200
  },
  {
    "username": "Mark0_KaiserRitt",
    "rating": 7.0,
    "comment": "Hero Move is great, Missions get boring and grindy",
    "timestamp": 1755640800
  },
  {
    "username": "onesones",
    "rating": 7.0,
    "comment": "暂停...",
    "timestamp": 1754344800
  },
  {
    "username": "jeremymquick",
    "rating": 7.0,
    "comment": "2 player only",
    "timestamp": 1752098400
  },
  {
    "username": "ghbell",
    "rating": 7.0,
    "comment": "Fun, but not as good as Gloomhaven. There is a lot of maintenance in this one.\n\nOutpost phase is cumbersome.\n\nMost dungeons are good but a few are a lot to set up and run.",
    "timestamp": 1750716000
  },
  {
    "username": "Cosmitz",
    "rating": 7.0,
    "comment": "Before i start, if you are looking at this review wandering which *haven to buy as you haven't played any, stop reading anything else and buy Jaws of the Lion. It's the one you want.\n\nFrosthaven is what everyone that played and finished a campaign of Gloomhaven wanted, but not in the way they wanted it. Context: My group has played and finished absolutely everything Gloomhaven. We're talking games, expansions, fan campaigns and semiofficial scenarios, as well as full fan campaigns. We have poured 3000-4000 hours into this game system. So, that said, what about Frosthaven which we've mostly completed throughout?\n\nFrosthaven has a huge amount of fluff on top of a structure that didn't need it, crafting that requires flow charts to understand, a base building system which works narratively but ends up being very uninteresting gameplay wise and adds extra logistics on top of a 3-4h dungeon session. Classes that are more complex and dense to play but that feel much too hard to play well, for the same benefits you'd get playing a classic Gloomhaven class moderately well.\n\nI've been struggling to find enjoyment in some classes and you need to play them for about 12-16 scenarios to complete the personal scenarios... about 30-60 hours. Some feel very complicated for no real upside, others just don't feel good to play, if you played the original Gloomhaven, the triangle class is the closest to the experience of Frosthaven.\n\nThe town phase has promise, but if you're even moderately successful you'll never see any of the supposed narrative story engine happening. There generally won't be any highs and lows in fighting off baddies in the Winter season or any rush to prepare the town in the safe Summer season. The various shops and places seem somewhat random as to when they appear given how they're unlocked and we've felt we've wanted some much earlier than we got them doled out. In the end, all this does is tack on 30 minutes to a game that didn't need it.\n\nThe scenario system having a chart mode is really useful but also it misses the point of WHY anyone wanted to 'chart' the scenarios in Gloomhaven to begin with... you'll go into a scenario, if you play even 3-4 times a month, you can have NO clue what it's about, as the last time you've done the chain was four months ago. The flowchart doesn't adress that problem of needing a 'previously on'. The game allows you to go very wide in a quite sandboxy way, and you can get lost in a ton of misc scenarios and chains and chains which are LOCKED behind just.. playing other scenarios/waiting for them to tick down. The game still fails to provide a consistent narrative experience as much or harder than even Gloomhaven did. There's argueably one main 'act 1' and one 'act 2' main quest chain, which each have exclusionary 'choice' scenarios, and one very long chain that takes you all across the game, and that's sort of it. There are of course some other smaller 2-3 quest chains but it all feels somehow less but also more. There are enough scenarios, just that they kind of fail to provide some of the really organic narrative developments that Gloomhaven could do.\n\nScenarios themselves now seem to each have half a page of 'special rules' you need to read for them. Very few end up with a simple 'kill all the dudes' or 'loot the thing' or 'push two levers'. Each scenario has you relearning new mechanics, which often are described quite mechanically, and we'd be trying to figure out what the designer was intending to happen in the mission to be able to interpret how the rules would work. There's floating driftwood used as barges, sometimes working one way, othertimes another way, there's various pillars doing various effects in various ways or moving around the map or having special mechanics, monsters spawning in in different configurations at different spots on the map on odd or even or both types of rounds and some don't spawn past a round while others spawn indefinitely... it all felt very tiresome by the half game mark. Opening a scenario and seeing a big purple text block was just frustrating when maybe we just wanted to focus on the tactical challenge instead of figuring out how to play tiles that are elevator levels going up or down as you climb up a shaft.\n\nFrosthaven is Gloomhaven turned to 12, not to 11, just overcharging it and making everything run stronger, but 12, going past overcharging right into blowing out the engine. It may be the right amount for some people, but i feel for some it might leave them entirely behind and cold.\n\nI don't regret my time with Frosthaven, i just wish that now that we've 'gone big' we'll teeter back to a more condensed and focused experience with whatever's new. I really consider Jaws of the Lion struck a perfect balance of a moderate but heavy experience and not overstaying its welcome, as well as a better narrative by having the players be guided more thoroughly. Gloomhaven could also get long in the teeth and had its own batch of issues (fixed in 2nd edition mostly). But i wouldn't recommend Frosthaven to anyone else but people that have gone HARD and played all of the Gloomhaven games already.",
    "timestamp": 1750284000
  },
  {
    "username": "Capt10inch",
    "rating": 7.0,
    "comment": "I'll start with what I don't like. There's simply too much stuff, and setting up/taking down the game takes just as much time as playing it if not more. Having some form of organizer is mandatory for this game. There are a few stages that don't add anything except clutter, most notably crafting and the town stage. The items you craft are rarely better than what you would buy, but necessitate 100+ cards and an advent calendar. Same for the town segment, which only exists to either unlock characters or get materials for crafting. The town battles are an additional headache where you spend a few minutes guarding your resource mills. But if you play the game well, repairing anything that is damaged during this stage is a non-issue meaning it's just a time killer.\n\nSpeaking of clutter, the advent calendars really kill replayability and add to the waste generated by the game.\nYou could easily remove these segments and lose nothing from the core game play loop or narrative structure.\n\nWhat I do like is how this game unlocks its characters compared to Gloomhaven. Rather than drawing a random character whenever you retire a PC, you unlock them over the course of the campaign in a more organic way. You made friends with a certain tribe? Congratulations one of them wants to join you. The retirement conditions are also a lot more reasonable compared to the first game, which is a godsend.\n\nIn short it improved on one of the weaker portions of the first game (recruitment and progression). However, it over compensated in regards to inventory, city management, and novelty.",
    "timestamp": 1747519200
  },
  {
    "username": "Ravek",
    "rating": 8.0,
    "comment": "I played through an entire campaign of Gloomhaven, this builds on that successful game and adds some interesting changes.",
    "timestamp": 1760392800
  },
  {
    "username": "Floating World",
    "rating": 8.2,
    "comment": "Pretty much the Same as Gloomhaven ... Minus One for the Outpost phase and 0.7 for the increased luck of the scenarios\nPS. Should have rated it a 1 because of my \"No expansions ranked\" criteria, but Gloomhaven has been so screwed in the rankings for no apparent reason so I decided to leave the rating as is",
    "timestamp": 1759269600
  },
  {
    "username": "Kaffedrake",
    "rating": 8.0,
    "comment": "A very preliminary rating, since I've only played one scenario and don't anticipate playing a campaign anytime soon. While I have my reservations about the resource bag looting and city-building campaign elements, and the fact that several starting classes are as gimmicky as you'd expect locked classes to be, and my lack of confidence in there being no stupid puzzles this time, the fundamental Gloomhaven gameplay is there, so I can't really imagine I wouldn't enjoy it.",
    "timestamp": 1758924000
  },
  {
    "username": "Justnow86",
    "rating": 7.5,
    "comment": "Gloomhaven is just better. You cannot play this game without house rules.",
    "timestamp": 1758146400
  },
  {
    "username": "EmbarrasedKoala",
    "rating": 8.0,
    "comment": "KOOP",
    "timestamp": 1757973600
  },
  {
    "username": "bnordeng",
    "rating": 8.0,
    "comment": "I was curious about Gloomhaven/Frosthaven and finally got my chance to join in the 4 player campaign of Frosthaven where I'm a backup to the primary 4 who are involved. It was a fun run in a scenario that we struggled with, but I felt the essence of the game and really appreciated how it works. I can see the appeal of the game and it's pretty darn big, though I was not at all overwhelmed by the rules which seems like a good thing.",
    "timestamp": 1757628000
  },
  {
    "username": "rubiks75",
    "rating": 8.0,
    "comment": "Love gloomhaven and jaws of lion (10 fkr eqch) but this feels a little more fiddly (unnecessarily). Stil a good game and a great expansion for people who’ve finished the others and forgotten circles, but as a first experience I’d suggest jaws of lion, then gloomhaven before playing this.\n\nCharacters Are great just like others in series and storytelling seems to have improved since first game (somewhat). Production quality for all components is much higher than gloomhaven.\n\nI thjnk scores are harsh and more about expectations due to kickstarter backing levels and it’s predecessors (plus haters). Designers were in a no win really, more of same and they’d get panelled, new mechanics added just make it more fiddly. Pick your poison. In short there’s just too much here for me.\n\nThe complaining about delays and costs also seem unwarranted given all that’s gone on since campaign and general position with games production and shipping.\n\nIt’s a really good game, for me it’s just trying too hard. Still a very good game, but enjoyed predecessors more and maybe that’s just because I’ve played them so much that this is unnecessary and not interesting enough to invest the full requirement to complete due to the hundreds of hours I already have. Perhaps people new to it, or having played just JOTL may prefer it.",
    "timestamp": 1757196000
  },
  {
    "username": "DaitanKoba",
    "rating": 8.0,
    "comment": "Story is still weak but the progression of the city is nice it does feel much more like a base you progress with. Encounters are better. Scenarios have more variety and interesting mechanics. Only the way certain buildings are unlocked is too random. Some buildings are so important that they shouldn't be locked behind chance.",
    "timestamp": 1756850400
  },
  {
    "username": "Coloneljesus",
    "rating": 7.5,
    "comment": "Gloomhaven + crafting simulator. As with Gloomhaven, the core game play is where the fun is. Most everything else is tedium.\n\nWe play with X-Haven to manage monsters and initiative and it's still a huge table hog. Setup takes a long time. Downtime between missions somehow also takes up almost the same space and time.",
    "timestamp": 1756418400
  },
  {
    "username": "mccormicknb",
    "rating": 7.5,
    "comment": "Gloomhaven was just on the correct edge of too much. Frosthaven added a little bit with the extra city building and now I can't imagine bringing it out. EDIT: The Steam version saved this game for me.",
    "timestamp": 1756245600
  },
  {
    "username": "Dark_Mirror",
    "rating": 8.0,
    "comment": "Its a better Gloomhaven but not so different. If you liked Gloomhaven, you will love this. If not, Frosthaven will not change your optinion.",
    "timestamp": 1755122400
  },
  {
    "username": "dumpty",
    "rating": 8.0,
    "comment": "+ Foreteller narration\n+ Frosthaven Play Surface Book Set\n+ Frosthaven Map Tile Archive",
    "timestamp": 1754776800
  },
  {
    "username": "AAbouzeid",
    "rating": 8.0,
    "comment": "The app is a must with this for us. Streamlines the experience A LOT.\nThey've added some things here that makes it a tad more enjoyable (or easier to jump into after packing it up for a bit)",
    "timestamp": 1754517600
  },
  {
    "username": "Brother Narsis",
    "rating": 8.0,
    "comment": "Has the map books.\n\nLocal trade only, Holly Springs, NC.",
    "timestamp": 1753048800
  },
  {
    "username": "TheBamMan",
    "rating": 8.0,
    "comment": "I love the new characters and ways they expanded on gloomhaven in terms of character abilities and scenarios. However, the outpost phase is too much and takes away from what I like, combat and upgrading my character. I recommend gloomhaven 2.0 then frosthaven only for the new characters.",
    "timestamp": 1752357600
  },
  {
    "username": "Qhorin",
    "rating": 9.0,
    "comment": "Played on PC. All the same mechanics as Gloomhaven, with some lesser rules modifications and new characters, missions, and backstory. Since the story was never important to me, a very similar experience.",
    "timestamp": 1761865200
  },
  {
    "username": "winsrp",
    "rating": 9.0,
    "comment": "More of the same gloomhaven, even when this seems like it's better because it has more stuff, the steps between turns just take so much longer that you get to play less.",
    "timestamp": 1760997600
  },
  {
    "username": "JHunter101",
    "rating": 8.5,
    "comment": "Rating Breakdown:\n\nBase Game Rating (x3): 8.5\n\nScenario 01-09 Rating: x.x\nScenario 10-19 Rating: x.x\nScenario 20-29 Rating: x.x\nScenario 30-39 Rating: x.x\nScenario 40-49 Rating: x.x\nScenario 50-59 Rating: x.x\nScenario 60-69 Rating: x.x\nScenario 70-79 Rating: x.x\nScenario 80-89 Rating: x.x\nScenario 90-99 Rating: x.x\n\nBanner Spear Rating: x.x\nBlink Blade Rating: x.x\nDeathwalker Rating: x.x\nDrifter Rating: x.x\nGeminate Rating: x.x\nNecromancer Rating: x.x\nAstral Rating: x.x\nMeteor Rating: x.x\nShards Rating: x.x\nTrap Rating: x.x\nShackles Rating: x.x\nSnowflake Rating: x.x\nFist Rating: x.x\nKelp Rating: x.x\nCoral Rating: x.x\nPrism Rating: x.x\nDrill Rating: x.x\n\nFinal Rating: x.x",
    "timestamp": 1760133600
  },
  {
    "username": "Maxtheman36",
    "rating": 9.0,
    "comment": "I love Gloomhaven and I'm really happy to be starting Frosthaven. We're only playing once/month so it'll take a LONG LONG time before we make much progress.",
    "timestamp": 1759788000
  },
  {
    "username": "Gaming_Professors",
    "rating": 9.0,
    "comment": "Frosthaven je ledový kolos mezi deskovými hrami. Hra nemá svým rozsahem a komplexností téměř žádné konkurenty. Nabízí nejen taktickou hloubku a napínavé souboje, ale také živý svět, který reaguje na vaše rozhodnutí, a pocit, že každý krok má význam. Není to rozhodně hra pro každého a už vůbec ne pro začátečníky nebo příležitostné hráče. Je to zážitek, který vás může pohltit na několik desítek, ovšem za předpokladu, že hře věnujete dostatek času, prostoru skupinu správných lidí a touhu se všechno naučit.\n\nhttps://www.gamingprofessors.cz/frosthaven-recenze/",
    "timestamp": 1759615200
  },
  {
    "username": "Bohde8781",
    "rating": 9.0,
    "comment": "Really like the world building and improvements made on scenarios vs Gloomhaven 1E, but the puzzle book hit a sour note with our group. Still a solid dungeon crawler and campaign story.",
    "timestamp": 1759096800
  },
  {
    "username": "kipernicus",
    "rating": 8.8,
    "comment": "All the same crunchy goodness of gloomhaven in a boatload of new classes, monsters, and scenarios.\n\nHowever, it is slightly weighed down by the settlement building and crafting portion of the game which adds extra fiddly-ness and is not very fun.",
    "timestamp": 1759096800
  },
  {
    "username": "the_lifetamer",
    "rating": 9.0,
    "comment": "Compared to Gloomhaven:\n\nPros:\n- More Complex Characters. Fantastic design, tough to play, very enjoyable.\n- More Complex Scenarios. A shocker at first, but after a while I started to really, really appreciate the added complexity.\n\nCons:\n- Pennycounting. I'm sorry but no, managing 10 resources in this game is a total chore. We spent hours discussing imaginary redisigns to make the system better, and quite frankly, the most enjoyable ones were the ones that simply shafted it.\n- Riddles. We really did give them a shot. We did. Nope, straight to the solutions now. Nothing to enjoy here.\n\nPros & Cons:\n- Various new system ideas, tied to the buildings. I loved some, mehed others, and thought some didn't really work. I wish I could publicly say which ones I thought were better, but it has to be hidden behind spoilers so meh. Frosthaven is a bag of experimentation for the system, in many ways, I just hope the correct feedback reaches the developer.\n- It's Longer. OK, I love that the game has more missions to enjoy, and they are all great. But, structuring them all in a single campaign, is a royal waste of mission design. The game would be much much more enjoyable if structured in 5 different shorter campaigns with exactly the same total missions.\n\nNot Improved (and dissapointingly so):\n- Immersion. The setting is still generic meh high fantasy. It's so high, you cannot be surprised by anything happening on it - I wouldn't blink even if alliens invaded at this point with all its sillyness. The story is so disconnected from the gameplay, you just don't care. No matter what you do, Frosthaven is gonna grow, your mercs are gonna retire, and boring things will keep happening - It's just an excuse to play a different scenario. And the storytelling is also disjointed, by the time you reach a mission you really don't remember what led you there. Even the payed audio app didn't help much, I found the performances very annoying and almost impossible to understand most of the time due to ridiculous accents combined with loud background noise.\nI'm grumping a bit here, perhaps it really didn't help that the previous campaign game we played was Oathsworn: Into the Deepwood - which was a fantastic experience, immersion wise.",
    "timestamp": 1759010400
  },
  {
    "username": "Kbzombie",
    "rating": 9.0,
    "comment": "1st KS ed.With map holder, solo scenarios,and foam insert and Collector coin. Has legacy components opened and will require a sticker set to reset campaign.",
    "timestamp": 1757887200
  },
  {
    "username": "jultou",
    "rating": 9.0,
    "comment": "Played 15-20 scenarios.\nPreviously played one campaign of Gloomhaven and Jaws of the Lion 2 times.\nSo faw I’m impressed by Frosthaven, the best from the series I think.",
    "timestamp": 1757714400
  },
  {
    "username": "enzo622",
    "rating": 9.0,
    "comment": "I love Gloomhaven, so this is more goodness for my brain with how much more complicated the cards and cooperation are here. I'm still experiencing the town-building stuff, so I need to see how that comes together yet, but I'll be playing 'Haven games for as long as they keep putting them out, I suppose.\n\nPlaying them on Steam, to be clear. I had a copy of GH, but the vast majority of my plays are on Steam. It just works so much better as a computer game than a boardgame unless you have that one friend who will run the enemy AI for everyone else who is too preoccupied with planning their cards.",
    "timestamp": 1757196000
  },
  {
    "username": "docker37",
    "rating": 9.0,
    "comment": "New2023\nPainted character minis",
    "timestamp": 1756764000
  },
  {
    "username": "Khumbanigash",
    "rating": 8.5,
    "comment": "The more I play Frosthaven, the more I love Gloomhaven. Almost all the additions Frosthaven brings newly to the system are unnecessary and slow things down considerably. On paper this all looks interesting, but in reality we just don't care for outpost development, crafting and other stuff you get later.",
    "timestamp": 1756677600
  },
  {
    "username": "Pamponiros",
    "rating": 9.0,
    "comment": "It has sooooo many good elements but initially the outpost phase is very annoying... It's also harder than the original having some extra elements and difficulty additions during the campaign. The book doesn't belong for me... I still enjoy it a lot, hence the 9 and will always play it when my group comes. Currently around 60 scenarios in. P.S. Blinkblade is broken.",
    "timestamp": 1756591200
  },
  {
    "username": "xilia",
    "rating": 9.0,
    "comment": "22 Szenarios played: Great Game!!\nSomtimes a bit overwhelming.",
    "timestamp": 1755900000
  },
  {
    "username": "tothgames",
    "rating": 10.0,
    "comment": "About 90% done with the campaign so I feel ok with leaving a review at this point. Generally an improvement on the base game - classes are more balanced, less hard cc, items are more balanced, scenarios have more win conditions that aren't just \"clear all enemies\". My only real complaints are that the town system is fiddly and the storyline remains so-so (but improved over Gloomhaven).",
    "timestamp": 1762383600
  },
  {
    "username": "efreeman",
    "rating": 10.0,
    "comment": "Only played online but loving it like Gloomhaven",
    "timestamp": 1761951600
  },
  {
    "username": "orangecat17",
    "rating": 9.5,
    "comment": "Fun, widely diverse characters, interesting scenarios, and very thematic.",
    "timestamp": 1761519600
  },
  {
    "username": "Mistrallique",
    "rating": 10.0,
    "comment": "Yes, please give me more! I don't really like the upkeep of the village and I am happy other in my group take care of that. I know this is a bit of a controversial opinion but I preferred GH's characters. Still a 10 because he deserves it.",
    "timestamp": 1761519600
  },
  {
    "username": "Hori16",
    "rating": 10.0,
    "comment": "Jogo favorito",
    "timestamp": 1761170400
  },
  {
    "username": "DadDialTone",
    "rating": 10.0,
    "comment": "Duplicate Copy",
    "timestamp": 1760824800
  },
  {
    "username": "Seonmin",
    "rating": 10.0,
    "comment": "Wow my best game.",
    "timestamp": 1760824800
  },
  {
    "username": "regalia1223",
    "rating": 10.0,
    "comment": "The combat system is designed in a fun way, and the building phase also gives a strong sense of accomplishment. It's a great game.",
    "timestamp": 1760738400
  },
  {
    "username": "ivan_krachko",
    "rating": 10.0,
    "comment": "Has payed only online version but this game is awesome. As for me FH > GH",
    "timestamp": 1760392800
  },
  {
    "username": "Dr.Robert",
    "rating": 10.0,
    "comment": "Amazing product.",
    "timestamp": 1759701600
  },
  {
    "username": "Subaru77",
    "rating": 10.0,
    "comment": "https://boardgamegeek.com/blog/5267/blogpost/172385/fagyosre...\n\nGloomhaven (Homályrév) 2.0 Minden, de minden tekintetben a neves előd javított verziója. Néhol már kicsit \"sok\" is. Az egyetlen negatívum a sok adminisztráció és itt a sok azt jelenti, hogy már nekem is sok, pedig én imádok szöszölni, pepecselni. A játék dobozán a 30 perc/játékos egy vicc. Előkészülés+elpakolás: 30 perc, előörs fázis, utófázis még 40 perc. És akkor még nem is játszottunk \n\nA Fagyosrév küldetései sokkal változatosabbak, mint a Homályrév \"ölj meg minden szörnyet\" típusú tucat szcenáriói. Itt tényleg mindegyik egyedi, izgalmas és érdekes. Van egy plusz építkezős fázis a végén, ez is elképesztően izgalmas és érdekes. Szóval egy hatalmas doboznyi meglepetés, izgalom, érdekesség, mese, rejtély, stb...",
    "timestamp": 1759442400
  },
  {
    "username": "Lendengold",
    "rating": 10.0,
    "comment": "Gereon\n(geschenkt von Anne)",
    "timestamp": 1759356000
  },
  {
    "username": "diosuke",
    "rating": 10.0,
    "comment": "Modo Solo 10, setup muy lento/pasar escenarios/IA Sencilla/entretenido/partidas muchas",
    "timestamp": 1759356000
  },
  {
    "username": "WisElf",
    "rating": 10.0,
    "comment": "+\nFrosthaven. Solo Scenarios\nFrosthaven. Removable Sticker Set",
    "timestamp": 1759269600
  },
  {
    "username": "yabluz",
    "rating": 10.0,
    "comment": "A me piace, non sono stato preso da un gioco così tanto da moltissimo tempo",
    "timestamp": 1759096800
  }
]