[
  {
    "username": "Aster79",
    "rating": 1.0,
    "comment": "Really bad game, great materials but the game mechanics are now 10 years out of date, it still has the defect of making players block very easily, it also has the solitaire mode which I don't dare to think what shit they can be.\nGioco davvero pessimo, materiali ottimi ma le meccaniche di gioco sono ormai 10 anni obsolete, ha ancora il difetto di far bloccare i giocatori molto facilmente, ha anche la modalità solitario che non oso pensare a quale schifo possono essere.",
    "timestamp": 1761778800
  },
  {
    "username": "JanSolo999",
    "rating": 1.0,
    "comment": "powerplants don't work like that, it's a nonsense",
    "timestamp": 1760997600
  },
  {
    "username": "murilocd",
    "rating": 1.0,
    "comment": "Nucleum is much better, can't play it",
    "timestamp": 1760652000
  },
  {
    "username": "mikemcdasl",
    "rating": 1.0,
    "comment": "Ah, Barrage, the game that asks, “What if we took the concept of building dams and turned it into a soul-crushing exercise in logistics, betrayal, and bitter resentment?” If your idea of fun is slowly drowning in resource management while your so-called friends steal your plans and block your progress, then boy, do I have a game for you.\n\nThe theme of Barrage is simple enough: Build dams, produce energy, and conquer the cutthroat world of hydroelectric power. Sounds like a relaxing day in the Alps, right? WRONG. What this game actually delivers is a series of painful lessons in scarcity, spite, and just how far your friends will go to ruin your life for two measly victory points.\n\nLet’s start with the resource wheel, a mechanic so brilliantly frustrating it deserves its own villain origin story. You’ll spend half the game staring at this cursed contraption, wondering why it takes three years to retrieve the materials you need to do literally anything. Want to build a dam? Too bad—your resources are trapped in the void of this circular prison, and by the time you get them back, someone else will have stolen your water supply. Hope you enjoy staring at empty rivers while your opponent gleefully siphons energy from your hard work.\n\nSpeaking of water, this game turns it into the most passive-aggressive currency you’ll ever encounter. You think you’re about to cash in on a lucrative flow of H2O, but surprise! Someone upstream just redirected your precious supply to their turbines, leaving you with nothing but regret and a dry riverbed. It’s less of a game and more of a masterclass in how to ruin friendships.\n\nThe decision-making is another joyless slog. Every choice feels agonizingly important, not because you’re building something great, but because you know every single action is one step closer to complete disaster. Do you upgrade your infrastructure? Place a powerhouse? Cry in a corner because your opponent just built a conduit exactly where you needed it? The possibilities are endless, and all of them are awful.\n\nAnd let’s not ignore the player interaction, which is the gaming equivalent of a knife fight in a phone booth. Every turn is a chaotic mess of blocking, stealing, and outmaneuvering, all wrapped in a thin veneer of strategy. By the end of the game, you won’t even remember who won—you’ll just know who you hate the most.\n\nThe pièce de résistance is the scoring system, which rewards efficiency, planning, and, apparently, dark pacts with the hydroelectric devil. You’ll spend hours agonizing over your moves, only to lose to someone who figured out a broken combo involving a single turbine and a prayer. It’s demoralizing, infuriating, and exactly what Barrage is designed to do.\n\nSo, if you enjoy games that are needlessly complicated, punishingly competitive, and leave you questioning your life choices, Barrage is the perfect addition to your collection. For everyone else, stick to Power Grid. At least you’ll still have friends when it’s over.",
    "timestamp": 1737154800
  },
  {
    "username": "cotomel",
    "rating": 1.0,
    "comment": "There is a glimmer of hope on the main board. Everything else surrounding it drowns it out sadly.",
    "timestamp": 1732748400
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "That shared board has potential. Unfortunately, most of the game happens on personal player wheels.",
    "timestamp": 1722204000
  },
  {
    "username": "firemage85",
    "rating": 1.0,
    "comment": "Terrible",
    "timestamp": 1720994400
  },
  {
    "username": "ultimoratio",
    "rating": 1.0,
    "comment": "UPDATE: MAY 2024: \n\nWow. Even the dam-network side of the game is boring as well.\n\n====================\n\nA game of two halves:\n\nFirst is the beautifully done spatial aspect of placing dam pieces on the map that is highly opaque and depended on collective player decisions.\n\nThe other hand is the utterly mediocre and almost scripted worker placement mechanism. This half literally dragged this otherwise unique and solid design into a mere \"it's a good game, but has problems\".",
    "timestamp": 1716156000
  },
  {
    "username": "gobos",
    "rating": 1.0,
    "comment": "Absolutely awful game. The dark, grey-brown style of the art fits perfectly with the feelings the gameplay evokes - hopelessness, futility, frustration. The game is designed in a way that everything has anti-synergy with everything, making it the most un-fun game I've ever played.",
    "timestamp": 1710716400
  },
  {
    "username": "zw12356",
    "rating": 1.0,
    "comment": "Hard game",
    "timestamp": 1709420400
  },
  {
    "username": "Rabbits",
    "rating": 1.0,
    "comment": "I wish I could rate it lower but alas the geek won't allow for it.",
    "timestamp": 1675465200
  },
  {
    "username": "jyh19930302",
    "rating": 1.0,
    "comment": "Game is worth 7.5, but the KS is horrible. Avoid the publisher. Horrible materials I ever seen.",
    "timestamp": 1667948400
  },
  {
    "username": "Maneloblast",
    "rating": 1.0,
    "comment": "Spanish Edition",
    "timestamp": 1665957600
  },
  {
    "username": "federik21",
    "rating": 1.0,
    "comment": "because cranio sucks.\nReal vote: 7/10\nI really love interactive games and I quite like this game, but I have to say, the more I play, the less I enjoy it.",
    "timestamp": 1663279200
  },
  {
    "username": "iBud",
    "rating": 1.0,
    "comment": "Not my game",
    "timestamp": 1641596400
  },
  {
    "username": "SrFinn",
    "rating": 1.0,
    "comment": "Materpiece game, bad company.\nIt deserves a 1 because of the way the company practically scammed its customers..\n\nThe designers should rework and publish with someone else: Barrage is brilliant design in every single aspect",
    "timestamp": 1621893600
  },
  {
    "username": "west8999",
    "rating": 1.0,
    "comment": "bad company",
    "timestamp": 1598911200
  },
  {
    "username": "Glanzmuecke",
    "rating": 2.0,
    "comment": "Just look at the map! It's ridiculous: nine (!!!) reservoirs right next to each other! Even for a fictional board game, that's just incredibly stupid. You don't spend resources, you throw them into a wheel, and eventually they come back. lol",
    "timestamp": 1756332000
  },
  {
    "username": "sup3rdan",
    "rating": 2.0,
    "comment": "Not for me",
    "timestamp": 1744149600
  },
  {
    "username": "WalkerGame",
    "rating": 2.0,
    "comment": "dopo una partita mi fuma ancora la testa e mi sono cadute le p... a terra",
    "timestamp": 1735599600
  },
  {
    "username": "Maglinkinpark",
    "rating": 2.0,
    "comment": "After two plays of *Barrage*, I’m certain that this game isn’t for me. From the moment I started, I found the board and components to be a chaotic, visual mess that makes even the simplest tasks feel cumbersome. The graphical design is cluttered and difficult to navigate, forcing you to spend more time deciphering the board than enjoying the gameplay. This visual disarray detracts from the experience and makes the game feel like a chore, rather than a fun and engaging challenge.\n\nThe core concept of *Barrage*—building and managing hydroelectric dams to generate power—is actually fantastic, which is what drew me in initially. I was excited by the premise and eager to see how it would play out. Unfortunately, while the idea is intriguing, the execution falls flat. Turns are dull, with most decisions feeling uninspired or mechanical. There’s little excitement or creativity in the actions, making each round feel more like going through the motions rather than strategizing in a meaningful way.\n\nOn top of that, the player interaction, which should have added some dynamic tension, is practically non-existent. While the game does offer opportunities for players to interfere with one another, there’s little incentive to actually do so. In many cases, it’s easier and more efficient to work in isolation rather than engage in any meaningful competition or cooperation. As a result, the interaction feels hollow—technically there, but lacking any real impact or significance.\n\nOverall, despite the game’s promising concept, *Barrage* is a massive letdown for me. Between the poor design choices, tedious gameplay, and lackluster player interaction, I can’t see myself ever enjoying it. This is an insta-sell for me, and I doubt I’ll ever play it again unless I have no other choice.",
    "timestamp": 1726351200
  },
  {
    "username": "Alb1979",
    "rating": 2.0,
    "comment": "Horrible, aburrido, castiga mucho los errores, las fichas de recursos son ridículamente pequeñas y queda muy lejos de la calidad del resto de los componentes, pero en general el esfuerzo que requiere no se ve recompensado ni aun ganando. Jugado un par de veces, la segunda solo para corroborar la primera impresión. Me parece que tiene ideas buenas para quien le guste esta clase de interacción y sufrimiento, desde luego no es para mí.",
    "timestamp": 1726264800
  },
  {
    "username": "Guerkchen96",
    "rating": 2.0,
    "comment": "hat Hannah behalten",
    "timestamp": 1693778400
  },
  {
    "username": "tbpinter",
    "rating": 2.0,
    "comment": "Terrible components, terrible art, and there are better games to be played.",
    "timestamp": 1679868000
  },
  {
    "username": "djali2015",
    "rating": 2.0,
    "comment": "Ouch",
    "timestamp": 1666821600
  },
  {
    "username": "evlkeith",
    "rating": 2.0,
    "comment": "My low rating is a combination of being able to lose a 3hr game on the first turn, the high level of meanness, and the huge point differences.\n\nI will never play this again.",
    "timestamp": 1639522800
  },
  {
    "username": "W33k5",
    "rating": 2.0,
    "comment": "I played this game all the way through and I don't know if I can even explain to you what happened during the game. I think it's about water or something.",
    "timestamp": 1611702000
  },
  {
    "username": "ForrestKohl",
    "rating": 2.0,
    "comment": "Barrage is full of interesting ideas. The production wheel is a really cool idea. The way it works is that, in barrage you are building hydro electric power grids, when you build a dam, and elevated dam, a conduit, or a power plant, you place the required resources on a production wheel. The way this works is that you are limited with what you are building because of what is allocated on the wheel and only once it has turned 360 degrees can you have your resources back. It also wants to play with interdependance on other players to produce power.\n\nThat ends the nice things about Barrage. Barrage is an up to 4 player worker placement game and it has some major issues. I've said that the game wants to play with players have interdependance on their grids. But it doesn't work. In barrage you need 3 buildings to make power. The first is a powerplant, it must be yours. The second is a conduit, it can be anyone's, but if you use someone's they get a victory point and a power. The last building is a dam, it can be yours or one of the neutral starting dams. In theory the conduit belonging to anyone else is interesting as you could potentially have someone build a conduit and you have to make the call whether its worth giving them a victory point and a gold. But it doesn't work at all. The issue is that every basin where water flows is identical. There is a spot for a lower dam, and upper dam and two conduits on the side. This is a trick. In barrage there are red spaces which if you wish to use them you need to pay 3 gold. The upper dam has this extra cost, but is the only viable option at any point.\n\nLet's say you build a conduit and a powerplant hoping to make water from a neutral dam which currently holds 1 water token. It theory this is a good idea, but there is an issue. A dam can easily be placed above the neutral dam. This effectively ruins the entire production scheme of players who use the lower dam. The issue is even worse if you choose to build a lower dam and this occurs. But why is it so bad? just build somewhere else now! But therein lies the entire problem with barrage. You cannot. Remeber that nice little wheel. It would currently be holding all resources you used to build, and the only way to turn it is to use meeples and gold for higher order spins. If you were screwed out of production one round and could not fufill a contract it could take as much as 13 gold and 6 of 10 workers to get all resources back. But you only start with 5 gold and the outset.\n\nThis highlights the issue with barrage which is that it is nigh impossible to get out of jams were you are low on resources, i.e. the beggining, meaning that almost all later outcomes are determined by how the first round goes. If you produce loads of power and get good rewards from your contracts you are set up to do even better the next round. If you don't you are at a much worse position. The only \"catch-up\" type implementation is that lower producing players are first in turn order. But turn order matters very little after the first round. See the issue? You step up this further by the fact that most if not all rewards of gold, VP, etc are determined by random contracts which are dependent on making power. This means players who make high power early on get more opportunities to do so later.\n\nThis once again all wraps around to the dam issue. Moving your desired dam location, powerplant etc. are nearly impossible in barrage. Once you have placed your first set of buildings, moving is extremely difficult as other easy and cheap locations have already been taken by other players. This is because in order to make resources you need to make power which is impossible if you have been blocked early on.\n\nWhat's better is that barrage can last a good 3 hours meaning you slowly try to claw back but to no avail as the rich get richer. Not to mention terrible iconography which is easily misreadable and extremely unbalanced player powers.\n\nAnd I haven't really touched on the worker placement and for good reason. In barrage its as simple as I need to do this so I need to take these actions in this order. None are very interesting and some seem underthought.\n\nIf you want the experience of trying to claw from rags to riches only to have hope literally dammed away I recommend barrage.",
    "timestamp": 1602885600
  },
  {
    "username": "Orph",
    "rating": 2.0,
    "comment": "This game suffers from the same problem that many newer games seem to have. The designers want to make the game as convoluted as possible in order to artificially inject as much complexity as possible. This felt like someone played Tzolkin, Terra Mystica, Age of Steam and said what if all of that was in one game? The answer is that it would give you a headache and be not fun. Way too convoluted and difficult to follow for my taste.",
    "timestamp": 1583708400
  },
  {
    "username": "enricomi",
    "rating": 2.0,
    "comment": "Boring, long, over complicated",
    "timestamp": 1577574000
  },
  {
    "username": "Ratefuchs",
    "rating": 2.0,
    "comment": "A very good idea for a game, but mechanically kind of broken. The building units are blocked ver long and the participation on someone elses production is pretty low. Don't know, if the rules got changed later. In our group it flopped",
    "timestamp": 1576364400
  },
  {
    "username": "wilsonza",
    "rating": 2.0,
    "comment": "Unenjoyably unforgiving and cutthroat. Solid game mechanically and visually otherwise.",
    "timestamp": 1574550000
  },
  {
    "username": "tepepe",
    "rating": 2.0,
    "comment": "garbage",
    "timestamp": 1568757600
  },
  {
    "username": "masimp1",
    "rating": 2.0,
    "comment": "Rules are painful. Do not play. If played be ready for a knife fight!",
    "timestamp": 1567720800
  },
  {
    "username": "Slashdoctor",
    "rating": 3.0,
    "comment": "\"Last to Make a Mistake\" the board game.",
    "timestamp": 1762038000
  },
  {
    "username": "tectactoe",
    "rating": 3.0,
    "comment": "The correct answer to anyone who thinks eurogames have \"no interaction\" and are merely \"multiplayer solitaire\". Ask them how it feels to have the perfect hydroelectric system constructed only for another player with more money to build a dam directly above yours and steal your only source of rainwater. I still haven't figured out how to do well at this game but I am (mostly) enjoying the exploratory phase at this point. Despite how utterly restrictive it often is.",
    "timestamp": 1761519600
  },
  {
    "username": "Scifi66",
    "rating": 3.0,
    "comment": "TLDR->just play Brass Lancashire\nNow played this 4 times and problems are emerging.\n– The game is more about your own player board (powers and bonuses) and the worker placement puzzle than competing for water to run through turbines. Points from built structures are more important than those from energy. If I wanted to play that game I'd play Terra Mystica over this.\n– Not producing energy early seems to be the dominant strategy to max out bonuses for Rounds 4+5. This again feels weird for hydropower simulation.\n– Player powers are wildly unbalanced from situational to great.\n– Contracts are random, some are much better than others.\n– It is pretty unfun when someone is totally shut out early and this can occur even when they play well.\n– Runaway leader effect\n\n++++\nInitial 7. Played this at both 3 and 4p.",
    "timestamp": 1751666400
  },
  {
    "username": "Eliya84",
    "rating": 3.0,
    "comment": "I found the theme very interesting. But the Balance of this game is so bad the valuable Player Power and so different. 2 Times played same feeling never play it again.",
    "timestamp": 1747692000
  },
  {
    "username": "Zapata",
    "rating": 3.0,
    "comment": "I'm not rating the design itself. I'm just rating the level of fun I had playing this (way too long) game. Not a game for me. Doesn't mean it's a bad game",
    "timestamp": 1747260000
  },
  {
    "username": "jtrleone",
    "rating": 3.0,
    "comment": "Only played twice but it's very hard to follow. Making 1-2 errors early game throws the entire game. Can easily lead to kingmaking.",
    "timestamp": 1743030000
  },
  {
    "username": "Shiny Blue Robot",
    "rating": 3.0,
    "comment": "Visually the game is beautiful and I love the theme. I really wanted to like this game.\nThe resource wheel is an innovative and cool idea - had me feeling engaged. I like the puzzle of getting that wheel turning and being efficient with the resources/timing.\nIf you are out of sync in the turn order and short of money or materials, there's really no room for you to pivot onto a second or third strategy (especially in a higher player count). It felt binary to me - you either got what you wanted or went entirely without and then lobbied for turn order hoping to have another chance next round.\nI've heard people describe the game as mean. I didn't see it as mean since it's just a linear conclusion that someone will cut into your water flow. It's logical and necessary - not mean. Mean games (in my opinion) are more about playing cards that cause other players to fail or lose opportunities/resources. However, in Barrage, it does feel deflating to have your work undone by another player's need to build above you - and you can't really get around that (other than creating extra water so that you can grab the overflow). Area control works best when you can tug-o-war and compete back and forth for control. I understood quite well that I could build further upstream to better access the water and not be cut out - but the process and expense you need to go through to finally get the resources had me wondering why we were playing this (as opposed to the hundreds of other game options). Round after round I found the game annoying, clunky, and disjointed. I don't know that the players can be creative and find a unique strategy. It doesn't leave you with that feeling afterward where you hope to play again so you can try something different next time. Instead, it's the sort of game that plays very much the same every time - the only variability will be where you sat in turn order, which player powers you chose (which are very unbalanced), and who got to be the king-of-the-hill first. Player powers and the technology tiles are considerably powerful so turn order is so essential for optimal advantage and being able to grab those. Overall, I find that this game is just frustrating and much too long for what it offers. So many other games do this better. To scratch this sort of itch I'd recommend Powergrid, Agricola, Age of Steam or Brass.",
    "timestamp": 1731020400
  },
  {
    "username": "Wolfshade",
    "rating": 3.0,
    "comment": "Barrage tries to innovate but ends up being unnecessarily complicated and unengaging.\nThe gameplay feels flat and boring, much like the map and artwork.\nThe visual design and unclear iconography are clumsy, hinder gameplay rather than facilitate it.\nPlayer buildings inexplicably look different from each other AND how the icons look, they don't look really better so why bother?\nThe game fails to deliver a real sense of accomplishment.",
    "timestamp": 1720389600
  },
  {
    "username": "setropo",
    "rating": 3.0,
    "comment": "ECDE #1\nEs un gran juego, pero lo vendo porque jugarlo me da una pereza enorme. La expansión está bien, pero tampoco me parece imprescindible.",
    "timestamp": 1718316000
  },
  {
    "username": "midna2003",
    "rating": 3.0,
    "comment": "Initial thoughts after first 4 player game:\n\nI was hoping for this to be a Brass-like experience, unfortunately this was very much not the case.\n\nWhat I like:\n-The shared infrastructure/parasitism; Unfortunately, this part of the game is much smaller than I thought, since only one of the three structures in the game can be shared between players.\n-Generating power to fulfill contracts, to get rewards, etc. feels nice. Sometimes there are these turns when you get a satisfying combo, however, in my first play this did not happen too often, but could be due to me playing bad.\n\n\nWhat I dislike:\n-My main criticism: Before you get to do the fun actions (mainly building structures on the board and then generating power) you need to jump through so many hoops and complete so many procedural steps. Before you can do the fun things, you need to collect money, collect machineries, turn the wheel, get contracts, etc. It just seems to me that the majority of the game you do annoying, menial things for the few rare occasions when interesting stuff happens.\nIt is possible, that this felt to me like that, because I couldn't get a good engine going. Maybe with better understanding less time needs to be used for getting all the resources. But during the first play I really did not have fun.\n-The playtime was 4h for a 4-player game (not including the teach. Yes, we had one player with some major AP issues, but even with faster players I don't see this game lasting much less than 3 hours.\n-The asymmetry betwen factions seems very unbalanced on first glance\n\n\nMy hope is that with a couple of plays I can figure out how to build an efficient engine and that the proportion of \"fun\" to \"chore\" gameplay will improve.",
    "timestamp": 1706655600
  },
  {
    "username": "CardDuke",
    "rating": 3.0,
    "comment": "If a generic company is constantly pumping out your groundwater to increase its own profits, the fun of the game is also out at some point. The game can/will feel extremely punishing, and doesn't offer enough opportunities to recover from knockbacks efficiently, and also in this game I don't understand why anyone would include random contract cards in a strategy game. Game material is very fiddly despite imposing box.",
    "timestamp": 1697407200
  },
  {
    "username": "b4b8",
    "rating": 3.0,
    "comment": "Punishing worker placement. Some asymmetric abilities feel much worse than others. Water mechanic flowing down is interesting but did not like this game. Would not play again.",
    "timestamp": 1691272800
  },
  {
    "username": "Albatraous",
    "rating": 3.0,
    "comment": "Very dry, far too complex and doesn't really feel as if you are doing anything each round. Seems to be one that players who like to plan their whole game from the start would enjoy, but I prefer games where you get more agency each turn, such as A Feast for Odin",
    "timestamp": 1689804000
  },
  {
    "username": "rick3623",
    "rating": 3.0,
    "comment": "Everything fun you do on your turn, crushes another player. Then, the leader snowballs with money and Points. Why would anyone make a game like this?",
    "timestamp": 1678057200
  },
  {
    "username": "lumor_",
    "rating": 3.0,
    "comment": "The game has some really cool mechanics but it's just so tedious to get them going. Maybe fewer slots in the construction wheel, cheaper prices for stuff and lots of more water flow could fix it.\nIt feels more like you are trying to squeeze out some moist from dry lands than actually managing a flowing river.\nVery unforgiving for early mistakes that leave you hopelessly behind for the rest of the game.",
    "timestamp": 1662415200
  },
  {
    "username": "dogzard",
    "rating": 3.0,
    "comment": "Not one that was on my radar, It still isn't. The rulebook was fiddly and hard to decipher, which made learning what is an already complex game that much harder. Plus, the whole point of the game is to screw the other players. Not my idea of fun. Not my favorite by a long shot.",
    "timestamp": 1661205600
  },
  {
    "username": "Iron_Salamander",
    "rating": 3.0,
    "comment": "Naming a game Barrage and not having artillery in it is a crying shame (yes I know Barrage is dam in French), but joking aside, this thing is dry despite the water 'theme' and it made for an extremely boring experience. Add to that, the rotating pieces for moving your used assets around were broken in my friend's copy so low quality components plus nonsensical premise and a tedious experience is not a great combination.",
    "timestamp": 1651442400
  },
  {
    "username": "shmonkey",
    "rating": 4.0,
    "comment": "7 after 1 play on BGA. This was an interesting game. thought i would get destroyed after seeing round 1 play out but i ended up in 2nd. This WP game has an interesting cadence due to the construction wheel. There are lots of decisions around how to generate power and if and when to block others. I enjoyed this but felt lost strategically. I want to play a few more times before i come to any real conclusions. Deliciously interactive. A bit mean, but also never felt like i was completely locked down. The game has potential.",
    "timestamp": 1759874400
  },
  {
    "username": "cinnzel",
    "rating": 4.0,
    "comment": "La temática del juego la veo muy bien trasladada al tablero principal, pero noto capas de complejidad añadida sin mucha justificación. Además, siendo tan complejo, me extraña que haya prácticamente una única vía para conseguir puntos de victoria. Sensaciones similares al Brass: Birmingham.",
    "timestamp": 1755036000
  },
  {
    "username": "Ginewra",
    "rating": 4.3,
    "comment": "bga",
    "timestamp": 1753740000
  },
  {
    "username": "schtefan",
    "rating": 4.0,
    "comment": "I won the game that we played. I did not like it. The dynamics do not feel energizing. Every turn felt tedious, exhausting. I see the design greatness in it, it is an interesting puzzle that has been created here. But it felt not fun playing it. Will surely not play again.",
    "timestamp": 1748901600
  },
  {
    "username": "bannanister",
    "rating": 4.0,
    "comment": "BGA. I am not a a big take that / mean interaction - type game person. So not a huge surprise that this is a miss for me. So so many other games I would rather play than this. Would be willing to try again but.... man lol not that fun.",
    "timestamp": 1747605600
  },
  {
    "username": "tbrofromspace",
    "rating": 4.0,
    "comment": "I wish this was more fun than it is.",
    "timestamp": 1743631200
  },
  {
    "username": "parpari",
    "rating": 3.7,
    "comment": "Man, this one was my biggest disappointment of last year. It feels it got inspiration form Power grid ditched auction mechanism and replaced it with worker placement. Also, it streamline main map from spreadsheet-ness of Power grid which are great to me. However; core game mechanism of the game lost it focus from the main board to the personal board which leads the game to be rondel of personal resource optimization, more of the solitaire game. The final nail in the coffin was for me is very unbalanced player powers. In 3 hours solitairish game, it is not fun.",
    "timestamp": 1743544800
  },
  {
    "username": "Jedita",
    "rating": 4.0,
    "comment": "BGA",
    "timestamp": 1738882800
  },
  {
    "username": "ekskafeas",
    "rating": 4.0,
    "comment": "You get the same satisfying feeling of when you do your taxes. I am obligated by law to do this once a year and thats enough for me...",
    "timestamp": 1732662000
  },
  {
    "username": "Desigual",
    "rating": 4.0,
    "comment": "I need to play this game more times to write a review.",
    "timestamp": 1712700000
  },
  {
    "username": "janglemangle",
    "rating": 4.0,
    "comment": "it uses mechanics i like alongside euro elements i dislike",
    "timestamp": 1708988400
  },
  {
    "username": "RobyaVP",
    "rating": 4.0,
    "comment": "2 handed solo, Solo",
    "timestamp": 1707951600
  },
  {
    "username": "lyndathompson1",
    "rating": 4.0,
    "comment": "Hmmm... so mixed on this one. I'm still not sure I like this game. But I see the mechanics are good. Components are TERRIBLE, also. Sold at HexaCon.",
    "timestamp": 1706310000
  },
  {
    "username": "Quadenstein",
    "rating": 4.0,
    "comment": "Not my piece of cake. Unneccesarily complicated. Rather short playing time if you consider the long time you need to set up the game. Covers a lot of room on the table, in fact all players finally stood around the playing table.",
    "timestamp": 1705705200
  },
  {
    "username": "XShrike",
    "rating": 4.0,
    "comment": "Rich get richer and the poor get poorer.\n\nIf you start to all behind there is little you can do to catch up. Once you start getting ahead, nobody can catch you.",
    "timestamp": 1694642400
  },
  {
    "username": "adamgrey",
    "rating": 4.0,
    "comment": "Extremely punishing. The UX for this game is abysmal (the font is unreadable, the colors are drab and the board is confusing to try to follow). Additionally, the player powers are very unbalanced the one where you pay money instead of equipment is terrible.\n\nIt's probably a better game than I rated it but I don't think I'd like to ever play this again.",
    "timestamp": 1691359200
  },
  {
    "username": "Gorgoneion",
    "rating": 4.0,
    "comment": "Make way for a new under 50 rank BGG entry! Very innovative and cutthroat, infinitely expandable. The explanation may be long but actual gameplay is pretty clean and intuitive after that.",
    "timestamp": 1679439600
  },
  {
    "username": "Tactl3ss",
    "rating": 5.0,
    "comment": "Based on a multiplayer game. It is so punitive, if you miss your early game, you suffer during the whole (very long) game.",
    "timestamp": 1758664800
  },
  {
    "username": "Beefy79",
    "rating": 5.0,
    "comment": "Played Mike's Copy",
    "timestamp": 1758146400
  },
  {
    "username": "El_Vis",
    "rating": 5.0,
    "comment": "Z każdą kolejną partią było coraz gorzej... Obecnie nie mam ochoty do niej siadać.",
    "timestamp": 1755468000
  },
  {
    "username": "rizcharger",
    "rating": 5.0,
    "comment": "Unenjoyable overcooked Euro game with tideous and clunky mechanics. Its theme has no bearing on hydrology.",
    "timestamp": 1752962400
  },
  {
    "username": "Takhyon",
    "rating": 5.0,
    "comment": "On paper this should be right up my alley. I usually enjoy games that are tight and interactive, but I’ve played this four times now and still do not like it. The best part of the design is by far the shared board and the water flowing dynamics, very cool. However paradoxically this is actually not the main focus of the game, as the puzzle is actually more about worker placement and unlocking bonuses from your player board, yawn. It’s more about personal resource optimization and action sequencing.\n\nI also just could not care less about what I am supposed to be doing in the game to score points, like the end-of-round scoring is boring, the contracts are boring, and even the actual power generation action is boring. The scoring also has a stupid cadence to it since the best way to play this seems to not be producing much of anything until the last two rounds. Basically you just focus on building up your engine and get rid of buildings from your player board, to then produce a lot in the last few rounds to focus on the last two scoring tiles.\n\nI also really hate the resource wheel, I genuinely do not understand why that’s something people rave about as the unique highlight of the game, to me it’s just a gimmicky way of generating additional busywork with the tiles and making people have to take actions to spin the wheel along. I also think the game is tight and punishing to a fault, a couple of bad moves and you will definitely “softlock” yourself, which causes players to agonize over their decisions, and makes the game flow sluggish and AP prone. All of the above just ends up creating a game I do not have fun with when I play it.",
    "timestamp": 1750975200
  },
  {
    "username": "eddieb",
    "rating": 5.0,
    "comment": "This game feels much bigger than it is. Replayable like crazy.\nReading that 2 years later and I'm so confused. I have never wanted to play it since then.",
    "timestamp": 1746568800
  },
  {
    "username": "Nicocolithophoride",
    "rating": 5.0,
    "comment": "I really don't like it. Even if the topic is original, making run drops of water through dams, it is not worth it. I don't get the hype around the game",
    "timestamp": 1730761200
  },
  {
    "username": "Forgeforgeforge",
    "rating": 4.5,
    "comment": "A great game teaches you how to play it as you go. Barrage does not. Like most worker placements you play one round and go \"oh I get it now, can we start over?\".\n\nReally, really beautiful idea of pumping water around this chutes and ladders map to run your generators, very very cool. Shame is you barely ever get to do it.\n\nedit: studied some high level BGA play, and the game is even less about shipping water than about spinning your disc and compounding bonus tiles. snooze. GWT has the issue where building points dominate cow deliveries, ie the stated goal of the game is not at all how you actually win it, but GWT is an approachable candyland smorgasbord and this game is tight and punishing in a way that can only be understood retrospectively, which makes this misdirection less forgivable. It's always \"next game\" will be better.\n\nEven when you win by a mile it's maybe a first round dam placement and a lucky chain of randomly arriving bonus tiles that gave you the majority of your points, rather than anything emergent between players (unless you consider yourself \"good\" at a game like this, which is just memorizing bonus combos and getting familiar with efficient contracts).\n\nThis game is 'high interaction' but the individual constraints are high enough that each players short term goals have little to do with each other, so the blocking that happens is mostly incidental. Scoring/efficiency wise contracts have less impact than the tech tiles, which are the problematic \"situationally good\".\n\n\nI just want to play the stripped down abstract/auction game of buying spots on the map for dams and power plants. This game needs MarraCashed.",
    "timestamp": 1730242800
  },
  {
    "username": "criticalcomma",
    "rating": 5.2,
    "comment": "Sadly Barrage was not for me, despite being introduced by someone who loves the game super super a lot. Would be down for an in-person play to see if a fuller explanation makes something click, but as it currently stands? Not a major priority for me.",
    "timestamp": 1730070000
  },
  {
    "username": "skipaoff",
    "rating": 5.0,
    "comment": "То, что я бы назвал добротным сложным евро.\nИгра не щадит ошибок и я, который вначале допустил ошибку, в конце закончил игру с 45 балами, когда другие с 110.\nОчень много аспектов которые стоит учитывать в просчетах. Из всех евро - самая сложная из тех, что я играл.\nМне не понравилось, что нет механик помогающими сильноостающим. Это приводит к тому, что сделав хоть одну ошибку в начале - в этот момент вы проигрываете",
    "timestamp": 1729893600
  },
  {
    "username": "langschnabel",
    "rating": 5.0,
    "comment": "Extremely ugly game. Played it once, cannot see any fun in it.",
    "timestamp": 1725573600
  },
  {
    "username": "SovFloyd",
    "rating": 5.0,
    "comment": "Emily et Thibault",
    "timestamp": 1720821600
  },
  {
    "username": "hiimjosh",
    "rating": 5.0,
    "comment": "Barrage has been compared to games I like, but it is squarely in a certain school of design that I just don’t gel with: symbol soup everywhere, effects with costs tied to very, very particular areas and components, complex systems that flow into one another coupling and jitter stepping if anything goes wrong.\n\nBarrage is the antithesis of clean and elegant. It’s not the kind of game that you play and go “wow, this is smooth; the designer thought this dilemma up so well”. It’s the kind of game where you see a tornado of ideas and raise your eyebrows wondering how we got to this. Why is the game like this? Did we really need the wheel and the contracts and the bonuses on the player boards and the cost-scaled worker spots and the nest of flow paths and the four resources and the variable player powers and the scoring rewards? Make sure to update Excel before you play. Comparisons to Brass and TGZ seem superficial at best. It is really just the latest in the A Feast for Terra Project: Great Western Efficiency Puzzle line.",
    "timestamp": 1718661600
  },
  {
    "username": "trino2toluene",
    "rating": 5.0,
    "comment": "Everything is wrong",
    "timestamp": 1715983200
  },
  {
    "username": "Nikomakhos",
    "rating": 5.0,
    "comment": "Too much to try once. Nice if you plan to play it a lot. You’ll learn the rules and strategy in subsequent games. This is like Golem, not GAH or VoMP - ie. too much for me.",
    "timestamp": 1713564000
  },
  {
    "username": "Animepops",
    "rating": 5.0,
    "comment": "Interesting concept. I might like it better after some more attempts because I didn't really understand it as much as I thought I did after tutorial. (Rating based on digital play alone)",
    "timestamp": 1711666800
  },
  {
    "username": "VoltyPotato",
    "rating": 5.0,
    "comment": "1st play: Was confused and a bit bored of the game. May need to play a couple of more games to understand if this is for me or not.",
    "timestamp": 1711494000
  },
  {
    "username": "thdizzy",
    "rating": 5.0,
    "comment": "I'm not a big fan of this.",
    "timestamp": 1711407600
  },
  {
    "username": "Ranuck",
    "rating": 5.0,
    "comment": "It is getting better over plays, but it should have been sold with the expansion as a complete game. For special ocasions, but not for me",
    "timestamp": 1710802800
  },
  {
    "username": "thecorsetmaker",
    "rating": 5.0,
    "comment": "After a particularly frustrating second play (with expansion) I'm dropping this one. It's still a great design, but if the rankings are based on how often you would want to play a particular game then I have no choice. Who knows, it may rise back up after a third play, if there ever is one.",
    "timestamp": 1708815600
  },
  {
    "username": "Schatzkanzler",
    "rating": 5.0,
    "comment": "Moritz",
    "timestamp": 1696370400
  },
  {
    "username": "konstantin_ch",
    "rating": 5.0,
    "comment": "I'd rather play Brass:Birmingham 10 times than this even once more. New/casual players definitely need a couple of practice games, which means whooping 6+ hours to be wasted on a mediocre gaming experience.\nToo much planning with relatively small reward per action, feels like full time job and if you make a mistake - you're out of the game.\nGet it if you like this kind of experience.",
    "timestamp": 1686607200
  },
  {
    "username": "lewix",
    "rating": 5.0,
    "comment": "룰은 크게 어려운 부분은 없이 발전만 하는 게임으로 고려하기엔 부대 처리 부분이 좀 있는 편이다. 특히 리소스와 건물 짓기가 특이해 전반적으로 운영을 기반으로 지속적인 액션을 할 수 있는 상황을 만드는 것이 중요해 보인다.\n\n그렇지만 운영을 통해 점수가 자동으로 만들어지지 않고 계약 타일을 통해 간접적으로 이루어지다 보니 운영과 타이밍에 맞춰 적절한 수집을 해야하는 부분이 있어 이 부분은 약간 개인적 성향으로 보면 아쉽다(순수 경제 게임이라기보다 그걸 바탕으로 타일을 수집을 강요하는...)\n\n상대적으로 쉬운 나일강 확장으로 해보아서 본판만의 빡빡함을 느끼지 못해 그럴 수도 있도 보이지만 게임은 괜찮다.",
    "timestamp": 1683410400
  },
  {
    "username": "ravenskana",
    "rating": 5.0,
    "comment": "Played on the “deluxe” version which was not a great experience, primarily in the wheel that just didn’t do it’s job. The three-tier board I think was a bad idea, as there is a lot of things going on visually following spatial connections, and I think it would be easier to see if the entire thing was flat. While I understand the mechanical point of the multiple connections, it seems there could have been a much easier way to see how things interconnect; particularly, when water went “up” I thought that was not intuitive. Thematically, I like it; there’s a bit of shared infrastructure to exploit (and seems this could have been increased easily); the terminology I found forgettable which may be on me but made some things harder than it needed to be. Would play again, but not sure how many more times; I suspect that the actual game, like the production, likely needs a bit more work.",
    "timestamp": 1682719200
  },
  {
    "username": "iluvswatches",
    "rating": 5.0,
    "comment": "Only played this once and I did not have a great experience. I played with someone who had played several times and then taught it to me. He would then point out moves I could make and then tell me he was going to do them before I would get a chance to do them. Definitely soured my experience. I might try this again with someone else, but unlikely as I have found this isn't really my style of game.",
    "timestamp": 1678230000
  },
  {
    "username": "wroday",
    "rating": 5.0,
    "comment": "This game feels like a lot of work and little reward. I normally love games like this, but nothing feels satisfying in Barrage. Building, rotating, water flowing, taking actions- everything feels like it's more work than it's worth. I can't quite put my finger on why it doesn't work for me, but it just doesn't work for me.",
    "timestamp": 1678143600
  },
  {
    "username": "aquir",
    "rating": 5.0,
    "comment": "(First impression)",
    "timestamp": 1677884400
  },
  {
    "username": "xetaro",
    "rating": 5.0,
    "comment": "Boring ass game",
    "timestamp": 1677798000
  },
  {
    "username": "lee elektrik",
    "rating": 5.0,
    "comment": "The charming central board creates very interesting player interaction which would elevate this otherwise very standard worker-placement above average if only it had less stuff; less small bonus points you score here, less individual player powers to keep track of there and so on.\n\nAlso, all components feel somehow off; the miniscule wooden bits are hard to handle and enigmatic in their meaning, the building wheels keep getting stuck, the much-handled money tokens are too thin and small, and so on.\n\nThe beautiful cover and the flavour blurb about some hydroelectric dystopian future are somewhat disconnected, setting-wise, from the actual game.",
    "timestamp": 1675206000
  },
  {
    "username": "JSMA",
    "rating": 5.0,
    "comment": "Monoton\nRepetitiv\nLangweilig\nUnglaublich dünne und schlecht verarbeitete Pappe",
    "timestamp": 1674946800
  },
  {
    "username": "SaiSaysPlayGo",
    "rating": 5.0,
    "comment": "An efficiency puzzle with some player interaction.\nI like the idea of the game, and water flow can be interesting; however, gameplay is primarily about building - planning how to get a lot of buildings into play as soon as possible. Player interaction centers around water flow, which is of secondary importance for point scoring.\nPlaying the game, I feel like there were a lot of missed design opportunities, or that it was intended to be played solo.",
    "timestamp": 1670972400
  },
  {
    "username": "littlechandler",
    "rating": 5.0,
    "comment": "Initial Impressions: This is a really cool designed game with how it gives the feel of hydroelectric generation barons, between what you need to set up your dams to produce power, to the long cooldown to complete the projects, to how you need to secure contracts to produce enough power, and then the way the water is held and flows down adds quite a bit of interaction. It also doesn't actually have that much rules; the complexity is much more that you can totally screw yourself up to doing almost nothing if you mess up. But it isn't my type of game. There is only a hint of engine building here, and while I didn't find the game overly mean I don't like the feel of constantly looking over my shoulder to see if someone's moves will cascade into a totally different board state. I much prefer interaction that is clear from somewhat far away. And the action spaces while keeping the game having a fairly low rules overhead do not feel particularly exciting.\n\nProbably not a problem with experienced players, but the way the end of round objectives are diminished means with new players they matter much less, since new players won't be able to do enough for the rewards for the objectives to be diminished.",
    "timestamp": 1670713200
  },
  {
    "username": "kystas",
    "rating": 5.0,
    "comment": "Slowpaced workerplacement game which doesn't offer enough interesting decisions and maneuvers to do. The biggest issue is the missing of surprise elements - and that's a huge miss in a game like this. Now... it's just one more not so interesting workerplacement euro, which takes couple of hours.",
    "timestamp": 1667862000
  },
  {
    "username": "rekath16",
    "rating": 5.0,
    "comment": "Whereas the idea about energy production with water seems to be very interesting (and I really liked the waterflowing system), Barrage left me with a mediocre opinion.\nI am not a fan of its thematic setting (dystopic 1930s...), the illustrations are sad and dark. What makes Barrage worse for me, and this is only a personal opinion because I know it has many fans, is its destructive mechanisms. Building infrastructure takes a lot of time and with few tricks can be shot down by your opponent, I do not like Take That elements. We even had the feeling that a certain combination of country and engeneer was extremely unbalanced. I absolutely prefer more peaceful games.",
    "timestamp": 1667775600
  },
  {
    "username": "Chris Coyote",
    "rating": 6.0,
    "comment": "ok game. Very cuthroat with 4 players.",
    "timestamp": 1761084000
  },
  {
    "username": "ditterio",
    "rating": 6.0,
    "comment": "A good game but I didn't like the flows of the water. It found it too punishing.",
    "timestamp": 1759960800
  },
  {
    "username": "enjayem",
    "rating": 6.0,
    "comment": "Not sure when I'd ever play this over Terra Mystica",
    "timestamp": 1759874400
  },
  {
    "username": "TertiaVigilia",
    "rating": 6.0,
    "comment": "Complex worker placement game, with challenging Automa system. The artwork is not the best, but the gameplay is really great, lots of interaction, lots of variability, lots to think about. Despite having VPs as victory condition, you are truly immersed in the theme (which is great), and never focus on VPs too much.\nI finally got rid of it due to its bad production value, quality and artwork.",
    "timestamp": 1756591200
  },
  {
    "username": "LiesingLions",
    "rating": 6.0,
    "comment": "e-raptor insert",
    "timestamp": 1755468000
  },
  {
    "username": "sykano",
    "rating": 5.8,
    "comment": "heavy worker placement game about water power in a dystopian world\n\ninteresting idea to simulate water power in a board game\nnice components (pieces of different shapes for different player colors)\ninteresting idea with the build wheel, but not sure if it's really a good mechanism\na bit too complex\ntoo mean ?\nvery expensive",
    "timestamp": 1753567200
  },
  {
    "username": "OMD56",
    "rating": 6.0,
    "comment": "Initial Score: 9\n\nSee my written review: https://www.boardgamequest.com/barrage-review/",
    "timestamp": 1752876000
  },
  {
    "username": "pumaman123",
    "rating": 6.0,
    "comment": "Takes too long for me",
    "timestamp": 1751061600
  },
  {
    "username": "H8Man",
    "rating": 6.0,
    "comment": "No idea where the hype train came from (before the shitstorm), but this isn't the greatest game of all time. It's a good game, like many many others.\n\nI like the puzzling aspect and the ways it offers. The diversity in the setup is great aswell (which abilities will you have next game?).\n\nOn the other hand, it's quite fiddly and somewhat chaotic (at least with 4). However, the worst thing is that the game is running very slow. Not the playing time, but the way you are building up. It's really slow to a point where I lost my interest. Also, you are pretty much doing the same stuff each and every round. I know, many games are like this, but not all of them got this feeling.",
    "timestamp": 1745186400
  },
  {
    "username": "Avid_Equinox",
    "rating": 6.0,
    "comment": "A very cutthroat eurogame\n\n+ Tight resources\n+ High level of player interaction (you can deny people very aggressively)\n\n- I personally find it a bit too involved to be something I'd actively seek out to play (Combining an already very complex eurogame with heavy, punishing player interaction makes for a lot of possibilities and is very unforgiving to new or infrequent players).",
    "timestamp": 1744668000
  },
  {
    "username": "darkfinale",
    "rating": 6.0,
    "comment": "end-November '23 Top 60 Games [#30/60]\n\nGreat tight worker placement game. Unique theme and great artwork and parts. Need to try with the expansion.\n\nLove the theme. Willing to play more often even if not good at the game.\n\nNeed more plays for a more in-depth review of game strategy. Thick and heavy.",
    "timestamp": 1744495200
  },
  {
    "username": "geekshah",
    "rating": 6.0,
    "comment": "Rating based on solo play.",
    "timestamp": 1744063200
  },
  {
    "username": "SteveTremendous",
    "rating": 6.0,
    "comment": "I drink your milkshake!\n\nI don't understand why this is not recommended for solo play by BGG. It has a well developed Automa system. Certainly, you have to spend some time on the Automa turn, so if that's a turn-off, fine... but I don't see how Scythe is recommended for solo and this one isn't.\n\nGame production was pretty bad for the price. That has made it get to the table less than I expected, and costs it a point.",
    "timestamp": 1743372000
  },
  {
    "username": "caroll_markus",
    "rating": 6.0,
    "comment": "Review from our familyofboardgames account on Instagram:\n=================\nBarrage… dam it!\nIn this intricate worker placement game, you fight with your fellow energy entrepreneurs for the best building spots for dams, conduits and powerhouses, and for precious Alpine waters. Barrage demands some very tough decision making with tormentingly little resources early on. You will use your workers to build structures, gain contracts, purchase upgrades, regulate water flows and – ultimately - produce energy.\nThere are some neat ideas to make this design stick out, such as the construction wheel, that binds your building resources for a certain time and then there’s the water flow mechanic. You need to optimize water use before it is lost, and are encouraged to divert water to your own advantage and render your opponents structures underused.\nThis recipe – heavy euro, novel ideas, variable player powers, and some of our most beloved euro designers – should have clicked for us, but it didn’t. The tight resources in combination with the meanness of stealing water sucked the joy out of playing it for us more peace- & coexistent-loving euro gamers.",
    "timestamp": 1743372000
  },
  {
    "username": "MrAlza",
    "rating": 6.0,
    "comment": "Doesn't scale well to 2 Players, might be better at more.",
    "timestamp": 1742943600
  },
  {
    "username": "AmongFriends",
    "rating": 6.0,
    "comment": "This was a huge teach. The game itself is quite brutal too so you're gonna get your ass kicked the first time. The second someone steals your water or builds a bigger dam than you, you'll feel the effects of it.\n\nIt's perhaps too brutal for me. I don't mind interaction in games but since the game is a fixed number of rounds, it feels quite bad to get something stolen from you and you have to take multiple turns to recover.\n\nI prefer if games have a mechanic that takes something away from you that you can recover relatively easily. Otherwise, it's absolutely disheartening.",
    "timestamp": 1742166000
  },
  {
    "username": "papergames",
    "rating": 6.0,
    "comment": "+ Nice theme and components\n+ Lots of rules, but easy to remember as they complement each other very nicely, the gameplay simply \"makes sense\"\n+ Lots of strategies, options, replayability, everytime we complete a session, people immediately want to play more\n- Not for everyone, there's a quite a bit of backstabbing happening\n- One wrong move could cost you the game at any point, the game is not forgiving at all",
    "timestamp": 1741474800
  },
  {
    "username": "Sussybakaowain",
    "rating": 6.0,
    "comment": "Random contracts and broken advanced tiles ruins it for me. Easily the worst euro in my collection.\nSell candidate.",
    "timestamp": 1741302000
  },
  {
    "username": "Epochend",
    "rating": 6.0,
    "comment": "Mean and meaty, but perhaps a little too much so. I have to be in a very particular kind of mood to want to play it; i.e. willing to strain my brain number-crunching and turn-mapping for several hours, while being equally willing to watch my hard work ruined by other players (and vice-versa). Still good, but it would be much easier to recommend if it was an hour shorter and slightly more streamlined.",
    "timestamp": 1740006000
  },
  {
    "username": "KvdBergh",
    "rating": 6.0,
    "comment": "Interesting action mechanism and a board state that takes a while to grasp. It's good, but not my favorite type of game.",
    "timestamp": 1739746800
  },
  {
    "username": "SgtTackleberry",
    "rating": 6.0,
    "comment": "Difficult to teach and dry to play. Mechanics are outstanding but can't find people to play with.",
    "timestamp": 1738623600
  },
  {
    "username": "staszek",
    "rating": 6.0,
    "comment": "KS",
    "timestamp": 1738191600
  },
  {
    "username": "Harmon758",
    "rating": 6.0,
    "comment": "https://boardgamearena.com/gamepanel?game=barrage",
    "timestamp": 1734822000
  },
  {
    "username": "iplaybgnaked",
    "rating": 6.0,
    "comment": "Fantastic worker placement engine builder with everything I enjoy about euros in it: fun combos, tight action economy, tense player interaction on both the map and worker placement spots, and a deep metagame leading to emergent gameplay. That said, it is somewhat linear in that building 4 structures every round is the best strategy but the journey to achieve that goal is interesting enough that I don't mind. Expansion is nice but not something I always play with.\nI've started to cool on this one because basic worker placement games just aren't my thing anymore.",
    "timestamp": 1732057200
  },
  {
    "username": "el_dani",
    "rating": 6.0,
    "comment": "There might be an intricate and interactive Eurogame. But some random distributed player advantages seems very strong or overpowered. In this kind of game I don‘t want the need for other players to topple the leading players (I prefer Cole Wehrle‘s games for this kind of interaction). There might be a great game behind this disparity but it appears too much of work to arrive there.",
    "timestamp": 1730588400
  },
  {
    "username": "Sack",
    "rating": 6.0,
    "comment": "Fantastic and unique theme, elegant and intuitive rules, highly interesting interaction.\n\nBut quite a few negatives:\n-needs more players, but LENGTH gets really annoying then\n-FIDDLY BOTS (which are rqd even for 2 or 3 players!)\n-the theme (water management and energy production) is secondary compared to all important construction and its UNTHEMATIC and stupid(!) bonus income when you want to play well\n-the Steam(?)punk/Tesla/Scythe-part of the theme is weak",
    "timestamp": 1729375200
  },
  {
    "username": "cromagz",
    "rating": 6.0,
    "comment": "I thought I absolutely loved this game on first play, but I think I've since come to realise that I just really rated the water movement and opportunities to snake that from other people. The rest of the game, especially early on just feels like too much of a grind\n\n(future plays have been on bga which I don't record)",
    "timestamp": 1727906400
  },
  {
    "username": "Stjackson",
    "rating": 6.0,
    "comment": "Rating based on one play, played wrong - not a good experience. Need to play again, but right.",
    "timestamp": 1727733600
  },
  {
    "username": "BankofDracula",
    "rating": 6.0,
    "comment": "A logistical puzzle without the safety bumpers, and perhaps for that reason it felt a little like a Splotter game albeit one with a few too many nodes (literally and figuratively), bonus points, etc.",
    "timestamp": 1725746400
  },
  {
    "username": "rjones53",
    "rating": 6.0,
    "comment": "After your first game I can see its appeal. Particularly mean game, especially to newbies. No catch up mechanism hurts this game as it's viscous.",
    "timestamp": 1723845600
  },
  {
    "username": "david1123",
    "rating": 6.0,
    "comment": "Rating based on single play, would like to play again as I suspect it deserves better rating...",
    "timestamp": 1720735200
  },
  {
    "username": "Khumbanigash",
    "rating": 6.0,
    "comment": "I can appreciate the game that is there. Getting a mix of high complexity euroness AND high interaction on a shared board kind of worked out just fine. But ultimately Barrage for me feels more like work than leisure time. Cannot really pinpoint what exactly turns me off, the calculations or the take that? It is okay for me to play from time to time (maybe once a year), but I would never actively suggest it...",
    "timestamp": 1717884000
  },
  {
    "username": "Toesstal_Spielt",
    "rating": 6.0,
    "comment": "It has a big disadvantage: If you make a mistake, the game can be lost for you.",
    "timestamp": 1717365600
  },
  {
    "username": "Samuel Vriezen",
    "rating": 5.5,
    "comment": "Two plays in, very mixed feelings. I seem to enjoy it more than I feel I should. The problem I sense is that there’s a really interesting game of tapping into each other’s power production engines, which might maybe have been a great game. But it’s dressed up in highly procedural euro optimization drudge and point salad nonsense, which does too much to attenuate the competitiveness and resource tightness. Am never too excited about worker placement in general either, it typically seems so forced and this game is definitely an example.\n\nStill, I’m enjoying the good bits so far and it has a pleasant meditative quality for me.\n\nBut I mean. Just imagine what, say, Splotter would have done with a theme like this…",
    "timestamp": 1717279200
  },
  {
    "username": "RalfMalf",
    "rating": 6.5,
    "comment": "Could easily be rated higher after more plays. Good decisions and interaction. First play can be tough to get a grip on. Downrated because I never get it to the table, mostly because of lack of interest.",
    "timestamp": 1762038000
  },
  {
    "username": "Butlersox20",
    "rating": 7.0,
    "comment": "Leeghwater Project,Nile Affair,Barrage Duel,Geological Factor,Colorado Connection,Executive Officer Promos A,B,C,D,E.",
    "timestamp": 1761692400
  },
  {
    "username": "Oppo28",
    "rating": 7.2,
    "comment": "Really superb game, one of my favorite worker placement games.\n\n(++) Awesome main board play. Cutthroat shared board, you are fighting over key areas and have ample opportunities to cut each other off. However, also have opportunities to work symbiotically with conduits and general dam placements behind others. Higher interaction for a euro, and I love it\n(+) Great worker placement implementation. Its simple, but effective. There are a nice range of actions and its hard to get fully locked out since you can pay cash for the 'extra' spots\n(+) Cool theme. Really nails the art deco-punk aesthetic and feel. Like a cyber or steampunk game, but set in 1920s\n(+) Fun and diverse special player powers, which are split between a leader power and a faction board power (slightly reminiscent of scythe's board combos)\n(+) Novel construction wheel mechanism, which serves as a cooldown for both resources and construction schematics. Feels more thematic-- it takes time for your workers to go build stuff, but its not like they get 'spent' (save that one for The Cost)\n(+) Love the tech upgrades, which give more construction capacity and fun unique abilities\n(+) Great setup variation between round scoring, end game scoring, tech tiles, and special power combinations\n\n(=) Extremely difficult decisions to make; brain burny. This can be rewarding but also leads to a lot of thinking. Definitely not a relaxing game\n(=) Contracts are a main scoring mechanism. I don't typically love contracts, but coding as neutral since that's a preference (plus, they are more straightforward here since its more about thresholds than arbitrary mix of diverse goods)\n\n(-) Lot of components and setup. This is a long, deep game. Needs several hours to finish end to end\n(-) Reverse of the board should have had a separate map layout\n(-) Too few single grey resource components, we had to do stand ins and weird change-making situations\n\nLet me be clear that these negatives are minor. The game truly has few flaws, and works on almost all levels of what its trying to do. I suppose the box is a bit large?",
    "timestamp": 1759269600
  },
  {
    "username": "Dunklezahn",
    "rating": 7.0,
    "comment": "DTW 20D/43D",
    "timestamp": 1758492000
  },
  {
    "username": "The CEE",
    "rating": 7.0,
    "comment": "Expansions:\nThe Leeghwater Project",
    "timestamp": 1757887200
  },
  {
    "username": "Mightyted",
    "rating": 7.0,
    "comment": "A lot of work to wrap your head around the rules and possible strategies. Great game design, but just because you can doesn't always mean you should.\n\nSold after 5 plays.",
    "timestamp": 1756936800
  },
  {
    "username": "themikeman",
    "rating": 7.0,
    "comment": "BGA: Very interesting system full of interaction. It is a shame that the action selection half of this game is tied to worker placement. However, the systems are intricate and nuanced and there always seems like a path is available to progress your game state. Despite the weight, I feel able to understand the strategy here a lot better than GWT for example. IRL concerns include massive box size, hard teach, and sprawling components and game board.",
    "timestamp": 1756072800
  },
  {
    "username": "Zouzou825",
    "rating": 7.0,
    "comment": "Conceptually, it's a really good game. But for two player, it's pretty bad, since everyone rush to the lower level.",
    "timestamp": 1755813600
  },
  {
    "username": "stude",
    "rating": 7.0,
    "comment": "Beautiful design. Quality components. Well-written rulebook. But an experience where complexity has been the king. I guess it would be possible to get it tamed in a dozen games but until then, checking the rulebook for the meaning of each contract, technology and objective tile. I like to play alone as well so it's great there's an automa but with a thick rulebook of its own. Would like to love this game but can't.",
    "timestamp": 1755295200
  },
  {
    "username": "Lemem",
    "rating": 7.0,
    "comment": "The building of infrastructure and water management are simply fantastic, allowing players to interact with one another as they vie for control. The worker placement is tight, albeit a bit daunting initially, and the replayability is there with the various asymmetric powers, scoring conditions, and map layouts to warrant hitting the table repeatedly.",
    "timestamp": 1755036000
  },
  {
    "username": "Steezish",
    "rating": 7.0,
    "comment": "6/13/25: Played on BGA. An interesting cutthroat euro puzzle. There is ALOT to think about, almost too much. I think I would like this game more in person so there can be more communication about the interactions that happen on the board.",
    "timestamp": 1755036000
  },
  {
    "username": "SynapticAcid",
    "rating": 7.0,
    "comment": "Signed by Simone Luciani (Board)",
    "timestamp": 1754344800
  },
  {
    "username": "paulastoria",
    "rating": 7.0,
    "comment": "Ok",
    "timestamp": 1753912800
  },
  {
    "username": "punyalebah",
    "rating": 7.0,
    "comment": "Love the mechanics and theme, but feels overly punishing. Need to play more",
    "timestamp": 1752444000
  },
  {
    "username": "selvalabelva",
    "rating": 7.0,
    "comment": "Brainburn         Longevity    \nLuck impact       Rules/Setup  \nInteraction       Involvement  \n\nAftertaste           Enthusiasm   \n\n Best at 3/4 player count\n Rating inclusive of expansions gameplay\n Leeghwater Project for best experience\n Replayability further improved with additional maps\n Confrontation: indirect\n\n Bad initial draft can sour whole play\n Faction bonuses not equal in powerlevel\n Balance concerns with contracts/technologies",
    "timestamp": 1751320800
  },
  {
    "username": "petroleumjelly",
    "rating": 6.5,
    "comment": "Brutal, cutthroat game. Nevertheless, something about it tickles my brain! Very willing to play more, so long as I'm in the right mood.",
    "timestamp": 1750802400
  },
  {
    "username": "TheTomTraveller",
    "rating": 7.0,
    "comment": "Includes:\n5 player Expansion\n\nAwaiting waffle to ship",
    "timestamp": 1747260000
  },
  {
    "username": "smurfodeth",
    "rating": 7.5,
    "comment": "Tight, punishing, difficult to play well, with significant player interaction (especially for a modern efficiency euro), without an overload of rules (when compared to other euro designs of a similar vintage). Despite the setting, it's more a game of developing infrastructure (and unlocking the attendant bonuses on your personal player board) than it is about generating power through harnessing water. I'm not the biggest fan of random contract fulfillment or the outsized importance of unlocking your personal player board bonuses, either, but this game is still pretty good when compared to its contemporaries.",
    "timestamp": 1762297200
  },
  {
    "username": "Imsevimse",
    "rating": 8.0,
    "comment": "Incredibly crunchy game with two standout features: the flowing water mechanic, which fuels tense player interaction, and the construction wheel, a timing-driven layer that’s rewarding to plan around. Heavy, strategic, and fiercely competitive for a euro-style game—a superb design.",
    "timestamp": 1761343200
  },
  {
    "username": "ImZhe",
    "rating": 7.8,
    "comment": "Needs more plays",
    "timestamp": 1761343200
  },
  {
    "username": "JM_arsal",
    "rating": 8.0,
    "comment": "Every action matters, and every mistake has a cost. Time management through the wheel is brilliant: it turns resources into tense, postponed decisions. Interaction is constant, direct, and punishes those who don’t plan long-term. It scales poorly: with fewer than 4 players, it loses tension. The solo mode is unnecessarily tedious. There’s no room for improvisation—only for raw optimization and pure calculation.",
    "timestamp": 1761084000
  },
  {
    "username": "fazermozg",
    "rating": 8.0,
    "comment": "+",
    "timestamp": 1760652000
  },
  {
    "username": "alcofa",
    "rating": 8.0,
    "comment": "Great game with tons of options to do. Very immersive and thematic. Heavy Gamers Game.",
    "timestamp": 1760565600
  },
  {
    "username": "Vevi",
    "rating": 8.0,
    "comment": "20000",
    "timestamp": 1760392800
  },
  {
    "username": "aliakel",
    "rating": 8.0,
    "comment": "@\n\nAmazing gameplay that blends action selection, worker placement and resource management marvellously\nIf it were not for the disappointment with Cranio’s KS campaign, crappy production choices and questionable component designs (microscopic space invaders, joke waterdrops, flimsy production wheel), this game could have gotten a solid 9",
    "timestamp": 1760220000
  },
  {
    "username": "yroeht",
    "rating": 8.0,
    "comment": "The whole worker placement core is quite standard, in a good way, but the flow of water along the rivers or diverted by conduits is great. I love that you can use other people's conduits, that you use their discarded water, build upstream to deny them water... Very interactive map.",
    "timestamp": 1759010400
  },
  {
    "username": "ameto",
    "rating": 8.0,
    "comment": "Includes the Leeghwater Project expansion",
    "timestamp": 1758146400
  },
  {
    "username": "TowersAlez",
    "rating": 8.0,
    "comment": "Casa",
    "timestamp": 1758060000
  },
  {
    "username": "Danielka7",
    "rating": 8.0,
    "comment": "Very elegant strategy game with little randomness and a ton of interaction. Easy to learn, hard to master.\n+ simple rules\n+ no cards\n+ asymmetrical player powers",
    "timestamp": 1757973600
  },
  {
    "username": "SteffenBarth",
    "rating": 8.0,
    "comment": "Interesting and mean",
    "timestamp": 1756504800
  },
  {
    "username": "AMERICANBOYBAND",
    "rating": 8.0,
    "comment": "Comments\nVery interesting, want to try at 4P",
    "timestamp": 1756504800
  },
  {
    "username": "dancing rob",
    "rating": 8.0,
    "comment": "Only one play, but it felt like one of those games needed a few more playtests to remove all the stuff that added complexity for the sake of complexity.\n\nIn particular, things like variable player powers, and the board to buy advanced ways of building felt like the sort of things that could have been added in an expansion for people who have already played the base game to death rather than as standard. All just a bit fiddly really.\n\nThe three different worker types were probably the most interesting aspect of the game, and (production values aside) I enjoyed the wheel mechanic, which added time considerations to normal worker placement.\n\nSecond play 5 years later\n\nEnjoyed it far more this time round, not least because a load of expansion stuff I remembered from first time around was left out. Far more interactive than I'd remembered, with lots of competition for decent spots on the board. Very keen to try it again at some point.",
    "timestamp": 1756418400
  },
  {
    "username": "onesones",
    "rating": 8.0,
    "comment": "扩太多，不好开",
    "timestamp": 1755727200
  },
  {
    "username": "Chrysler92",
    "rating": 8.2,
    "comment": "41,94€",
    "timestamp": 1755381600
  },
  {
    "username": "RainCar",
    "rating": 9.0,
    "comment": "The best game for beating unexperinced players.",
    "timestamp": 1762690500
  },
  {
    "username": "blake33",
    "rating": 9.0,
    "comment": "Such a great game",
    "timestamp": 1762673640
  },
  {
    "username": "CotB",
    "rating": 9.0,
    "comment": "Awards\nAdvanced Game of the Year 2021\nBest Game of the Year 2021\n\nRankings\n3rd Best Game 2021\n3rd Best Game 2022\n10th Best Game 2023\n5th Best Game 2024\n21st Best Game 2025",
    "timestamp": 1762606740
  },
  {
    "username": "silenceisgolder",
    "rating": 9.0,
    "comment": "I'm a little bit less enamored with it than when I first played. I think it's still my favorite new-school euro (worker Placement, contract fulfillment, icons everywhere, etc) but it feels like it's straddling the gap between the tension of truly great economic games like Brass and the smooth play of great new-school euros. So ... as someone who doesn't like new-school euros, it's nice to have as a change of pace, but I'm not sure it can be more than that. It doesn't seem to work as a common ground game either, since the new-school euro people I've played with bounced off it hard.",
    "timestamp": 1762470000
  },
  {
    "username": "SJHong",
    "rating": 8.8,
    "comment": "Simone is a genius",
    "timestamp": 1762124400
  },
  {
    "username": "Kaventsmann",
    "rating": 9.3,
    "comment": "Folded Space",
    "timestamp": 1762124400
  },
  {
    "username": "sorcretic",
    "rating": 9.0,
    "comment": "Feb. 2025 #22: My highest ranked Simone Luciani game (more to come), Barrage takes an interactive spatial puzzle and wraps a tight, fighty Euro around it, so it's no mystery why I love this game. Worker placement works well for me when there are seven things you want to do, you can only do three, and you're just hoping that no one jumps your spots. Barrage excels at this, and combines it with the competition for dam placements and water drops. As modern Euros go, Barrage is one of the best.\n\nJul. 2024 #17\n\nJan. 2024 #11: Barrage is my highest-ranked \"modern\" Euro and my favorite Simone Luciani game. It combines a really tight worker-placement engine-building game with brutal board competition over building spots and water drops. That's the kind of modern Euro that I can love.",
    "timestamp": 1761606000
  },
  {
    "username": "WhiteNinja80",
    "rating": 9.0,
    "comment": "8.5 for the 1st game. Barrage has the potential of a higher rating after more plays",
    "timestamp": 1761429600
  },
  {
    "username": "burgundy90",
    "rating": 8.5,
    "comment": "Despite being completely destroyed the first game, this game grows on me with each play. The teach should include the specific callouts on how not to completely get your construction stolen from you.\n\nRequires an understanding of the map and water flow, resulting in very strategic moves. Combined with the huge levels of interaction, forces you to react and change plans in ways not commonly seen in other games. Food Chain Magnate is the closest comparison in the level of interaction and strategy, but having completely different mechanisms.",
    "timestamp": 1761256800
  },
  {
    "username": "Seb399",
    "rating": 8.9,
    "comment": "Le meilleur jeu expert à mon sens, certains lui reprocheront d'être assez punitif mais, l'interaction est justement au cœur de ce jeu fantastique avec une thématique parfaite qui donne sens au mécaniques du jeu. Un bijou ludique hautement recommendable",
    "timestamp": 1760738400
  },
  {
    "username": "Strandpapucs1",
    "rating": 9.0,
    "comment": "20 000 HUF",
    "timestamp": 1760652000
  },
  {
    "username": "Droooop",
    "rating": 9.0,
    "comment": "What the hell are these excavators and mixers? Is it a joke or something? Looks more like chickens...",
    "timestamp": 1759788000
  },
  {
    "username": "DarkJjay",
    "rating": 9.0,
    "comment": "Stored in Folded Space insert",
    "timestamp": 1759788000
  },
  {
    "username": "Stingart",
    "rating": 9.0,
    "comment": "What a tense euro! A lot of negative interactions!",
    "timestamp": 1759615200
  },
  {
    "username": "thefatcyclist",
    "rating": 9.0,
    "comment": "***III-2",
    "timestamp": 1759010400
  },
  {
    "username": "gianlucadario87",
    "rating": 9.0,
    "comment": "B_F2",
    "timestamp": 1758751200
  },
  {
    "username": "Cobra262",
    "rating": 9.2,
    "comment": "Very good economic euro that can be very unforgiving, but that's why I like it so much. I Very cutthroat at 3-4 players and more open and less interactive at two players.\nFeels a bit different beween 2 and 4 players but I would recommend it at all player counts.\nThe component quality could be better.",
    "timestamp": 1758751200
  },
  {
    "username": "Auroric",
    "rating": 9.5,
    "comment": "Wow this one is a beast. Incredibly deep, highly interactive Euro with a cornucopia of ways to approach it.\n\nI love this for the same reason I love brass. Having an economic game with a huge amount of interaction and shared infrastructure means it's much more than just an efficiency puzzle. The build wheel and water overflow mechanics are super unique, and it comes together with the worker placement in a very satisfying way. Faction/leader powers and asymmetric player boards are great, and I love that the setup is so variable. There's many different strategies to go for, and it's a joy to explore all these different approaches. Being able to supply conduits to your opponents adds a layer that I really dig. This game is also mean, but not in a way that can't be overcome. Blocking is plentiful, meaning players need to prioritize, and will never get to execute their plans fully in the way they would like to. I see a pretty infinite skill ceiling with this one, and I'd love to watch more high level games of it. WSBG hopefully?\n\nI will say tho, I find the presentation pretty lacklustre. The art style and iconography is just not my thing. It's also nowhere near an approachable game: it's very easy to do terribly, and it takes some time to come to grips with what good play even looks like. That combined with the looks makes it very unlikely I could get this to the table enough to justify owning it. I also wish the factions were a little more balanced, but the auction system makes that a non-issue. It's a little surprising that power generation often takes a back seat to building. This isn't a huge deal, but makes the strategy even more inscrutable to new players.\n\nIt's a fantastic heavy Euro though. One of the best.",
    "timestamp": 1761778800
  },
  {
    "username": "apax",
    "rating": 10.0,
    "comment": "H",
    "timestamp": 1761519600
  },
  {
    "username": "norsedog",
    "rating": 10.0,
    "comment": "I love the game on BGA, but dinged it slightly as a physical game after purchasing a pricey copy.\n\nThe component quality left a lot to be desired - print issues in the rule book, think cardboard with hard to punch out components causing tears and extremely fiddly little parts for the excavators and mixers.\n\nThe second criticism is that a lot of the game state is poorly reflected in the design - bonuses acrue all over the various boards, it would have helped to have a tracking player mat, or, better yet, no random \"you just vacated this space\" style bonuses.\n\nUpdate: after a few physical plays, I had to upgrade the rating. The random bonus distribution on boards and executive officers is actually not detrimental, and I'll have to spend some time exploring why.\n\nThat game hits my preferences (tight, high interaction, lots of theme and emotion) too well to give it less than a 10, as much as the production quality doesn't measure up in part.",
    "timestamp": 1760911200
  },
  {
    "username": "rafaelpaz",
    "rating": 10.0,
    "comment": "High-level Euro, innovative mechanics, and a very interesting theme. Interaction is top-notch.\nOne of those games where you're completely lost in the first game, unable to do anything, punished mercilessly... but still, you enjoy the game's unique genius.\nI intend to play much more to understand the strategies, which are difficult to master.",
    "timestamp": 1760911200
  },
  {
    "username": "louisj2016",
    "rating": 9.5,
    "comment": "Expert+++",
    "timestamp": 1760824800
  },
  {
    "username": "Falkar",
    "rating": 10.0,
    "comment": "I absolutely love this game. It's got that perfect mix of a tight economy, difficult decisions, tension and pay off when you get it right. It's not L and A's favourite, so I may have to explore the solo mode. Would love to play this game more often.",
    "timestamp": 1760133600
  },
  {
    "username": "skent22",
    "rating": 10.0,
    "comment": "box insert",
    "timestamp": 1759960800
  },
  {
    "username": "Milpus",
    "rating": 10.0,
    "comment": "This game is brutal. Fantastic game design and iconography. Graphic design needs a refresh.",
    "timestamp": 1759701600
  },
  {
    "username": "Dkarpoj",
    "rating": 10.0,
    "comment": "Slightly painful and very punishing for mistakes or great plays from others. Not for the feint of heart…. But the game is amongst the greatest economic euros around. Sublimely interactive with tons of strategic and tactical depth. In the same league as brass, and the great Zimbabwe. Those are the three best economic euros I’ve ever played.\n\nThe additional duel map and board are great for 2p. Much better than I expected. Main board is stellar 3-4p. Need to get Colorado map\nTo the table soon.\n\nKS with 3d board and light-water expansion. Gifted from Steve. Awesome\n\nBacked final campaign - piggyback from Tomer for golem expansion. Dan?",
    "timestamp": 1759528800
  },
  {
    "username": "phunter",
    "rating": 10.0,
    "comment": "+metal coins\n+EO A & B",
    "timestamp": 1759183200
  },
  {
    "username": "Anicka",
    "rating": 10.0,
    "comment": "Metal coins, dual layered board extensions",
    "timestamp": 1758664800
  },
  {
    "username": "Lecaro",
    "rating": 10.0,
    "comment": "Kurzrezension:\nDie Bewohner der einstmals so friedlichen und ruhigen Region schauen heutzutage schon gar nicht mehr auf, wenn Bauarbeiter, schwere Maschinen und tonnenweise Zement den Berg hinauf transportiert werden. Das Ziel des Trosses ist die Großbaustelle hoch oben im Gebirge. Dort, wo der Fluss aus dem Bergsee fließt.\nRiesige Staudämme und Wasserkraftwerke entstehen. Mit ihrer Hilfe soll die benötigte Energie gewonnen werden, die die Welt so dringend braucht.\nIn \"Barrage\" stellen die Spieler Energiekonzerne dar, die auf einem Berghang Gebirgsflüsse aufstauen und Kraftwerke errichten. Sie versuchen so Runde, um Runde elektrischen Strom zu generieren und damit Siegpunkte zu gewinnen.\n\nSpielablauf:\nDie beiden hauptsächlichen Mechanismen des Spiels sind der 'Arbeiter-Einsatz' und das durchaus innovative 'Bau-Rondell', das ohne tatsächliche Kosten an Ressourcen auskommt.\nJeder Spieler erhält zu Spielbeginn insgesamt zwölf Arbeiter, die während des Spiels nicht aufgestockt werden können. Die Aktionen auf dem Spielplan kosten unterschiedlich viele Arbeiter, sodass es durchaus öfter vorkommt, dass manche Spieler mehr Aktionen pro Runde durchführen, als andere.\nDie Standardaktionen des Spielplans stehen allen Spielern zur Verfügung. Von Arbeitern besetzt, sind sie für die restliche Runde gesperrt. Für jede Aktion gibt es mehrere mögliche Felder. Die Kosten und Ausbeute dieser Felder sind dabei sehr unterschiedlich.\nSo produzieren die Spieler mithilfe des angestauten Wassers Energie, erfüllen ihre Aufträge und erhalten dafür unter anderem Siegpunkte.\nWeitere Aktionen sind das Nehmen neuer Aufträge, das Erwerben neuer Baumaschinen und das Weiterdrehen des eigenen Produktionsrades.\nDie Aktion zum Bauen neuer Dämme, Kraftwerke und Rohrwerke finden die Spieler auf ihren persönlichen Tableaus. Auch hierfür müssen Arbeiter platziert werden.\nDas Errichten neuer Gebäude kostet in \"Barrage\" keine Ressourcen. Stattdessen werden Maschinen-Marker, sowie das entsprechende Produktionsplättchen des Bauwerks in ein Bau-Rondell gesetzt. Mit jeder weiteren Bau- oder Dreh-Aktion wird dieses Rad um eine Speiche weitergedreht. Erreicht das Produktionsplättchen wieder den Startpunkt, erhält der Spieler die eingesetzten Maschinen, sowie das Plättchen zurück und kann sie für weitere Bauvorhaben wiedereinsetzen.\nSobald alle Arbeiter eingesetzt sind, endet die Runde und die Spieler erhalten Siegpunkte für das aktuell gültige Rundenbonusplättchen sowie für ihre Energieproduktion der Runde. Außerdem wird frisches Wasser auf die fünf Gletscher des Spielplans verteilt, welches direkt den Berg hinabfließt.\nNach nur fünf Runden ist das Spiel vorbei und es folgt eine Schlusswertung.\n\nErweiterungen:\nIm Grundspiel ist bereits das \"Patentamt\" als Minierweiterung enthalten, die das Spiel vervollständigt und es durchaus anspruchsvoller macht. Im Einführungsspiel erhalten alle Spieler ein ?-Bau-Plättchen. Mit diesem kann eine beliebige Bauaktion durchgeführt werden. Im vollständigen Spiel muss ein solches Plättchen erst erworben werden. Bis dahin ist das Errichten von gleichartigen Gebäuden entsprechend erschwert.\nDie Solovariante funktioniert nach einem Plättchen gesteuerten Automa-Prinzip, das bereits in viele neuere Eurogames Einzug gehalten hat.\nFür mich ist das Patentamt ein Grundbestandteil und sollte in jeder Partie verwendet werden. Die Solovariante habe ich nicht ausprobiert und hätte meinetwegen auch weggelassen werden können! Das hätte auch Platz im Karton gespart.\n\nNeben dem Grundspiel wurde in der Kickstarter-Kampagne direkt die erste Erweiterung \"The Leeghwater Project\" angeboten. Sie besteht im Grunde aus zwei weiteren Modulen, die einzeln oder zusammen hinzugenommen werden können.\nDie 'Privaten Gebäude' sind ein neuer Gebäudetyp, die beim Errichten zusätzliche Aktionsfelder für die Spieler freischalten.\nAuf den Aktionsfeldern der 'externen Arbeitskräfte' können Maschinen gegen einmalige, aber mächtige Sonderzahlungen verkaufen werden.\nDie Erweiterung sorgt dafür, dass mit den erworbenen Maschinen gegen Ende der Partie noch wertvolle Aktionen genutzt werden können und sie nicht ungenutzt für die Endwertung im Lager vergammeln. Ich finde die Erweiterung sehr gut, da sie das Grundspiel nicht mit allzu vielen Regeln aufbläst, den Spielern aber durchaus mehr Optionen bietet.\n\nIn der \"5-Spieler\"-Erweiterung ist eine neue Karte enthalten, die an die des Grundspiels angelehnt ist, aber einen weiteren Fluss bietet, an denen die Spieler Bauwerke errichten können. Die Karte kann auch mit weniger Spielern bespielt werden und bietet ihnen damit mehr Platz, um sich zu entfalten.\nIch konnte die \"5-Spieler\"-Erweiterung noch nicht spielen, stelle mir die Downtime in Vollbesetzung aber verheerend vor, wenn alle über ihre Züge nachdenken.\n\nDie Erweiterung \"The Nile Affair\" ersetzt den Spielplan aus dem Grundspiel mit der vom Nil durchzogenen afrikanischen Wüste. Neben einem etwas anderen Flussverlauf und wesentlich mehr Wasser, welches den Berg hinunterfließt, kommen vor allem neue Plättchen ins Spiel, die über ein Aktionsfeld beansprucht werden können, zu dem allerdings nur diejenigen Spieler Zugriff haben, die direkt daneben einen Damm errichteten.\nZusätzlich gibt es ein neues Spielende-Plättchen und Aufträge, die sich auf die neuen Bonnies beziehen.\nDie Erweiterung ändert im Grunde nicht viel am bereits sehr guten \"Barrage\"-Grundspiel. Für mich sind vor allem die neuen Aktionsfelder, die sich direkt auf der Karte befinden, eher unübersichtlich und werden von mir oft übersehen. Die große Menge an Wasser, die das Spielfeld geradezu überflutet, finde ich allerdings sehr gut.\n\nDie Erweiterung \"The Colorado Connection\" ist in den USA angesiedelt. Dort werden Dämme gleichzeitig als Brücken genutzt, welche durch zusätzliche Aktionsfelder auf dem Spielplan errichtet werden können. Ist eine solche Brücke aber erst einmal errichtet, kann der zugrunde liegende Damm nicht mehr weiter erhöht werden. Weitere Aktionsfelder auf dem Spielbrett erlauben zusätzliche und teils sehr starke Aktionen. Die Kosten dieser Felder hängen mit den errichteten Brücken im Gebiet ab. Je nachdem, wer eine Brücke auf dem Pfad errichtet hat, partizipiert an diesen Kosten.\nWie schon in der letzten Erweiterung fördern die zusätzlichen Aktionsfelder auf dem Spielplan nicht die Übersichtlichkeit.\nIch finde die Idee der Brücken sehr gut, da diese den Spielern günstige Aktionen verschaffen, im Gegenzug aber den Weiterbau ihrer Dämme verhindern. Die zusätzlichen Aktionen sind für meinen Geschmack absolut schlecht integriert. Zum einen verschwinden sie im Artwork der Karte, zum anderen sind die Kosten nicht direkt ablesbar und müssen auswendig gelernt werden. Für mich ist \"The Colorado Connection\" die schlechteste der bisher erschienenen Erweiterungen.\n\nDie neue \"Duel\" Karte ist der kleine Bruder der \"5-Spieler\"-Karte und bietet entsprechend weniger Platz, um Bauwerke zu errichten. Sie ist - wie der Name vermuten lässt - für zwei Spieler zugeschnitten und fördert damit den regen Austausch des Wasser-Abgrabens der beiden Konkurrenten.\nNeben der neuen Karte bietet diese Erweiterung ein Duell-Plan, auf dem die beiden Kontrahenten drei Marker hin und her schieben, je nachdem wie gut sie eine vorgegebene Aktion in jeder Runde verfolgen. Am Ende gibt es zusätzliche Punkte. Bereits in einer Runde können über dieses Board lukrative Bonnies freigeschaltet werden.\nIch mag die Duell Karte sehr, ebenso wie das Duell Board, die beide unabhängig voneinander oder zusammen ins Spiel genommen werden können.\n\nDie Minierweiterung \"The Geological Factor\" kann für alle bisher erschienenen Karten verwendet werden. Zu Spielbeginn werden lediglich alle enthaltenen See-Plättchen gemischt und auf jeden See auf der Karte eines aufgedeckt gelegt.\nDie Plättchen ändern die Kosten von bestimmten Bauwerken in den Tälern, verbessern im Gegenzug aber deren Ertrag.\nIch mag diese kleine Erweiterung wirklich sehr. Sie ist für Spieler gedacht, die das Grundspiel schon einige Male gespielt haben und sich Abwechslung wünschen. Die Plättchen verändern die Regionen so stark, dass ganz neue Strategien entwickelt werden müssen.\nIch bin allerdings noch bei einer relativ geringen Anzahl Partien, sodass ich die zufällig generierten Sweetspots auf der Karte gar nicht erkenne. Außerdem hatte ich das Problem, dass ich oftmals die zusätzlichen Kosten oder Benefits der Plättchen übersehen habe und all meine Pläne im letzten Moment über den Haufen werfen musste.\nDennoch gefällt mir diese Erweiterung sehr gut und möchte sie noch häufiger spielen.\n\nMeinung:\n\"Barrage\" ist eines meiner komplexeren Spiele im Schrank. Die Spielanleitung ist entsprechend lang, die Regeln aber gut strukturiert und logisch aufgebaut. Das Spiel bleibt dabei völlig seinem Thema treu.\nDieses stützt die verwendeten Mechanismen sehr gut, wenn Wasser von den Gletschern herunter ins Tal fließt, dazwischen von Dämmen aufgestaut und von dort über Rohre durch Kraftwerke geleitet wird. Ist das Wasser im Tal angekommen, kann daraus keine Energie mehr gewonnen werden, sodass auf neues Schmelzwasser des Gletschers gewartet werden muss.\nDabei ist das Spiel sehr interaktiv. Allein der Arbeiter-Einsatz Mechanismus bringt Konflikte auf den Spieltisch. Zusätzliche Begehrlichkeiten schafft das Wasser, das jeder Spieler unter seine Kontrolle bringen möchte. Durch geschicktes Umleiten bei der Produktion sollte es im besten Fall wieder in den eigenen Dämmen ankommen und so den Gegnern vorenthalten werden.\nIn Vollbesetzung sind sowohl die Aktionsfelder, als auch die Bauplätze auf dem Spielplan schnell vergriffen. Zu dritt und zu zweit werden bestimmte Aktionsfelder gestrichen und es herrscht dort ein ähnlicher Mangel wie im Spiel zu viert. Auf den Baufeldern des Spielbretts haben kleinere Runden aber deutlich mehr Platz, sich auszubreiten.\nDie Variabilität der Rundenbonusplättchen, der Spielendeplättchen sowie das Material der Erweiterungen erhöht den Widerspielwert, der bereits im Grundspiel hoch anzusehen ist. Der generelle Mangel an allem reicht gerade so aus, um etwas auf die Beine zu stellen, bevor das Spiel endet. Geschenkt bekommt in \"Barrage\" garantiert niemand etwas!\nMir macht das Spiel wahnsinnig viel Spaß und empfinde es als absolut thematisch. Die Regeln des Spiels kann ich mir gut merken und anderen Spielern vergleichsweise schnell beibringen. Das Spiel ist aber kein Leichtgewicht, daher kann ich es Familien- und Gelegenheitsspielern nicht weiterempfehlen. Fehler im Spiel werden hart bestraft und bei Spielende kann durchaus ein großer Abstand zwischen dem Führenden und der Nachhut liegen. Wer davon nicht abgeschreckt ist, sollte durchaus eine Partie wagen.\nBedauerlicherweise waren die Bau-Rondelle in der ersten Auflage teilweise nicht ganz mittig gelocht und lagen bereits von Anfang an verbogen in der Spielschachtel. Dadurch blieb die drehbare Speiche am Rand des Rondells hängen und die eingelegten Plättchen und Maschinen konnten sich darunter verklemmen.\nAbgesehen davon ist das Spielmaterial absolut hochwertig. Die Spielmarker sind aus Holz und für jede Spielerfarbe individuell gestaltet. Sehr schade war auch die knappe Menge an 1er-Werten beider Maschinentypen. In Vollbesetzung mussten die Spieler ihre 3er und 5er-Marker ständig mit der allgemeinen Auslage wechseln, um die passende Anzahl in ihr Rondell legen zu können.\nDie Anleitung ist gut strukturiert und aufkommende Regelfragen sind schnell gefunden und nachgelesen, dafür sucht man ein Inlay in der Spielschachtel vergebens.\nMittlerweile wurden die Baurondelle neu überarbeitet, sodass sich nun keine Baumaschinen mehr verklemmen können. Auch die 1-er Baumaschinen hat der Verlag bereits zum Nachkaufen angeboten, um auch dieses Problem aus der Welt zu schaffen. Diese gehören meiner Meinung nach zwar im vorherein in die Spielschachtel und sollten nicht nachgekauft werden müssen, aber immerhin gibt es jetzt die Möglichkeit dazu aufzustocken.\nIn den Bewertungen auf BoardGameGeek.com gehen die Meinungen über das Spiel vermeintlich sehr weit auseinander.\nIhr solltet euch dadurch aber nicht täuschen lassen! Denn die Kommentare der 1-Stern-Bewertungen zielen oftmals auf die schief gelaufene Kickstarter Kampagne und nicht auf das Spiel selbst ab. Viele BGG-User schreiben, dass sie dem Spiel selbst eine sehr hohe Note geben würden, aber aufgrund der Kampagne verärgert sind und so dem Verlag 'schaden' wollen.\n'Cranio Creations' hat den Backern bereits neu designte Rondelle, Wasser- und zusätzliche Baumaschinen-Marker versprochen und geliefert. So kann ich auch dem Material keine negativen Punkte mehr geben und das Spiel hat bei mir die höchste Note verdient, die ich vergeben kann.",
    "timestamp": 1758060000
  },
  {
    "username": "Nightyblade",
    "rating": 9.5,
    "comment": "I love the interactivity of this game. 8/10.\nIt's very hard, and you are interested in every turn of each player.\nAnd this is what I like when playing a game. I want fast paste and interesting interactions between all.",
    "timestamp": 1757887200
  },
  {
    "username": "CaptVietnam",
    "rating": 10.0,
    "comment": "Das Spiel ist SUPER fertig...",
    "timestamp": 1756332000
  },
  {
    "username": "Zakharro",
    "rating": 10.0,
    "comment": "Плотина\n5 игроков\nдуэльный режим\nсоло режим\n+ цифровая версия",
    "timestamp": 1755986400
  },
  {
    "username": "espoon82",
    "rating": 9.7,
    "comment": "I knew I would like this game, but I did not realize how much. It's amazing--so smart and complex. I am still laughing a little at myself, though, because when I first read about it, I thought, \"Building dams and power plants? Boring. Hard pass.\" Then I saw that it was set in a dystopian 1930s universe with robots, and suddenly I am all like, \"Shut up and take my money!!!\" But the game really *is* pretty much just building dams and power plants! But it's the best game about building dams that I have ever played. :-D",
    "timestamp": 1755813600
  },
  {
    "username": "Jepeme",
    "rating": 10.0,
    "comment": "Honestly barrage has everything i expect from a board game: low rng, intuitive strategy, interaction and low AP chances.\n\nThis is the best board game i have ever played",
    "timestamp": 1755468000
  }
]