[
  {
    "username": "sunyushen",
    "rating": 1.0,
    "comment": "first turn, 2 players got a blue 2 into the bag from the event by pure luck. They ended up first 2 places. What's the point of all the effort???",
    "timestamp": 1756764000
  },
  {
    "username": "KingAwesomeBGG",
    "rating": 1.0,
    "comment": "Played it TTS",
    "timestamp": 1754776800
  },
  {
    "username": "vic_reeves",
    "rating": 1.0,
    "comment": "Massive graphical downgrade",
    "timestamp": 1754172000
  },
  {
    "username": "MatthiasScott",
    "rating": 1.0,
    "comment": "Quacks of Quedlinberg is fantastically fun. It boasts great overall mechanics, a whimsical theme and beautiful Euro-style art\n\nQuacks however, is an absolute abomination of \"dumbed down for Americans.\" The publisher tried to fix what wasn't broken and we got a game with AI created, \"straight to Netflix kid's movie\" artwork and a redundant name change. Don't spend your money on this watered down, gas station sushi quality garbage",
    "timestamp": 1743202800
  },
  {
    "username": "RespyII",
    "rating": 1.0,
    "comment": "Sleeved 56x87\n\nNeeds insert\nNeeds protective/upgraded tokens\n\nNew Rating which suits the art and all the changes.",
    "timestamp": 1743030000
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "It's not all bad at first, but I notice that once players get a little experience, they just completely ignore each other. With the rat-tails as a catch-up device, there’s honestly zero bad moves, so no wonder you don’t need to watch opponents. So it’s secretly not driven by luck, and it comes down to who bought the best ingredients…. it’s a deck-builder! But you don’t thin your deck or manage it, so there’s even less skill (and theme) than Dominion.\n\nAlso not a single duck in here.",
    "timestamp": 1740265200
  },
  {
    "username": "alpinlapin",
    "rating": 1.0,
    "comment": "I hate this piece of crap luck fest. There has been nothing that has ever made this fun for me. Even when I win, I feel like I lost. When my friends make me play this, I make sure they know they owe me a favor. This game is the boardgame equivalent of getting kicked in the nuts.",
    "timestamp": 1739833200
  },
  {
    "username": "Zeral",
    "rating": 1.0,
    "comment": "99% luck, 1% agency\nHating it. Can't get my head around the heaps of praise it gets.",
    "timestamp": 1735081200
  },
  {
    "username": "Scifi66",
    "rating": 1.0,
    "comment": "Light bag builder with push your luck. Hated it. At heart it is pure luck, the bag is illusory control.\nx Random nonsense.\nx Headsdown MPS, indeed you are not supposed to look at your fellow gamers' boards as you could be cheating. Really? This is the opposite of what I want in a party game (Quacks is in that category for me).\n– Too long.",
    "timestamp": 1717365600
  },
  {
    "username": "skripted",
    "rating": 1.0,
    "comment": "I hate this game. It is way too luck based for my taste.",
    "timestamp": 1710630000
  },
  {
    "username": "Nozdormu",
    "rating": 1.0,
    "comment": "There is to much luck involved in this game. For starters, the one that wins the round gets to roll a die. On the die roll you can roll a pumpkin, which means you can add one more good token to your bag for free. If that happens multiple times in a row, then that player has really good odds at winning the game. This can and will happen and actually happened during my play of the game. The second part of luck is the luck of the draw. During my play a player on our table had 1/24 chance to draw the single tile she was not allowed to draw and consequently lost the game. This can and will happen. During that same game I personally experienced bad low chance bad luck pulls multiple times. This game me a bad experience. Once you are behind, it is difficult to catch up and no matter how much bad luck mitigation you build into your bag, you may end up drawing the bad ones regardless and to me that is just a flawed design. There are better games that involve luck like King of Tokyo or King of New York and they handle luck mitigation a lot better then this game ever will. For me this game is a pass. I have 0 intention into diving into this game ever again and will avoid it at all costs.",
    "timestamp": 1710457200
  },
  {
    "username": "ArkadiuszM",
    "rating": 1.0,
    "comment": "I can see the appeal but it is absolutely not for me and not something I would consider as a fun game. Extremely random and basic.",
    "timestamp": 1700434800
  },
  {
    "username": "eleanor357",
    "rating": 1.0,
    "comment": "No ducks. False advertising.",
    "timestamp": 1674342000
  },
  {
    "username": "Cowtippa",
    "rating": 1.0,
    "comment": "Overlong, multiplayer solitaire. Almost completely luck based. Id rather play monopoly or dice in the alley. STAY AWAY! I hate hate hate hate hate hate hate hate hate hate this game.",
    "timestamp": 1661464800
  },
  {
    "username": "ashack293",
    "rating": 1.0,
    "comment": "Quite simply, it's just not my style of game.",
    "timestamp": 1646953200
  },
  {
    "username": "ultimoratio",
    "rating": 1.0,
    "comment": "Update: Sept 2021\n\nHas a short tail. And after playing Taverns of Tiefenthal, I don't see the point of playing this if I can play Taverns instead.\n\n-------------------\n\nFun game of push your luck. Customise your bag, pick up ingredients from your bag, and try not to explode. Hilarious game. But I end up wanting to play other push your luck games instead.\n\nFirst comes to mind are Diamant/Incan Gold and Coloretto.",
    "timestamp": 1646262000
  },
  {
    "username": "egmondo",
    "rating": 1.0,
    "comment": "Random luckfest, how this gets \"Kennerspiel\" is absolutely beyond me. What a disappointment of a, well, not a game really. Sitting down and rolling a d6 against your friends fifty times in a row, highest total wins, has similar appeal, or just watch the paint dry, up to you.",
    "timestamp": 1639609200
  },
  {
    "username": "HiroDragonslayer",
    "rating": 1.0,
    "comment": "Entirely based on luck",
    "timestamp": 1610406000
  },
  {
    "username": "Ning",
    "rating": 1.0,
    "comment": "\"Kennerspiel des Jahres\" , Rank: Overall 71, nicht euer ernst. Dann lieber ne Runde Kniffel.",
    "timestamp": 1608332400
  },
  {
    "username": "Egwood",
    "rating": 1.0,
    "comment": "Too much on the luck of the draw. Bad quality on the bags.\n\nEdit. Tried again after a few years, to see if my perspective would change. No, no, no. I don't think I actively despise another game as much as this one. From 3 to 1.",
    "timestamp": 1607209200
  },
  {
    "username": "Manofwar",
    "rating": 1.0,
    "comment": "Silly mechanisms in this game, i totally understand luck factor i have no problem on this, but having just red and orange (if possible finishing them for others not to buy) can win you the game with that tiles present (reds 1 or 2 more going on previous numbers of orange), so there is no comeback even with tails cause in later turns everybody scores near max points and dice can add you 1-2 points so you can never catch up front player, how this game win a award , how the hype is hard to understand, another wingspan thingie.",
    "timestamp": 1590876000
  },
  {
    "username": "Engoduun",
    "rating": 1.0,
    "comment": "Way too much luck elements involved here. Even if you manage to buy lots of different ingredients you still might end up drawing too many starter tiles, or just not enough to catch up to the leading player. If it had some more strategy elements to it, that would save it.\n\nAs it is, the game is neither balanced nor worthy of the \"Kennerspiel des Jahres\" award.",
    "timestamp": 1586124000
  },
  {
    "username": "teodorap",
    "rating": 1.0,
    "comment": "SLR (solitare luck random) kids game",
    "timestamp": 1581894000
  },
  {
    "username": "vikingcode",
    "rating": 1.0,
    "comment": "I felt like a NPC the entire time.",
    "timestamp": 1581116400
  },
  {
    "username": "bad_bon",
    "rating": 1.0,
    "comment": "The worse push your luck game I have ever played! Luck festival!",
    "timestamp": 1580770800
  },
  {
    "username": "ziepten",
    "rating": 1.0,
    "comment": "Luck, luck, luck...",
    "timestamp": 1580425200
  },
  {
    "username": "Epidemius",
    "rating": 1.0,
    "comment": "Multiplayer solitaire is not fun.",
    "timestamp": 1561068000
  },
  {
    "username": "Schr0dinger85",
    "rating": 2.0,
    "comment": "Multi-solitaire push-your-luck game with rubberband mechanics so everyone can just ignore everyone else at the table and be mildly content with some meaningless score. I really dislike this game. I was flabbergasted by how it can be that popular.\n\nThe thrill of seeing someone push their luck too far and fail miserably is completely lost due to the simultaneous turns. Since everyone’s just doing their own thing, you miss the tension of other players’ turns — you’re basically playing alone.\n\nIf you want to bask in schadenfreude, I recommend Ra (auctions + push-your-luck done right) from Dr. Knizia.",
    "timestamp": 1762210800
  },
  {
    "username": "khepriq",
    "rating": 2.0,
    "comment": "The name of the game is Quacks of Quedlinburg. Americans love to butcher names because English is their only language. Now, it's just a soulless corporate name, like 'Meta' or 'Alphabet'. Also, put the designer+artist names back. Just call it Target Quack from now on",
    "timestamp": 1761256800
  },
  {
    "username": "Mandurang",
    "rating": 2.0,
    "comment": "I did not enjoy this push-your-luck, build-a-bag either thematically or gameplay-wise. It was advertised to me as a great gateway game but I would rather stay away. I also find the new art absolutely horrendous.",
    "timestamp": 1755468000
  },
  {
    "username": "g4bor",
    "rating": 2.0,
    "comment": "The expansion sort of improves the base game, but the potions phase is still about as exciting as playing \"she loves me, she loves me not\" to find out if taking extra risks is completely pointless or your only reasonable option. Unless, of course, you're so unlucky that you don't even get to that pseudo-decision.\n\n+ The Herb Witches",
    "timestamp": 1751407200
  },
  {
    "username": "TForever",
    "rating": 2.0,
    "comment": "Basically a filler game. It's a tile pulling bag building game, but aside from thinking about how many tiles to pull, the rest of the game is just instruction. It's easy.",
    "timestamp": 1745359200
  },
  {
    "username": "jarkano",
    "rating": 2.0,
    "comment": "new art is awful",
    "timestamp": 1743030000
  },
  {
    "username": "ChristianGameGuy",
    "rating": 2.0,
    "comment": "Concerning Spiritual Elemtents",
    "timestamp": 1736895600
  },
  {
    "username": "Contessi",
    "rating": 2.0,
    "comment": "Boring",
    "timestamp": 1736809200
  },
  {
    "username": "ChrisBach",
    "rating": 2.0,
    "comment": "Super boring as it's pure luck based. With a theme but boring non the less.",
    "timestamp": 1733007600
  },
  {
    "username": "Polgara",
    "rating": 2.0,
    "comment": "Not for me. I didn't like how little the special abilities of the different ingredients came into play. Everyone had a couple of rounds where they got (almost) only white tokens, or where they had a couple of ingredients, but didn't draw them in the right order for any of the abilities to work. Which made the game boring.",
    "timestamp": 1707087600
  },
  {
    "username": "Fragasnap",
    "rating": 2.0,
    "comment": "I think the core function of bag building is just so much worse than deck building. Any ingredient you gain may never be seen just by the nature of pulling from a bag.\n\nBecause so many special powers are dependent upon drawing things at the right time on the track or in relation to other ingredients, the constant failure again and again of drawing an ingredient when it isn't at its most useful makes the whole game feel frustrating.\n\nEven with a really clumsy catch-up mechanism the run-away leader seems really strong here. Without tokens that can net VP, clawing your way from a deficit seems improbable, and with tokens that net VP your total score is just up to the whims of chance.",
    "timestamp": 1706828400
  },
  {
    "username": "parpari",
    "rating": 2.0,
    "comment": "I can not believe this game won Kennerspiel des Jahres; especially against Heaven & Ale. It is a pure luck fest and long push your luck game. It feels like Coloretto to me but Coloretto is very interactive, shorter and way more smarter game than this.",
    "timestamp": 1701644400
  },
  {
    "username": "Alxz21",
    "rating": 2.0,
    "comment": "sold 750",
    "timestamp": 1693000800
  },
  {
    "username": "MezoKoBuzz",
    "rating": 2.0,
    "comment": "It's so largely fortune-based, one doesn't really have to think at all. I don't enjoy these kind of games.",
    "timestamp": 1688508000
  },
  {
    "username": "Elanif",
    "rating": 2.0,
    "comment": "At first I thought this sort of deck builder design would have been fun. Unfortunately, it's no more skillful than a coin toss.",
    "timestamp": 1682373600
  },
  {
    "username": "Xerya",
    "rating": 2.0,
    "comment": "Completely overhyped and overrated game. No strategy, no decisions, just pure luck. Pull random token out of bag - either you are lucky or your round has just finished. Plus the box \"art\" is really ugly. How this could have won any awards is beyond me.",
    "timestamp": 1676070000
  },
  {
    "username": "Vantucci",
    "rating": 2.0,
    "comment": "Too reliant on luck, not much strategy in this game.",
    "timestamp": 1672354800
  },
  {
    "username": "Bohdominator",
    "rating": 2.0,
    "comment": "Most over rated game I own. It's complete luck and has a terrible run away leader problem.",
    "timestamp": 1670194800
  },
  {
    "username": "Board_All_The_Time",
    "rating": 2.0,
    "comment": "I utterly hate my experiences with this game. Bag building just never works for me and then you put in the extreme luck of the pulls and it doesn't work. It doesn't matter if you can still get stuff when you bust, when you're the person who pulls your 8 value of white chips in 5 pulls (consistently) you are going to lose. If a player only busts once in the game (or never as I've seen) then you have a clear and away winner. Hate this game.",
    "timestamp": 1661464800
  },
  {
    "username": "FutureSpec",
    "rating": 2.0,
    "comment": "Edit 2022-03-27: lowering to a 1 from a 2. Something about this game really turns me off. It's creepy and weird.\n\nNot of fan of the gross theme of using animals (rats, spiders, etc.). Also too many fiddly bits.",
    "timestamp": 1648335600
  },
  {
    "username": "Lathaos1",
    "rating": 2.0,
    "comment": "There is no skill involved, only luck, pushing or other wise. Okay for some people, but i wont ever play it again",
    "timestamp": 1614726000
  },
  {
    "username": "tasskaff",
    "rating": 2.0,
    "comment": "Urgh - worst \"game\" ever",
    "timestamp": 1613862000
  },
  {
    "username": "GameplayerOfTitan",
    "rating": 2.0,
    "comment": "Nothing but dumb luck. Boring, overly long with few meaningful decisions.",
    "timestamp": 1613343600
  },
  {
    "username": "werekin",
    "rating": 2.0,
    "comment": "This is unbearable. Will happily play anything else by same designer.",
    "timestamp": 1612652400
  },
  {
    "username": "NormandyWept",
    "rating": 2.0,
    "comment": "Terrible push-your-luck game which manages both to make the actual decisions uninteresting and to spin the whole thing out into a 45-minute affair.\n\nEvery copy I've ever seen featured aftermarket counter cases or replacement counters, but I just don't see why you'd spend even more on something featuring so little actual game.",
    "timestamp": 1609542000
  },
  {
    "username": "marcuslind1",
    "rating": 2.0,
    "comment": "Mostly luck based multiplayer solitaire with a catch up mechanic happening after each round.",
    "timestamp": 1598479200
  },
  {
    "username": "seepieceeggshell",
    "rating": 2.0,
    "comment": "Teaching time: 10 minutes\nPlaying time: 45-60 minutes\n\nAfter more experimentation, I've become convinced that this game is at least 90% determined by luck - but it's hidden in a very sneaky way. At first you think the game is just pure luck of the draw, then you think you see how you can sway the odds. But under the hood, hidden a little deeper, is a strange engine dishing out +/- 5 or 6 points every round. The sleight of hand is this: every round you think the luck factor begins when you hit the 5-6 white total threshold, because that's when you start making luck-based decisions... but in fact luck has already dealt you a hand by that point when you had no decisions to make whatsoever, because it could have taken 6 spaces to hit that total, or 20. We've applied algorithms and played identically from game to game only to see 25+ point swings up and down. This is a horrible mismatch for the game's presentation, which makes you think you're in control by giving you dozens of decisions to make every round (which are entirely dwarfed by pure randomness), and the structural trappings of a euro efficiency game. There's a place for luck-based games, and it's not 45 minute fake euros - I'd play three rounds of Fluxx over this any day.\n\nLocal sales / trades only",
    "timestamp": 1591394400
  },
  {
    "username": "hollybells",
    "rating": 3.0,
    "comment": "An alright push-your-luck game, but if it didn't have the plastic GeekUp bits, nothing about it stands out from all the other push-your-luck games out there. Some of the token effects are fun and can combine with each other in lovely ways, but that's almost entirely dependent on me drawing well in a favourable sequence, and the roulette of getting good draws feels frustrating without consistent means to mitigate it.\n\nAfter about a dozen plays, I think this one is thoroughly played out for me. Any additional offered variance in expansion content that I've seen doesn't come close to sprucing up what is ultimately a tepid core game loop for me. For how mediocre each decision space feels, whether in purchasing ingredients or throwing back a cherry bomb or deciding whether to risk exploding the pot by drawing one more chip, Quacks feels like it plays three times longer than it should be.",
    "timestamp": 1759528800
  },
  {
    "username": "TheDinn",
    "rating": 3.0,
    "comment": "This is a weird game. It is huge, has a long playtime, and is pretty expensive. However, none of that extra cost, or time, or component bloat translates to more engaging gameplay. I won my first game of Quacks and felt... nothing. The decisions you make throughout the game never really evolve. I never thought about what anyone else was doing. Mystifyingly highly rated.\n\nSpots is a much better push your luck game.",
    "timestamp": 1752357600
  },
  {
    "username": "Fluffyumpkins",
    "rating": 3.0,
    "comment": "I really want to like this game. It's thematically interesting, ostensibly has some amount of strategy, and comeback mechanics that encourage risk-taking. Unfortunately it's just too luck dependent to be fun. Since this game is generally skewed for more casual players, or people new to the hobby, it can take 60 to 90 minutes. I can't overstate how frustrating it is knowing you have a bag of great tokens and watching as you draw multiple cherry bombs (bad tokens) in a row, and no amount of strategy would have made a difference. When it happens a few turns in a row, you'll wonder why you even bothered wasting time at your game night mixing this into the rotation.",
    "timestamp": 1751061600
  },
  {
    "username": "Chicacici",
    "rating": 3.0,
    "comment": "German Edition",
    "timestamp": 1750888800
  },
  {
    "username": "Ephorus",
    "rating": 3.0,
    "comment": "What I dislike:\n- Was fun for the first few times in which the mechanism was still novel. Afterwards, the game fell flat for me since it becomes quite repetitive and the decisions are too shallow for my taste.",
    "timestamp": 1750284000
  },
  {
    "username": "ourmove123",
    "rating": 3.0,
    "comment": "An extremely luck-based bag builder.\n\nThere is minimal strategy.\n\nThe game presents itself upfront as a luck-based game, which is nice because many games do not do this as well as Quacks.\n\nThe theme is nice, but the artwork is unappealing to me, as I wish it looked differently.\n\nOnce a player gets ahead in points, it is VERY difficult to catch up, even with the rat-tail catch-up mechanism.\n\nThe game is mostly fun because you hope to pull out the non-white tokens and get really far, but you rarely ever know if you will. This anticipation and fear is what the game relies on to keep players engaged.\n\nDesign insights:\n```\nA single level-3 cherry bomb chit can cause a lot of tension because even though you realize it's a low probability to pull it out, a single one can make your pot explode.\n```",
    "timestamp": 1748728800
  },
  {
    "username": "Knurrdachs",
    "rating": 3.0,
    "comment": "zu lang, zu glücklastig, keine strategie, ein spiel wo ich nicht unbedingt anwesend sein muss, damit es sich von selbst spielt",
    "timestamp": 1746741600
  },
  {
    "username": "MisterMystery",
    "rating": 3.0,
    "comment": "don't get at all what the fuzz is about, and Kennerspiel award is totally off",
    "timestamp": 1746482400
  },
  {
    "username": "Scottland",
    "rating": 3.0,
    "comment": "I can see why people find this game fun. But I have found in both games I’ve played that a single round of extremely bad luck (for example, five white bombs in the first seven or so draws, even when white chips comprise only about a third of the bag) is nearly impossible to overcome, especially if such a round occurs late in the game. And while I always want to look for ways to play better, there’s only so much you can do when you explode within the first six or seven draws in three separate rounds.\n\nI will only play this again if my family insists.",
    "timestamp": 1745704800
  },
  {
    "username": "gamblingworld",
    "rating": 3.0,
    "comment": "fun game, terrible new art direction and generally less charm.",
    "timestamp": 1743289200
  },
  {
    "username": "Dasha_bie",
    "rating": 3.0,
    "comment": "I didn’t manage to find a single advantage of this game which I bought with extension.",
    "timestamp": 1736031600
  },
  {
    "username": "Ddyraw",
    "rating": 3.0,
    "comment": "Not as hilarious as some made it out to be",
    "timestamp": 1729980000
  },
  {
    "username": "Quang17",
    "rating": 3.0,
    "comment": "Updated, a friend asked if I wanted to play and I decided no matter what I will not be in the mood for this game. Lowered to a 3 from a 6. I hate pure luck games and this game is just luck. This game is so bad it makes calling the IRS sound exciting.\n\nI understand why people like this game. It has a great theme and the game play is relatively easy and straight forward. The instructions were well written and easy to follow. You have the playability of having 4 different options for each ingredient and this allows the game to be changed up every time you play. The reason I rated it a 6 is because this is not a game I enjoy and I can't give it anything above Ok - will play if in the mood. I find this game extremely frustrating because you have no control over what you draw. If you played it safe every time you're about to explode you would never win. However, if you explode more than about 2 rounds you also can't win. It's a push your luck game and I didn't appreciate that my luck sucked. I have probably played this game around 10-15 times and I am glad I traded it away for a game that fits my taste.",
    "timestamp": 1727647200
  },
  {
    "username": "Musuh",
    "rating": 3.0,
    "comment": "Random, random and random!\nAbsolutely no fun!",
    "timestamp": 1722981600
  },
  {
    "username": "SJS1971",
    "rating": 3.0,
    "comment": "This is a surprisingly mindless game. Very repetitive - a lot of pulling tokens out of a bag and then waiting for other people to spend way too much time making a coin flip type decision. When I compare this to a game like King of Tokyo, which also relies on pressing one's luck, there's no comparison. KOT gives you interesting decisions to make and Quacks just doesn't.",
    "timestamp": 1721944800
  },
  {
    "username": "t0dd0",
    "rating": 3.0,
    "comment": "I just personally despise the push your luck aspect.",
    "timestamp": 1716847200
  },
  {
    "username": "PaintedCow",
    "rating": 3.0,
    "comment": "Fun game, at least for some people.\nBut I dont like the push your luck stuff that much. The game takes quite long for what it actually is.\nIf your draws are bad, you lose without having played badly. There barely any bad draw mitigation, which makes the game feel kinda pointless to me.\n\nNever want to play it again.",
    "timestamp": 1708124400
  },
  {
    "username": "sijieian",
    "rating": 3.0,
    "comment": "Not for us",
    "timestamp": 1704322800
  },
  {
    "username": "hiimjosh",
    "rating": 3.0,
    "comment": "I liked The Quacks of Quedlinburg from a technical point of view. The central ideas are fresh and there is a lot of variety in the box. The interaction is way too low though and the game is too overwrought. I found myself more interested in tinkering with the combos than competing, and for a game that crests an hour I find that unacceptable",
    "timestamp": 1691618400
  },
  {
    "username": "Thatsnotme",
    "rating": 3.4,
    "comment": "Geekup bits",
    "timestamp": 1684965600
  },
  {
    "username": "FR_IT",
    "rating": 3.0,
    "comment": "Sincerely not \"our piece of cake\"; the extreme \"push your luck\" mechanism bored me and other players (included the youngest).\n\nPlayed in February and in August '22: definitely repetitive, irritating, no interaction and no fun at all.\n\nBy name and by nature: charlatan!\nNever again.",
    "timestamp": 1673305200
  },
  {
    "username": "Shmickwahoo",
    "rating": 3.0,
    "comment": "Feels like playing a slot machine but longer. Push your luck is less impactful then in other games as busting is rarely that bad.",
    "timestamp": 1673218800
  },
  {
    "username": "Zapata",
    "rating": 3.0,
    "comment": "Sorry, but I found this one incredibly boring",
    "timestamp": 1666303200
  },
  {
    "username": "Stammler",
    "rating": 3.0,
    "comment": "It's so random and luck dependent. Also it feels like the game plays itself.\n\nI didn't enjoy my time.",
    "timestamp": 1664748000
  },
  {
    "username": "Micastiz",
    "rating": 3.0,
    "comment": "Anyone who says this is not very much luck-based is delusional. Runaway leader problem is real. Sure, if luck balances out then scores will be close but any push-your-luck game is rarely going to have that. Our game, the difference between top and bottom scores was rather ridiculous. Yahtzee with a very pretty dress and a whole lot of lipstick.",
    "timestamp": 1662328800
  },
  {
    "username": "Flat00",
    "rating": 3.0,
    "comment": "A lot of luck..",
    "timestamp": 1661896800
  },
  {
    "username": "bluewayrafi",
    "rating": 3.0,
    "comment": "This is a complete luck game. If you enjoy drawing random chits from your bag and never getting the cool new ones you bought while everyone else gets what they need, this game is for you.",
    "timestamp": 1658613600
  },
  {
    "username": "Medikus81",
    "rating": 4.0,
    "comment": "Csak a gyermekeim miatt játszottam. Nincs bajom a push your luck mechanizmussal és a zsáképítést pedig kifejezetten szeretem (pl: Altiplano), mégis nekem sem a téma, sem a grafika nem jön át. Másoknak szórakoztató, nekem unalmas. A gyermekeim kifejezetten szeretik.",
    "timestamp": 1760479200
  },
  {
    "username": "strikingloo",
    "rating": 4.0,
    "comment": "I found it to depend too much on randomness. A couple bad rounds set you back too much and the winning player snowballs too much.",
    "timestamp": 1760306400
  },
  {
    "username": "a_joonas",
    "rating": 4.0,
    "comment": "Even though I get a chuckle when I pull just the right thing from the bag every now and then, most of the time I don’t see the appeal. Do I get to break the game with wild combos? No. Do I or my opponents get to pivot strategies when someone falls behind or pulls ahead? No. Do I get to share those gamble moments with the rest of the table? Again, no.",
    "timestamp": 1759701600
  },
  {
    "username": "seb_48784",
    "rating": 4.0,
    "comment": "After about 5 games IRL: I don’t understand why this game is so popular. Push-your-luck until you “explode” feels like something for a very simple game, like Flip 7. But the effects of the different ingredients aren’t simple, they’re complex. They push me to calculate the exact optimal mix. It’s pure statistics. For that, I’d need an Excel spreadsheet, time, and motivation. Why would I want to play something intuitively when it’s obviously something you can calculate? Some might say I’m overthinking it, but it just doesn’t convince me. By the way, the tokens shouldn’t be made of cardboard. They wear out way too quickly.",
    "timestamp": 1754776800
  },
  {
    "username": "ArnestoLorenzi",
    "rating": 4.0,
    "comment": "Own and keep it, but too luck based. Catch up mechanism works, but I always draw Knallerbsen. Better than Duel.",
    "timestamp": 1754085600
  },
  {
    "username": "SoMi713",
    "rating": 4.0,
    "comment": "Rosszul érzem magam miatta. A játékidőhöz képest felháborítóan nagy a szerencse szerepe, én nem ezt keresem egy társasjátékban. Rövidebb játékoknál ez nem lenne probléma. Ha egyszer lemaradsz, szinte lehetetlen behozni a lemaradást. Az előkészületek rengeteg variációja viszont példás.\n\nIt makes me feel bad. The role of luck is outrageous for the amount of playing time, but that's not what I'm looking for in a board game.In shorter games this wouldn't be a problem, but here it's annoying. Once you fall behind, it's almost impossible to catch up. The many variations in setup are exemplary, though.",
    "timestamp": 1753048800
  },
  {
    "username": "Dirtnutmeg",
    "rating": 4.0,
    "comment": "wished I liked it more",
    "timestamp": 1749247200
  },
  {
    "username": "schrifterz",
    "rating": 4.0,
    "comment": "Too random for my taste",
    "timestamp": 1748210400
  },
  {
    "username": "jon_stodola161",
    "rating": 3.5,
    "comment": "The catchup mechanic is good in theory only. Once you are in last, you are stuck there. I would be happy if I never played Quacks again.\n\nFor better bag building I’ll play Wonderland’s War and for better push your luck, Sheepy Time.",
    "timestamp": 1745013600
  },
  {
    "username": "brw12",
    "rating": 4.0,
    "comment": "0 plays -- I took this game out from the library, read the instructions, and returned it.\n\nThe instructions are like a parody of a game with endless, fiddly, arbitrary rules. \"Warning! Players whose pot exploded now have to choose between either Evaluation Phase D or E.\" \"If the action stated that the players can take a yellow or purple chip, they can only do so if the corresponding ingredient book is already uncovered.\" \"Everyone, except the player in the lead, can throw rat tails into their pots, which enables them to move their rat stones forward in their pots.\" \"If the last chip you drew was white, you may put it back in your bag by using your flask.\"\n\nImagine if chess worked this way: \"You may not castle after the fifth turn unless either both bishops have been moved from their home positions, or one has been moved and the other has been moved to a square touching either side of the board.\"\n\nAnd all of this for a game that most people think of as not especially deep? It shouldn't take 15 minutes to understand the rules, followed by a dozen times that you forget some rule because it's not obvious.",
    "timestamp": 1742857200
  },
  {
    "username": "Sunnyfield",
    "rating": 4.0,
    "comment": "★★☆☆☆\nToo much press-your-luck.\n\nIn The Quacks of Quedlinburg you brew a potion with bonus and combo inducing ingredients and repeat that eight times over nine rounds. Depending on how lucky you are, you either earn victory points or money to buy better ingredients, or both.\n\nAll players simultaneously fill up their cauldron with ingredients by drawing these from a bag. Initially the bag mostly contains a lot of white ingredients that cause your potion to explode if you put too many of it in there. But after each round you get an opportunity to buy more and better ingredients and eventually your bag will mostly be filled with goodness.\n\nQuacks is a numbers game, like a lottery, and I guess a lot of the tension in this game comes from the greed and fear of drawing one more ingredient from the bag. The game gives incentives to be greedy, to just one more ingredient and then perhaps one more...\n\nWhen the potion explodes you must chose between earning victory points or buying new ingredients. If you did stop in time you get to do both. So there is definitely a reward for being cautious, but it most likely will not win you the game. The bigger the group, the higher the chance a risk-taker will win. Sure for every lucky winner there will be three unlucky losers at the table, but caution will place you more consistently in second place rather than first.\n\nI've seen many people enjoying this tension, but it is not for me. To survive this slog, I always try to play it in a light-hearted way, and inject some table-banter and playful exasperation with laughter. Basically enjoy the social aspect of playing this game, but as a competitive player, I really detest this luck-fest.\n\nI can appreciate what Wolfgang Warsch has done with dressing up push-your-luck in such a way that it has become a social experience. But it still is not for me. This leans towards one star for my tastes.",
    "timestamp": 1741388400
  },
  {
    "username": "GypoNolan",
    "rating": 4.0,
    "comment": "The art design and theme are fun, as are some parts of the gameplay, but it's a weird experience since you're so focused on doing your own thing and can be mostly oblivious to what happens to other people. So the game feels disconnecting in a way. Will see how I feel about\n\nIt's too long for what it is. There's not much strategy, little player interaction, and some fiddly set up and upkeep. I'd rather play a Knizia push your luck game.",
    "timestamp": 1740610800
  },
  {
    "username": "Polychromer",
    "rating": 4.0,
    "comment": "Pure Luck.\nStatistics are nice, still you can pull off three dead rounds in a row and that is not fun at all.",
    "timestamp": 1738537200
  },
  {
    "username": "latschediwes",
    "rating": 4.0,
    "comment": "Neat but shallow. Solitairish engine-building (yawn) with a colorful interface and a push-your-luck element (nice). It produces some \"Oos\" and \"Ahs\" along the way, which is the essence of this game. Exchanging and engaging with one another can conveniently be skipped, which is the widespread standard anyway. I am not opposed to the underlying idea of schadenfreude, there's soem odds management to it and the components look nice.\n\nThe shape of the bags is very unpractical (round shaped bags would have been the obvious choice) which is always noticeable, beacuse reaching in a bag and pulling out chits is all of what one does here.",
    "timestamp": 1737846000
  },
  {
    "username": "TheGiN",
    "rating": 4.0,
    "comment": "2-4\nBest: 4",
    "timestamp": 1735599600
  },
  {
    "username": "BoardGamingCouple",
    "rating": 4.0,
    "comment": "5/5\n\nQuacks is the game that Orleans & Altiplano should have been. Those games would be so much better if they were simultaneous play. Quacks is fun for the family. The game does have a run away leader issue (helps if using locoweed) & is highly luck driven. 100+ plays.\n\nThe expansions add more of everything to the game. No real extra rules, but some new ingredients, boards, recipes, and player powers. All good additions.\nMore recipes is always fantastic. Adds more variety & makes some colours better (orange & green).\n\nHouse rule: start with 9-10 buying power & skip round 1 for faster playtime.",
    "timestamp": 1735254000
  },
  {
    "username": "Jardinko",
    "rating": 4.0,
    "comment": "Variant setups is good, but it takes too long to play for how random it is. And it's a multi-player solitaire game.",
    "timestamp": 1734908400
  },
  {
    "username": "zgienger",
    "rating": 4.0,
    "comment": "I get the appeal and I think it's a very well designed system, but it's not in my personal taste. I'm learning I get more frustrated than excited with heavy push your luck games.",
    "timestamp": 1734476400
  },
  {
    "username": "snth",
    "rating": 3.6,
    "comment": "I love the components, art, and theme very much. Feels like being in a story book. But runaway leader issues, which I'm usually fine with, are not fun here. Wouldn't mind trying again.",
    "timestamp": 1734130800
  },
  {
    "username": "neiglib",
    "rating": 4.0,
    "comment": "+ 게임의 테마와 시스템이 찰떡 같아 몰입감이 좋음\n+ 손익 계산보다 그저 도전적인 플레이어끼리 있으면 파티 게임으로서의 가치가 있음\n- 리스크를 감수하지 않는 플레이어가 하나라도 있으면 텐션 급감인데 리스크를 딱히 감수할 메리트가 크지 않음\n- 선두와 격차를 줄일 쥐꼬리라는 장치가 있긴 하지만 사실상 역전은 불가능한 수준\n- 게임의 부피와 볼륨에 비해 플레이어의 사고가 개입할 부분은 약재 구입뿐인 점이 아쉬움",
    "timestamp": 1733094000
  },
  {
    "username": "ExplodingSnail",
    "rating": 4.0,
    "comment": "Making push your luck multiplayer solitaire is baffling.",
    "timestamp": 1731884400
  },
  {
    "username": "wilsonza",
    "rating": 4.0,
    "comment": "While this wasn't my favorite game of the con, this was the most memorable experience of the con. So many \"sack\" jokes. The rules translation made this hard to follow initially and I could sense we were all a little on the fence. However, once we got going the game seemed relatively intuitive and we all had a great time.\n\nI don't think I'll pick this one up as I'm not a big deck/pool building or push-your-luck fan, but I'd happily play it should someone else bring it...if nothing else just for the memories of laughing so hard at BGG.con!",
    "timestamp": 1731366000
  },
  {
    "username": "Scott1783",
    "rating": 3.5,
    "comment": "The English translation should have been \"Lucky Ducks\". I should have waited before 'blinging' it.",
    "timestamp": 1728597600
  },
  {
    "username": "Wigglerthegreat",
    "rating": 4.0,
    "comment": "This is a very luck based game. My friend cannot bust no matter the risk. He made several 60-40% or even 80-20%+ gambles that would result in him busting but he always made it. Meanwhile i lose several 90%+ chances of succeeding along with fellow unlucky players. The same person wins every time even with a far worse bag.",
    "timestamp": 1728252000
  },
  {
    "username": "MichielTummers",
    "rating": 4.0,
    "comment": "I just don't get why this is so highly rated.",
    "timestamp": 1728165600
  },
  {
    "username": "Danielka7",
    "rating": 4.0,
    "comment": "I don't understand the popularity of this game. I am fine with games with little player interactions, if they are somewhat puzzly or challenging. Here you have a solitary game which is extremely luck-dependant.\nGreat production, may be good for families.",
    "timestamp": 1727647200
  },
  {
    "username": "Valcurdra",
    "rating": 4.0,
    "comment": "Loved this initially, but quickly cooled on it. Lots to like on the surface, good art and components, fun theme, easy to play and a satisfying gameplay loop.\n\nI thought the variety of tile powers would give this some staying power, but it gets repetitive and dull very very fast. There just isn't enough decision space and after a while you are just pulling tiles over and over again with minimal interest.\n\nI completely soured on this designer, I found his games all are initially impressive but quickly tire out, clever concepts that don't quite hold up.",
    "timestamp": 1727215200
  },
  {
    "username": "cinnzel",
    "rating": 5.0,
    "comment": "Soy un entusiasta de las mecánicas que implican meter y sacar componentes de bolsas de tela porque potencian el carácter táctil de los juegos de mesa. Si quieres introducir a alguien en los juegos de mesa modernos, Pócimas y Brebajes es una magnífica experiencia táctil y, además, muy divertida.",
    "timestamp": 1761692400
  },
  {
    "username": "hyde_70s",
    "rating": 5.0,
    "comment": "I like wacky games, but I don't like when they give me an ilussion of doing something clever.",
    "timestamp": 1759010400
  },
  {
    "username": "FranzK",
    "rating": 5.0,
    "comment": "*\nGreat art and theme and the bag building is really fun. It’s very heavy on the press your luck and it really sucks to have a bunch of bad turns or have your ginger never help out. But it’s fun, tense, and plays quickly. Bonus points because it’s a great tool to teach my 5-year-old probability. My wife also likes it and she's not a big gamer. Really glad I came around to this game - when I initially played it, I wasn't so excited about the reliance on luck. But it is what it is and does exactly what its aims to do very well.\n\nOne concern is that rat tails don’t always offset a runaway leader effect. The player in the lead can get compounding benefits as other players are forced to press their luck harder, causing their pots to blow up, so they are forced to choose between points and getting more chips. Either way, they are even less likely to catch up as a result. Fortunately, those bad luck games are over quickly but they aren’t much fun for those that fall far behind.",
    "timestamp": 1758405600
  },
  {
    "username": "Gary_James_Gearik",
    "rating": 5.0,
    "comment": "This game is fun. But for me it is not an expert game, rather a family game with a great portion of luck and very little strategie. So I don't know how it became \"Kennerspiel des Jahres\".",
    "timestamp": 1758146400
  },
  {
    "username": "nic7410",
    "rating": 5.0,
    "comment": "61 new",
    "timestamp": 1757541600
  },
  {
    "username": "Nodens",
    "rating": 5.0,
    "comment": "Well-created tension and a lot of game, albeit a bit samey. Still a fun time.",
    "timestamp": 1756418400
  },
  {
    "username": "Jclancy15",
    "rating": 5.0,
    "comment": "It is fun, but a bit trivial so I don't have much interest in multiple plays.",
    "timestamp": 1756332000
  },
  {
    "username": "drphilphil",
    "rating": 5.0,
    "comment": "This game is actively frustrating for me. Everything feels so random. You can have the best bag and lose by a mile. You can build great bag strategies in your mind and then nothing comes together and it was all for naught. I'm normally all in for some juice randomness, but this is too much.",
    "timestamp": 1755122400
  },
  {
    "username": "cenny",
    "rating": 5.0,
    "comment": "It did feel a little long for a game that is push your luck, and little interaction. Maybe I’m missing something but I don’t get the hype. I hope my next play of this goes smoother.",
    "timestamp": 1753999200
  },
  {
    "username": "Galatolol",
    "rating": 5.0,
    "comment": "I won't mind playing this, but for a push-your-luck i find it too solitaire. Everyone does their PYL thing simultaneously, with no impact on others and no shared excitement.",
    "timestamp": 1752962400
  },
  {
    "username": "JunKie",
    "rating": 5.0,
    "comment": "Bland gameplay of push-your-luck, but lacks any excitement.\nThe ingredient books are offering you some bonus/advantages, but no real tactical decision are to be made, you are basically performing the mechanics as an observer. The game will adjust the gap to the leader by offering a build-in catch-up mechanism in the rat tokens, but luck may be the overall decider anyway.\nBland, too engineered, low tactical effect against mainly luckdriven play.. Nah! ??",
    "timestamp": 1750543200
  },
  {
    "username": "CreacK",
    "rating": 5.0,
    "comment": "Okish push your luck game. Pretty basic bag builder and would choose plenty of other push your luck and bag builders over it.",
    "timestamp": 1747432800
  },
  {
    "username": "EllikTheren",
    "rating": 5.0,
    "comment": "Luck fest. Straightforward rules. Accessible.",
    "timestamp": 1747173600
  },
  {
    "username": "A1v1to",
    "rating": 5.0,
    "comment": "It is addictive game. Once we got this we played like 30 games in few days.\nLike second expansion The Alchemist but Witches not so much.\n\nChanged my rating due to uncertainty design change for this game.\nNow on BGG I see only this new redesign version, which no one asked for.\nIt looks like kids game at this point, in my opinion.",
    "timestamp": 1746741600
  },
  {
    "username": "rendesm",
    "rating": 5.0,
    "comment": "I was promised fun, and all I got was a game I could not care about at all.",
    "timestamp": 1744149600
  },
  {
    "username": "azeem",
    "rating": 5.0,
    "comment": "A push-your-luck game with little decision-making. Fun, but brainless. Rolling the die is a nice reward. The rat-tail catch-up mechanism is brilliantly implemented.\n\nStill far too long for a game of this style.",
    "timestamp": 1742598000
  },
  {
    "username": "whitehouse3001",
    "rating": 5.0,
    "comment": "Didn't really enjoy the push your luck aspect. Not sure \"bag building\" is really my thing - it's just too random and adding and removing things from the bag to manipulate your changes just doesn't feel very strategic, compared to all the ways you can manipulate your deck/hand/discard/etc. in a deckbuilding game.",
    "timestamp": 1740092400
  },
  {
    "username": "Momo80",
    "rating": 5.0,
    "comment": "Surprisingly takes lots of space for such a game. Clever bag builder but with runaway leader problems. Gets samey even with various types of play. IMO overrated.",
    "timestamp": 1736809200
  },
  {
    "username": "ianne",
    "rating": 5.0,
    "comment": "It is a pity that the ingredients aren't wood or plastic, the cardboard ones won't last. A push-your-luck engine-builder.",
    "timestamp": 1735599600
  },
  {
    "username": "Liver_Spots2024",
    "rating": 5.0,
    "comment": "Meh",
    "timestamp": 1733871600
  },
  {
    "username": "EddyVaffen",
    "rating": 5.0,
    "comment": "wow I exploded, how exciting.........",
    "timestamp": 1732143600
  },
  {
    "username": "resolvecherry",
    "rating": 5.0,
    "comment": "A push-your-luck game I don't mind, but its lack of interaction makes me not want to play it very much.",
    "timestamp": 1730847600
  },
  {
    "username": "jtrleone",
    "rating": 5.0,
    "comment": "Almost purely push your luck. Luck has a huge factor but it does feel cool to build your bag. Also suffers from run-away leader.",
    "timestamp": 1728684000
  },
  {
    "username": "Wrecktangled",
    "rating": 5.0,
    "comment": "There is fun here if you don't think about it and that's what gaming is about, right? But if you do think about you are burdened by the enormous amounts of luck and possibly meaningless decisions and that does take away from some of the fun. There is also weird timing questions when played simultaneously which really come into play on the final round, but I would never want to play this turn-based.",
    "timestamp": 1727388000
  },
  {
    "username": "BureRF",
    "rating": 5.3,
    "comment": "Надо собрать допы",
    "timestamp": 1727128800
  },
  {
    "username": "MD87",
    "rating": 5.0,
    "comment": "I think this is my biggest rating discrepancy compared to the average.\n\nMy biggest problem with Quacks is it has a cool engine building element, where you build up your bag with different ingredients that work well together, then the push-your-luck element screws you over if you try and use them.\n\nMaybe I'm just terrible at pushing my luck, but I've been beaten by people who stop as soon as they're in danger of exploding, not pushing their luck at all. It doesn't feel like that should be a viable strategy. But pushing doesn't really get you that much more, and exploding is a pretty big setback. There's also the weird bit late game where you run out of space in your cauldron, and just can't play any more even if you want to.\n\nIt feels like there's a concept of a game in there somewhere that I'd like, but Quacks as-is definitely isn't it.",
    "timestamp": 1724104800
  },
  {
    "username": "troncodune",
    "rating": 5.0,
    "comment": "Anfangs fand ich sehr gut doch inzwischen kommt es kaum noch auf den tisch dafür hab ich wonderlands war lieben gelernt",
    "timestamp": 1723500000
  },
  {
    "username": "Marlharr",
    "rating": 5.0,
    "comment": "It's a fine introductory game, but not compelling enough for me to want to return to it. Prefer the Quest for El Dorado.",
    "timestamp": 1723327200
  },
  {
    "username": "nhlln",
    "rating": 5.0,
    "comment": "Multiplayer Solitaire and Push-Your-Luck is a combo not working for me. I never really felt involved in what the other players drew from their bag.",
    "timestamp": 1722031200
  },
  {
    "username": "jaieless",
    "rating": 5.0,
    "comment": "I don't like this game. Very surprised a game with so many small rules, special powers triggering all the time, and a 7-step round end resolution process would be hailed as a new benchmark for gateway games. Messy.\n\nApril 2021 Used",
    "timestamp": 1721426400
  },
  {
    "username": "bedebaker",
    "rating": 5.0,
    "comment": "Really enjoyed my first game, but my second game was less engaging. The game sings in the purchase round and as you approach your round's limit, but you spend too much time on much less impactful decisions, especially late game. Easy to learn, the game always feels close, not mean, and fun theme. Probably would only suggest situationally.",
    "timestamp": 1721253600
  },
  {
    "username": "millsyboy",
    "rating": 5.0,
    "comment": "The physical production of this game is excellent and some of the interactions of the ingredients are clever and fun. The excitement of the bag draws is lacking for a few reasons, including:\n1. A bust is a set-back, but often not a major one\n2. It’s often pretty clear when a bust is likely\n3. Bag draws are simultaneous, so players aren’t interested in each other’s draws",
    "timestamp": 1719352800
  },
  {
    "username": "Amy21",
    "rating": 5.0,
    "comment": "規則很複雜，花了很久的時間才搞懂",
    "timestamp": 1718488800
  },
  {
    "username": "elongatedmuffin",
    "rating": 5.0,
    "comment": "I have to admit there is a bit of magic here. This game has no business working at all. You're basically only drawing tiles from a bag, some good and some bad. Your only decisions are when to stop drawing so that you do not bust and what to buy at the store to add better tiles to your bag. If you draw all your bad tiles early in the round, there is no recourse. This game is not fair at all, and there isn't much depth to be found. And even though there is a catch-up mechanism, most of my games have a runaway leader. There's also no player interaction. It's a mystery to me, but I'm still happy to play Quacks every now and then.\n\nupdate [-1]: Everything I said above is still correct, but I think I was on the good side of the luck in most of my early plays. This is simply too long when there's very consistently at least one player who knows they are out of the game midway through.",
    "timestamp": 1717538400
  },
  {
    "username": "Korporejszyn",
    "rating": 5.0,
    "comment": "9 -> 5",
    "timestamp": 1717365600
  },
  {
    "username": "PoisonJamUK",
    "rating": 5.0,
    "comment": "Initial thoughts: This went down a storm as a 4-player including two non-gamers. At that player count, I'd give it an 8. As a two-player, it's nowhere near as fun.\n\nEDIT: My personal enjoyment of this has dropped off a cliff after a handful of plays. I realised I was only bringing it to the table for non-gamers to experience, while getting no enjoyment from the game itself.\n\nThese days I would much rather play Spots: a simple, fun dice game that manages to build in more player agency with all of the fun in a fraction of the set-up and playing time!",
    "timestamp": 1716760800
  },
  {
    "username": "Halloumiface",
    "rating": 5.0,
    "comment": "Fun, but simpler games do the push your luck with less setup and more player interaction.",
    "timestamp": 1716242400
  },
  {
    "username": "BlueMoon618",
    "rating": 5.0,
    "comment": "Cute but it felt a but too long",
    "timestamp": 1716069600
  },
  {
    "username": "John__Smith",
    "rating": 5.0,
    "comment": "Quacks is push your luck game where each player has a bag of ingredients and they take one out one at a time to try and get across a track trying to avoid too much of one particular type ingredient that all players get at the start of the game. The game takes place over multiple rounds. This is mainly a multiplayer solitaire game with a minimal interactions between players (interactions mainly at round end) the closest comparison I can think of is the level of player interaction in Wingspan (although Quacks is generally less).\n\nI occasionally like push your luck games and I generally like multiplayer solitaire, however this particular game just feels flat after each play-through. I've been trying to figure out why, I think comparing it with Wingspan is the best explanation I can give. In multiplayer solitaire I always like to feel that even if I lose the game I have still accomplished something and Wingspan has that with the engine building. I don't get that with Quacks. Also push your luck games in my experience are better when they are short snappy games (e.g. Incan Gold/Diamant) whilst Quacks can easily take an hour verging on 90 minutes if you are explaining.\n\nOverall, I don't think Quacks is a bad game and I wholly see why people enjoy it. The price tag for what you get is actually very reasonable, however I just don't think it's for everyone.",
    "timestamp": 1715378400
  },
  {
    "username": "broken clock",
    "rating": 5.0,
    "comment": "Kim: 8.5",
    "timestamp": 1715119200
  },
  {
    "username": "legolasegb",
    "rating": 5.0,
    "comment": "Update: I really like the ingredients, the production quality, the iconography. Some parts seem a bit fiddly with a bit of minutia, but I've discovered I really don't like bag-building. When a 6-year-old can hand you your a$$, it's just a bit too much for me to stomach. It simply comes down to luck. Dropping to a 5.\n____________________\nOld score 6.5. Fun, but just too much luck involved to rank higher.\n\nBought with gift card from Mommo & Poppi.",
    "timestamp": 1713736800
  },
  {
    "username": "TimNT",
    "rating": 5.0,
    "comment": "betrunken geht das",
    "timestamp": 1713477600
  },
  {
    "username": "TFJ383",
    "rating": 5.0,
    "comment": "A light press-your-luck game that ought to be experienced, but I don't think it's as special as a lot of folks have made it out to be.",
    "timestamp": 1712095200
  },
  {
    "username": "Kytzmo",
    "rating": 5.0,
    "comment": "SCHMIDT SPIEL- WOLFGANG WARSCH",
    "timestamp": 1712095200
  },
  {
    "username": "Jim Marshall",
    "rating": 5.0,
    "comment": "Dropping rating after one game that really dragged with people over-thinking their decisions despite there being a clear runaway leader - it's basically a luck-based game.\n----------\nFun chit-pulling push-you-luck game. Doesn't outstay its welcome and replayability is improved by each of the coloured chit types having a number of different effects - you pick the specific effect for each chit type before each game, allowing you to mix-and-match. You can influence the odds by your chit purchases, but drawing lucky never hurts.",
    "timestamp": 1711839600
  },
  {
    "username": "Ischtan",
    "rating": 5.0,
    "comment": "Good family game. But I do not like push your luck mechanics.",
    "timestamp": 1711753200
  },
  {
    "username": "dslimak",
    "rating": 5.0,
    "comment": "This isn't for me. I had hoped it would be a good family game but there is too little to think about even for a family-level game. Only hoping for a lucky draw.",
    "timestamp": 1710716400
  },
  {
    "username": "Jimjal",
    "rating": 5.0,
    "comment": "Sold. I definitely see the appeal here, but this game was just not for me.",
    "timestamp": 1708902000
  },
  {
    "username": "Einstine1984",
    "rating": 5.0,
    "comment": "It was waaay more complex than I expected.\nIt took too long going over the rules, even though there are only a few pages of them.\nThen we had to go back to the rules again and again, and everyone still missed some things.\nDidn't want to finish playing.",
    "timestamp": 1707778800
  },
  {
    "username": "Euroman",
    "rating": 5.0,
    "comment": "It seems to me that people are trending toward luck based games. Though this game isn't bad, it isn't great, and is very luck based. You pull better, you do better, that's it. I guess the consolation is that I will sometimes win no matter who I play with. Yay?",
    "timestamp": 1706828400
  },
  {
    "username": "narcow",
    "rating": 5.0,
    "comment": "Difficult to rate.\n\nI'm not a fan, but I don't think it would take much to greatly improve my opinion and might be willing to try again with expansions if asked. Otherwise, I won't be playing it again - it's not bad per se, but I don't think it's for me.\n\nThat said, there's a lot of elegance in the design which I appreciate, the theme comes through strongly, and there is a type of player to whom I might even recommend the game: someone looking for a source of low-brainpower entertainment for their family.\n\nOverall 5/10, but it's more like \"Personal: 3.9, Intended Audience: 8\"",
    "timestamp": 1706828400
  },
  {
    "username": "xPasis",
    "rating": 5.0,
    "comment": "It can be fun but I would like an element of interacting with each other. Despite playing with other players, it's kind of a solo-playing game. But it's great in the sense of that anyone could play it.",
    "timestamp": 1705446000
  },
  {
    "username": "ajie426",
    "rating": 5.0,
    "comment": "2020.5.28\n一个轻快的游戏，20分钟可看完规则，好友们好评如潮，9分\n2024.1.1\n带扩玩了一次，每次都爆，因为我不到第一的位置就停不下来，不适合我了！",
    "timestamp": 1704063600
  },
  {
    "username": "CianciulliQc",
    "rating": 5.0,
    "comment": "Nop\n\nSold",
    "timestamp": 1702422000
  },
  {
    "username": "mekane",
    "rating": 6.0,
    "comment": "I like some parts of this game, and I quite like the deluxe edition we got. I find it fun and light as long as it keeps moving. I have terrible luck though and a few games of this have left me feeling actually bad. Just getting screwed by bad luck with no real decision making doesn't feel good.",
    "timestamp": 1762653060
  },
  {
    "username": "wpolka",
    "rating": 6.0,
    "comment": "Fine as a family game, wouldn't personally bother playing it with adults",
    "timestamp": 1762470000
  },
  {
    "username": "Ryek",
    "rating": 6.0,
    "comment": "angol, újszerű, 20 000 HUF",
    "timestamp": 1762383600
  },
  {
    "username": "clawdew",
    "rating": 5.5,
    "comment": "Quacks is an overwrought push your luck game. It's just as random as push, can't stop, Ten, Incan Gold, etc. But takes way longer, and only offers the illusion of choice.\n\nI love a good wacky random game, but it needs to either be quick and snappy or be energetic and engrossing. Quacks is neither for me.",
    "timestamp": 1762038000
  },
  {
    "username": "Eugeniosaracino",
    "rating": 6.0,
    "comment": "Esp) Buen euro familiar con mecánica de Push your luck. El sistema de puntuacion con las ratas esas que sirven para que todos vayan mas o menos parejos hasta el final de la partida no me gustó nada, la verdad.",
    "timestamp": 1761778800
  },
  {
    "username": "GTes",
    "rating": 6.0,
    "comment": "Bei Jo",
    "timestamp": 1761429600
  },
  {
    "username": "peterkkelly",
    "rating": 6.0,
    "comment": "2-4\n45\nPLAY AT CAFE/CLUB",
    "timestamp": 1761343200
  },
  {
    "username": "Citadel",
    "rating": 6.0,
    "comment": "Fun push your luck bag building. I feel like I want a bit more decision making in this type and length of game (e.g. Mystic Vale, Living Forest, Wonderland's War). In Push Your Luck games, I want the ability for people to come back from being far behind with a good enough run of luck. Here, there seems to be a runaway leader.",
    "timestamp": 1760824800
  },
  {
    "username": "eitatetaata",
    "rating": 6.0,
    "comment": "Too much luck, too little game. Wonderland's War does it way better (although it's admittedly significantly heavier).",
    "timestamp": 1760479200
  },
  {
    "username": "wizcreations",
    "rating": 6.0,
    "comment": "The game was quite fun for the first 6 rounds, after which it felt repetitive and unnecessary. The runaway winner was clear by that point, or maybe two players are close and the other two have no chance to catch up. The game has multiple strong kingmaker mechanics that are not even close to mitigated by the Rat Tails.\n\nAfter successive plays, I also find the abilities rather arbitrary and unexciting. There are few good synergies worth building toward. You are almost always better off buying whatever color pieces allow you to purchase two tokens per turn, regardless of their token values.",
    "timestamp": 1760220000
  },
  {
    "username": "shmonkey",
    "rating": 6.0,
    "comment": "This was a fun game. Bag pulling push your luck. Not very interactive. Good bar night game. I would certainly play again as a pleasant activity but I wouldn't necessarily look forward to it as a main event game.",
    "timestamp": 1759874400
  },
  {
    "username": "retlom",
    "rating": 6.0,
    "comment": "Fun bag builder for every now and then",
    "timestamp": 1759442400
  },
  {
    "username": "logopolys",
    "rating": 6.0,
    "comment": "Bag-building game with push-your-luck elements. The bits are great, even though the theme is basically non-existent.",
    "timestamp": 1759356000
  },
  {
    "username": "tynaut2",
    "rating": 6.0,
    "comment": "Cute and quirky of a game. But there's little beyond push your luck and then just deciding what you can afford to buy.",
    "timestamp": 1758837600
  },
  {
    "username": "Dice Mage",
    "rating": 6.0,
    "comment": "2-5",
    "timestamp": 1758578400
  },
  {
    "username": "UnluckiestCat",
    "rating": 6.0,
    "comment": "This is something I could see myself playing alone on the phone as there's something to say about the different combinations and optimising one's bag. Then again, there are probably more interesting games on the phone and I'd miss drawing from the bag. As a boardgame though, I'm not sure why I'd want to play it again, because there's so many more interactive and/or funnier PYL games - what a pity as I wanted to like this more.",
    "timestamp": 1758405600
  },
  {
    "username": "peterlevi",
    "rating": 6.2,
    "comment": "4 (3,2)\n(open)\n\nIt has fun moments, but it's extremely random, there is close to zero interaction, and it feels very very light in terms of what decisions you take. And it feels too long for what it is.",
    "timestamp": 1758060000
  },
  {
    "username": "BastiRun",
    "rating": 6.0,
    "comment": "Für zwei geeignet",
    "timestamp": 1757196000
  },
  {
    "username": "VultR",
    "rating": 6.0,
    "comment": "No turns, thematic, player trust required.\nPoint tracking is a pain. So many numbers to keep track of.",
    "timestamp": 1757023200
  },
  {
    "username": "jerkman",
    "rating": 6.4,
    "comment": "Many praise this game, but for us it is to much push-your luck, so simply not our stil. Would be traded in or sold for 15,- € plus portage.",
    "timestamp": 1757023200
  },
  {
    "username": "AirikH",
    "rating": 6.4,
    "comment": "Грали декілька незареєстрованих ігор",
    "timestamp": 1756764000
  },
  {
    "username": "coxy_fc",
    "rating": 6.0,
    "comment": "8+ 2-4, best 4\n\nA little bit long for a luck based game and a little bit boring during the last rounds but overall a fun family game.",
    "timestamp": 1756764000
  },
  {
    "username": "les_",
    "rating": 6.0,
    "comment": "Quacks, aka The Quacks of Quedlinburg\n\nFeatured on Keep or Cull? (2024).",
    "timestamp": 1756591200
  },
  {
    "username": "Killi",
    "rating": 6.0,
    "comment": "Cool bag builder, but not my favorite push your luck game.",
    "timestamp": 1756504800
  },
  {
    "username": "so_not",
    "rating": 6.0,
    "comment": "7 with both expansions",
    "timestamp": 1756504800
  },
  {
    "username": "Termino476",
    "rating": 6.0,
    "comment": "En lo de Azul",
    "timestamp": 1756072800
  },
  {
    "username": "Txirristra",
    "rating": 6.0,
    "comment": "Ideal para jugar con niños, ya que les encantan las fichas y los libritos. Como juego push your luck, hay mejores opciones. Port Royal o Pelusas consiguen más con menos, sin necesidad de tantos componentes y ocupando menos espacio.",
    "timestamp": 1755640800
  },
  {
    "username": "D__W",
    "rating": 6.0,
    "comment": "It's fun, but not one I run to play. Easy to teach and kinda easy to break.",
    "timestamp": 1755554400
  },
  {
    "username": "Larry33",
    "rating": 6.0,
    "comment": "The game is just fine. Whenever we play, it seems that the game is already decided a couple of rounds in. When someone gets a bit of a lead, they always win. No one has come back to win whenever we play. Not sure why but that is always the case when we play. Not much fun. Will probably leave my collection eventually.\n\nGone 2025.",
    "timestamp": 1754949600
  },
  {
    "username": "TriathlonTodd",
    "rating": 6.0,
    "comment": "Played with Jeremy and Amy. Decision space wasn't deep enough for me, but a perfectly fine game.",
    "timestamp": 1754517600
  },
  {
    "username": "Quizmese",
    "rating": 6.0,
    "comment": "There is a lot of luck involved - oh my, what did you expect? And it's true, there is almost no interaction; we just drew at the same moment not to be influenced by each other's outcomes. And it is basically abstract, which personally I don't like.\n\nBut I don't want to give a low rating. It works, it does what it promises, the artwork is nice, it is not so complicated.\n\nI can't understand 8s, 9s and 10s for this game, but 1s, 2s, 3s and 4s are even more nonsense.",
    "timestamp": 1753912800
  },
  {
    "username": "RedHedgepig",
    "rating": 6.0,
    "comment": "It's fun, it's varied, it's family-friendly, it's a bit bonkers, and there's the thrill of going just one step too far. But (and it's a big but) just too much luck of the draw for me.",
    "timestamp": 1753740000
  },
  {
    "username": "Glic2003",
    "rating": 6.0,
    "comment": "Edit: damn that new box cover is really giving me some Nintendo 64/Playstation 1 vibes. And not in a good way.\n\n--------\n\nI feel like I should like this game more than I do, but it's just very frustrating to play. Every game, the exact same thing happens: I calculate the odds and then decide whether or not to keep drawing, and every time, the potion explodes against all odds.",
    "timestamp": 1753480800
  },
  {
    "username": "fredderer",
    "rating": 6.0,
    "comment": "2-4; too little interaction between players",
    "timestamp": 1753135200
  },
  {
    "username": "DoctorPelusa",
    "rating": 6.0,
    "comment": "2-4p",
    "timestamp": 1752876000
  },
  {
    "username": "phibilip",
    "rating": 6.0,
    "comment": "Played at game café.\n\nEither I stop as soon as I'm at risk of exploding and nothing exciting happens or I keep pulling and do explode and then I'm just losing. The best turns were the ones were I got a bunch of great pulls before being at risk but then there's nothing to the game. I just don't like push your luck games\n\nI'm glad we were able to borrow it to give it a try; I definitely don't plan to buy it or play it again. But I think Paul and Ralph liked it more, which is good.",
    "timestamp": 1752616800
  },
  {
    "username": "DaSnow",
    "rating": 5.5,
    "comment": "This is a good introductory game. It's a bag building game where you push your luck trying not to *POP* your cauldron by drawing too many cherry bomb chips.\n\nI've played this game too many times to enjoy it. There aren't a lot of decisions to make. You either choose to pull chips from the bag, stop pulling chips from the bag, and buy chips for your bag.\n\nIt doesn't matter how much you dilute your bag with non-cherry bombs, because you're always going to draw them no matter how many times you refresh your potion.\n\nThe only real time don't want your cauldron to explode is in the last round. Because if it does, you can kiss first place goodbye. I think this game would benefit from having less rounds, because it often feels like this game takes way too long. But I do understand that you want to keep getting as much money to buy chips for the last round.\n\nI also feel like the fortune cards aren't impactful as I'd like them to be. There are games where 3 of the ones we draw don't really do anything, sometimes we just draw a new one.\n\nI do however love the rat tail catchup mechanic. You feel less punished for exploding earlier on so you can focus on getting as much money as you can to dilute your bag.\n\nI will realistically play this game once in a blue moon, mainly it's used as a light game for someone new to the hobby, and that's pretty much what this game aims to do.",
    "timestamp": 1752616800
  },
  {
    "username": "Idiot_for_Life",
    "rating": 6.0,
    "comment": "Best at 2-4 (5 with expansion)\nShort to mid length\nBag building and push your luck game where Quack Alchemists compete to brew the largest potions.",
    "timestamp": 1752357600
  },
  {
    "username": "graybeard76",
    "rating": 6.0,
    "comment": "Pretty fun to play. But I am finding the flask not helpful more than half the time. Tending to use it once and then ignore it. A little too much 'luck of the draw' to really like this game.",
    "timestamp": 1751320800
  },
  {
    "username": "galar",
    "rating": 6.0,
    "comment": "bag building",
    "timestamp": 1751148000
  },
  {
    "username": "CotB",
    "rating": 6.0,
    "comment": "Rankings\n60th Best Game 2020\nUnranked 2021\n177th Best Game 2022",
    "timestamp": 1750888800
  },
  {
    "username": "Legatus80",
    "rating": 6.0,
    "comment": "+ simple and fast game\n- very dependent on luck, but without lore to justify it",
    "timestamp": 1750456800
  },
  {
    "username": "Hrolf29",
    "rating": 6.0,
    "comment": "Willing to sell. Will consider any offer.",
    "timestamp": 1749765600
  },
  {
    "username": "hunkamonk",
    "rating": 6.0,
    "comment": "A very much push your luck game with a bag builder facade. If it weren't for the variable setups for ingredients this would be as high on my list. The double sided boards are kind of take it or leave it as it seems that it is usually always more advantageous to move your droplet forward every time you have two rubies but it's nice to have either way. This and 7 wonders are the only two \"strategy\" games my wife has asked to play more than once in a sitting. Heck, she even wanted to play 3 games in a row one day. It works well at all player counts and is definitely an entertaining 45 minutes even if it is quite light and your luck can be very swingy. Ultimately you are responsible for your fate however as you know what's in your bag and if that white 3 chip blows you up you know the risk going in. After playing it several times it has lost it's charm a little for me and it's just too light to hold my attention much anymore but my wife loves it so I'm keeping it.",
    "timestamp": 1748988000
  },
  {
    "username": "etcjensen",
    "rating": 6.0,
    "comment": "",
    "timestamp": 1748901600
  },
  {
    "username": "Hoyu",
    "rating": 6.0,
    "comment": "Notes:\n- Anti-climatic ending\n- Runaway Leader Effect",
    "timestamp": 1748210400
  },
  {
    "username": "jonnnes007",
    "rating": 6.0,
    "comment": "Not a big fan, a little too much luck for my taste. Always take victory points if your cauldron explodes. If you don't, don't complain if you don't win and the competition is far ahead. If you do, it is still up to luck if you win or not.\nNot sure why it won the \"Kennerspiel des Jahres\" award.",
    "timestamp": 1748124000
  },
  {
    "username": "speter22",
    "rating": 6.0,
    "comment": "Quacks was one of my very first acquisitions once I really got into the hobby, since it seemed easy to play and was highly rated here on BGG. I had a great time with it for probably five plays or so, then realized that, wait, I actually like interacting with people when I play games, especially silly & simple ones like this. I like push-your-luck games, but this one was way too heads-down for me - I never found myself really enjoying the fortune or misfortune of others as much as I would have liked. It’s also too long (I’m realizing this is a complaint for most games I don’t like), and has too many rules to explain for how simple the decision space is.",
    "timestamp": 1746655200
  },
  {
    "username": "tento4pm",
    "rating": 6.0,
    "comment": "Was fun. The game play makes it very easy to cheat. Play group was not honoring their pulls. Be careful.",
    "timestamp": 1746568800
  },
  {
    "username": "Onbase",
    "rating": 6.0,
    "comment": "I'm a big fan of push-your-luck games, but I was hoping for more from this one. Since everyone's drawing and paying attention to their own bag instead of a shared pool, I felt like I missed some exciting moments from the other players. Though I did enjoy building the bag and having to choose between points or extra tokens.",
    "timestamp": 1745272800
  },
  {
    "username": "jerjerbinks",
    "rating": 6.0,
    "comment": "2-4 Players- Really silly push your luck game. Everyone is competing to make the best potion possible without going to far and having your potion blow upREVIEWhttps://www.youtube.com/watch?v=03eoXKp7L7MLEARN TO PLAYhttps://www.youtube.com/watch?v=hcvK6ExuISM",
    "timestamp": 1744236000
  },
  {
    "username": "gaboqv",
    "rating": 6.0,
    "comment": "I'm not a fan of the original art, it seems a little bit outdated, although the new 2025 version went overboard, most people still like the original, for example the mandrake art it's a throwback to harry potter. On the game itself I feel the moth is overpowered, and although I played around 8 times trying to win without it, I think I only managed to do it once, it's unfortunately a mandatory strategy in the early rounds, the moth should cost much more for what it does, it's basically an exponential return item on the first rounds, thus it makes it a dominant strategy and not buying them creates a disadvantage, if everyone is buying you need to buy it to or you would benefit people around you, but when everyone buys them, there's not as much strategy as creating a much more varied deck.",
    "timestamp": 1744236000
  },
  {
    "username": "Minorly",
    "rating": 6.0,
    "comment": "Press your luck game, which is not for everyone. Has good catch up mechanics but not enough to beat miserable luck.",
    "timestamp": 1743890400
  },
  {
    "username": "SittingGeorge",
    "rating": 6.0,
    "comment": "Eh... it's alright. Too solitaire for me, I much prefer MLEM because it gets everyone invested in a shared object.",
    "timestamp": 1743717600
  },
  {
    "username": "Iraperkins82",
    "rating": 7.2,
    "comment": "8/10: Really great game, almost always keeping. I may not suggest it all the time, but will never turn down a game.",
    "timestamp": 1762666440
  },
  {
    "username": "CarsonChandler",
    "rating": 7.0,
    "comment": "I like my push-your-luck to be a little less solitary - I think I need to try Celestia next.",
    "timestamp": 1762653120
  },
  {
    "username": "TheMiddleAgedGamer",
    "rating": 7.0,
    "comment": "[removed by the thought police]",
    "timestamp": 1762616040
  },
  {
    "username": "merismo",
    "rating": 7.0,
    "comment": "A surprisingly nice mix of strategy and press your luck. Quacks became a classic for a good reason.\n\nWhy I don't rate it higher- the game adds some variability by allowing you to change what bonus effect each ingredient does. Within the same ingredient, you will find some abilities that are quite powerful and some that leave you wondering \"Why would anyone use this?\".\nIn other words, could have used some more balancing.\n\nThere's much controversy over the art- especially the redesign. I have the original version, which has its uh... charms. Alright, its ugly and I see why they redesigned it. But the new one feels a bit soulless.",
    "timestamp": 1762581840
  },
  {
    "username": "Synthoras92",
    "rating": 7.4,
    "comment": "I've got the older version, not this new horrendous one xD",
    "timestamp": 1762297200
  },
  {
    "username": "ExcessiveGravitas",
    "rating": 7.0,
    "comment": "with expansion",
    "timestamp": 1762210800
  },
  {
    "username": "THE_GODFATHER",
    "rating": 7.0,
    "comment": "X",
    "timestamp": 1761951600
  },
  {
    "username": "Dreadford",
    "rating": 7.0,
    "comment": "Очень красивая, но мне никогда не везёт с этими мешками.",
    "timestamp": 1761865200
  },
  {
    "username": "youthlibrarian09",
    "rating": 7.0,
    "comment": "Definitely looking forward to playing this game again.",
    "timestamp": 1761865200
  },
  {
    "username": "corecommand8480",
    "rating": 7.0,
    "comment": "It's a push your luck game with an emphasis on the luck. I found the bag building to be very fun and enjoyable! It's just a game you sit down and play without the full intention of attempting to win but still very enjoyable!",
    "timestamp": 1761778800
  },
  {
    "username": "sallyshears",
    "rating": 7.0,
    "comment": "Been a while since I played this. Was fun at the time, but I do recall luck being a bigger factor than I would have liked.",
    "timestamp": 1761429600
  },
  {
    "username": "ElQuappo",
    "rating": 7.0,
    "comment": "zu verkaufen (?)",
    "timestamp": 1761429600
  },
  {
    "username": "Ezzra",
    "rating": 7.0,
    "comment": "Rattenstein in der Spielerfarbe silber ist eine Fehlproduktion",
    "timestamp": 1761429600
  },
  {
    "username": "ggruetze",
    "rating": 6.5,
    "comment": "Fun for the family but it was overplayed so I'm less enthused at this point. Will still happily play with them but avoid it elsewhere",
    "timestamp": 1761343200
  },
  {
    "username": "bnordeng",
    "rating": 7.0,
    "comment": "Despite all of the good things I'd heard about the game, the highly random aspects had me seriously doubting that I'd like it. An opportunity to play arose and I jumped on it, figuring I needed to give it a try. I'm glad I did as it's quite charming and the push-your-luck in the game is very well done. I look forward to trying it again.",
    "timestamp": 1760911200
  },
  {
    "username": "grayzilla",
    "rating": 6.5,
    "comment": "Has Folded Space Organizer with room for all expansions.",
    "timestamp": 1760738400
  },
  {
    "username": "moonerie",
    "rating": 6.5,
    "comment": "2-4 players (rec 2-4; best 4)\n7.8 rating\n1.94 complexity\n45 mins\n\nNotes: Feels very luck based, and as usual, it's not in my favor. I like gambling though so not a bad time . Beginning took a second to get used to but rounds go by pretty fast after that. Also like that there are 4 different types of rounds depending on which side you want to use. I really really really want upgraded components on this if i play again though:/",
    "timestamp": 1760652000
  },
  {
    "username": "Madscrub",
    "rating": 7.0,
    "comment": "Great family game, push your luck at is best!",
    "timestamp": 1760565600
  },
  {
    "username": "Karandaras",
    "rating": 7.0,
    "comment": "nur mit Erweiterung\nZutatenmarker in 3D gedruckten Teilen für mehr Masse im Beutel",
    "timestamp": 1760479200
  },
  {
    "username": "TiagoBonamigo",
    "rating": 7.0,
    "comment": "Nice game, but my wife doesn't care much for push your luck games. I think it is a great game to introduce to people that are not into modern board games.",
    "timestamp": 1760392800
  },
  {
    "username": "david_os",
    "rating": 6.5,
    "comment": "After some initial concerns that the bag corners made it possible to make the draws not quite random, we've enjoyed this - you just have to jiggle that bag properly every time.\n\nHaven't tried any of the non-starter spellbooks yet, but those look like they provide some variety to keep things interesting. It's obviously heavily luck dependent, but there's enough going on and enough of a feeling that you are in control to offset that (at least for us). Not to be taken too seriously.\n\nThe rat tails are a neat catch-up idea, that doesn't quite do enough to keep everyone in the game.\n\nIt's possible it should be played while drinking.",
    "timestamp": 1760306400
  },
  {
    "username": "CottonCandyCat",
    "rating": 7.0,
    "comment": "Friend owns. Push your luck is exciting and makes for some great moments. This is really fun for me and the rat tails are a nice catch up mechanic but had one game where it felt like it was impossible to catch them. Very luck based / random, quick games. Would play again but might choose something else depending on what else is there. Pretty good overall though.",
    "timestamp": 1760306400
  },
  {
    "username": "Unitoch",
    "rating": 7.0,
    "comment": "Light fun. People like this one, and it's easy to get it to the table. The alternate setups and expansions give it a bit more staying power. Theme is pretty thin, but the art and bits are fantastic. Almost everybody I've played this with at least finds it passable.\n\nIt's not all positive. The game has a real runaway leader problem. There's a counterintuitive strategy of busting early to exploit the catch-up mechanism that can feel wrong. The high variability of drawing from your bag can make things very frustrating when it feels like your high-value chips just refuse to come out.\n\nThat said, this one's popular for a reason. If you haven't tried it or are on the fence about buying it, it's worth finding a copy.",
    "timestamp": 1760133600
  },
  {
    "username": "BoomDooger",
    "rating": 6.8,
    "comment": "Chels: 7\nAnt: 6.5\n\nA weird and wacky experience that drags on too long - 9 rounds is needed to feel the bag changes and cancel some of the rough variance that can occur, but by the end you have no idea what's left in the bag (for both good and ill) and you are just willing it to be over. Quite a lot of fun in the first half, and one that can get anyone giggling.\n\nGifted to Family 10/25",
    "timestamp": 1759960800
  },
  {
    "username": "leleyx",
    "rating": 7.2,
    "comment": "SOLO\nWEIGHT | CRITERIA                | RANGE                          | RATING\n    20 | ENJOYMENT         | (Forgettable to Outstanding)   | \n    15 | REPLAYABILITY     | (Nil to Limitless)             | \n    13 | DEPTH             | (Lacking to Meaty)             | \n    12 | MECHANICS         | (Boring to Interesting)        | \n    09 | ART               | (Potato to Picaso)             | \n    09 | CLARITY OF RULES  | (Mud to Crystal)               | \n    07 | AI EASE           | (Coarse to Smooth)             | \n    07 | LUCK FACTOR       | (All Luck to All Skill)        | \n    04 | COMPONENT QUALITY | (Cheap to World Class)         | \n    04 | GAME LENGTH       | (Too Short/Long to Just Right) | \n\n\nMULTIPLAYER\nWEIGHT | CRITERIA                | RANGE                          | RATING\n    15 | ENJOYMENT                | (Forgettable to Outstanding)   | \n    12 | MECHANICS                | (Boring to Interesting)        | \n    12 | PLAYER COUNT PERFORMANCE | (Not Balanced to Balanced)     | \n    12 | PLAYER INTERACTION       | (Low to High)                  | \n    09 | CLARITY OF RULES         | (Mud to Crystal)               | \n    09 | DEPTH                    | (Lacking to Meaty)             | \n    09 | REPLAYABILITY            | (Nil to Limitless)             | \n    07 | GAME LENGTH              | (Too Short/Long to Just Right) | \n    07 | LUCK FACTOR              | (All Luck to All Skill)        | \n    04 | ART                      | (Potato to Picaso)             | \n    04 | COMPONENT QUALITY        | (Cheap to World Class)         |",
    "timestamp": 1759701600
  },
  {
    "username": "pinkleprechaun",
    "rating": 7.0,
    "comment": "ZV, play with upgraded books!",
    "timestamp": 1759615200
  },
  {
    "username": "elucidarian",
    "rating": 6.5,
    "comment": "Over the first two weeks I owned this game (thanks to a friend for the birthday gift), I taught 14 people to play, gamers and non-gamers. Every one of them had a smile on their face and wanted to play again.",
    "timestamp": 1759442400
  },
  {
    "username": "FarawayPictures",
    "rating": 8.0,
    "comment": "A lot of fun.\nUpgrade your pieces and this looks stunning.",
    "timestamp": 1762590480
  },
  {
    "username": "Tyson2337",
    "rating": 8.0,
    "comment": "My family enjoys this. Simple but fun. Going to pick up the expansions",
    "timestamp": 1762470000
  },
  {
    "username": "jmoslainte",
    "rating": 8.0,
    "comment": "PLays 2-4\nCommunity 2-4\nBest w 4",
    "timestamp": 1762297200
  },
  {
    "username": "Apolloontje",
    "rating": 7.5,
    "comment": "Family loves it. Easy to table. Have the better tiles which makes it so much nicer.",
    "timestamp": 1762038000
  },
  {
    "username": "Crushar",
    "rating": 7.5,
    "comment": "Laserox Insert\nAcrylic Tokens",
    "timestamp": 1761951600
  },
  {
    "username": "Arctic00",
    "rating": 8.4,
    "comment": "Quacks is fun, but I think that push-your-luck games just aren’t my cup of tea. When I get good pulls, this game is incredibly fun.\n\nHowever, most of the time I find that I feel more frustrated than fun when playing this because it seems like the only thing that I can pull are the white chips. I’ve had several games of quacks where the frustration seems just as plentiful as the fun.\n\nWhen it goes well, though, fantastic game. Luck based games are just inherently going to lose out to strategic, formulaic games for me.\n\nEdit: May '25: Changed from 7.2 to 7.9. Found more love for Quacks.\n\nEdit 2: Oct '25: This really is a fun game and deserves more love than I gave it previously. 7.9 to 8.4.",
    "timestamp": 1761778800
  },
  {
    "username": "plbogen",
    "rating": 8.0,
    "comment": "3d Printed Insert",
    "timestamp": 1761778800
  },
  {
    "username": "Graycat_The_Gray",
    "rating": 8.0,
    "comment": "Own 2025 All-In-Edition (Clay Model Artwork)",
    "timestamp": 1761778800
  },
  {
    "username": "quetzal513",
    "rating": 7.8,
    "comment": "P: 2-4, T: 45 min, KenSdJ-W\nPress your luck bag builder. Variable setup and events. It compares, but seems a bit lighter, to Orleans; while it won the KennerSpiel, I think it's more a family game plus (+). A little bit of a catch up mechanism in play. North Star Games to produce the English version",
    "timestamp": 1761519600
  },
  {
    "username": "RunningRed",
    "rating": 8.0,
    "comment": "Sleeved with:\nGGS10066ML Standard American Matte (59 x 91)",
    "timestamp": 1761519600
  },
  {
    "username": "AlbertoRavioli",
    "rating": 8.0,
    "comment": "83/100",
    "timestamp": 1761519600
  },
  {
    "username": "krll",
    "rating": 8.0,
    "comment": "2020",
    "timestamp": 1761429600
  },
  {
    "username": "ithinkimasofa",
    "rating": 8.0,
    "comment": "great bag builder for a group that maybe doesnt like heavy games. easy to play, fun interaction waiting for people to explode.",
    "timestamp": 1761429600
  },
  {
    "username": "MissBlade",
    "rating": 8.0,
    "comment": "Quacks of Quedlinburg! Great game. My kids love this and after all these years still request it. It was one of the first games i added to my collection - way back.\n\n(Thankful to have the original edition. The American version isn't appealing. Not a fan of the new art.\nI also find it odd to not have the designer's name on the front of the box.)",
    "timestamp": 1761256800
  },
  {
    "username": "Joerie",
    "rating": 7.7,
    "comment": "+T. Faster\nSugar\nF. SKINNY",
    "timestamp": 1761170400
  },
  {
    "username": "wiim",
    "rating": 8.0,
    "comment": "Nice implementation of push your luck and bag building. There's interaction, but nothing agressive. Obviously lots of luck involved and heavy catchup mechanism, but it doesn't pretend to be a heavy game so it didn't bother me.",
    "timestamp": 1761170400
  },
  {
    "username": "Pinto",
    "rating": 8.0,
    "comment": "Fairly solid and fun game. I enjoy the push your luck element with drawing ingredients from your bag to get special effects, points, and purchasing power. The game had a lot of options to buy various items and get potions/mice placement. I like the various ingredient effects, making every game different.\n\nThere was a rule which seemed to benefit the person who pushed their luck the furthest, which seemed to be too generous and minorly imbalanced.",
    "timestamp": 1760911200
  },
  {
    "username": "Mrs Meeple",
    "rating": 8.0,
    "comment": "2-4",
    "timestamp": 1760738400
  },
  {
    "username": "StrongbowGold",
    "rating": 8.0,
    "comment": "Ciarlatani di Quedlinburgo",
    "timestamp": 1760738400
  },
  {
    "username": "Mr_Gre3n",
    "rating": 8.0,
    "comment": "I've played this quite a few times as a fun easy game with friends. The all in edition is a lot of fun. Changes the game every time and makes each experience different and fun!",
    "timestamp": 1760738400
  },
  {
    "username": "fazermozg",
    "rating": 8.0,
    "comment": "+",
    "timestamp": 1760652000
  },
  {
    "username": "YoLYcmqZ",
    "rating": 8.0,
    "comment": "Thoughts: Serves as a gateway game—something we only bring out with relatively new players. Push-your-luck element is top-notch and building your bag is fun when you get those huge turns. Theme hits for some, not for others. The new artwork is terrible (glad I have the old version). Easy to teach and usually doesn't disappoint.\n\nTag(s): Push-Your-Luck, Bag Building, Gateway\nBest Player Count: 2-4, {4}\nRating: 8, +0.0\nOwn: Physical",
    "timestamp": 1760392800
  },
  {
    "username": "Napattack",
    "rating": 8.3,
    "comment": "1.94\n2-4\nbest at 4\n45 (585)\n#95",
    "timestamp": 1760306400
  },
  {
    "username": "DevOpsProDude",
    "rating": 8.0,
    "comment": "56x87 - 64\n\nPlayed on board game night.",
    "timestamp": 1760047200
  },
  {
    "username": "Hovien",
    "rating": 8.0,
    "comment": "Library",
    "timestamp": 1759960800
  },
  {
    "username": "yaenz",
    "rating": 8.0,
    "comment": "Quacks offers a tactile push your luck experience where all players play at the same time, two things i love in games. Quacks is highly modular and customizable and offers a nice variety of luck-mitigation and catch-up mechanisms. All these points together make this game truly special!",
    "timestamp": 1759960800
  },
  {
    "username": "Dickhillman",
    "rating": 8.0,
    "comment": "Sell",
    "timestamp": 1759701600
  },
  {
    "username": "Bethobrien",
    "rating": 8.5,
    "comment": "Game category: Bag Building Game",
    "timestamp": 1762640220
  },
  {
    "username": "denneman",
    "rating": 9.0,
    "comment": "I own the OG game (Quacks of Quedlinburg)",
    "timestamp": 1762633440
  },
  {
    "username": "Lord McMatty",
    "rating": 9.0,
    "comment": "Lots of fun. Better with more players, and it is fun with everyone watching everyone else and trying to decide whether to push their luck. We tried both simultaneous picking and letting everyone go at their own pace, and we prefer the freedom of letting everyone go at their own pace. No one has yet tried to \"game the system\", so to speak.",
    "timestamp": 1762470000
  },
  {
    "username": "Hailey_F",
    "rating": 8.5,
    "comment": "Played at Con. Loved. Want to Buy",
    "timestamp": 1762383600
  },
  {
    "username": "Ajohnny101",
    "rating": 9.0,
    "comment": "I knew this game was special the first time I played it. The push your luck element is always exciting and I think the game employs clever mechanisms to keep you in it even if you've had rotten luck. I like the variety in ingredient sheets that make every game feel different and with simultaneous play the game never feels slow. For some reason even though I've never won a game of this, I can't wait to play again.",
    "timestamp": 1762297200
  },
  {
    "username": "eddyd83",
    "rating": 9.0,
    "comment": "Good 4 player game",
    "timestamp": 1762124400
  },
  {
    "username": "Rhythm_and_Blues",
    "rating": 9.0,
    "comment": "Such a great gateway game that can be enjoyed by everyone. The emotions that Quacks bring out from everyone is amazing. The game is a dopamine rush as you test your luck more and more. It's so strangely exciting every time you add ingredients into your bag, even if it's just one or two every round. There's this weird and fun delusion that every player has when they play Quacks, where everyone just thinks that the game should go perfectly in their favor every round. It's almost comical how emotional everyone gets as they suffer unlucky rounds, which makes it that much more satisfying when things actually do go well. The catch up mechanic 'rat tails' are also incorporated extremely well into the game, to the point where players don't even mind being behind that much. In my experience, Quacks of Quedlinburg is always a good time, no matter who you are playing with. It's simple, exciting, and plays very fast for a \"hobby game\". A modern classic.\n\nP.S. The upgraded components are fantastic. Highly recommend.",
    "timestamp": 1761692400
  },
  {
    "username": "jarh3ad5",
    "rating": 9.0,
    "comment": "3D Printed Insert",
    "timestamp": 1761692400
  },
  {
    "username": "royalty_valens",
    "rating": 9.0,
    "comment": "A charming push-your-luck game that's as fun to teach as it is to play. The rubber-banding mechanic does a great job of evening out even the harshest luck.",
    "timestamp": 1761343200
  },
  {
    "username": "Awesomiser",
    "rating": 8.6,
    "comment": "Brilliant fun!",
    "timestamp": 1761256800
  },
  {
    "username": "07734",
    "rating": 9.0,
    "comment": "Main",
    "timestamp": 1761170400
  },
  {
    "username": "Kaibaman209",
    "rating": 9.0,
    "comment": "LET'S GO GAMBLING!!",
    "timestamp": 1761084000
  },
  {
    "username": "Koennen",
    "rating": 9.0,
    "comment": "Very fun. Very funny. Some of the later books have more exciting powers, but none are too strategic. Excellent for a filler game, but too much to teach.",
    "timestamp": 1760997600
  },
  {
    "username": "Trevor03",
    "rating": 8.5,
    "comment": "Quacks is a game with an illusion of control, where you probably don't have much, but in the end it's so enjoyable and tension-filled pulling things out of your bag that it doesn't matter.\n\nThere can be a runaway leader, and just plain terrible luck that can hurt the experience for one or more players. But it's light and quick enough that it doesn't matter too much in the end, and the catch-up mechanism isn't bad.\n\nThe variability of setup options definitely helps each game feel a bit different.",
    "timestamp": 1760911200
  },
  {
    "username": "Wern75",
    "rating": 9.0,
    "comment": "You have to be able to deal with bad luck in this one (unless you have Herb Witches and / or the Alchemists extensions )",
    "timestamp": 1760824800
  },
  {
    "username": "ItsMagic",
    "rating": 8.6,
    "comment": "participating tactile specializing stimulating constructing unlocking combining peaceful massive game-like;\nfavoured over Frogriders, Potion Explosion",
    "timestamp": 1760824800
  },
  {
    "username": "NATOnova",
    "rating": 9.0,
    "comment": "Both expansions plus base game in the mega box. All ~450 ingredient pieces are in coin capsules which fit well.",
    "timestamp": 1760652000
  },
  {
    "username": "HaoTien",
    "rating": 9.0,
    "comment": "画风是我的爱，虽然规则简单，但是很适合聚会一起玩。",
    "timestamp": 1760565600
  },
  {
    "username": "badassbr",
    "rating": 9.0,
    "comment": "Melhor push your luck ever\n\nSim é randômico, sim ja perdi porque na última rodada eu simplesmente puxei tudo branco seguido\n\nmas é engraçado demais",
    "timestamp": 1760392800
  },
  {
    "username": "TheSlushySnake",
    "rating": 8.5,
    "comment": "Potion Making-Themed, Push-Your-Luck + Bag-Building Game.\n2-4 Players. (Best With 4 Players).\n\n“Sleeved”",
    "timestamp": 1760220000
  },
  {
    "username": "GWondowski",
    "rating": 8.5,
    "comment": "March 2025",
    "timestamp": 1760047200
  },
  {
    "username": "Irung",
    "rating": 8.5,
    "comment": "25,36 BOL 2024",
    "timestamp": 1759788000
  },
  {
    "username": "DarkJjay",
    "rating": 9.0,
    "comment": "Includes Herb Witches expansion. Stored in Folded Space insert",
    "timestamp": 1759788000
  },
  {
    "username": "ebz28",
    "rating": 9.0,
    "comment": "ratatouille",
    "timestamp": 1759701600
  },
  {
    "username": "hockeyjones",
    "rating": 9.4,
    "comment": "Played in 2019",
    "timestamp": 1759615200
  },
  {
    "username": "mattbain31",
    "rating": 9.0,
    "comment": "Played it until my score was high enough to run off the board, and then traded it away, as I felt I beat the game.",
    "timestamp": 1759528800
  },
  {
    "username": "spixel",
    "rating": 9.0,
    "comment": "KEEP",
    "timestamp": 1759183200
  },
  {
    "username": "NotBrandonJaspers",
    "rating": 10.0,
    "comment": "Prior Art Version with Herb Witch Expansion and GeekUp Acrylic Tokens.",
    "timestamp": 1761951600
  },
  {
    "username": "pappydag",
    "rating": 9.5,
    "comment": "This game is one that you get lucky sometimes and your strategy works, and one that you get screwed other times because of being unlucky. Therefore, anyone can play, and it is funny and fun. Games are fairly quick, and I like the deckbuilding aspect. The setting is pretty fun, too, being a Quack.\n\nI like it now. I didn't like it at first because I would always lose and start accusing everyone of cheating, but after playing like 5 times, I started to win sometimes, which was a better sample size to make a judgement.\n\nUPDATE: yoooooo, playing 1v1 against my wife, Igot utterly destroyed for 18 rounds straight, unable to compete at all, virtually pulling white 80% of the time. BUT it turns out that my HANDS preferentially pull WHITE chips due to WHITE's inherently increased wear and oil deposition over multiple plays, so I lose due to BIOLOGY. We're gonna get coin caps to mitigate this. Otherwise, I found out that I can detect white chips out of the bag with about 80-90% accuracy.\n\n***used 21mm coin cases to mitigate this***",
    "timestamp": 1761692400
  },
  {
    "username": "joeincolorado",
    "rating": 9.6,
    "comment": "A genuinely fun experience. I truly love this game.",
    "timestamp": 1761084000
  },
  {
    "username": "Drb89_",
    "rating": 10.0,
    "comment": "Push your luck\nBag building\nRound events\nA bit of a setup\nOpportunity for great combos\nSatisfying turns",
    "timestamp": 1760911200
  },
  {
    "username": "Leonadter",
    "rating": 10.0,
    "comment": "11.5",
    "timestamp": 1760738400
  },
  {
    "username": "zxlitening45",
    "rating": 9.5,
    "comment": "Glad I own the original big box with Herb Witches + Alchemists and Wolfgang's Exchange Office. I just think that art style suits me better. I also put my tokens in coin capsules, and it's delightful.",
    "timestamp": 1758837600
  },
  {
    "username": "OGRussHood",
    "rating": 9.9,
    "comment": "My 2025 Top 250: #97\nMy 2024 Top 250: #69\nMy 2023 Top 250: #40\nMy 2022 Top 250: #23\nMy 2021 Top 250: #18\nMy 2020 Top 250: #21\nMy 2019 Top 200: #51",
    "timestamp": 1758492000
  },
  {
    "username": "Rhythm_Heaven",
    "rating": 10.0,
    "comment": "AMERITRASH\nCatch the Leader\nDeck, Bag, and Pool Building\nDelayed Purchase\nDice Rolling\nDie Icon Resolution\nEvents\nNeighbor Scope\nPush Your Luck\nScore-and-Reset Game\nSimultaneous Action Selection\nTrack Movement\nVariable Set-up",
    "timestamp": 1758232800
  },
  {
    "username": "awpTilla",
    "rating": 9.5,
    "comment": "This game is close to perfection.\nBest bag building game we've played so far. Sometimes very frustrating but super addictive. Great visual design and lots of replayability",
    "timestamp": 1757887200
  },
  {
    "username": "Tofessor",
    "rating": 10.0,
    "comment": "Geekup bit, bag and box sets",
    "timestamp": 1757714400
  },
  {
    "username": "Nought_Z3r0",
    "rating": 10.0,
    "comment": "Great game, was my first reintroduction to real boardgames again.",
    "timestamp": 1757368800
  },
  {
    "username": "jovack",
    "rating": 10.0,
    "comment": "Wonderful game, but get your hands on an original copy of \"Quacks of Quedlinburg\" if you can, the new art is dreadful.",
    "timestamp": 1756677600
  },
  {
    "username": "avrgLol",
    "rating": 10.0,
    "comment": "Love this game a ton, always a good time!",
    "timestamp": 1756418400
  },
  {
    "username": "diggerjag23",
    "rating": 10.0,
    "comment": "Great fun and surprisingly quick to play once you have a few games under your belt. May take 90 minutes with four, if \"faffing\" (analysis paralysis) is involved",
    "timestamp": 1756245600
  },
  {
    "username": "Boardgameplayer67",
    "rating": 9.8,
    "comment": "Very good game, very fun to play with family. The blues are to strong",
    "timestamp": 1756245600
  },
  {
    "username": "Dorothi",
    "rating": 10.0,
    "comment": "Ez mennyire jó játék. Vicces, fordulatos, totál szerencse alapú, de nagyon kikapcsol, mikor ezzel játszunk.\n2 és 4 fővel szoktunk vele játszani, mindkét játékosszámmal szuperül működik.\nEbben a társasban kb. semmit nem kell agyalni, erről gondoskodik a push your luck mechanika, de pont ettől jó.\nAnnyi negatívumot tudok felhozni, hogy:\n1.nagyon kopnak az összetevők, így be kell ruházni több száz db 21 mm-es műanyag védőre, enélkül nem is érdemes elkezdeni vele játszani\n2. rém ótvar a grafika, nagyon csúnya, de ezeket leszámítva remek darab, bátran ajánlom mindenkinek.",
    "timestamp": 1756159200
  },
  {
    "username": "jadilla21",
    "rating": 10.0,
    "comment": "The reprinting is AI slop.",
    "timestamp": 1755900000
  },
  {
    "username": "TheLimestoneCowboy",
    "rating": 9.5,
    "comment": "Rulebook Review: 6\n\nGAPING OVERSIGHT:\nDoes not explain that your brew is reset between rounds. ANYWHERE. Come on guys.",
    "timestamp": 1755727200
  },
  {
    "username": "Kuhni",
    "rating": 10.0,
    "comment": "Rating 1,9/45Minuten\n2-5/Best 4/8Jahre\n\nKräuterhexen 2,0/Best 3-5\nAlchemisten 2,3/Best 3-5",
    "timestamp": 1754690400
  },
  {
    "username": "CastiNation",
    "rating": 10.0,
    "comment": "Perfect to have fun.",
    "timestamp": 1754517600
  },
  {
    "username": "TheophilusRay",
    "rating": 10.0,
    "comment": "Ray",
    "timestamp": 1754344800
  },
  {
    "username": "Shaggy91",
    "rating": 9.5,
    "comment": "My gateway-game that opened the door to the wonderful World of boardgaming.",
    "timestamp": 1754258400
  },
  {
    "username": "Weirdsalmon",
    "rating": 10.0,
    "comment": "10/10: 2024 update: was #4 on the list and has dropped to #8. I love this game but Like my games to have a little more meat on them. Still my go to intro game that has brought so much joy.\n\nBag building push your luck game that I use as a gateway game for others and it never misses. It’s silly and fun and luckyyyyy!\n\nMany said Wonderlands War would kill this one, but I argue those people simply did not love this game enough.\n\nUpgraded geeked up bits are so so wonderful. I always enjoy the physical ownership of pulling chips trying to push my potion as far along as possible.",
    "timestamp": 1751925600
  },
  {
    "username": "samseite",
    "rating": 10.0,
    "comment": "(+) One of the best push your luck game.",
    "timestamp": 1751234400
  },
  {
    "username": "Brehm77",
    "rating": 9.9,
    "comment": "Have the Herb Witches, the Alchemists, and Wolfgang's Exchange Office expansions, Geek Up Bits acrylic tokens, felt rounded bags, and Meeple Realty wooden insert.",
    "timestamp": 1750975200
  },
  {
    "username": "Amazed64",
    "rating": 9.5,
    "comment": "Resin tokens\nSleeved",
    "timestamp": 1750888800
  },
  {
    "username": "codewizpt",
    "rating": 9.7,
    "comment": "Kallax: E1",
    "timestamp": 1750802400
  }
]