[
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "It's fine, though the deckbuilding kinda ruins the theme for me. Players spend years collecting every set to perfect their options, making this even more solitaire and isolating, and games depend on construction more than outwitting each other. I like the promise, just in practice they veered way more towards what Magic players want.",
    "timestamp": 1725055200
  },
  {
    "username": "Sengir_Nosferatu",
    "rating": 1.0,
    "comment": "lacks depth and to much randomness",
    "timestamp": 1714082400
  },
  {
    "username": "vinayplusj",
    "rating": 1.0,
    "comment": "Android: Netrunner has a notoriously steep learning curve. Building a competitive deck can be a daunting task for new players.",
    "timestamp": 1697148000
  },
  {
    "username": "durtschid",
    "rating": 1.0,
    "comment": "Hated this game so much, serious buyer's remorse. Glad I didn't purchase more than one expansion and will probably never buy another FFG LCG ever again.",
    "timestamp": 1588888800
  },
  {
    "username": "gamesafoot",
    "rating": 1.0,
    "comment": "AVOID. For computer geeks. Competitive",
    "timestamp": 1546383600
  },
  {
    "username": "Derivatus",
    "rating": 1.0,
    "comment": "Built on the premise of nothing. Either you try to break systems or you try to protect them. You'll succeed on some and not on others. If the essential systems get broken or not somebody wins. Is it me or is it my opponent? I don't care and not in a thiswasafunexperiencehahaha way.",
    "timestamp": 1544310000
  },
  {
    "username": "brendan126",
    "rating": 1.0,
    "comment": "Not my kind of game. Would play again if someone really wanted to but probably not the game I would ever chose to play again.",
    "timestamp": 1499983200
  },
  {
    "username": "teg2",
    "rating": 1.0,
    "comment": "Played once\nFor Trade",
    "timestamp": 1496527200
  },
  {
    "username": "icechamber",
    "rating": 1.0,
    "comment": "good game, but takes a lot of strategy starting with building the deck. I am in love with deck builders and was hoping this was one, but it is a card game where you build a deck before playing. The core set gets repetitive. So unless you plan on buying expansions skip this one.",
    "timestamp": 1488927600
  },
  {
    "username": "ZoeyWP",
    "rating": 1.0,
    "comment": "slow, boring, and expensive. I would normally give this game a two as it is technically a game, but the fanboys dictate that i must vote this a 1.\nGet your niche trash out of the top 20 already.",
    "timestamp": 1463263200
  },
  {
    "username": "asfhgwt",
    "rating": 1.0,
    "comment": "Run in the other direction! Now! (This kind of game is killing my interest in the hobby.)",
    "timestamp": 1461276000
  },
  {
    "username": "dwhite25",
    "rating": 1.0,
    "comment": "(If I wasn't so angry at how disappointed I am in this game after all the hype it got, I'd probably score it closer to a 3)\n\nNotice how many of the people who rated this game a 10 already played and loved the original.\n\nOne more example of a game loaded up so heavily on theme that the gameplay totally suffered. I really, really don't know why this game has gathered as much popularity as it has.\n\nIt should be noted that this is NOT a strategy game, it is a BLUFFING game.\n\nPros:\n-the theme is super cool\n\nCons:\n-for a deck-building game, the base game offers VERY little variety in how decks can be built. Expansions are desperately needed before the deck-building aspect starts to get even remotely interesting.\n-the theme is taken so seriously that you have to learn an entirely new vernacular just to learn the game (example: the deck of cards a player draws from is never called their \"deck\". It actually has a different name depending on whether you're playing the Corporation or the Runner - and you need to memorize the correct name for both, as cards will affect them)\n-once you look past all the theme, you realize the whole game is nothing more than the Runner randomly picking from a series of face-down cards and hoping he doesn't pick the wrong one\n\nIf you're really, really, REALLY into cyberpunk, go ahead and buy this game. Otherwise, The Lord of the Rings: The Card Game is better in terms of gameplay and in deck-building options, and its story-driven format is just as exciting thematically. If you really want to get into Living Card Games, my suggestion is to get into LotR rather than this one.",
    "timestamp": 1455490800
  },
  {
    "username": "meshnaster",
    "rating": 1.0,
    "comment": "I gave it a fair shot. I used to play Overpower, Magic, Pokemon, and Yugioh, as well as plenty of other games, so it's fair to say I understand how customizable card games generally work. The rule book is super difficult to understand, but I'm pretty sure we played it as intended (took a long time for the first couple of games).\n\nIt feels like there's way more stuff in the game than there needs to be. It might be fun if it were streamlined. But it's not, and it's not.\n\nThe runner died on his first turn during one of the games I played.",
    "timestamp": 1436220000
  },
  {
    "username": "jonnyutah",
    "rating": 1.0,
    "comment": "2 jugadores, cartas\nesto es Netrunner? Me aburrí bastante. Quizas la tematica esté conseguida pero no me atrae nada. LCG huid!",
    "timestamp": 1409522400
  },
  {
    "username": "wolfman69",
    "rating": 1.0,
    "comment": "http://www.boardgamegeek.com/boardgame/124742/android-netrun...",
    "timestamp": 1393023600
  },
  {
    "username": "Cornbreadx",
    "rating": 1.0,
    "comment": "I am giving this a 1 - not because it's a bad game or not well designed. It's because I am trying to offset the irrational curve that is set by fan-based popularity vs. true and actual ratings. Be my guest to investigate, but no other game on the charts has the same number of users rating it both 8 and 10. You will also notice that every other game has a bell curve distribution where as this game does not. Proves my view that this game is rated where it is not because of objective reviews, but of fan-based wet dreams being satisfied in theme. The game is not all that. It's OK for what it is.",
    "timestamp": 1386543600
  },
  {
    "username": "lofung_hk",
    "rating": 1.0,
    "comment": "you need TWO base set and so many expansions to have a good experience in deck building? and the default corporation is so hard unless the runners are retarded you can almost never win?'\n\nthis is a scam.",
    "timestamp": 1373320800
  },
  {
    "username": "cosmin augustin",
    "rating": 1.0,
    "comment": "all FFG games stink",
    "timestamp": 1372111200
  },
  {
    "username": "Peepser",
    "rating": 1.0,
    "comment": "Hype purchase. Big mistake. When will I learn to avoid BGG rankings? I give myself a '1' for that. The game also gets a '1'. Huge box filled with air. Requires expansions, requires deckbuilding, requires interest in the theme. Could not get one person interested in playing due to the extremely narrow and dry theme. Might be a good game in here (doubtful, as it is built for expansion purchases) but we will never know because of obstacle 1) lack of theme interest. Soon realized I could not get into the theme either, and looking at the cards and their artwork was the height of tedium. I did play the original in 1996. Times change, pc's and their 'mystique' were somewhat interesting in the early years of the internet, now they seem like stale and crash ridden remnants of the past on the way out due to tablet supremacy. That makes this theme an exercise in nostalgia that is 20 years too late. A waste of time (going to store, trying to learn it, trying to find someone interested) and money. Sold. It doesn't help that I hate my PC. It crashes, it loses my data, it's always been a headache. I have virtually zero positive associations with it over the years, unlike my ipad. This game reminds me of my PC. I spend enought time on it. Being reminded of my PC and its problems over the years through a 'game' is actually very unpleasant and not relaxing at all.\n\nBought 'Star Wars LCG' and theme interest at least got it to the table. That one gets an '8' as it does not remind me of my PC.",
    "timestamp": 1367359200
  },
  {
    "username": "Merlija",
    "rating": 2.0,
    "comment": "Expensive and overrated TCG.",
    "timestamp": 1757800800
  },
  {
    "username": "Beastly_Venturer",
    "rating": 2.0,
    "comment": "3 plays. I see why others like it but could never be bothered investing the time.",
    "timestamp": 1736550000
  },
  {
    "username": "vejrum",
    "rating": 2.0,
    "comment": "Played casually out of the box it is about getting the most out of a random stream of cards with lots of special powers; plus blind bluffing and outguessing. If you are into deck construction and \"tournament\" play it may be interesting and very good, but I am not so this is not at all for me.\n\nObjectively, the game is probably much better than my personal very low rating, but as I have absolutely no interest in playing it again so be it.",
    "timestamp": 1724450400
  },
  {
    "username": "Thatsnotme",
    "rating": 2.0,
    "comment": "Kort i mapper",
    "timestamp": 1682719200
  },
  {
    "username": "Lord Leuber",
    "rating": 2.0,
    "comment": "As a big MTG fan for many years I was enthusiastic when I picked this up in a thrift store. However the first and only play was deeply disappointing. Compared to MTG, it really felt like pitting two “starter decks” from that game’s early era against each other. The decks have little synergy and useful cards mixed with crap (think Serra Angel vs Gray Ogre). So the answer is to either really get into the game, MTG tournament style, and buy lots of it. Or, just forget about it and sell it off.\n\nBeing called a LCG, I had hoped the playability out of the base box would be a lot better and more interesting. I guess high ratings are justified if you are into the game. I also think 2 is a fair rating for just the base box in terms of play experience.",
    "timestamp": 1676847600
  },
  {
    "username": "NormandyWept",
    "rating": 2.0,
    "comment": "I was disappointed with this as it gets some great reviews. I've only played 7-8 times, all with the starter decks, and found it a bit frustrating. Not interested in buying all the cards and the tournament scene, so it's firmly behind one-box card games like Race for the Galaxy for me.",
    "timestamp": 1633557600
  },
  {
    "username": "thiago_gm",
    "rating": 2.0,
    "comment": "Very high complexity with an awful rulebook, instead of calling things as they are, (draw pile, hand of cards, discard pile) everything has made-up names that makes it incredibly hard to understand. Could be a decent game but fails miserably at the first step, teaching how to play.",
    "timestamp": 1626645600
  },
  {
    "username": "Davidalurie",
    "rating": 2.0,
    "comment": "Turns out I am not a fan of Living Card Games. I don't actively dislike them (like I do CCGs) but, nevertheless, they're not my cup of tea.",
    "timestamp": 1577919600
  },
  {
    "username": "benbrooky13",
    "rating": 2.0,
    "comment": "At its best, this is an exhilarating game that is unparalleled. However, most times it's just a grinding slog of setting up beneficial trades and general taxation. Mixed with FFG issues of LCG design, balance, distribution, it's something I don't want to play ever again and I was happy to place my collection in the recycling bin.",
    "timestamp": 1558476000
  },
  {
    "username": "BooChihuahua",
    "rating": 2.0,
    "comment": "Too unbalanced between the two players.",
    "timestamp": 1556402400
  },
  {
    "username": "kickingleaves",
    "rating": 2.0,
    "comment": "I hate this game. Not worth the price at all; as much as the dynamics are great, it is absolutely too complex to actually satisfy a basic need for fun.",
    "timestamp": 1553036400
  },
  {
    "username": "Elvive5",
    "rating": 2.0,
    "comment": "Sold airecon5",
    "timestamp": 1552172400
  },
  {
    "username": "oninoyakamo",
    "rating": 2.0,
    "comment": "I just don't like Android: Netrunner. Its LCG nature makes for the possibility of enthusiasts being able to make powerful decks capable of crushing new players. Plus, A:N's confusing nomenclature makes it really difficult to introduce to first-timers. I like the sci-fi theme, but find the game dull.",
    "timestamp": 1544396400
  },
  {
    "username": "vikings40",
    "rating": 2.0,
    "comment": "Ridiculously complex game....",
    "timestamp": 1541718000
  },
  {
    "username": "blu_in_green",
    "rating": 2.0,
    "comment": "Android: Netrunner – What Lies Ahead (2012)",
    "timestamp": 1522965600
  },
  {
    "username": "ThomTech",
    "rating": 2.0,
    "comment": "Nem rossz kétszemélyes kártyajáték, de számomra kicsit túl sztárolt",
    "timestamp": 1517785200
  },
  {
    "username": "saiharris",
    "rating": 2.0,
    "comment": "Not my cup of tea at all... Replace it with D&D and I could have been sold on it",
    "timestamp": 1503093600
  },
  {
    "username": "JoeLangdale7",
    "rating": 2.0,
    "comment": "Couldn't learn the game as the rule book was a bit confusing and used lots of in game terms all the way through it.\n\n\nWhen I was finally taught it I don't think I was taught it very well or enthusiastically.",
    "timestamp": 1497304800
  },
  {
    "username": "doctoryes0",
    "rating": 2.0,
    "comment": "Possibly the least fun game in the BGG top 100.\n\nOver and over I hear essentially the same thing from fans, \"You have to buy two base sets and some expansions and play it a lot of times to get into it\".\n\nWhy? Why do I have to do all that? Was it that crazy of me to think I could pay money, open the box and find a fun game inside?",
    "timestamp": 1493416800
  },
  {
    "username": "cheshire_cat",
    "rating": 3.0,
    "comment": "I do not like pvp deck constructors.",
    "timestamp": 1752616800
  },
  {
    "username": "p00q",
    "rating": 3.0,
    "comment": "Nice card game, and I enjoy the idea of the LCG, but it still creates an imbalance in the sides very frequently that other more self contained games do not have.",
    "timestamp": 1744668000
  },
  {
    "username": "camidon",
    "rating": 3.0,
    "comment": "I appreciate the asymmetrical gameplay and think this is a pretty well constructed game. However, I just don't want to play it, or take the time to learn the rules, and I don't like LCGs for the same reason I don't like CCGs. Good for some, not for me.\n\nTRADED",
    "timestamp": 1734908400
  },
  {
    "username": "quietcorn",
    "rating": 3.0,
    "comment": "Learning to play a hidden information game where only one of the two players has hidden information is rough. I would have to play this game a ton more to even begin to understand what a good move looked like and why, and the experience of playing doesn't inspire that kind of time and effort investment in me. Any game with deckbuilding is going to be an uphill battle for me anyway.",
    "timestamp": 1716415200
  },
  {
    "username": "NurseMichael",
    "rating": 3.0,
    "comment": "Very complex, hard to learn. Needs to be dived into.",
    "timestamp": 1716156000
  },
  {
    "username": "NadiaTrue",
    "rating": 3.0,
    "comment": "Objectively good. But it's absolutely unlearnable for anybody who isn't already really good at games like this (which I am not).",
    "timestamp": 1709766000
  },
  {
    "username": "ToomanyBarts",
    "rating": 3.0,
    "comment": "Not for me",
    "timestamp": 1706828400
  },
  {
    "username": "popeyewynn",
    "rating": 3.0,
    "comment": "David",
    "timestamp": 1703631600
  },
  {
    "username": "JimM",
    "rating": 3.0,
    "comment": "Christmas Gift 2012! After only a few games, it is still just OK... but we are still learning it, and only using the two \"suggested\" learning decks. We will move on to other decks soon.\n\nSOLD Jan. 24, 2022",
    "timestamp": 1693173600
  },
  {
    "username": "coverman",
    "rating": 3.0,
    "comment": "Maybe I am just not a fan of the theme but this game couldn't keep my interest",
    "timestamp": 1686088800
  },
  {
    "username": "Philgamer",
    "rating": 3.0,
    "comment": "Don't like.",
    "timestamp": 1683842400
  },
  {
    "username": "turtler7",
    "rating": 3.0,
    "comment": "Will probably increase score after I get more playtime in and find out if the higher strategies are more fun. As it was with starter recommendations there were too many \"well it is or it isn't\" gambles that will end the game with one player as the winner and the other as loser but not much strategy went into the decision (for example hitting traps off the random deck or hitting a scoring agenda to finish the 7 points off - neither player controlled which occurred the runner just knew one was likely to happen accessing the top 3 cards.)",
    "timestamp": 1676761200
  },
  {
    "username": "johnnytruant",
    "rating": 3.0,
    "comment": "This used to be one of my favorite games, until they decided to continuously change cards WITHOUT printing new ones! And then, they made deck-building ridiculously complicated with the NAPD Most-wanted List (So dumb). This was a clear example of the cure being worse than the disease. More playtesting was clearly required. Things shouldn't be this imbalanced. Balance first. Then, print.",
    "timestamp": 1669849200
  },
  {
    "username": "omnitheus",
    "rating": 3.0,
    "comment": "3 plays\nToo confusing for me. Glad I never got into it.",
    "timestamp": 1640818800
  },
  {
    "username": "wham",
    "rating": 3.0,
    "comment": "Dead game",
    "timestamp": 1630447200
  },
  {
    "username": "dingo154",
    "rating": 3.0,
    "comment": "Game was fine but felt like a money sink as new expansions and data packs came out you needed to keep up if you wanted to be competitive. Hard to find people to play with casually.",
    "timestamp": 1623016800
  },
  {
    "username": "Jarikv9",
    "rating": 3.0,
    "comment": "jack",
    "timestamp": 1620079200
  },
  {
    "username": "skifreak737",
    "rating": 3.0,
    "comment": "Pointless getting into this money pit unless you want to either give your life to it or have someone you can play casually with -- but why? :-)",
    "timestamp": 1598997600
  },
  {
    "username": "sxvuq4o3w4xy7xi8nw67",
    "rating": 3.0,
    "comment": "Absolutely loved the theme, but could not stand the game play.\nVery much a disappointment. Kept the game in my cabinet for about 5 years hoping to like it at some point. Finally sold it off. Would not play again. Love other deck building games though...Star Realms, Clank, Dominion....this game just did not work for us.",
    "timestamp": 1594677600
  },
  {
    "username": "shmonkey",
    "rating": 4.0,
    "comment": "Not bad, but not my favorite thing to play. Consider selling my copy. WIll play occasionally with a friend upon request\n\nDeep strategy but im not interested enough to explore that strategy. Trading to a friend because my ideas on exploring hte game didn't pan out",
    "timestamp": 1759874400
  },
  {
    "username": "TrevorJr26",
    "rating": 4.0,
    "comment": "Netrunner is impossible for me to rate accurately as I never put in the time or effort required to get anything out of it. If you have an opponent or a meetup in mind, and are willing for this to be the main thing you play for the foreseeable future, then you might have an incredible time.\n\nBased on reading all the cards and minimal play, I can say it seems like a great 'one of these' - a unique one even. I'm sure if you were part of the scene in 2013 then you had an absolute blast. Right now it has all the negatives of getting into Magic, but with a tiny fraction of the people to play it with. Good luck to the next owner, I hope you show these cards a good time.",
    "timestamp": 1747864800
  },
  {
    "username": "TuMadre101rk",
    "rating": 4.0,
    "comment": "Overview:\nAndroid: Netrunner is a 1v1 Living Card Game (LCG) from the same designer of Magic: The Gathering. The gametime is about 45 minutes.\n\nPros:\n- Both sides play the game in completely different ways\n- Players get to create their own decks\n\nCons:\n- Barrier to entry is incredibly high\n- Rules are extremely complicated for no good reason\n- Elements of the game have ridiculous names (deck/hand are something like stack/heap, and are different on both sides)\n\nConclusion:\nI think if you got into this game early and you play it with others that's awesome. I just don't think I can really teach this to others. This game could really use a huge rework.",
    "timestamp": 1737932400
  },
  {
    "username": "DanFred",
    "rating": 4.0,
    "comment": "I'm probably not being fair to review this game after only playing it once, while still not knowing a lot of what to do, but while I would give the game another chance play two or three more times to get a better feel for it, my inkling is that Android: Netrunner is not a game for me. It seems like it will take a lot of study and time to understand the game, which is fine by me, but with the level of luck and dependence on card draws mixed with that, as well as deck building I do not think Android: Netrunner is going to be a game I enjoy. I do like it more than Magic: The Gathering, which I don't enjoy at all, but so far The King of Tokyo is the only game from this designer that has been a hit for me.",
    "timestamp": 1735686000
  },
  {
    "username": "Grobbs",
    "rating": 4.0,
    "comment": "A few expansions in the box\n\nSell price: $30",
    "timestamp": 1735254000
  },
  {
    "username": "ciceroni",
    "rating": 4.0,
    "comment": "would love to really dig into it but the first couple of plays were too arduous to get me hooked",
    "timestamp": 1729288800
  },
  {
    "username": "MRomeo99",
    "rating": 4.0,
    "comment": "I \"should\" like the theme.\nI've tried to like the game on multiple occasions.\nIt turns out, I just don't like the game.",
    "timestamp": 1725746400
  },
  {
    "username": "kiwipaul",
    "rating": 4.0,
    "comment": "a specialist game, not for me",
    "timestamp": 1722463200
  },
  {
    "username": "ferengi4",
    "rating": 4.0,
    "comment": "Its rulebook is bigger then it needs to be. Because of the amount of text it has for rules it makes the game sound a lot more complex then what it really is and could have easily been made into a two page rule book instead of a 40 page rule book...",
    "timestamp": 1720130400
  },
  {
    "username": "Dark_Mirror",
    "rating": 4.0,
    "comment": "Similar to Pagan I didint like the bluffing element and the discarding or picking at random from your opponents Hand. Theme is cool.",
    "timestamp": 1716933600
  },
  {
    "username": "queerchameleon",
    "rating": 4.0,
    "comment": "N/A",
    "timestamp": 1713218400
  },
  {
    "username": "Aselan",
    "rating": 4.0,
    "comment": "I don't get, what is supposed to be interesting and good with this game. Played it 15 times, but couldn't find interest",
    "timestamp": 1712700000
  },
  {
    "username": "Gyges",
    "rating": 4.0,
    "comment": "It is a game where you want action efficiency, and that's about all there is to the game. Given that that might often rely crucially the order in which you draw your cards, I don't see much to offer here. In short, it is showing its age from back when CCGs were sloppily designed and rather simplistic.\nAnd seriously, the overly baroque terminology is stupid.",
    "timestamp": 1702854000
  },
  {
    "username": "cepalmer",
    "rating": 4.0,
    "comment": "Play partner didn't take to the theme or the confrontational nature of the game. Ever expanding card pool also was a turn off.",
    "timestamp": 1688335200
  },
  {
    "username": "alchemyocelot",
    "rating": 4.0,
    "comment": "The game has an excellent basic mechanism, but was broken by the expansion spam.",
    "timestamp": 1669244400
  },
  {
    "username": "Vexingdevl",
    "rating": 4.0,
    "comment": "I played one game with a friend years ago before I got deep into board games. It was cool and very different from games I knew at the time, but not intriguing enough to play again. It deserves a revisit now that I'm more fluent in the hobby.",
    "timestamp": 1668121200
  },
  {
    "username": "hungbasilisk",
    "rating": 4.0,
    "comment": "I enjoyed this game but didn't want to spend a lot of money buying the expansions so I never got to experience the deck building component so I probably missed a lot of what makes this game fun.",
    "timestamp": 1666908000
  },
  {
    "username": "joakim589",
    "rating": 4.0,
    "comment": "Played it two times. Not my thing. Quite boring.",
    "timestamp": 1663884000
  },
  {
    "username": "Mayasty",
    "rating": 4.0,
    "comment": "First play: Jinteki vs Shapers - the recommended setup for newbies and big, big disappointment. The corporation has put 4 ICEs into one slot and treated it as an incubator for consecutive projects. It succeeded to complete 3 projects in this one slot heavily protected by ICEs and gained easily 5 VPs. As a runner I couldn't do anything with this. The 4 ICEs barrier was too strong and too expensive to break through. So, the only what I could do was keeping my continuous attacks on R&D and HQ (only 1 ICE at each) and praying for the successes in random cards draws. So, more than half of the game was pretty repetitive and boring for me. Finally I won, because I was lucky enough to draw project cards from R&D and HQ but such a stupid, random victory is completely unsatisfactory.\n\nI suspected, that maybe we were playing wrong, but I read the entire rulebook once again and all was correct. Unless the other decks bring some more options for the runner I will think that this concept is completely broken. The obvious strategy for corporation is to built one \"incubator\" for all consecutive projects, secure it with 4 - 5 ICEs and laugh in runner's face as he won't be able to get through them.\n\nThe play would have been much more interesting if the runner had had the tools to remove installed ICEs or if the ICEs had had to be removed after each project scoring or theft when the server slot got emptied.\n\nI'm giving 4, because I like the flavour though.\n\nUpdate after next plays. We stopped our next duel Wayland against Gabriel Santiago about 15 minutes before the end due to our common frustration and the feeling that this is a waste of time. Simply saying this game is all about the sequence of Agenda cards in R&D deck and the luck of drawing them and is far too luck dependent for my taste.\n\nPlaying Gabriel Santiago I was heavily and helplessly struggling to do something reasonable during first few rounds due to bad luck in cards draws (even after Mulligan). Wayland has followed my suggestions from before the play and started the game with putting 2 ICEs to each of his R&D and one remote server in first 2 rounds and few moments later started advancing the first project. I didn’t have any icebreaker matching any of those ICEs so I couldn’t attack both R&D and remote server. The only what I could do was just continuously collecting the credits and cards. Once I got the right icebreaker Wayland managed to complete 3 projects with points 1, 2, 2. They were just very cheap to advance, so he could advance one Agenda completely in one turn, while I was still struggling to draw the icebreaker. Can you imagine my frustration?\n\nOnce I’ve got proper icebreaker I’ve started continuous attacks on Wayland’s R&D turn by turn. Wayland didn’t have any project in remote server at this moment, so this was the only reasonable option to chase him for points. BTW: It’s worth to mention that at this moment we both collected so much credits that their common pool has almost run out. So I had enough cash to rally again and again through 4 ICEs at R&D. And you know what? In 3 or 4 such attempts I’ve drawn 2 Agendas 3 points each, within less than 10 minutes, while Wayland needed almost 30 minutes to collect his 5 points. That was enough for my opponent and he said this was bloody, stupid random game challenged with tones of useless texts on cards that only distract your attention from the very luck dependent mechanism. He smashed the cards on the table and we both agreed to stop this.\n\nSo concluding. The idea and flavor are brilliant and this is the reason I gave this game 3 chances after first play which was very poor (normally I would have forgotten it after the first play). But the realization is far from ideal. This game is packed up with dozens of tiny nuances, heavy texted cards with intertwined exceptions to the main rules. But in fact is all about the luck in draws of the Agendas from R&D in right order. You can wait 30 minutes to draw 3 Agendas with total 5 points, but you can be lucky enough to draw 2 for 6 points in 10 minutes. In the first glimpse the game looks like serious strategical game but it’s only mirage. Cards driven mechanism makes it almost unpredictable. There are moments that you can only helplessly observe the hostile actions of your opponent and you can’t do anything because at this particular moment you don’t have anything useful on hand.\n\nCompare it with any of Legendary series (my favourite is Legendary Bond). Legendary doesn’t even pretend to be serious challenging game. It's just pure luck fun. But I like it much better. I’m sorry. I really did my best to like \"Android\" but in my opinion it doesn’t work and is just not my taste. The rate remains at 4.",
    "timestamp": 1654380000
  },
  {
    "username": "VincentDarlage",
    "rating": 5.0,
    "comment": "Traded Colt Express for this game. Haven't played it since 2016 (9 years ago). Never got the hang of it. Sold it, 6/28/25, at Bored Games Silent Auction.",
    "timestamp": 1759269600
  },
  {
    "username": "FranzK",
    "rating": 5.0,
    "comment": "I played this once years ago - I liked it but didn’t understand it well enough or get a chance to explore in enough depth. Only played as a runner, not as a corp.",
    "timestamp": 1758405600
  },
  {
    "username": "sykano",
    "rating": 5.0,
    "comment": "interesting remake of an old TCG from Richard Garfield as LCG (Great that FFG did that!)\nhas some unique mechanics and feel\ncool Hacker vs. Corporation theme, but not for everyone\nreplayability and variability isn't that great ?\n\ndiscontinued in 10/2018 for some reason",
    "timestamp": 1753567200
  },
  {
    "username": "Legatus_Lemming",
    "rating": 5.0,
    "comment": "Best Player Count: 2",
    "timestamp": 1745704800
  },
  {
    "username": "Antura_V",
    "rating": 5.0,
    "comment": "T",
    "timestamp": 1744236000
  },
  {
    "username": "natlas",
    "rating": 5.0,
    "comment": "If you love deck-building games, cyberpunk themes, and strategic mind games, Android: Netrunner is your perfect match. This asymmetrical two-player card game has you take on the roles of a megacorporation or a rogue hacker, each with unique strategies and tactics. The game offers deep strategic play, constant bluffing, and intense decision-making, all set in a gritty, futuristic world. If you’re into cyberpunk and enjoy a challenge, this one will keep you hooked for hours—say hello to your new favorite game!",
    "timestamp": 1741734000
  },
  {
    "username": "Gia187",
    "rating": 5.0,
    "comment": "Magic the gathering in een ander universum.\nSpijtig genoeg spreekt dit thema mij veel minder aan . Het is zeker leuk en een 'watergate-actige' benadering van het spel. Zo zijn er veel manieren mogelijk om te bluffen en soms bepaalde ice-walls te installeren voor een kaart met heel weinig waarde.\nDat de decks customizable zijn zie ik wel veel replayability in als je daar graag tijd en efoort insteekt om ze dan uit te testen.\nDe reden waarom ik denk dat dit spel een hoge score heeft, is de moeilijke instapgraad. Vele gamers zullen pas dit spel aanschaffen (wat trouwens een veel hogere complexity heeft in mijn ogen als je deckbuilding erbij neemt) wanneer ze het echt willen spelen. De instapgraad is zo hoog , dat je het enkel koopt als je het met zekerheid kapot wil spelen .\n\nHet enige betere en positive tov. MTG is dat de kaarten zelf in het begin alllemaal aanwezig zijn. Zo is het niet dat een andere persoon waar je tegen speelt een beter deck heeft omdat hij er meer geld heeft ingestoken. De regels benadrukken zelfs dat de kaarten waartoe jij kan beschikken ook beschikbaar zijn voor de andere speler (de kaarten komen van dezelfde uitbreiding maar dan voor ofwel de runner of de corporation). Ik ben dan ook veel meer geneigd om een LCG te kopen dan een TCG.\nOok hier zijn talloze uitbreidingen zoals FFG het meermaals doet.",
    "timestamp": 1739833200
  },
  {
    "username": "FranklinTV",
    "rating": 5.3,
    "comment": "Only one play, but I do like this a lot (Rating 8, Jan 15). UPDATE This is one game I would really like to get into, as It's a nice asymmetrical 2 player game (Rating 8.323 Jan 17). UPDATE: Pub Meeple Ranking Engine Dec 2020 (Rating: 6.324). UPDATE: The Great Xmas 2024 Cull. Look, it might have been the Netrunner tattoo that Quinns had on his arm that convinced me to keep this as a \"one day I will get to it\" type game, but I never did. Went out of publication, but in May 2024 bought the fan made clone System Gateway in a small box to retain a link - smaller in size (but obviously art not as good). Regardless, lets see if I get around to play that small deck of cards instead. (Rating 5.323, Nov 2024)",
    "timestamp": 1732662000
  },
  {
    "username": "TapZxK",
    "rating": 5.0,
    "comment": "Needs to be Sold",
    "timestamp": 1731193200
  },
  {
    "username": "tscox87",
    "rating": 5.0,
    "comment": "Not really my style of game. Found the hacker a bit random to play and was frustrated I couldn't advance meaningfully towards my victory conditions. I prefer MTG",
    "timestamp": 1730415600
  },
  {
    "username": "zosocoheed",
    "rating": 5.0,
    "comment": "A fine game its in own right, but leans too strongly to the meta. Beyond that, learning it is a pain, as they have propriety terms for all aspects, and if you have spent too much time between sessions, it means learning it from square one all over again.",
    "timestamp": 1728770400
  },
  {
    "username": "simon1990",
    "rating": 5.0,
    "comment": "Vendu au Bazar 2023",
    "timestamp": 1722463200
  },
  {
    "username": "Mack1993",
    "rating": 5.0,
    "comment": "Asymmetric Competitive LCG is a combination of keywords that makes for a game that requires commitment to enjoy. The gameplay is interesting and opens up powers and abilities that can be utilized through the cards. With all these barriers removed, I think this game is solid, but it wouldn't be something that I'd play over others in the head to head format.",
    "timestamp": 1720821600
  },
  {
    "username": "bdcroom",
    "rating": 5.0,
    "comment": "I like a lot of CCG's, was very fond of Magic. wanted to like this. Didn't Giving to Son.",
    "timestamp": 1716933600
  },
  {
    "username": "StevenKiel",
    "rating": 5.0,
    "comment": "Amazing Theme which gameplay ties into, doesn't save this game.",
    "timestamp": 1705100400
  },
  {
    "username": "bigchocolate69",
    "rating": 5.0,
    "comment": "Annoying rules to learn and not nearly as great as it's hyped up to be, I prefer Magic the Gathering.",
    "timestamp": 1704150000
  },
  {
    "username": "genresavvy",
    "rating": 5.0,
    "comment": "Fun concept but building two decks 1 for offense and 1 for defense felt like is missed the mark.",
    "timestamp": 1702940400
  },
  {
    "username": "wowbagger44",
    "rating": 5.0,
    "comment": "The terminology is highly thematic but makes learning and teaching difficult (each player has a different term for their hand/deck, etc.).\n\nVery cool design, actually, but \"playing\" seems to be much more about building your deck than what happens between you and the opponent at the table, and I just don't have the time/money/interest to engage with that",
    "timestamp": 1698966000
  },
  {
    "username": "Pandawan",
    "rating": 5.0,
    "comment": "Cycle 1 (Genèse) complet\nCycle 3 (Lunaire) complet - Honneur et Profit\nCycle 4 (SanSan) complet - Ordre et Chaos\nCycle 3 (Mumbad)- Destinées et Données",
    "timestamp": 1695679200
  },
  {
    "username": "Howlsthunder",
    "rating": 5.0,
    "comment": "I haven't played this enough or properly to have a good opinion yet. I can see the potential but don't think I have the time or people to play it enough.",
    "timestamp": 1694383200
  },
  {
    "username": "rexkow",
    "rating": 5.0,
    "comment": "Very good card game. Not symetrical, a lot of different decks if you want to get into it, and for me over all, the filling that you outplayed your oponent in mindgames.\nOn the other hand some games are kind of played by itself and the luck factor is present like in every game of this kind.\n\nIt is probably the sentiment but it didn't grab me like MTG did, even thought it is in my opinion a better desined game.\n\nSome time has passed and i find myself not wanting to play the game more often then not. All potential opponents are either hardcore Netrunner players and even when they give me a counter to their decks they crush me every time or they never played, teaching the game is very hard.",
    "timestamp": 1693692000
  },
  {
    "username": "Goblin_Magnus",
    "rating": 5.0,
    "comment": "2 C",
    "timestamp": 1692396000
  },
  {
    "username": "tamsynulthara",
    "rating": 5.0,
    "comment": "Cute asymmetrical concept, but I'm not a fan of LCGs. I prefer deckbuilders that don't allow you to customize a deck beforehand.",
    "timestamp": 1679612400
  },
  {
    "username": "Issoleie",
    "rating": 5.0,
    "comment": "It feels like even the base game which we solely own has endless depths to explore.",
    "timestamp": 1677106800
  },
  {
    "username": "Ldayjones",
    "rating": 5.0,
    "comment": "Still learning, rating may go up upon more plays",
    "timestamp": 1675465200
  },
  {
    "username": "el_dani",
    "rating": 5.0,
    "comment": "The game is good.\n\nI dislike the game box being much too big for the few cards inside. And you are forced to buy the start box twice or even three times to really start into the deck building.\n\nI know there is a big economical machinery behind this game, but why not giving all the cards in one start box?\n\nI don't mind for the booster packs (I even appreciate knowing before buying and having every card 3 times in them).",
    "timestamp": 1675465200
  },
  {
    "username": "supersiamesisk",
    "rating": 5.0,
    "comment": "Awesome game but the FFG format does not translate well into modern days. Lowered my initial rating of 9 to 5.",
    "timestamp": 1675292400
  },
  {
    "username": "Yokiboy",
    "rating": 5.0,
    "comment": "Holy crap, this game's first impression is fantastic! I loved the original's Cyberpunk 2.0.2.0. theme, but this one's gameplay is significantly improved. I may have to end up owning this game, just for personal deckbuilding if nothing else. It's one heck of a thrilling game, and I love the bluffing element.",
    "timestamp": 1668207600
  },
  {
    "username": "eunseob",
    "rating": 5.0,
    "comment": "Almost like learning vocabulary, but the first few games are not worth studying.",
    "timestamp": 1665957600
  },
  {
    "username": "Jefklak",
    "rating": 5.0,
    "comment": "My friend bought this LCG while I bought LoTR, to replace our MtG addiction. In the end, we both decided MtG is much better. Netrunner's rules kept on tripping us up and while the theme is great, I'm not enticed to play it again.",
    "timestamp": 1658613600
  },
  {
    "username": "Elocution Safari",
    "rating": 5.0,
    "comment": "Rating may go up as I play it more and get to know the decks better. I like the idea of the game.\n\nUpdate: Have not played in over two years. Right now LCG or CCG style games are not for me. This game may well be amazing, but I will never invest the time or money to explore this game in the way it was intended.\n\nFor trade or sale, played only twice with care, stored in a pet free smoke free home.\n\nEWC 2022 VFM $25.",
    "timestamp": 1657663200
  },
  {
    "username": "treebeardtheent",
    "rating": 5.0,
    "comment": "Too much of a learning curve, and I only have funds for one lifestyle game.",
    "timestamp": 1648335600
  },
  {
    "username": "CormorantLighthouse",
    "rating": 5.0,
    "comment": "Für uns ist es einfach zu konfrontativ und unnötig kompliziert gemachtt, nichts gegen das Spiel an sich.",
    "timestamp": 1643151600
  },
  {
    "username": "socialsnacker",
    "rating": 5.0,
    "comment": "I can see why people like this but I don't enjoy bluffing nearly enough to enjoy such a complicated and demanding game that revolves almost entirely around bluffing.",
    "timestamp": 1641423600
  },
  {
    "username": "broonski",
    "rating": 5.0,
    "comment": "Have a bunch of packs",
    "timestamp": 1633471200
  },
  {
    "username": "Deus_Ex_Machina",
    "rating": 5.0,
    "comment": "Only giving this game a 5 because it is complex enough to intrigue me. I only own the base game, so I am only going to rate that. Having played quite a bit of MTG or the Star Wars LCC etc, I was naturally interested in A:NR - and this also heavily influences my rather mediocre rating of this game.\n\nAfter about 12-15 games, I just feel like there is so little direct interaction in this game. It can be dragged out to a a very long playtime if the runner stays passive. And even though bluffing and a certain amount of luck in games are great, it seemed to me that there were way too many games won by lucky draws after HQ/R&D runs or the runner trying to tap the wrong of 2 seemingly equal servers.\n\nThis probably gets better when you have more cards thus more options to build more synergistic decks, but the base game didn't convince me. It's actually noticably long when you play carefully and down to guessing if you play it risky.\n\nThis is to be taken with a grain of salt, of course - i am judging this (probably unfairly) through thr eyes of a person that has come to dislike the execution (not the idea) of tcg/lcg/ccg etc. Maybe I've not given NR the attention it deserves, maybe I'd just need to invest in a few expansions to get more of what I want... But to be honest, Netrunner didn't intrigue me enough to do so.\n\nIt's by no means a bad game. I'm just writing this because I am really surprised how much hype it gets.",
    "timestamp": 1615676400
  },
  {
    "username": "Pandorzecza",
    "rating": 5.0,
    "comment": "Nie moje klimaty",
    "timestamp": 1614812400
  },
  {
    "username": "Janasik",
    "rating": 5.0,
    "comment": "I remember having so much fun with this game. The asymmetric sides, along with the unique factions give each game a different feel. It's a great game, and I think it represents Fantasy Flight at its prime. I personally am just not as into deckbuilding now, and it's gotten harder to find opponents for this game. The game's rules are a little tricky, and it can take a bit of commitment from both players for this to shine.",
    "timestamp": 1610751600
  },
  {
    "username": "Jackieh9",
    "rating": 6.0,
    "comment": "It's like star realms where you're battling against each other but much more complex - asymmetric and you build your deck in advance. And cards have lots of text / options. Glen taught me at EQ",
    "timestamp": 1762645080
  },
  {
    "username": "dj_koen",
    "rating": 6.0,
    "comment": "I dont really like the aestetic but the gameplay is good\n\nThough a lot of cards can feel finicky",
    "timestamp": 1759528800
  },
  {
    "username": "lswaage",
    "rating": 6.0,
    "comment": "3/2017 Will participate in casual play. The Android world is interesting, fun and futuristic. Netrunner is well integrated with possibilities for great depths.\n\nReceived 18/9-2013 from BookDepository.co.uk",
    "timestamp": 1759183200
  },
  {
    "username": "Paladin4269",
    "rating": 6.0,
    "comment": "6.4",
    "timestamp": 1757541600
  },
  {
    "username": "eminency",
    "rating": 6.0,
    "comment": "I'm not a good player for 1 vs 1 games generally.",
    "timestamp": 1757541600
  },
  {
    "username": "ditterio",
    "rating": 6.0,
    "comment": "I've done my best to like this game but I can't. I tried it with a friend at a games club in Oosterzele but I\ndidn't see what made this game so special. All I saw were the many key words and a cat-and-mouse card game that didn't suit me.",
    "timestamp": 1755208800
  },
  {
    "username": "Mushmo",
    "rating": 6.0,
    "comment": "I see the appeal. I did t play enough to get hooked though. I will need to give this one another shot. For now I have to grade it on my experience though.",
    "timestamp": 1753567200
  },
  {
    "username": "Tygrone",
    "rating": 6.0,
    "comment": "Fun 2p game for those who are into mtg but want smth different",
    "timestamp": 1751839200
  },
  {
    "username": "trixits",
    "rating": 5.8,
    "comment": "Keeping it for now... but ugh. Can't get it to the table. Too many rules, too much iconography/complexity. Only playable with experienced players... and pretty rough if mismatch in experience.",
    "timestamp": 1750716000
  },
  {
    "username": "Desiderata",
    "rating": 6.0,
    "comment": "1v1 card game similar to Magic: The Gathering (same designer), yet doesn't suffer from the collectible aspect or the \"land problem\" its predecessor did.\nBoth sides play very different from each other, and the game seems pretty solid so far.\nRating lowered a bit, as I'm just never very excited to play this. I have zero desire to construct my own deck(s), and I'm fairly indifferent about the game itself.\nMy 6 rating is on the gameplay itself. If I had to rate it based on both deck construction and gameplay, then I'd drop it to a 5 max.",
    "timestamp": 1750197600
  },
  {
    "username": "Idiot_for_Life",
    "rating": 6.0,
    "comment": "Best at 2\nShort-length game.\n1v1 asymmetrical card game that pits a runner setting up gear to hack into a Corporations firewall.",
    "timestamp": 1748296800
  },
  {
    "username": "Brutilus",
    "rating": 6.0,
    "comment": "Only gave it a 7 because I've only played it once.\n\nThat play was with someone that plays regularly and looks forward to curb stomping noobs.\n\nNeed to give it another shot.\n\nEdit: I've played it again. Still not a fan. I can see why people like it, but it just doesn't work for me.",
    "timestamp": 1741647600
  },
  {
    "username": "snth",
    "rating": 6.0,
    "comment": "We started playing this again lately. Rating 6: \"will play if in the mood\" is perfect for how I feel about it because sometimes I really do want to play it, even though most of the time it's the game of amazing moments punctuated by tedious rebuilding. I would like this much more as a sealed game so maybe it's time to build a cube or battle box or jumpstart situation.\n\nAlso \"competitive + LCG\" turned out to be a combination I hated. No singles market, lack of cube or kitchen table formats, a \"need to buy everything\" mentality…\n\nAlso there's a pirated version by Null Signal Games. Now normally I endorse and promote proxying, piracy, DIY, PNP etc but in this case they've made their version that only they can sell and they only upload low-rez versions for janky home proxying. Also they post unpaid job positions while still selling cards for profit. The silver lining with them is how they have at least a lot of cards and themes that promote social justice. One person in our playgroup buys their cards but he lets us play with \"Eternal\" decks vs his standard rotation decks and that comes out pretty even.",
    "timestamp": 1736118000
  },
  {
    "username": "Matouffe",
    "rating": 6.0,
    "comment": "Want to like it, but...",
    "timestamp": 1735426800
  },
  {
    "username": "OldSoulDean",
    "rating": 6.0,
    "comment": "I played this countless times before I started tracking plays. However, after discontinuation and no longer having a community to play with, it made sense to get rid of this game. Didn't help that you had to keep buying to keep the game current as well.",
    "timestamp": 1731625200
  },
  {
    "username": "timori",
    "rating": 6.0,
    "comment": "I know jinteki exists. I know nisei is keeping the scene alive. But picky me needs an official app or online way to play with the fidelity of a Hearthstone or MTG arena to get back into it. And if I do, this rating will probably shoot up to a 10. There really isn't any other card game like this and it's absolutely fantastic. I just didn't find the enjoyment going to a weekly meetup. And for this type of game which really requires you to buy into your local community, it's just not my scene.",
    "timestamp": 1731452400
  },
  {
    "username": "FireDragonDoL",
    "rating": 6.0,
    "comment": "Overly complex rules, hard to remember and follow",
    "timestamp": 1727820000
  },
  {
    "username": "Rocket2961",
    "rating": 6.0,
    "comment": "Sold at coulee con 2024",
    "timestamp": 1724018400
  },
  {
    "username": "AFABBI",
    "rating": 6.0,
    "comment": "Really good asymmetrical 2 player card game by Richard Garfield (designer of mtg) once you get through the steep learning curve. Thematically cool with hackers and big corporations fighting a cyber war. Art is really good too. I just don't get it to the table because I tend to play games with higher than two player counts so this great game has sat on my shelf gathering dust. I haven't kept up with the expansions and like other living card games, that can lead to less inclination for me to want to play anyway as I would want to buy the rest of the sets and learn the ins and outs.",
    "timestamp": 1724018400
  },
  {
    "username": "noobcitizen",
    "rating": 6.0,
    "comment": "I admit, I don't have the intelligence to figure out how this game works",
    "timestamp": 1719784800
  },
  {
    "username": "Harroguk",
    "rating": 6.0,
    "comment": "The game is good but not really a fan of outside of the game deck building.",
    "timestamp": 1719525600
  },
  {
    "username": "dieterminator",
    "rating": 6.0,
    "comment": "PNP",
    "timestamp": 1719007200
  },
  {
    "username": "buderix80",
    "rating": 6.0,
    "comment": "I like the mechanism and the theme.",
    "timestamp": 1718143200
  },
  {
    "username": "pakman2000",
    "rating": 6.0,
    "comment": "This was partly an issue of audience fit. I bought netrunner when it was the new hotness, circa 2013. I knew I didn't want to have to follow a competitive meta and invest in new card packs, but the core set was marketed as being robust enough to operate as a standalone game. Nope, it wasn't. After four or five pitifully boring sessions with my partner, I sold it again.",
    "timestamp": 1717711200
  },
  {
    "username": "skraem",
    "rating": 6.0,
    "comment": "1 play. Lost terribly as the corporation. I liked it!",
    "timestamp": 1712268000
  },
  {
    "username": "PlanForPlanB",
    "rating": 5.9,
    "comment": "Richard Garfield, Lukas Litzsinger",
    "timestamp": 1709766000
  },
  {
    "username": "Xstream",
    "rating": 6.0,
    "comment": "I like the concept and ideas, but in practice it just doesn't really flow all that great. The main issue I have with It is the luck of the draw. You could get completely stuck on defense if you keep drawing barriers, while offense can crack it (and create repetitive actions/strategy) or vice versa when you can't hack you're way in because you can't get the right programs.\n\nIf the cards click it can be really exciting, but many times it's been of in my experience. Also the manual could have been a bit clearer, especially in some overviews. I've been stuck on Virus counters for instance because pretty much nothing of it is in the book. Had to Google it. But thematically It all makes sense, so once in your system, It's clear.\nI feel this game Is too much work where luck then can still kill all the effort you've put In. That's a combo I don't like.\n\nVery original, super thematic and well made otherwise though. I guess I respect the game more than having fun playing It.",
    "timestamp": 1702508400
  },
  {
    "username": "MatroidX",
    "rating": 6.0,
    "comment": "Pros: Theme, components and art, the asymmetry leads to interesting play from both sides (bluffing from corp, tension/anticipation of a run from runner's side). The different faction styles add a lot of replayability and mechanism exploration (especially the 3 runners; a couple corporations seem less strong in their setup or feel imo).\n\nCons: After dozens of fun games I'm finding the draw of the deck is deciding things a lot more often than I'd like. For instance, runner needs to get past one piece of ice, but is stuck until draws that icebreaker. Or corp has a hand of all agendas (later on; I know about initial mulligan). Or either player hasn't drawn any financial cards for a long while, and so can't do anything: advance/run, rez/install, etc (Jinteki seems overly weak in core for that reason). For that reason, I'm finding my toughest decisions in the game are whether to install so-so cards, or spend all my actions drawing to hopefully get a good card. I would rather my tradeoffs between strategies/cards in my hand be tougher, and draw be less dominating.\n\n[I watched some youtube videos of championship games, and yes, they spend most of their turns just drawing from the deck.]\n\nAlso the cards in core range from ridiculously powerful to pretty useless, and often it's how many good cards you have available, which again leads back to the draw. I haven't explored the deckbuilding aspect yet, but plan to do so soon... maybe that will help.\n\n(I'm not a fan of pay-to-play, so sticking with core + 1 expansion pack unless the game gets much better with deckbuilding.)\n\nUpdate: Dropped quite a bit over time. I feel like experiencing the flavour of each faction was fun, but not enough meat on the bone.",
    "timestamp": 1702335600
  },
  {
    "username": "Vrayloki",
    "rating": 6.0,
    "comment": "Fairly complex to learn. Found this level of direct competition and complexity quite stressful to maintain. Might feel easier after multiple plays.",
    "timestamp": 1701903600
  },
  {
    "username": "pridurki",
    "rating": 6.0,
    "comment": "cool twist on magic. it was fun, but would take a lot of time to get used to. designers borked it, so perhaps a new version that gets back to the roots would be good.\n\nplays: 2",
    "timestamp": 1700175600
  },
  {
    "username": "bricksii",
    "rating": 6.0,
    "comment": "ANR had such a solid foundation for a CCG but hemmed itself in with a couple design decisions (rotation, the particulars of multi-faction deck construction) that snuffed it. I don't play it anymore but I am glad there's a community-lead project for supporting it.",
    "timestamp": 1699916400
  },
  {
    "username": "supervalkyrie",
    "rating": 6.0,
    "comment": "Cull Pile?",
    "timestamp": 1697839200
  },
  {
    "username": "BangkokRobert",
    "rating": 6.0,
    "comment": "Gameplay seems fun with the starter decks. Played both Corp and Criminal. But I would not fancy buying new cards and doing the deckbuilding. There was a lot of rule consultation, even for simple terms. Seems unecessary complex. I still believe that the card \"Pad Campaign\" is a typo.",
    "timestamp": 1696629600
  },
  {
    "username": "Luds",
    "rating": 6.0,
    "comment": "(Godboma.com @ Ludo-Outaouais 2012, 2012-11-24)\n\nVery fun card game, the asymetrical side makes it very interesting. A very good 2 player game.\n\n(Sold to user Vuud, 2013-04-12)",
    "timestamp": 1695938400
  },
  {
    "username": "ToBakai",
    "rating": 6.0,
    "comment": "Kein schlechtes Spiel, ist aber im Vergleich zu Marvel Champions dem Arkham Horror oder auch dem Herr der Ringe LCG eher nicht so stark.",
    "timestamp": 1692223200
  },
  {
    "username": "firstfletch",
    "rating": 6.2,
    "comment": "Price: $40\nFFG",
    "timestamp": 1688508000
  },
  {
    "username": "tyclone",
    "rating": 6.0,
    "comment": "Based on NISEI.\n\nI greatly appreciate the innovation in this game for CCGs. I really like the action-based system.\n\nOn the other hand, the game can feel a little too much luck-based for my tastes, especially when the runner randomly snipes the right card. I also found situations where the game kinda stalls out, especially when the runner plays passively.",
    "timestamp": 1686261600
  },
  {
    "username": "beaniebee",
    "rating": 6.0,
    "comment": "I'm shockingly bad at this game",
    "timestamp": 1685570400
  },
  {
    "username": "jeffrey_a_meunier",
    "rating": 7.0,
    "comment": "Randomness figures heavily in this game, but it doesn't detract from the fun.\n\nOh, god, I hate the slang terms. It's like a kid trying to be cool by inventing words that already have words for them. No cap it makes me want to yeet this game. Thank you, all the other game designers, for not doing this.\n\nYeah, I know, it's supposed to add to the theme.",
    "timestamp": 1761778800
  },
  {
    "username": "Acholt22",
    "rating": 7.0,
    "comment": "I enjoy the game, but it is hard to teach and hard to fully grasp.\n\n~Rob and I combined our collections to form 1 collection.",
    "timestamp": 1761343200
  },
  {
    "username": "parpari",
    "rating": 7.0,
    "comment": "It is like MTG but with brain and balance gameplay. It is a heavy card game with very thematic feeling. However; It is too rule heavy and combotastic head to head game for my liking.",
    "timestamp": 1761343200
  },
  {
    "username": "TommyBolinFreak2112",
    "rating": 7.0,
    "comment": "Sleeved",
    "timestamp": 1760997600
  },
  {
    "username": "armando vicioso",
    "rating": 7.0,
    "comment": "todas ampliaciones",
    "timestamp": 1760824800
  },
  {
    "username": "ImZhe",
    "rating": 7.0,
    "comment": "Could rise with more plays",
    "timestamp": 1759960800
  },
  {
    "username": "Ddyraw",
    "rating": 7.0,
    "comment": "Really great card game with a great hook, I see why people love it, but I just cant get it tabled.",
    "timestamp": 1759442400
  },
  {
    "username": "Bkoons",
    "rating": 7.0,
    "comment": "w/ A Study in Static, Creation and Control, Cyber Exodus, Data and Destiny, Double Time, Fear and Loathing, Future Proof, Honor and Profit, Humanity's Shadow, Mala Tempora, Opening Moves, Order and Chaos, Second Thoughts, Trace Amount, True Colors, What Lies Ahead.",
    "timestamp": 1759269600
  },
  {
    "username": "mjacobsca",
    "rating": 6.5,
    "comment": "It was fine, probably good, but I never gave it a serious chance because I didn't want to have to buy all the card packs.",
    "timestamp": 1759096800
  },
  {
    "username": "Rogon",
    "rating": 7.0,
    "comment": "H",
    "timestamp": 1757628000
  },
  {
    "username": "Drrabbits",
    "rating": 7.0,
    "comment": "A beast to teach, clever cardplay. Unique asymmetry. *SOLD* *purchased NISEI system gateway for casual play*",
    "timestamp": 1756677600
  },
  {
    "username": "ItsMagic",
    "rating": 7.0,
    "comment": "expandable mastering theatrical surprising positioning constructing bluffing stealing ready fantastical unlocking sustaining bidding continuously educating;\nAshes: Born of the Phoenixborn? favoured;\nfavoured over Sorcerer?, Heroes, KeyForge, Codex, Blue Moon Legends?",
    "timestamp": 1755208800
  },
  {
    "username": "SkipTheWave",
    "rating": 7.0,
    "comment": "Played NISEI version. It's great but my 2nd experience ended so unbelievably anticlimactically that I am hesitant to get into it.",
    "timestamp": 1754690400
  },
  {
    "username": "Schwartzkopf",
    "rating": 7.0,
    "comment": "(12/9/13) A 10! -.25 for the amount of time I spend BEFORE a game constructing decks. I know some people love that, but it detracts a bit for me since I have a hard time setting aside time to do that.\n\n(3/20/14) I've played many many games of this since my last rating, many in person and even more online. It's really fun. BUT - down to 7.75 now. I find myself more and more wishing that I was just playing a nice long board game instead of quick matches of this LCG. It really is a lifestlye game, and I think I'm just tiring of it a little. Still really like playing, but it's not a 10 anymore.\n\n(sometime later) I sold all this to someone. My gaming partner outpaced me in skill and this is a game thats only fun when you play someone of equal skill (in either direction). sigh",
    "timestamp": 1753308000
  },
  {
    "username": "ueyinnafesh",
    "rating": 7.0,
    "comment": "익숙해지면 재밌는 불친절.",
    "timestamp": 1753308000
  },
  {
    "username": "Qhorin",
    "rating": 7.0,
    "comment": "Great 1st play. Feels truly asymmetrical yet balanced. Fun theme and fast gameplay.",
    "timestamp": 1752703200
  },
  {
    "username": "alvinsimms",
    "rating": 7.1,
    "comment": "*\nVery good to excellent condition. Cards separated and boxed. Also includes one neoprene play mat.\n\nDefinitely feels tense playing, as the pressure of asymmetrical play is brought to bare. I need to get this to the table more often.\n\nExpansions I own include: What Lies Ahead. True Colors",
    "timestamp": 1752530400
  },
  {
    "username": "Bunraku",
    "rating": 7.0,
    "comment": "+ Kontrolle und Schöpfung",
    "timestamp": 1752530400
  },
  {
    "username": "Nadialove",
    "rating": 7.0,
    "comment": "2 p",
    "timestamp": 1752012000
  },
  {
    "username": "Zhovijalno",
    "rating": 8.0,
    "comment": "Fascinating. Never felt attracted to Magic so it was only through this design that I learned to appreciate Garfield. What a way to use cards! Basic game works just fine – we started making custom decks only after more than 50 plays, than reverted back to pre-made ones and the play was equally good. Pity it is a LCG so without further investment it is hard to find players apart from spouse and newcomers. Fast, unpredictable, yet strategic. The theme also attracts me so I've even read some of the novels although they are lousy SF and more like crime dramas.\nBrilliant game - fast, asymmetric, rewarding, bluffing rich, a bit economic, highly interactive...",
    "timestamp": 1762652040
  },
  {
    "username": "ArktusFrost",
    "rating": 8.0,
    "comment": "PnP Nisei",
    "timestamp": 1762383600
  },
  {
    "username": "skylerblue77",
    "rating": 8.0,
    "comment": "Better than Magic.\nThe fact that Null Signal hasn't been added as one of the publishers should be a crime.",
    "timestamp": 1762383600
  },
  {
    "username": "thepinch",
    "rating": 8.0,
    "comment": "played only once, need to re-rate after play",
    "timestamp": 1761951600
  },
  {
    "username": "goonzo",
    "rating": 8.0,
    "comment": "@work",
    "timestamp": 1760652000
  },
  {
    "username": "krivalis",
    "rating": 8.0,
    "comment": "Gina",
    "timestamp": 1760565600
  },
  {
    "username": "mingrkli",
    "rating": 8.0,
    "comment": "Welcome to the New city of the future! I give you the city that never sleeps because it’s too busy streaming. Rising above it all is The Beanstalk humanity’s shiny monument to progress (and corporate greed, depending on who you ask). From their cozy skyscraper thrones, NBN beams out everything your overstimulated brain could ever crave music, threedee shows, breaking news, sitcoms, old movies, and the kind of sensies that make you question reality and stuff XD. Humanity’s sprinting into the future at light speed!\n\nAndroid: Netrunner is a two-player cyberpunk showdown where one side plays as the all-powerful megacorporation, and the other plays as a lone runner trying to burn it all down from the inside.\n\nIf you’re the corp, your job is to push secret agendas through the system before those pesky hackers ruin everything. You’ve got money, power, and ICE layers of digital security that range from polite firewalls to “oops, you just lost half your brain” sentries. Your servers are your kingdom, and you’d better guard them like your stock price depends on it (because it does).\n\nIf you’re the runner, you’re broke, brilliant, and one bad decision away from permanent neural damage. You’ll scrape together cash, rig up hardware, and build programs sharp enough to slice through the corp’s defenses. Every run is a high-stakes heist maybe you’ll expose a secret agenda, maybe you’ll fry your brain. Either way, it’s personal.\n\nFirst to seven points wins… but “winning” in this world usually means limping across the finish line with some bad publicity and a smoking cyberdeck.\n\nNetrunner has changed through out the years, this was a very fun CCG (Collectable Card Game) that me and buddy played for so long. Sadly my buddy kind of moved away so my physical copy was kind of sold XD. This CCG ended at 2018 sadly but there are fans out that that are still updaing the game still to this day like fan-made expansions which is pretty cool \n\nSo jack in, grab your deck, and get ready to dance on the razor’s edge between genius and meltdown. In the network, information is power and someone’s always watching. :eye::floppy_disk::zap:",
    "timestamp": 1760479200
  },
  {
    "username": "badassbr",
    "rating": 8.0,
    "comment": "O jogo é incrível mas senti que precisava gastar muito dinheiro com expansões para ter um deck bom, acabei vendendo antes de gastar muito dinheiro.",
    "timestamp": 1760220000
  },
  {
    "username": "atomfeed",
    "rating": 8.0,
    "comment": "-Impresión: \n-Mecánicas\n-Aspecto\n-¿Lo volverías a jugar?: \n-Opinión personal: \n\nBuena partida de iniciación. No descarto recomprarlo algún día cuando encuentre a alguien para jugarlo de nuevo.",
    "timestamp": 1759960800
  },
  {
    "username": "tatooinehermit",
    "rating": 8.0,
    "comment": "Gameplay-wise, Netrunner is probably my favorite ever. I don't know how, but it manages to deliver the thrill and immersion from bigger games in a lunch break. I love the theme, the art, and the flavor texts. It's unfortunate that LCGs as a system is not for me.",
    "timestamp": 1759442400
  },
  {
    "username": "swornabsent",
    "rating": 7.5,
    "comment": "Started out great, took some pretty fatal design turns.",
    "timestamp": 1759183200
  },
  {
    "username": "spixel",
    "rating": 8.0,
    "comment": "2-er\nKEEP",
    "timestamp": 1759183200
  },
  {
    "username": "bvongunten",
    "rating": 8.0,
    "comment": "Superb cardgame, great theme.",
    "timestamp": 1758492000
  },
  {
    "username": "freechinanow",
    "rating": 8.0,
    "comment": "Android: Netrunner was the first LCG that I ever played, and frankly I wasn't ready for it. I think I was immediately put off by the idea that part of the game necessitated building decks and dumping way too many hours of one's life into considering the meta game and best options. I enjoyed it, but didn't think it was all that great enough to invest serious time into. Fortunately, I found myself playing quite a few hours of Warhammer: Invasion, Lord of the Rings: The Card Game, and Game of Thrones: The Card Game. I found myself enjoying deep, rich card game mechanics and also building my own decks to face off against friends and family. So when I came across an Android: Netrunner set at a thrift store, I felt ready to give it a go again. I'm happy to say that it's everything I wanted it to be. Excellent balance of theme and mechanisms. A rugged and thoughtful system of asymmetry. And a rich space for deck-crafting. Too bad the whole game is discontinued now. I have the first two waves of expansions (plus their big boxes). I know I could get into System Gateway, but I like having the OG. And I think there's enough in here for me to explore while also keeping my eyes out for old-timer players looking to finally part with their sets.",
    "timestamp": 1758232800
  },
  {
    "username": "MarcoAlderich",
    "rating": 8.0,
    "comment": "9",
    "timestamp": 1757887200
  },
  {
    "username": "speery",
    "rating": 8.0,
    "comment": "Absolutely the best card game I've ever played Netrunner brings together two asymmetrical factions in digital warfare and immerses the player in a Gibson-esque future where data is valued more highly than life.\n\nMade even better by conversion to the LCG format over the CCG.",
    "timestamp": 1756850400
  },
  {
    "username": "mekane",
    "rating": 8.0,
    "comment": "I'll admit that I don't fully get it. I want to, and I'd like to have a player base to enjoy the game with. Unfortunately I don't.",
    "timestamp": 1756850400
  },
  {
    "username": "Lazarus72",
    "rating": 7.8,
    "comment": "Card Game",
    "timestamp": 1756764000
  },
  {
    "username": "Biitseli",
    "rating": 8.0,
    "comment": "S",
    "timestamp": 1756504800
  },
  {
    "username": "FrancoisX",
    "rating": 9.0,
    "comment": "Steep learning curve but the game is addictive. My favourite faction is the Anarchs so far",
    "timestamp": 1762470000
  },
  {
    "username": "ibarker3",
    "rating": 9.0,
    "comment": "Replaced with Nisei decks",
    "timestamp": 1762297200
  },
  {
    "username": "Whisklaw",
    "rating": 9.0,
    "comment": "Once you overcome the hurdle of the game terminology and the asymmetrical differences of the two teams, it reveals a unique card game with elements of bluffing, action management and combos. Find a nerd friend and have a great time",
    "timestamp": 1760911200
  },
  {
    "username": "RussPSmith",
    "rating": 9.0,
    "comment": "Phenomenal head-to-head matchup which offers opportunities for cleverness, thematic storylines, asymmetric shared experience, and the joys common to all semi-collectible deckbuilders of solo crafting when opponents aren't available. One of the greats of the genre.",
    "timestamp": 1760565600
  },
  {
    "username": "zamorh",
    "rating": 9.0,
    "comment": "Rating for FFG's Netrunner in general. Amazing game with so much player skill.",
    "timestamp": 1760479200
  },
  {
    "username": "Elysian1196",
    "rating": 9.0,
    "comment": "Man this game is fun! I could totally see myself diving into the deep, interweaving strategies possible through deckbuilding on either side! As a MTG lover, obviously this game scratches a lot of the same itches. I'd recommend for beginners to just get System Gateway and System update 2021, a collection of staple reprints from the original game. You don't really need any other cards to last you a long time.\n\nI have a few problems with this game though. First, I hate the use of lore-friendly terms for everything. The fact that both the corps and runners have both decks and hands but they are named different things really annoys me. Makes learning the game arbitrarily much more difficult. Which leads to my next problem that this game has a very high skill floor since it requires deckbuilding and learning two complex asymmetric roles, making it really hard to find someone who would be willing to go the distance with you. And that's not even considering that it's officially out of print!\n\nIf you ever do wanna take that hurdle though with someone else equally committed, this game is worth it.",
    "timestamp": 1759960800
  },
  {
    "username": "ultimoratio",
    "rating": 9.0,
    "comment": "UPDATE: Re-iterating that this is one of the best card games ever. Even in casual play. So if you buy a 2nd hand copy of this and just play with the starters, you'll find more depth there than most modern games.\n.\n==================\nThis entry is indicated as \"own\" as I own the NISEI starter set\n\nI really do like the different Runner and Corporation decks, which makes you play differently. I love the bluffing and hidden information game. Nothing is more satisfying than cracking a 3-layer defence as a Runner.\n\nInteresting asymmetric 2 player game. I end up preferring to play Summoner Wars though. But this is still great",
    "timestamp": 1759960800
  },
  {
    "username": "GamechangerWithHoney",
    "rating": 8.8,
    "comment": "Very interesting game concept. but didnt Like illustrations.",
    "timestamp": 1759874400
  },
  {
    "username": "revloc06",
    "rating": 9.1,
    "comment": "Played a ton back in the day, amazing asymmetric game, afraid to see what the current expansions look like, I'm sure the power creep has gotten out of control compared to when I first play...still an amazing game, if you can filter though what you should all purchase to play.",
    "timestamp": 1759442400
  },
  {
    "username": "Analytical",
    "rating": 9.0,
    "comment": "[Adult - Weight:Expert - Players:2 (Best:2) - Size:Medium - Time:20min]\n\n*Secrete Unit Deployment / Competitive*\n\nAn asymmetrical battle between hackers and evil corporations. Fresh setting and game play. If you love LCG/TCGs with deck building you should try it.\n\nSadly FFG has let this die and we need to get new content trough the community.",
    "timestamp": 1759269600
  },
  {
    "username": "gengar1205",
    "rating": 9.0,
    "comment": "Include 1 Null signal",
    "timestamp": 1759010400
  },
  {
    "username": "Talyth",
    "rating": 9.0,
    "comment": "Revised core set edition (2018)",
    "timestamp": 1758492000
  },
  {
    "username": "ThumbOfGod",
    "rating": 9.0,
    "comment": "The best card game. Ever. The gambit involved in this game is brilliant and gives way to your imagination and creativity. Truly a game that encourages you to win with strategy while beeing able to read / disorient your opponent. Some decks are better, but require skills to use anyway.\nA gem.",
    "timestamp": 1757973600
  },
  {
    "username": "Spockolowski",
    "rating": 9.0,
    "comment": "I adore this game! The asymmetry, the rich theme, the bluffing, the deception, and the varied gameplay between the different runners and corps are amazing. It’s everything I love in a strategic showdown. Sadly, it’s tough to get it on the table. I really only play with one person, and while we’ve kept up with Null Signal Netrunner, we decided to stop after the first two expansions. There's something magical about knowing all the cards, but having enough variety to have some replayability. We just don't have the time to commit to further cards.",
    "timestamp": 1757973600
  },
  {
    "username": "Curatesegg",
    "rating": 9.0,
    "comment": "B&B? £15",
    "timestamp": 1757800800
  },
  {
    "username": "Arial_Narrow",
    "rating": 9.0,
    "comment": "Solamente he jugado unas pocas partidas con mazos básicos. Me parece uno de los juegos de cartas competitivos mejor diseñados y sin duda el más temático. Me gustaría probar más expansiones para ver la profundidad que alcanza.",
    "timestamp": 1757109600
  },
  {
    "username": "elbirbo",
    "rating": 9.0,
    "comment": "Check out our review at: https://boardgamegeek.com/video/108488/android-netrunner/and...",
    "timestamp": 1756677600
  },
  {
    "username": "DaMaHa",
    "rating": 9.0,
    "comment": "➤ 2 (Best: 2)\n➤ 45 (Set-Up: 5, Teach: 20)\n➤ 3.40 (Mid-Heavy)\n╰┈➤ System Gateway - Remastered Edition, Elevation\nTAGS: DeckConstruction, HandManagement",
    "timestamp": 1756418400
  },
  {
    "username": "Raiders32fan",
    "rating": 9.0,
    "comment": "Only played a handful of times with starter decks. Absolutely loved the gameplay. Core Set plus, What Lies Ahead data pack.",
    "timestamp": 1756245600
  },
  {
    "username": "serscop",
    "rating": 9.6,
    "comment": "Non conoscevo questo gioco di carte collezionabili ma leggendo che c'era di mezzo il creatore di Magic (Richard Garfield) mi sono spinto a saperne di più. Dopo un approccio palesemente complesso, distante dalle strategie digerite in altri card games con meccaniche astratte tra le fazioni, il gioco mi ha pian piano conquistato. Richiede attenzione, acume nella costruzione dei mazzi utilizzati ma la cosa divertente oggi è che questo gioco risulta \"gratuito\". Abbandonato da FFG è passato in gestione a un gruppo di giocatori che apporta periodicamente aggiornamenti nelle meccaniche, pubblicando varie espansioni scaricabili (PnP). Ci si può giocare tranquillamente anche in virtuale online su un sito dedicato al gioco (jinteki) che si aggiorna puntualmente con nuove espansioni e cicli.\nBellissima esperienza ludica!",
    "timestamp": 1762210800
  },
  {
    "username": "josh2550",
    "rating": 10.0,
    "comment": "Very rich and skill intensive game. I've played a lot of ccgs/lcgs, and this is the best designed of them all, by far. A few of the card designs are imbalanced, but it is easy to just agree to not play with them, or use the official ban list, etc. There are a massive number of cards available, so it is no big loss.\n\nAlso, I don't see people do it much, but in my opinion the game plays really well in limited formats, by making your own randomized piles/packs for draft or sealed deck play.\n\nKudos to Null Signal for continuing to develop the game. Despite being shelved by FFG years ago, the game still has a sizable and devoted following, including a tournament scene.",
    "timestamp": 1762124400
  },
  {
    "username": "player43572398",
    "rating": 10.0,
    "comment": "Undoubtedly the best card game ever created in history. As players, we are fortunate to have fan-made content developed by Nullsignal Games to keep this game thriving. I highly recommend playing this game.",
    "timestamp": 1761692400
  },
  {
    "username": "Molotail",
    "rating": 9.8,
    "comment": "First Edition",
    "timestamp": 1761606000
  },
  {
    "username": "CplTrim",
    "rating": 10.0,
    "comment": "What a joy it was, playing Netrunner with friends, getting into it, getting good at it, getting too many cards, finding the whole thing starting to collapse under its own systems, going back to the start again and self-limiting the pool of cards available, and all the time leaning in to the tension of each game, bluffing, playing cautiously, playing boldly, circling round each other until finding a weak spot and then pouncing. What a game.",
    "timestamp": 1761606000
  },
  {
    "username": "Bahdom",
    "rating": 10.0,
    "comment": "Just the NSG stuff now (including System Gateway)",
    "timestamp": 1761519600
  },
  {
    "username": "RJayz",
    "rating": 10.0,
    "comment": "Full collection up to Elevation cycle",
    "timestamp": 1760997600
  },
  {
    "username": "BrianZX1982",
    "rating": 10.0,
    "comment": "Plus full Genesis cycle, Team Covenant premium tokens, revised core set, just about everything that NSG have done and three neoprene play mats. (I like this game…)",
    "timestamp": 1760824800
  },
  {
    "username": "Sketcherrrr",
    "rating": 10.0,
    "comment": "The best integration of mechanics and theme that I've ever seen.\n\nThis is the game that I wish I could play more of in person. Went down the rabbit hole on Jinteki and quickly fell in love with the game.\n\nHaven't made the jump outside of the starter cards, but hope to one day when I can play more consistenly.\n\nNo pressure on my son, but this is the game I hope we play together when he gets older.",
    "timestamp": 1759960800
  },
  {
    "username": "Josh123212321",
    "rating": 10.0,
    "comment": "Its like Magic: The Gathering, but with asymmetric factions and bluffing, and fun !",
    "timestamp": 1759874400
  },
  {
    "username": "StalkerB",
    "rating": 9.5,
    "comment": "3 copies",
    "timestamp": 1759615200
  },
  {
    "username": "lswaage",
    "rating": 10.0,
    "comment": "10/2022 Fantastic asymetric tense game. Excellent community initiative by Null Signal Games keeps the game alive. (Rating 6->10)\n\nPrint & play\n\nSystem gateway\nElevation\netc....",
    "timestamp": 1759183200
  },
  {
    "username": "cortexjackal",
    "rating": 10.0,
    "comment": "I have almost x2 complete collections of A-NR, including the last Kitara Cycle and R&R.\n\nWould potentially trade ANR stuff for the right game(s)",
    "timestamp": 1758664800
  },
  {
    "username": "nhmc",
    "rating": 9.5,
    "comment": "The Null Signal Games version (Elevation era) distils everything I love in board games about theme, interaction, strategy, bluffing, push your luck, and deck construction into a single package you can play in 45 minutes.\n\nOnly drawback is that the barrier to entry is quite high in terms of learning the game, so there aren't many people to play it with.",
    "timestamp": 1758405600
  },
  {
    "username": "rogedavi",
    "rating": 10.0,
    "comment": "Excellent game marrying chess and poker elements. Got into it competitively and played in the world championships finishing top 20.",
    "timestamp": 1758319200
  },
  {
    "username": "s010010",
    "rating": 10.0,
    "comment": "2 Spieler",
    "timestamp": 1757628000
  },
  {
    "username": "extatix",
    "rating": 10.0,
    "comment": "RIP, my sweet A:NR. I'll always hold this game dear. It's such an intriguing game, with a fantastic world built around it.",
    "timestamp": 1757368800
  },
  {
    "username": "Aftonkatt",
    "rating": 9.8,
    "comment": "2p hidden tableau",
    "timestamp": 1757196000
  },
  {
    "username": "Udruga Kockica",
    "rating": 10.0,
    "comment": "BID - 2 KOM",
    "timestamp": 1756936800
  }
]