[
  {
    "username": "ksmith78",
    "rating": 1.0,
    "comment": "Friends brought this and crushed me in it. Knew I was dead by the first couple turns. That is fine for others, but it was miserable for me. Games with skill gap should not be this long imo. No interest to keep playing this to get better.\n\nThe components were also bad imo. Card artwork was nice, but the price for the game doesn't match the prototype board art.\n\nHope others that enjoy this continue to enjoy it. Can easily see why people would like this.",
    "timestamp": 1749506400
  },
  {
    "username": "vikingcode",
    "rating": 1.0,
    "comment": "This is my second Splotter game, following on from Indonesia. While Indonesia was plagued with a substandard manual and terrible quality parts (the components should at least be able to fit onto the spaces the game tells you to put them on!), Food Chain Magnate thankfully avoids that terribleness, mostly. Paper money still isn't wonderful, but the rest of the components were passable, and the artwork (save for the shared map) were fine to bordering on good.\n\nHowever, this remains the only game where we genuinely couldn't finish the game - nobody wanted to, because after 3 hours we still hadn't really got to what people could describe as \"fun\" or \"the game\".\n\nLike Indonesia, FCM has a lot of neat ideas and mechanisms, but they never really landed. The game has so many ways to make you fail early into a very long, near event length game, so the first few rounds are preprogrammed - every did the first opening move, then 2 did the same second move, the other 2 did the other second move. For your first, second, maybe even third game you won't know the consequences of why that's a bad move until its been made and then you've sunk 12 hours over three plays to realise \"right, now I can have fun?\"\n\nJoris Wiersinga was quoted saying \"We think that it is important that every single turn should matter. If you cannot lose the game on the first turn, then the first turn should not be played\". And I think, ultimately, I agree. The first turn or five shouldn't have been played, because they were unfun, busy work where everything mattered and ultimately was boring.\n\nI think ultimately, Splotter games aren't for me or my group.",
    "timestamp": 1748815200
  },
  {
    "username": "khepriq",
    "rating": 1.0,
    "comment": "It's pricey for a Carcassonne flimsy made in China box game. You'd need to be privileged to play this.",
    "timestamp": 1745445600
  },
  {
    "username": "MouseWax",
    "rating": 1.0,
    "comment": ":angyface: :axe:",
    "timestamp": 1742425200
  },
  {
    "username": "USSRocker",
    "rating": 1.1,
    "comment": "The game is awful and partially broken.",
    "timestamp": 1739228400
  },
  {
    "username": "Olagarro",
    "rating": 1.0,
    "comment": "Extremely brutal, you can lose on the first turn",
    "timestamp": 1732748400
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "I dislike all the managing of cards into tableaus. Well I guess I'm the manager so I'm supposed to do that, it could be worse. It's just that it takes most of the attention away from the shared board, everyone's staring at org charts. And then the shared board isn't as flexible as I assumed, you can't alter roads or do silly things like that.\n\nBut then you get to the achivements, and then the game falls apart. This game is so serious compared to its silly cover! One player will probably get all of the money (huh?) and lock things up, so it's a backwards railroad game without the shared elements for everyone to look at, feeling tense about the others. Avert your eyes and stare at your personal boards! No wonder it's so popular.",
    "timestamp": 1720648800
  },
  {
    "username": "maalaala",
    "rating": 1.1,
    "comment": "Just greed",
    "timestamp": 1719180000
  },
  {
    "username": "cantbelikewater",
    "rating": 1.0,
    "comment": "Requires too much table space. Need to have played it one time just to learn timings, essentially spreadsheets the game.",
    "timestamp": 1709593200
  },
  {
    "username": "Blue_ocean_",
    "rating": 1.0,
    "comment": "Amazing in theory. In practice too hard to teach and get the game on the table.\n\nEven 1 person giving up midgame will ruin the game for all.",
    "timestamp": 1704063600
  },
  {
    "username": "MossGrande",
    "rating": 1.0,
    "comment": "Certain interesting mechanics and coherent aesthetics aside, pretty disappointing title. It has the worst case of snowball effect I've ever seen with players going from single points to hundreds over the course of few turns when left unchecked. First two - three actions player takes set the flow of complete game and if trey won't play out as intended, player is left to suffer for next three hours participating in a completely unwinnable game which effectively makes the rest of it irrelevant. On top of that, somehow even being the one player that is currently winning is not fun or satisfactory at all.\n\nCompetitive aspect is pretty much illusory in a 3 or 4 player game as engaging into conflict over resources or customers with any other player grants free hand to others - there is nothing to win and you merely waste your moves to waste moves of another person. Milestones present complete lack of balance, ranging from mandatory in first few turns to even stand a chance, through useless, all the way to ones that might harm instead of reward players. I believe a lot of problems are supposedly fixed in add-on, but releasing a very expensive \"DLC\" that makes game playable (when base one is pretty pricey to begin with) is a scummy tactic and should not belong to the board game business.\n\nEDIT: somehow every time I'm reminded of this poor excuse of a game I feel it's even worse than I remembered, so I come back to lower the score. Luckily, I cannot drop it down anymore.",
    "timestamp": 1703977200
  },
  {
    "username": "bg_sage",
    "rating": 1.0,
    "comment": "How to spend $400 on board games:\n\n1. Brass Birmingham $80\n2. Age of Innovation $100\n3. Great Western Trail 2nd Edition $72\n4. Dune Imperium Uprising $60\n5. Heat $80\n\nHow about you? No one sane would buy Food Chain Magnate at this price, what could you buy?",
    "timestamp": 1700866800
  },
  {
    "username": "showoo9",
    "rating": 1.0,
    "comment": "too punishing, need players with same leaning curve to enjoy this one",
    "timestamp": 1700780400
  },
  {
    "username": "mmueller03",
    "rating": 1.0,
    "comment": "Cheap components, bad art, poor game design...all at an artificially high price.",
    "timestamp": 1700694000
  },
  {
    "username": "Patoalvalc",
    "rating": 1.0,
    "comment": "Stupidly expensive, illogical",
    "timestamp": 1700694000
  },
  {
    "username": "farne123",
    "rating": 1.0,
    "comment": "Carissimo senza alcun senso. Non è il gioco piu' bello al mondo ma sicuramente è il piu' caro in rapporto al contenuto.\nResta dov'è e mi diventano immediatamente antipatici sti Splotter Spellen.\nAvidissimi",
    "timestamp": 1700607600
  },
  {
    "username": "Warxky",
    "rating": 1.0,
    "comment": "400€ TOTAL PRICE (after shipping + VAT).\n\nJust pure greed.",
    "timestamp": 1700607600
  },
  {
    "username": "Mechaniac",
    "rating": 1.4,
    "comment": "My review is : no.",
    "timestamp": 1682114400
  },
  {
    "username": "iBud",
    "rating": 1.0,
    "comment": "How can this even be a game?",
    "timestamp": 1678316400
  },
  {
    "username": "rayzg",
    "rating": 1.0,
    "comment": "I have to be an alcoholic to play this.\n\n======\n\nTorture. It makes me miss, no crave, features derided in Euros such as multiplayer solitaire and point salads.\n\n=======\n\nYes, still very unforgiving, but there are ways to mount a comeback if the lead player is a bit careless, which is easy as there is too much information to keep track of.\n\nThis game leaves a very bitter taste for new players because the game rubs it in your face for being unforgiving. Many turns involve one or two players fulfilling all the contracts on the board while others get zero -- for multiple turns. Also, the better you're doing, the more stuff you can do and afford, making the downtime for those not doing well atrocious.\n\n========\n\nApparently, I have a hard time limit when it comes to Euros: 90 minutes. This game goes way, way, way over. There are Euros that do something similar with a third of the play time.\n\nBig sin: Players can buy more turns in the game, which means that players doing better will have longer, more interesting turns than those doing poorly.\n\nAt least the board is more than a repository of cards to draft.",
    "timestamp": 1677538800
  },
  {
    "username": "theindigoprime",
    "rating": 1.0,
    "comment": "Formulaic, predictable, and boring.",
    "timestamp": 1668639600
  },
  {
    "username": "ej3ae",
    "rating": 1.0,
    "comment": "I really REALLY want to like this game thematically but it's mechanically it's just too ruthless and cerebral to be any fun to me whatsoever. I recommend other people give it a go but it's a hard pass for me.",
    "timestamp": 1663797600
  },
  {
    "username": "NoSoup4you",
    "rating": 1.0,
    "comment": "Fight me.",
    "timestamp": 1663711200
  },
  {
    "username": "CascadeHush",
    "rating": 1.0,
    "comment": "15",
    "timestamp": 1652306400
  },
  {
    "username": "kermitoos",
    "rating": 1.0,
    "comment": "ugly game that requires huge table and eagle eyes",
    "timestamp": 1640646000
  },
  {
    "username": "WrendyBird",
    "rating": 1.0,
    "comment": "Feels like work, so if you enjoy running a fast food chain, this is your game.",
    "timestamp": 1612825200
  },
  {
    "username": "Dimaus",
    "rating": 1.0,
    "comment": "too difficult and boring for me",
    "timestamp": 1603753200
  },
  {
    "username": "harkoning",
    "rating": 1.0,
    "comment": "yuk",
    "timestamp": 1582239600
  },
  {
    "username": "MYKERAN1965",
    "rating": 1.0,
    "comment": "Way over-priced. Hideously ugly and pointlessly complicated. Premise was amazing but horrible execution. It was perhaps one of the biggest board game rip offs I’ve ever experienced. Hate this game enormously.",
    "timestamp": 1562277600
  },
  {
    "username": "mdean",
    "rating": 1.0,
    "comment": "There is a lot going on in this game! Things happen fast -- well, not /fast/; unlike The Great Zimbabwe this game has a baked-in lag time between doing something and seeing the result -- but turns can be absolutely devastating. We're talking sledgehammer body blows here, folks. Turn order management may be more key than in TGZ. The money snowballs and will probably end the game a turn or two before you think, until you get used to it.\n\nCard racks are essential. Laminated milestone chart is essential. Foodstuff supply tracker is essential. I don't usually accuse games of being fiddly but this game is fiddly without the aforementioned items.",
    "timestamp": 1561240800
  },
  {
    "username": "nthbc",
    "rating": 1.0,
    "comment": "I had 3 play-throughs with AWFUL super-unfun play experiences. I LOVE the Tech Tree idea in the game. But the numerous \"I win on Turn 3\" but we keep playing for 1.5 hours with no means to catch up is highly unfun (notably things like Radio tower lock-down, multi-variate resource lockouts, CFO runaway). The ability to wholly and completely cock-block your only source of development and progression in the game creates a highly un-fun play experience. If you haven't played daily an experienced play will not just crush you but create a unpleasant play experience. You really need to play 2-3 turns in advance. There are some game boards the clearly favor a particular strategy and if you don't see it you just lose. Period. Too many AUTO-WIN situations that don't end the game - you keep playing watching your game deteriorate turn after turn. I have been a tabletop play-tester for more than 10 years with my name in the back of many games, and I question whether this game went through ANY play-testing at all! Those two words \"Auto-Win\" as a play-tester always raises a red mental flag for me. Consider in Chess, there isn't an auto-win strategy (otherwise everyone would do that). It is one thing to \"check\" in the middle of a game, and another to \"checkmate\" on turn 3, and a wholly new class of poorly design game that \"checkmates\" on turn 3 but you keep playing for 2 more hours watching your soul get crushed. BGG needs a new category of game mechanic: lock-out-i've-already-won-on-turn-3-but-hey-let's-play-for-another-2-hours-mechanic. See most games that do have a \"turbo-win\" path, are smart enough to end the game then and there (q.v. Fluxx, Paris connection = all players bee-line to Marseilles). So I'm going to call that outstanding example of poor game design, a new mechanic called the \"CRUSH YOUR SOUL\" mechanic.",
    "timestamp": 1548975600
  },
  {
    "username": "Frozen Flesh",
    "rating": 1.0,
    "comment": "I came here, because of all the people rating mature themed games like KD:M or Hate with a 1, just because of their mature theme.\nThis games theme is boring!",
    "timestamp": 1547074800
  },
  {
    "username": "Minkypool",
    "rating": 1.0,
    "comment": "The biggest rip off in boardgaming today! Royalty-free clip art, complete absence of graphic design, lowest possible grade components (paper money, Seriously!?), and then priced above most ultra premium titles. Even at minimum count print-runs there’s no way this flimsy pile of dung costs more than $5/unit to produce and should be retailing at $25 in its current form. Splotter should be ashamed of themselves and be boycotted in hoards.",
    "timestamp": 1539295200
  },
  {
    "username": "doug070564",
    "rating": 1.0,
    "comment": "not my thing, no fun will not play it again, this is after 3 plays",
    "timestamp": 1531173600
  },
  {
    "username": "avinyc",
    "rating": 2.0,
    "comment": "never again",
    "timestamp": 1757628000
  },
  {
    "username": "stephenfalconer1",
    "rating": 2.0,
    "comment": "illusion of choice, winner is obvious in first 1/3 of game. way to long with no catchup mechanism",
    "timestamp": 1757368800
  },
  {
    "username": "Litch04",
    "rating": 2.0,
    "comment": "Probably the only game I've ever played where I actively had a bad time playing it. The mechanic where other people can leach off your advertising is stupid. The lack of any randomness means players are never forced to think reactively and you can easily get in an unwinnable position with hours of game left. I can appreciate what they were going for and some aspects of the physical product, but I never want to play this again.",
    "timestamp": 1744322400
  },
  {
    "username": "SavageTiner",
    "rating": 2.0,
    "comment": "Pretty Heavy. Broken (wrong first move or two will end competitive game)",
    "timestamp": 1732143600
  },
  {
    "username": "spacemanc",
    "rating": 2.0,
    "comment": "Was a 7.\n\nAs time passed my desire to play is much much less now 4\n\n2022: Gave another try - Complete waste of time unless the game group chooses this. - 2",
    "timestamp": 1721080800
  },
  {
    "username": "relayerx",
    "rating": 2.0,
    "comment": "because you only corrupt the prices and all other prices rise even more. The price of the original game is skyrocketing compared to the quality of the components. according to such a system, it is possible to sell 3 stones by adding a few pages with the rules of the game )",
    "timestamp": 1700953200
  },
  {
    "username": "relayer98",
    "rating": 2.0,
    "comment": "300€ with expansion ? + shiping...to much for me ...thats price of 5-8 ordinary games.",
    "timestamp": 1700607600
  },
  {
    "username": "Bondy034",
    "rating": 2.0,
    "comment": "Long and really mean. I dislike that combo immensely.",
    "timestamp": 1696024800
  },
  {
    "username": "Alb1979",
    "rating": 2.0,
    "comment": "Mi nota es 2/10, no porque lo considere un mal diseño, sino porque \"won't play ever again\". Creo que el sweet spot estaría en 3 jugadores, a 5 es un horror que puede durar años la partida. Además es uno de esos juegos en los que el jugador con más experiencia no solamente arrasará, sino que probablemente provoque que los jugadores más inexpertos no se coman un colín y simplemente se queden con las sobras de lo que quede en cada ronda. Además me parece absurdo lo que ocupa, en mesa (especialmente el despliegue de cartas) y que haya cierta \"aperturas\" predefinidas para comenzar la partida en modo hardcore, eso no tiene nada de divertido para mí. Juego excesivamente caro con una caja de un tamaño innecesariamente pequeño.",
    "timestamp": 1693605600
  },
  {
    "username": "azycat",
    "rating": 2.0,
    "comment": "it's soooooooo boring............ too long,,,,.... sorry it's my own fault i decimated my attention span in my adolescent years whille my brain was still developing and now i can't even sit still for a 10 minute conversation",
    "timestamp": 1672354800
  },
  {
    "username": "churchb3",
    "rating": 2.0,
    "comment": "I would need to watch how-to videos and read multiple strategy guides before attempting this one again. Avoiding for now. Not worth it.",
    "timestamp": 1653861600
  },
  {
    "username": "DrendDragonspawn",
    "rating": 2.0,
    "comment": "Far, far too long. No matter what decision you make, it is wrong. Spent 7 and a half hours and made precisely zero dollars, despite doing everything I was supposed to. If I’m not going to get to play a game, I don’t want to waste so much time doing it.",
    "timestamp": 1651960800
  },
  {
    "username": "RConsonni",
    "rating": 2.2,
    "comment": "Ok... A 3+ hour game that can practically eliminate you in the first 20 minutes because you made *one* wrong choice cannot be good. Being stuck on a table for the rest of the game, watching other people play is plain boring.",
    "timestamp": 1643929200
  },
  {
    "username": "R_J_",
    "rating": 2.0,
    "comment": "- Hey you want to try this long, unforgiving game?\n- No thanks",
    "timestamp": 1634248800
  },
  {
    "username": "AleQ33",
    "rating": 2.0,
    "comment": "The game has no balance, no catch up mechanism, whoever does well keeps getting rewards.",
    "timestamp": 1628373600
  },
  {
    "username": "w92viking",
    "rating": 2.0,
    "comment": "What utter garbage",
    "timestamp": 1616540400
  },
  {
    "username": "RecRe",
    "rating": 2.0,
    "comment": "Rule book feels incomplete and there's a lot more crunching than i like. Also cheapish looks.",
    "timestamp": 1614898800
  },
  {
    "username": "oldsin",
    "rating": 2.0,
    "comment": "The design is clever in a way, but they forgot to make it fun. This so called game is incredibly tedious, dry, fiddly and frustrating. Forget playing well if you don't know all the cards by heart. Or don't want to constantly recalculate ranges and bonusses all over the ugly board. The worst is that if you're not winning, you often don't get to do much at all. Repeat for 4+ hours. No thanks. I'd play 6 hours of Yatzee over this.",
    "timestamp": 1595455200
  },
  {
    "username": "FrockLobster",
    "rating": 2.0,
    "comment": "Punishing by design. During our first play, one person was definitely having fun (he won by $500+), one person was frustratedly trying to catch the fun-haver, one person was bored and crushed, and one person made a mistake on the 2nd turn that had him on the sidelines for the whole time. This might be ok for a game that takes 45 minutes. This one took 4+ hours.\n\nAll of the constituent parts of the game are interesting, I loved the theme, and I do think it's a well designed game. But what it adds up to is a brutal, unforgiving experience where it's hard to imagine a session when all of the players at the table have a good time.",
    "timestamp": 1581289200
  },
  {
    "username": "roast",
    "rating": 2.0,
    "comment": "Terribly boring. Too complicated. Too long between turns. Not at all fun.",
    "timestamp": 1573858800
  },
  {
    "username": "TFJ383",
    "rating": 2.0,
    "comment": "Far too complex, frustrating, and involved for my taste. Is it smart? Sure, but it also rewards familiarity to a fault, has an art style that grates on me, and caused me far more annoyance than enjoyment, not to mention the length of the game.",
    "timestamp": 1570485600
  },
  {
    "username": "Sinn104",
    "rating": 2.0,
    "comment": "The bonuses for being the first to do a certain action in the game set the stage for a game that will have you regretting how you played your first few turns over the course of several hours. I played this once with 5 people and the game took 7 HOURS from teaching to finishing the first game.\n\nI’m the kind of person that gets a little salty when I know I’m losing badly and this is an absolutely brutal game that punishes poor play in a very unforgiving manner.\n\nAlso the game is extremely fiddly. Towards the end more than half the time playing involved doling out ridiculous amounts of food and drink tokens and computing who sold what where. It’s the opposite of elegant. Just not my style of game at all and not one I will be playing again.\n\nThe puzzle itself was interesting. It’s just a shame this game feels like more of a chore than something I actually enjoy.",
    "timestamp": 1563141600
  },
  {
    "username": "jackbarnard",
    "rating": 2.0,
    "comment": "Sigh...\n\nThis is genuinely one of the worst games I've played in ages, I couldn't believe my eyes when I saw the hugely positive reaction this game has garnered on this site. My only guess is that it's so overpriced that people rate it highly to make themselves feel better about dropping 100 dollars on this turkey. Who knows.\n\nFirst off, the aesthetic. I get that it's going for a retro restaurant look, but it looks terrible. Cards are all coloured in block shades, the board looks like a print and play prototype, and there was very little actual art commissioned for this game at all. The game is also highly inelegant. There is a huge number of cards that take up even a decent sized table leaving little room for the tableau of employee cards that each player needs to build in front of them every round.\n\nOne of the main mechanisms in this game is that of the milestones. Basically if you're the first player to do a certain thing then you get a passive bonus for the rest of the game. Some of these are ridiculously powerful and would seem to preclude you from winning if you miss them (at least to me). The worst thing about these kind of mechanisms is that they require you to constantly monitor your opponents' progress to ascertain if they will beat you to a milestone. This is simply not interesting and becomes tiring.\n\nPerhaps the worst aspect to this game is that simply nothing really happens in it (at least for some of the players). We played for about 2.5 hours, and the sum total of my business transactions (considering this is an economical game, which is won by making transactions) was the sale of 4 bottles of beer. Wow. Another player I think didn't manage to make a single transaction during the game. Unbelievable. The winner of our game was the first player to reach $100 (one of the aforementioned milestones) which meant he got a passive power that multiplies all his sales income by 1.5. This is amateur game design at it's best - a mechanism that literally makes the leading player uncatchable.\n\nI'm trying to think of something positive to say about the game, but I'm struggling. Well, I suppose it's nice it wasn't longer?",
    "timestamp": 1553641200
  },
  {
    "username": "Yadman00",
    "rating": 2.0,
    "comment": "Played a few times but serious lack of randomness means there's literally one optimal strategy to go for. Dull as dishwater.",
    "timestamp": 1552604400
  },
  {
    "username": "orange",
    "rating": 2.0,
    "comment": "marketing food and drink to families (creating demand) I have found very funny. players represent owners who build up a restaurant business from scratch. Building up marketing, hiring cooks etc.\nthis is a very complex game with nice ideas, the only fault I think is the way too long playing time, so I won't play this again.",
    "timestamp": 1547852400
  },
  {
    "username": "wallwaster",
    "rating": 2.0,
    "comment": "This is the most fiddly game I've ever played, if anyone calls Sentinels Of The Multiverse fiddly again I will hit them in the head with this game's box as many times as the furthest diner's price + distance would be to house number 15 if the house has gardens and there is a discount manager at work but also a luxury manager but no counting the bonus from that milestone you got last turn. So as you see the way you have to count distance on a weird map and add prices which have modifiers to it to determine where people go ... for every single house is tiring as hell. It also makes the game either unplannable or headhurtingly AP-prone\nThe tech tree is the interesting part of the game but that takes up insane ammount of table space and is again fiddly as hell. What really makes me dislike this game though is how advertising works. In a game this detailed the fact that your ads don't sell your products at all, they just generate demand for a type of stuff anyone can fulfill ... which not only is unthematic for me, but from a pure mechanism standpoint it is a hotbed of kingmaking. For example I got most of my points because someone mistakenly (because - again - it would be a chore to count distances and shit) advertised in a way that was good for me and not for him. That is not elegant design at all. I kind of understand why this \"do whatever\" kind of sandbox is appealing to people but for me it's neither good design nor a good experience.",
    "timestamp": 1530914400
  },
  {
    "username": "Sayrina",
    "rating": 2.0,
    "comment": "Extremely boring. Would be happy to never play this again.",
    "timestamp": 1526508000
  },
  {
    "username": "sbconstant",
    "rating": 2.0,
    "comment": "Another of the sort of engine-building game I am apprehensive about playing, play badly, and have no interest in studying to get any better at. Luckily, I played with friends and that made the experience fun, despite the game.\n\nLearning to manipulate a complex, artificial system that purports to simulate something is just something I'm not interested in. The milestone cards for those who first do something, most especially, hinder novices from competing at all with experienced players, and give the appearance (an accurate one from what I have read) that there are really just a few avenues for winning in this game.\n\nThe theme doesn't do much for me either here, although the game's graphic design is spot on for those who enjoy hearkening to 1950s U.S. fast food. Price rough all well.",
    "timestamp": 1490482800
  },
  {
    "username": "kuhrusty",
    "rating": 2.0,
    "comment": "Based on one 3-player game. I can see why people like this, but it's just not my kind of thing. In order to play competently, you need to start the game knowing & understanding most of the jobs & all of the milestones; I didn't, and sort of muddled through, but don't have any interest in improving, nor in playing again.\n\nThe same night, we also played Imperial (also low/no luck, similar length). Although I did worse in Imperial (hard last instead of distant second in FCM), I had a great time, and want a rematch. Imperial gives you a very simple framework, and leaves all the complexity in playing the other players; FCM gives you a page-long sequence of play and three or four dozen stacks of cards, each with special powers, and with various synergies you need to figure out before your first move.",
    "timestamp": 1489446000
  },
  {
    "username": "IceHot",
    "rating": 2.0,
    "comment": "Rather overrated. Even though the game appears to be open ended there are only a few lines of play. Too long for a game with scripted strategies.",
    "timestamp": 1474236000
  },
  {
    "username": "bryanious",
    "rating": 1.8,
    "comment": "Game design that makes me angry:\n- While it's an interesting twist to have players choose either a longer, medium or shorter game via hidden reserve cards, that's pointless because it's your first action in the game and can't be interacted later. You should not incorporate a Rock-Paper-Scissor mechanic in a long strategy game! You might guess the other players' reserve cards, but you have already had to commit to a certain build order. Some build orders can branch later, some can't. So you'd choose a build order that can branch, but there's one answer to every gamestate how you should branch so where's the game in that? It's more of a work situation, you shouldn't play by intuition. Game design that awards AP! Hurray!\n- The game is NOT interactive, but a race! It's just that some BOs (build orders) require certain other players to do something first to work (which you can't plan for). The seemingly tactical gameplay is overshadowed by the power of 1x employees and milestones, which are way more gamedeciding than careful tile-placement and opponent interaction.\n- The game is 100% open information. You can sit down and calculate your way to victory. You actually should. This makes it similar to chess, but without focus on tactical positioning, which is mostly irrelevant! What is the board for anyway? There's much added complexity without much gain.",
    "timestamp": 1466892000
  },
  {
    "username": "IQTom",
    "rating": 2.0,
    "comment": "Ask yourself two questions before buying/playing this PoS:\n\n1. Do you really want to invest 5 hours of your life pretending to open and run a burger joint?\n\n2. Do you enjoy extreme random fiddlyness which is both no fun and has no relationship with reality?\n\nYes to both makes you one of nutjobs that rated this a 10.",
    "timestamp": 1466805600
  },
  {
    "username": "dierenh",
    "rating": 2.0,
    "comment": "Engelse regels in originele opmaak",
    "timestamp": 1459634400
  },
  {
    "username": "Chris Barnard",
    "rating": 2.0,
    "comment": "Almost as much fun as being a MacDonald's management trainee.\n\nI'm not a fan of efficiency engine games or of this incredibly dull topic. This game really divided opinion in my game group. Some players absolutely loved it whilst I felt it was totally devoid of fun and not something I will play again, hence the 2. The menus are well produced and the other components are okay. I found the road layout difficult to interpret and that's not a good thing when your first task is to place a restaurant in the optimum location for proximity to houses, etc. The milestone cards are vital if you want to do well. It seems that if you don't get off to a good start you'll have difficulty catching up and that's not great in what can be quite a long game.",
    "timestamp": 1456268400
  },
  {
    "username": "debiant",
    "rating": 2.5,
    "comment": "I don't feel comfortable rating this game yet, but I'm also not sure it will ever hit the table again either.",
    "timestamp": 1755468000
  },
  {
    "username": "Eliya84",
    "rating": 3.0,
    "comment": "One of the worsted games which i have ever played. Against familiar players you have no Chance. No Ketchup mechanisum. If you make in round 2 a fail you have no Chance to correct it. And the game can take 180 min.",
    "timestamp": 1747692000
  },
  {
    "username": "leeleepeepee",
    "rating": 3.0,
    "comment": "挺好的游戏，值得高分，但是对不行的玩家来说后期纯坐牢…一分不挣纯亏钱，啥事不干就等游戏结束…",
    "timestamp": 1745704800
  },
  {
    "username": "gonesse",
    "rating": 3.0,
    "comment": "not the game i was hoping for, but understand the high rating for it",
    "timestamp": 1742166000
  },
  {
    "username": "dickywinsome",
    "rating": 3.0,
    "comment": "me waitress. i rate 3 because that the color of waitress",
    "timestamp": 1741906800
  },
  {
    "username": "stude",
    "rating": 3.0,
    "comment": "Very thematic game with nice design, but only for the very twisted minds. Like Diplomacy but in the business world - you make your moves and then you wonder what happens at the end. I'm not against complex games but this is just too fiddly.\n\nAlso the guide is one of the worst I've seen. Restaurant entrance - I suppose it's the corner with black lines, but it's not explained anywhere. Another surprise was the sudden mentioning of demand counters - which became more clear later when marketing phase was explained. Pay day - what happens if I don't have enough money? Luckily, proposed to be skipped in the introductory game. Why would I hire a Discount Manager to lower prices, to get less money? Or is she lowering something else than my sales prices.",
    "timestamp": 1738364400
  },
  {
    "username": "bbolch",
    "rating": 3.0,
    "comment": "This game has some really great features such as The card art is wonderful and give a cool retro vibe, Building out your network of employees is fun and can be rewarding, and that the game is complex but not overwhelming or difficult to teach.\n\nUnfortunately in my opinion these positives get outweighed by one large flaw and that is that Milestone achievements are game breaking. Locking players out of abilities makes the game undesirable.",
    "timestamp": 1728856800
  },
  {
    "username": "amanwithtwodogs",
    "rating": 3.0,
    "comment": "Huge runaway leader problems. They almost advertise the unforgiving nature of the game as a feature, but honestly, how many other heavy euro games have 1st round moves that are so bad, they can lose you the game? When new players need THIS much hand holding, just to not end up being miserable for 2+ hours, I'm not sure this is as great a design as some claim it to be.\nBesides that, it takes up a huge amount of table space, is somewhat fiddly, and art and component quality is really lacking for its price.",
    "timestamp": 1719871200
  },
  {
    "username": "Housticus",
    "rating": 3.0,
    "comment": "Game is well designed but the theme is just not exciting for me. The idea of a game based on corporate management is dull beyond anything I can think of. The gameplay is clever but I just could not get excited about it.\nThis is an entirely personal view, some people may love the idea.",
    "timestamp": 1702594800
  },
  {
    "username": "marioaguila",
    "rating": 3.0,
    "comment": "A meh deck building game. Si logran mejorar la ergonomia del juego, puede subir a 4.\nIf they manage to improve the ergonomics of the game, it can go up to 4",
    "timestamp": 1700434800
  },
  {
    "username": "bneffer",
    "rating": 3.0,
    "comment": "This is an org-chart of doom. It feels like I experienced an art installation. I enjoyed it, and do not need to go experience it again.\n\nThe art in the game is uninspired. The gameplay is deep and highly player-reliant. You can end up having amazing success or total failure, and this really depends heavily on the players. The theme is something I should like, but it is not closely adhered to by the 18xx style play, and that creates dissonance for me. Not my tempo of game, but I understand why it is something others are attracted to.",
    "timestamp": 1694642400
  },
  {
    "username": "icheyne",
    "rating": 3.0,
    "comment": "I strongly object to how unforgiving this is. A four-hour game where a noob can fall into a trap and find themselves totally out of contention early on is not my idea of fun.",
    "timestamp": 1691100000
  },
  {
    "username": "cjcjazz",
    "rating": 3.0,
    "comment": "Very harsh game. Not for newbies. The mad scramble for the bonuses in the beginning set the tone and if you make a mistake it's VERY hard to recover. Too long.",
    "timestamp": 1682632800
  },
  {
    "username": "Maginomicon",
    "rating": 3.0,
    "comment": "Anyone teaching the game who doesn't tell you what your first turn or two turns should be like to avoid an obscure \"turn one trap\" is being a dick.",
    "timestamp": 1662501600
  },
  {
    "username": "KotieRW",
    "rating": 3.0,
    "comment": "6 hours of agony. Will never be returning to this one.",
    "timestamp": 1661637600
  },
  {
    "username": "marioaguila",
    "rating": 3.0,
    "comment": "DICIEMBRE 2021: Cuarta partida: exige una planificación inteligente inicial. Probablemente la mejor tomará una venta irremontable y el juego, que ya era poco elegante, fluido, con mala ergonomía en mesa, se transforma en un suplicio. Hice video y no lo pude terminar. No lo jugaría mas. A la venta.\nEn realidad, me recordó mi infancia, jugando Monopolio. Por factor suerte, o por una estrategia mejor, lo concreto es que a partir de cierto momento el rico se hace más rico y los demás se dedican a patear piedras y esperando que la partida termine. Tal vez a la siguiente vez no me pase eso; esa sería la esperanza que me imagino algunos tienen para jugar de nuevo. NO es mi caso.\n\nDECEMBER 2021: Game Four - Requires initial smart planning. Probably the best will take an irremovable advantage and the game, which was already inelegant, fluid, with poor ergonomics on the table, becomes an ordeal. I made video and couldn't finish it. I would not play it anymore. For sale.\nIt actually reminded me of my childhood, playing Monopoly. By luck factor, or by a better strategy, the concrete thing is that from a certain moment the rich man becomes richer and the others are dedicated to kicking stones and waiting for the game to end. Maybe next time that won't happen to me; that would be the hope that I imagine some have to play again. It's not my case.\n\nNOVIEMBRE 2021: Primeras impresiones: ergonómicamente un lío. La existencia de cartas para construir el mazo (de eso va el juego esencialmente), y no de tableros personales para adquirir funciones, poco cómodo y moderno. Cansa por eso.\nJueguísticamente, algunas cosas interesantes. Hay otros mejores juegos económicos como Planet Steam, Steam, Age of Steam, Container, Princes of the Renaissance, Imperial, Wildcatters.\n\nFirst impressions: ergonomically a mess. The existence of cards to build the deck (that's essentially what the game is about), and not personal boards to acquire functions, not very comfortable and modern. Tired for that.\nAbout gaming, some interesting things. There are other better economic games like Planet Steam, Steam, Age of Steam, Container.",
    "timestamp": 1659045600
  },
  {
    "username": "shawn_low",
    "rating": 3.0,
    "comment": "Too much chrome for a game that has very little going for it. Initial set up matters: mess it up and go behind. Or play against someone who knows it well and you'll go behind.\n\nThe rest of the game is about churning through the equivalent of worker actions to build and supply fast food demand (based on the board setup) and managing resources such as staff etc to get there. Takes way too long for the pay off. Feels like it could use a little more development: shaving a round or two to reduce the pain, I mean play time.",
    "timestamp": 1637881200
  },
  {
    "username": "jellynut",
    "rating": 3.0,
    "comment": "Based on one on-line play - I don't think I'm the intended market for this one. The rules seem straightforward enough and I can see the appeal of open-ended decisions, but it's hard to parse what other players are doing (at least on-line it is).\n\nThe game flow for a first (and probably only) play was\n10 minutes of playing the first bit of the game\n1.5 hours of watching the rest of the game happen with no resources, no options and no way back into the game.\n\nArtwork and theme doesn't interest me at all",
    "timestamp": 1633471200
  },
  {
    "username": "s_nav",
    "rating": 3.0,
    "comment": "Extremely happy I didn’t purchase, and friend owned.\n\n+ theme, art\n+ Tech tree is great in principle allowing a wide range of strategies\n\n- action programming\n- opponents actions play for you.\n- too slow and scripted at the beginning, too much AP towards the end.\n- no catchup. Not fun spectating a 3+ hour game after 10 minutes just because you didn’t hire a recruiter\n- all or nothing approach to selling.\n- the best player produces more -> sells more -> gets milestones (Eg. cfo) -> recruits higher -> affords salaries. Repeat\n\n\nGreat Zimbabwe so much better. Gods and specialists increase VR. Choice of god is limited which makes it easier to plan a counter strategy vs a runaway leader.",
    "timestamp": 1629064800
  },
  {
    "username": "YouWontBeBoardGames",
    "rating": 3.0,
    "comment": "stab me with a spork. This game is wayyyyyy too long and heavy. If you fall behind in the first 30 minutes, you're toast for the next 5 hours.",
    "timestamp": 1622152800
  },
  {
    "username": "luigicool",
    "rating": 2.5,
    "comment": "Only played it online at boardgamecore.net. Played 2p and 3p, with all features. Unforgiving. That single adjective best captures the nature of it. Feels like work and leaves you with a bad taste in your mouth.\n\nThis is a game like Chess and Go in the sense that a difference in skill determines the winner every time. The question then becomes: (1) is it worth investing the time and energy to master it and (2) can it be played with a group of friends of unequal skill level with everyone (including the less skilled players) enjoying the match? My personal answers to both of those questions are no. I already have a hard time when I win a game with friends where they did not enjoy the ride, I don't think I would be able to emotionally handle or enjoy winning a 3-4 hours game of this against less skilled players and/or lose a 3-4 hours game of this against more skilled players. I also believe that with repeated plays a series of preferred openings will be apparent (as in Chess), and knowing/memorizing those openings and sticking to them will be needed, limiting the illusion of individual freedom. Perhaps I am just too lazy to work when it's time to play, and this game requires work and gives little room for the kind of social interaction I enjoy: the auctions, bluffing, negotiating, social deduction, and opportunities for shock and laughter that I anjoy. I don't usually like to have to think three/four steps ahead and plot out the different outcomes to figure the best action, I like to follow my instinct, and here it will almost guarantee that I will be inconsequential, like playing Chess against a master relying on one's instinct only. Last -- every time I play I feel bad -- games are supposed to be fun, and this one somehow makes me feel miserable both during and at the end, and no amount of cute graphics is going to fix that.",
    "timestamp": 1617314400
  },
  {
    "username": "Bethemey",
    "rating": 3.0,
    "comment": "No real surprises feels like a math formula and lacking the satisfaction of completing the formula since its at the expense of everyone else playing.\nAlso, for the amount paid for the game list price there is no way I should feel like I'm playing a prototype.",
    "timestamp": 1617228000
  },
  {
    "username": "John Rogers",
    "rating": 3.0,
    "comment": "Thoughts after 1st play (3ply session):\n\nI was hesitant to pick up FCM for quite sometime do to what I saw as an over-emphasis on engine/deck-building, combo-creating card play, and the overall number of cards. I tend not to like a game with a million upfront options and lots of actions to choose from but rather prefer a small menu with a limited set of actions to hone.\n\nI found my first play of FCM to largely be what I initially feared. An emphasis on engine/deck building with tons of options, a growing number of action possibilities, and more semi-direct player interaction on the board. I see how everything still comes down to undermining your opponents on the board; however, the time spent on building and ramping oneself up toward board shenanigans is a little long for my l taste. Rating 6.\n\nThoughts after 2nd play (4ply session):\n\nWow that was easier and faster (we didn't play the reserves though just $400 for 4 players). I focused largely on board development and built my structure in response to how I wanted to utilize the board. I did mimic some milestones of one opponent whose restaurant was close to mine, but otherwise I focused on maximizing the board. My path was a combo of discount manager and business developer with some minor cooking/advertising. I won $260-60-50-30. Rating 7.\n\nThoughts after 3rd play (2ply session):\n\nPlayed through the first bank with my wife tonight (just $200). It was her first time and she ended up with more employees, 15-11, and more milestones 8-7, than I but I used the business developer to build two houses, add a garden, and coupled it with a radio campaign and burger cook to sail to an easy and quick victory. My wife commented that she was actually understanding it by the end. However, when asking her about playing it again she ops for other Splotter's. Rating 7.\n\nThoughts after 5th play:\n\nWell I think this is settling for me. I admire it more than like it. I just don't enjoy building my corporate structure, the time it takes to upgrade from one thing to the next. It takes multiple turns to implement something which may not work at all. I like it once it gets going but the first half of the game is just boring to me.\n\nGeneral Thoughts:\n\nI think FCM, like many a Splotter is a brilliant design. This is an interesting and interactive engine-builder. I can see why this is so immensely popular. It combines a fresh take on a popular mechanism, deck/engine-building, with an intuitive theme, fast-food business, with goals to be achieved (milestones), and board play that has potential for nasty play.\n\nThat said I definitely prefer other Splotter's, particularly the comparatively inverted TGZ. In FCM the emphasis is toward more longterm engine building and planning vs the more instant reactionary play, direct player interaction and interdependence of TGZ. While there are still board shenanigans somehow it feels less dynamic and mutualistic in FCM.\n\n6/19/18\nA recent attendee of game night asked if I still had FCM and if so, commented how much they would love to play it. As I reflected on the request and prospect of refreshing myself with the rules a general feeling of fatigue came over me and I began to realize the obvious: I really have no desire to play this anymore. And not just, meh take it or leave it but an active resistance to it. I don’t think it’s a bad design by any stretch but certainly a bad fit for me.",
    "timestamp": 1616281200
  },
  {
    "username": "whiskeyface",
    "rating": 3.0,
    "comment": "Oof. This game looks like garbage and the strategy involved is equal to it's looks.",
    "timestamp": 1607727600
  },
  {
    "username": "Flying Teapot",
    "rating": 3.0,
    "comment": "I like how streamlined the rules are for such a complex game. I like the fact that usually it can be played in 2/ 2,5 hours with 4 players. I like the game's mechanics, that I find quite elegant. So after 6 plays I can say that...I plain hate this game! Completely scripted for the first 3 turns (you dare anything different than Recruiting Girl/Trainer/Radio in any combination,and if you're playing with similary experienced people you're done for good). Extremely difficult to track what's happening on the other side of the table. Extreme snowballing effect. Almost impossible to catch up: I left my last (ever) game after 3 turns because losing my first sale on a turn order tie break (that had been sparked by a price war between two other players and that I found myself involved in despite being on the opposite side of the map) completely destroyed my strategy and it would have taken me at least three turns to pivot my organization (if i had ever managed to do that) and by that time it would have been impossible to catch up with the leader. Would it have been possible to prevent that: maybe, if I had managed to exactly anticipate the next two turns of three other players with at least 6/7 cards each, all bunched up in front of them, PLUS who got which milestone, PLUS all the distances between all the restaurants and the houses. I'm probably too dumb to play this game, since the other players didn't seem to have any problem with that, or maybe they were just lucky not to be caught up in the crossfire of something they didn't have any reason to be involved with, or maybe they just like overhyped, frustrating experiences. I already have a job and I get paid for it and I find it far more enjoyable that this game.",
    "timestamp": 1596319200
  },
  {
    "username": "VoluciteFenise",
    "rating": 3.0,
    "comment": "There is a very clear \"this is how you have to play\" and the fans of this game have not been friendly to new players.",
    "timestamp": 1588197600
  },
  {
    "username": "sykano",
    "rating": 3.0,
    "comment": "prototype of a game with restaurant chain management theme\noverrated\n\n\nbad looks\nthematic errors\nseems like work (!)\ntakes very long\nbalancing issues\nhard to learn, needs introduction game or 3\nway too expensive for what it is\n\n\n\"economic warfare\"",
    "timestamp": 1585951200
  },
  {
    "username": "Corsairs",
    "rating": 3.0,
    "comment": "It shames me to say it, but I just didn't grasp this game at all. I love Vital Lacerda games because, though they're a challenge to learn, I eventually feel that \"click\" halfway through the game, and I feel proud of myself at the end for scaling the mountain. \"Food Chain Magnate\" for me was just a never-ending mountain. Even at its end, I still didn't fully get it.\n\nMy game was played with \"The Ketchup Mechanism\" expansion. I appreciate how the expansion shortens the game time, and I also like the handy menu that covers the potential employees and milestones. But for a newcomer playing against three experienced players, Lord, you're screwed. Because if you don't know those employees and milestones down to your bones, you are going to lose BIG.\n\nI'm sure with lots of plays I'd get better, but I don't really feel like devoting that time to this game. That's at least in part to the fact that the theme and aesthetic do nothing for me. And I must say that I really hate how hard it is to determine which player has satisfied the needs of a given household. Can't there be some visual indicator, or do I really have to lean over the table to peer at my opponents' tableau every round?\n\n\"Food Chain Magnate\" may be a very good game. It's not a very good game for me, though. Think I'll pass on this order.",
    "timestamp": 1579561200
  },
  {
    "username": "juuzzom",
    "rating": 3.0,
    "comment": "Not the worst game, but not too much fun either. Reminds me a bit of Schoko & Co. Nice aesthetics and usage of theme is certainly better than BGG description lets you expect. The economic engine works very logically and the same can be said of the tech tree apart from some of the employee functions being questionable. At least CFO is questionable. Player aids are also a big positive. The gameplay is just very repetitive and one dimensional. There can certainly be several strategic approaches, but once you choose your path it is one dimensional. There may be some tactical fighting towards the end, but that's it. You probably could stop the game a long way before the end because there is a certain rich gets richer syndrome going on. I also am neither fond of the inflexibility regarding pricing your goods nor the imbalance coming of the milestones feeding the rich gets richer syndrome. This would have been a lot more enjoyable if the bank had been emptied just once.",
    "timestamp": 1575241200
  },
  {
    "username": "Laratinger",
    "rating": 3.0,
    "comment": "Games which show \"how economy works\", the importance of excessive management and Guru training .... extremely conservative - you will play it once and then you will know how it works.",
    "timestamp": 1563832800
  },
  {
    "username": "dreadnaught",
    "rating": 3.0,
    "comment": "The excellent corporate structure planning aspect of this game could not make up for the overall poor \"core\" aspect of the food production and delivery aspect of what the game is supposed to be.",
    "timestamp": 1558562400
  },
  {
    "username": "Godz111a",
    "rating": 3.0,
    "comment": "A truly horrendous game in both art and mechanics. When high value bank busts are set, the winner is incredibly obvious well before the game is over. Additionally, the first 3 moves or so are completely scripted and any deviation will result in you losing. I should like this game, but the mechanics just don't mesh well together. It is very unlikely that I will play it again.",
    "timestamp": 1555365600
  },
  {
    "username": "Aion",
    "rating": 3.0,
    "comment": "The Good:\nNone (maybe the fact that there is no luck, if that is how you judge the quality of a game).\n\nThe Bad:\nIt looks awful (like an early prototype).\nVery limited feeling of achievement and progress given how much it lasts. You might take 2-3 key decisions (everything else is just predictable reactions to your opponents) in a game that lasts 4 hours,\nIf you do a miscalculation or mistake, it might take you many turns to recover and might cause you the game.\nIt's just an abstract game in the end. I can see no theme in a \"business\" game where an intern can become a Top Manager overnight just with excessive training, where business developers build houses and gardens, where a store can appear out of nowhere full functioning overnight and where everything of the above costs nothing. There is no realism whatsoever in almost any of the events that happen in this game meaning this is no business simulation. That's fine i guess (no one said it should be one) but at the same time it makes the theme pasted on.\nIf your definition of fun is calculating and keeping track of your opponents cards, probabilities of every single outcome, and the money in the bank, there is something wrong with you.\nIt costs around 90e and it is a bunch of cards and wooden tokens with minimal artwork, which is ridiculous.",
    "timestamp": 1554847200
  },
  {
    "username": "Kartoffelkeks",
    "rating": 3.0,
    "comment": "I liekd the theme, but boy, is the gameplay design wrong. One hat to either carefully plan ones entire turn and playall possible consequences out in ones own head (which takes 10 or more minutes perplayer) OR just accept that one will make mistakes (which the game does not really forgive). The games punishes mistakes quickly and rewards good action not enough. Playing it felt really more like a tideous chore than anything else. Not my cup of tea...",
    "timestamp": 1550962800
  },
  {
    "username": "SteoanK",
    "rating": 4.0,
    "comment": "Only been playing this at 2 to keep the skill levels fairly even. I can see how you can get slaughtered early on if you make some bad plays.",
    "timestamp": 1760392800
  },
  {
    "username": "Klausi300",
    "rating": 4.0,
    "comment": "4",
    "timestamp": 1756764000
  },
  {
    "username": "onceplayed",
    "rating": 4.0,
    "comment": "everyone who gets into this probably knows this but: the game has a determinate set of good strategies that get shifted through player interaction but not really through setup or game state variance (e.g. seti without hidden aliens). that in turn leads to (a) doing good at the game depends more on knowledge of the game than in other games and (b) youre gonna be as good at the game as youre willing to calculate. This open problem space where you should calculate from the goal state backwards basically also means its very brain burny and incentivizes people who like to make 'optimal' decisions to calculate endlessly. For me this is not an exciting form of problem solving. It feels very algorithmic to paly. And if people start to burn fuel on calcuation the game will take too long for what it is.",
    "timestamp": 1749333600
  },
  {
    "username": "andytaylor",
    "rating": 4.0,
    "comment": "Played Simon’s copy",
    "timestamp": 1748296800
  },
  {
    "username": "dopebones",
    "rating": 4.0,
    "comment": "My favorite thing is that it features player-set prices, not many other games do this besides TGZ, and I think that is essential to model economic systems in a game. I was surprised to find out how much I disliked the tableau building aspects though. Supply, demand, marketing portions are all fun. Dynamic time scale based on pricing and other player actions is an interesting side effect. Still think Indonesia and TGZ are more fun. One complaint I have is that the game results in people being functionally eliminated without actually being removed from play. It might have been interesting if they included some rule that players behind $X in revenue or total cash on hand from the leader get eliminated entirely and mercifully from play, as opposed to being dragged along and slowly tortured for the remaining 2 to 3 hours with their only meaningful possible contributions being related to king making. It would also speed things up to eliminate those laggards.",
    "timestamp": 1739487600
  },
  {
    "username": "Crazyscheme",
    "rating": 4.0,
    "comment": "Played. Only play to hang out with friends.",
    "timestamp": 1735081200
  },
  {
    "username": "diceyroller",
    "rating": 4.0,
    "comment": "*Owned by friend*\nHard to put into words why this game doesn’t work for me. I have played it just the once and appreciate that I haven’t given it enough opportunity to try and change my mind about it. Clearly a deep and strategic game and I’m sure it deserves the high score and praise laid upon it. I think this one is a personal dislike to the game. I have read online that the game is difficult for new players against experience but in all honestly this wasn’t the issue for me. The theme of the game was not for me! Think this game fits into the category ‘I’ve played it once and that’s enough’.",
    "timestamp": 1728943200
  },
  {
    "username": "shmonkey",
    "rating": 4.0,
    "comment": "Need some more plays to vet this one. I handed the game to a friend last time. After several more plays, the tightness of the design came through and i started to appreciate the ability to counter other players and reshape the income situation.\n\nNot a huge fan myself. It's a game that heavily rewards experience and players can and do lock each other out of the game for several rounds at a time. I think if I played it with a group, starting fresh, and we all stumble through the game together dozens of times, it could be a fun game. But If there's any skill/experience disparity, It can get way too mean for my liking",
    "timestamp": 1725314400
  },
  {
    "username": "mortoray",
    "rating": 4.0,
    "comment": "I want to like this game as it has a nice core game mechanic. The problem is that it lacks flow. Player turns take too long, and the delivery phase is painfully tedious. It's just not fun to play.",
    "timestamp": 1724536800
  },
  {
    "username": "PlasterCramp",
    "rating": 4.0,
    "comment": "It's too frustrating, but not in a good way.",
    "timestamp": 1722636000
  },
  {
    "username": "nishikawa-collector",
    "rating": 4.0,
    "comment": "Too brutal for my taste.",
    "timestamp": 1716933600
  },
  {
    "username": "DaBene",
    "rating": 4.0,
    "comment": "I don't get the excitement about this Game, it just doesn't transport any good feeling. Maybe if you were ok with monopoly you might like it, but other than that, no, why. And I hereby apologize for this harsh criticism to the people working so hard on it. The theme is just so not fitting my taste ….on top of the not immersive mechanisms…sorry",
    "timestamp": 1701212400
  },
  {
    "username": "akaisamurai001",
    "rating": 4.0,
    "comment": "A deep game that does not disappoint strategy and theme wise as usual from Splotter but this is probably the best game in my experience that they have produced. Not only does everything immerse you into the idea of running a food chain but the strategy you go down can sink you just like in real life if one lacks the ability to adapt to a changing market. The rules are the biggest surprise as usually Splotter games are very complex to teach but this game was quick and easy to learn for anyone of a regular boardgaming level. And the way of choosing facedown by each player the length of the game by the variable amount of money in the bank needed to exhaust to end the game adds a whole new level to strategy than just a standard amount of turns. Also, running a food chain is a unique theme that is fun to roleplay if one is so inclined.\n\nDownsides is the game can be brutal and one can find a downward spiral of dropping behind the leader if a decision was not thought out far enough. The game also takes a while to play, 2-4hrs depending on player count.\n\nIn conclusion, a great game with immense theme and strategy to boot. Can't recommend it enough with it's cool theme and fun gameplay.",
    "timestamp": 1700780400
  },
  {
    "username": "Solipsiste",
    "rating": 4.0,
    "comment": "It's the Big title from Splotter than I enjoy the less, mainly, I guess, because it's much nastier (although, at least, it's not Multiplayer Solitaire) and has an unsolvable runaway leader issue (an issue I most particularly dislike in long games - we had a player abandon last time out of spite, which is something I never see in our group). Contrarily to R&B, it also plays rather poorly at 2 players.",
    "timestamp": 1700694000
  },
  {
    "username": "NormandyWept",
    "rating": 4.0,
    "comment": "The highly-interactive supply and demand, price-setting and competition part of this game is fantastic. Unfortunately, it feels like you have to wrestle with a very dry modern Euro deck-builder in order to interact with that system - and in fact a modern Euro with the need for memorised scripting openings. I'd much prefer a more streamlined and quicker version, which some of the other Splotter games get closer to realising.",
    "timestamp": 1700607600
  },
  {
    "username": "CooperGore",
    "rating": 4.0,
    "comment": "Not my cup of tea. Big runaway loser problem, needs a ton of tablespace, bonkers high price, bogus low quality to the components, excruciating paper pushing.",
    "timestamp": 1697493600
  },
  {
    "username": "flamejuggler",
    "rating": 4.0,
    "comment": "Way too brutal and leaves players with plenty of time to regret the past and see no future. Way too chaotic at 5 players. I think a lot of the consumer behavior rules feel ludicrous, which is more bleak message than fun. No thanks.",
    "timestamp": 1693173600
  },
  {
    "username": "Zoomiewoop",
    "rating": 4.0,
    "comment": "Fun game but hard to get people into it!",
    "timestamp": 1692568800
  },
  {
    "username": "Daliman13",
    "rating": 3.5,
    "comment": "Way too fiddly, obtuse and long without enough theme to support it.",
    "timestamp": 1684360800
  },
  {
    "username": "TAsme",
    "rating": 4.0,
    "comment": "nothing for us. pretty boring and too confrontative",
    "timestamp": 1682632800
  },
  {
    "username": "rayzor6",
    "rating": 4.0,
    "comment": "I always just lose my way in this game. It's a great design and SKILL is necessary to do well, but I won't ever get there.",
    "timestamp": 1679266800
  },
  {
    "username": "KingsElite",
    "rating": 3.5,
    "comment": "Brutally unforgiving in a way that absolutely does not work for my tastes",
    "timestamp": 1679007600
  },
  {
    "username": "RoadHouse",
    "rating": 4.0,
    "comment": "Hugely unforgiving system. This is an example of a game that you need to study beforehand and create a strategy before you play the game. Learning by playing is not fun, unless you want the game to last for many, many hours. The frustration caused by this game can be just huge to new players.\n\nSince the milestones are removed from the game after somebody takes one of them, there is pretty much zero flexibility in strategy, you have to plan everything from the beginning, and since it is a Splotter game, you can ruin somebody's game if you so wish.\n\nThe table space requirement is huge. Every player needs to have some sort player aid for the Milestones, thank goodness there is already one for the other cards.\n\nNo need to play ever again.",
    "timestamp": 1677366000
  },
  {
    "username": "TroyNyne",
    "rating": 4.0,
    "comment": "$100 game with components/art that look terrible. The gameplay is not good enough to overcome its lack of presentation.",
    "timestamp": 1672441200
  },
  {
    "username": "stanczes",
    "rating": 4.0,
    "comment": "It's one of the most boring games I have ever played in my life - It's over-complicated and you will see after the first 30 min who will win it even that the game goes for the next 2-3 hours.",
    "timestamp": 1661292000
  },
  {
    "username": "Tristis",
    "rating": 4.2,
    "comment": "Great game, but I have no intention to play it again. Sad-sad story.",
    "timestamp": 1654380000
  },
  {
    "username": "ArdaBektas",
    "rating": 4.0,
    "comment": "3 4",
    "timestamp": 1654207200
  },
  {
    "username": "barry_015",
    "rating": 4.0,
    "comment": "one and done...this game is unforgiving, last mistake and you're out.",
    "timestamp": 1649023200
  },
  {
    "username": "wsbarranco",
    "rating": 4.0,
    "comment": "Admittedly pretty fun. But God help you if you make an error early in the the game!\nYou'll often be in a ditch & can't get out.",
    "timestamp": 1645570800
  },
  {
    "username": "Luke the Flaming",
    "rating": 4.0,
    "comment": "[Played 1 time]\nFelt scripted after the opening moves.\nI am not a fan of the \"I'll (try to) steal your sales\" interaction either.\nLot of cards, but mostly \"+1 this, +1 that\" rather than significantly different effects.",
    "timestamp": 1642460400
  },
  {
    "username": "CotB",
    "rating": 4.0,
    "comment": "",
    "timestamp": 1641250800
  },
  {
    "username": "Jestertrek",
    "rating": 4.0,
    "comment": "Rating: 8. Minus one for having chess-like openings that you have to memorize and its related brutality to newer players. Minus one for hideous presentation -- it's just flat ugly. Minus one for how expensive it is -- the value for money is very poor compared to any other game on the market. Minus one for the seething fans of Splotter who try to make you feel less than human for pointing out the previous three points.",
    "timestamp": 1638918000
  },
  {
    "username": "ryansmum2008",
    "rating": 4.0,
    "comment": "Not for Me",
    "timestamp": 1618351200
  },
  {
    "username": "dpbush",
    "rating": 4.0,
    "comment": "I enjoyed the build-a-company card game part, but then we'd move to resolving the board and it got SO tedious. This is my third Splotter game and their intricate mashups clearly aren't for me.",
    "timestamp": 1613602800
  },
  {
    "username": "MiloXCoco",
    "rating": 4.9,
    "comment": "aesthetics: 2\nquality: 3\nvalue: 4\nconsistency: 7\norganization: 9\n\nsmoothness: 5\nstrategy: 7\naccessibility: 2\n(re)play-ability: 6\ninteraction: 3\n\n49/100\n\n1 plays",
    "timestamp": 1760997600
  },
  {
    "username": "Garath_",
    "rating": 5.0,
    "comment": "Interesting concepts that make the game very competitive and very replayable.\nHowever, it's so beginner unfriendly that I doubt I will want to play it over again.",
    "timestamp": 1758492000
  },
  {
    "username": "iplaybgnaked",
    "rating": 5.0,
    "comment": "Very clever deckbuilding mechanic driving a supply & demand economic simulator. The card play is very elegant and doesn't get in the way of the cutthroat competition business building on the board and for the milestones. The big downside is that the opening maneuvers are fairly scripted and on rails until the market on the board starts to develop and players are forced to make adjustments based on that in rounds 4-6 (yes there are a couple of different paths you can take before then but you are largely going through the same motions for the early turns each and every play).\nLike other economic games, I'm finding that FCM is considerably better the more players you have, to the point I'd never play this again at 2-3p.\nThe scripted card strategies have really killed my enjoyment of this game, yes even after knowing them you do still have to play well and maneuver around what other players are doing, but for how long this game is, there are other economic games that do something more interesting and as dynamic in the same time that I'd rather play.",
    "timestamp": 1755813600
  },
  {
    "username": "b0ardgamer",
    "rating": 5.0,
    "comment": "I can see why the game has lots of admirers - it has (fairly) straightforward rules, turns are quick, and there is a huge range of paths you could choose to follow during the game - each of your choices will influence your game going forward. And this is exactly why I don't enjoy it - you need to have a plan looking several turns ahead, understand how each of your choices could play out in different scenarios, and generally be very aware of the game state. There is a massive potential for screwage, and you could go from last to first in a single turn if you've planned well. But you can only this with a good understanding of the game, and by very careful planning, and I don't care to invest that much effort. Great game, not for me.",
    "timestamp": 1748815200
  },
  {
    "username": "SybotCB",
    "rating": 5.0,
    "comment": "After two games, I'm still having trouble figuring out how to do well in the game. I've got the rules down at this point, I just don't know how to put it all together yet to do well.",
    "timestamp": 1745013600
  },
  {
    "username": "bonillarau",
    "rating": 5.0,
    "comment": "No niego que este sea el juego de gestión de empresa del momento, y que tiene muchas virtudes. Pero - lo mismo que muchos otros Splotter Spellen - este juego castiga mucho al novato. Puedes estar fuera de la partida tras media hora, y aún te quedan otras 2 ó 2 y media horas de tortura sin esperanza por delante. Le hubiera venido bien unas condiciones de victoria súbita, o de eliminación de jugadores demasiado malos (¡como yo!)",
    "timestamp": 1736463600
  },
  {
    "username": "Turleythepage",
    "rating": 5.0,
    "comment": "Based on 1 play, I'm glad I played this but wow is it brutal and unforgiving. I would dread playing this again at 4/5p and being the one left in the dust for the next 5 hours.\n\nVery likely a 1 and done.",
    "timestamp": 1732575600
  },
  {
    "username": "143245",
    "rating": 5.0,
    "comment": "I understand where others say \"it's a drafting game that you don't know what you're building towards\" which I think holds a large amount of truth in it in terms of how to approach the initial 1/3rd of the game (if not longer) with the accumulation of workers for your economic engine of sorts. There is probably 1/3rd of the game where you're focused on cards and getting started on the board, but determining what to do there falls out of a co-dependency with other players (as does when to have that switch in focus and balance). There is a certain amount of an engine building or a workforce management that you work on at the beginning and then there is this transition into board focused spatial play. In that regard, it sort of reminds me of a more complicated Lewis & Clark with staffing and card usage each turn with the spatial piece of The Great Zimbabwe added in and a slathering of generic euro engine building laid on top. One area that it different from TGZ is there seems to be a certain amount of runaway/snowball effect that the milestones provoke and the underlying question is \"who can runaway faster\" as the end post you're reaching for doesn't change, so delaying getting a milestone isn't to your benefit if you're going to try and incorporate it into your strategy. Conversely, because anyone who meets a milestone's condition that turn receives it, there is a dominant pathway of recruitment that provides for an advantage..\n\nCompared to Indonesia (the other heavy econ Splotter I have), this feels more tactical, much more generic euro-y (build some semblance of an engine, crank it as hard as possible, try and run away with it, etc), less permanent (due to how marketing happens and things sort of turn quickly as a result of changed demands and a better ability to forecast what's coming) and less opaque in it's decision analysis. I would say it's less opaque as well in terms of just saying \"well is this a good idea or no?\" By no means is it a simple game, just a general comparison of the two titles (not all of that is bad, just different).\n\nConversely, the plethora of things you can do is almost dizzying in a wonderful way, even if there are two areas of strategic pivoting (once at the onset of the game, and again after about 6-8 turns when everyone is up and running for a bit). It is much more dynamic with price cutting/raising and changing demand via marketing expiration piece make for a really interesting twist on interaction, and I find it more interactive than either Indonesia (slightly) or Roads & Boats (definitely). Slightly stronger than Roads & Boats (primarily due to interaction style and play duration), not nearly as interesting to me as Indonesia (which I say is a 9). It rises above \"generic heavy euro\" but not by much.\n\n\nedit:\nrevisiting this. I think FCM is a \"3.5p game\" in terms of what is the optimum player count. I think I prefer it at 3p because of the speed of play and the requirement that players 2 and 3 work together to take down the leader vs a 4 or 5p game where it becomes as much about turtling and optimization as it is about advancement. The Ketchup milestone board is effectively a patch and is required for play IMHO.\n\nDowngraded to a 5; For a 3p game, I don't know that it's what I reach for first, but I have friends who really like it.",
    "timestamp": 1732316400
  },
  {
    "username": "Not_Today",
    "rating": 5.0,
    "comment": "Overcomplicates what it needs to be",
    "timestamp": 1731798000
  },
  {
    "username": "mauigreen",
    "rating": 5.0,
    "comment": "component quality leaves a lot to be desired... especially given the very high price point of this game",
    "timestamp": 1730070000
  },
  {
    "username": "ygram",
    "rating": 5.0,
    "comment": "Two plays: Not for me, economy takes off too fast in the end. Feels very swingy, both games was won by players who managed to exploit a seemingly OP strategy. From what I have read it should be possible to counter most strategies if you react fast enough to them. That may be correct but I don't think I want to invest the time to learn the game good enough to do that. Playing games as a beginner to reach that level would feel like a chore and not fun. Components and arts is also not to my liking.",
    "timestamp": 1728856800
  },
  {
    "username": "flutegirl",
    "rating": 5.0,
    "comment": "Not my cup of tea. It's far too punishing, and feels very much like a game that has a set strategy you have to use in order to be successful.",
    "timestamp": 1727042400
  },
  {
    "username": "emptyset",
    "rating": 5.0,
    "comment": "I finally got around to playing it. I can see why some people really love it. It's not complicated but it's complex.\n\nI really like the tech tree of jobs! It's a great idea that could be used in other games.",
    "timestamp": 1725746400
  },
  {
    "username": "VornVolken",
    "rating": 5.0,
    "comment": "A very clever and unique game, but one that is too unforgiving and takes far too long for my own taste. Also, people have to be of similar skill level for this to be enjoyable.",
    "timestamp": 1725314400
  },
  {
    "username": "Neko20",
    "rating": 5.0,
    "comment": "Just wasn't my thing. Game itself is fine if you're into these deeper Euro games.",
    "timestamp": 1718834400
  },
  {
    "username": "yangtze2000",
    "rating": 5.0,
    "comment": "A massive learning curve every time you play, unless you play regularly. Not sure it's worth the candle.",
    "timestamp": 1717624800
  },
  {
    "username": "leeuw62",
    "rating": 5.0,
    "comment": "one of the heaviest and complex games i ever played. Too heavy....",
    "timestamp": 1713132000
  },
  {
    "username": "jhaelen",
    "rating": 4.5,
    "comment": "It's about time we play a full game. The short sneak preview left me with a very favorable impression.\n\nEdit: Well, now that we did... it didn't feel as great :-(",
    "timestamp": 1710111600
  },
  {
    "username": "jammitch",
    "rating": 5.0,
    "comment": "\"Every turn counts\" is a funny way to say \"only the first turn counts because you've already lost the game\". Splotter games are probably just not my cup of tea.",
    "timestamp": 1707001200
  },
  {
    "username": "mccasey",
    "rating": 5.0,
    "comment": "I have played this 3 times and never once did I enjoy it...IDK what others see in this. Its certainly up there in the top 5 of worst games for me.",
    "timestamp": 1706569200
  },
  {
    "username": "danrowe2011",
    "rating": 5.0,
    "comment": "A theme that promises much but fails to deliver in most aspects. The disgusting map sets the scene for what is essentially an area control game that involves scales of marketing and a lot of counting. The business pyramid you create begs to stay in place and receive some story towards it and instead is scooped up every turn. This is more akin to a war game than anything and it's a poor one to boot.",
    "timestamp": 1705273200
  },
  {
    "username": "claudio212",
    "rating": 5.0,
    "comment": "I tend to love a Splotter, but this one just didn't click with me no matter how much I wanted it to. The production is so appealing. But the game just breaks my brain in none of the ways I like.",
    "timestamp": 1704582000
  },
  {
    "username": "MikeKoro",
    "rating": 5.0,
    "comment": "2nd Play Thoughts   5   (Sept 2020):\n\nA well loved game that is not for me. Very tight and punishing. Runaway leaders are common, and falling behind leaves you sitting for an hour or two with very little opportunity to get back in the game, or do anything really. If you are into this type of game, you will not be disappointed though.",
    "timestamp": 1695852000
  },
  {
    "username": "Cucciolo84",
    "rating": 5.0,
    "comment": "Good game. Difficult to learn. You can lose all in the first round. Your decisions could make win or lose everything",
    "timestamp": 1695333600
  },
  {
    "username": "BearDot25",
    "rating": 5.0,
    "comment": "Update after three plays:\n\nDropping to a 5. Just not for me. The milestones are too critical to success and I find them boring/constraining. I don’t think the turn to turn gameplay is that fun; any “fun” mostly comes from being good at the game, which turns me off of the design. You’d have to play this a ton and be really into thinking it all out for it to shine — without that, it mostly has just felt long and rote.\n\nFirst impression: Brilliant game. I can see how this became such a hit and totally understand how it’s many people’s favorite. The puzzle of your workforce (which are basically programed actions) combined with the interactive map knife fight is fantastic.\n\nSo why the 7? Well, there were a few things that I would call flaws, but I didn’t find enjoyable for one reason or another. It’s very very long. It’s a lot of bookkeeping and tedious mathing. And the milestones felt a bit too central to the game — they’re probably the least fun part but they determine most of ever you do for the first 1/3-1/2 of the game. Overall, it’s just a notch too heavy for me.\n\nI wouldn’t be surprised if I get more plays in that this rating goes up, but I’d be surprised if that happens considering the length and need for similar level players. And given the choice I’d rather get more into The Great Zimbabwe.",
    "timestamp": 1685484000
  },
  {
    "username": "tbpinter",
    "rating": 5.0,
    "comment": "Not fun at two.",
    "timestamp": 1679868000
  },
  {
    "username": "Gorgoneion",
    "rating": 5.0,
    "comment": "Interesting mechanics, original theme, simple and clear rules, deep strategy. What's not to like? Well for one I really don't dig this game, the theme just doesn't grab me and I find it difficult to play properly. While with other games this would be a sign of a great game for me, I can't say the same thing for this one: I have no fun playing it.",
    "timestamp": 1679439600
  },
  {
    "username": "GodfatherPTS",
    "rating": 5.0,
    "comment": "The card play is delightful. I don't like how constricted the early game feels, but after that it really opens up.\n\nI spend lots of time trying to think about which plays my opponents will make. Correctly predicting their recruits, trainings, and corporate structure are key to doing well in FCM. I find this exhausting. It requires lots of concentration to keep track of all of your opponents and predict when they will do a new advertising campaign or undercut the prices on their burgers. Because of this, FCM feels a bit more like work than many other games.\n\nIt is heavy. It is very tight and strategic. It is very unforgiving. I understand why so many people love it. The game just isn't for me.",
    "timestamp": 1676156400
  },
  {
    "username": "kraedy",
    "rating": 5.0,
    "comment": "Played twice. Enjoyed one game, didn't enjoy the other. Takes a bit too long and felt like it suffered from runaway leader issue (it might not, but that didn't make being 2nd or 3rd feel any less bad)",
    "timestamp": 1674342000
  },
  {
    "username": "Tenebyss225",
    "rating": 5.0,
    "comment": "Everyone should play it because they’ll learn something from it.\n\nI respect the uncompromising design philosophy of every decision mattering and doing virtually no hand holding, but those are harder to swallow in such a long game with a rather slow ramp up.",
    "timestamp": 1673737200
  },
  {
    "username": "YipYapFox",
    "rating": 5.0,
    "comment": "Headache in a box from pompous designers. Unfun even in a fun group, downright toxic in a competitive one. Who has the time for this? Avoid.",
    "timestamp": 1671490800
  },
  {
    "username": "honk3d",
    "rating": 5.0,
    "comment": "+1 np",
    "timestamp": 1667257200
  },
  {
    "username": "stenole",
    "rating": 5.0,
    "comment": "(3-5P) In this Splotter game you try to make money form selling food and drinks. You hire and maintain staff and advertise to get people to buy the products you make. The demand can be tainted by advertising new products, because people will only buy if they get everything they want. The game relies on reaching milestones to gain unique powers that will forever be denied to your opponents.",
    "timestamp": 1660082400
  },
  {
    "username": "Aequius",
    "rating": 5.0,
    "comment": "okayish, not my favorite theme, play a little clunky",
    "timestamp": 1658872800
  },
  {
    "username": "FridleifFaehn",
    "rating": 5.0,
    "comment": "Ersteindruck!",
    "timestamp": 1657231200
  },
  {
    "username": "Svilleken",
    "rating": 5.0,
    "comment": "Hard to rate because my wife lost interest mid-way through the game though she really wanted to love the game.",
    "timestamp": 1656885600
  },
  {
    "username": "SrFinn",
    "rating": 5.0,
    "comment": "One more of those games that are newer , thus unnecessarily harder than predecessors.\n\nIf you care about market manipulation, puzzle solving and strategical timing, Brass is infinetely better. If you care about heavy euro game where all players behave cut-throat - Barrage is infinitely better\n\nFood chain magnate is a game made harder than it actually should be for the level of depth it offers.\n\nIt's ugly and long as well",
    "timestamp": 1644274800
  },
  {
    "username": "junior_gracz",
    "rating": 5.0,
    "comment": "Food chain Magnate takes all the good things of a heavy strategical euro like Grand Hotel, Brass, Automobile... and adds a lot of fiddly mechanics just to make the game \"harder\" , \"smarter\" , \"more demanding\"\n\nAt the same time it keeps the terrrible practices of this genre: horrible esthetics, a lot of hassle turns (intermediate turns) and unnecesary game length\n\nThere's no reason to play this over brass. But the fans of the genre are always looking for complications (\"the better game\") and seem to not care about the strategy depth",
    "timestamp": 1644274800
  },
  {
    "username": "Akado",
    "rating": 5.0,
    "comment": "Hmm. It was a great game for a Euro. How's that for a backhanded compliment?\n\nI liked how the game is a combination of strategic choices (short game, medium game, long game) and tactical reactions (sniping milestones/garden houses, screwing up others' advertising, price wars), but in the end, it's still an engine-building euro in which there are \"optimal paths\" to victory.\n\nThe engines are the employees you hire and the milestones you achieve. The strategic paths are chosen before the start of the game and not known until midgame (hidden bank reserves), and changing your path in the first round as you see what others first hire is weighed down by the knowledge that you placed a bank reserve with a specific duration in mind.\n\nI have no problem that poor moves are punished ruthlessly, nor that runaway leaders are possible when great plays or miscalculations happen. I have no problems with \"the better player wins almost all the time\" in games, either. But I don't like that much of the game feels \"solved\". There are certain milestones and openings and midgame maneuvers that are simply \"better\" based on the game state, and deviating from those is likely to just extend the game (unless you chose a long game, since you don't even contribute until Round 6).\n\nOn that note, I don't like that the \"long game\" option basically says \"I won't even play the game until half of the milestones are gone, because I'm doing my own thing building a super engine over here, and I have no way to influence the board without killing my engine.\"\n\nWhile this is currently rated a 7, I can only see it dropping with more plays as I explore the narrow pathways it offers and move on to other games.\n\n*Edit* And it's dropped. There are optimal paths that can be charted out before the first turn, and you simply evaluate before your turn to see if they are still the optimal path, or if there's an opportunity/challenge that is better. As with all heavy player-interaction games, this is very fragile and can easily be lost due to the actions of another player who sacrifices themselves (often unknowingly) to torpedo you.",
    "timestamp": 1643929200
  },
  {
    "username": "LesPatatas",
    "rating": 5.0,
    "comment": "5 Players: 1 Game",
    "timestamp": 1642978800
  },
  {
    "username": "robbyjey",
    "rating": 5.0,
    "comment": "I've played it twice, but it doesn't really click for me. I like complex games but the fun factor just isn't there for me in this one. It feels too restrictive like I can't get anything going. Clicks for some people, but didn't for me. I can see why some people really like it, though.",
    "timestamp": 1641164400
  },
  {
    "username": "omnitheus",
    "rating": 5.0,
    "comment": "2 plays\nThis is a game that I should like but like most other Splotters do not see why the price has to be so high. Feels like gauging to me. Others go gaga. Me, I just avoid purchasing them. I get as much game or more from other designers like Pfister, Menzel, Steding or Risthaus.",
    "timestamp": 1640818800
  },
  {
    "username": "lemonandlime",
    "rating": 5.0,
    "comment": "Boring. Feels like work.",
    "timestamp": 1638140400
  },
  {
    "username": "wkover",
    "rating": 5.0,
    "comment": "I have a fondness for economic games, but I found FCM to be too deterministic. (\"100% dice free!\" is not a selling point.) True, you need to react to other players' actions and strategies. But - like Dominion, another not-favorite - all cards are available from the start, meaning early turns can be scripted if you discover a particular winning gambit. Against inexperienced players, at least.\n\nNot that I learned much, but be aware that literally every misstep can be fatal. Enjoy!\n\nOn the historical side, it's odd that the publisher gleefully embraced the sexism and uber-whiteness of the era. Ironic subversion? Could also be that Dutch publishers are unaware of American sensitivities and simply don't know any better. Not that that's a valid excuse.",
    "timestamp": 1631311200
  },
  {
    "username": "britchey",
    "rating": 5.0,
    "comment": "online boardgamecore\n5s",
    "timestamp": 1630101600
  },
  {
    "username": "XoeAllred",
    "rating": 5.0,
    "comment": "Only played once, but seems to heavily favor experienced players, or players who happen to make the right moves early on. I say this as the player who made the right moves early on.\n\nPositive feedback loops is insane, but I think maybe the point?",
    "timestamp": 1621720800
  },
  {
    "username": "deedw",
    "rating": 5.0,
    "comment": "In Food Chain Magnate versucht man einen Technologiebaum aus unterschiedlichen Berufen aufzubauen, um so eine Fast-Food-Restaurant zu managen. Hierfür kann man Leute anheuern, die dann neue Leute anstellen können oder Burger und Pizza herstellen, Werbung schalten oder Ware einsammeln. Vom Prinzip her hat mir der Technologiebaum gefallen, aber mir war es zu viel des Guten. Ich mochte das auch bei Computer-Rollenspielen nie, wenn einem 50 Optionen gegeben werden, wie man sich entwickeln möchte. Ich will lieber intuitiv spielen und Spaß haben.\n\nIch selbst hatte am Spiel kaum Anteilnahme, da ich weder Getränke noch Essen fabriziert habe. Ich habe einfach nur ganz viele Kellnerinnen eingestellt und so am Ende pro Runde 35 Dollar erhalten (für 7 Kellnerinnen). Ein bisschen Geld musste ich ausgeben für meinen Vizepräsident, aber es reichte für den zweiten Platz. Ich finde es prinzipiell gut, wenn es mehrere Strategien gibt, aber irgendwie arbeitete meine am Spielprinzip vorbei. Die Aufmachung des Spiel ist leider sehr minimalistisch. Effektiv bezahlt man 90 Euro für die Spielidee, aber sicherlich nicht für die schöne Grafik. Einzig die Holzteile für Pizza, Burger und Getränke sind ganz nett, aber Spielbrett und Werbetafeln reizen einen nicht.\n\nDen anderen Mitspielern hat es aber gefallen. Ich muss es glaube ich nicht noch einmal spielen. Zu erwähnen ist noch, dass wir das schnelle Spiel gewählt haben (d.h. nur eine Banksprengung), sodass die richtige Maschinerie aus Produzieren und Liefern nicht voll zum Tragen kam. Aber wir spielten auch daran 90 Minuten und wenn ein volles Spiel dann doppelt so lange dauert, wäre das zu lang für mich.",
    "timestamp": 1621720800
  },
  {
    "username": "His Dudeness",
    "rating": 5.0,
    "comment": "Just okay.",
    "timestamp": 1619992800
  },
  {
    "username": "littlechandler",
    "rating": 5.0,
    "comment": "For a game with a 4.2 game weight this was actually fairly easy to learn. Also, while presumably in the normal game you can be punished very severely for playing poorly in the beginning and your first few opening moves seems to somewhat lock you into a strategy, at least in the intro game there felt like a greater sense of direction despite the numerous card stacks compared to something like say, Agricola, where I've seen players really flounder without doing anything. My biggest issue with the game is that while there are 3 different drinks and 2 different foods, they all feel very samey and so while there are certainly different strategies you can pursue with the pseudo tech trees of training workers, the general feel of the game may feel the same each time (and as always I wish there was variable setup, as in more than just the board). However, I was quite pleased by the level of interaction: you can actually advertise for houses your opponents are serving to make their demands so exorbitant that your opponent can't meet their demands, you can snipe the customer base of opponents from them or leach off the demands they generate from advertisements, or try to monopolize a food type while selling at high prices. Also, something I didn't realize from just reading the rules is that the order of which house looks for food first can be quite significant, and you may have resources you would want to spend on a more lucrative, later house be exhausted too early. Such interactions can make turn order quite important so you can react to your opponent's actions, and can also make it hard to just plan things out by yourself. The cutthroat nature of it feels quite at home in the capitalist 1900's fast food chain theme.\n\nI like the building up your hired staff with the pseudo tech tree of the workers. Kind of afraid there is runaway leader (while there is more upkeep for more workers, I think generally it is still better to have more), but gives an engine building feel. Also you starting with only your CEO gives you a few rounds to get a general feel of the game before things get crazy.\n\nObviously didn't play with the milestones, but think they would give you more reason to try different things from game to game.\n\nI thought the artwork would bother me, but actually the card art I think fits with the style well, and the colorfulness of the wooden pieces adds some vibrance. The only think that really bothers me is how bland the board looks.",
    "timestamp": 1612134000
  },
  {
    "username": "johnclark",
    "rating": 5.0,
    "comment": "Like 18xx I like the management stuff but hate the spatial aspects. Remove the grid map and tedious counting spaces and it would far more enjoyable. I really hate counting distances. Not complex, just fiddly. Too much downtime and admin overhead.",
    "timestamp": 1611529200
  },
  {
    "username": "Wigdogger",
    "rating": 5.0,
    "comment": "I'd long heard about FCM and its reputation (long playtime, simple-ish rules but high depth, cutthroat interaction, getting boned early in the game, runaway leader, etc)... and yeah, it was kind of all of that and more.\n\nIt's probably a game I can appreciate from afar, and likely one I'd do better on a second time, but frankly, I don't know if I would give it a second time.\n\nThe first few turns feel surprisingly scripted, but then there is a huge tech tree to explore. That part is cool. But it does feel like some milestones are just hard to compete with if someone prices you out of them early. And it also feels like a lot of those early situations just come down to the initial turn order, which you have no choice over.\n\nI kind of dig the goofy aesthetic, but I don't know if I can abide the functionality of the board art considering it actually kind of makes me glaze over when measuring routes and distance and all of that. It's sort of weirdly banal and busy at the same time, making some of the determinations later in the game a chore.\n\nAnd there's also a ton on the board later on, plus in your card tableaus, and that just makes everything feel kind of busy and clustered.\n\nI can see why people like the high interaction and assholishness of the game, but it really does feel like a game for people who want to basically min-max every one of the strategies and play with the same group all the time.\n\nIt's really too long for what it's doing, and it just feels like the late game really deters you from salvaging your strategy unless you've played things perfectly or know the game well. You basically have to commit to four hours of learning how to not suck at the game.\n\nAs an academic exercise in kind of experiencing this kind of game, I can dig it, I guess. But I don't think I'd be clamoring to play again.",
    "timestamp": 1597960800
  },
  {
    "username": "Aerick",
    "rating": 5.0,
    "comment": "The theme didn't excite me. The art, while certainly appropriate, didn't really grab me. The mechanics seem too punishing if you don't make the right moves at the beginning. May change my mind after additional plays (if I play again).",
    "timestamp": 1594677600
  },
  {
    "username": "dreaddormammu",
    "rating": 5.0,
    "comment": "A heavy game with a theme that isn't all that enticing to me.",
    "timestamp": 1593381600
  },
  {
    "username": "abbywill",
    "rating": 5.0,
    "comment": "First, after 3 plays, I have a tremendous respect for this game. I think it's a brilliant design, I love the art and theme, and the mechanics are incredibly unique and heavily thematic. I just don't enjoy playing it.\n\nI don't think my lack of enjoyment is any fault of the game at all, but rather that the game is not at all for me. I feel that good strategies are too deep for me to find enjoyable, and the game is too punishing if you decide not to invest in a good strategy. In many ways, it's the same reason that I don't enjoy Go (another game that, though I don't enjoy, I have a deep respect for).\n\nI understand completely why so many love this game, I have appreciated having had the chance to play it, and I believe that it is good and important in many ways, but it is not the kind of game I want to keep playing.\n\nEdit: (2020/04/15)\n\nAfter 3 more plays, the first of which my friend very slowly and patiently walked me through the strategies and mechanics of the game, I'm actually able to play through a game successfully. I'm not sure I'm comfortable with it yet, but I'm no longer completely despondent a third of the way through the game (a vast improvement, to say the least!), and I'm much more willing to keep trying the game now than I was before. I'm not sure I'm at enjoyment yet (the stress level for the game is still a bit too high), but I'm thinking I might get there eventually.",
    "timestamp": 1587420000
  },
  {
    "username": "SethMakesGames",
    "rating": 5.0,
    "comment": "One really great mechanic - the building of your employee tree. The rest is relatively clunky, the components are very cheap for how expensive the box is. The game is very long but lacks drama as one player tends to run away with the victory around halfway through but then you just play it out with relatively little ability to get back into the game.",
    "timestamp": 1583622000
  },
  {
    "username": "jabooty3",
    "rating": 4.5,
    "comment": "Very unforgiving. Believe there is a good/fun game in there, but I didn't experience it.",
    "timestamp": 1576623600
  },
  {
    "username": "ResiliencePath01",
    "rating": 5.0,
    "comment": "Played at BGG.con 2019.",
    "timestamp": 1574809200
  },
  {
    "username": "bop517",
    "rating": 5.0,
    "comment": "Wow!\n\nI like it, a good amount. It gets tense as you try to be the first to do things and make money in the neighborhood. It is a bit putzy and can get mathy, tho.",
    "timestamp": 1571349600
  },
  {
    "username": "matpe",
    "rating": 5.0,
    "comment": "A slight disappointment. The theme is not very interesting even if I'm ok with fast food. Too swingy. Didn't like the graphics.",
    "timestamp": 1568066400
  },
  {
    "username": "asianpsycho",
    "rating": 5.0,
    "comment": "Too expensive for what it offers. Great game though.",
    "timestamp": 1567116000
  },
  {
    "username": "NoxMortem",
    "rating": 5.0,
    "comment": "Update 11.11.18 to 6: Actually no desire to play it at the moment. Slightly to complex and too long, but a nice design.",
    "timestamp": 1556143200
  },
  {
    "username": "ChildeRoland1919",
    "rating": 5.0,
    "comment": "For the life of me I will never understand why this game is so highly regarded . I get the aesthetic appeal but beyond that the gameplay is mediocre and at the end of the day The Great Zimbabwe is just a better game with tighter controls.",
    "timestamp": 1553986800
  },
  {
    "username": "curtc",
    "rating": 5.0,
    "comment": "Update: After selling it, I re-bought it, partly because I was impressed with Great Zimbabwe, and I think I didn't give this a fair shot. I do think I'll need to play with the watered down rules, as suggested in the rules, in order to get other players onboard with this. Then hopefully add everything in.\n---\nI can see why people like this game, but it didn't strike me as the second coming of gaming, which is what some of the early reports have sounded like. First off, I don't like tech trees in games, but I know some people do, so that's just me. The core system works, and there are definitely some interesting things there, but I really really don't like the milestone system, which is core to the game (or at least I expect fans of the game to claim so). Rather than having goals with rewards for having achieved something that took a lot of effort, like in many games, there are many rewards for completing things that are rather easy, but give permanent bonuses. I really disliked this. There's a quick gold rush for the cards in the first few turns, and if you screw that up, it's game over, 4 hours later. It's quite plausible that if I played without the milestones cards for my first game (as recommended in the rules, in fact), I would have enjoyed it more. I would also probably have preferred playing with fewer players, and playing only the first half of the game. Then layering in both the complexity, length, and more players. But I suspect that I would never like the milestones cards, particularly because it requires you to pay attention to all of the specific exceptions to the rules that each player has (if you want to actually know what players can do and not play multiplayer solitaire), and it's a lot to try to keep track of. Never mind trying to keep track of what cards each player has. No one expects to keep track of all player cards in a game like Dominion, but in a zero-randomness 4 hour game, those who can and do keep track of such things are at a distinct advantage. Those who can't or dislike the effort of doing so are at a disadvantage. I personally prefer games where I can easily observe all game state, both common state and player state.",
    "timestamp": 1553900400
  },
  {
    "username": "nswoll",
    "rating": 5.0,
    "comment": "Not as much of a sandbox as it appears. Your opponents actions actually play the game for you.",
    "timestamp": 1553554800
  },
  {
    "username": "byronczimmer",
    "rating": 5.0,
    "comment": "I've played this two or three times now, and just can never seem to kick things into high gear properly.\nI feel this game rewards study and pre-planning, things I've not yet decided are important enough to do with this title.",
    "timestamp": 1549926000
  },
  {
    "username": "1 Family Meeple",
    "rating": 5.0,
    "comment": "MIKE'S\nPROMO\nCard Sort",
    "timestamp": 1540767600
  },
  {
    "username": "SirHandsome",
    "rating": 5.0,
    "comment": "Nice to play a heavily interactive euro again, but I'd still rather play a heavily interactive Ameritrash. And I like this game's style, and its subtle comments on capitalism are clever.\n\nAs a heavy euro, that's about all the good I can say about it though. I never got to the \"fun\".\n\nI've only played once, and sometimes deep games only reveal themselves on further play, and fine -- but this game is static, other than the starting random setup -- so it seems like the peak of the mountain in this is basically being able to figure out what predetermined, mathed-out build order to apply to each setup (yes, also adjusting based on what other people are doing, thankfully) which doesn't really appeal to me as a game.\n\n(4 Design + 1 Enjoyment)",
    "timestamp": 1540591200
  },
  {
    "username": "AndySzy",
    "rating": 4.5,
    "comment": "This is the epitome of stuff I don't like in a Euro: fairly crunchy math, brutal easy to screw up mechanics, inconsistently unthematic rules. I like the hierarchy mechanic, but it's still fairly underdeveloped feeling (there's not that much you can do with it). Also, the art/graphic design (or lack of it) is simply not acceptable in this era of games - and especially not for the price that this game apparently MSRPs at.",
    "timestamp": 1540245600
  },
  {
    "username": "GuySamstag",
    "rating": 6.0,
    "comment": "I think I'm very much settled on only admiring the design of these bigger Splotter without needing to enjoy them. While I do like interacting with the economic simulation here, the constrained optimisation \"barrier\" blocking it is simply not my thing -- where good play allows very little wiggle room throughout, leaving you with an evening-length game (i.e. not short) consisting of a decisive early-game, a suspenseful end-game, but a largely uneventful mid-game. Just hits all the wrong notes for me.",
    "timestamp": 1759356000
  },
  {
    "username": "CatContentCreator",
    "rating": 6.0,
    "comment": "Das Spiel ist gut, aber ich habe noch nichts gesehen, was derart \"ungelenk\" ist.\n\nFCM ist – auch für ein Spiel mit 4er-Rating – im besonderen Maße bestrafend (ich fürchte, mehr noch als Wasserkraft). Aber auch aufgrund der Downtime und der schieren Unübersichtlichkeit empfehle ich gerade Anfängern eine Partie maximal zu dritt.\n\nFood Chain Magnate macht nur Sinn, wenn man es innerhalb kürzerer Zeit häufiger spielt, also entsprechend Zeit und Leute hat. Ein einmaliges Erlebnis wird quasi zwangsweise scheitern.\n\nEs ist zu teuer und in Teilen (siehe Stadt) hässlich.",
    "timestamp": 1757800800
  },
  {
    "username": "pezpimp",
    "rating": 5.5,
    "comment": "The rules are not that complex, the game play is, as decisions you make early can haunt you later. You hire employees to sell food on the map to houses but the complexity escalates really quickly as what you sell is effected by others. It is also very difficult to catch up if you get far behind even if you try to gang up on the leader. The game can be very long especially for those behind as catching up can be insurmountable. For an economic engine game there are much better ones and less repetitive ones.",
    "timestamp": 1755727200
  },
  {
    "username": "purpleposha",
    "rating": 6.0,
    "comment": "71",
    "timestamp": 1755468000
  },
  {
    "username": "Gurkvatten",
    "rating": 6.0,
    "comment": "Best game I've ever played once and then never wanted to touch again.",
    "timestamp": 1754776800
  },
  {
    "username": "eddieb",
    "rating": 6.0,
    "comment": "so good, but so ugly. looks like a prototype. how is this 150 bucks.",
    "timestamp": 1754690400
  },
  {
    "username": "Fuzzcrumbler",
    "rating": 6.0,
    "comment": "‘Played this without wearing pants, but too punishing. Plus, once behind, you stay there. It ruined the flavor of my yogurt. ‘Seems respected, but it’s not the humdinger it was promised to be, in fact, it wasn’t even the humus. Too little sauce, and too much lard in this.",
    "timestamp": 1753999200
  },
  {
    "username": "ramukaka",
    "rating": 6.0,
    "comment": "Here's some issues:\n\n1. It touts non randomness on it's cover, but it's so dependent on the starting random arrangement that well, it is indeed random. Worse, it's not random in a \"it can affect anyone anytime\" way but a \"if you've gotten a bad hand in poker, you cannot fold and there are no new hands ever\" sort of way.\n\n2. Overhyped heavy euro as usual. The cards representing hires in a corporate structure is very cool and noveau, but it's still close to deck building.\n\n3. You will suffer many games for above-mentioned initial setting randomness and there's no catch up mechanic. I don't know why some people like this— the whole point of a game is to reward players for their smart strategy or good execution, but not so much so that they can then just rest on their laurels with certain victory which will take 3 more hours to actually occur.\n\n4. The milestones take a great game and make it unrealistic, overpowered hell. I was very drawn to the real world setting and mechanics until this popped up.\n\n5. Very bureaucratic, very anal way to figure out which ad runs first, etc etc. Tiebreaks like nearest second restaurant or so would've made it both realistic and less bureaucratic.",
    "timestamp": 1753048800
  },
  {
    "username": "Hfufj748",
    "rating": 6.0,
    "comment": "04/03, 02, 05\nreco-ttheme, reco-wehr, no-bw",
    "timestamp": 1751839200
  },
  {
    "username": "gingermen",
    "rating": 6.0,
    "comment": "want to buy again",
    "timestamp": 1750629600
  },
  {
    "username": "HarryCrocker",
    "rating": 6.0,
    "comment": "Great craic, I didn't realise there were only like 2-3 viable strategies for starting out but that seems typical of splotters. I enjoyed pricing down my meals and sweeping the entire board, but it was too little too late! The others had already built too much of a lead! Super fun capitalist simulator with amusing splotter oddities like crop dust neighbourhoods with advertisement. Sure! love it!",
    "timestamp": 1750370400
  },
  {
    "username": "ChunkyLover",
    "rating": 6.0,
    "comment": "I respect the design of the game, but its just not for me. Played one game of it and two players where out of the game very early.\nAs designed, it is brutal and you will get destroyed if you make mistakes or just play vs better players.\nI am sure that there is a lot of depth in this game and if you play it more, you figure out how to counter the different stategies in the game.\nBut I will properly choose to play something else all the time and never play this game again.",
    "timestamp": 1750197600
  },
  {
    "username": "JoshuaStarr",
    "rating": 6.0,
    "comment": "See comment for Food Chain Magnate: The Ketchup Mechanism & Other Ideas.",
    "timestamp": 1749333600
  },
  {
    "username": "Elvis75",
    "rating": 6.0,
    "comment": "Gekauft am 05.05.2023\nFacebook 65 Euro\n\nVerkauft am 21.11.2023\nEbay 66 Euro",
    "timestamp": 1746309600
  },
  {
    "username": "jasondaplock",
    "rating": 6.0,
    "comment": "Beautiful aesthetic and cool mechanics that are terribly balanced. Might as well stop playing if you make a tactical error.",
    "timestamp": 1745964000
  },
  {
    "username": "Forgeforgeforge",
    "rating": 6.0,
    "comment": "I am shocked at the broad appeal of this game. Every time I've played with new players they just don't get to play at all. It is certainly the least accessible splotter.\n\nReally need exactly 4 players to be interesting but then half the table can quickly be relegated to NPC status in many boards. The interactivity is not sexy.\n\nStill remarkable how well these pieces come together to be more than the sum of their parts.",
    "timestamp": 1745877600
  },
  {
    "username": "Yenorin",
    "rating": 6.0,
    "comment": "This is an amazing design. I just had frustrating experiences every time I’ve played it, so I avoid playing it again in the future.",
    "timestamp": 1744495200
  },
  {
    "username": "Beastly_Venturer",
    "rating": 6.0,
    "comment": "3 plays. Unique game. I just don't really get the cult that follow this designer.",
    "timestamp": 1737154800
  },
  {
    "username": "sculley",
    "rating": 6.0,
    "comment": "I’ve tried. This just isn’t for me. I think it’s the theme.",
    "timestamp": 1736982000
  },
  {
    "username": "pinkzeppelincult",
    "rating": 6.0,
    "comment": "I used to rate this a 9, and I stand by that on behalf of my past self. It really is quite excellent, and I enjoyed getting to a competitive level at it. I think I've just played it enough for me at this point, such that the lows now linger more than the highs. It's a fragile, intense, difficult game, and I've migrated toward designs where the fun factor is more accessible and more resilient to player error.\n\nThe game works better online where the perfect information aspects are tracked for you and easy to reference, because 1 unit of avoidable irl mistake (e.g. forgetting just one of your multiple opponents' dozens of employees, or misreading a house number because it's partially covered by demand tokens) often unavoidably equals 100 units of miserably losing; and forfeiting a game that represents such an investment to play irl is poor form, so you can get stuck with several hours of not-really-gaming. However, it is very convenient to play this online, so I think my main obstacle to wanting to keep playing is really that Recruiting Girl strategies quickly give you way too many decisions to make and possibilities to account for every turn.",
    "timestamp": 1736895600
  },
  {
    "username": "parpari",
    "rating": 5.5,
    "comment": "This game is the oddest duck among BGG top 100 games because it is open information, luckless, brutally punishing, full of indirect take that and long playing time and also, does not have oversaturated colors and busy art or any miniatures. I would love this game more if the Great Zimbabwe did not exist because these games have very similar feeling but Food Chain Magnate takes almost 3 times more longer and more fiddly to play. I guess theme of this game is very appealing that is why so high on the BGG.",
    "timestamp": 1736809200
  },
  {
    "username": "secondofthenew",
    "rating": 6.0,
    "comment": "Delightfully cutthroat. I think you have to be in the right mindset to completely enjoy this game. That mindset being a willingness to appreciate the fine play of your opponents as they spill your company's eviscerated guts to the floor of a deceptively cheery 1950s suburban town.\n\n+Heavily interactive economic game.\n-It is often that when you are doing poorly in this game it is to the point of being almost entirely irrelevant, even in a kingmaking sense. Recommend not trying to play these games out to completion but.",
    "timestamp": 1735513200
  },
  {
    "username": "danephoto",
    "rating": 5.5,
    "comment": "This game falls too far into the long term strategy and engine building camp to be fun for me. The game design is superb. I respect it. But I don't enjoy playing it. Give me more tactical interactions and less plan of the plan 5 turns ahead gameplay. I'd play a mini-game of the supply and demand advertising game within food chain magnate, but you need to remove the org chart and closed off options. This game feels too much like real world work to me.",
    "timestamp": 1735081200
  },
  {
    "username": "Gia187",
    "rating": 6.0,
    "comment": "Intrigerend spel met een leuke tech tree.\nBuiten de tegels is alles qua components wel aangenaam gemaakt.\nHet feit dat je een goede setup moet hebben houdt me niet zozeer tegen.\nDit kan (zoals in catan ed.) wel je hele spel bepalen.\nOok 1 misstap (al dan niet berekend) kan je ondergang gaan betekenen als je ergens op rekent.\nHet spel kan ook relatief snel gedaan zijn wat natuurlijk berekend kan worden. Moet je inderdaad meerdere keren spelen om correct te kunnen bekritiseren, maar dit is voor mij geen must.\nIk snap de hype maar dit is niet meteen een spel dat ik constant wil spelen ondanks dat ik er van genoten heb.",
    "timestamp": 1732402800
  },
  {
    "username": "INeverGame",
    "rating": 6.0,
    "comment": "There seem to be very limited viable strategies. The game author, when asked agreed.",
    "timestamp": 1732057200
  },
  {
    "username": "Citery",
    "rating": 6.0,
    "comment": "Food Chain Magnate is almost unrivaled in the medium for the subtle intensity of its satire, even considering Splotter’s high standard for such things. This is a devilish, biting caricature of 1950’s Americana that is equal parts infatuation and disgust. The monochrome visual design, chauvinistic tokenization of the employees, absurd marketing tactics, and brainless, gluttonous behavior of the consumers all contribute to a repulsively amusing atmosphere that few if any games can match.\n\nThe jockeying for demand, supply, price, housing, and new restaurant locations on the shared board is mean-spirited and spatially compelling, and it is all expertly integrated with the personal employee tableaus. It's just a very cohesive, refined economic system borne out of a surprisingly light ruleset. But, unfortunately, it has a fatal flaw: lurking under this lovely foundation are the damned milestones, a subsystem that, to me, irreparably distorts what is an otherwise striking example of Splotter's timeless, focused, elegant design philosophy.\n\nI understand their mechanical purpose is to provide a source of differentiation between the players in an otherwise no-luck, symmetric game, but the fastest path to some crucial early milestones is so obvious that they end up having the opposite effect: instead of creating interesting and dynamic asymmetries, they corral players into pre-planned, predictable, min-maxed lines of play (Train 1 Turn 2 or Hire 3 Turn 3) that completely overwhelm the strategic discourse of FCM.\n\nThat isn't to say that milestone-like effects don't work in principle. FCM's closest relative, The Great Zimbabwe, has similar first-come-first-served abilities in its Gods and Specialists, but they come at a static cost of VR, the dynamic cost of game-state information, and (critically) the benefits they provide are almost always exploitable by the other players because of TGZ's mutualistic economy. The significant and unilateral milestone benefits in FCM (that are gained for simply doing what you were going to do anyway) seem draconian by comparison. It isn't enough that someone is already losing because their opponents were just a little more efficient with their Recruiting Girls, this player now gets to lose even more because their opponents will be enjoying permanent (and exclusive) reductions in their salaries.\n\nThe whole subsystem is brutal to novices, and the jockeying it creates between experienced players isn't interesting or varied either. I'd like to believe that the randomized setup, initial restaurant placements, and emergent differences in players' employee tableaus could have been enough to drive the game without needing the milestones, but they're just too integrated into the system for me to seriously suggest omitting them.",
    "timestamp": 1722031200
  },
  {
    "username": "loweb1",
    "rating": 6.0,
    "comment": "Too dense to be fun for me. After slogging through the rules I was very happy to lose quickly.",
    "timestamp": 1722031200
  },
  {
    "username": "isamuide",
    "rating": 6.0,
    "comment": "I love the idea but its too long and unforgiving i feel sorry when someone make a bad move sat on the table with no hope for 4 hours",
    "timestamp": 1716847200
  },
  {
    "username": "Haganete",
    "rating": 6.0,
    "comment": "C",
    "timestamp": 1715896800
  },
  {
    "username": "Mac_n_cheese",
    "rating": 6.0,
    "comment": "Ever dream of running a fast-food joint? Neither did I, but here we are. Prepare to think harder about burgers and fries than you ever wanted to. And make sure you’ve got a few hours—this one’s a marathon, not a sprint.",
    "timestamp": 1713391200
  },
  {
    "username": "Vorpa",
    "rating": 6.0,
    "comment": "Very good game. Seriously difficult and meaningful decisions to make. I lost this fair and square a couple of times. For any game it's hard to find the balance between impactful decisions and the ability to get back into the game. This one strongly favors the first. If you start off wrong you wont get back into it. Of course it is your own fault then, but then you will enter 3 hours of excruciating torment. All in all it feels like a game for professional competitions and not so much for a casual and friendly gaming evening.\n\nArt is very on point with the theme and it features very appealing cards. The city is underwhelming. It looks like a rubik cube at best.",
    "timestamp": 1712872800
  },
  {
    "username": "adel9591",
    "rating": 6.0,
    "comment": "Long, lots of downtime and mathy upkeep each round. You can lose the game very early on and then have to sit and watch for hours while the leader solidifies their win. Interesting system however it is sometimes prohibitively space consuming. Setup is a chore as well. Milestones do not seem balanced and having them disappear after one turn is almost game breaking. I would want to try more plays with them but also see if playing without them brings balance to the game.",
    "timestamp": 1711666800
  },
  {
    "username": "Lotrfreak855",
    "rating": 6.0,
    "comment": "26",
    "timestamp": 1708038000
  },
  {
    "username": "individyouall",
    "rating": 6.0,
    "comment": "Update: Having played this some more online, it's grown on me slightly. However despite quite liking many aspects of the game, it seems that in all but the long game ($300pp) the game is really pretty much decided by the initial restaurant placement before the game even starts.\n\n------------\n\nThis isn't a bad game. In fact, it's obviously quite a good one and I can really see the appeal. But for me the brutal consequences of early mistakes strips all the fun out of it. Knowing you've made an error with the first few turns and then having to play on for 3 hours with no real hope of catching up or any real options to influence the game state is not appealing to me in the slightest.\n\nUltimately to play this game is to accept that either two things will happen. Either a) the player with the least experience will likely have a bad time unless other players provide guidance or b) you'll reach a state where every player will play the same starting sequence for the first few rounds of every game for they'll know that if they don't, they'll fall instantly behind and will be out the game from pretty much the off. Neither of those scenarios are really what I want in a game, which is a real shame because there is so much here to like. I expect the expansion will fix some of these issues, but its so impossible and expensive to get that there is no way I'm going to gamble on trying to improve this game that much. Ultimately I'd rather just play something that gives every one around the table something to play for and something to enjoy.",
    "timestamp": 1707865200
  },
  {
    "username": "Eryops",
    "rating": 6.0,
    "comment": "This is the type of game that my brain doesn't easily parse. I would need a few more plays to really grok the game, but sadly, in this day and age of dozens of games coming out every week, I'm unlikely to sit at a table with this very often.\n\nI would call this the 18XX of euros.",
    "timestamp": 1707606000
  },
  {
    "username": "BigLeagueCreative",
    "rating": 6.0,
    "comment": "Game box open but unplayed. Cards still NIS.",
    "timestamp": 1705014000
  },
  {
    "username": "kmaho",
    "rating": 6.0,
    "comment": "This is an EXCELLENT game that I hope to never play again.",
    "timestamp": 1702249200
  },
  {
    "username": "metelo",
    "rating": 6.0,
    "comment": "it was ok. the price becomes the 800-pound gorilla in the room.\n\nI would play it again, but unlikely to ever get it.",
    "timestamp": 1702076400
  },
  {
    "username": "PeculiarPears",
    "rating": 6.0,
    "comment": "Nasty and cutthroat. No catching-up.",
    "timestamp": 1701471600
  },
  {
    "username": "Oppo28",
    "rating": 5.5,
    "comment": "2 plays, super interesting and compelling game. Definitely requires multiple plays though before I can give a rating.\n\nFirst impressions:\n\nPROS:\n-The corporate hierarchy/hiring/training tech tree is awesome. Really unique, I'm not sure why another game hasn't borrowed this yet\n-The achievements allow for different players to specialize, allowing different strategies to formulate (but not be pigeon holed from the beginning like games w/ Variable Player Powers can do)\n-A lot of player interaction. Can't just optimize your own board, but have to react to other players' choices\n-Art/theme is quite nice (except on the grid/map, which is super bland and cheap looking).\n\nCONS:\n-Extremely complex. The core systems are actually pretty intuitive and easy to grasp, but there are just too many little rules and sub-systems. I feel like they could have easily simplified some things without losing the meat of the game. I could easily teach the main action system after one play but would struggle to teach all of the little details\n-No catch up mechanism. We realized a certain player was 100% going to win after just a few rounds.",
    "timestamp": 1700694000
  },
  {
    "username": "kuglerix",
    "rating": 6.0,
    "comment": "Could receive some streamlining",
    "timestamp": 1700607600
  },
  {
    "username": "Pozman",
    "rating": 6.0,
    "comment": "I know it's hard to probably judge this game after only 1 play, but these are my findings:\n\nIn my 1 play I really enjoyed the first 2/3 of our game, I actually thought Splotter would finally have made a game I could really enjoy and was worth his high selling price. But the last 1/3 completely destroyed all the good feelings I had before. So a little reconstruction of our game:\n\nFirst you have the inevitable race for the milestones, which is perfectly fine as you can chose to follow or to go for something different. But then the game sort of split up: where 3 players played 'positive' and already invested in advertisement and production in the hope to get some income, the 4th player sort of built up a powerful engine, getting his sole income from waitresses, but for instance he could hire a person and upgrade it twice in the same turn, which gave him a lot of flexibility. So while the others created certain needs, he made a super factory, baked 8 pizzas and 8 burgers and collected all the drinks he wanted in a single turn and then positioned his restaurants cleverly so that he would fulfill all demands. By doing that, there was 1 full round where he simply cleared the board and made almost $ 150 as he had off course also a CFO. And the round after that he fulfilled 3/4 of the demands. We had played 2 hours at that point and everybody simply knew that player would win: as his card engine was by far better, he could anticipate to everything (if you would take a Discount Manager that gives - $3, he could simply do the same AND some other stuff), but the game still lasted for 1 extra hour and there was only $ 600 extra in the bank :s\n\nThat brings me to the 2 major concerns I have with this game:\n\n1) If you wanna win this game, you have to be the better leech. You simply have to let others make the efforts (like advertisement or building gardens) and then make sure you take the profits from their sweat. And off course you can argue: everybody can play like that, which is off course true, but then then you can ask yourself if that's the kind of game you wanna play? I certainly not.\n2) For me this was the first game, but the others had played 3 more games in total. In all of these games there seemed to be a breaking point at a certain moment: 1 player who could cash in big time after which everybody knew he/she would be the winner. If the games end shortly after that, that's not an issue. But if the games then still lasts for so long you could easily play a fun game instead (like in our case still 1 hour, and I'm horrified by the thought there would have been $ 1200 in the bank reserve at that point :s), then for me that's a big problem.\n\n\nIt certainly leaves me puzzled: the first 2/3 makes me intrigued about this game, wanna found out more. But the last 1/3 says 'keep it in shrink, the resell value will be higher'.",
    "timestamp": 1700348400
  },
  {
    "username": "mawilson4",
    "rating": 6.0,
    "comment": "A game with a fervent fanbase, and not without reason. FCM blends the strategic and the interactive in equally profound amounts. The rules aren't particularly difficult to learn for such a \"heavy\" game, but maneuvering within them surely is. As such, this will almost invariably reward the experienced player who can navigate the game's puzzle to eke the most out of it. For this reason, it has a problem with audience, because many will have to trudge through a lot of hopeless games to learn the strategy, only to find themselves trying to convince others to weather the same gauntlet in order to find people to play with.\n\nIf you can find equally invested players of similar skill, and who don't play slowly, you're set. Otherwise, the game can produce mixed experiences. I've had brilliant, exciting games and interminable slogs, and sometimes both feelings in the same session.\n\nFCM has also produced the worst cases of analysis paralysis I've ever seen in board gaming. The highs the game can produce are really high, but the lows are potentially mind-numbing, including one session that I might rate as my worst single session...ever. I rate it a 6, but have never had a \"6\" session. It's more the average of the extremities this game produces.\n\nHard to recommend to a general audience, but if this is your type of game, it may rightly be among your favorites.\n\nReview:\nhttps://bumblingthroughdungeons.com/food-chain-magnate-revie...",
    "timestamp": 1696456800
  },
  {
    "username": "familygaming",
    "rating": 6.0,
    "comment": "I was a doubter: about the price, about the art, about the gameplay. Consider me convinced. Incredible strategy game; components are great; art is perfect for the 50's era it is trying to invoke; gameplay is brutal and clever. Yes it's incredibly expensive, but I've bought two $60 games that weren't much fun, so paying $120 for a game this fun doesn't seem all that terrible.\n\nRating history: 8|8|8|8|10",
    "timestamp": 1693692000
  },
  {
    "username": "Vantastic",
    "rating": 6.0,
    "comment": "I love that you can really (and I do mean REALLY) get in each others' faces by manipulating demand. However, while the milestones provide some exciting early game decisions, they also place the game on strategic rails if you're playing competitively. That isn't to say that any particular set of milestones is the best combination, moreso that you should have planned your first 5 or more moves before the game has even started.\n\nThat and the 1 turn delay in being able to shift what you're doing make turn order pretty crucial throughout the game and settled a bit farther on the strategic side of the spectrum than I like (I usually like more tactical gameplay).\n\nSo much of the game turns on you being willing to put in the effort to puzzle out who will get what and when. This means that you end up focusing on the puzzle and the mechanisms much more than the interaction between the players. There's lots of interaction, but it is mediated by the layers of puzzle.\n\nFor me I feel like I would love the game if it were scaled down by 1/2 in the number of choices so that you could focus on executing more clearly the parts that are the interesting decisions.\n\nA great design that I'll happily play every now and again (but I would rarely choose to play over other options since it wasn't really designed with me in mind).",
    "timestamp": 1693519200
  },
  {
    "username": "funnyorifice",
    "rating": 6.0,
    "comment": "There is a lot of player interaction in this game! But it really isn't very heavy, just a lot of decisions you need to make. You really need to pay attention to what other people are doing. It is good, but I definitely need a break between plays",
    "timestamp": 1692309600
  },
  {
    "username": "Iguloy",
    "rating": 6.0,
    "comment": "Too cutthroat, doesn't play that well with two.",
    "timestamp": 1691272800
  },
  {
    "username": "RARobinson",
    "rating": 6.0,
    "comment": "Played",
    "timestamp": 1690927200
  },
  {
    "username": "LordBalder",
    "rating": 6.0,
    "comment": "Aside from looking pretty ugly on the table, this game is really ingenious. Quite simple in its core it is extremely hard to master and full of interesting strategies.\n\nBut it is long and VERY punishing.",
    "timestamp": 1688594400
  },
  {
    "username": "TalesWithinWheels",
    "rating": 6.0,
    "comment": "I liked it a lot, but no one I play with agrees. In the end, we just have better options when it comes to economic games. The fact that it heavily privileges experienced players doesn't help. There really are just a couple of right answers.",
    "timestamp": 1683583200
  },
  {
    "username": "krit1789",
    "rating": 6.0,
    "comment": "Economic engine building. Solid design but fairly unforgiving to the uninitiated.",
    "timestamp": 1677970800
  },
  {
    "username": "Eendenregen",
    "rating": 6.0,
    "comment": "Need more plays.",
    "timestamp": 1677020400
  },
  {
    "username": "buderix80",
    "rating": 6.0,
    "comment": "It's heavy. If you play it with someone that is experienced you want stand a chance.",
    "timestamp": 1676847600
  },
  {
    "username": "timsteen",
    "rating": 6.0,
    "comment": "(made up date for play)",
    "timestamp": 1675638000
  },
  {
    "username": "Kamaitatchi",
    "rating": 6.0,
    "comment": "Good, tactical design that does a lot with little.\nI love the milestone system.\n\nThat being said, there are some flaws in the design that can trap unwary players. I don't mind games where your first play has to be taken as a teaching moment but this is one of those where a bad start can literally cost you the game.\n\nGraphic design is good but the art is horrid.\n\n\nI want to play more!",
    "timestamp": 1672009200
  },
  {
    "username": "eadred",
    "rating": 5.5,
    "comment": "Unforgiving, and not to my taste.",
    "timestamp": 1670972400
  },
  {
    "username": "BillionsOfStars",
    "rating": 6.0,
    "comment": "Just dont play against Serious Gamers...",
    "timestamp": 1669330800
  },
  {
    "username": "charleaux",
    "rating": 6.0,
    "comment": "One of those games where I really respect the design but that is ultimately just not my cup of tea. The game can be very cutthroat and it's very to thwart opponents' plans when you know the game. Experienced players will undoubtedly have the upper hand and I just don't play the same games over and over enough to become proficient enough.",
    "timestamp": 1667516400
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 6.0,
    "comment": "I played this 9 times. Ultimately it failed for me. The game is smart. Perhaps smarter than I am. Ultimately it felt like more work than fun.\n\n10th play, on a friend’s copy. Same situation. Just too much optimizing for me.",
    "timestamp": 1667080800
  },
  {
    "username": "RippedFromTheCrypt",
    "rating": 6.0,
    "comment": "Ugly, Unenjoyable and overly complicated. Desperately needs streamlining. And way too long. Made worse by runaway leader issues. However thematically it sort of works.",
    "timestamp": 1666476000
  },
  {
    "username": "roood",
    "rating": 6.0,
    "comment": "This game has so many choices, and a very chess \"plan 5 moves ahead\" feel to it. But also very reactionary to whatever the first person does, so you don't miss out. The biggest flaw for me, is if I don't pick the right location right off the bat, I feel the rest of the game is just trying to make up for that mistake. The art is both beautiful and terrible. The characters and cards look great and nail the aesthetic they were targeting. But then the game tiles are plain white with black boxes, and the fact that you simply MUST make your own storage assistants to make the game playable is a big down side.\n\nThere are a ton of strategies and interesting things you can do, but after a few playthroughs, it started feeling more like the work it was meant to emulate than a game about it. Sadly, that ends up hurting it more than helping it.",
    "timestamp": 1660514400
  },
  {
    "username": "patella",
    "rating": 6.0,
    "comment": "My rating is based purely on the rating meter -- not necessarily on what I think is the quality of the game. I think the game is stellar -- but it is UN.FOR.GIV.ING. So I may be in the mood to play, but it won't always be my personal first choice. This is certainly a game that is aided by multiple plays so that you can identify and strategize all the potential pitfalls. \"Oh, there's only ONE of those cards/tiles/whatever? Good to know, especially since you just got it and I was planning to on my very next turn.\" In initial games, that one move may cost you the game -- but I suspect there are ways to mitigate that with careful other plays, once you learn what they are.",
    "timestamp": 1658959200
  },
  {
    "username": "doctoryes0",
    "rating": 6.0,
    "comment": "As we were packing up the game after our first play it hit me...\n\nIt's Indonesia! They fixed Indonesia!\n\nHa! I didn't even know it was the same designers! The theme is totally different but I had this strange sense of familiarity throughout until it hit me. There were always things I loved about Indonesia but it felt flawed, and not just by its overwhelming length and the almost unusable components. FCM is the total conceptual reboot it desperately needed.\n\nAnd what a great game it turned out to be. I absolutely love it. 3p took about 2.5 hours, amazing feeling of ramping up throughout. It's like they took a normal tech tree and pulled out 2/3 of the cards. Every step up is huge but it all feels balanced.\n\nJust brilliant!\n\nEdit: After several more plays, there is a problem: The Price War. Only once has a full-on price war occurred, and it was my own doing. I invested a lot of actions in marketing and no one else did. They focussed on poaching the demand I had created. So I started cutting prices to get some share of the sales. They started cutting prices too, so I cut them to $0. I was still getting the $5 marketing bonus and more importantly I was preventing my opponents from winning the game.\n\nUnfortunately, the price war strategy also prevented us from finishing the game. We were already three hours in when we quit, mainly from disinterest. One of the players suffers from severe AP, which didn't help, but honestly no one cared about the result.\n\nFCM is a great game but as has been stated before, the price war thing is there, and although you may believe it's a symptom of groupthink, I can tell you that if you're playing to win, it is sometimes your best option, even if it is definitely not a fun one.\n\nIn a game this intensely cut-throat, having an effective weapon in your arsenal that you may be unwilling to use - even when it's absolutely necessary - simply because it's no fun at all, and practically speaking, because it may very likely keep the game off the table in the future, can only be described as a flaw.\n\nRating dropped to a 6. I understand Ketchup addresses the problem but I don't want to shell out another $100 to fix the flaw, and I can't play it in its current state.\n\nAlso it’s a dirty little secret of FCM fans but in a 4p game at least one player is always eliminated at setup by random map gen.",
    "timestamp": 1658095200
  },
  {
    "username": "staszek",
    "rating": 6.0,
    "comment": "Essen 2015\n1 online",
    "timestamp": 1655330400
  },
  {
    "username": "John Weber",
    "rating": 6.0,
    "comment": "Tenative rating based on around a dozen plays thus far, half of them on-line at the excellent implementation at boardgamecore.net. Very heavy economic game with a big learning curve that is very unforgiving. Zero luck factor once the random board is set up. Enjoying the challenge of this one despite getting my butt kicked a few times, right now I would say it's quite possible the rating could go up with a few more plays. The main aspect of the game I like best is the recruiting/training mechanism which works smoothly and is very intuitive. The one negative aspect is that it can be an all or nothing game, meaning you can go from winning to zero or even negative sales if you get in a situation where another player can outproduce or undercut you, and right now that's an aspect of the game I am somewhat uncomfortable with.\n\nEDIT; Dropping the rating down from 8 to 6. This game has fallen totally out of my play rotation, mainly because of the one unrealistic negative aspect: if one company is doing a little bit better at generating sales, they tend to win 90-100% of the business, not 55-60% as would be the case in real life. Think it might be better as a computer game. Also, a pain to set up with all the different cards.",
    "timestamp": 1654207200
  },
  {
    "username": "LotrScaper",
    "rating": 6.0,
    "comment": "Very long, especially from the perspective of anyone who can tell they have fallen behind in their engine building with another hour or two left to play.\n\nPure skill game where mistakes hurt players significantly. Cutthroat competition.",
    "timestamp": 1653170400
  },
  {
    "username": "Elandil84",
    "rating": 6.0,
    "comment": "Excellent game if you want in-your-face competition. In my opinion, though, initial restaurant placement is the single most important decision, unless you're willing to build other houses or multiple restaurants. This game is very much about seeing which way the wind is blowing.",
    "timestamp": 1651528800
  },
  {
    "username": "Tigrillo",
    "rating": 6.0,
    "comment": "Great first impression but too early to write anything meaningful about the game.\n\nMilestone Boards & Card Accordion.",
    "timestamp": 1651442400
  },
  {
    "username": "WVinz",
    "rating": 7.0,
    "comment": "4.21",
    "timestamp": 1761606000
  },
  {
    "username": "Jillys",
    "rating": 7.4,
    "comment": "Kanske",
    "timestamp": 1761606000
  },
  {
    "username": "TheSlov",
    "rating": 7.0,
    "comment": "Only played one game so far with 3 players. I don't understand the appeal, other than word of mouth as to how \"heavy\" this game is.\nI've played heavier and more complex games, and I would say this game is way more \"fiddly\" rather than \"heavy\".\nI guess it's the random setup to blame for the mediocre score, as we had a setup where each of us just focused on one house in the neighborhood, and whomever got the Luxury Manager first was the winner about an hour before the game ended. Yes, there are strategies to lower your price but based on distance and the random dead-end roads, it was very hard for two of us to compete with the 3rd player.\nI guess this game will either be your favorite or a 3 hour grind based on setup, and to me that doesn't speak highly of it's design, even if the mechanisms and interaction is actually interesting and worth exploring. I guess that's fun? Your strategy is basically decided at setup, at least the most optimal one. There wasn't a lot of competition for turn order either, it was unimportant. The fact that houses/gardens, your restaurant, AND billboards take up map space is...not my favorite part, as the map setup can be really awkward and...well just not fun. In our setup we had a house alone in the corner of the map with roads cutting it off from early game access (not that it mattered in the end).\nI am willing to give it another go but I'm actually more interested in doing a little overhaul and making my own map tiles. Maybe 2-4 starting map tiles that are always in the game, etc.\nI'm not even going to talk about the quality of the production, which rivals a proto-type you can make in MS Word. That and the table hog nature of ALL the milestones and employees make this a tablehog.\n\nEDIT: Replayed with 4. The map is the only awkward and harder to understand part of the game that sort of eludes me. I lost bad because I thought I had a isolated house but that was not the case, then I was stuck. Basically lost the game at turn 1. I did the best I could but it was sort of futile. The Milestones are insane, and I know that might be the appeal of the game but I find they through off the game a lot (especially CFO). There is also a \"rich get richer\" problem, and there's no incentive REALLY for first player and it seems last player gets to see what everyone else is going for and has the benefit of reacting. Still find the game more fiddly than heavy, and it doesn't have the depth of any other \"heavy\" games such as On Mars or Gallerist or any similar game.",
    "timestamp": 1761519600
  },
  {
    "username": "bomberleung",
    "rating": 7.0,
    "comment": "BGG39\nEconomic, Heavy",
    "timestamp": 1761256800
  },
  {
    "username": "Mr Mjeh",
    "rating": 6.5,
    "comment": "Excellent restaurant game that is very enjoyable in how it plays: a deck building mechanic, but closer to hand building",
    "timestamp": 1760220000
  },
  {
    "username": "btasam",
    "rating": 7.0,
    "comment": "Food Chain Magnate is an excellently designed game that offers incredible depth on so many levels. The positional tactics are so satisfying. Unfortunately, it's a tough game to get to the table regularly and it takes up a lot of space. There are a few early strategies that are less obvious for new players.",
    "timestamp": 1759874400
  },
  {
    "username": "DoctorPhil",
    "rating": 7.4,
    "comment": "After 1 play: I played a beginner game to get a feel for the game. I really liked this game, I like the puzzle of the modular board, yet the predictability of good strategies with slight changes based on the board and players to potentially make each game feel different. Lots of player interaction in that regard. Can't wait to play it more.\n\nhttp://play.boardgamecore.net/\n\nCriteria (out of 5)\nRules complexity 2\nPlaytime/complexity ratio 3\nStrategic avenues 5\nMechanism strength 4\nThematic integration 5\nVariability 3\nReplayability 3\nFun factor 3\nSolo mode\nPlayer interaction 5\nElement of mastery 4\n\nOverall 7.4 out of 10",
    "timestamp": 1759356000
  },
  {
    "username": "silenceisgolder",
    "rating": 7.0,
    "comment": "A very cool game that ticks enough of my boxes that I'd never turn it down. I'm not as crazy about it as some others because I don't love the doublethink, the deckbuilding, or the wild pace of escalation. The Great Zimbabwe is a little more to my taste but this is a fun, very neat game.",
    "timestamp": 1758146400
  },
  {
    "username": "Generalkhun",
    "rating": 7.0,
    "comment": "This game have many great mechanics on many aspects. Delivering a food on demands created, Organization charts creating on turn gave a thrilling moment. The biggest flaws of this game is surely a catch up mechanics. The first game will be like this every time \"why should we continue playing the game another 3-4 hours when I cannot do anything ?\".\n\nIs this a flaws of game design? Probably not if we said that this require more than 2-3 plays for a player to fully got a rule and all milestones grabbing strategies. But the real question is can you tolerate enough until that point? until all \"learning games\" has passed?\n\nInteresting that someone who designed a top notch title like The Great Zimbabwe just push it too far on an extreme sharp edges/punishment, feel like an experiment rather than a finished game\n\nEdit 9/9/25: from 3.5 -> 7 after the second play 4p. this game has a very very great potential to be the best long term strategy playing game in the same tier with Trickerion. Really need to play one more time to wrap my brain to the correct framework. This is still the most punishing game ever played and please play with people (and your self) that \"think Rationally\" on every move to enjoy this game",
    "timestamp": 1757368800
  },
  {
    "username": "wynarator",
    "rating": 7.0,
    "comment": "The game itself is more like 8/10 but I substract one star for downtime, bookkeeping and playtime - a bit too long for my personal taste.",
    "timestamp": 1757109600
  },
  {
    "username": "tomdabom98",
    "rating": 7.0,
    "comment": "A tight, long, meaty, and cruel at times tableau building economic game that is one of a kind imo. I'm excited to try the expansion as i've heard it tones down the cruelness a bit. There is little to no randomness in the game which can promote AP, but overall an amazing game that i am happy to own. It is also worth noting that an organizer that can hold all the recruitable employees and a laminated sheet with milestones and draw erase markers is required for this game to not take up an obnoxius amount of table space. If you spend the money to mitigate these negatives the game is a great addition to a collection.\n\n\nUpdate 9/6/2025\nDuring my time owning this game it never hit the table. This was due in part to the organization and also in part to the fact that the game is so punishing when you make mistakes. The punishment alone makes the game hard to table with a new group because you would have to play a couple games back to back to get a good feel for it and even then the game can be rough.\n\nIt really is a good game but i think in a lot of ways it kind of needs the ketchup mechanism and I never got around to trying it with it. I wouldnt turn down playing it, but a game that has been in my collection for over a year and never gets played is one that needs to go.",
    "timestamp": 1757109600
  },
  {
    "username": "Mentatgamer",
    "rating": 7.0,
    "comment": "High interaction, complex and no luck. Unforgiving. lose friends. Masterpiece.",
    "timestamp": 1756677600
  },
  {
    "username": "PROJ",
    "rating": 7.0,
    "comment": "~24-30 plays in.\n\nI find my rating dropping the more I play. We've been playing it a bit more recently, and I am reminded why this game falls a little short of the truly excellent euros that I usually play in terms of design.\n\nThe game has some real problems in its level of interaction and punishment along with its other design elements. In spite of how its advertised on the box and by some of its advocates, there are elements of luck in the game. Let's get this out of the way now: luck is based on randomness, and randomness is how we model the uncertain. Rock paper scissors, and, by extension, other similar simultaneous action mechanisms, have luck because you can never be 100% certain of your opponents selection. While the human brain is vastly more complex than a die, fundamentally, it is no different, in that however the decision within it is made, we are not privvy to knowing with 100% what that decision is. Whether or not your opponent has agency of this decision (which is actually an interesting subject matter in and of itself) is not relevant to whether or not it is random/involves luck. Therefore, the simultaneous play of restructuring in FCM (as well as the selection of reserve cards) involves some degree of luck.\n\nThe problem with this is that the game is also incredibly punishing for a wrong move. Frequently, as players become more skilled and/or closer in skill to one another, this luck has an outsized effect on the game. Players can get into frequent circumstances where, either in relation to number of open slots or pricing of their goods, the right play during restructuring is highly dependent on what other people are secretly choosing. That wouldn't be so bad, if it didn't also potentially scuttle your entire game by guessing wrong.\n\nFCM also uses an action point system of sorts. During the 9-5 phase, you perform all of your employees actions. After having suffered through Vlaada's action point systems in Through the Ages and Mage Knight (Two games, which, while excellent in many ways, clearly suffer from these systems in terms of needless downtime), you would think designers would know that these systems can introduce ridiculous downtimes without any demonstrable increase in depth.\n\nThis game also has the issue of putting a lot of tedious arithmetic in between its players and the decisions they want to make. A lot of turns have an amount of arithmetic that takes some time to calculate but is perfectly possible if one spends several minutes figuring it out. This leads to awkward situations where one player is almost obligated to perform this arithmetic, because the punishment for just trying to use fuzzy estimation or winging it is losing the game. Meanwhile, this drags the game unnecessarily. One of the reasons point salad designs work is that it allows for more fuzzy calculation without being brutally punishing. I could also explain how this ties in with the other design issues I've mentioned earlier like the action point system, but I might save that for a more in-depth review.\n\nThe shame of this is that there's a lot of really interesting things going on in this game, and the mechanics are unique among the typical euros I often play. I really love the idea behind the balance of obtaining profits now vs. expanding your infrastructure and it makes for a really interesting balance. This is potential is why I still rate it fairly well. However, I think its design flaws are a good reinforcement for why heavy euros have often moved in the direction they have: more subtle interaction, single action turns, and point salad mechanics aren't just designs for people afraid of conflict - they have extremely beneficial upsides that overall improve the gameplay of people looking for more serious, analytical games.",
    "timestamp": 1756591200
  },
  {
    "username": "Killi",
    "rating": 7.0,
    "comment": "Possibly Splotter's most thematic game, but not my favorite. Plays well at 3p/4p/5p, very mean and tactical, some players might hate it.\nCan drag a bit too long and has too much upkeep for my taste.",
    "timestamp": 1756504800
  },
  {
    "username": "Mestail",
    "rating": 7.0,
    "comment": "The game is Ok, but has too high an entry barrier and too steep a learning curve.",
    "timestamp": 1755468000
  },
  {
    "username": "frasti",
    "rating": 6.5,
    "comment": "24/02/11 V GF collectors edition with minis",
    "timestamp": 1752962400
  },
  {
    "username": "Grawhs",
    "rating": 7.0,
    "comment": "I appreciate the interactive, innovative and thematic design with the cutthroat fights. You can find different routes to be the strongest participant in the fast-food market i.e. kill the rivals with marketing, cut off prizes, build more restaurants. You can really feel yourself as a great fast food chain founder. Maybe it is a bit too much of a brain-burner for my taste, and the learning curve is rather steep, and the game is super cruel for newbees.",
    "timestamp": 1752616800
  },
  {
    "username": "bender_mania",
    "rating": 7.0,
    "comment": "Has small wooden poker chips and a wooden insert.",
    "timestamp": 1751925600
  },
  {
    "username": "RZRBLCK",
    "rating": 7.0,
    "comment": "По описанию — симулятор бухгалтера, а на деле очень простая по правилам и интересная конфликтная игра.",
    "timestamp": 1748728800
  },
  {
    "username": "Narieto",
    "rating": 7.0,
    "comment": "probably to go",
    "timestamp": 1748469600
  },
  {
    "username": "danielmleitao",
    "rating": 7.0,
    "comment": "Rated: 05/2021\nEdited: -",
    "timestamp": 1746655200
  },
  {
    "username": "Jackieh9",
    "rating": 7.0,
    "comment": "Really easy to screw yourself over (which I did plenty). Curious what the ketchup mechanism does. Pretty cool restaurant management game where you're hiring staff to do work for you but you still have to pay them. Also includes a map aspect where you're placing restaurants and ads on a shared map like cities skylines and adjacency and orientation is important and not my favorite. The mechanics and game aren't hard at all but the strategy is. Michael taught at board room. Really want to play again",
    "timestamp": 1744927200
  },
  {
    "username": "DexGeek",
    "rating": 6.9,
    "comment": "Owner: Dex",
    "timestamp": 1744754400
  },
  {
    "username": "Theisen007",
    "rating": 7.0,
    "comment": "All pieces and components in great shape, box is a little beat up. Can send pics if interested.",
    "timestamp": 1743804000
  },
  {
    "username": "deehizzle",
    "rating": 7.0,
    "comment": "Deluxe Edition pledge - August 2025",
    "timestamp": 1741647600
  },
  {
    "username": "ozangumus",
    "rating": 7.0,
    "comment": "Score after first play.",
    "timestamp": 1740783600
  },
  {
    "username": "imaginaryforce",
    "rating": 7.0,
    "comment": "Fairly simple and straight-forward but punishing. When I say punishing I mean that the game has no come-back mechanisms whatsoever. At no point in time there will be something that will bail you out of a bad spot. If you start falling behind, it's impossible to come back. The game is a race from start to finish, from who gets to the milestones first, to who gets to the best marketing campaigns first, to who gets to hire the best people first.",
    "timestamp": 1740783600
  },
  {
    "username": "Stoicgame",
    "rating": 6.5,
    "comment": "A must play",
    "timestamp": 1739142000
  },
  {
    "username": "gregbigler",
    "rating": 7.0,
    "comment": "Christmas 2020\nFairly easy to learn, but lots of little details.\nAlso very easy to lose badly!",
    "timestamp": 1738796400
  },
  {
    "username": "MrGrusome",
    "rating": 7.0,
    "comment": "One of the most detailed and deep economy games. As for the downsides - time to play is indefinite. At one of the games we've stuck in price wars with high production and lack of marketing - that caused total revenue generation for about 5-10$ per round and that was a 500$+ game. Had to finish prematurely on the 5th hour.",
    "timestamp": 1738278000
  },
  {
    "username": "Vinnichi",
    "rating": 7.0,
    "comment": "[VINCENT]\nBig Mac's a Big Mac, but they call it Le Big Mac.\n[JULES]\nLe big Mac! Ahhaha, what do they call a Whopper?\n\n[VINCENT]\nI dunno, I didn't go into a Burger King.\n\n+ Ketchup\n\n\nhigher rating after adding Ketchup",
    "timestamp": 1737846000
  },
  {
    "username": "kalenelycap",
    "rating": 7.0,
    "comment": "Fun concept, usually runaway games competitively though",
    "timestamp": 1737241200
  },
  {
    "username": "dieterminator",
    "rating": 7.0,
    "comment": "Seems to have some interesting mecanics, we played only a short game, since who know the game best, resigned early 2nd round, forseeing who would win it. It seems punishing like Monopoly, but will that probably figuring out, playing more openings.",
    "timestamp": 1736290800
  },
  {
    "username": "djsturz",
    "rating": 7.0,
    "comment": "Solid hand management system and incredibly thematic actions and consequences. Not so fun to play this with players on a very different experience level from you.",
    "timestamp": 1736204400
  },
  {
    "username": "simon_dt",
    "rating": 7.5,
    "comment": "I find that the idea of managing a fast food franchise is beautifully implemented in the mechanics and general design of the game. The rules and the sequence of actions are relatively simple, but the play is deep.\nThe intriguing characteristic of such a game is that there are no hidden information! But it is also the source of frustration when you are losing! Because when you see that your opponents are outperforming you, then you'll probably play the rest of your rounds knowing you'll lose.\nThat's why it is a game fully enjoyable when all players are at the same level of experience and strategic thinking, or when you want to play it casually.\nThis aspect prevent me to give a score of 8 or more, but I'm longing to re-play it and testing also the re-playability.\nI need to study few effective strategies before playing it again.",
    "timestamp": 1762210800
  },
  {
    "username": "Gus_Fring",
    "rating": 8.0,
    "comment": "Exploitive “deluxe” version puts a stink on this game. Too many other games that are produced by companies that don’t see gamers as FOMO chumps to waste time on this one. Lucky Duck did it but Splotter let them pull the trigger.",
    "timestamp": 1762210800
  },
  {
    "username": "Entropology",
    "rating": 8.0,
    "comment": "New milestones from the expansion are critical. They provide some direct focus on your path (no more weak first turns by beginners). Really hits that sweet spot of being just the right length and usually ending on a massive cash haul. A good way to end a game!",
    "timestamp": 1761865200
  },
  {
    "username": "VikingBurger",
    "rating": 8.0,
    "comment": "Nyílt információ, eszement jó engine építés, op képességek.\nNagyon okos és nagyon kegyetlen játék. Még csak ketten játszottam és mindig a kellemesebb arcát mutatta felém, de nagyon különleges élmény.",
    "timestamp": 1761606000
  },
  {
    "username": "ItsMagic",
    "rating": 8.3,
    "comment": "constructing unlocking mastering roleplaying specializing positioning stealing sustaining deductive stimulating thematic convincing;\nfavoured over Horseless Carriage, Cupcake Empire, Hab & Gut",
    "timestamp": 1760824800
  },
  {
    "username": "Treemonk",
    "rating": 8.0,
    "comment": "So good. Rules surprisingly easy - it's what you do with them that makes it tricky.\n\nMight drop half a point if viable beginnings turn out to be a bit on rails.\n\nThis one is great fun even if you're trying a losing strategy.\n\nDropped a point due to group establishing patterns of play. Almost feels like outcome was determined during initial placement and turn order.",
    "timestamp": 1760565600
  },
  {
    "username": "Malachi",
    "rating": 8.0,
    "comment": "I still find this game fairly compelling. The nuances of outmaneuvering your opponents can be tricky. It is very easy to make a misstep that dramatically changes your (and other's) trajectory in the game.\n\n27 plays, across all player counts",
    "timestamp": 1760479200
  },
  {
    "username": "Master Margarita",
    "rating": 8.0,
    "comment": "*",
    "timestamp": 1760306400
  },
  {
    "username": "marcos111",
    "rating": 8.0,
    "comment": "140€ com sleeves\n\nVinted",
    "timestamp": 1760220000
  },
  {
    "username": "Noboe",
    "rating": 8.0,
    "comment": "Feels repetitive after some plays but good area control/economical game that is full of interaction.",
    "timestamp": 1760047200
  },
  {
    "username": "LL81",
    "rating": 8.0,
    "comment": "Pre.",
    "timestamp": 1759701600
  },
  {
    "username": "tatooinehermit",
    "rating": 8.0,
    "comment": "Just as other Splotter games, it's intense, deep, interactive, replayable, unforgiving, and quite mathy. I really enjoy its vintage aesthetics.",
    "timestamp": 1759442400
  },
  {
    "username": "NateClark",
    "rating": 8.0,
    "comment": "Genuinely don't know what to think of this after one game. I hate it and I want to try it again.",
    "timestamp": 1759442400
  },
  {
    "username": "kensiebensie",
    "rating": 8.0,
    "comment": "Gift from Tanner (upgrade)",
    "timestamp": 1759356000
  },
  {
    "username": "patateman44",
    "rating": 8.0,
    "comment": "Top mais sans les milles tone avec les filles",
    "timestamp": 1758751200
  },
  {
    "username": "Edlomax",
    "rating": 7.7,
    "comment": "Realmente, como falam, é um jogo bastante diferente. Temos, de fato, uma simulação aqui, com suas mínimas incoerências temáticas facilmente abstraíveis diante do todo que este jogo apresenta (dirigível para buscar bebidas nos depósitos foi o único ponto que não deu pra engolir kk).\n\nA arte do tabuleiro é indefensavelmente horrorosa. Uma coisa é o estilo artístico remetendo aos anos em que o jogo se passa, que é aplicado aos componentes como caixa, manual, ajuda do jogador e cartas (ainda assim dava pra ser um pouco melhor). E outra, bem diferente, é a arte tosca desse tabuleiro que chega a ser ofensiva, e nos entrega uma cidade com cara de esboço, desenho infantil, protótipo etc, que não parece em nada com uma cidade de verdade. Até o tabuleiro do Jogo da Vida parece mais uma cidade do que isso.\n\nAlém da arte, a produção do jogo também deixa a desejar, pois embora a qualidade dos componentes seja muito boa, estes mesmos componentes não são suficientes para criar uma forte imersão. Uma questão pontual que vale citar é a bizarrice da caixa com a parte de trás toda em branco que, felizmente, na versão Brasileira foi melhorada.\n\nÉ um jogo extremamente determinístico (informação perfeita), o que por si só poderia torná-lo previsível e monótono, porém, ele possui tantas variáveis a se considerar na sua jogada, que acaba se tornando um jogo opaco, onde para você conseguir enxergar mais longe, você precisa compreender muito bem o funcionamento de cada uma de suas muitas cartas, seus combos e sinergias, a estrutura do turno que também é longa, e ter friesa para se programar com precisão cirúrgica. O que eleva sua complexidade e, em uma tacada só, o torna fortemente propenso ao AP e downtime, e com uma curva íngreme de aprendizado. Vai precisar de várias partidas para começar a dominar o jogo.\n\nPor algum motivo ele me traz um sentimento de xadrez, onde rigorosamente QUALQUER MOVIMENTO do adversário é extremamente significativo e você precisa ficar a todo momento vidrado acompanhando cada mínima alteração no estado do jogo. E são muitos elementos: tabuleiro central, cartas disponíveis para compra, a ordem dos jogadores nos turnos, o potencial preço dos adversários, campanhas de marketing, a porta dos restaurantes, ter comida para vender, cartas na mão dos adversários etc. A leitura do jogo dos adversários precisa ser constante. Tudo isso junto me remete ao xadrez, só que aqui esse esforço é muito mais intenso porque ele se multiplica pelo número de jogadores. Ou seja, a grande quantidade de variáveis para se observar que ele possui, ainda por cima cresce exponencialmente de acordo com a quantidade de jogadores. É indiscutivelmente um jogo peso 4+ na escala do BGG.\n\nÉ um jogo bastante punitivo e não há muita margem para erros: qualquer deslize pode já comprometer todo o seu jogo, só havendo chance de recuperação se os adversários também errarem. Caso contrário a derrota é praticamente certa;\n\nAlém disso, novamente lembrando o xadrez, é um jogo que também possui scripts iniciais. E se você não os fizer, também haverá grande chance de ficar de coadjuvante na partida.\n\nNo conjunto da obra, mesmo sendo um jogo fora da curva, na data de hoje (set/2025), como produto em si, não vale R$800. No máximo a metade.\n\n• Rejogabilidade/Minimização de Scripts: 8\n• Qualidade do Desafio/Catch Up: 6\n• Qualidade Interação Jogadores: 10\n• Qualidade da Suspensão da Vitória: 8\n• Minimização de AP/Downtime: 5\n• Mitigação da Sorte: 10\n• Fidelidade Tempo Caixa: 10\n• Minimização Dependência de Honestidade: 10\n• Elegância de Regras/Intuitividade: 9\n• Estética: 3\n• Coerência Temática: 10\n• Produção e Imersão: 5\n• Praticidade Preparação/Manutenção: 10\n• Armazenamento (com sleeve): 5\n• Manual: 7\nNota Resultante: 7,7\n\n(detalhamento dos quesitos no tópico da Ludopedia: https://ludopedia.com.br/topico/83397)",
    "timestamp": 1758232800
  },
  {
    "username": "Zephyr_Falcon",
    "rating": 7.5,
    "comment": "7.5",
    "timestamp": 1758060000
  },
  {
    "username": "plezercruz",
    "rating": 8.0,
    "comment": "FCM gets bad press in the \"game weight\" department. The actual gameplay and rules are pretty simple, and the gameplay is pretty intuitive. The \"game weight\" comes from the decision space, with many options available for building out your chain, but basic strategies should stick out even to novices.\n\nFCM is not nearly as opaque as people make it out to be.",
    "timestamp": 1757973600
  },
  {
    "username": "jbrent531",
    "rating": 8.0,
    "comment": "GF - Oct 2025",
    "timestamp": 1757541600
  },
  {
    "username": "pauldavis92",
    "rating": 8.0,
    "comment": "For trade",
    "timestamp": 1756936800
  },
  {
    "username": "geoffder",
    "rating": 8.0,
    "comment": "TODO COMMENT",
    "timestamp": 1756764000
  },
  {
    "username": "tugdad93",
    "rating": 8.0,
    "comment": "Includes the card organizer accordion, dry erase milestones boards, money cards from The Game Crafter (https://www.thegamecrafter.com/games/game-money-cards), and food stickers from Etsy: https://www.etsy.com/listing/1246697425/food-chain-magnate-m....",
    "timestamp": 1756677600
  },
  {
    "username": "GusiX",
    "rating": 8.1,
    "comment": "- Base -",
    "timestamp": 1756591200
  },
  {
    "username": "verandi",
    "rating": 8.0,
    "comment": "The most interactive engine-building game you'll ever play- you must constantly keep an eye on what your opponents can do lest your plans get flushed down the proverbial toilet. The modular board truly makes every game different! I prefer playing turn-based online, which gives me time to really pay attention to detail- something the game rewards immensely (arguably a flaw, but if you've never played online you'll likely be blissfully ignorant). UPDATE: I eventually tired of the base game, but the Ketchup expansion (and getting the BGG organizer + dry erase boards) has really breathed new life into the game. I rate the expansion a 9.",
    "timestamp": 1756332000
  },
  {
    "username": "afafard",
    "rating": 8.0,
    "comment": "This game is not not for the faint of heart. it is probably the most unforgiving one I have played\nThe guy who introduced me to it called it \"Snow ball, the board game\" and I think it really describes it well.",
    "timestamp": 1755986400
  },
  {
    "username": "Song_of_Shield_Lady",
    "rating": 7.5,
    "comment": "和对象开了一局，掀了~\n机制非常直观且做到了可玩，但流程太长，后期结算复杂，消磨了乐趣。",
    "timestamp": 1755554400
  },
  {
    "username": "roric32",
    "rating": 7.5,
    "comment": "Too mean for me, but I think it's a fantastic game.",
    "timestamp": 1755381600
  },
  {
    "username": "benschel",
    "rating": 8.0,
    "comment": "amber-vs-ben",
    "timestamp": 1755295200
  },
  {
    "username": "bdeink",
    "rating": 8.0,
    "comment": "An amazing game, and with more plays, a serious contender for my personal top 10.\n\nIncl. the GeekUp Milestone Boards & Card Accordion (2nd Ed.). These add-ons streamline the game and are near essential for me (especially if you're short on table space)!\n\nUpgraded with the Food Chain Magnate Meeple Upgrade kit (sticker set) from LevityGames on Etsy.",
    "timestamp": 1755208800
  },
  {
    "username": "carnodingo",
    "rating": 8.2,
    "comment": "Stratégique\n\n+ ketchup mecanisme\n\nType: Euro\n\nItem de collection\nJ'ai bien hâte de jouer a ce jeu cutt-throat !\n\nWow. C'est plein de stratégie. J'adore.\n\nWood Insert\n\nCatégorie: Medium - Splotter Spellen\n\nThème Économie\n\nMécaniques: gestion de positionnement et de compétition, Pouvoir unique (milestone), planification.\n\nSimilaire dans ma collection: Indonesia, Estate\n\nTaille de la boite: Standard rectangle",
    "timestamp": 1755122400
  },
  {
    "username": "Suleckja",
    "rating": 8.0,
    "comment": "What an absolute beast. I think the beginning of the game is broken or we misplayed some rules because someone played one card and got more than half the bonuses on the board, which made the game unwinnable for the rest of us. Aside from feeling \"cheated\", the rest of the game is so cool. Having to \"run\" a diner and be in charge of every aspect of it from marketing in the neighborhoods to making and serving the food to your customers was awesome. Beware though, there is A LOT to this game. Happy I got to play it and would play again but would keep a closer on the rules next time, especially in the opening rounds when the bonuses are being won.",
    "timestamp": 1754690400
  },
  {
    "username": "selwyth",
    "rating": 8.0,
    "comment": "This game had me at 'undercut'. Possibly the definitive business-themed game (not 'economic' because it's pure cutthroat competition, no collusion). Restructure your company each turn, then create demand and supply. No penalties for overproducing unlike Automobile, my previous business game of choice.\n\nHas that quality where you commit to a strategy early with placement, and it's difficult to know what to do with little experience. This needed me to explore 70% of the org chart before I could figure out the differences between food, drinks, marketing, and turn order.\n\nNo randomness, perfect information, only player-driven chaos/dynamics. The same-ness quickly becomes asymmetric via the milestones (permanent powers) one soon collects.\n\nMy only problems with the game lie in how game length is determined. 1/ The choice of how long you want the game to last at the start seems like a worthless decision (i.e. just deal it out randomly), and then it takes a lot of arithmetic to figure out if the game is ending this turn or there's a way to delay it till next.\n\n5+3",
    "timestamp": 1754344800
  },
  {
    "username": "Azacan1977",
    "rating": 8.0,
    "comment": "N.º Jugadores: Mejor 3-4 / OK 2-5",
    "timestamp": 1753999200
  },
  {
    "username": "Sotislosky",
    "rating": 8.0,
    "comment": "an excellent game ! with expansions is confusing, and the power balance gets laughtable. only this keeps the score down having to use some but not all modules",
    "timestamp": 1753653600
  },
  {
    "username": "ultimoratio",
    "rating": 9.0,
    "comment": "Including Ketchup expansion\n\nUpdate: Sept 2024\n\nKetchup expansion modules opened up a new world of shenanigans and depth. Amazing\n\nUpdate: Mar 2022\n\nIncredible depth and opacity! I really don't see a reason to play 98% of mid to heavy Euros when I can just play FCM.\n\n===========================\n\nThe right mix between tactics and strategy - neglect one, and you'll suffer on the other. Wide decision tree. Every round is a big decision. Tense competition with no nonsense mechanisms and zero luck.\n\nAll this and yet the rule set of this game is around medium or medium-heavy.",
    "timestamp": 1762630800
  },
  {
    "username": "Ruthless33",
    "rating": 9.0,
    "comment": "Incredibly brain burning, very good hand building economic game.\n\nDon't want to buy but really enjoy playing",
    "timestamp": 1762038000
  },
  {
    "username": "t0x1c_j3st3r",
    "rating": 8.5,
    "comment": "Bugliano Play 2020",
    "timestamp": 1761865200
  },
  {
    "username": "Nerdvik",
    "rating": 9.0,
    "comment": "Very good game - The Business Hierarchy is quite different and good. Scoring was a bit tough to get the hang of but worth it!",
    "timestamp": 1761778800
  },
  {
    "username": "fmestevez2804",
    "rating": 9.0,
    "comment": "x",
    "timestamp": 1761778800
  },
  {
    "username": "alcofa",
    "rating": 9.0,
    "comment": "+ Food Chain Magnate: The Ketchup Mechanism & Other Ideas",
    "timestamp": 1760997600
  },
  {
    "username": "CatDadKil",
    "rating": 9.0,
    "comment": "Phenomenal game. Sad how there are two strict openings, however I feel this sets the game up well for the long run as it highlights what people are likely going to aim toward",
    "timestamp": 1760997600
  },
  {
    "username": "Ajohnny101",
    "rating": 9.0,
    "comment": "Brilliant game, super interesting structure, love the feel of running your own company. I dont currently have the players interested to learn and keep playing this that it deserves.",
    "timestamp": 1760911200
  },
  {
    "username": "whitecatplays",
    "rating": 9.0,
    "comment": "I love the art too, btw.",
    "timestamp": 1760738400
  },
  {
    "username": "AndiHOhneYpsilon",
    "rating": 8.5,
    "comment": "e-raptor insert, token sticker",
    "timestamp": 1760565600
  },
  {
    "username": "smurfodeth",
    "rating": 8.5,
    "comment": "Brutal. Absolutely brutal. Mistakes are devastating, but the game probably won't last very long beyond the point at which your mistakes are laid bare. I don't have a grasp on playing this well yet, but I eagerly look forward to banging my head against the wall getting there.",
    "timestamp": 1760220000
  },
  {
    "username": "Ddyraw",
    "rating": 9.0,
    "comment": "Simple rules, tons of strategy, love it.\n\nNeeds a game group play.",
    "timestamp": 1759356000
  },
  {
    "username": "Rubeus",
    "rating": 9.0,
    "comment": "Me gustan los juegos de mesa de corte económico-empresarial y, bajo mi punto de vista, este es de los mejores que conozco. Ojalá tenga buena suerte y pueda jugarlo más. Sé que se puede hacer \"online\", pero no disfruto jugando en el ordenador, no es lo mismo. El juego tiene un diseño gráfico muy acertado (símbolos, tipografía estilo máquina de escribir, etc.) y un arte que le da un toque añejo que le sienta muy bien. Quizás algunas personas piensan que el precio es altísimo, puede ser que tengan razón, aunque aquí hay juego de mesa para muchísimo, muchísimo tiempo (tanto es así que no considero la expansión necesaria). Ocupa mucho espacio en la mesa al desplegar tanta carta y demás, aunque hay sencillas soluciones caseras para remediarlo. Es un juego muy especial, único, duro y, sin embargo, fácil de explicar, en el que la cabeza te hierve de tanto pensar en cada turno (¡cuidado con personas con análisis parálisis!), con muchísima interacción, donde se requiere cierta \"malicia\" para ganar y, en definitiva, un \"eurogame\" extremadamente temático y sobresaliente.",
    "timestamp": 1759010400
  },
  {
    "username": "Neysmeey",
    "rating": 9.0,
    "comment": "▪zestaw suchościeralnych plansz z mazakami\n▪drewniany insert",
    "timestamp": 1758837600
  },
  {
    "username": "LittleDuke",
    "rating": 9.0,
    "comment": "Easily one of the hardest games I've played. So many interconnected moving parts. It is somewhat easy to get effectively knocked out of the game if you've made an early mistake, or if your playgroup hasn't figured out how to combat a few strategies. Unforgiving excellent puzzle for anyone highly experienced in board games.",
    "timestamp": 1758492000
  },
  {
    "username": "Jerppa",
    "rating": 9.0,
    "comment": "Best at two or three players for me, two player game is super fast: about two hours. Third player adds much more interaction and complicates the board but also doubles playtime. Haven't played with more than theee and probably won't.",
    "timestamp": 1758405600
  },
  {
    "username": "SawtoothAutumn",
    "rating": 9.0,
    "comment": "DEC 2025 new edition",
    "timestamp": 1758232800
  },
  {
    "username": "K_oroviev",
    "rating": 9.0,
    "comment": "It’s impressive what a clean, thematic ruleset can do for a game. I don’t think this one would be nearly as popular among my friends if it weren’t for how thematic it feels. The rules are relatively simple, and they all \"make sense\" within the game’s context. Despite this, the gameplay remains fierce, strategic, and highly confrontational.\n\nThe game can be quite disheartening at times. You might realize midway through that you’ve already lost, with little chance of recovery. Since it’s tough to catch up once a player gains a significant lead, we often concede to the winner and cut the game short.\n\nThere’s a lot to enjoy and explore here, but keep in mind that the game can be unforgiving. Players should feel free to concede when the outcome is clear—this way, you can jump right into another play!",
    "timestamp": 1758232800
  },
  {
    "username": "Moondropz",
    "rating": 9.0,
    "comment": "For many people, this considers the perfect game.",
    "timestamp": 1758146400
  },
  {
    "username": "tpcordeiro",
    "rating": 9.2,
    "comment": "Um jogo muito interessante, com decisões difíceis e divertidas e um funcionamento bem inteligente. Bem temático (apesar de \"forçar a barra\" em algumas coisas), te faz imergir no \"mundinho\". Tem como ponto fraco o visual do tabuleiro e, principalmente, a dificuldade de se jogar bem desde o início. Se errar o primeiro movimento, ainda no setup, é derrota praticamente certa. Também acho a escolha das cartas de reserva logo no início um tanto prematura. Um jogo muito marcado, em alguns momentos lembra Barrage, mas não tão cobertor curto. Um pouco mais polido, estaria no meu top 10 com certeza. Do jeito que está, ainda preciso jogar mais um pouco.",
    "timestamp": 1756850400
  },
  {
    "username": "Krazyel",
    "rating": 8.8,
    "comment": "First game a bit disorganized, but liked it. Have to play more to get the system.",
    "timestamp": 1756764000
  },
  {
    "username": "pauloantunes",
    "rating": 9.2,
    "comment": "Heavy card based, zero luck.",
    "timestamp": 1756591200
  },
  {
    "username": "bagelator",
    "rating": 9.0,
    "comment": "Amazing. I don't understand the complaints about price wars. Just don't enter them? My groups never like to reduce prices and compete in the top instead, haha.",
    "timestamp": 1755727200
  },
  {
    "username": "timori",
    "rating": 9.0,
    "comment": "The most thematic euro economic game I've played. Extremely cutthroat and interactive, although I never found the games to be mean. Download and print out some files (like the milestones, and food tracker) to save table space and cut back on the moving parts. Consider using the expansion milestones.\n\nSpeaking of which, the expansion adds another viable opening strategy and makes the game more streamlined (making it harder to lose in the first couple turns). It also adds in essentially infinite replayability and tends to cut down the play time, but it is expensive.",
    "timestamp": 1755554400
  },
  {
    "username": "Mr_Weyland",
    "rating": 9.1,
    "comment": "2-5",
    "timestamp": 1755468000
  },
  {
    "username": "Veronie",
    "rating": 9.0,
    "comment": "Awesome strategy game with a lot of player interaction. There is no random element other than what the other players will do (which may or may not follow logic). You must base every decision on what you think the others may or may not plan to do. I very much enjoyed my first two plays: one without milestones and bank reserve, and one full game. The only drawback is that it is quite long, even though we were getting into the flow of it by the end. That's why it is a 9 instead of a 10 for me.\n\nThis game is genius! It is a brain-burner. We like to compare it to four player chess but is is much more entertaining. Post-game discussions are quite fun, and after a game I already think about what I would do differently the next time around...",
    "timestamp": 1755122400
  },
  {
    "username": "Wendyjo73",
    "rating": 9.0,
    "comment": "Fantastic! I've played a lot of Lacerda's, so I was prepared for that level of complexity given the BGG rating of 4.19, but this hits different.\nIt didn't scramble my brain. It was deep, but not too sophisticated to grok on a first play.\nI love the tableau building/deck building hybrid style of action programming each turn. Satisfying and clever.\nCan't wait to play again!",
    "timestamp": 1754517600
  },
  {
    "username": "Doctor_Cowboy",
    "rating": 9.0,
    "comment": "Love this game. Pure player vs. player interaction. Very punishing when you misstep, but very satisfying to pull yourself back out of the clutches of certain doom by selling hamburgers lol",
    "timestamp": 1754344800
  },
  {
    "username": "shannyn_north",
    "rating": 9.0,
    "comment": "Sean N. 9.0\nA sandbox game if I've ever seen one. Plays very asymmetrically with different skill levels, but very rewarding in the open-ended-ness of the whole operation. Very few economic games force direct competition as much as this one does.",
    "timestamp": 1754172000
  },
  {
    "username": "kosberg",
    "rating": 9.0,
    "comment": "+ Ketchup expansion",
    "timestamp": 1753394400
  },
  {
    "username": "Tbirdmg",
    "rating": 9.0,
    "comment": "A brutal slog of brain burning, greasy food slinging, unforgiving and unapologetic design.\nFood Chain Magnate is great, difficult, confounding, and every play finds me wanting to play again to better understand its design and complexity.\nSuper tight and imperfect play will be rewarded with devastating consequences.\nGame runs 45-60 min per player, assuming there's no blowout, which is possible. There's no problem with runaway leaders unless you let that happen. \"It's not the design, it's you!\"\nOne of my favorites and a top 10 of all time.",
    "timestamp": 1753221600
  },
  {
    "username": "kReal92",
    "rating": 9.0,
    "comment": "Sleeved\nFolded Space",
    "timestamp": 1753048800
  },
  {
    "username": "kingmar",
    "rating": 9.3,
    "comment": "7.",
    "timestamp": 1752876000
  },
  {
    "username": "Cercatesori",
    "rating": 9.0,
    "comment": "ENJOYMENT \nGAMEPLAY \nREPLAYABILITY \nDEPTH \nGAME LENGTH \nALEA \nCOMPONENT QUALITY \nPLAYER INTERACTION \nPLAYER COUNT PERFORMANCE \nSCORE: 8,98",
    "timestamp": 1752530400
  },
  {
    "username": "UN1QUE",
    "rating": 10.0,
    "comment": "w/ expansion",
    "timestamp": 1762383600
  },
  {
    "username": "07734",
    "rating": 10.0,
    "comment": "Main",
    "timestamp": 1761170400
  },
  {
    "username": "cromagz",
    "rating": 10.0,
    "comment": "For me this just edges out TGZ as my favourite splotter (and probably favourite game) because it is a more offensive (ie less defensive) game, and your fate is less in the hands of the other players.\n\nThe pinnacle of economic gaming IMO, I know others may prefer to throw in expansion modules and milestones, but there is so much space to play in with the base game that after around 30 plays including online I am still loving exploring that. I also feel like it excels at 2 players which is unusual for games of this type.",
    "timestamp": 1760306400
  },
  {
    "username": "Nickeddy01",
    "rating": 10.0,
    "comment": "Great strategic euro, unlike any other. Incredible how each new randomly generated board can make each game different. No catchup mechanism. Strong players will just runaway with the game.\nKeen to get the ketchup mechanism.",
    "timestamp": 1759615200
  },
  {
    "username": "MorelliBuendia",
    "rating": 9.5,
    "comment": "With Ketchup expansion.\n\nI never understood the harsh comments about the art of this game, I absolutely adore it. The board is readable, no nonsense, which is very necessary in a game like this, and the cards are gorgeous. The meeples are very cool.\n\nThe implementation of the theme is absolutely brilliant. People don't want anything until you create that need through publicity. You start out without money, so you can get trainees to work for you for free, but you need to pay for professionals. People will only want to eat at a place if it offers everything they're craving, and they will choose a cheaper place when giving two similar options. However, if they need to drive a long way, price vs distance equals out. Everything makes sense from a thematic point of view, which makes the teach for such a complex game fairly simple. But the options... oh, boy. People can get serious AP when they see the amount of people they can hire and the amount of things they need to manage as their business grows. Just like a real company.\n\nI played about 20 games with just base game. Ketchup milestones speed the beginning up a lot and make it crazier, giving you strong powers and very asymmetric positions from the start. I don't know about the viability of the different milestones, but I don't really care, since several players can choose the same one in one turn. If you think one of them is OP, just choose that. If playing with less experienced players, try out a more difficult path. The ketchup modules take a game that was already great and turn it almost into a system to explore. My favorite player count might be 3p, since dinnertime gets a bit crazy to calculate with more people, but 4p is amazing as well.\n\nMogul Scale: 4/E. There are a lot of elements to consider in this game, especially with the Ketchup expansion. However, the rules make so much thematic sense that it's not as difficult to learn, just overwhelming for new players.",
    "timestamp": 1759442400
  },
  {
    "username": "Anicka",
    "rating": 10.0,
    "comment": "Polskie tabele osiągnięć suchościeralne",
    "timestamp": 1759356000
  },
  {
    "username": "logopolys",
    "rating": 10.0,
    "comment": "A sandbox game if I've ever seen one. Plays very asymmetrically with different skill levels, but very rewarding in the open-ended-ness of the whole operation. Very few economic games force direct competition as much as this one does.",
    "timestamp": 1759356000
  },
  {
    "username": "BenGuilbaud",
    "rating": 10.0,
    "comment": "[NL] 2-5(/6) players. 2-4 hours.\n\nA fantastic board game. The strategic depth will keep you thinking about each game for days. An incredibly tight and interactive experience where absolutely every move counts. And the expansion brings so many fresh strategies, it's wonderful.",
    "timestamp": 1759096800
  },
  {
    "username": "OGRussHood",
    "rating": 9.9,
    "comment": "My 2025 Top 250: #133\nMy 2024 Top 250: #119\nMy 2023 Top 250: #109\nMy 2022 Top 250: #90\nMy 2021 Top 250: #87\nMy 2020 Top 250: #89\nMy 2019 Top 200: #156",
    "timestamp": 1758492000
  },
  {
    "username": "peterlevi",
    "rating": 10.0,
    "comment": "3-4\n(open)\n\nVery interactive and the economy feels very real. Mechanics-wise, it's pretty genius. I like the art too, no issue with its style or simplicity - it makes the board quick to read.\n\nBut it could go painfully long. And the lack of a catch-up mechanism could totally discourage a player from playing again.\n\nEdit: After multiple plays, the design is simply amazing. Simple and intuitive rules, games turn vastly different, level of interaction is unparalleled. Raising rating to 10.",
    "timestamp": 1758060000
  },
  {
    "username": "wwwidonja",
    "rating": 9.5,
    "comment": "Comment after 1 play:\n\nI loved my first play of this but would be cautious about tabling it with players who would have a tough time grasping its abstract concept by turn two -- the asymmetric nature of the milestones -- for me -- make the game and missing out on them can lock a player out.\n\nNevertheless, what a fun puzzle. The organization restructuring happening simultaneously makes for a game with limited AP potential, with additional planning ahead required due the marketing stage only affecting the next turn's desires. The various ways to play the game make it a sandbox that I'm eager to explore further and I can see my rating of the game growing with time.\n\n\nThe theme is also fantastic & evocative, and the tiled city's \"prototype-like\" appearance growing on me with time.",
    "timestamp": 1757800800
  },
  {
    "username": "extatix",
    "rating": 9.5,
    "comment": "Second-best Splotter so far. It's not the rules that make this one heavy, but the choices you have to make.",
    "timestamp": 1757368800
  },
  {
    "username": "junashimself",
    "rating": 9.5,
    "comment": "Suuuuuuper cutthroat and I love it! Barely any downtime because you're always figuring out how to counter your opponents.\nOne big downside to the game is that even though I bought the extra milestone and accordion accessory, it still takes up a lot of table presence!",
    "timestamp": 1757282400
  },
  {
    "username": "scottdarrington",
    "rating": 9.5,
    "comment": "How could you do this to me, Sam. I told you I was going to rate FCM one one-hundredth off from Kameron's rating of 9.25, but then you went and upped your rating, and I'm not going to be the one holding the bag with the lowest rating in the group after I have been nothing but indulgent to this game's most whimsically cruel of whims. So there! Now I rate it the highest! You've been out maneuvered.\n\nUpdate: I've been out maneuvered. Food Chain is very close to a 10 for me, but you win this one, Sam.",
    "timestamp": 1757109600
  },
  {
    "username": "Cubesonamap",
    "rating": 10.0,
    "comment": "I enjoy FCM, but I can't wrap my head around the card play. Wish it had another action selection mechanic. Still consider it a fantastic design and I'll play it every time someone suggests it.\n\nUpdate: So I've figured out the card play and it has clicked for me. Bought my own copy. Plays great at two. Still consider TGZ and Bus to be superior designs.\n\nUpdate #2: Continues to shine, a brilliant design through and through. Tied with TGZ for best Splotter.",
    "timestamp": 1756850400
  },
  {
    "username": "Maquiavelo17",
    "rating": 10.0,
    "comment": "3 de Febrero 2021\nEl juego que retrata a la perfección la competencia entre comercios. El mas mínimo descuido puede llevar a tu negocio a la ruina. Al principio puede que el arte no te convenza, después te parece simplemente hermoso.",
    "timestamp": 1756332000
  },
  {
    "username": "timonkey",
    "rating": 10.0,
    "comment": "After several plays, I'm still wanting to start over ASAP and try to figure out more about how to win this game.",
    "timestamp": 1755640800
  },
  {
    "username": "jlucky",
    "rating": 10.0,
    "comment": "This is an outstanding game. I admire how interactive it is and how the theme and mechanics create fun situations that will make players laugh. It's not a 10 for me only because it's often too harsh with new players.",
    "timestamp": 1755381600
  },
  {
    "username": "mayflowery",
    "rating": 10.0,
    "comment": "FOOD CHAIN MAGNATE IS A 10\n\nSPLOTTER 100% VICTORY RATE\n\nUNDEFEATED OTTER",
    "timestamp": 1755208800
  },
  {
    "username": "Geroid",
    "rating": 9.8,
    "comment": "8.5 rating. I was the run away leader all 3. Hopefully when other players get more experienced (become more competitive) the rating will go up.\n\n8.66 after the second play. The other players were more competitive and this made the game better. I could see it going up more after a 3rd game.\n\nI tried a 2 player game with my wife. We kept to ourselves, not doing anything mean. It was not fun. This game needs to be played like Chess to be fun. You have to take out the opposition, and they need to cause you trouble to overcome.",
    "timestamp": 1754258400
  },
  {
    "username": "zilmuss",
    "rating": 10.0,
    "comment": "At the moment only played at 2 players number count. Could update when tried at 3 or 4.",
    "timestamp": 1753826400
  },
  {
    "username": "grogboxer",
    "rating": 10.0,
    "comment": "Wow! What an amazing game, and I should probably own this though most of the folks I'd play it with also own it",
    "timestamp": 1753135200
  },
  {
    "username": "srfdevotee",
    "rating": 9.8,
    "comment": "Rare game that is both simple to play yet also a deep strategic sandbox, where you have lots of options and freedom to pursue different paths to victory (once you get past the somewhat redundant opening strategies). Works for two players, though due to the zero-sum nature of that game, a single significant mistake can be absolutely punishing and game-deciding (e.g., allowing someone to have the Luxury Manager *and* a temporary monopoly on a particular food). Very good player interaction, as you must keep track of what your opponent is marketing, producing, and any price discounts they've taken as well as competing on certain milestones, one-of-a-kind employees and crucially, turn order. Love the old-fashioned look and feel. Don't like how there only seem to be two good opening strategies (going for Recruiting Girl or Trainer/Guru); this hurts replayability somewhat (the Ketchup expansion helps this though). Power curve in this game is also STEEP, maybe too steep -- in a just a few turns, you can go from struggling to pay your employees, to having so much money that the reserve limits are hit and the game is over.",
    "timestamp": 1752876000
  },
  {
    "username": "CharlieNZ",
    "rating": 10.0,
    "comment": "Played",
    "timestamp": 1752357600
  },
  {
    "username": "bowlguy",
    "rating": 10.0,
    "comment": "October 2025",
    "timestamp": 1751234400
  },
  {
    "username": "Western_Trailer",
    "rating": 9.8,
    "comment": "This game is both complex and rewarding at the same time. Planning is key in this game! Love the setup and the mechanics. I find myself constantly wanting to improve each round that goes by. Love it!",
    "timestamp": 1750024800
  },
  {
    "username": "axtolquazjex",
    "rating": 10.0,
    "comment": "Number 1 game again because it has the most strategy and the least luck.",
    "timestamp": 1749592800
  },
  {
    "username": "capt_neb",
    "rating": 10.0,
    "comment": "All-timer!",
    "timestamp": 1748988000
  },
  {
    "username": "Bhipsher07",
    "rating": 9.5,
    "comment": "### GAME I WILL ALWAYS PLAY ###\n\nI have dreams about playing this game. People who play this with me have dreams about playing this game. The org chart mechanic is SO GOOD. You have this puzzle-solving desire to plan way ahead, writing down the 27 steps you're going to take over the next 3 turns, only for an opponent to place a new restaurant or marketing campaign in a place you didn't consider. Now you need a new sheet of paper and another 30 minutes to figure out a completely different strategy.\n\nThe other major appeal to this is the fact that it's almost entirely open information and there is NO RANDOMNESS after setup. You are in complete control of having sold one lemonade for $10 the same turn someone else just sold 35 slices of pizza for $18 bucks a slice.\n\nIts inevitable propensity for there to be a runaway leader actually doesn't hurt the game since it makes the game end the faster someone is winning. It's also very thematically appropriate. You didn't expect to get out-priced by having one-too-few Waitresses to break the demand tie, and suddenly instead of being able to fund your large class of employees that you just trained, you instead will have to let them all go. That's the restaurant business, baby!\n\nThe ridiculously overpowered milestones are also a crucial part of the game (also very thematic). Being the first to something gives you an incredibly big head-start, but it also forces you into a strategy you might not be comfortable with, depending on what your competitors are doing.",
    "timestamp": 1748815200
  },
  {
    "username": "Glanzmuecke",
    "rating": 10.0,
    "comment": "This is such an amazing game! The splotter guys really know how to design boardgames, that are interactive, strategically deep, painful and fun! This one is outstanding and will rest in my top games forever.\n\nThe only thing I do not like, is the missing history. This is a very specific \"problem\" I have, and I understand to dismiss any context in favor of variability and replay-ability. But for me, as I enjoy historic economic simulations the most (like many 18xx games), I would enjoy this game even more if the companies would not be fictitious, the map not blank, bla bla. But on the other side, this would not add anything to the game regarding gameplay.\nThe other thing I do not like that much is the snowballing in the end and the milestones. Again, I do understand, that they implement asymmetric gameplay, but I would appreciate a 4 hour contextualized gameplay of the development of the fast food industry even more. Still, this is a 10 out of 10!",
    "timestamp": 1747000800
  },
  {
    "username": "ratbulogg",
    "rating": 10.0,
    "comment": "Normally I don’t do this, but just from the description given on the game page I can see that this is obviously a very realistic portrayal of the restaurant industry. I was thinking of docking them a star for not talking about shoving a tip jar in your face, but this IS from 2015 before that insulting insanity took hold.",
    "timestamp": 1746482400
  },
  {
    "username": "Ihavenofrends8",
    "rating": 10.0,
    "comment": "I love starcraft and this game reminds me of it. Build orders, tech trees, and cut throat competition. Mistakes are punished and difficult to come back from. I find myself thinking about potential lines after every game.",
    "timestamp": 1746136800
  },
  {
    "username": "McLudo2811",
    "rating": 10.0,
    "comment": "2015",
    "timestamp": 1744927200
  },
  {
    "username": "ufotexspa",
    "rating": 9.5,
    "comment": "2018 GASGDT\n\nFINO A 5 GIOCATORI",
    "timestamp": 1744581600
  }
]