[
  {
    "username": "Freepotatoe2",
    "rating": 1.0,
    "comment": "This is the worst game ever created it shouldn't event be in the top 10,000",
    "timestamp": 1727992800
  },
  {
    "username": "Scifi66",
    "rating": 1.0,
    "comment": "A fairly standard worker placement game, perhaps for its time it was good but now this doesn't cut it, low interaction and none of the tension of Agricola. Re-theme whilst interesting doesn't go far enough. I would have gone for everything underground (lichen/mushrooms/weird chemical vents, monster farming etc) not more meadows and sown fields. And playing at 7p is...zzzzzz.",
    "timestamp": 1724796000
  },
  {
    "username": "gamerdoge",
    "rating": 1.0,
    "comment": "There are better tile placement games. There are better worker placement games. Too many things to read. No interactiona between players. Can't see the fun in it. I guess overhyped by the named of Rosenberg and review by Dice Tower. If I get this for free, I will sell it immediately. JASE Just another Soulless Euro",
    "timestamp": 1703113200
  },
  {
    "username": "sunyushen",
    "rating": 1.0,
    "comment": "《农场主》都玩不明白的我自取其辱。",
    "timestamp": 1679612400
  },
  {
    "username": "Dimaus",
    "rating": 1.0,
    "comment": "too old",
    "timestamp": 1603753200
  },
  {
    "username": "chrboesen",
    "rating": 1.0,
    "comment": "Not as good as Agricola. Multi-player solitaire. Played 10 times.",
    "timestamp": 1583276400
  },
  {
    "username": "bonaventurecemetery",
    "rating": 1.0,
    "comment": "A POS, overly hyped by Dice Tower. Egyptian and Mediterranean themes seems to drives them crazy but not just a rehash of the same old crap, over and over.\n\nThe number of players on the box, one and two players give me a break, at one player, this is like playing chess with yourself, at two be very prepared to play the exactly same game again, what it really means there will be another edition coming out that’s really a two player game, if it follows past patterns from this so called game designer.\n\nMan, somebody’s guys turn into one trick pony’s after while. This is a sad trend in the board game industry.\n\nWith two major \"wild card\" mechanisms, all the open information in the game, and almost 100% static set up game, this is a very boring activity.\n\nA game with zero tension and just a solitary point big salad summary game.\n\nIn a nutshell.\n\nWhy do people like the possibility to play the same game over and over and over as any randomness in the tiles which replaced the cards are totally gone, take the standard Agricola game, don’t even bother to shuffle the deck, flip all the cards over, first come first pick,, you now have Caverna.\n\nIt defies the very definition of board game.",
    "timestamp": 1567893600
  },
  {
    "username": "Frozen Flesh",
    "rating": 1.0,
    "comment": "I came here, because of all the people rating mature themed games like KD:M or Hate with a 1, just because of their mature them.\nThis games theme is boring!",
    "timestamp": 1547074800
  },
  {
    "username": "danamark",
    "rating": 1.0,
    "comment": "Man, I loathe this game. It is right up there with Monopoly.\n\nWhy do people dislike this thing but rate it N/A? T even gets a 7 for those people who dislike it. Look at the comments. Gee, post a rating to unskew the ratings.\n\nI made the mistake of buying this and then playing another copy and realizing the mistake.\n\nThis is from a reviewer about another game but it sums up this yet again rehash from this phone it in designer, \"....epitome of inelegant, kitchen-sink designs that leave me feeling cold after hours of slogging through what feels like a meaningless point salad of mismatched mechanisms.\n\nThe worst is getting sucker in by reviews and the hype.\n\nOne of the most expensive regret buys I have ever made. Despite the publisher's price fixing in the U.S., artificial pricing, this thing is a nightmare to unload and try to recoup your cost.\n\nIt is a niche buy. Those that wanted it, payed up, those that didn't, don't want it, what is left are those that expect to get a mint unplayed copy for $45, shipped, I kid you not. Back out after back out when they discovered the $18.00 shipping on this cinder block.\n\nThis behavior of publishing a game that \"is not for everybody \", Mayfair words, posted here, in terms of that $98.99 manufactured price, not only causes it to be hard to sell, but also skews BGG's rating.\n\nIt is like that Magic card collecting, Dice Masters. These people willing to spent a fortune on it, will vote their life style high up, not so much say for a game like Airlines Europe which who get a mixture of buyers aka a better sample of buyers, and a more balanced rating.\n\nRunning a poll on 100K Lamborghini buyers on how they like their car is a moot point. They were in love with the designer, the car before going in, before the purchase.\n\nInterestingly, same group that just loves this game are the ones that wanted an expansion to it 1 month after owning. What the hell is that all about? You read,\"well if it had this or that\", \"I sure wished it had\", to add some variation, yet 10 rating from these people. Read some of the glow job comments, I have never seen a game so loved by a group and yet that same group want so many changes to. A game that cost 2 cents less then $100.00 should have longer legs, not need expansions.\n\nLook at the N/A comments rating, amazing so many dislike this thing but fail to give it a rating so it would reflect the real rating. What is wrong with these people?\n\nThoughts and just bad vibes after playing this, factoring the money for it:\n\nI'm done watching Dice Tower reviews they are just too skewed to personal \"like\" of the reviewer, I'm done with this designer. There is a feeling of cranking out the reviews, there is a strong feeling on a one game played review, to keep up with the status quote. A problem I guess when this is now part of your income? I prefer more of a hobbies review.\n\nI don't have the luxury of getting free games to review nor do we have those wax poetic FLGS to try before you buy. Our shops are more of the Comic Book Guy. So, I need a better review, with some real insight in the game.\n\nI really wonder how often this thing hits the table. To me it's a groaner, \"do we have to play that\".\n\nAn amazingly dull, flat, repetitive game. There is no direction in this game. This is just a church groups activity, it is no game.\n\nThe real deal is you don't seem to be playing against other players, only yourself and trying to beat your easily obtained score by 1-2 points. Seems to be totally missed by any review of this thing. The lack of any real randomization just added to this besting your last score.\n\nAs for Dice a Towers over blown love for this thing, why is it Egyptian themes, Mediterranean trading themes get no love, only because you have played more games and thrown them away then most people will ever own; you never grow tired of just another rethemed, get this or that, no real reason, now trade those in, that is all it is to it resource management; and yet again with this guy, this so called game; a piss poor, erroneous in real play, player count on the box; or you never tire of yet another small variant of Yahtzee game with another theme slapped on?\n\nI can't wait for the fixed priced $50, 2 player game only Caverna, if history repeats itself, created by pulling out some boring mechanism out of this penny a point salad from McDonald's $1.00 menu. The worst Euro cube pusher has nothing over Caverna's mindless, directionless game play.\n\nTotally amazing Dice Tower's loathing of Feld's games but the way over the top of this ilk of games especially from this designer. It is like buying the same puzzle with a different theme for $100.\n\nTo Dice Tower, I'd rather play Shadow Era over Caverna. I would like to say I would like my $100 plus back, but I can't, sold for $65 dollars plus 2 $15 mini expansions, one for Caverna, one for another game just go get rid of it.\n\nYes, quite a lost. I figured I got $35.00 for it. You best know you want this thing given Mayfair Games business model of price flooring and slapping on any MSRP price they think they are entitled to.\n\nI finally realize with this game Dice Tower reviews are basically infomercial and are nothing more.\n\nClassic Rosenberg, another phone it in game.",
    "timestamp": 1538258400
  },
  {
    "username": "Ocracoke",
    "rating": 1.0,
    "comment": "Wow, another Tom Vasel over hype. Yet another farm game, worst, get x, get y, trade it in. How this qualifies as a game is beyond me, having and almost 100 percent open information game, having all the tiles available on a first come first serve is a boring, stagnant boring waste of time. The price is ridiculous for what you get out of it. Played once and sold. A very badly valued game.",
    "timestamp": 1470088800
  },
  {
    "username": "philgonzoles",
    "rating": 1.0,
    "comment": "Fragoso",
    "timestamp": 1469656800
  },
  {
    "username": "Peepser",
    "rating": 1.0,
    "comment": "$112 plus tax? Is this a joke? Of course it is. Gets a 1 for price alone. Gets another 1 for being yet another farming game. Gets another 1 for set up time. Rosenberg needs to get his head out of the manure and go to the beach for vacation. The man knows how to beat a dead cow.",
    "timestamp": 1449270000
  },
  {
    "username": "glowndarkzombie",
    "rating": 1.0,
    "comment": "Uwe Rosenberg at his best it would seem, unfortunately.\n\nI'm not sure what this is. There is just no enjoyable game here, just a lot of pretty parts.\n\nThey claim Euros can feel like cube pushers. What do you call the collection of games Uwe Rosenberg cranks out that are just mindless resource collecting then converting them into something else, just slapping on another theme?\n\nAnother mindless, amazingly directionless, slow, slow point race, that fanboys like to call a sandbox. More like playing in a cat litter box.",
    "timestamp": 1448665200
  },
  {
    "username": "fillergame",
    "rating": 1.0,
    "comment": "Worst game I have ever played, too many wild card options, just multi player solitude, especially felt below 4 players, over 5 a boring downtime, I'm not sure what it is.\n\nGet a score, try next time to bump it by 1-2 points by trying something slightly different. You can pretty much play the same game over and over.\n\nThat 1 raving review for this thing is the only reason I can find figure out why it is rated so high as people align themselves to that reviewer.\n\nGet pass the over chrome there is nothing here. This is just the same old crap seen in a series of games from this designer, bet we will see a watered down version, some small mechanism pulled, sold as a 2 player game, with a price tag of $60.00 if history repeats itself.\n\nI question just how often it gets to the table and that it supports anything but 4 player games.",
    "timestamp": 1448492400
  },
  {
    "username": "Startkicker",
    "rating": 1.0,
    "comment": "If I could give it a zero and it would mean something I would. Way over priced and over chromed especially adding in 5-7 players. This must have just been done to justify that price. Watching 6 other players AP over upturned tiles, then getting blocked only to be able to easily work around it is a snooze feast. I'm not sure why feeding was added to the game given how easy it is, just a minor nuisance in the game.",
    "timestamp": 1447801200
  },
  {
    "username": "underlandforest",
    "rating": 1.0,
    "comment": "I wished I could give this a zero.\n\nPrime example of Tom Vasel over hyping a game, the parts, the box, gets him going, then throw in another Rosenberg rehash we have seen time and time again from him, that Vasel can not get enough and you get a very skeptical review wrapped around high praise. I understand this is a personal perspective, preference, but Vasel has issues to themes he has gotten tired of, therefore in his world \"we\" should too\", but he never seems to grow tired of this resource trade in game with just another theme slap on. As long as it is stepped, get a, get b, trade a and B, it is another slam dunk as it is themed and make sense?\n\nBe warned, the high rating of this game maybe caused by the Rosenberg Fan Club, those that will shell out a $100, don't care about Mayfair's forced getting near MSRP. Those that want it, in the Rosenberg fan club and willingness to pay that artificial high price are very unlikely to rate it low. They go into loving it. Anybody stating there is tension in this game must be playing some other game. It is totally lacking in that regard.\n\nLearn a valuable lesson about watching Dice Towers. Well, I have stopped watching it, defaulting to others. I can not take the dice love, the Rosenberg worship, the whining I have played thousands of games and I am sick of, Egyptian themes, Mediterranean themes, etc. Well, I haven't.",
    "timestamp": 1441836000
  },
  {
    "username": "radiochest",
    "rating": 1.0,
    "comment": "Good luck selling your used copy. Very niche market.",
    "timestamp": 1441749600
  },
  {
    "username": "obiwaner",
    "rating": 1.0,
    "comment": "Bad, bad as it gets. Just another rehash this guy is known for. How much of this resource collection, trade it in for something else, with no rhyme or reason for any action.",
    "timestamp": 1441749600
  },
  {
    "username": "BlueSapphire",
    "rating": 1.0,
    "comment": "Static setup lowered replayability.",
    "timestamp": 1439848800
  },
  {
    "username": "Pro_player",
    "rating": 1.0,
    "comment": "boring, ugly piece of crap !",
    "timestamp": 1437516000
  },
  {
    "username": "aremyhandsdirty",
    "rating": 1.0,
    "comment": "This game is like taking a 5,000 piece puzzle, placing all the pieces face up, round robin picking up one piece. Where each person works on his own section in front of him, like a private mat, the rule being each piece has to fit in with one of his previous pieces.\n\nThis was one waste of money. The artificial high price by MayFairGames and the imposed restrictions forced on resellers not to offer discounts beyond a token amount you have to think hard about buying this game.\n\nLike most of this guy's designs his player count is way off.\n5 players is a drag, I can not fathom anyone playing 6 or 7.\n\nInterestingly you don't hear from the fanboy's reviews anything about this point.\n\nThe price of this game could have been greatly reduced if the player count had been adjusts 3-4. Solo play seems pointless.\n\nFor $98.89 plus shipping this was the biggest mistake I have ever made.\n\nI will avoid both Rosenberg and Outlook/MayFairGames in the future. I don't care for MayFairGames interference with supply and demand.",
    "timestamp": 1431295200
  },
  {
    "username": "latschediwes",
    "rating": 2.0,
    "comment": "The fantasy setting appears like a Fata Morgana, shimmering with adventure and cozy cuteness, as players step deeper and deeper into the dry wilderness of accountancy.\n\nLike a bazillion of similar games this one could be played on an Excel sheet, where one manages resources and calculates the return of selected actions.\n\nIn contrast to the bazillion of similar games, Caverna is tailored for the more experienced accountant (speaking of stereotypes), because it's front-loaded with more actions, has no tension, no interpersonal component and a staggering amount of up-front complexity, which is nothing but stuff to gloss over and to memorize.\n\nI suprise myself with enjoying a small amount of accountancy when I'm alone, but I don't see any reason to spend my social leisure time with doing tax returns in parallel.",
    "timestamp": 1748469600
  },
  {
    "username": "tectactoe",
    "rating": 2.0,
    "comment": "A reasonably fun sandbox experience. If you think AGRICOLA is too unforgiving and/or too \"tight\", then this is what you're looking for. It seems like there are always good actions to take and even if you get blocked from doing exactly what you wanted to do, chances are there are other actions available to which you can pivot and still generate a useful turn. The problem, to me, is that this significantly lowers the tension, and that's one of the things I find perfect about AGRICOLA.",
    "timestamp": 1733785200
  },
  {
    "username": "hiimjosh",
    "rating": 2.0,
    "comment": "I immediately regretted joining this game and immediately tuned out. I don't have much to say about it except that I never want to play it again.",
    "timestamp": 1703718000
  },
  {
    "username": "PrimordialSecrets",
    "rating": 2.0,
    "comment": "20 minutes of upkeep/set-up/bookkeeping per 5 second decision. Even if the tedious stuff was automated there's not enough variability to give this replayability.",
    "timestamp": 1685916000
  },
  {
    "username": "Yawnswithpower",
    "rating": 2.0,
    "comment": "Dry and boring worker placement, one of the few games I almost fell asleep during.",
    "timestamp": 1643497200
  },
  {
    "username": "Shmegmo",
    "rating": 2.0,
    "comment": "I bought Caverna and played it once and I was so thoroughly turned off by the theme, the mechanics, and the aesthetics, that I went through the trouble of popping all the cardboard back into the punchboard and selling it as like new as possible. Playing Caverna is just a frustrating slog through an ugly game largely about animal husbandry. Never have I disliked a game so thoroughly after one play. From what I have read, I think I might just find that every game in Uwe Rosenberg's oeuvre is offputting to me.",
    "timestamp": 1625954400
  },
  {
    "username": "PlusOrMinus",
    "rating": 2.0,
    "comment": "Only played once. Too many pieces. Never again.",
    "timestamp": 1607986800
  },
  {
    "username": "candoo",
    "rating": 2.0,
    "comment": "A reworking of Agricola into version 2.0. Less charm. Less theme. Less tension. Less of the stress that I liked. A long set up. But somehow it was still a decent game.\n\nUpdate October 2014. Dropped from 7 to 5 to 3 to 2.\nIt really is just recycled Agricola. Not interested in looking at 100 buildings and maximizing grabbing and converting a thousand different types of resources. Feh. And extra -1 for recycling the same mechanics again and again.",
    "timestamp": 1603404000
  },
  {
    "username": "Yokiboy",
    "rating": 2.0,
    "comment": "I love the original Agricola for how harsh and unforgiving it is, and its tight gameplay. This feels much looser, and like the points salad style of eurogames which I don't enjoy. The game looks nice, it's easy to understand, learn, and grasp, but it sadly just annoys me. I've had the same reaction to all point salad games.",
    "timestamp": 1559340000
  },
  {
    "username": "alexdrazen",
    "rating": 2.0,
    "comment": "Not a 1 because with all those components stuffed into the box, it makes a sturdy doorstop.",
    "timestamp": 1535407200
  },
  {
    "username": "SchackTAG",
    "rating": 2.0,
    "comment": "Tried it once... and I will not waste my time explaining how much I dislike this game. Suffice to say that the theme was uninteresting, the gameplay was boring, and the playtime was 3 hours! Worst gaming experience I've ever had. Never playing this again.",
    "timestamp": 1519686000
  },
  {
    "username": "dara108",
    "rating": 2.0,
    "comment": "Let's buy some sheep and plant some cabbage, using chips.\nLet's not interact at all and just try to be really swift at picking up those +bonus tiles to snowball the ending after several hours of exhaustive play.\nHow did Catan got here? What happened?",
    "timestamp": 1462485600
  },
  {
    "username": "Trenix",
    "rating": 2.0,
    "comment": "At first, this game seemed like it was Agricola 2.0 as many claim it to be. You will enjoy it and have plenty of fun for a series of plays. However, overtime you will get bored of it and it will get extremely repetitive. It will get to the point where you simply just don't want to play anymore, or at least that's how I feel. I was planning on buying the game but my cousins beat me to it. At first I felt pretty bad because my Agricola game seemed impervious to this updated game, but not anymore.\n\nFirst off, there is very little variance in the game. It's the same rooms every time and therefore you'll be going for the same strategy, every time. Sure, your strategy may change as plays are made and people end up taking your rooms and resources, but you still move onto other strategies which are also the same thing every game. The game is also way too easy, after all the games I've played, no one has gotten the beggar token. It's like there is no reason for it. Moves just aren't as meaningful as they are in Agricola, you're just never on the edge and while Agricola could of been a little more forgiving, this game is just intensely forgiving.\n\nAs for the expedition concept, it sounded great and was fun for a few, but eventually it became annoying and it's too powerful to avoid. This idea adds unnecessary length to the game as do all these additional actions we get when we compare this game to Agricola. The length of this game is just way too long, the more people, the worse it becomes. It's just so hard focusing in this game, makes me wanna do something else as I wait for everyone to take their turn. As for our player boards, I'm not sure why the developer would not allow them to nicely store resources on and to have them not be generic. Everyone has the same board for crying out loud, why?\n\nIn the end, this game is pretty bad and I no longer think it's better than Agricola. It was a direction that the developer shouldn't of went in with these farming board games, it just didn't work. I'm really not surprised why no expansions are being developed for it. The board also wasn't very colorful or appealing to look at, while that has no real importance, it's something to mention when the gameplay doesn't make up for it. Now instead of adding this game to my collection, I rather just purchase some expansions for Agricola.\n\nAs for right now there is only one way this game can be fixed and that's to add a major expansion which would add many more new rooms to the game where we can put in a bag, mix up for each game, and draw them out on the table so things are different each time, giving us different strategies to work with, which would greatly increase replayability in the game.",
    "timestamp": 1452380400
  },
  {
    "username": "Opie",
    "rating": 2.0,
    "comment": "So wait a minute, wait a minute here. Wait a minute.\n\nYou're telling me the reason why Caverna is better than Agricola is because ALL the stuff is available for ALL players to grab, and therefore once I solve the puzzle it's a matter of who gets the perfect route the fastest?\n\nYeah, no thanks.",
    "timestamp": 1448924400
  },
  {
    "username": "Blueroseknight",
    "rating": 2.0,
    "comment": "A Solitaire Snoozefest. No meaningful interaction and poor integration of theme. I never felt like a dwarf, just a mediocre mathematician.",
    "timestamp": 1440712800
  },
  {
    "username": "Mike_Rushby",
    "rating": 2.0,
    "comment": "Far too fiddly for the limited excitement it generates",
    "timestamp": 1434492000
  },
  {
    "username": "akohlmann",
    "rating": 2.0,
    "comment": "While the mechanics are nice, there is just not enough pressure as in Agricola and the replayability is a lot lower, too. In addition, you do too much per action, diminishing the importance of certain actions.",
    "timestamp": 1432245600
  },
  {
    "username": "kowalskie",
    "rating": 2.0,
    "comment": "utterly typical...",
    "timestamp": 1428271200
  },
  {
    "username": "Arkham Wolf",
    "rating": 2.4,
    "comment": "Not my cuppa tea. But with a different skin, I think it has great potential. I am just not into a game where the theme is Dwarven Farmers. I would rather spend my time reading a book or playing just about any other game apart from BLUFF.",
    "timestamp": 1415833200
  },
  {
    "username": "Ivan Jerkov",
    "rating": 2.0,
    "comment": "Farming and sheeps...deja vu. Agricola is a better game.",
    "timestamp": 1401660000
  },
  {
    "username": "tssfulk",
    "rating": 2.0,
    "comment": "Uwe's idea of fun is nothing like mine. I've yet to play a game of his that I've enjoyed.",
    "timestamp": 1388962800
  },
  {
    "username": "dmiler",
    "rating": 3.0,
    "comment": "While I was very enthusiastic about Caverna, watched many wideos and played it twice. However, for our group playing Caverna always seemed like a chore, but without the gratification when you are done with it.",
    "timestamp": 1755036000
  },
  {
    "username": "Dasoogle",
    "rating": 3.0,
    "comment": "It's good, but I think the puzzle lacks tension. As much as I like playing with little wooden animals, I don't need a rules system to do that neccesarily.",
    "timestamp": 1754776800
  },
  {
    "username": "TForever",
    "rating": 3.0,
    "comment": "Friendly worker placement game. In Agricola, you need the spot someone else takes. In this game, there still a spot you can take, but just less efficient than the spot you really want. Agricola is the better game.",
    "timestamp": 1744408800
  },
  {
    "username": "emily84",
    "rating": 3.0,
    "comment": "I will never play this game again. It took way too long time to play and the game wasn't interesting enough.",
    "timestamp": 1736982000
  },
  {
    "username": "nite999",
    "rating": 3.0,
    "comment": "Another game of planting vegetables.......zzzzz........",
    "timestamp": 1736550000
  },
  {
    "username": "BoardGamingCouple",
    "rating": 3.0,
    "comment": "3/5\n\ngreat game, but having content for 7 players is overkill and hurts due to the cost of the game. the setup is a killer. the gameplay is awesome. a sandbox with high replayability.",
    "timestamp": 1735254000
  },
  {
    "username": "Alsozatch",
    "rating": 3.0,
    "comment": "Just play Agricola instead. Every game feels the same because there is no card drafting and every building is available each time. The addition of the wild resource ruby and action spaces which combine multiple actions together eliminates the action drafting tension that makes Agricola so fun.",
    "timestamp": 1720908000
  },
  {
    "username": "capasso2300",
    "rating": 3.0,
    "comment": "I'm really surprised this scores as high as it does.\n\nFirst let me preface by saying I Love both Agricola and Feast for Odin. Even though this game has less choice, and less things going on than FFO.....it does not feel like it. Somehow this middlestep between agricola and FFO just feels like trying to cram as much extra shit as they could into the Agricola framework. Agricola works becasue of the limited options, and tight spaces to get those options accomplished in. This game somehow trys to get you to accomplish even more things, within the same amount of turns(less turns in a 2 player game i believe) as Agricola.\n\nThe double sided tiles, combined with all the different animals, and resources, this covers our entire table for a 2 player game. It's a slog to put out the rocks, wood, ore, rubies, animals every turn on the action spaces.\n\n\nReally disappointed based on the high ratings it gets. I'd never want to play this over Feast for Odin, or Agricola. Both of those games either do less things, much better in Agricolas case, or more things, much better, in Odin's case.",
    "timestamp": 1695074400
  },
  {
    "username": "NightinGale4",
    "rating": 3.0,
    "comment": "Played on BGA and it was not a fun experience to play as a newbie with another newbie who had analysis paralysis with each turn in a real-time game... it took us 3.5 hours to finish 1 game. With that aside, I didn't really feel that the mechanisms were aligning with the theme well enough, so learning and choosing things was not an intuitive or satisfying process.",
    "timestamp": 1684533600
  },
  {
    "username": "silvergoose",
    "rating": 3.0,
    "comment": "One of my least favorite big euros. It has the frontloaded tech tree (buildings) that I can't stand, the lack of tightness does not help, and it is overly long for my taste.",
    "timestamp": 1676242800
  },
  {
    "username": "Admiral Fisher",
    "rating": 3.0,
    "comment": "Overly-long and overly-wrought engine builder, clearly built from Agricola (which I never thought was as good, as elegant or as fun as Caylus or the much ignored Cuba, anyway). I know this sort of thing is loved by gamers, but honestly, I can think of scores of games I'd rather play for 2-3 hours rather than this one.\nYawn.",
    "timestamp": 1674342000
  },
  {
    "username": "johnnytruant",
    "rating": 3.0,
    "comment": "So inferior to Agricola.\nWhy does this exist?",
    "timestamp": 1669849200
  },
  {
    "username": "Janasik",
    "rating": 3.0,
    "comment": "Not bad, but I would never pick this over Agricola. There's less tension, and Caverna's buildings aren't as interesting as the Agricola's profession deck.",
    "timestamp": 1664661600
  },
  {
    "username": "sup3rdan",
    "rating": 3.0,
    "comment": "Maybe would have been more enjoyable had I played it when it came out but in 2021 a generic worker placement game just doesn't cut it. Would much rather play Bora Bora or Tzolkein or Castles of Burgundy",
    "timestamp": 1648850400
  },
  {
    "username": "savedbygrace1521",
    "rating": 3.0,
    "comment": "more typical Uwe garbage",
    "timestamp": 1645138800
  },
  {
    "username": "oscarbucky",
    "rating": 3.0,
    "comment": "1-7jug\nComprado 06/12/2015\nen Mathom\nPrecio:60€\nInserto hecho.",
    "timestamp": 1639522800
  },
  {
    "username": "GaiaHero",
    "rating": 3.0,
    "comment": "Fixes the restrictive nature of acrigola by giving you tons of choice sadly all meaningless and the theme apart from collecting animals is trash. Point soup with horrific UI half the players will be reading upside down terrible.",
    "timestamp": 1635199200
  },
  {
    "username": "Cryster",
    "rating": 3.0,
    "comment": "A lower version of agricola",
    "timestamp": 1633298400
  },
  {
    "username": "Ninjafever",
    "rating": 3.0,
    "comment": "ITs just too complicated to get people to play. Loong waiting time between turns. Guess its a cool game but we simply cant sit for that long. And we play Dungeons and dragons",
    "timestamp": 1628028000
  },
  {
    "username": "FranzK",
    "rating": 3.0,
    "comment": "I prefer both Agricola and especially A Feast for Odin. I find this one very boring. Turns aren't very interesting, it's a less punishing rip-off of Agricola, and adventuring gets you... sheep and cows? Really? The solo mode is particularly static and many of the buildings, while probably useful in some situations, aren't very interesting.",
    "timestamp": 1625695200
  },
  {
    "username": "W33k5",
    "rating": 3.0,
    "comment": "It's like Agricola, only twice the pieces and stuff to learn.",
    "timestamp": 1609110000
  },
  {
    "username": "SteoanK",
    "rating": 4.0,
    "comment": "Great game! I like the theme of A Feast for Odin better and Brew Crafter's is also similar enough worker placement wise. I'd happily play it again (at no more than 4 players) but I didn't think I NEED it anymore.",
    "timestamp": 1760392800
  },
  {
    "username": "logopolys",
    "rating": 4.0,
    "comment": "Worker placement games are hit or miss for me. This was a miss. Not enough flexibility in jobs for your workers. Bonus points are also incredibly swingy; if you miss out on the one you need, you're pretty much out of the game.",
    "timestamp": 1759269600
  },
  {
    "username": "smurfodeth",
    "rating": 4.0,
    "comment": "Quite a bit more forgiving than Agricola, with a less-variable setup, makes me prefer the progenitor, but I’d still play this if asked.",
    "timestamp": 1752876000
  },
  {
    "username": "Chief_Wiggum",
    "rating": 4.0,
    "comment": "Was not impressed. Hope to never see again.",
    "timestamp": 1749160800
  },
  {
    "username": "bobhope1999",
    "rating": 4.0,
    "comment": "It was fine, but not nearly as good as east of Odin. I felt a little frustrated because I never had quite enough workers to do whatever I wanted to do, which means that the game really comes down to scrambling for workers early in which case why not just give people more workers",
    "timestamp": 1745964000
  },
  {
    "username": "Fropod",
    "rating": 4.0,
    "comment": "The worst of Uwe in my mind. Other players choices rarely impact me, might as well be playing solitaire. Don't feel the length of the game is justified by the game play. Would rather play Agricola.",
    "timestamp": 1729980000
  },
  {
    "username": "JasonSaastad",
    "rating": 4.0,
    "comment": "incidental interaction\n\nFixes everything I don't like about Agricola, EXCEPT FOR THE INFINITE COMBO involving The Spare Part Storage, The Trader, and The Seam\n\nI still feel Uwe's designs are overly complex.",
    "timestamp": 1729548000
  },
  {
    "username": "orangecharger",
    "rating": 4.0,
    "comment": "No interest",
    "timestamp": 1724277600
  },
  {
    "username": "marcuslind1",
    "rating": 4.0,
    "comment": "At first I thought Caverna was better than Agricola, but now I'm not sure. Agricola suffers from luck of the draw, while Caverna suffers from too complex actions that take too long to execute. I do like how all buildings are available from the start, as it lets all players compete for strong buildings and combos but prepare for some AP if you're a new player.\n\nLe Havre is still the best of the three though.\n\n7 players is madness. Never play with more than 4.",
    "timestamp": 1716242400
  },
  {
    "username": "SamGentry",
    "rating": 4.0,
    "comment": "Complicated",
    "timestamp": 1703890800
  },
  {
    "username": "hammerthyme",
    "rating": 4.0,
    "comment": "I was hugely disappointed with this, after loving Agricola so, so much. It's hard not to compare Caverna to Agricola since the mechanisms are identical but this didn't have any of the tightness and struggle that I love in Agricola. It felt loose and aimless with too much information to absorb on the room tiles. It just didn't come close to Agricola as an experience for me or for my group. We missed the taut, economical, streamlined flow of Agricola.\n\nAlso, I'm completely baffled as to why this box includes enough pieces and boards for seven players! Who on earth is going to use this? It's a long game anyway at 2p but at 7 players? I'd have thought that it's exceedingly rare that anyone would want to put themselves through that so why not have made Caverna 4-player and released an expansion for more players, just like they did with Agricola? As such, Caverna has an increased cost and shelf footprint which is totally unnecessary.",
    "timestamp": 1683151200
  },
  {
    "username": "FreeArt",
    "rating": 4.0,
    "comment": "This is the most repetitive game I've seen in a while. No variability. On your second game you're already repeating the same patterns because the setup is static. Boring and outdated. Despite its own flaws Agricola is a better game.",
    "timestamp": 1678575600
  },
  {
    "username": "The Deliberate",
    "rating": 4.0,
    "comment": "Better than Agricola, but still not a very engaging game. The theme is lackluster and the art is sub-par.\nIt has the same problem as its predecessor with too many bits and too many tiles with too many tiny words. It's just not a pleasurable experience teaching or playing the game. It's an impressive amount of cardboard and plastic, but it would be even more impressive if it had been whittled down into a better game.",
    "timestamp": 1678143600
  },
  {
    "username": "igorz24",
    "rating": 4.0,
    "comment": "Played 6-player game. Downtime is horrible, game is composed out of microrules and components are flying around in high numbers.\n\nI tried to have fun, but I didn't.",
    "timestamp": 1677884400
  },
  {
    "username": "EinGlasWurstWasser",
    "rating": 4.0,
    "comment": "{\n\"min_duration\": 120,\n\"max_duration\": 240,\n\"owner\": [\"Bernd\"],\n\"players\": [3,4]\n}",
    "timestamp": 1677193200
  },
  {
    "username": "galchri",
    "rating": 4.0,
    "comment": "Agricola, but with all the good bits removed and the bad bits made bigger.",
    "timestamp": 1677106800
  },
  {
    "username": "hnort",
    "rating": 4.0,
    "comment": "Vendere",
    "timestamp": 1655589600
  },
  {
    "username": "cfarrell",
    "rating": 4.0,
    "comment": "Played, enjoyed, but even though it plays more cleanly than Agricola, and gives you more interesting options with less screwing around and more flexibility, I don't think it's better.\n\nFirstly, I am extremely suspicious of balance. Mining, looting, and a few of the mining boosters seem extremely strong. I've never seen anyone win who wasn't heavily into mining and got one or more of the three extremely strong rooms (food with donkeys in mines, extra ore for mines, points for ore). Many of the other rooms related to agriculture and husbandry are obviously laughably weak. Also, there seems to be a significant first turn first player advantage.\n\nSecondly, the huge amount of up-front complexity, along with completely open and symmetric information is obviously problematic. With little inherent variability, this will be susceptible to optimal strategies and severe AP. I see the problems he was trying to solve, but this \"solution\" just introduces a different set of severe issues.\n\nAlso, the 7p support is ludicrous and has jacked up the retail for no good reason. Even 5p is probably a little too thin. 6 or 7p would be insane.\n\nSo I dunno. We were basically done with Agricola, and Caverna is kind of fun because it gets the system back to the table again with some neat new features. But I expect it to have a short shelf life.\n\nLast thing, while Caverna is pretty playable for Agricola vets, for anyone who hasn't played Agricola, Caverna can be completely overwhelming. Newbies are going to have to plow through several or many games of frustration to catch up.",
    "timestamp": 1637017200
  },
  {
    "username": "khakisheep",
    "rating": 4.0,
    "comment": "dent in lower right lid",
    "timestamp": 1632693600
  },
  {
    "username": "Ravensburg24",
    "rating": 4.0,
    "comment": "Sandbox-feeling and fantasy themed combined with beautiful components and engaging strategy. Fun to play casually (\"look at my cute farm!\") and competitively.\n\nIncludes the Forgotten Folk expansion w/ Halfling promo and Broken Token organizer. I think the Forgotten Folk expansion really helps by mixing up the otherwise static building pool, and the organizer makes it much easier to set up the game.",
    "timestamp": 1628460000
  },
  {
    "username": "VincentDarlage",
    "rating": 4.0,
    "comment": "I was disappointed with this game.",
    "timestamp": 1618783200
  },
  {
    "username": "larryjrice",
    "rating": 5.0,
    "comment": "This version of Agricola is a bit more open allowing for more specialization and probably even pushes you that direction. Food doesn't feel quite as tight despite having to feed quite often in the game and the 7 unknown harvest/feeding chits can be rather frustrating when they come up in the wrong order for you...;-)\n\nInstead of cards being used to provide variation, the rooms provide unique actions and abilities of which most there are only one of each except for the base dwelling. Adventuring is an interesting addition to the game as well which allows a person to go off and pillage stuff which is often better as you improve your weaponry. Frankly, this is the part of the game that really gets me interested in playing as it is really unique from the other \"Agricolas\".\n\nIt does not feel nearly as vicious as the original, but I find it quite interesting and enjoyable. I don't believe I would still ever play with more than 5...and possibly not more than 4 just to avoid downtime.\n\nFour player makes for a much tighter game than three player thus far in my brief experience. Imitation was used far more often in the four player game.",
    "timestamp": 1761170400
  },
  {
    "username": "rubiks777",
    "rating": 5.0,
    "comment": "Very enjoyable game. The first game felt much more stressful than subsequent plays because I had a better idea of actions needed to feed my dwarfs. Also played at 4 the first game with all of us as first plays which probably made it a bit harder. Would like to play this with 3 or 4 again at some point but most of my gaming is done at 2 which this game still shines at.",
    "timestamp": 1760824800
  },
  {
    "username": "leroy43",
    "rating": 5.0,
    "comment": "Quotes from me from my first play - “I like this 50% better than Agricola” (which I rate a 3).\n\nEven “liking it 20% better” for winning, it’s still a 5.",
    "timestamp": 1760738400
  },
  {
    "username": "rkleopold",
    "rating": 5.0,
    "comment": "Keep",
    "timestamp": 1760738400
  },
  {
    "username": "joanmoreno",
    "rating": 5.0,
    "comment": "Una versión de Agrícola que, por una parte, le quita algo de agobio al juego (lo cual no está mal) pero que tiene algunos puntos que para mí flojean respecto a su hermano mayor: como que todas las habitaciones están disponibles desde el principio o las \"expediciones\" de los enanos, que son un pegote espectacular.\n\nPero lo que menos me gusta es que no hay restricciones en la puntuación. Puedes hacer puntos con lo que quieras, como si quieres centrarte en tener 20 jabalíes.",
    "timestamp": 1759010400
  },
  {
    "username": "Destrio",
    "rating": 5.0,
    "comment": "Really mean worker placement game. Seems to have swapped out the cards for the open building play similar to Glass Road. Easier resource conversion than the prior game.",
    "timestamp": 1758837600
  },
  {
    "username": "opks22",
    "rating": 5.0,
    "comment": "iOS version.\n\nI was a beta tester for this game.",
    "timestamp": 1758405600
  },
  {
    "username": "slaapgraag",
    "rating": 5.0,
    "comment": "Had ik geweten dat dit zoveel op Agricola zou lijken, had ik m waarschijnlijk niet gespeeld. Alles levert puntjes of punten op, ontzettend veel keuzes en motortjes te maken, het wordt wat breien.",
    "timestamp": 1757455200
  },
  {
    "username": "RolandGaros",
    "rating": 5.0,
    "comment": "sale",
    "timestamp": 1755381600
  },
  {
    "username": "Hinmatt",
    "rating": 5.0,
    "comment": "In the worker placement game Caverna the focus of Agricola on agriculture is mixed with a focus on forging weapons to go on expeditions and get loot. Personally, I don't like that new part at all. The getting loot mechanism doesn't attract me and I don't like the generic dwarf theme.\nI am not really a fan on Acricola either, but I prefer it to Caverna because of the sole focus on agriculture and the feed your people theme.",
    "timestamp": 1753567200
  },
  {
    "username": "Fierezza",
    "rating": 5.0,
    "comment": "Thema nicht so meins",
    "timestamp": 1752876000
  },
  {
    "username": "_Dynomite_",
    "rating": 5.0,
    "comment": "So many pieces",
    "timestamp": 1749592800
  },
  {
    "username": "mdiep",
    "rating": 5.0,
    "comment": "I find this more enjoyable than Agricola in some ways. In Caverna, you escape subsistence farming and I start to feel like I've really built something by the end of the game. This is especially true for the expeditions, which can be really lucrative.\n\nI don't love the large number of buildings. I find that number of choices to be unpleasant in almost all of Uwe's games. But it does bring the Agricola format into line with his more recent offerings.\n\nSee my thoughts about other Uwe Rosenberg games in my Uwe Rosenberg Games I've Played geeklist.",
    "timestamp": 1746914400
  },
  {
    "username": "Kreha6",
    "rating": 5.0,
    "comment": "Agricola but with better scoring rules and waaaaay worse replayability",
    "timestamp": 1745272800
  },
  {
    "username": "Eoin Corrigan",
    "rating": 5.0,
    "comment": "Ugh. Dreary.",
    "timestamp": 1743116400
  },
  {
    "username": "Avid_Equinox",
    "rating": 5.0,
    "comment": "A significantly worse version of Agricola (it's predecessor game!)\n\n- More bloated than Agricola - you start with too many buildings that are all out at once. Usability issues, as these buildings can't easily be seen from across the table - compared to having cards in hand in Agricola.\n\n- Despite the many buildings, there is no variety between games - you could try the same strategy every game. This is the biggest downgrade from Agricola, where you have to be creative each time with which cards you drew - and provides limitless replayability.\n\n- Less tense than Agricola - the tension is what makes the game good!\n\n- Subjective but - the theme is better in Agricola than Caverna too",
    "timestamp": 1742943600
  },
  {
    "username": "Don_Pion",
    "rating": 5.0,
    "comment": "I bought caverna way back in 2013/2014, i played it, i enjoyed it, then it camped on my shelf for years and years, i sold it.\nThen i bought it again, played it again, kind of like enjoyed it, i played it a second time and sold it again\n\n+ lots and lots beautifull components\n+ more freedom then agricola\n\n- setup time\n- fixed setup instead of cards you get with agricola\n- i found it to be less fun, i miss the fences and the cows\n- more solitaire\n\nSo i prefer Agricola over this one, it has more tension, it's more edgy.\nBuilding the farm is more fun in this one",
    "timestamp": 1737586800
  },
  {
    "username": "ubRtstcl",
    "rating": 5.0,
    "comment": "Lacks all the tension of Agricola and has very little variability without the cards that Agricola has. The buildable rooms are like very generic Agricola cards and the presentation lacks the streamlined sleekness of Revised Agricola.",
    "timestamp": 1733094000
  },
  {
    "username": "Valcurdra",
    "rating": 5.0,
    "comment": "Really good game in isolation. But i would rather play agricola if given the option.",
    "timestamp": 1727215200
  },
  {
    "username": "Daminor8",
    "rating": 5.0,
    "comment": "Very long. Found it to be more tedious than \"fun\". Glad when it was over.",
    "timestamp": 1724104800
  },
  {
    "username": "data00",
    "rating": 5.0,
    "comment": "────────────────────────────────────────────────────\n처음부터 선택할 수 있는 게 너무 많습니다. 방 타일 내용도 처음부터 모두 공개풀에 놓입니다.\n뭘 해도 굶지 않으니 내가 한 선택에 의미가 있는지 의문이 듭니다.",
    "timestamp": 1721167200
  },
  {
    "username": "eddieb",
    "rating": 5.0,
    "comment": "Deep game with so many branching paths to victory. Be amazed!\nYet I look at this years later and Ive never wanted to play it again.",
    "timestamp": 1715205600
  },
  {
    "username": "Pintsizepete",
    "rating": 5.0,
    "comment": "This takes the actual best thing about Agricola (the card decks that encouraged thinking on your feet and variable strategies) and replaced that with extra layers of middle-manager pleasing filling-in-the-numbers gameplay. Yo dawg, I heard you like points so let's make every single action give them to you in one way or another, because there's like 12 scoring categories. Not having the variable special buildings of Le Havre or the different starting deals of Agricola makes this easily the worst of the three, and I don't even particularly like those other two that much.",
    "timestamp": 1713736800
  },
  {
    "username": "Urbanwatts",
    "rating": 5.0,
    "comment": "Traded for Gaia Project.\n\nNot great at two and very long for what it is. The worker placement didn't feel tight at all and most of the game felt procedural.\n\nI also had a hard time seeing the replayability of it.",
    "timestamp": 1702249200
  },
  {
    "username": "Thundergoat",
    "rating": 5.0,
    "comment": "\"Agony farm\" is not my favorite game I have played, lol. While the engine is solid, I derived little joy from the punishing farm simulator.",
    "timestamp": 1701212400
  },
  {
    "username": "ToreDenmark",
    "rating": 5.0,
    "comment": "Pretty good\nBut way too long.\nNever play with more than 3 players.",
    "timestamp": 1698357600
  },
  {
    "username": "andycted",
    "rating": 5.0,
    "comment": "Dull and repetitive, ran out of legs completely after 4-5 games. worker placement ain't my cup of tea",
    "timestamp": 1695765600
  },
  {
    "username": "jcoopersd",
    "rating": 5.0,
    "comment": "Way too much going on. Agricola is the cleaner, tighter design.",
    "timestamp": 1693778400
  },
  {
    "username": "K Fay",
    "rating": 5.0,
    "comment": "1 à 7 joueurs\n(Best 4)\n\nGabriel\nFlorence n aime pas car c est trop long a jouer car Gabriel reflechit trop",
    "timestamp": 1681509600
  },
  {
    "username": "Lograin",
    "rating": 5.0,
    "comment": "first game not solo.\nThought it won't be so tough.\nGreat experience",
    "timestamp": 1680040800
  },
  {
    "username": "tamsynulthara",
    "rating": 5.0,
    "comment": "A bit more fun than Agricola, but I generally can't stand games that make it really hard to fit everyone's relative score, and thus position, in your head mid-game.",
    "timestamp": 1679612400
  },
  {
    "username": "FR_IT",
    "rating": 5.3,
    "comment": "Boring, repetitive, not fun and no interaction at all.\nEssentially you play alone on your board and it is hard to counteract another player's strategy.\nLike Agricola and its successors this is not my taste.\n\nAnyway materials are excellent and properly produced.",
    "timestamp": 1679526000
  },
  {
    "username": "ashkai",
    "rating": 5.0,
    "comment": "Prefer Agricola due to the variable card draft that Agricola has which tends to lend itself to different strategies based on what you get.\n\nWith the same 2 players every game of Caverna and everything being laid out the same every game, each session tending to be too similar.",
    "timestamp": 1678489200
  },
  {
    "username": "Jdcnl",
    "rating": 5.0,
    "comment": "This game was so forgettable that I forgot I played it before when playing it for a 2nd time.",
    "timestamp": 1678230000
  },
  {
    "username": "vip_chicken",
    "rating": 5.0,
    "comment": "Punishing for anyone who takes suboptimal moves - takes a bit to understand your responsibilities and where the points come from. Can be nice to see your farm flourishing. Worker placement point salad. Runs long.",
    "timestamp": 1678057200
  },
  {
    "username": "BankofDracula",
    "rating": 5.0,
    "comment": "On its surface, Agricola but twice as much sounds appealing, but the reality is that it's more like there is 4x as much to crunch, plan, execute, etc. That's probably fun with familiarity, but at a certain point I just wanted it to be done.",
    "timestamp": 1677798000
  },
  {
    "username": "RalfMalf",
    "rating": 5.0,
    "comment": "Felt like Agricola with all the worst bits amplified.",
    "timestamp": 1677538800
  },
  {
    "username": "astomps",
    "rating": 5.0,
    "comment": "would almost always rather play Agricola",
    "timestamp": 1676502000
  },
  {
    "username": "grasa_total",
    "rating": 5.0,
    "comment": "I dislike Agricola, but there's something needly about it, something that gets under my skin and makes me want to understand WHY I dislike it, maybe even hope to enjoy playing it someday. Caverna removes most of the negatives from Agricola, but it's also missing the itch factor that would tempt me to give it a second chance. So that's that.\n\nUpdate 2023: Agricola finally got me! I get it, I like it, I appreciate it. I wasn't even a little more curious about Caverna as a result, though, until a friend urged me to try it with a friendly group and the Forgotten Folk expansion. I was able to win by doing all the stuff you can't do in Agricola-- go crazy in one direction and worry about how to balance your farm later. I guess that's fun? Rating raised from 4 to 5.",
    "timestamp": 1674946800
  },
  {
    "username": "speter22",
    "rating": 5.0,
    "comment": "Nusfjord and A Feast for Odin are the games you want. Just play those.\n\nI mean this one is still pretty fun, but why get a patty melt when you can get a Reuben for the same price? (this analogy only works if you like Reubens more than patty melts, like me. Clearly I'm hungry right now and want a sandwich",
    "timestamp": 1672873200
  },
  {
    "username": "TheDeckie",
    "rating": 5.0,
    "comment": "Played digital version only",
    "timestamp": 1672527600
  },
  {
    "username": "shmonkey",
    "rating": 5.0,
    "comment": "Like the other uwe rosenberg games I've played (Nusfjord, cave vs cave), this feels characteristically Uwe. This one has more going on than the other two titles. I had no problem handling the complexity, although two newer players were overwhelmed. Uwe's games aren't particularly exciting or rewarding to me, maybe I'm just spoiled by more hybrid WP games like Gaia project, on mars, keyflower, the gallerist, and others that have more going on. The mechanics are classic and competitive, but the games feel a bit aged even compared to much older games like caylus or many classic knizias. I think straight worker placement just isn't really for me, even if we'll executed.",
    "timestamp": 1670886000
  },
  {
    "username": "selwyth",
    "rating": 6.0,
    "comment": "Agricola the Family Game: The Game, not just because there is no hidden information, but also because it's much more forgiving. Resources can be converted to food anytime, it is easier to gain a Dwarf and they're worth less, penalties only for missing animals and tiles and no limit to scoring each category etc. Worked much better in practice than in theory, since I felt like I was watching the board and players instead of getting distracted by managing my hand. A slight bit of randomness in the timing of harvests in addition to the order of the action spaces so one can't script completely. Feels satisfying to watch your farm develop.\n\n4+3",
    "timestamp": 1759528800
  },
  {
    "username": "Jasonlin778",
    "rating": 6.0,
    "comment": "來源：財神",
    "timestamp": 1759356000
  },
  {
    "username": "Legomancer",
    "rating": 6.0,
    "comment": "I hate Agricola. I hate Le Havre. I don't remember much about Ora et Labora and Glass Road and I probably don't like them either. But I love A Feast for Odin, and I was told that this was a much better Agricola, which it turns out it is. I don't quite get all the bits of it, but I've enjoyed my plays.",
    "timestamp": 1758578400
  },
  {
    "username": "coxy_fc",
    "rating": 6.0,
    "comment": "Way too many things going on. Too many cards/tiles to read.",
    "timestamp": 1756764000
  },
  {
    "username": "Killi",
    "rating": 6.0,
    "comment": "My obvious Caverna and Agricola comparison:\n\nCaverna is for boardgamers who play a game once or twice and move on to the next game.\nI played it 4 times, did the same strategy which seemed very strong and won every time. Then I sold the game.\n\nAgricola is for boardgamers who like to explore all the intricacies and possibilities the game has to offer. Impossible to master.",
    "timestamp": 1756504800
  },
  {
    "username": "SeerMagic",
    "rating": 6.0,
    "comment": "For me this was meh. I just don't feel like I'm doing much. Feeding workers is still one of the most annoying mechanics in all of gaming. Too much of the game was fiddlying with that and trying to get more workers. Oh that and constantly having to add resources to worker spots. There is a reason most games only do this with 1 or 2 spots, not 8. Very annoying. I did like how fast the 2 player game works. And it is very smooth for the most part. I would play it if a group asked, but I would never request to play it. Which is how I feel about a lot of classic euro games.\n\n Nice components considering it's age\n Smooth playing\n 2 players flies by\n\n Annoying setting up the worker spots every round\n The quest to get more workers\n Feeding workers is maybe the most annoying mechanic in games",
    "timestamp": 1756072800
  },
  {
    "username": "Rogue1483",
    "rating": 6.0,
    "comment": "It's Agricola with extra steps and more fiddliness than pays off.",
    "timestamp": 1755554400
  },
  {
    "username": "Dozwa2902",
    "rating": 6.0,
    "comment": "played",
    "timestamp": 1754690400
  },
  {
    "username": "Kelsoli",
    "rating": 6.0,
    "comment": "This game is more fun with other players, but I'm usually a solo player. Very fiddly set up and tear down with so many cards and tokens and bits and bobs. Wish it was more solo-friendly or that I had others to play with.",
    "timestamp": 1753653600
  },
  {
    "username": "dtmoney75",
    "rating": 6.0,
    "comment": "5 plays\n\nExpansions: Water\n\nPlayed at: 2",
    "timestamp": 1749852000
  },
  {
    "username": "RobyaVP",
    "rating": 6.0,
    "comment": "2 player, solo",
    "timestamp": 1749333600
  },
  {
    "username": "andytaylor",
    "rating": 6.0,
    "comment": "Played Simon’s copy",
    "timestamp": 1748296800
  },
  {
    "username": "rand_alpha16",
    "rating": 6.0,
    "comment": "I was excited to play this because I love Agricola, but it didn't grab me. It kind of comes across as fiddly and mechanically crowded where Agricola (at least to me) seems a lot tighter.",
    "timestamp": 1746223200
  },
  {
    "username": "parpari",
    "rating": 6.4,
    "comment": "What a surprise! I like this more than Agricola. Caverna fixes some problems of Agricola like randomness of occupation cards and it is open information. Caverna is not a long game and rule heavy compare to heavy Euros of today. Caverna feels more thematic and cuter than Agricola. However, It has lot less tension than Agricola and more AP. Also, 6 or 7 players, seriously, it is to be 4 or 5 hours game. Anyway, Glass road does what Caverna does with the shorter playing time, more streamline and tension.",
    "timestamp": 1744063200
  },
  {
    "username": "dreamer1789",
    "rating": 6.0,
    "comment": "This would easily be a 7 or higher, if the game experience was a bit shorter. That is just a personal preference, though. I don't mind a 90 minute game, but this one got a bit too involved. Also, the set-up and take-down is just a hassle.",
    "timestamp": 1743289200
  },
  {
    "username": "totero",
    "rating": 6.0,
    "comment": "Long - 9 - Includes Water Expansion, mini Expansion",
    "timestamp": 1742770800
  },
  {
    "username": "Pickto",
    "rating": 6.0,
    "comment": "1-7",
    "timestamp": 1742252400
  },
  {
    "username": "mac_s_1",
    "rating": 6.0,
    "comment": "Enough similiarities with Agricola for me to not to own this one also, but a nice variation. I especially like the adventuring mechanism. I do wonder if the fixed set of buildings will make the game less replayable.",
    "timestamp": 1740438000
  },
  {
    "username": "Bomberdave",
    "rating": 5.8,
    "comment": "game felt solved by my 3rd play. expansions could fix that & change my opinion.\n\nedit: played an expansion & game didn't feel solved, but not much more interesting.",
    "timestamp": 1740092400
  },
  {
    "username": "klebinaldo",
    "rating": 6.0,
    "comment": "cansei",
    "timestamp": 1739228400
  },
  {
    "username": "B_Moores",
    "rating": 5.6,
    "comment": "Didnt add a huge amount",
    "timestamp": 1736722800
  },
  {
    "username": "Flatirons",
    "rating": 6.0,
    "comment": "On BGA premium.",
    "timestamp": 1736290800
  },
  {
    "username": "Reciclerishu",
    "rating": 6.0,
    "comment": "Understanding Caverna is easier if Agricola is played, because main core rules are very similar, with some additions and differences.\nMain part I liked Caverna better is that strategies can differ and scoring is more interesting and harvest phases are more dynamic adding twist to game overall.\nMinus is that it is not great game to play against players, that know from head what goes great with what, as there is much more information to take into account to begin with.\nOverall, Caverna had more freedom in action choice and not restrictive on play strategy.",
    "timestamp": 1735513200
  },
  {
    "username": "fffulmicotone",
    "rating": 6.0,
    "comment": "Agricola accomplishes the same things, but does them better",
    "timestamp": 1734994800
  },
  {
    "username": "Acyrogue",
    "rating": 6.0,
    "comment": "Good game, a little bit of set up with tiles and cards to organise, so it doesn’t make it to the table all that often, but an enjoyable game when it does.",
    "timestamp": 1734562800
  },
  {
    "username": "RodRahmati",
    "rating": 5.9,
    "comment": "Agricola boring version. It doesn't encourage you to play differently each time.",
    "timestamp": 1733353200
  },
  {
    "username": "stenole",
    "rating": 6.0,
    "comment": "(3-5P) Euro with worker placement and resource management. Farm, breed and mine yourself to a point salad victory.",
    "timestamp": 1731020400
  },
  {
    "username": "Cuparyk",
    "rating": 5.6,
    "comment": "The game itself is nice, but playing it solo (and that's what I do) soon gets dull, since there is no element of luck or any other variable in the game.\n\nSo once you've figured out what strategy gives you the most points, it immediately looses all replay value. At least it did for me.\n\nBUT, as I mentioned in the beginning, this is only valid for the solo game.",
    "timestamp": 1730502000
  },
  {
    "username": "Lilywhitesand",
    "rating": 5.9,
    "comment": "Un classique: du placement d'ouvriers(nains), de la gestion de ressources, de la culture et de l'élevage, de la construction d'enclos, d'équipements, d'habitations, de mines de charbon et de rubis, de lieux spéciaux vous donnant points ou parfois avantages, envoi de vos nains en expéditions, fabrication d'épée. N'oubliez pas de garder suffisamment de ressources pour nourrir vos nains.\nUn bon jeu, pas extraordinaire mais bien. Pas fan de la DA.",
    "timestamp": 1729720800
  },
  {
    "username": "HamsterByte",
    "rating": 6.0,
    "comment": "Worker Placement",
    "timestamp": 1726956000
  },
  {
    "username": "Kiro",
    "rating": 6.0,
    "comment": "1 - 7",
    "timestamp": 1725228000
  },
  {
    "username": "MrRajah",
    "rating": 6.0,
    "comment": "Inferior to Fields of Arle in every way, in my opinion, but I will still play it.",
    "timestamp": 1724882400
  },
  {
    "username": "wademitchell",
    "rating": 6.0,
    "comment": "7.5 Room to grow with more plays. It won't beat AFFO for me, but it may overtake Agricola.\n\nEdit: After playing both on BGA, Agricola has risen, and Caverna has fallen.",
    "timestamp": 1723672800
  },
  {
    "username": "to_mars",
    "rating": 6.0,
    "comment": "Played it a couple times. I prefer the stress of Agricola, but the strength of dwarves thing is pretty neat.",
    "timestamp": 1721944800
  },
  {
    "username": "Zachfromohio",
    "rating": 6.0,
    "comment": "Since my love for Agricola has grown, my love for this game has weakened. Very wide open, almost too wide. I do appreciate how it rewards specialization rather than balance, and plays better at 2, but not as interesting overall as Gric",
    "timestamp": 1718056800
  },
  {
    "username": "Guster333",
    "rating": 6.0,
    "comment": "Good game.",
    "timestamp": 1717797600
  },
  {
    "username": "Aditceria",
    "rating": 6.0,
    "comment": "Enjoy playing it, but it lacks tightness compared to agricola, so sometimes it can be gery solitaire and a bit dull, but overall it is a good game",
    "timestamp": 1714255200
  },
  {
    "username": "skraem",
    "rating": 6.0,
    "comment": "2 Plays. Really enjoyed this. The openness is interesting at 2 players, once you get past the fiddly animal rules.",
    "timestamp": 1712268000
  },
  {
    "username": "Rogon",
    "rating": 6.0,
    "comment": "H",
    "timestamp": 1708297200
  },
  {
    "username": "TVDinner",
    "rating": 6.0,
    "comment": "The swap of cards for buildings is great. I haven't decided if the adventuring has too much focus. Better than the 'Gric but we won't charge out and charge it.\n\n(2024) And we've had another two games in. I can't decide if I like the complete openness and many more resources with pathways over what Agricola offers.\n\nIt no longer as hard to feed, but it moves that difficulty elsewhere. One of our players has most emphatically stated that it sucks.\n\nI don't see any outright reason that it's better or worse than Agricola, so it gets the same 6. That's up from the 4 it had from the first play.",
    "timestamp": 1707692400
  },
  {
    "username": "Scre3zeR",
    "rating": 6.0,
    "comment": "I quite like the game; there is a lot to do, but the rules are not that complicated/ counter intuitive. I do find it rather lengthy in a multiplayer game. My biggest beef is with the box: there is no insert, which (for me) leads to a lot of setup and cleanup time. Which I don't appreciate. I did however buy an insert (January 2024). Hopefully I'll pick it up more readily once I have the insert. In that case I will update my score.",
    "timestamp": 1706310000
  },
  {
    "username": "gianluigifauci",
    "rating": 6.0,
    "comment": "Long setup and mostly boring",
    "timestamp": 1705618800
  },
  {
    "username": "raafl",
    "rating": 6.5,
    "comment": "A good game that partially improved on Agricola by lifting the VP restrictions, which in theory allows for more tailored playstyles, for example getting massive vps from stones. Unfortunately, by doing away with the cards it made the possible combos weaker and less interesting. Also, the menu-style \"adventuring\" is so dry and unthematic that it doesn't feel right.",
    "timestamp": 1761778800
  },
  {
    "username": "gildedrain",
    "rating": 7.0,
    "comment": "The threat of starvation in Agricola is a source of stress for us, and the game ends right when we finally get the puzzle solved so we never really get to see our engine running smoothly, which robs us of a little satisfaction. I'd like to try Caverna before buying to see if the lack of card variety is a dealbreaker despite the removal of the starvation threat. Rahdo thinks Glass Road is better than this, and it plays faster, so we're going to give that a shot first.\n\nUPDATE AFTER FIRST PLAY: OMG, so much more relaxing and enjoyable than Agricola. It's so much more streamlined and straightforward. I feel like I could actually teach this to people and that they'd enjoy playing. This game is just plain fun. Thank you Uwe Rosenberg.\n\nUPDATE AFTER 2nd PLAY: I successfully taught this to 6 new gamers, ages from 11 to 45. Everybody had fun. This would not have happened with Agricola (on their first play).\n\nUPDATE AFTER 5th PLAY: I can see the validity of the criticisms regarding the sameness of every game. I'm not to the point where it bugs me yet, but I can already appreciate what Agricola did with the cards and variability between games more as time goes on.\n\nUPDATE AFTER MORE PLAYS: We've dabbled with a print-and-play version of the Forgotten Folk expansion and I kind of like the directionality and asymmetry this brings to the game. My tastes are changing lately and there's something about Uwe's designs that is causing me to lose some interest. Several of his games have endgame scoring criteria that encourage all players to end up with very similar results. This is ultimately less interesting to me than divergent play with very different results, though perhaps that is hardest to design for and balance. At the end of the game, for the most part, all players will have similar looking farms / homesteads. It would be more interesting for me if I could explore a plants-only or animals-only or mining-only strategy and still remain competitive. Harmonies is one example where players are building different ecosystems to satisfy different animals. When I look around the table at the end of the game, each player's tableau tells a little story. Fantasy Realms is another one that has players follow completely different paths, where their ending hand tells a story, and they usually remain competitive.\n\nUPDATE AFTER A WHILE:\nMy tastes have changed. Component-bloat, fiddly setup, feeding your people, the full menu of buildings overwhelming new players, needing to apply variants to try to turn the game into what I wish it was, all add up to me not wanting to get this game out again. Setting it up is a chore. The fiddlyness of updating the board every round. That the game guides all players to a similar end result for scoring rather than allowing creativity and divergent gameplay. Putting it up for sale / trade. It had a good run.",
    "timestamp": 1761343200
  },
  {
    "username": "Auroric",
    "rating": 6.5,
    "comment": "Something about Caverna just doesn't totally do it for me. It's hard to put my finger on, maybe it was the established meta of the group I played it with, combined with the multiplayer solitare, but it just wasn't interesting enough to want to dive into. Still think it's a decent game, and I see why people like it.\n\nThinking back to my plays of this, it's interesting to think of why I bounced off it a bit. It was one of my first hobby games, and the hype at the time. I was coming from Terra Mystica: the first serious game I ever bought. I hadn't heard the term \"multiplayer solitare\" before, and in retrospect, I think this was where I discovered that I disliked it. The players I played with were experienced, and all opened with the same moves. This immediately coloured my experience, as there was nothing I could do about it, nor did it effect my decisions, besides showing me that my plan was clearly worse. Caverna definitely played an important part in showing me what I liked, and to not always believe the hype.\n\nOverall there's still some fun here, typical Euro stuff: choose a direction in your strategy and optimize as well as you can for it. There's enough variability that if someone really liked it I would play it with them and try out something new. Just not my thing.",
    "timestamp": 1760392800
  },
  {
    "username": "Togii",
    "rating": 7.2,
    "comment": "Strategic Depth: 10/10\nRNG Mitigation: 10/10\nGoofiness Potential: 4/10\nSimplicity: 1/10\nArtistic Direction: 7/10\n\nTime Commitment: 60 - 180 min",
    "timestamp": 1759960800
  },
  {
    "username": "hyde_70s",
    "rating": 7.0,
    "comment": "This is a good game, but there are just overly better 'Rosenberg' experiences out there.",
    "timestamp": 1759010400
  },
  {
    "username": "Penguinised",
    "rating": 7.0,
    "comment": "Good, but nowhere near as good as the sublime Agricola. It was at this point that Uwe and I began to drift apart in terms of what we think a good game looks like. Where is the crunch? Where is the sweat dripping from my brow? Where are the cool things that only I can do? To misquote one of the great philosophers of our time: \"Well, I would go with Concordia... but I'd be thinking of Agricola.\"",
    "timestamp": 1758578400
  },
  {
    "username": "clearush",
    "rating": 7.0,
    "comment": "Box top crease, three smashed corners. Still decent condition. 3D printed insert.",
    "timestamp": 1758232800
  },
  {
    "username": "AlPacino11",
    "rating": 7.2,
    "comment": "Excellent euro if you have never played Agricola!\nHowever:\n1.Agricola gives much more variability of playing experience depending on your Occupations and Minor Improvements.\n2.Agricola is much tighter!\n3.Agricola has much more straightforward rules (regarding animals storage, expedition, etc.)",
    "timestamp": 1757800800
  },
  {
    "username": "PraxisLoki",
    "rating": 7.0,
    "comment": "It was just too much!",
    "timestamp": 1756504800
  },
  {
    "username": "Drez",
    "rating": 7.0,
    "comment": "Very fun and challenging game that plays well as a solo game or with others. Very distinct from Agricola in my opinion. Can't wait to play again. Long setup and take down time are a little frustrating.\n\n7 on the Cindometer - it's like Agricola, which she likes, but has a little more overhead and has less variation due to the lack of randomized player cards each game.",
    "timestamp": 1756418400
  },
  {
    "username": "rexkow",
    "rating": 7.0,
    "comment": "Good game but for me not ever near Agricola. Getting rid of tons of cards may streamlined the game but it also killed very important part of my appeal to its predecessor. Better scoring, and some neet anty-snowball options don't outweigh almost endless strategic options from cards in Agricola.",
    "timestamp": 1756072800
  },
  {
    "username": "emelvin",
    "rating": 7.0,
    "comment": "Bigger, less dynamic version of Agricola. The game is good but I don't foresee any situations where I wouldn't rather just play Agricola instead.",
    "timestamp": 1755986400
  },
  {
    "username": "Sorp222",
    "rating": 7.0,
    "comment": "I was not going to buy a copy then saw a damaged box and negotiated. Looks like Gric with whistles on - loads more actions, more animals, expeditions, currency ('rubies') and loads of tiles open to all...Going to take some time to get my head round the increased options\n\n---------\n\n1st play 4 players 2 hours.\n\n1st impression is that this,in my fave Rosenberg since Le Havre. The choices are many but the conversion of resources into Vps is not too convoluted as his other recent games. Very much a hair let down Agricola variant.\n\n-------\n\n2nd &s3rd play. 2 players\n\nPreferred with 4, perhaps a little too much freedom and surfeit of resources in 2 player. I enjoyed it but preferred the claustrophobia with 4. Still enjoyable.\n\n--------\n\n4th play with 3 players - must unlearn 'Agricola' - and remember that VPs for things you are eating is not clever\n\n9 plays - 6 2 player. I prefer playing with more than 2 (that is still very enjoyable) because there is more competition for tiles and I am forced to approach the game in a different way\n\n12 plays. 2 player engagement waning compared to 'gric.\n\nBecause Caverna allows specialisation you have a broader, and the extra resources and currency allows combos and extreme positions to flourish . I do feel replay ability is limited to exploring strategic paths at different player counts. Gric' provides a unique tactical hand management challenge which I have not tired of after over 100 plays.\n\n--------------\n\n17 plays. Replay ability will now come from different player counts. 4 > 3 > 2. And. I suspect 5 ,6 and 7 even more interesting - but down time might outweigh the benefits.\n(Though that time would have to be spent thinking about plans y- z as others take stuff afore you) Wondering if there might be some mileage for smaller numbers in a quasi-draft, or randomly restricting the number of tiles?\n\n---------------\n\nCaverna better than Gric because it allows specialisation? no finding balance is just an interesting a goal as maxing out in one or tow areas.plus there is specialism in gric - it's just a little more subtle and about the food engine.\n\n-----------------\n\nOften a great food engine is as good as a bonus point tile - if feeding is in the bag then you can enclose, take mines, take gold.\n\n-----------------\n\nAfter 19 plays only really interested in 4 player + and an expansion.\n\n5 player tighter, and you must look sharp ish if you want to get the tiles you need. That's the only real experience difference.",
    "timestamp": 1755208800
  },
  {
    "username": "LotrScaper",
    "rating": 7.0,
    "comment": "A wealth of options takes the stress out of the Agricola game model while still not reducing the management overhead.",
    "timestamp": 1755122400
  },
  {
    "username": "Harveymcglenn",
    "rating": 7.0,
    "comment": "Fun puzzle. Kills Nations for multiplayer solitaire. Not as strategic as Agricola.\n\nUpdate: if you know agricola and the like, the mechanisms are a bit of a chore, nothing to exciting to learn.",
    "timestamp": 1754776800
  },
  {
    "username": "Arnar146",
    "rating": 7.0,
    "comment": "bga",
    "timestamp": 1754517600
  },
  {
    "username": "sykano",
    "rating": 6.8,
    "comment": "I'm not sure.\nsaid to be almost strictly better than Agricola\n+ good materials\n+ lots of stuff that you can do and different strategies possible !?\n- more or less boring theme (\"dwarven farmers\") ?\n- expensive",
    "timestamp": 1754344800
  },
  {
    "username": "mbiella",
    "rating": 7.0,
    "comment": "TRADE",
    "timestamp": 1753394400
  },
  {
    "username": "RoundTableGames",
    "rating": 7.0,
    "comment": "develop league once we buy and get stock",
    "timestamp": 1753308000
  },
  {
    "username": "kilianbognar",
    "rating": 7.0,
    "comment": "The dwarf theming instantly disappears in the background, but surprisingly the farming aspect disappears as well - I just don't feel like I'm running a farm, because of the mechanical restictions of the system - the rules around dogs feel especially mechanical. It's evident that the whole thing is very cleverly designed and the math works, and I even suspect that there is a chance for more player interaction than you'd think at first. But I probably expected it to feel a bit more like a wide open farming simulator sandbox, and it really doesn't - it feels like a mid-weight euro board game (which it is) where you have a lot of options, yes, but if you want to stay competitive you better find the optimal ones. I also just don't love the furnishing tiles; I wish they would unlock cooler, weirder abilities than what they provide. There's a ton of them, but in scope, they are all very similar.",
    "timestamp": 1752962400
  },
  {
    "username": "izarum",
    "rating": 7.0,
    "comment": "Digital version IOS.\nInteresting game but quick sandboxy with no guided direction that make each game play unique. The tableau building is not strong enough to start building a nice engine before the game finishes",
    "timestamp": 1752444000
  },
  {
    "username": "rws2029",
    "rating": 8.0,
    "comment": "Compelling. Engaging. Charming. A favorite.",
    "timestamp": 1762659600
  },
  {
    "username": "gabtrat",
    "rating": 8.0,
    "comment": "I love Agricola for its tighter worker placement mechanics, but I enjoy Caverna for the diverse farm setups each game, especially with the Forgotten Folk expansion. Should you get it? It depends what you and your group want to play. For me, 2 player Agricola All Creatures Big and Small gets played more due to it's speed and Caverna's sandbox feeling is more my style.\n\nThis game could really use a revised edition. While Rosenberg’s design is solid, it’s held back by clunky graphic design, the lack of an organizer, and an unattractive cover. The board looks dull, with a confusing mix of icons and text. You have to place a card off to the side to track something instead of it being integrated into the board. The food trades are the only aid printed on the player board, while other aids are a mix of cards and cardboard. Adding variants to randomize the starting tiles, similar to Agricola: All Creatures Big and Small, would be a nice improvement for a second edition. It really needs an organizer, a combined player aid, a tile reference for all players, and a way to store tiles in place on the boards.",
    "timestamp": 1762470000
  },
  {
    "username": "Manhattan Reject",
    "rating": 8.0,
    "comment": "It's not a game I clamour to play every night but when I do I really enjoy it. We all seemed to head off with our dwarfs on our own merry ways, some sticking to mining, some producing enough food from farming to keep Lidl in supply, others kept sheep and slept with them secretly in their caves at night while the more outgoing ones manipulated ore and armed themselves and headed out on wild adventures and came back with foreign marvels in the form of a pumpkin and a cow.",
    "timestamp": 1762470000
  },
  {
    "username": "apax",
    "rating": 8.0,
    "comment": "H",
    "timestamp": 1761519600
  },
  {
    "username": "jamesvanr",
    "rating": 8.0,
    "comment": "In: April 2023",
    "timestamp": 1761429600
  },
  {
    "username": "pallazzo47",
    "rating": 7.5,
    "comment": "good game. I like Agricola much more.",
    "timestamp": 1761170400
  },
  {
    "username": "clavi",
    "rating": 7.5,
    "comment": "Very similar to Agricola but I think slightly better",
    "timestamp": 1761170400
  },
  {
    "username": "ItsMagic",
    "rating": 8.4,
    "comment": "massive roleplaying specializing economize tactile unlocking peaceful mastering;\nfavoured over Agricola",
    "timestamp": 1760824800
  },
  {
    "username": "ayukene",
    "rating": 8.0,
    "comment": "Original, 1-7 players, 30-180 min, SPA",
    "timestamp": 1760392800
  },
  {
    "username": "TheWhisperOne",
    "rating": 8.0,
    "comment": "Fun game with tons of different ways to play your dwarves. You can focus on just farming, just mining, or do a mixture of both. There is no wrong way to play.",
    "timestamp": 1760133600
  },
  {
    "username": "MoMahili",
    "rating": 8.0,
    "comment": "Sale",
    "timestamp": 1759960800
  },
  {
    "username": "tphon",
    "rating": 8.0,
    "comment": "Sleeved - Standard\n3D Wooden Insert",
    "timestamp": 1759874400
  },
  {
    "username": "Sondari_Wobble",
    "rating": 8.0,
    "comment": "1-7 spillere\n+ Stor dybde og mange strategiske valg\n+ Høy gjenspillbarhet med ulike tilnærminger\n+ Variert tema: bondegård og huler gir mange handlingsvalg\n+ Solospill mulig med tilpasning\n- Lang spilletid\n- Mange komponenter gjør oppsett og rydding tidkrevende\n- Lite direkte interaksjon mellom spillerne\n- Kan føles overveldende med alle valg og handlinger",
    "timestamp": 1759701600
  },
  {
    "username": "beaglestorm",
    "rating": 7.5,
    "comment": "Sleeves - 30 - Standard European - Purple (FFS04):\nhttps://boardgamegeek.com/geeklist/164572/item/2988283#item2...",
    "timestamp": 1759183200
  },
  {
    "username": "gawlas",
    "rating": 8.0,
    "comment": "Not Sleeved",
    "timestamp": 1758924000
  },
  {
    "username": "AnnaNishimiya",
    "rating": 8.0,
    "comment": "Agricola was not deep enough for us. This scratches that itch.",
    "timestamp": 1758751200
  },
  {
    "username": "GomJabbar",
    "rating": 8.2,
    "comment": "My Rank: 46\n\nI am one of those people that prefer Agricola. Agricola has more tension and is a tighter game. Caverna seems to have too many options. But the solo mode is beat-your-own-score and there is no randomness. It can be \"solved\". Not good.",
    "timestamp": 1758146400
  },
  {
    "username": "TowersAlez",
    "rating": 8.0,
    "comment": "Casa",
    "timestamp": 1758060000
  },
  {
    "username": "peterlevi",
    "rating": 7.5,
    "comment": "4 (3,2)\n(open)",
    "timestamp": 1758060000
  },
  {
    "username": "nhg728",
    "rating": 8.0,
    "comment": "Bit heavy and takes minutes to set up.\nBut still provides enjoyable experience",
    "timestamp": 1757800800
  },
  {
    "username": "sucrates",
    "rating": 7.5,
    "comment": "Solid game. Reiterates Agricola but does away with the cards. That is both an upside (less reading, more playing) as a downside (no variety in setup, risk of favorite strategy lock-in). Also a little friendlier and scoring is easier.\n\nComponents are superb, solo play is good as well and there are much, much more choices at any time as in Agricola which is nice if you felt constricted for choice in that game. Another plus is the variety from player count to player count: each player count has it's own set of starting actions available, so the game will differ with each player count.\n\nIn short: a huge action space and variability by player count does lessen the pre-set nature of it all but it is still there (favorite lock-in strategies). So with repeated plays with the same group this game might become stale earlier as Agricola.\n\nThat being said, an expansion is on the way which probably adds a lot of modular expansions and at least one variable setup (don't know if it does but would be surprised if it would not).\n\nWhich game is better? Tough to say. Not burned out on the strategy of Caverna by a long shot, so for now I drift towards it a little more as towards Agricola. In the long run, I see Agricola taking back its spot as it is more variable. But the expansion changes all that and I'm fairly sure I won't hit saturation level with Caverna before that, so for the moment it is Caverna.\n\nFor new players this is definitely a friendlier game to pick up, but they need to be experienced gamers as the action space is pretty large. All the playing pieces do really give you a sense of tableau-building, having your nice little farm/cave. My kids loved that feeling, even though the actual game went way over their head. As such, it is a lot of work for dad so not something I'm really eager to break out with them again. Then again, if they request it, how can I say no?",
    "timestamp": 1757628000
  },
  {
    "username": "mafkegel",
    "rating": 9.0,
    "comment": "Custom cardboard insert",
    "timestamp": 1762647660
  },
  {
    "username": "Zouzou825",
    "rating": 9.0,
    "comment": "Now you have tons of choices of buildings, which gives me the feeling that this game is a bit too complicated, but less thinky than Agricola.",
    "timestamp": 1762470000
  },
  {
    "username": "ditterio",
    "rating": 9.0,
    "comment": "CAVERNA (1-7 players)\n\nSolo for Caverna: https://boardgamegeek.com/thread/1128291/random-selection-go...",
    "timestamp": 1762297200
  },
  {
    "username": "Hori16",
    "rating": 8.5,
    "comment": "Joguei somente 1 vez",
    "timestamp": 1761170400
  },
  {
    "username": "akinfantryman",
    "rating": 8.6,
    "comment": "We've owned this over a decade now; it's the one we have most consistently played. GREAT GAME! Everyone likes it, and it playes up to 7 so it works with kiddos and friends.",
    "timestamp": 1760738400
  },
  {
    "username": "ilopez10",
    "rating": 9.0,
    "comment": "Colocación de trabajadores ambientado en un clan de enanos que decide dedicarse a mejorar sus cuevas y dominios exteriores. Inevitable compararlo con Agricola.\n\nLa premisa del juego es similar a su primo mayor: gestionas una familia de enanos que tiene acceso tanto a su caverna para obtener recursos de la minería así como a sus dominios exteriores de alrededor. Es el mismo sistema de juego que Agricola: un jugador elige una acción, la ejecuta y el siguiente elige cualquier otra y la ejecuta, revelándose más acciones conforme el juego avanza.\n\nUwe Rosemberg ha diseñado un gran juego tras años de feedback de los jugadores de Agricola. Añade nuevas mecánicas que parecen hacer el juego menos exigente con la alimentación de la familia y expanden las formas de ganar de su predecesor. Estas mecánicas son:\n\n- La ausencia de cartas. La viarabilidad y los poderes especiales de oficios y adquisiciones menores se ven sustituidas por las habitaciones, que están al alcance de todos.\n\n- Aventuras. Una mecánica que emplea la acción de forjar gracias a un nuevo recurso llamado mineral. Permite obtener mejores recursos conforme mejore la calidad del armamento.\n\n- Reduce la importancia de la familia. Ahora es más sencillo alimentarla (no hace falta convertir el trigo en pan o cocinar los animales) y sus miembros otorgan menos PV´s que en Agricola (1 PV en vez de 3 PV´s).\n\n- Al igual que en Ora et Labora, la situación de las habitaciones en el tablero personal, cobra su importancia.\n\n- Hay un recurso que puede usarse como comodín (rubíes).\n\nSi buscas un final más abierto, un juego más permisivo con los errores y con un sentido más claro de \"construir algo\", decántate por Caverna. Si buscas un juego más estricto que recomepense al más habilidoso, Agricola.\n\nPROS: Menos punitivo. De entrada, menos exigente para novatos.\n\nCONS: Partidas más largas. Mesa extremadamente grande para jugarlo a gusto. Montarlo (y desmontarlo) necesita más tiempo del que piensas.",
    "timestamp": 1759615200
  },
  {
    "username": "Longshank22",
    "rating": 8.5,
    "comment": "My family gateway into board gaming world, will never sell this, good worker placement, prefer this with house rules (room drafting) to Agricola",
    "timestamp": 1759269600
  },
  {
    "username": "dmwainw",
    "rating": 8.9,
    "comment": "BGA",
    "timestamp": 1758578400
  },
  {
    "username": "EugeneLiu49",
    "rating": 8.5,
    "comment": "still like Agricola a tad more due to its tightness. but Caverna is pretty darn good.",
    "timestamp": 1758060000
  },
  {
    "username": "MrsDecumanusmaximus",
    "rating": 9.0,
    "comment": "Love this game!!!",
    "timestamp": 1757887200
  },
  {
    "username": "Loguec",
    "rating": 8.7,
    "comment": "Fun game but prefer Agricola. Would always pick Agricola first",
    "timestamp": 1757800800
  },
  {
    "username": "KingArv",
    "rating": 9.3,
    "comment": "Bought at Millenium 1/15/19 used for $40.",
    "timestamp": 1757196000
  },
  {
    "username": "admi99",
    "rating": 8.7,
    "comment": "river exp +inne dodatki",
    "timestamp": 1756591200
  },
  {
    "username": "RussPSmith",
    "rating": 8.5,
    "comment": "preliminary rating after first play.",
    "timestamp": 1756332000
  },
  {
    "username": "Bozok",
    "rating": 9.0,
    "comment": "Designed by Uwe Rosenberg. Best straight worker placement game I've played! Reimplements and improves Agricola. Compared to it, Caverna is a bit looser, less punishing. The Forgotten Folk expansion is highly regarded and adds asymmetric factions.",
    "timestamp": 1756159200
  },
  {
    "username": "kacperjestfajny",
    "rating": 9.0,
    "comment": "Far better variation of Agricola.\nAnd in comparison to Agricola - it has great replayability",
    "timestamp": 1755813600
  },
  {
    "username": "espoon82",
    "rating": 9.4,
    "comment": "With so many little tiles, at a glance Caverna seems really daunting and complicated, but it ain't too bad once you get it all set up. Decision-making is pretty straightforward, but there are a lot of options.",
    "timestamp": 1755813600
  },
  {
    "username": "turzin",
    "rating": 9.0,
    "comment": "ESSAYER AVEC EXTENSION",
    "timestamp": 1755813600
  },
  {
    "username": "clawp1995",
    "rating": 9.0,
    "comment": "3D Insert",
    "timestamp": 1755468000
  },
  {
    "username": "plyah",
    "rating": 9.0,
    "comment": "For me Caverna is the better Agricola, mainly due to the fact that you are free to specialize and don't need to balance everything on point. Moreover I prefer the open offer of many caverns (or buildings) over all the cards in Agricola. Both games are definitively worth trying!",
    "timestamp": 1755208800
  },
  {
    "username": "Papillon564",
    "rating": 9.0,
    "comment": "Sleeved & Inserted",
    "timestamp": 1754776800
  },
  {
    "username": "camax",
    "rating": 9.6,
    "comment": "Why did I wait so long to play this? I like Agricola (and the 2P version), and this is quite similar. Farming AND cave dwelling! These types of games definitely take practice to get used to, the \"pain\" of working so hard all game to build something, and then have it end right when you were satisfied But that grid keeps calling me back, to try to get better and better at it. (I'd be interested in trying the 2P version of this too!)",
    "timestamp": 1762470000
  },
  {
    "username": "sevs88",
    "rating": 9.7,
    "comment": "One of my top favorite games and my family enjoys it too. Not to cut throat when playing a friendly game and you can go in a bunch of different building directions. Of all my plays so far I haven't done the same strategy twice as I like to try different things. My daughter is an adventurer and my wife is a livestock/farmer every game. We enjoy all the pieces, I've bought storage boxes to minimize setup/clean up of the game.",
    "timestamp": 1761606000
  },
  {
    "username": "Benncory",
    "rating": 10.0,
    "comment": "Solo",
    "timestamp": 1761429600
  },
  {
    "username": "Kinnnus",
    "rating": 9.6,
    "comment": "3",
    "timestamp": 1761343200
  },
  {
    "username": "el_crosso",
    "rating": 9.9,
    "comment": "This clicked more with me than its older sister, Agricola.",
    "timestamp": 1761084000
  },
  {
    "username": "Johnny Opie",
    "rating": 10.0,
    "comment": "I love this game. Even worked at 7 players (though very long and was my learning game, so I needed the time). I would play this a lot more if it wasn't too heavy for my group.",
    "timestamp": 1758837600
  },
  {
    "username": "OGRussHood",
    "rating": 9.9,
    "comment": "My 2025 Top 250: #102\nMy 2024 Top 250: #76\nMy 2023 Top 250: #56\nMy 2022 Top 250: #41\nMy 2021 Top 250: #30\nMy 2020 Top 250: #27\nMy 2019 Top 200: #24\nMy 2018 Top 100: #26",
    "timestamp": 1758492000
  },
  {
    "username": "Sigurd1410",
    "rating": 9.5,
    "comment": "Another of Rosenberg CLASSICS!!!",
    "timestamp": 1757887200
  },
  {
    "username": "dthomas97",
    "rating": 9.5,
    "comment": "Great game play that creates a thematic experience. It’s worth the long set up to see the world that you can create",
    "timestamp": 1756591200
  },
  {
    "username": "xistonxiston",
    "rating": 10.0,
    "comment": "In-game free",
    "timestamp": 1756245600
  },
  {
    "username": "DiceMind",
    "rating": 9.5,
    "comment": "Base game: 10/10, BGA: 4/10",
    "timestamp": 1755813600
  },
  {
    "username": "ChaoticSeraph",
    "rating": 9.5,
    "comment": "It just keeps bringing me back by wanting to try a different strat to beat my previous high score. Unexpectedly addicting.",
    "timestamp": 1755727200
  },
  {
    "username": "voronwecalanon",
    "rating": 10.0,
    "comment": "Really great game. My personal favorite of the Uwe Rosenburgs. Though I really like A Feast for Odin, this one is easier to setup and teach.",
    "timestamp": 1754776800
  },
  {
    "username": "Napattack",
    "rating": 9.5,
    "comment": "3.77\n1-5\nBest at 4\n210 (1,050)\n#32",
    "timestamp": 1753999200
  },
  {
    "username": "chadgibbons",
    "rating": 10.0,
    "comment": "Walls Storage",
    "timestamp": 1753394400
  },
  {
    "username": "BeardedBandito",
    "rating": 9.5,
    "comment": "If only the game was a looker! Really fun worker placement, you want to accomplish so much then you get blocked on a spot or furnishing taken then you have to pivot.",
    "timestamp": 1753048800
  },
  {
    "username": "Straddllw",
    "rating": 9.5,
    "comment": "This game just slightly edged out Agricola for me but ultimately, despite similar mechanisms, the strategy is almost polar opposites. You get more choices in how you want to play and you can experiment with different specializations. Definitely room in my collection for both Agricola AND Caverna.",
    "timestamp": 1752444000
  },
  {
    "username": "Riverwulf1",
    "rating": 10.0,
    "comment": "My wife and I got this to the table for the first time. We played it 5 times now in the first week. We've played Agricola maybe a dozen times and love it (I rated it a 10 also). This game is either new and shiny, or just more fun for us to explore different possibilities.",
    "timestamp": 1752357600
  },
  {
    "username": "AntiQuacksalber",
    "rating": 10.0,
    "comment": "Mega Spiel! Macht eigentlich alles richtig!",
    "timestamp": 1751925600
  },
  {
    "username": "hockeyjones",
    "rating": 9.9,
    "comment": "6\n\nPlayed in 2025\n\nHS: 62",
    "timestamp": 1750802400
  },
  {
    "username": "chadjanet",
    "rating": 10.0,
    "comment": "Upgraded tile holders for houses",
    "timestamp": 1750456800
  }
]