[
  {
    "username": "GuySamstag",
    "rating": 1.0,
    "comment": "The plastics make this one just a bit worse for me, than others of its ilk.",
    "timestamp": 1759183200
  },
  {
    "username": "zmartianov",
    "rating": 1.0,
    "comment": "This game glorifies apocalypses as something good",
    "timestamp": 1754604000
  },
  {
    "username": "lililililil",
    "rating": 1.0,
    "comment": "Automata",
    "timestamp": 1747432800
  },
  {
    "username": "blmartin23",
    "rating": 1.0,
    "comment": "Wow is this a bland and boring game. It might be the worst game I have ever played that isn't targeted at children.",
    "timestamp": 1721512800
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "Ignore the military robots, it's mostly just resource extraction. I guess maybe you fight once just to get some points.",
    "timestamp": 1720648800
  },
  {
    "username": "sighlance",
    "rating": 1.0,
    "comment": "I don't like that the \"bottom-row actions\" on the player boards become useless in the later part of the game. For example when you have built all your buildings, the build action is then pointless. Unfortunately this is true for ALL the bottom-row actions. Why can you do less after you developed your faction? This aspect of gameplay is highly unsatisfying for me. I will have to play the game a couple more times to see if this really bothers me.\n\nYes, you can keep using the bottom-row actions just for the money / bonuses, but they cost the same as if using them fully, which makes no sense: \"So I use a build action paying materials required to build a building that I do not build. And then I get money.\"\nThis could be solved simply by \"unlocking\" some special ability or bonus when completing a bottom-row action.\n\nI also don't like the game's combat system which I find too deterministic and boring.\n\nAlso the replayability of this game is pretty low, since there is no variability in setup and faction abilities. The only thing different from game to game are the Encounter Cards, so you may get different resources each game, which won't alter the gameplay significantly.\n\nUpdate: It was discovered that several faction/player mat combinations are severely overpowered (Crimea/Patriotic and Rusviet/Industrial). These combinations are now officially banned from play. I think insufficient playtesting is a general problem in the industry that needs to be addressed (see also Fantasy Flight Games). Infuriatingly, the designer Jamey Stegmaier announced the broken factions will not be fixed, so I consider this game broken until he changes his mind.",
    "timestamp": 1712181600
  },
  {
    "username": "VultR",
    "rating": 1.0,
    "comment": "Many say it's good",
    "timestamp": 1705878000
  },
  {
    "username": "Kaladin47",
    "rating": 1.0,
    "comment": "Amazing artwork really wanted to enjoy this game was super excited about it. About 2 hours in I am making moves just trying to end the game. Would have walked away but other people were playing and didn't want to ruin it for them. After 5 + hours yeah its over we win!!! (the game was over) I lost but yeah it was over!!! Would have to say this was the first game I've played that I wish I was playing Monopoly instead will not give this game another chance.",
    "timestamp": 1704927600
  },
  {
    "username": "Sajel",
    "rating": 1.0,
    "comment": "Very boring. Not my type of game. I feel like I am wasting time and my energy and my head when I am playing it. Don't buy it. It's not worth it. If I had the time, I'd rather go to sleep. Sleep is more fun than this game.",
    "timestamp": 1702681200
  },
  {
    "username": "Jimifredjr",
    "rating": 1.0,
    "comment": "I wish I liked this game but it is so boring. The lack of interaction is anticlimactic and it almost feels like combat was an afterthought.\n\nI've played the board game 5 times now with 4 players and the mobile game hoping to find some joy and I still can't get over how boring it is.",
    "timestamp": 1694037600
  },
  {
    "username": "iplaybgnaked",
    "rating": 1.0,
    "comment": "Bad game that doesn't commit enough to its euro aspects to be an interesting as an engine builder nor to its logistical action on the map to be interesting as a wargame leaving me with a game that's equal parts mediocre. The fact the game is largely solvable and you still have to play the same opening moves all alone in your own corner of the map at the start of each game to get an engine going is a complete turn off, to the point that I question why I'm wasting my time playing this half baked garbage.",
    "timestamp": 1686952800
  },
  {
    "username": "doggydog",
    "rating": 1.0,
    "comment": "many parts to the game, but they didnt click togethr for me.",
    "timestamp": 1684101600
  },
  {
    "username": "Eiknarf",
    "rating": 1.0,
    "comment": "Digital Copy",
    "timestamp": 1684015200
  },
  {
    "username": "el_guido78",
    "rating": 1.0,
    "comment": "Shit game",
    "timestamp": 1680386400
  },
  {
    "username": "xCriticalStrikex",
    "rating": 1.0,
    "comment": "What a boring, completely unengaging game. My friends love it butt it defies all reason.",
    "timestamp": 1677020400
  },
  {
    "username": "_Kira_",
    "rating": 1.0,
    "comment": "there were no plans after dinner so i wanted to play this game with my wife\nafter few minutes my wife was so bored that she committed suicide by grabbing her favourite knife from the kitchen\ni tried to play scythe with the kids but they were also so bored they jumped through closed window and fell on the street\nwhen i showed this game to my cat she entered my dog's mouth and said to dog, chew me bitch ! chew me goddammit and never stop !\nthen i asked my dog to play scythe but he ran downstairs in the basement and began furiously licking wires until electricity made blanket out of him\nthen i decided to go and show this game to my mazda but the moment car saw me holding this game in my hands, mazda momentarily used the full potential of turbo charge and charged its turbine like no tomorrow until it was choking in the middle of the river\n\ni really want to play this awesome game but theres no one to play with,\nafter few weeks my town became ghost town just because i asked its citizens to play scythe\nthere are no even birds flying around anymore and the grass is no longer growing, terrain is dry because rain is refusing to fall\n\ngoddammit i just wanted to play some scythe not to cause apocalypse to my town\nthis game is more devastating than playing jumanji",
    "timestamp": 1674860400
  },
  {
    "username": "Nathanllarsen",
    "rating": 1.0,
    "comment": "I’ve played this game multiple times and each time it was about as boring as it could get. I’ve had more playing Monopoly.",
    "timestamp": 1672959600
  },
  {
    "username": "salom_bottle",
    "rating": 1.0,
    "comment": "joyless and boring. very little interaction with other players. you plod along, build your little faction, spond most of your time waiting for your turn, and then all of the sudden out of nowhere, someone wins. why does someone win? because of some accumulation of disparate and unrelated victory tracks. who fucking cares. 40 minutes to set up the game, 90 minutes to explain the rules, and what do you get out of it?",
    "timestamp": 1670367600
  },
  {
    "username": "foxrain4",
    "rating": 1.0,
    "comment": "Want to play only because already owned it.\nIt looks so unnecessary complex",
    "timestamp": 1662847200
  },
  {
    "username": "Salegan",
    "rating": 1.0,
    "comment": "Just Agricola in different set-up. The theme is misleading, since it's cover is promising a conflict and cooperation between rivaling factions, but after unboxing it is just another worker-placement game with practically zero interaction with other players. Everybody just plays their own game, alone. Next to each other, but alone. And even the worker placement itself is not even interesting.",
    "timestamp": 1659823200
  },
  {
    "username": "Balthierr",
    "rating": 1.0,
    "comment": "Overhype and boring game",
    "timestamp": 1656367200
  },
  {
    "username": "pdruzik",
    "rating": 1.0,
    "comment": "Very bad gamedesign.",
    "timestamp": 1646002800
  },
  {
    "username": "aquaboy93",
    "rating": 1.0,
    "comment": "Pros:\n\n- Dual-layered personal player boards\n\nCons:\n\n- Imbalanced encounters\n- Simplistic, boring combat\n- Dull-looking art\n- Not very thematic\n- Badly designed expansions\n- Tunnels\n\nI've played this 3-4 times and couldn’t really get into it as it felt like a chore for me to finish. This game single-handedly made me dislike Euros to the point that I didn’t touch another one for over a year.",
    "timestamp": 1640646000
  },
  {
    "username": "W33k5",
    "rating": 1.0,
    "comment": "The hype machine on this game is incredible. The game itself is not. You have those awesome mechs and minis that you use to...make oil.",
    "timestamp": 1613602800
  },
  {
    "username": "Tegarend",
    "rating": 1.1,
    "comment": "Poster-child of the over-produced, pseudo-thematic, under-simulative everything-and-the-kitchen-sink kickstarter crap that passes for games these days.",
    "timestamp": 1589061600
  },
  {
    "username": "ChangoPerro",
    "rating": 1.0,
    "comment": "X",
    "timestamp": 1588888800
  },
  {
    "username": "spettinik",
    "rating": 1.0,
    "comment": "Ho giocato ma mi pare un mix di tutto un po', bocciato",
    "timestamp": 1577660400
  },
  {
    "username": "Chibazkun",
    "rating": 1.0,
    "comment": "Art Connoisseur Collector's edition",
    "timestamp": 1570312800
  },
  {
    "username": "Onizukaahhh",
    "rating": 1.0,
    "comment": "Overrated. Unbalanced as hell for a game of pure efficiency.",
    "timestamp": 1567720800
  },
  {
    "username": "bunoc",
    "rating": 1.0,
    "comment": "way overrated, good looking but boring on board",
    "timestamp": 1567116000
  },
  {
    "username": "vitruviusbeard",
    "rating": 1.0,
    "comment": "It is a good game. Although I don't think it should be so high on the list. It can be very restrictive in the avenues you can take each turn. Most games seem to have the exact same timing arcs and the difference in classes and gameboards keeps things different from game to game, but the powers really arent that fun personally. It is a big investment so try it before you buy it. The art is fantastic, the quality is high. But it is a cold calculating sort of repetitive game.",
    "timestamp": 1562364000
  },
  {
    "username": "mdean",
    "rating": 1.0,
    "comment": "Action selection, engine building, whatever. Play on the map is extremely unsatisfying. Overall uninteresting. Great art though and the minis are cool. Very much like the pastoral total war theme.",
    "timestamp": 1561240800
  },
  {
    "username": "aaaaa142857",
    "rating": 1.0,
    "comment": "A hybrid failure.",
    "timestamp": 1559685600
  },
  {
    "username": "wafflebun",
    "rating": 1.0,
    "comment": "good art. the minis look nice but completely unnecessary as this isn't a minis game or one that even really does combat.\n\nIt's a euro engine building game that's fairly solitaire. The action mechanic system is interesting and clean. Everything else not so much. Arbitrary scoring choices.",
    "timestamp": 1558908000
  },
  {
    "username": "opacity",
    "rating": 1.0,
    "comment": "Lives off the art. Stagnant, uninspired, unbalanced, derivative gameplay.",
    "timestamp": 1557784800
  },
  {
    "username": "Aeren",
    "rating": 1.0,
    "comment": "Most overhyped game ever. Beautiful design, but crap game.",
    "timestamp": 1547506800
  },
  {
    "username": "Infernotez",
    "rating": 1.0,
    "comment": "Another game I really don't like, but this is one of the first that had me not liking it from turn 1. I kinda stuck through it for the whole game but I regret that, the worst part is I felt like I was losing from the point I realized the faction placement and mine was against what I planned to do. I guess it's like blood rage that completely polarizes me even though it's not a horrible game.",
    "timestamp": 1546729200
  },
  {
    "username": "Dave72",
    "rating": 1.0,
    "comment": "THE most overrated game ever! Probably worth a 5 but I'd do anything to lower its average and bump it down the rankings.",
    "timestamp": 1543532400
  },
  {
    "username": "datefruit",
    "rating": 1.0,
    "comment": "too heavy ...",
    "timestamp": 1538431200
  },
  {
    "username": "chrisoc13",
    "rating": 1.0,
    "comment": "I can't help but think this game is just so beautiful. I wanted to love it. I tried so hard to love it. Everything is full of bling, it should be right up my alley. Euro and conflict in one, on paper this game was exactly the right game for me. In reality though I found the combat tedious and boring, I found the euro aspect tedious and boring, and all I was left with was a beautiful game to look at and never want to play. Not a bad game. But not a good game either. I have actually written a full review on it.",
    "timestamp": 1529618400
  },
  {
    "username": "eokasgout",
    "rating": 1.0,
    "comment": "Stolen art.",
    "timestamp": 1526076000
  },
  {
    "username": "CasualSax",
    "rating": 1.0,
    "comment": "The artwork of this game is plagiarized. Jakub Rozalski is a sham. More info here: https://www.reddit.com/r/conceptart/comments/853k2g/the_trut...",
    "timestamp": 1525816800
  },
  {
    "username": "Ganadai",
    "rating": 1.0,
    "comment": "The game is VERY unbalanced. The box art looks cool, but that's about the only thing the game has going for it. By the end of the game everyone at the table just wanted it to be over.",
    "timestamp": 1523138400
  },
  {
    "username": "Gruntowny",
    "rating": 1.0,
    "comment": "I fu*kin HATE all this unnecessary ameritrash sh*t, that is attached to this game, that would normally be mediocre/good euro.",
    "timestamp": 1515970800
  },
  {
    "username": "Khrysto",
    "rating": 1.0,
    "comment": "Soulless game.",
    "timestamp": 1515452400
  },
  {
    "username": "warmachine519",
    "rating": 1.0,
    "comment": "Very good looking game that hides a very dull euro game. It is truly a mismatch of many different game types that just doesn't work. Just by looking at it seems like there will be a lot of player interaction but really its very low. Huge disappointment.",
    "timestamp": 1514329200
  },
  {
    "username": "Marty S",
    "rating": 1.0,
    "comment": "You look at the game box cover and you think its gonna be a smash and grab game of apocalyptic combat. Instead, you're gathering resources and what little combat exists merely sends the loser running home to mommy. On top of that, bizarre movement rules mean you might have to traverse halfway around the map to move across a water obstacle your opponent can move over at will. Fail.",
    "timestamp": 1514242800
  },
  {
    "username": "steggy",
    "rating": 1.0,
    "comment": "I really wanted to like this game. I was ready to custom paint it and go all out, but after a bunch of plays it has fallen flat. With each play the game slowly became an obvious failure. Probably only rated so high because of its thematic beauty, which is reason enough to own this game. There are too many other great games to waste a game night on this game.",
    "timestamp": 1511132400
  },
  {
    "username": "unprinted",
    "rating": 1.0,
    "comment": "Get Terra Mystica instead. Unless you get moist thinking about giant fighting robots - and I know some do - then all the good bits of this came from there.",
    "timestamp": 1509228000
  },
  {
    "username": "Sageryu21",
    "rating": 1.0,
    "comment": "Didn't understand the point of the game. Didn't see why I was wondering around collecting food that looked like pots of gold. Didn't have fun.",
    "timestamp": 1501452000
  },
  {
    "username": "Vroomer",
    "rating": 1.0,
    "comment": "Spoiler - get oil first. Win.\n\nThe more and more I wanted to like the game, the more and more everything about it turned me off: theme, mechanics, miniatures, production, etc. During the KS project I printed out a print and play copy to play & test. Got pieces together and read the rules.\n\nIt all fell flat. It's hyped as a 4X game. It's barely 2X and those two parts are half way done.\n\nFor me, this is an engine builder for the sake of building that engine.\n\nPass.",
    "timestamp": 1501279200
  },
  {
    "username": "DeathWind2013",
    "rating": 1.0,
    "comment": "I really don't get why this game is so much loved.\nI think there is too few interaction between the players. If i take some time to get together I wish it is to interact. In this game, everyone does his little thing and in the end someone win.",
    "timestamp": 1498773600
  },
  {
    "username": "shinji72",
    "rating": 1.0,
    "comment": "Totally overrated. Epic artwork... very good component. Ugly map.\nAbove all, it's gameplay system is both complicated and uninteresting.",
    "timestamp": 1494194400
  },
  {
    "username": "foolio82",
    "rating": 1.0,
    "comment": "Not bad, but not top10 for sure... Completely overrated, overhyped -> counter score 1.",
    "timestamp": 1482188400
  },
  {
    "username": "Xtallll",
    "rating": 1.0,
    "comment": "The maker of this game has been actively preventing the sail of it on Massdrop, he decided to take his ball and go home.",
    "timestamp": 1475791200
  },
  {
    "username": "Peepser",
    "rating": 1.0,
    "comment": "Disappointed. Played one two player game. Definitely overhyped. I was hesitant to buy another Stegmaier game based on my very negative reaction to Euphoria (again, too much chrome, not enough game) but this is slightly better than Euphoria. Components and art are great but quality control is not. Broken meeple, various scuffed and dented mats, cards with bent corners. Will give it a few more plays. Hopefully better with more players.\n\nThe best part to me were the hidden encounter cards and the art on them. I couldn't care less about plastic minis. It's very disappointing to see the general gaming public reacting with such fervor to Ameritrash toys/gimmicks like this. This game would sit nowhere near its current ranking if the minis were blocks of wood of varying colors.\n\nDecisions were too obvious, too simple, and repetitive. Make resources, buy stuff, repeat. Game drags. Too long. Speeding up play by doing your bottom row action while opponent starts their turn didn't work either. The first thing my opponent said when I tried to speed up the game this way, was \"I'll wait. I want to see what you're doing.\" There was only one time where I had to think twice about something and that was a rare attack situation. Otherwise, we're playing solitaire.\n\nI did not like how easy it was to accumulate combat cards when you got the enlist actions going, especially considering that battles are very infrequent. I had 9 cards in hand at one point. What's the point? And your opponent getting benefit when you used the enlist action was too hard to keep track of and made zero thematic sense. Could drop this part and it would make little difference. Also seemed a waste to have only max one or two objective cards available when there is a full deck of them. There should have been more access to this, and less to getting extra combat cards.\n\nToo easy to get around the map with tunnel access everywhere, mines, extra speed. Keeping track of your opponents movement options also a chore as each faction is different. Not much interaction, and battles are a crapshoot as you just get lucky when drawing combat cards. Could easily get a 5 or a 2. No skill involved there.\n\nGame even worse with 5 players. Still very little interaction. Drags on far too long. Almost everyone was begging the star leader to end the game.\n\nMy advice for future designers: find a good painting, then kickstart a game based on it. You too can raise 1.8 million. The box art is amazing, only wish the game was half as good.\n\nUpdate: rating lowered from 5 to a 1. Not impressed with Stegmaier's attitude and customer service. Refused to replace damaged parts of the game, even after sending photos. Understandable, as the 1.8 million was already spent on jumping beans and two pieces of precious cardboard were not available. Perhaps he needs to convert 2 wood to cardboard? Then posted my private emails in the BGG forums so his pack of fanboy wolves could go to town. Never experienced anything like it. So unprofessional, the mind boggles. Needs to assign someone else to customer service and take a vacation.\n\nActual Stegmaier quote while posting my private emails to a BGG forum while refusing to replace damaged items: \"Obviously my customers are incredibly important to me...\"",
    "timestamp": 1472076000
  },
  {
    "username": "sircaradoc",
    "rating": 1.0,
    "comment": "I have played this game twice now and both times I had a terrible experience playing. The game would have been amazing if it did not have combat in it, but I feel as though the combat is a slippery slope to fight on.\n\nYou need to defend yourself, so you fight. But to do, you need to blow all of your might (which in turn is actually vp) to win a battle. After winning the battle, you notice that you have become an easy target, all because you needed to stop your goods from getting lost.\n\nOr you could use your goods. But wait, you cant because you just took that action, or worse, its a coin action and mind you, coins are VP.\n\nMy experience was so bad, I wont ever play this game again. I think it was a flaming pile of garbage. And only 1 game so far had topped it in terribleness : spinning monkeys. But not too far behind is marco polo.",
    "timestamp": 1470693600
  },
  {
    "username": "St0ckpile",
    "rating": 1.0,
    "comment": "Contemptibly innept refuse is standard fare for this amateur garbage huckster.",
    "timestamp": 1470348000
  },
  {
    "username": "Taras1983",
    "rating": 1.0,
    "comment": "The world of the game plagiarized Dust tactics! Cavalry was ridiculous in front of tanks in the 20s, in front of walkers it is even more of a laughing stock. If all these walkers come from one source ('Factory') why they different for different nations? Gameplay is not innovative as well. Artworks are the best part of this project, but even they lack details so badly.",
    "timestamp": 1461621600
  },
  {
    "username": "Teemonek",
    "rating": 2.0,
    "comment": "Battles are so pointless, zero replayability and \"actions\" are so boring - build/upgrade/move. Each game looked exactly the same :/\nAt the end wins person who has the most coins, even if they get 2 or 3 starts/achievements.",
    "timestamp": 1761865200
  },
  {
    "username": "SpielzusammenGER",
    "rating": 2.0,
    "comment": "Nope. First of all: Unbalanced factions. Like really imba. Secondly, this game takes way too much time. Played it more than 6 times now and never a single game below 2 hours.\n\nThe only thing I enjoy is the coop mode. The rest is annoying, slow and VERY repetetive.\nSeriously. It feels like sorting rice corns based on colour.\nAlso, why do figures retreat instead of being destroyed? You call this a mech fighting game? Nothing gets destroyed. The mechs just move one field or to the home base and come back again? Thus totally eliminating any need for fighting, unless it is a mission.\n\nBoring, long, unbalanced. Mostly enjoyed by people who play solo mode and that dont understand that not everybody has 6 hours to play this game. Hard pass. Not recommended.",
    "timestamp": 1761429600
  },
  {
    "username": "Apo_64",
    "rating": 2.0,
    "comment": "Honestly, I expected much more form this, played 3 games and none of these were actual fun, it felt very heavy but without any (or almost any) interaction with other players, given the price and time needed to learn it is NOT worth it.\n\n(2 - Very bad - won’t play ever again. BGG ratings)\n\nI think for such complexity you can find much nicer games at lower prices. I don't know why all the hype around it, cannot honestly understand it. The 50th game you play of seven wonders duel with an expansion will feel much nicer and involved for a discrete complexity.",
    "timestamp": 1749506400
  },
  {
    "username": "langschnabel",
    "rating": 2.0,
    "comment": "Everything in this game isn’t my taste.",
    "timestamp": 1739142000
  },
  {
    "username": "Drenchoor",
    "rating": 2.0,
    "comment": "Слишком примитивная для своего внушительного размера и оформления. Ну и просто не зашла, хоть и давал ей 4 партии шансов.",
    "timestamp": 1736636400
  },
  {
    "username": "tectactoe",
    "rating": 2.0,
    "comment": "I love the action selection mechanism here (top/bottom) and how it can vary from game to game, faction to faction, which can radically change your approach to strategizing right out of the gate. The gate itself, though, tends to feel anticlimactic at times, especially toward the end. I think it has something to do with the endgame trigger(s), which can come on rather quickly and without much resistance if players aren't actively trying to impede others. It is perfectly conceivable that everyone stays isolated \"doing their own thing\" in separate partitions of the map, trying to race to six stars before everyone else. This game is far less exciting than the one that has people constantly battling and vying for the most resource rich spots on the map. The issue is that I'm not sure the game itself does enough to incentivize interaction.",
    "timestamp": 1734822000
  },
  {
    "username": "Stingrayy",
    "rating": 2.0,
    "comment": "Theme and mechanics don’t really work together. Movement is highly limited, the tech development is very narrow. Once you understand the game, the weakest play at the table determines who has a chance for victory, so most rounds are no fun for most players. I rather stay home then join friends for another round of Scythe.",
    "timestamp": 1733526000
  },
  {
    "username": "burningspork",
    "rating": 2.0,
    "comment": "Not really an area control game, not really a Euro. Each time I've played, I've liked it a little less.",
    "timestamp": 1728252000
  },
  {
    "username": "alchemyocelot",
    "rating": 2.0,
    "comment": "Pretty, but the game feels awkward, unfocused and unintuitive. I'm not sure the game knew what it was trying to do.\nDidn't work for me.",
    "timestamp": 1724709600
  },
  {
    "username": "Boots01",
    "rating": 2.0,
    "comment": "I played this once a long time ago. I cannot believe somebody saw *that* art of *those* mechs and then made *this* game. The theme isn’t “pasted on”; the theme and the game literally have nothing to do with one another. Wrapping this game in that art is wasting a cool theme. This, rather than the not-terribly-interesting gameplay, is the reason I will never play Scythe again - it’s worse than false advertising, it’s almost a dog in the manger move on the art.\n\nSide note, Stegmaier games always leave me cold (apart from charterstone). They aren’t intricate enough as Euros to excite me with gameplay, and they never integrate the theme at all well. The fact they’re really derivative to boot makes me feel like I should just play whatever he was inspired by.",
    "timestamp": 1717106400
  },
  {
    "username": "Lamarsen",
    "rating": 2.0,
    "comment": "I was so bored the whole time playing it. I thought it might be that it was because I didn’t understand very well my first play through. Decided to give it another shot and it was worse that time. I was still super bored with it and I was extra annoyed that I gave it another shot. Avoid this game game at all cost, you’ll thank me for it.",
    "timestamp": 1714082400
  },
  {
    "username": "heishnod",
    "rating": 2.0,
    "comment": "First two turns have specific moves depending on your board and faction. If you don't memorize and do those moves you will lose in the first two turns.",
    "timestamp": 1712181600
  },
  {
    "username": "VaeVictis1918",
    "rating": 2.0,
    "comment": "Just no...really don't get what people love or like about this game. Yep, it can be ok, but that's at best.",
    "timestamp": 1708297200
  },
  {
    "username": "BrendansBoat",
    "rating": 2.0,
    "comment": "Settlers of Catan and Risk meet Lords of Waterdeep…on freaking steroids.\n\nMy in-depth review here on BGG:\nhttps://boardgamegeek.com/thread/3220094/back-90s-we-thought...",
    "timestamp": 1704495600
  },
  {
    "username": "backskin",
    "rating": 2.0,
    "comment": "after four plays I can deliberately say, that this game is a broken garbage, I don't recommend anyone to waste their time trying to play it, better find some Feld games or Eric Lang's ones. This does not worth of attention, don't repeat my mistake.",
    "timestamp": 1698966000
  },
  {
    "username": "neatbender",
    "rating": 2.0,
    "comment": "Pretty over produced, very easy game. It has a small puzzle how you start the game, thus it's very good for the 1st hours, then it just falls flat, there is no weight/meat in the game. I think 1 game is enought for my type of taste.\n\nI played Polania Industrial, its a challange to get of my 3 tiles, while others had a happy game like Rusviet Mechanical. Got out of his cage 10 turns earlier. Contributed my 1st game to the Stats of belovedpacifist.com",
    "timestamp": 1690408800
  },
  {
    "username": "wuschel83",
    "rating": 2.5,
    "comment": "Tthe campaign mode is fun, but very unbalanced.",
    "timestamp": 1684188000
  },
  {
    "username": "Mastergame82",
    "rating": 2.0,
    "comment": "this is a german game but it is boring: 2 hours and 30 minutes where I played without even being able to talk to others. It's a programming game only. At this point, if I want, I prefer to play chess where there is a strategy and it is much deeper than this.",
    "timestamp": 1679954400
  },
  {
    "username": "kraedy",
    "rating": 2.0,
    "comment": "Love the art, love the premise, hated playing it. One I'll never play again.",
    "timestamp": 1674342000
  },
  {
    "username": "OhBollox",
    "rating": 2.0,
    "comment": "Unbalanced, strictly regulated interaction.",
    "timestamp": 1662847200
  },
  {
    "username": "Hadi_N",
    "rating": 2.0,
    "comment": "I hate the game and SM's games",
    "timestamp": 1657749600
  },
  {
    "username": "Wisemove",
    "rating": 2.0,
    "comment": "I can't figure out the popularity of this game. A real yawnfest. Don't kid yourself thinking this is a wargame. It isn't.",
    "timestamp": 1657663200
  },
  {
    "username": "jeeooorrrrb",
    "rating": 2.0,
    "comment": "surprised people like this game so much. I will stick with viticulture.",
    "timestamp": 1657058400
  },
  {
    "username": "Daimler",
    "rating": 2.0,
    "comment": "LD. Beautiful design and components. Reviewers claimed that mechanics are well-balanced and game plays smoothly (actually not). The theme feels completely pasted on, the game is actually pretty abstract, like Terra Mystica.\nCollector's edition has much better bits.\nPlayed digital edition, it is as abstract as chess, but worse, because of so many unnatural and counter-intuitive rules and complete lack of balance (many OP combinations). Finally, there is no climax, the game feels like building up to something and then abruptly ends without any satisfaction. This \"game\" has no right to be in BGG top. ---",
    "timestamp": 1656367200
  },
  {
    "username": "Shelfside",
    "rating": 2.0,
    "comment": "Terrible balance, certain combinations of factions and action mats are completely broken. Rusviet and Crimea are exceptionally busted. Not a 4X, actually a euro, meaning that runaway players on broken combinations will always win the game because you can't meaningfully interact with them.",
    "timestamp": 1654034400
  },
  {
    "username": "alandric",
    "rating": 2.0,
    "comment": "Overrated game. Boring.",
    "timestamp": 1647817200
  },
  {
    "username": "ChadSolloway",
    "rating": 2.0,
    "comment": "In the end it was simple just an okay game that suffered from the issue I have with many Euros I.E. sudden ending that disadvantages to later players who are robed of a whole turn at the end of the game.",
    "timestamp": 1642201200
  },
  {
    "username": "maggico",
    "rating": 2.0,
    "comment": "For the value of the box, I was expecting better. Good components, bad rules. Everyone play his own game, without interaction for the players. It's a cell phone game moved on boardgame.\nReally boring.",
    "timestamp": 1634421600
  },
  {
    "username": "Bombadillo",
    "rating": 2.0,
    "comment": "Oh fanboy, please spare me your paean for the umpteenth marketing darling: no matter what wonders you keep spinning about it, Scythe still is just a dry euro wrapped in a shiny plating, and no character of its own.\n\nAnd I don’t care what you say about the mediocre components (just a handful of wooden bits and some 3d printed mechs) nor the illustrations either, that look nice at first but soon you can’t but notice they lack character, they’re all the same and suggest a kind of game Scythe is not, by far.\nDespite the illustrations, Scythe is not a wargame and combats only count for a minimal fraction of the game: they’re more of a requisite to meet once or twice than the core mechanism. You fight because you have to, in a very bureaucratic way: to match victory conditions and earn points, not to annihilate your opponents. No dice, no randomness, no suspense: where’s the thrill of a simulated combat and the joy of winning it out of mere luck when you can take everything of its outcome into account?\nYou can’t even divert too much attention from grinding resources into fighting since combat earns you nothing but is more likely to cost you something when you win. And that’s just laughable, comparable in its nonsense to the comical «join a fight just to lose it on purpose» mechanism in Blood Rage: pointless.\n\nThat is because Scythe is first and foremost an optimization engine, a cube pusher by the book.\nHence, unsurprisingly, it’s all about learning how to navigate your player board; and, equally unsurprisingly, managing said board is fiddly and requires constant thinking and planning, so you always have to settle for a mediocre action that doesn’t quench your thirst for resources.\nSo, while you’re deciding what to do next and where to move that «upgrade» cube, you don’t have any time to interact with the other players, you don’t even notice what they’re doing as you struggle with the actions you’d wish to take but cannot because you’re always short on options.\n\nAnd the theme you’re boasting about...it’s as thin as air in a cold winter morning: maybe enough for the typical control freaks that get excited for a game like this but lacking for everyone else who’s worth his weight in dice.\nTheme is more than just suggestive art pieces and a twinkly setting with no real effects on the game.\nTheme is a rich lore, appropriate special rules that come along once in a while, matching your actions with a feeling of what you’re pretending to do: theme means character, an identity of its own.\nIt’s more than just a cute illustration and three options on an encounter card, the most «thematic» thing in the game: theme would rather require a suitable title, a short introduction to the scene, some lore maybe, and different, unpredictable rewards that don’t all feel the same, with comparable gains and losses over each card, but vary appropriately and might even be worse than expected.\n\nNo, there’s nothing to salvage in Scythe: it’s the poster boy of a soulless game, and it even sucks at it.",
    "timestamp": 1630188000
  },
  {
    "username": "p4warrior",
    "rating": 2.0,
    "comment": "A thousand ways to score, not one of them interesting.",
    "timestamp": 1627768800
  },
  {
    "username": "dingo154",
    "rating": 2.0,
    "comment": "2 hours of my life wasted. Taught by a player who with held some rules then played with us... he won...go figure. Could play again knowing all the rules but it was a boring slogfest and I have no desire to torture myself again",
    "timestamp": 1623794400
  },
  {
    "username": "Slayerwaq",
    "rating": 2.0,
    "comment": "really strange war game",
    "timestamp": 1622671200
  },
  {
    "username": "FutureSpec",
    "rating": 2.0,
    "comment": "Thematic elements not for me",
    "timestamp": 1622325600
  },
  {
    "username": "copcopps",
    "rating": 2.0,
    "comment": "hahahahaha 3.36 weight? That's a load of crap. This overrated disappointment is so convoluted and full of minutiae that it might as well be a junky Euro version of ASL. I don't actually see this as a bad game per say but it's a 2 because I myself will never play it. Also good luck getting this game on the cheap as the expansions are the only way to actually play this good to most players.",
    "timestamp": 1618351200
  },
  {
    "username": "pingo95412",
    "rating": 2.0,
    "comment": "The mechs are just giant bus. The battle mechanism is silly.\nWell, in fact nothing has been done right in this game.\n\nExcept the art.",
    "timestamp": 1609628400
  },
  {
    "username": "Rakuso",
    "rating": 2.0,
    "comment": "piece of garbage",
    "timestamp": 1608937200
  },
  {
    "username": "xetrov00",
    "rating": 2.0,
    "comment": "Not much interaction between players. We found the game play to be boring and needlessly long and complicated. Each player just played in their own corner. The art is good but not enough to carry the game",
    "timestamp": 1605740400
  },
  {
    "username": "PKamahl",
    "rating": 2.0,
    "comment": "Unremarkable game (mechanically) where you follow a spreadsheet the first half, and things actually get started after 20-45 minutes (not including setup). Expansions seem to turn this resoundingly raspberry-inducing game into something mediocre but poorly balanced. The art is neat, the mechanics seem interesting at first glance before realizing it's the most safe, baby-proofed design I can imagine (make a chain of possible actions, except said chain is entirely self-contained and immutable), then let players pick 1 of 3 of them (technically 1 of 4, but you can't generally pick the same action two turns in a row),",
    "timestamp": 1589580000
  },
  {
    "username": "chrboesen",
    "rating": 2.0,
    "comment": "Well there is a map, so not totally multi-player solitaire. Takes to long and is a grind. Played 4 times.",
    "timestamp": 1583276400
  },
  {
    "username": "orange",
    "rating": 2.0,
    "comment": "Not a well developed game, the mechanism feels repetitive and clumsy, the gameplay feels like a solitaire, the little player interaction feels somewhat artificial. Another quibble is that the game ends instantly without giving each player the same amount of turns. Why people like and hype this so much is beyond me.",
    "timestamp": 1576710000
  },
  {
    "username": "xylax11",
    "rating": 2.0,
    "comment": "Beautiful game, but the game mechanics make all of your decisions feel pointless.",
    "timestamp": 1575932400
  },
  {
    "username": "sjelso",
    "rating": 2.0,
    "comment": "Maybe I do not \"get it\". Wanted to like but boring and winning is not satisfying or losing for that matter. Winning/losing seems anti-climatic and flat. When losing one wants to feel there was a real struggle; instead it is more like..\"oh, you just won by doing...x...or...x or x. Okay, that is interesting....anyway..\"\n\nGave the game away..",
    "timestamp": 1573340400
  },
  {
    "username": "panama66",
    "rating": 2.0,
    "comment": "Just not as good as the hype may suggest.\nUpdate: After a few more plays, it has become quite boring. Feels very redundant and dry. No one that I play with even mentions it anymore. Quickly collecting dust, inching towards the sale pile.\nUpdate: Sold.",
    "timestamp": 1571868000
  },
  {
    "username": "asobu",
    "rating": 2.0,
    "comment": "Low score due to average game, disconnect between the theme and actual game, and general poor attitude toward any perceived criticism by the game designer. Dull solo multiplayer, best summed up by a new player who said to me 'it felt like 4 individual games going on at the same time'. If you are a fan of spreadsheets as a leisure activity you might like this game.\n\n\"Low-to-no interaction efficiency puzzles driven by system mastery as a design goal leave me cold and disinterested. \"",
    "timestamp": 1567202400
  },
  {
    "username": "DonutTaganes",
    "rating": 2.0,
    "comment": "What a dissapointment! Awesome art and components but stale and uninteresting gameplay. Finding the optimal move on your little player board is not fun!",
    "timestamp": 1566252000
  },
  {
    "username": "mickeyjames",
    "rating": 2.0,
    "comment": "I hated this game! Ugh....",
    "timestamp": 1564437600
  },
  {
    "username": "cianapleyn",
    "rating": 2.0,
    "comment": "meh played it far too often does not rate another play",
    "timestamp": 1561932000
  },
  {
    "username": "Bob_Bigos",
    "rating": 2.0,
    "comment": "Pretty boring, the art isn't enough to save the gameplay. Overatted as fok",
    "timestamp": 1557698400
  },
  {
    "username": "Opie",
    "rating": 2.0,
    "comment": "Stonemeier Games is the Silversun Pickups of Boardgames: it’ll get you through the day but their output only reminds you of much better artists doing similar work. Viticulture, Wingspan, Charterstone, and this sad fake war game all come off as reskins of better WPs, engine builders, legacy games, and pseudo-war games. Sure, they’re purdy, but they’re empty calories. The actual mechanics of Scythe only guarantee a dull cold war and a plodding engine for your empire. You’re buying it for minis and art, and that is everything that is wrong with the current state of this fucking industry. Play better games. Support better companies.\n\nTL;DR - Scythe is not the Second Coming, and certainly not one of the Top 100 game of all time, let alone Top 10.",
    "timestamp": 1556834400
  },
  {
    "username": "buffmil",
    "rating": 2.0,
    "comment": "low replayability, have a feeling that you are playing the game on your own player board, some factions are clearly better than other, weird interaction between players",
    "timestamp": 1556661600
  },
  {
    "username": "TalentedMrRipley",
    "rating": 2.0,
    "comment": "Overhyped, slow and low replayability.",
    "timestamp": 1553209200
  },
  {
    "username": "Leech2999",
    "rating": 2.0,
    "comment": "Classic Stegmaier game; lots of 'win more', an overly convoluted scoring system and an anticlimactic end. Ameritrash at its finest if playing this kind of game is what you're into. And don't let it's 'engine building' fool you, it's only the illusion of choice here trying to masquerade as a more complex Euro type game. Tiny wooden pieces does not a Euro make. I don't think it's fun, players rarely interacted and it was like playing spreadsheet the board game.",
    "timestamp": 1548111600
  },
  {
    "username": "chrisgliddon",
    "rating": 2.0,
    "comment": "I can see why people love this game, but it’s not for me. It’s well-designed, gorgeous, and intricate. However, I’m completely over it and never want to play it again after the 4 times I’ve played it. It drags on, and I dislike how little luck is involved, and how other players can just stomp all over my little engine of growth. As an engine-building player, I like games where I can build up my own little economy, as I do with something like Terraforming Mars. I have strong negative feelings about this game - too many rules to keep track of, and too much area control/offensive strategy for me. As a more passive player, I hate how other players can ruin my little engine. I don’t dislike this as much as Mansions of Madness, and I can see how people enjoy it. But it’s not for me, and please don’t make me play it again!",
    "timestamp": 1547938800
  },
  {
    "username": "HighlanderPL",
    "rating": 2.0,
    "comment": "Overhyped crap. Second star only for paintings and funny mechs figures. Game mechanics is a complete mess. I expected something like \"another civilization game\" but it occurred to be another point salad (awards salad) with abstract and illogical mechanics. If someone expected to make mech-war and military expansions here will be very disappointed. I have no idea how this game could be rated in TOP10 games on BGG.",
    "timestamp": 1547852400
  },
  {
    "username": "garyvanhorn",
    "rating": 2.0,
    "comment": "My initial reaction to the game was very favorable, and I rated it a 9. The art is cool, the quality of the components is very good, and turns are fairly short.\n\nAfter a few more plays I have cooled on the game, hard. The game length is one huge factor, I just don't enjoy 3 hour games that much anymore, especially when you can be essentially locked out of the game for significant portions of it. Spending 45 minutes just waiting for the game to end because you can no longer have any meaningful impact is not fun at all. It will be some time before I have any desire to attempt this one again.",
    "timestamp": 1546988400
  },
  {
    "username": "M St",
    "rating": 2.0,
    "comment": "This is the game for kids who think that Pizza with Spaghetti and fries is the best meal ever. A convoluted concoction with ideas grabbed from success stories like Settlers, Dune, Eclipse, put into a big mess but no consideration for making the theme work with the systems. Historical wargame complexity without the justification, or the game of Azad without the reality to back it up. Differentiation of sides by which terrain type they can cross a river into? This is hilarious nonsense trying to create complexity out of lack of inspiration, reflected at every level, from the pseudo-East European theme stuffed with mechs and then leaders with monster animals as familiars to the incoherence of the victory concepts of the game (the Quick start card for new players helpfully points out \"find six things in which you can be good\" and \"learn the ten ways in which you can place stars\"). All of this is design style eating itself.",
    "timestamp": 1546729200
  },
  {
    "username": "Billnyhilist",
    "rating": 2.0,
    "comment": "I thought I would really like this game but it feels very solitaire-y to me; even despite combat and being able to pilfer resources. (neither of which are appealing if you're going to lose popularity) Some of the random event cards are way better than others too, I just never really felt satisfied at the end of a game. A shame as I really like the way the player boards and worker placement mechanics work in it, and the asymmetrical factions.",
    "timestamp": 1545174000
  },
  {
    "username": "Rebelscum86",
    "rating": 2.0,
    "comment": "Gave it 2 tries. Definitely not for me. Suggest playing before buying.",
    "timestamp": 1539468000
  },
  {
    "username": "alexdrazen",
    "rating": 2.0,
    "comment": "Got about 25% through the rules explanation, and even that much was agony. Too much glitz. It feels about as pleasant as jackhammer noises, if those were somehow a thing you felt in your eyes.",
    "timestamp": 1535407200
  },
  {
    "username": "Ephorus",
    "rating": 3.0,
    "comment": "What I dislike:\n- Close to no fights. Eurogame hidden behind a wargame presentation. Feels pretty solitaire.\n- Experience is key. For each faction, there is an optimal opening strategy that probably only slightly ever changes.\n- Slow and too long.",
    "timestamp": 1762038000
  },
  {
    "username": "Scifi66",
    "rating": 3.0,
    "comment": "It's 90% Euro efficiency. The mashup is not that compelling but if played quickly is ok.\n+Artwork and player boards are exceptional. I have seen multiple paths to victory (all combat with the Saxons, no mechs with the Blue faction, Red rush the Factory etc). After 7 plays finding it not as compelling.\n\nOct20 - played 5p game which took 90 minutes. At that length Scythe worked ok and was a pleasing experience.",
    "timestamp": 1761256800
  },
  {
    "username": "btasam",
    "rating": 3.0,
    "comment": "Recently played this with some newer players and it just further confirmed how much I despise this game. However, it is so unjustifiably beloved that I'm sure I'll play it again even if I try not to.\n\nThe initial piddling of doing things to upgrade so that you can do more things takes on a significant part of the game executed differently depending on experience. Lesser experienced players seem to be drawn by the groupthink of playing a big game. \"We're having fun right?\" \"We're doing things.\" A game with experienced players is filled with endless declarations of \"I'm taking my turn now!\" \"Okay, are you done?\" These desultory actions blend wonder and impatience beautifully often amplified or slowed by tempo disrupting event cards depending on group demeanor. Blowing away the player board chaff moves the game towards its finality. We're drowning in stars! The apropos tightening of tension in those final hours asks whether you value winning or ending. In a way, Scythe continues to play to its strength by allowing groups to make of it what they want.",
    "timestamp": 1757800800
  },
  {
    "username": "opda2056",
    "rating": 3.0,
    "comment": "The game is quite easy to solve from the first turn on, and very little changes game to game. It gets stale incredibly quick, and while a good puzzle once, maybe twice, it won't see many more plays where anyone is wowed",
    "timestamp": 1757800800
  },
  {
    "username": "X4_Commander",
    "rating": 3.0,
    "comment": "Too easy",
    "timestamp": 1756072800
  },
  {
    "username": "IsolatedPawn",
    "rating": 3.0,
    "comment": "I’ve played this 4 times, and just don’t enjoy the player interaction or the way the game unfolds. A lot of the complexity comes from things that feel arbitrary (i.e. river crossing rules that vary by faction), and pretty soon I stop caring about where people can move, or what passive bonuses people get when others perform certain actions. Most of the game seems to boil down to your player board and how many actions you can perform during the game, and this giant map, full of resources and minis, either takes a backseat, or feels convoluted in execution. As a result, for all the thematic and interactive potential in Scythe, cube rails games actually deliver more of each.",
    "timestamp": 1756072800
  },
  {
    "username": "oriad",
    "rating": 3.0,
    "comment": "First Played at 4. 2 times\n\nBoring interaction. just generating some resources like any eurogame.\n\nNovelty is just resource are in the board. but nobody cares that much.\n\nI feel this game is very scripted without much agency, always feel same",
    "timestamp": 1748210400
  },
  {
    "username": "johnnyboi1337",
    "rating": 3.0,
    "comment": "Theme & art are 10/10 but the gameplay can be quite frustrating. It's far too easy to misinterpret rules with small nuances that are easy to miss which has severely impacted my decisions even after playing the game at least a dozen times. Set up and tear down is super long and turns can take long because it's hard to plan ahead since things change. Without the modular board and expansions, veteran players essentially already know the first 5 turns for every faction which makes it more of a memorization game rather than a critical thinking game. Scythe has the early mover advantage as it was one of the first games of this scale that became somewhat mainstream. I see it almost like Monopoly. A really good try that appeals to the mainstream but there are just so many other games that does what Scythe does but better. This game is over hyped.",
    "timestamp": 1747605600
  },
  {
    "username": "Shortbeard",
    "rating": 3.0,
    "comment": "This game is the epitome of bait and switch. promises high interaction and area control but delivers solitaire with others. biggest disappointment of gaming by far. Played over a dozen times.",
    "timestamp": 1747346400
  },
  {
    "username": "Noboe",
    "rating": 3.0,
    "comment": "I do not understand the hype about this game.\n\nI agree that artwork is nice and thematic.\n\nApart from that, mechanically the game is only ok. There is not much interaction between players for the first half of the game, then interaction may break your slowly built engine.\n\nIt is hard to predict when the game is going to end, with new players wandering aimless around the map and being ganked via tunnels off guard for battle stars.\n\nDue to lack of significant differences in scoring between plays, the game is very repetitive and can be quite precisely counted in advance before even setting up the game.\n\nSome factions are clearly better than others, with better terrain placement and skills, the same applies for quests, especially when promo ones are included.\n\nAlso, the game was published as a base game lacking part of it (invaders from afar expansion), with place for missing components on the board. Other expansions give similar feeling, they add to the base game something that it is missing, like game setup variations. It looks like money grabbing before giving you what you should get at the beginning.",
    "timestamp": 1747087200
  },
  {
    "username": "SUNSH1N3",
    "rating": 3.0,
    "comment": "I thought this was a war game its not. it just needed a excuse to have minis",
    "timestamp": 1746828000
  },
  {
    "username": "Lagake",
    "rating": 3.0,
    "comment": "Great components and art, factions feel somewhat unique. Very much a resource management and worker placement game - combat is acceptable but not rewarded too much. A little over-hyped but still a good game.",
    "timestamp": 1746050400
  },
  {
    "username": "p00q",
    "rating": 3.0,
    "comment": "I had a feeling Stegmaier was going to be able to coast off of this win with his fan base for a while, and oh boy was I right.\n\nReflecting on the game, I don't think anyone would've liked Agricola if resources were as much of a chore as they are in this game. The lack of combat makes it feel a bit superfluous. Superfluous mechanics just make it feel like the game should've spent more time in development to iron that out.\n\nI feel like Hansa Teutonica did the upgrade board way better. And earlier. Maybe they should've copied that game a little more to make this one interesting. Learn what real player interaction looks like.",
    "timestamp": 1744668000
  },
  {
    "username": "allwaygo",
    "rating": 3.0,
    "comment": "You have to plan out your turns several turns in advance. It can be a very long game with higher player counts.",
    "timestamp": 1744322400
  },
  {
    "username": "Shinkenshi",
    "rating": 3.0,
    "comment": "The digital version is billed as a 4x Scythe is definitely not that game. I will play it physically with realigned expectations and update the score accordingly.",
    "timestamp": 1742338800
  },
  {
    "username": "prancingPWNy",
    "rating": 3.0,
    "comment": "Fails to excite.",
    "timestamp": 1741820400
  },
  {
    "username": "lexen",
    "rating": 3.0,
    "comment": "A very good looking game that has little replay value in a sense that the decision tree is rather small although it looks massive...",
    "timestamp": 1740870000
  },
  {
    "username": "mrmarbury",
    "rating": 3.0,
    "comment": "I don't know. I really want to love this game. The artwork is nice, the idea is great, and the rules are easy enough. But somehow I cannot get into this game. I played it alone and with some friends a couple of times. But while I loved this game at first I dislike it more and more with every time I play it. It is just way to deterministic and being the most efficient is the only thing the game has to offer. But in the end it is just always the same and imho it is boring and overrated. The expansions add no value, too. But just more clutter. They never made real sense to me. Neither solo nor in groups. Sadly though.",
    "timestamp": 1739574000
  },
  {
    "username": "psrx",
    "rating": 3.0,
    "comment": "Points for the artwork, but I find more excitement in taking a nice nap than slogging through something like this.",
    "timestamp": 1737586800
  },
  {
    "username": "Daniel44",
    "rating": 3.0,
    "comment": "Gets repetitive",
    "timestamp": 1737154800
  },
  {
    "username": "BoardGamingCouple",
    "rating": 3.0,
    "comment": "3/5\nScythe is well produced, has good artwork, and a regular theme for a dudes on a map game. This is definitely more of a 4x genre game that does work well. It plays quickly. It can be a bit expensive and there are clear balance issues. It is fun to play. 100+ plays.\n\n5/5\nSome of the expansion content is nice to have, but not mandatory. The expansion stuff that adds modular elements to Scythe is where this games shines! Modular Scythe becomes one of the greatest 4x genre games. The variety and replayability are awesome. The modular content addressed the balance issues of this game.\n\n5/5\nThe fan content for Scythe includes some new cards & some new factions. 2 of the official expansions were actually a fan creation & so was My Little Scythe. More factions are amazing to have. The game is quite limited at 9 in terms of replayability. Having 20-40 is a wonderful addition. There are 5 extra player mats as well which really bump things up.",
    "timestamp": 1737154800
  },
  {
    "username": "MichielTummers",
    "rating": 3.0,
    "comment": "It is okay. Im not a fan of Stonemaier games i guess. They all boil down to:\n1) four choices every turn, pick one\n2) Avoiding conflict like the plague (viticulture : you take my spot, well here is my Grande worker etc)\n3) balance is off the charts, as if there is no playtesting or computer testing being done\n4) some things are \"too random\"\n\nJust a matter of 'what where they thinking???'\n\nFor competent designed 4x style games without being a real real 4x check out eclipse",
    "timestamp": 1736118000
  },
  {
    "username": "Alexalex",
    "rating": 3.0,
    "comment": "Mucho tiempo de preparación y recogida. La mayoría del juego es un solitario, cada uno con su zona y recursos, optimizando el motor. Solo en las últimas rondas hay combate (una cuarta parte del juego).",
    "timestamp": 1735167600
  },
  {
    "username": "dtmoney75",
    "rating": 3.0,
    "comment": "1 Play\n\nPlayed at: 5",
    "timestamp": 1729548000
  },
  {
    "username": "Zaungast",
    "rating": 3.0,
    "comment": "Detached and arbitrary calculation task. Didn’t take me to whatever Dieselpunk 1920‘s Europe should be.",
    "timestamp": 1729288800
  },
  {
    "username": "Valcurdra",
    "rating": 3.0,
    "comment": "Decent economic game with some nice mechanisms, really like how resources are kept on the map and can be taken away by other players and the tableau management is reasonably engaging.\n\nGame is ruined by a lack of thought and effort in a few areas. The encounters are just art with 3 options very boring not to have some flavour text, miniatures are pretty bad, which may seem trivial but they are the centrepiece of the game so it does detract.\n\nBiggest issue is the absolutely terrible combat system, basically a resource bidding war where often the winner loses more than the loser or both players end up making themselves vulnerable to further attack, counter intuitive and annoying.",
    "timestamp": 1727215200
  },
  {
    "username": "whatsabandicoot",
    "rating": 3.0,
    "comment": "Appreciate the artwork and production aesthetics, however find it far too much of a multiplayer solitaire experience, at loggerheads with the setting and genre it was billed as (a 4X). This could all be hand-waved away if the gameplay was more engaging, unfortunately I find the efficiency puzzle too simplistic / predetermined by your faction and board, especially for the time it takes to play.\n\nRather than the game it presents itself as - one that wants to tell interesting or tense stories, create memorable moments, or have you exclaim as you puzzle over it - it feels instead like a game made by committee, designed to appease to the widest amount of the market as possible, creating as little friction as possible.\n\nScythe wears it's influences on its sleeves and, frankly, reminds me that I'd rather be playing any one of them instead.",
    "timestamp": 1726869600
  },
  {
    "username": "vnmez",
    "rating": 3.0,
    "comment": "Played digital. Thought it would be an area control battle game with table talk, but it's just solitaire euro. Theme doesn't match the gameplay.",
    "timestamp": 1723672800
  },
  {
    "username": "PastorDan_boardgames",
    "rating": 3.0,
    "comment": "Don't own, hate risk type games. This game is more of a resource game but still hated it.",
    "timestamp": 1723500000
  },
  {
    "username": "Arcum",
    "rating": 3.0,
    "comment": "Sold.",
    "timestamp": 1722290400
  },
  {
    "username": "Szymon_Archon",
    "rating": 3.0,
    "comment": "A very cool theme, but not much else in terms of substance. Constantly having to watch and check what each player does during their turn gets tiring very quickly.",
    "timestamp": 1721858400
  },
  {
    "username": "Lamzooo",
    "rating": 3.0,
    "comment": "Je n'ai pas aimé ma partie. Trop lent et déséquilibre au niveau des factions.",
    "timestamp": 1720044000
  },
  {
    "username": "smurfodeth",
    "rating": 3.0,
    "comment": "Navel gazing to the extreme. Lots of unnecessary elements bloating what is essentially an engine optimization game on your personal board, and that path to optimization is a slow slog through molasses. Also, I despise the blind bidding-style \"combat\". Yet another mediocre offering from Stonemaier games.",
    "timestamp": 1718920800
  },
  {
    "username": "galchri",
    "rating": 3.0,
    "comment": "Has an interesting theme but then totally ignores it. Interaction seems to be artificially and deliberately limited. It's possible, but tends to be more about building up your own corner and maybe trying to find a minor scuffle over nothing important at the end so you can get a bonus marker.",
    "timestamp": 1717884000
  },
  {
    "username": "sareneFactorial",
    "rating": 3.0,
    "comment": "nice little solo efficiency puzzle, although there is great tension for the interaction that won't happen. potential to be great but it deeply feels like it's missing something.",
    "timestamp": 1717538400
  },
  {
    "username": "KevinNoBacon",
    "rating": 3.0,
    "comment": "Game was way too slow and I wasnt a fan of a lot of the mechanics.",
    "timestamp": 1713650400
  },
  {
    "username": "Joashenisimo",
    "rating": 3.0,
    "comment": "I just don't get it. Do not got the brain for it. Beautiful art, theme and everything, but I just can't. Maybe it got too many options of what to do each turn that I can't stick to one strategy. I will never ask to play this game, but if there is nothing else to play I'm good.",
    "timestamp": 1712008800
  },
  {
    "username": "debre",
    "rating": 3.0,
    "comment": "Not a fan, Didn't understand the mechanics.",
    "timestamp": 1710630000
  },
  {
    "username": "dakotamassie",
    "rating": 3.0,
    "comment": "One of the most overrated games out there\nBtw Chris is wrong, green bananas are definitely the best",
    "timestamp": 1710630000
  },
  {
    "username": "Evanlynn",
    "rating": 3.0,
    "comment": "Tabletop",
    "timestamp": 1708038000
  },
  {
    "username": "LeBao",
    "rating": 3.0,
    "comment": "straight up hyped. This game is so unbalance that it's not fun.",
    "timestamp": 1707346800
  },
  {
    "username": "yeeeeprom_a",
    "rating": 3.0,
    "comment": "The artwork and setting is very good. But the gameplay just 'aint really good. At least in my opinion. The movement of units is pretty awkward.",
    "timestamp": 1704063600
  },
  {
    "username": "gamerdoge",
    "rating": 3.0,
    "comment": "I watched the deaigner interview. so much hype about this game. but finally got to try it, and sadly to say I am disappointed. first of all, you cannot feel the post-apocalyptic theme, it's steampunk at best. it is basically advanced Catan + simple Dune battle. Typical Euro, nothing more. some of the mechanics are pure mechanics, but no logic behind it. JASE Just another Soulless Euro.",
    "timestamp": 1703113200
  },
  {
    "username": "hiimjosh",
    "rating": 3.0,
    "comment": "My first game of Scythe was bitter, dull, and slow. I had realized I totally missed the rules about crossing rivers and freely crossed them. On a second play I found the game much better. The constrained options in the beginning of the game really help zip things along and make a big difference in pushing your faction towards what makes it unique which I enjoyed more than I thought I would. Despite others saying that combat is rare, I found that my faction was perfectly suited towards a combat-heavy strategy and quickly found myself completely ignoring any penalties for attacking because I was able to capitalize so much on the gains.\n\nScythe is essentially an engine-building game and kind of feels like a lighter, more streamlined version of Eclipse. It is less interesting than Eclipse in virtually every way but it is much, much faster and easy to teach as a result. While the core worker placement mechanism is, in my opinion, barely enough to keep you from falling asleep, the combat system and scoring both are pretty intriguing. Unfortunately combat isn't particularly weighty, so that really just leaves you with scoring, and thankfully the scoring is quite good. You can score in multiple dimensions and the values of each those dimension fluctuate from player-to-player based on track placement\n\nSo overall what do I think? Well... it's okay. The game is good, kind of boring and unexciting, but the pacing is brisk and it's easy to teach. I don't own any 4X style games in part because they are long and hard to teach, so this may be one I keep around for a bit. Although when I look on the shelf and see Le Havre, Troyes, and Brass - all games I find mechanically superior by a long shot - it's hard to look back and see a place for Scythe in my collection. I'll keep it for now and make another judgment later\n\nEDIT: Too solitaire for me. I enjoy the wrestle for victory conditions at the end and the race for map control though. The battle mechanics are good but could've been better",
    "timestamp": 1702335600
  },
  {
    "username": "Fawkes",
    "rating": 3.0,
    "comment": "I don't get it. Just the mechanism of selecting actions from a menu is terrible. Didn't anyone do any development on this? Overall bland and completely uninteresting.",
    "timestamp": 1702076400
  },
  {
    "username": "GChums",
    "rating": 3.0,
    "comment": "The end-game condition is awful. Makes the game inherently unfair to the other players, especially after 90-180 minutes of playing. But if you like \"race\" games to end-game and need a medium-heavy Euro, here ya go. I'll pass.",
    "timestamp": 1695160800
  },
  {
    "username": "Draw_Two_Logan",
    "rating": 3.0,
    "comment": "This game is the most underwhelming game ive played, even setting aside the fact I felt like the theme was just pasted on and a huge missed opportunity.\n\nRiverwalk is a tedious unfun mechanic that feels meant to simply inflate play time. Getting penalized so harshly for attacking is a terrible design choice that it makes attacking rarely a good idea. Having the larger military might isn't meaningful. The way to resolve combat feels like an afterthought (the actual power you get and the cards you draw feel like they make no meaningful impact on the game.) Turns are slow and you have little interest in what is going on in another players turn.\n\nThis game frustrates me a lot because it is almost a great game but it has so many issues that the game would have to change to make the game significantly better. I just don't think I'll ever understand the hype to this. After I've played a few games and did pretty well each game (2nd place each time in games of 4) I just dont see how this game is this hyped up.",
    "timestamp": 1685916000
  },
  {
    "username": "kmfdm",
    "rating": 3.0,
    "comment": "Finally realized Euros are not for me.",
    "timestamp": 1684101600
  },
  {
    "username": "duron600",
    "rating": 3.0,
    "comment": "The mechanics are tedious and the attempted theme is broken by mechanics that are too abstract.",
    "timestamp": 1683410400
  },
  {
    "username": "Don Smith",
    "rating": 3.0,
    "comment": "Probably a 6.5 but reduced to account for the fan boy ratings.",
    "timestamp": 1682373600
  },
  {
    "username": "John Rogers",
    "rating": 3.0,
    "comment": "Yet another procedural efficiency-engine-puzzle although this time there is (maybe) a bit more interaction (battles). If you dig tech trees, efficiency planning, the cold-war potential for fighting, and some cool bits to play it all with, then Scythe is for you. As for me, well I have no interest in it.",
    "timestamp": 1680386400
  },
  {
    "username": "LordTengil",
    "rating": 3.0,
    "comment": "I play a lot of 4x games. This one, I really don't like. Both build up and confrontation feels stale in comparison to other staple games.",
    "timestamp": 1680213600
  },
  {
    "username": "limesz",
    "rating": 3.0,
    "comment": "It is a vanity item for me. I'm not too fond of the mechanics, clunky, too-long, interaction is almost forbidden. To me, it's a boring worker placement game. Having said that, I love every piece of it as an item on the shelf.",
    "timestamp": 1679954400
  },
  {
    "username": "Valdezinator",
    "rating": 3.0,
    "comment": "sorry pal, its not good.",
    "timestamp": 1678834800
  },
  {
    "username": "Hector131",
    "rating": 3.0,
    "comment": "Great design and beautiful artwork. It just isn't my kind of game exactly. I can see why others love it though. It feels a bit too solo for me. Parallel play with sometimes little incentive to do anything against/with other players.",
    "timestamp": 1677625200
  },
  {
    "username": "Neutraali",
    "rating": 3.0,
    "comment": "An economic puzzle ruined by broken combat and RNG events.",
    "timestamp": 1675033200
  },
  {
    "username": "Haze1975",
    "rating": 3.0,
    "comment": "A couple of cool things about this game. Nice minis, interesting to upgrade your player board, and a cool theme.\n\nHowever….\nI’m usually not a fan of direct interaction, but this game kind of need it. To win fights, which is a way to earn two stars, you just want to find the weakest player and bash him twice, just too win fights. So weird.\n\nI strongly dislike the movment in this game. Your mechs are basically freight trains, and you have limited movement ”points”, so you can only move so much, but on the other hand you can warp through the tunnels across the board. And the whole idea that you can cross rivers only at certain points (unique to your faction btw) and in ONE DIRECTION is super gamey!\n\nAnd the fact you can’t take the same action two times in a row (except for one faction), is also super gamey!\n\nEvery time I have played Scythe, my face looked like I had just eaten a lemon. I just felt frustrated and annoyed!\n\nNever again!",
    "timestamp": 1674514800
  },
  {
    "username": "RichyWow",
    "rating": 3.0,
    "comment": "Art and theme are absolutely georgous but there are too many rules and no much interaction and fun to be had between players. Games tend to always play the same. I think this high rating is due to the fact that Scythe was one of the first kickstarter type boardgame and it was unique and different at the time. Nowadays there are much better euro-wargames.",
    "timestamp": 1674082800
  },
  {
    "username": "LaTigre",
    "rating": 3.0,
    "comment": "Very scipted and no fun",
    "timestamp": 1671318000
  },
  {
    "username": "sutrebuh",
    "rating": 4.0,
    "comment": "Checklist – the board game! What is Scythe? A tableau builder? Yes! An area control game? Yes! An engine builder? Yes! A war game? Yes! A 4-X game? Yes! A majority game? Yes! A bluffing game? Yes! An asymmetrical game? Yes! A racing game? Yes! Scythe is simply everything! Or at least it seems that way.\nIn fact, it is a checklist: you tick off the individual to-dos one by one. Your own tableau determines the order in which improvements are unlocked, and the associated advantages determine the order in which the victory conditions are to be tackled. So you tick off one item after another until the game is over. Somewhere in between, in order to fulfill this victory condition, you fight one or two battles with your competitors, which are decided by the luck of the cards. So far, so sober—but in a striking, expensive presentation.",
    "timestamp": 1760392800
  },
  {
    "username": "DanZDK",
    "rating": 4.0,
    "comment": "Played with Annie",
    "timestamp": 1760047200
  },
  {
    "username": "SpartanFry",
    "rating": 4.0,
    "comment": "You expect a game that let's you fight, control resources and more, but you get none of that. The upgrading of your boats and unlocking be abilities feels fun, but you get punished for being too slow in building up your engine. Combat feels awful and after a while most victory conditions feel incredibly tedious. Not something I would play again, unless my group would really push for it.",
    "timestamp": 1759528800
  },
  {
    "username": "logopolys",
    "rating": 4.0,
    "comment": "Scythe is definitely a well-designed game, although a bigger question would be if it was also fun. This is more ambiguous, I found. There are certainly fun parts, but the whole suffers from some critical drawbacks.\n\nFirst (and this has been said repeatedly before), there are too many disincentives for combat. One of the places that Scythe succeeds over a game like Terra Mystica is that there is more direct opportunities for interaction, down to actual displacement and victory points via stars. However, you are punished for even initiating combat due to the popularity penalty (unless you have the Polish Camaraderie ability), forcing you to rely on the threat of combat, which is generally disadvantageous to both parties involved.\n\nSecond, the speed of the turns feels off for what is supposedly a 4X efficiency game. The rounds go quickly enough, with very little downtime, but the turns themselves are actually too short, giving you too little to do with too small of a result. I would have been happier with slightly meatier turns in exchange with slightly longer downtime.\n\nFinally, the amount of interaction on the board, while direct, is almost arbitrary. Most of the game is played on your player mats, with the hex map and enlistment bonus technically providing interaction with only a few moments of actually engagement ever happening in the whole three hour game. Granted, these few moments are often highly important and exciting, but there's too little of it. Again, Scythe succeeds over Terra Mystica in this regard, but still fails compared to any number of 4X/efficiency games on the market.",
    "timestamp": 1759356000
  },
  {
    "username": "CoolBumpty",
    "rating": 4.0,
    "comment": "Gift",
    "timestamp": 1757023200
  },
  {
    "username": "TheGoddamnDuke",
    "rating": 4.0,
    "comment": "Game mix of mechanics... it does not work for me. Not good and disapointed by all the hype around it. It takes a mark under the average",
    "timestamp": 1756764000
  },
  {
    "username": "Mr More Dakka",
    "rating": 4.0,
    "comment": "Sorry Scythe, but Iron Harvest really went out of its way to utterly ruin your theme and cool factor.",
    "timestamp": 1755900000
  },
  {
    "username": "Rogue1483",
    "rating": 4.0,
    "comment": "Was left wanting more, seems ok but nothing special.",
    "timestamp": 1755554400
  },
  {
    "username": "FlorianFiedler",
    "rating": 4.0,
    "comment": "Theme: 10/10\nGame 4/10\nThe game is mostly a euro, but there are better ones. The theme promises much more of an area control, rogue, battle game, that it isn't. For a euro game its okay, for what it looks like its bad.",
    "timestamp": 1755554400
  },
  {
    "username": "Arnar146",
    "rating": 4.0,
    "comment": "Gulli",
    "timestamp": 1754517600
  },
  {
    "username": "anthientran",
    "rating": 4.0,
    "comment": "Strong theme and art style wasted on mediocre gameplay. There is little to no exploration of strategy. Players who learn one strong strategy to use will constantly rely on it to win. Also, it's war-themed but also not a war game. Combining economics and area control works okay, I guess. But ultimately that means players can be led to think that it can be resource management and get loads of coins to win. Or maybe they can explore and spread out to control those Encounter cards, which are amazing on their own terms. Until they find out that it's basically just produce-enlist-mech-combat every game to win, and now they're upset and sad because their Encounter cards are meaningless and their workers are displaced. Meanwhile, the other players now have 5 stars on the chart. The actions are basic: move a dude or two, build something, deploy a mech, enlist. But somehow, they don't feel consequential enough. There's little to no sense of growth in your building or moving around. Mech and character are great toys, but that's just a default for crowdfunded games now. They add little to gameplay, much less than the thin cardboard pieces of other games that keep me entertained for hours. Scythe is a shallow game with a great superficial theme. I want to like it more, but right now, I think I only like looking at it. Playing it fills me with dread.\n\n(Sold to Jared Smith UTD)",
    "timestamp": 1751580000
  },
  {
    "username": "Dirtnutmeg",
    "rating": 4.0,
    "comment": "A little to much math",
    "timestamp": 1751061600
  },
  {
    "username": "NavayaTCG",
    "rating": 4.0,
    "comment": "Awesome art, but it allows players to win in only a few different ways, not a combat game.",
    "timestamp": 1750024800
  },
  {
    "username": "Maxon2304",
    "rating": 4.0,
    "comment": "Overrated",
    "timestamp": 1749420000
  },
  {
    "username": "Soul_Turtle",
    "rating": 4.0,
    "comment": "A bit slow and plodding. Not super interesting.",
    "timestamp": 1748469600
  },
  {
    "username": "ciceroni",
    "rating": 4.0,
    "comment": "The wonderful production and artwork pulled me in although the gameplay boiled down to a simple min-maxing exercise with little to no interaction at all. The worst part was finding out about the controversions regarding the artist which made me sell the game afterwards.",
    "timestamp": 1748296800
  },
  {
    "username": "KnightsMercy",
    "rating": 4.0,
    "comment": "Dull, repetitive start opens up into wider but predictable play after escaping baby island. Can't say if better with expansions.\nWould rather play either a game more focused on the economy and engine building or a game with proper conflict.",
    "timestamp": 1746482400
  },
  {
    "username": "selvalabelva",
    "rating": 4.0,
    "comment": "Brainburn         Longevity    \nLuck impact       Rules/Setup  \nInteraction       Involvement  \n\nAftertaste           Enthusiasm   \n\n Best at 4+ players\n Rated base game w/o additional modules\n Confrontation: Multiplayer solitaire (mostly)\n\n Efficiency puzzle-like design\n\n Beautiful immersive artwork\n Exceptional production quality",
    "timestamp": 1742511600
  },
  {
    "username": "CMagex",
    "rating": 4.0,
    "comment": "Remove-great game, won't play enough\n\nCoins - Scythe if I buy them? otherwise, the Pirate/old world or Colosseum will have to do\n\n#49",
    "timestamp": 1742338800
  },
  {
    "username": "gonesse",
    "rating": 4.0,
    "comment": "The game is in great condition, the box got one corner slightly damaged.\nHappy to provide photos",
    "timestamp": 1742166000
  },
  {
    "username": "papergames",
    "rating": 4.0,
    "comment": "Beautiful illustrations, interesting theme, but boring game. Very little interaction, very little randomness, makes it a solitaire style game in our group. Whoever builds his engine best simply wins. You can often compute ALL your turns before your first turn and ignore everything else, as there's very little that can change your gameplan.\n\nTo be fair, there's a threat of being attacked, giving a cold war / arms race feeling, but more often than not, the attack won't happen, as even if you attack and win, other players will then gang up on you, so it's not worth it.",
    "timestamp": 1741474800
  },
  {
    "username": "joseph777",
    "rating": 4.0,
    "comment": "Feb 25 - Boring. Looks great and some nice ideas but once you've scored a victory point in a certain area you can't score more in that area so you move your focus to elsewhere. Eg. Combat - score a point move on. No point in engaging in combat anymore. Bor-ing.",
    "timestamp": 1740956400
  },
  {
    "username": "Beastly_Venturer",
    "rating": 4.0,
    "comment": "Overrated. Falls into that not so good - likely won't play again category.",
    "timestamp": 1740783600
  },
  {
    "username": "DonovanLoucks",
    "rating": 4.0,
    "comment": "A kitchen sink game with user interface issues. It's precisely what gamers today want... I played it twice – eight years apart – just to make sure I still disliked it.",
    "timestamp": 1740351600
  },
  {
    "username": "Elysian1196",
    "rating": 4.0,
    "comment": "The game that only gets worse the more you try to explore it. Scythe lives off of its first impression, and slowly falls apart the deeper you dive in. Scythe tries to do a bit of everything and ends up being mediocre if not poor in all of them.\n\nFirst this game tricks you into thinking it’s a hybrid area control game, when in fact the actual best strategy is a 90% solitaire efficiency puzzle. You only should be winning at most two fights and then stopping all aggression. I’m not a fan of non interactive games generally, but I am REALLY not a fan of how this game tricks you via art, minis, and even the box’s description.\n\nAnd even if you know it’s really just a euro going in, there are problems with balance among the player board combinations, the skill gap between new players and the experts leaving new players feeling like they didn't really do anything, and the typical winning strategy of dogmatically following one long-term plan from the start by looking at your starting setup without ever really tactically adapting it as the game goes on. Nothing your opponents do or really anything that happens in the game actually matters besides your starting boards and starting position. If you both want to win and understand the basics of the gameplay, there is no actual strategic exploration in this game at all. Your strategy each game is practically scripted from the start. The 4X label is complete bogus.\n\nAfter a few games, you'll quickly realize that each game is very plodding and samey with a lot of bloat that makes the game look both more complex and more sandboxy than it really is. Scythe's replayability is similarly incredibly superficial and in practice not really there. It just LOOKS like it has all of those things.\n\nI genuinely don't understand why this game is so popular beyond \"oooh pretty art with mechs!\" I'm guessing that most people rating this game very high either haven't played this game very many times, haven't played many modern board games, care about style over substance, or haven't played against someone really good at Scythe. The depth in this game feels so fake and shallow when there are so many better playing euros out there! SOOO Overrated",
    "timestamp": 1739919600
  },
  {
    "username": "Joey_A",
    "rating": 4.0,
    "comment": "It's got purdy dork-dollies and artwork. Outside of that, bland euro resource manager that borrows and dumbs down Dune's combat to poor effect. Player that gets the best X-box achievements in the end wins. Pretty unsatisfying, and that's sad...I love area control.",
    "timestamp": 1739746800
  },
  {
    "username": "SkyGlad",
    "rating": 4.0,
    "comment": "Too long, too incremental. I don’t like the stars system, which feels very point salad adjacent. I heartily dislike the hidden bid battle mechanism. If I want a game where I’m moving pieces from my player board to the main board, I would always rather play Gaia Project.",
    "timestamp": 1734908400
  },
  {
    "username": "CarsonChandler",
    "rating": 4.0,
    "comment": "Too complicated, and area control always stresses me out.",
    "timestamp": 1733180400
  },
  {
    "username": "Heriadoros",
    "rating": 4.0,
    "comment": "I will play this only in half year intervals. It is good, but not for me.",
    "timestamp": 1732921200
  },
  {
    "username": "ewaldhofman",
    "rating": 4.0,
    "comment": "We play it most of the time with only 2 people. It is much better with more people which makes the board more crowded and gives more options for strategic gameplay.",
    "timestamp": 1732921200
  },
  {
    "username": "JFed01",
    "rating": 4.0,
    "comment": "1-(4)-5p",
    "timestamp": 1731279600
  },
  {
    "username": "deeOgee",
    "rating": 4.0,
    "comment": "Can also include metal coin upgrade set.",
    "timestamp": 1730847600
  },
  {
    "username": "majinbober",
    "rating": 4.0,
    "comment": "Not my jam",
    "timestamp": 1729807200
  },
  {
    "username": "lordalatar",
    "rating": 4.0,
    "comment": "It's not a 4X game so I will rate it as an engine building game and as that I think that it's is not anything that I would buy and probably not play that much if given alternatives, mostly because the premature ending of the game.",
    "timestamp": 1729029600
  },
  {
    "username": "ggruetze",
    "rating": 4.0,
    "comment": "Played twice in person and a few times online. I highly dislike the riverwalk and the combat (or lack therof) Would prefer not to play again.",
    "timestamp": 1728511200
  },
  {
    "username": "mortoray",
    "rating": 4.0,
    "comment": "I found the flow was bad, with turns that can take too long.",
    "timestamp": 1724536800
  },
  {
    "username": "TecumsehTango",
    "rating": 4.0,
    "comment": "Art is nice, concept is interesting, but the mechanics aren’t anything to write home about.",
    "timestamp": 1723327200
  },
  {
    "username": "Natus",
    "rating": 4.0,
    "comment": "Love the actions but the on-map play makes ZERO sense to this strategy gamer and grognard.",
    "timestamp": 1721944800
  },
  {
    "username": "BGGHannah",
    "rating": 4.0,
    "comment": "This game is not for me, I dont like battle style games and the theme isnt for me. My group all loves it through so it is one I am willing to play if they want to!",
    "timestamp": 1718661600
  },
  {
    "username": "crambaza",
    "rating": 4.0,
    "comment": "1 play. Kinda meh",
    "timestamp": 1718316000
  },
  {
    "username": "Silver Avocado",
    "rating": 4.0,
    "comment": "Kickstarter-style high complexity Euro with puzzle elements, and massive individual player boards. Gorgeous artwork and an interesting theme that riffs whimsically on more traditional area control / war games. These days a good theme has almost become a red flag, and this game is one of the progenitors of that effect. If you like this kind of thing you will probably like it.",
    "timestamp": 1717884000
  },
  {
    "username": "tmoiynmwg",
    "rating": 4.0,
    "comment": "Picking complex action combinations felt like too much work for what this game offers.",
    "timestamp": 1716242400
  },
  {
    "username": "Hornauer",
    "rating": 4.0,
    "comment": "The low level of player interaction and the envisioned sameness of the order of action concerns me and it might get downgraded even further. Of course it could grow on me too^^.",
    "timestamp": 1712786400
  },
  {
    "username": "cherdan",
    "rating": 4.0,
    "comment": "Much like the mechs in the game, gameplay is clunky and boring.",
    "timestamp": 1712268000
  },
  {
    "username": "myyysha",
    "rating": 4.0,
    "comment": "A very decent dudes-on-map with some cool new twists and ideas, above all \"resources are always on map\" and players have to bring them along and guard them.\nThe beautiful illustrations and encounter cards do pretty good job in making people feel the world. I have yet to play more plays to prove what they say: \"the main thing isn't fights, but the powerplay and threat of fights\".\n\nBut I haven't... sold it.",
    "timestamp": 1710284400
  },
  {
    "username": "szurla",
    "rating": 4.0,
    "comment": "D1",
    "timestamp": 1709766000
  },
  {
    "username": "janglemangle",
    "rating": 4.0,
    "comment": "efficiency puzzle",
    "timestamp": 1709074800
  },
  {
    "username": "localghost8080",
    "rating": 4.0,
    "comment": "A worker placement euro disguised as a wargame.",
    "timestamp": 1707087600
  },
  {
    "username": "AstroWraith",
    "rating": 4.0,
    "comment": "I find it a very slow game. Requires a lot of turn management and planning to succeed. This is all well and good, but very little happens each turn, and one of another player's turns can wreck your last 10-15 turns, and make you need to completely change, sacrificing an additional 10-15 turns. At that point you have no chance of catching up. Overall, I see the appeal, but too slow for me.",
    "timestamp": 1703977200
  },
  {
    "username": "Leofric",
    "rating": 4.0,
    "comment": "I had very high expectations when playing this game, but it felt short for me on various fronts:\n\n-Short turns: the two actions one could undertake every turn are very short, and there is no room to expand them. With a board that demands multiple players, this can make the game drag on very long if someone needs to think.\n\n-Little content: The 8 actions the player could undertake have very little impact on the game, and the options DECREASE over time once you do all 4 action per secondary action. There is no epic grand spectacle in the late game the player could work towards.\n\n-Poor combat: There is quiet a bit of content to support combat, but its so heavily discouraged due to the loss of popularity one could gain from it. Popularity is a major key to victory, and the benefits from attacking players are limited in comparison.\n\n-Limited Art: The art (direction) is great, and a major reason for players (including myself) to purchase the game. However, most of the art is hidden on cards the player has little interaction with, so you can rarely enjoy it.\n\nOverall, the game does not have the eurogame in-game growth like a Wingspan or a Paladins of the Western kingdom, while at the same time lacking the dynamic combat (tricks) and balance of Inis. Just like Great Western Trail the gameplay lays an emphasis on turn efficiency rather than heavy engine building, but as previously mentioned, it strongly lacks interesting late game options that GWS thrives with.",
    "timestamp": 1700953200
  },
  {
    "username": "cfarrell",
    "rating": 4.0,
    "comment": "I’ve played a few times since writing the below, and my opinion is basically unchanged … it’s a standard Stegmaier, wildly overwrought, badly unbalanced, and more or less totally uninteresting. I’m always impressed he can do so little with so much.\n—-\nPlayed once, not super impressed. Very messy, scattershot, unfocussed design - tons of levers to pull, but in practice extremely constrained choices. An odd mix of an efficiency design with a point salad aesthetic - a ton of tracks and different ways to score points, but an economic development engine that forces you to specialize.\n\nThis style of unfocussed design really doesn't do a lot for me. I had just played 504 the previous night, world 468 (Military, Roads, Production). The general feel of the game is actually kind of similar - a sort-of wargame where the main activity is actually building up your infrastructure - but because 504 is such a focussed design, it routinely gives you interesting and important choices and it feels way more engaging. And to be clear, this game (468) was actually not good. Before this I've played at least a dozen different 504 games and they've all been interesting. This was the first one I've played that clearly had some issues, mainly just that it went *much* too long in the face of players flailing with the objectives (games with Military really want to be fairly short). But even so, to me it was much more consistently interesting than Scythe. I'd actually rather play most of the \"modern\", more interesting Risk variants (Star Wars, Star Trek, Halo) than Scythe. Now in fairness, Scythe is really not intended to be a wargame - it's really a development game with a combat system bolted on that seems to have been designed to be as uninteresting as possible. If the game had any sense it would have stuck to its development theme instead tacking on a half-assed combat system. But it still has a lot of the same feel as a king-of-the-hill wargame.\n\nHaving said all this, I think Scythe is decent for what it is. If you like Feld games and 4X games, you'll probably find something here to like; it works, it's not terrible. I just find this sort of kitchen-sink design unappealing.",
    "timestamp": 1700780400
  },
  {
    "username": "wanne",
    "rating": 4.0,
    "comment": "ausgeliehen",
    "timestamp": 1698012000
  },
  {
    "username": "Forestrian",
    "rating": 4.0,
    "comment": "Sorry if you're tired of hearing the truth but this game is not 4X. It's a multiplayer solitaire, solvable efficiency puzzle.",
    "timestamp": 1696802400
  },
  {
    "username": "Luds",
    "rating": 4.0,
    "comment": "Overproduced and overhyped Eurofest posing as more. It's basically a civ game with a bunch of Euro-like random game ending and game scoring conditions for the sake of it. The ending conditions and scoring feels very artificial.",
    "timestamp": 1696024800
  },
  {
    "username": "g4bor",
    "rating": 4.0,
    "comment": "Completely different from what it promises to be, and not very good at what it actually delivers either.",
    "timestamp": 1694037600
  },
  {
    "username": "Citery",
    "rating": 4.0,
    "comment": "I think I want to enjoy this more than I do. The hybrid euro-combat seems interesting, but combat often devolves into a simple search for two small, assured victories late in the game to secure your last few stars, rather than a device for interacting throughout the game. As it is, Scythe is just another efficiency euro with a halfhearted veneer of conflict.",
    "timestamp": 1693864800
  },
  {
    "username": "TacticalDragon",
    "rating": 4.0,
    "comment": "The game mechanics are interesting, but execution is clunky. The game feels artificial and fails to capture the essence of a \"4X game\"/Euro-Conflict. The battle resolution is disappointing, and the game sometimes plays itself by making obvious choices.",
    "timestamp": 1692568800
  },
  {
    "username": "StormBro",
    "rating": 4.0,
    "comment": "The game was so promising.\nBut after at least 10 hours of reading the manual, the videos, and the instructions, I still don't understand how to play it...",
    "timestamp": 1691445600
  },
  {
    "username": "Carlos Palomino",
    "rating": 4.0,
    "comment": "Strip away the somewhat overbaked clam and it's just an ordinary euro, and not all that interesting of one.",
    "timestamp": 1688335200
  },
  {
    "username": "Schkitz",
    "rating": 5.0,
    "comment": "Felt a bit like playing by yourself. I've played a couple times and it always is just kind of meh.",
    "timestamp": 1762038000
  },
  {
    "username": "Gilby",
    "rating": 4.5,
    "comment": "An impressive table presence and interesting engine building mechanics are undermined by glaring balance issues. You'll generally know if you have a chance of winning just by what faction/board you draw.",
    "timestamp": 1760047200
  },
  {
    "username": "thebard8",
    "rating": 5.0,
    "comment": "Too min max prone, AP prone. Not a fan of area control. Also played first time with someone who has played a bunch and they went full out playing against me, not fun…..still a decent game for what it tries to do and I won't fault someone for liking it. Likely won't play again.",
    "timestamp": 1758232800
  },
  {
    "username": "Sanderus_2008",
    "rating": 5.0,
    "comment": "Gorgeous art and intriguing theme meets dry, unpolished euro.",
    "timestamp": 1758060000
  },
  {
    "username": "de_spieler",
    "rating": 5.0,
    "comment": "Scythe just doesn't click for me. I guess it has to do with the part that it is a euro game - action economy optimizer that presents itself as an epic area control warfare with giant robots.\n\nIn my experience the game of Scythe goes like this - players sit in different corners of the map, slowly expanding and doing the \"euro stuff\" - collect resourses, spend resourses, optimise your production. Then suddenly someone (can be multiple players) bulds his critical mass, does their moderately explosive last turn - and the game is over. Over the course of this 3 hours game (epic warfare with robots, I remind you) you as a group had like 5 fights combined.\n\nDon't get me wrong — I get why people love Scythe. The actual \"euro\" part and setting are very interesting and engaging. It is just that disconnect between the impression that the game has and the actual gameplay I can't personally get over with.",
    "timestamp": 1757887200
  },
  {
    "username": "DaitanKoba",
    "rating": 5.0,
    "comment": "I really wonder who this game is for. The mechanics don't fit the theme that well. The engine building path is really rigid for the first couple of turns. Balance is really bad. 2 Factions are just straight up so much better. Replayablity is there but not in the sense of variety. Variety is so limited. Instead of doing that they should have balanced all factions with a single board. Only good thing this game has going for it is the art.",
    "timestamp": 1756850400
  },
  {
    "username": "PROJ",
    "rating": 5.0,
    "comment": "This was a great introductory game to medium euros when I first played it, but after a couple dozen plays as well as reading various strategy discussions and perusing match statistics, it's only reinforced my opinion of it as a game that doesn't quite work mechanically. Clearly the aesthetics and art are very appealing to many (myself included) which heavily influences its rating, the same way the theme of Terraforming Mars inflates that game's rating.\n\nThe balance of Scythe is fairly disappointing. There are now 2 faction/mat combos that are considered unambiguously overpowered that somehow were missed in playtesting. Additionally, from what statistics have been gathered, there are still clear tiers for other faction/mat combos. It should be obvious that certain mats synergize much more effectively with some factions than others, which is a major downside to not having a modular setup. Players could potentially bid for factions, but bidding should be a last resort for balance, as it needlessly front-loads decisions and suffers when score distributions are difficult to read due to outsized effects of hidden information and player decisions.\n\nThe balance of encounters ranges from mostly useless to incredibly useful, and the game does not put enough luck mitigation to sort out the difference. Perhaps most egregious are the objective cards that can be trivially simple to complete or require you to move the world. This is made worse by not having them adjusted for player count, which heavily affects their balance. Saxony's effectiveness varies wildly on the encounter cards they receive.\n\nI do really like the area control mechanic where workers are carried around and dropped off by the mechs. I love how you can cleverly use the workers as shields and punish overly aggressive players with popularity drops. I feel like a game could really make clever use out of those mechanics. Unfortunately, Scythe isn't that game. It's not necessarily a bad game (despite my overall negative tone), but it's the only hobby game I own that I have no interest in revisiting. I can't imagine ever wanting to play Scythe when I could play Gaia Project instead, for instance. Gaia Project is a master class of design in dealing with asymmetric faction balance and mixing economic elements with a spatial board. Scythe just doesn't cut it when stacked against other such euros.",
    "timestamp": 1756591200
  },
  {
    "username": "Killi",
    "rating": 5.0,
    "comment": "Overrated.\n\nOk. I get it, it raised the bar in terms of game aesthetics at the time. But I just don't get the hype, pretty much share this feeling with most Stonemeier Games. They are good looking but that's about it.\nI will copy one reddit comment that I saw a few years ago which is a good analogy of pretty much sums up what I feel about the game.\n\n*Scythe is like Fusion food, you take the most iconic part of each cuisine, merge them, and give it a beautiful presentation. It's great for people who like a sample of everything without being overwhelmed by a single feature. However, to people with a distinct taste, it will certainly feel bland because they can't get enough of whatever they're looking for.*",
    "timestamp": 1756504800
  },
  {
    "username": "sverige",
    "rating": 5.0,
    "comment": "Not my cup of tea.",
    "timestamp": 1756245600
  },
  {
    "username": "chickenwang",
    "rating": 5.0,
    "comment": "steam",
    "timestamp": 1755208800
  },
  {
    "username": "xbluejayx",
    "rating": 5.0,
    "comment": "Own digital ed. Good game. I’m just not very good at it.",
    "timestamp": 1755122400
  },
  {
    "username": "Shaolin88",
    "rating": 5.0,
    "comment": "drugo najveće razočaranje; definitivno nije moj tip igre",
    "timestamp": 1753912800
  },
  {
    "username": "infeneris",
    "rating": 5.0,
    "comment": "Only played once so far. Felt scripted at the start and slow to do anything. I probably need to play again. Something about the win condition bugs me but I can't figure out why.",
    "timestamp": 1753653600
  },
  {
    "username": "DaSnow",
    "rating": 5.0,
    "comment": "I don't like how there are optimized openings to this game. I don't like how fighting is objectively bad. It's really hard to want to play this game with people that have several games under their belt.\n\nYou have to play with the same group of newcomers to the game and keep it that way. As soon as one person starts to learn it's meta, the game is sullied.\n\nThis game should be enjoyed and explored simultaneously by the same group.",
    "timestamp": 1752703200
  },
  {
    "username": "Capitolcpt",
    "rating": 5.0,
    "comment": "Nice little game.",
    "timestamp": 1751666400
  },
  {
    "username": "CotB",
    "rating": 5.0,
    "comment": "Rankings\n46th Best Game 2018\n44th Best Game 2019\n67th Best Game 2020",
    "timestamp": 1750888800
  },
  {
    "username": "crafty_nicky",
    "rating": 5.0,
    "comment": "Cool setting, too little player interaction.",
    "timestamp": 1750284000
  },
  {
    "username": "bobyams",
    "rating": 5.0,
    "comment": "Once I played ‘My Little Scythe’ I sold this immediately. It’s too long and boring.",
    "timestamp": 1749592800
  },
  {
    "username": "rwinder",
    "rating": 5.4,
    "comment": "Game is probably better than I am at playing it.",
    "timestamp": 1749420000
  },
  {
    "username": "RexSemperAugustus",
    "rating": 5.0,
    "comment": "Steam",
    "timestamp": 1748556000
  },
  {
    "username": "aht0010",
    "rating": 5.0,
    "comment": "Not my favorite",
    "timestamp": 1747692000
  },
  {
    "username": "Spada_",
    "rating": 5.0,
    "comment": "14+. Strategy.",
    "timestamp": 1747605600
  },
  {
    "username": "matrium0",
    "rating": 5.0,
    "comment": "Not my cup of tea. It's all too deterministic and basically you draw your player board and can (with expensive) already know if you win or not.\n\nIt's an interesting game and we are playing through the campaign - that keeps it fresh and makes this fun, but I don't think I want to play Scythe again after that. I would play it if others bring it on the table, but never bring it myself",
    "timestamp": 1746136800
  },
  {
    "username": "runnaman",
    "rating": 5.0,
    "comment": "4/18 - I've played two solo games so far and have a pretty good feel for how the game plays. I'll update when I've played more than solo. [8]\n\n5/3 - Played it with 3p and can see that there are so many decisions to make each turn. I really look forward to playing this more. [8]",
    "timestamp": 1745445600
  },
  {
    "username": "Sinizar",
    "rating": 5.0,
    "comment": "Played it a couple of times. Nothing new or innovative. I love the artwork but that is all.",
    "timestamp": 1745186400
  },
  {
    "username": "kentangarab",
    "rating": 5.0,
    "comment": "The sudden trigger of endgame that can make some player having less # of turns in game than others contradicts the game design in which the players control towards the overall game state is limited due to not so interactive design. This is more of an efficiency puzzle game. Just imagine if you are playing your usual solitaire eurogame but your opponent has 1 more turn than you. It does not seem fair no? This can happen in this game.\n\nAlso nowadays i prefer tactical games. This game is very strategic instead.",
    "timestamp": 1745186400
  },
  {
    "username": "Plargyplop",
    "rating": 5.0,
    "comment": "SM Games are not for me. I've never played anything of theirs that I've enjoyed, and Scythe is no exception.",
    "timestamp": 1744236000
  },
  {
    "username": "purplecow55",
    "rating": 5.0,
    "comment": "An action based game where players are trying to complete at least 76 objectives to end the game. Players with the most points win the game.",
    "timestamp": 1743717600
  },
  {
    "username": "tbrofromspace",
    "rating": 5.0,
    "comment": "Reviewed",
    "timestamp": 1743631200
  },
  {
    "username": "Fundle",
    "rating": 5.0,
    "comment": "where is the spark of this game?",
    "timestamp": 1742943600
  },
  {
    "username": "Bal_505",
    "rating": 5.0,
    "comment": "fast-paced turns and interesting enough overall. However, movement feels so slow and there is less interaction/conflict than I would like. Everyone mostly fiddles with their board and resources",
    "timestamp": 1741820400
  },
  {
    "username": "mawilson4",
    "rating": 5.0,
    "comment": "A game that is, at once, both showered in praise and a not inconsiderable amount of criticism, my reactions to Scythe are mixed. I've cooled to it in subsequent years as I've refined my tastes a bit more. Where it may fail to do any one thing exceedingly well, it does quite a few things passably well. The whole, then, is potentially satisfying experience for omni-gamers without strong genre preferences, but may disappoint those looking for a more complete Euro-style game or a more complete combative area control game. Scythe does a bit of both, but a lot of neither.\n\nThe game is also wrapped in lovely artwork and components. It's \"overproduced\" in every meaningful sense, but seems to stay focused on evoking the game's setting rather than trying to wow us merely with the spectacle of the components.\n\nI personally want more chaos and contention in my games these days, as well as more streamlined rules, fewer upkeep steps and micro-actions at every step. I acknowledge that Scythe is filling an area control niche for many who don't need or want more combative elements in such profound quantities. But it's ultimately too heads-down for me. And too long for the experience it delivers, with too much rules overhead. The game is played optimizing your action economy and upgrades on your players board. Too much focus spent there, too little on the shared central board and other players.\n\nReview:\nhttps://bumblingthroughdungeons.com/scythe-review/",
    "timestamp": 1740956400
  },
  {
    "username": "ultimoratio",
    "rating": 5.0,
    "comment": "UPDATE SEPT 2022: \n\n4 stars to 2 stars. Here's why: High player count is the best way to play in order to muddy up the decisions tree by mid- to late-game, yet the pace is so boring at high player count even if everyone play at a nice pace.\n\nI had some thoughts about this and reconfirmed this conclusion: it's a medium weight game with light weight decisions. This is annoying as your turn-by-turn decisions are so small and so incremental that you can plan 2 or 3 turn aways on what you want to do, yet you are still waiting for your turn. Decisions need to be big enough to warrant this.\n\nMy advice: just play the app. Having 4 - 6 AI players playing at lightning speed will spoil you forever. The app was a big factor on reducing the score.\n\nThis is a shame because I thought Scythe still is an exception to the usual trash that the publisher releases. My thoughts from July 2022 are still valid. It has long longevity, especially when expansions are added. But I think I am now on the tail end of this game. hence the 2 star. All that is left is to master every faction + board combo, and I'm not sure if I'm interested.\n\n=================\n\nUPDATE JULY 2022:\n\nIncreased from 3 to 4 stars. The game has very long longevity, despite the scripted early game. The expansions also put more life into it which increases the number of plays before I get tired of it. The strategic \"look ahead\" in this game is just very good.\n\nEasily one of the best optimisation Euro. But you need the expansions.\n\n==================\n\nUPDATE Dec 2020:\n\nStill great. I think this is one of the better optimisation Euros out in the market. The frontload decision-making on Turn 1 is excellent.\n\nProblems persists and the solitaire game is just too much drag, if played with newbies. Strategic openness wasn't as open as I wanted it to be, as the game is dictated by your faction + player board combo. Which means that there's little room for growth unless expansions allow wider strategy choices to compete against experienced opponents.\n\nThe static map is still okay, but I'm now hoping that the modular boards would increase the replayability and strategic openness.\n\n=======================\n\nUPDATE Aug 2020:\n\nPlayed it with the mindset that it's a light Euro game and it works well. The game is about optimising your every action (and secondary action) and each action should be about building up either your future actions or VPs/popularity. No space to waste time or opportunity.\n\nI can see why I didnt liked it back then. It's a shit 4x/area control game, if you approach it as a 4x/area control game. But it works well as a light Euro.\n\nStill has the same inherent problems as before. Scripted early games with the static map and the same river crossing ability. Combat is inherently kingmaking, especially on an optimisation Euro that can rewards 2/3's of your game based on combat. But, again, the game is solely rested on its engine building core and it works fine.\n\nThe player boards are ultimately restricted that it doesnt give the same wide selection of strategy like other deep mid weight Euros like Concordia or even Nusfjord. Ergo, the game lacks legs in the long run. But thats for the future. For now, Im giving it a good rating of 7/10.\n\n========\n\nA game that has good ideas, however, it all feels mediocre when executed. Opening moves are so scripted, as starting points and the map are the same every game and how the river-crossing mechanic works. The different board means that the variance is in the engine building.\n\nEngine building is mediocre and combat is subpar. Negotiations and trading are almost non-existent.",
    "timestamp": 1740524400
  },
  {
    "username": "arildoaim",
    "rating": 5.0,
    "comment": "2024 update after more plays 4 -> 6\n\nAlright game. But you need to set expectations right. Dont expect a 4x, beacause its not. Its an euro with anticlimatic point salad scoring at the end. If its a strenght/weakness depends on your expectations. I find europlayers wishing the enginebuilding was even stronger.\n\nThe artwork is though wonderful, but sadly optimal strategy is scripted, and takes most of the fun out of it if you are aware of it.",
    "timestamp": 1740351600
  },
  {
    "username": "RikHavok",
    "rating": 5.0,
    "comment": "2/25\n\nFully painted and Sleeved cards",
    "timestamp": 1740351600
  },
  {
    "username": "macrsson",
    "rating": 5.0,
    "comment": "Nice game mechanism and flow.\n\nBut there is a big issue about balancing. You don’t notice it in the first couple of games, but once the players have more experience it will develop into almost unplayable. Some factions can compete about the victory (Rusviet, Crimea), others will always finish in the bottom half. Adding Togawa und Albion even enlarges this problem.\nYou can semi-fix it by mandatory or forbidden combinations of factions and mats, but on the other hand this is not the idea of the game.",
    "timestamp": 1740265200
  },
  {
    "username": "Boroslegion",
    "rating": 5.0,
    "comment": "A rather gray game with no ups or downs. Everbody plays his own little game, no real hard punishments. Played it with a group of four",
    "timestamp": 1740092400
  },
  {
    "username": "KvdBergh",
    "rating": 5.0,
    "comment": "++ Fantastic production\n++ Turns are interesting\n+ Factions and player boards make each player different\n+ Combines several elements from other great games\n\n- Plays a bit long for my tastes\n- Limited amount of different strategies possible\n- Map can be a bit unclear and cluttered",
    "timestamp": 1739487600
  },
  {
    "username": "CalebMenge",
    "rating": 5.0,
    "comment": "First i loved it but after 5 or 6 games lost my interest completely. It's boring and meaningless.",
    "timestamp": 1739401200
  },
  {
    "username": "TFang",
    "rating": 5.0,
    "comment": "Digital game via Steam, wouldn't want a physical copy.",
    "timestamp": 1736722800
  },
  {
    "username": "chibiowl",
    "rating": 5.0,
    "comment": "Overall ☆★★★\n\nFun ☆\n- Played once and liked it, but need more plays.\nInteractive ★\n- Direct combat though it is more of a cold war where it happens rarely, but must still be aware of others to deter would-be attackers.\n- King of the hill for factory.\nReplayable ★\n- Variable factions and player boards, combinations.\n- Expansions for added content and modules.\nUnique ★\n-\nBonus (✦)",
    "timestamp": 1736636400
  },
  {
    "username": "tristandevanthery",
    "rating": 5.0,
    "comment": "Bof",
    "timestamp": 1736463600
  },
  {
    "username": "Nonys",
    "rating": 5.0,
    "comment": "Souboje nemaji impact. Je to dost o zvolenem narodu.",
    "timestamp": 1736204400
  },
  {
    "username": "fps_pyz",
    "rating": 5.0,
    "comment": "Sleeved",
    "timestamp": 1735426800
  },
  {
    "username": "CasaDeAgua",
    "rating": 5.0,
    "comment": "I understand the appeal of the game, however I find it to be very slow for what it is (maybe a problem with my playgroup) and as I don't own the game I often feel like I'm wandering aimlessly and then - suddenly - games over. Just as I'm getting to grips with it.\n\nI love solving puzzles but the often plodding nature of this game makes me not at all motived to figuring it out away from the table.\n\nI've played several times and have not once really enjoyed my time with it.",
    "timestamp": 1735254000
  },
  {
    "username": "CasaDilla",
    "rating": 5.0,
    "comment": "I understand the appeal of the game, however I find it to be very slow for what it is (maybe a problem with my playgroup) and as I don't own the game I often feel like I'm wandering aimlessly and then - suddenly - games over. Just as I'm getting to grips with it.\n\nI love solving puzzles but the often plodding nature of this game makes me not at all motived to figuring it out away from the table.\n\nI've played several times and have not once really enjoyed my time with it.",
    "timestamp": 1735167600
  },
  {
    "username": "Thomashenne",
    "rating": 5.0,
    "comment": "Beautiful but boring",
    "timestamp": 1734390000
  },
  {
    "username": "sloehand",
    "rating": 5.0,
    "comment": "Best of Summer 2016. The reviews deeming it to the bastard child of Terra Mystica and Kemet are spot on. What other 5 player conflict / engine builder / area control game can clock in at 2.5 hrs and leave everyone with a smile on their face?",
    "timestamp": 1734217200
  },
  {
    "username": "Mittens1776",
    "rating": 5.0,
    "comment": "I've owned Scythe for a while, and have played it for even longer. However, the shine to this game greatly wore off over multiple plays. It lacks the level of interactivity I would've preferred from the game's theme, with the game punishing aggression overly. As an engine builder, it feels unsatisfying, with your choices feeling mostly predetermined by your faction/board combination. The lack of randomisation combined with the simplicity of the game leads to a lack of replayability.",
    "timestamp": 1733353200
  },
  {
    "username": "ubRtstcl",
    "rating": 5.0,
    "comment": "Not a fan of the conflict, but still a decent puzzle game. Although I find it a bit long for the puzzle it provides. The theme feels a bit awkward to me, I can't seem to fully grasp the concept.",
    "timestamp": 1733180400
  },
  {
    "username": "skipaoff",
    "rating": 5.0,
    "comment": "Не рыба не мясо.\nОгромная карта, крутые фигурки и оформление но по факту все сводится к евро билду планшета. Причем планшет может выпасть иногда вообще не в тему к вашей старт локации, а иногда супер сильно бустить.\n\nМеханика что войну делать нельзя иначе другие нафармят звезды на вас - не работает. Всегда приходится биться и потом кто-то фармит фри звезды.\n\nКороче арт и фигурки топ, механики слабые.\n\n+ просто конченая желтая расса крымчан",
    "timestamp": 1732748400
  },
  {
    "username": "Sethenstien",
    "rating": 5.0,
    "comment": "A bit too much direct conflict for an engine builder kind of game like this. I enjoyed it but really just wanted to make a safe little space. The game really wants you to attack others at least a bit.",
    "timestamp": 1732230000
  },
  {
    "username": "airjudden",
    "rating": 5.0,
    "comment": "I played the game mostly for the social experience. It was my first game, so of course, I didn't win, nor should I.\n\nIt is hard to connect with thematically: 1920s with mech units and combining farming and war, but not really war and some factions can move fast and cross a river and another can hyperspace. It's all quite odd, accented with cool plastic mech pieces and wooden meeples. Huh?\n\nIf theme is not important to you, it's the type of game where you optimize moves by pulling on a lot of levers to score points. That is quite popular on BGG.\n\nHere's how I sum it up: if you say, \"Let's get a group together next week for a game of Scythe.\" No thanks. But if you say, \"We're getting together for some games next week.\" Sure. Then someone says, \"We need another player for Scythe\" and there's not an epic wargame or Ameritrash game on another table, sure, why not? I'll see if I can do better than last time.",
    "timestamp": 1730502000
  },
  {
    "username": "SherpaDurka",
    "rating": 5.0,
    "comment": "Typical SM game: looks good but don't expect balance or depth.",
    "timestamp": 1729202400
  },
  {
    "username": "Paccachu",
    "rating": 5.0,
    "comment": "1-7",
    "timestamp": 1729029600
  },
  {
    "username": "LoonySkild",
    "rating": 5.0,
    "comment": "Pure optimization mechanism, little interaction between players... Definitely not my game.",
    "timestamp": 1728424800
  },
  {
    "username": "majicalways",
    "rating": 5.0,
    "comment": "I felt restricted throughout the game. To have success, each faction needs to follow a specific sequence of moves to expand and win. I imagine the more one plays to \"solve\" the puzzle of each faction, the rewarding. That's not for me. I prefer to enjoy the game in my first play feeling like my options for success are dynamic.",
    "timestamp": 1728165600
  },
  {
    "username": "vikingcode",
    "rating": 5.0,
    "comment": "It's *fine*, but other than a lovely presentation, it's only just fine",
    "timestamp": 1728079200
  },
  {
    "username": "HankCzinaski",
    "rating": 5.0,
    "comment": "Euro game at heart. This is not a wargame. Looks great and has cool minis, but the whole conflict side is just a gimmick. Besides that, there are better games in it's genre anyway.\n\nWeight 3.4? It's 3.0 at most.",
    "timestamp": 1727906400
  },
  {
    "username": "alexdesouza",
    "rating": 5.0,
    "comment": "An area control style of game with a very puzzle-y action selection mechanic. Combat is brief and calculating. Certain combinations of player factions and action selection mats are clearly more powerful than others however. This requires players to all have the same relative amount of experience with the game to be its most enjoyable, lest experienced players can exploit those differences and completely steam roll newer players. The map layout is also fixed, and depending on chosen factions, can advantage players over each other.\n\nAs the setup and opening can be quite static, this game does not benefit from repeated plays, as players quickly settle into fixed strategies, resulting in tired replayability.",
    "timestamp": 1726696800
  },
  {
    "username": "honk3d",
    "rating": 5.0,
    "comment": "+3 np M",
    "timestamp": 1726610400
  },
  {
    "username": "gidorah",
    "rating": 5.0,
    "comment": "05.2022\n\nScythe was the first game I backed on KS. Looking at the box, the art, the little mechs – how could I restrain myself?! I was so eager to play – I got it out whenever I had the chance and taught it to anyone I could convince to play.\n\nAnd, yet, I kept finding myself thinking abrupt-ending after abrupt-ending – is that it? Once, I asked a friend who won, “So, at the end, you just put as many of your workers on hexes as possible?” “Yep!” That didn’t sit right with me but I continued to play and found the game to be more efficiency puzzle than clever strategizing.\n\nSure, I like the pace of the game – there’s rarely down time except if a battle takes place and even these are pretty exciting. But the actions that move things along so quickly are rarely interesting beyond perhaps the way a mech threatens a choke point.\n\nScythe is a great looking game that is a huge winner for Euro fans who like to convert resources into other resources, but I find it dull, all bluster and no substance.",
    "timestamp": 1725660000
  },
  {
    "username": "adi_venturer",
    "rating": 5.0,
    "comment": "A game that people seem to really like but I'm not a fan of. It's a Euro pretending to look like a war/area control game. The fancy mechs don't really have much functionality. The theme felt very painted on. People rave about it a lot in my gaming circles though, so maybe I'll give it another shot at some point.\n\n(Plays: 1)",
    "timestamp": 1724450400
  },
  {
    "username": "jacobjustice2309",
    "rating": 5.0,
    "comment": "Invaders from Afar, Board Expansion, Metal Coins, Realistic Resources.",
    "timestamp": 1724364000
  },
  {
    "username": "JackKray",
    "rating": 5.0,
    "comment": "Boring!",
    "timestamp": 1723327200
  },
  {
    "username": "DavidStockton",
    "rating": 5.0,
    "comment": "The game looks incredible and has great table presentation, the art is simply incredible and the theme is great. However the gameplay is a slog and feels pulled into too many directions, the movement feels weird and overall the experience feels disjointed. For me the box art told a story that didn't match up with the mechanics and made for a disappointing experience.",
    "timestamp": 1722895200
  },
  {
    "username": "Nikomakhos",
    "rating": 5.0,
    "comment": "- A bit of a mess of a little bit of everything but not much anything.\n- I really dislike all the teleporting and individual movement abilities. Makes the map almost irrelevant - at least really cumbersome to track where everybody can move and attack.\n- Thematically I like that the farmers usually go about living their life despite the war roaming around.\n-For some reason the third story in the encounter cards is often just cringey bad storytelling.\n- Play Eclipse instead.",
    "timestamp": 1722895200
  },
  {
    "username": "kiwipaul",
    "rating": 5.0,
    "comment": "OK, just OK",
    "timestamp": 1722463200
  },
  {
    "username": "Iron_Salamander",
    "rating": 5.0,
    "comment": "Played this roughly half a dozen times over the years, with the first play as part of the original Kickstarters arriving and a local friend had backed it (I had originally backed it, but canceled as I had other games to back at the same time, and something had to give). We just played it again this Saturday, so felt it was time to update this review.\n\nIt's not a bad game, but it never feels very exciting. We had a total of one combat in a 4 player game, with me coming in 2nd place and just kind of doing my own thing. I normally love combat in games, even in games like this where it's secondary instead of the focus, but I was able to get 4 stars (was close to 2 others at the end), and have enough coins to secure 2nd.\n\nNone of it is outright awful, but the sum is just a fairly simple game with a few different ways to get stars and use them and your popularity to get points, and none of it grabs you or makes you want to play again. The game lacks tension, and that keeps it at an average experience for me.",
    "timestamp": 1722204000
  },
  {
    "username": "murph0499",
    "rating": 5.0,
    "comment": "Want to go back as this was my first real 'game'. I would love to reassess after being in the hobby for a while now.\n\n\nEdit: Tis good fun.\n\nEDIT AGAIN: quite dry. Multiplayer solitaire essentially, with strategy not changing much on repeated plays. Interaction with others is low and doesn't occur all that often. Just build your engine and try to do it better than anyone else --- not our type of game.",
    "timestamp": 1720908000
  },
  {
    "username": "Sagittarius_A",
    "rating": 5.0,
    "comment": "Komme mit Worker placement Spiele leider nicht so klar. Mir gefallen die einfach nicht so. Generell bin Ich kein Fan von den Mechaniken des Spieles (es gibt auch Ausnahmen die Mir in Worker Placement gefallen).",
    "timestamp": 1714687200
  },
  {
    "username": "metapone",
    "rating": 5.0,
    "comment": "Played 1 2-player game. Just not for me. Everything looks gorgeous though.",
    "timestamp": 1713564000
  },
  {
    "username": "brownsound",
    "rating": 4.8,
    "comment": "Przereklamowany. Piękne wykonanie ale... taka piaskownica. Wolę rozłożyć dużo mniejsze Century: Cuda wschodu w miejsce Scythe'a.\n\nObie gry sprzedane.",
    "timestamp": 1712959200
  },
  {
    "username": "Desigual",
    "rating": 5.0,
    "comment": "best with 4",
    "timestamp": 1712872800
  },
  {
    "username": "simopurgz",
    "rating": 5.0,
    "comment": "Great looking game let down by the gameplay. VERY slow slog at the start which can lead to an abrupt end when the game starts to get interesting",
    "timestamp": 1712354400
  },
  {
    "username": "M2Cat",
    "rating": 5.0,
    "comment": "I don't get all the hype about this game.",
    "timestamp": 1707001200
  },
  {
    "username": "Kbjordan",
    "rating": 5.0,
    "comment": "Fine game, but not my style. No desire to play again.",
    "timestamp": 1706655600
  },
  {
    "username": "joseverdin10",
    "rating": 5.0,
    "comment": "I did not like how little player interaction there was.",
    "timestamp": 1706482800
  },
  {
    "username": "pleroph",
    "rating": 5.0,
    "comment": "This is a beautiful game. But the beauty of the art compensates for the fact that it's really not very good. There are so many little gotcha rules that are unintuitive, that unless you play this all the time, you'll spend 45 minutes refreshing the rules. Forget teaching someone new.\n\nAfter you manage to get all the rules down, the game is basically just a simple engine builder with no interaction.\n\nAlso, the theme, while beautiful, is just pasted on, like all stonemaier games. The actions you do barely map to any thematic story. It's got the amount of theme coherence that something like terra mystica has, without having a great game underneath.",
    "timestamp": 1706137200
  },
  {
    "username": "amusedleg",
    "rating": 5.0,
    "comment": "A perfectly fine dry Euro. If only it didnt have that cover. When your box has a mech and a bear with a rifle, it should not reward people for turtling the entire game.",
    "timestamp": 1705791600
  },
  {
    "username": "favabear",
    "rating": 5.0,
    "comment": "Initial impression: Everything is points, so it all blends together without much excitement. Efficiency seems to trump any other concern, and it feels like a standoff for most of the game.",
    "timestamp": 1704582000
  },
  {
    "username": "resonance2k",
    "rating": 5.0,
    "comment": "It is cumbersome and uninteresting. i dont want to think about this game.",
    "timestamp": 1704409200
  },
  {
    "username": "Snake86",
    "rating": 5.0,
    "comment": "Easy to understand, but understanding how to win is a bat iharder. Easy to do mistakes during play",
    "timestamp": 1704409200
  },
  {
    "username": "infinitepeaks",
    "rating": 5.0,
    "comment": "My entry into modern Kickstarter era gaming (though I didn't back it). Loved it on the first few plays, but over time I found it to be too solitary and without enough \"big\" decisions. In trying to fuse a wargame with an engine builder, it failed to deliver what makes both those genres special. Out there, I bet there's a game that will look at Scythe as inspiration, and fuse these two genres in a more exciting way.",
    "timestamp": 1704236400
  },
  {
    "username": "Omertron",
    "rating": 5.0,
    "comment": "It should be a nice 4x game, but I can't seem to find it in me to like this version of it. It seems that you can get a better start if you have a good combination of the two boards and your starting location. This is proven by the \"banned\" combinations. Another example of poor design by Stonemeier.",
    "timestamp": 1704236400
  },
  {
    "username": "Gehirnprothese",
    "rating": 5.0,
    "comment": "This is no area control game with lower player counts. You just fight without agenda aside from scoring the objective.",
    "timestamp": 1701126000
  },
  {
    "username": "Arnaud3013",
    "rating": 5.0,
    "comment": "Fun with 4 players. With only two players, not fun at all, lot of blocking other player, which we hate.",
    "timestamp": 1699743600
  },
  {
    "username": "JukkaMikael",
    "rating": 5.0,
    "comment": "After 4 plays across couple of years I am ready to admit this game just does not work with me. Not a single fun moment in all those plays and I think this is due to lack of interaction and the private puzzle centered around your player board just not feeling satisfying at all. Last game I had no clue what one of the players was doing in his own corner of the map, then the game ended and he had massive points and won. Congrats, I said, meeting him for the first time in 1,5 hours.- Then we unpacked all the nice looking stuff from our respective corners of the nice looking board and closed the nice looking box. Good bye Scythe.",
    "timestamp": 1698530400
  },
  {
    "username": "JPSFOX",
    "rating": 5.0,
    "comment": "I own the digital version on Steam. I've played a few games and I'm kind of lukewarm on it. The \"engine building\" elements are pretty fun but the attacking elements of the game are not something I enjoy. There are \"tear down the leader\" elements to this and I don't enjoy that in games. This feels pretty similar to Lords of Waterdeep for me.",
    "timestamp": 1698012000
  },
  {
    "username": "MegaHamster",
    "rating": 5.0,
    "comment": "There are much better dudes on a map games. There are much better engine builder games.",
    "timestamp": 1698012000
  },
  {
    "username": "Hegiel",
    "rating": 5.0,
    "comment": "Not my type of game, unfortunately playing this game is just a chore to me.",
    "timestamp": 1697666400
  },
  {
    "username": "Thorwolf",
    "rating": 5.0,
    "comment": "Area control and simultaneous action selection are not favorite mechanisms of mine, and the amount of strategic thinking before play starts means that the learning curve is pretty steep.",
    "timestamp": 1696888800
  },
  {
    "username": "The Pirates",
    "rating": 5.0,
    "comment": "Once you and the others know the game, it is so easy to settle into and just play. But the game lacks range and the play is pretty much the same from one game to another. I think the thing to focus on is the learning and improving, and enjoy that before it levels off.",
    "timestamp": 1696716000
  },
  {
    "username": "brendonp",
    "rating": 5.0,
    "comment": "I really liked the art/theme, asymmetric abilities, and resource management on the board. Felt like a Jack of all trades, master of none kind of game, and didn't grab me. I don't quite understand the massive success, but hey, if it means Jamey can continue doing what he loves, then awesome. Not going to hate on that.",
    "timestamp": 1696197600
  },
  {
    "username": "bounderyan",
    "rating": 5.0,
    "comment": "I thought I would like it but it’s not for me.",
    "timestamp": 1696111200
  },
  {
    "username": "JSMA",
    "rating": 5.0,
    "comment": "Haben wir sehr viel mit unseren Kindern gespielt\nRot gewinnt Blau verliert",
    "timestamp": 1695938400
  },
  {
    "username": "domus_ludorum",
    "rating": 5.0,
    "comment": "Not as good as it, or it's fans, like to think it is. At heart it's another heads down optimisation puzzle. On-board conflict is so watered down in it's impact that the 'shiny' mechs are largely window dressing to help sell the game by the bucket-load on Kickstarter, to the kind of gamers who normally mock plastic minis but have secretly wanted to have those kind of toys in their games all along. The Leaders are perhaps even more guilty of this.\n\nA £30 game in a £100 wrapping.",
    "timestamp": 1695765600
  },
  {
    "username": "rick3623",
    "rating": 5.0,
    "comment": "Complete abstract game contrived to thematically look like so much more. Long and laborious affair.",
    "timestamp": 1695247200
  },
  {
    "username": "simon1990",
    "rating": 5.0,
    "comment": "Vendu au Bazar 2023",
    "timestamp": 1694556000
  },
  {
    "username": "ILoseAtLife",
    "rating": 5.0,
    "comment": "Beautiful production value, but not much else. The combat system is not good. Once a player gets into conflict and exhausts resources in the fight, they will be in a weakened state and get ganged up on by the other players. Overall, a mediocre game and definitely not worthy of all the hype.",
    "timestamp": 1694037600
  },
  {
    "username": "adel9591",
    "rating": 5.0,
    "comment": "Just so excruciatingly boring. Well designed but boring. You're basically doing 4 things over and over again and 2 of them are essentially the same. Movement is so constrained but so important. Starting with certain player boards in certain areas basically screws you right from the beginning. The theme is nice, production quality excellent, and art amazing which makes it a 5. I tried really hard to like this game but every time I played I was frustrated and bored, never feeling able to do what I wanted to do.",
    "timestamp": 1693778400
  },
  {
    "username": "IOIXIOI",
    "rating": 4.5,
    "comment": "Les illustrations et le matériel sont magnifiques.\nLe jeu en revanche est horrible.\n\nLe gameplay est beaucoup trop scripté.\nLa chronologie des actions sera toujours la même, peu importe le semblant d’asymétrie que l'auteur essaye de nous faire croire au travers des différentes factions ou plateaux d'actions uniques.\nPour être dans la course, vous êtes contraint de faire d'abord des cartes rencontres qui sont surpuissantes, puis ensuite vous devez libérer des cylindres de votre plateau joueur (ces cylindres s'appellent des recrues, je crois... triste tentative de donner un thème à ce bout de bois). Les avantages octroyé par ces cylindres dépendent des actions de nos voisins : autrement dit, vos voisins vont vous faire gagner de très nombreux bonus, sans que vous ne fassiez aucun choix. Où est l'intérêt ludique ? On parle ici d'une quantité de points de renommé qui peuvent très nettement vous faire gagner la partie... Comment un jeu de gestion moderne peut reposer sur le fait que vos voisins vont faire votre victoire tout le long de la partie, sans qu'ils n'aient le choix de faire autrement. C'est l'invention du kingmaking, non pas sur une seule action, mais sur toute une partie !\n\n\nLa résolution des combats est nulle. Simplement nulle.\nLa preuve par les faits : un joueur à refusé de dépenser des points de combat parce qu'il se savait perdant d'avance. Alors l'autre joueur engagé dans le conflit a décidé de n'en dépenser aucun non plus... Résultat : la balance sur la piste militaire n'a pas bougé d'un iota, le gagnant n'a donc dépensé aucune ressource pour gagner ce conflit et accomplir un objectif déterminant pour la fin de partie. Même un jeu avec des règles aussi faibles que celles de Risk mets des ressources militaires en péril quand il y a un conflit à résoudre. C'est le minimum pour qu'un jeu devienne intéressant.\nLà, c'est le néant.\n\nJ'ajouterai que les améliorations durant lesquels vous déplacez un malheureux cube d'une ligne vers une autre ont quelque chose d'insipide.\n\nLa gestion des ressources de base est très répétitive. Par ailleurs le jeu est contradictoire sur un point : il vous incite à regrouper vos ouvriers sur la carte pour produire efficacement en cours de partie, mais en fin de partie, il vous incite à étaler vos ouvriers sur la carte pour marquer un maximum de points. On pourrait croire que c'est ingénieux. Pour moi, c'est une grossière erreur de conception.",
    "timestamp": 1692568800
  },
  {
    "username": "Northy1",
    "rating": 5.0,
    "comment": "Played the base game 3 times and always felt that the game ended before it really got going.",
    "timestamp": 1690927200
  },
  {
    "username": "Shadenium",
    "rating": 5.0,
    "comment": "3 pathetic fights throughout whole game of 4 hours that were 10 power vs 1 power.",
    "timestamp": 1690063200
  },
  {
    "username": "B4lalaika90",
    "rating": 5.0,
    "comment": "The game is well designed, but for me there is a big BUT. In my opinion this game completely betrayed the theme that propose and for me was impossible to feel a concrete game experience, it's a good euro game but nothing impressive like the illustrations suggested.",
    "timestamp": 1688940000
  },
  {
    "username": "HackFin",
    "rating": 5.0,
    "comment": "Played with 3 which was terrible - after some years played with 6 and 7 which was certainly better, but it still seems bloated as it basically is a rather simple resource converter + race game with some randomness added through cards. Would recommend playing with the air ship thingies which should have been part of the base game.",
    "timestamp": 1687039200
  },
  {
    "username": "SpiderBobby",
    "rating": 5.0,
    "comment": "A beautiful game that I want to love but sadly find competent but incredibly boring. I'd love to understand what others get from it because I just don't enjoy it at all.",
    "timestamp": 1686348000
  },
  {
    "username": "Stylemys",
    "rating": 5.0,
    "comment": "This was a bit of an odd duck for me. I found it to be impressively clean and elegant, but not particularly fun or engaging. Not for me I guess.",
    "timestamp": 1685743200
  },
  {
    "username": "CashewOfChaos",
    "rating": 5.0,
    "comment": "I get that this game is well-liked and has good reviews, but I thought it was meh for a couple of reasons.\n\nFirst off, the backstory and art--nations engaged in active warfare with one another using huge mechs--screams mech wargame... but this game is kind of a hybrid between a war game and a resource management game with a focus on the latter. The theme is confused in my opinion.\n\nThe second point ties into the first in that it tries to do two things ending up in a bland mix of both. Resource management fiends won't be happy because their shrewd usage of turns can be disrupted and does not necessarily reward them as much as it should.\n\nLikewise, warfare can only yield you two stars unless you play a specific faction and your victories matter little in the end because victory conditions are measured in control, gold, and other things which then get put together as money... the faction with the most money winds in the end. Here's my counterargument, though. Would it really matter if one country has a great economy when the other nation could steamroll them by the end? Sure, they could use their great wealth to enable their warmachine, but--so far--that is not what they have. Meanwhile, the other player has spent their time and resources already building up their capacity for war. In a wargame, they could take on the other player who is ill prepared to fight.\n\nLike I said, I am confused as to what this game is trying to do. I feel like it would be better if the characters and tokens you move aren't gruff-looking alt-history soldiers and mechs meant for war, but instead space ships colonizing planets to see whose empire thrives. The gameplay seems much more reflective of such a scenario, anyway.",
    "timestamp": 1685656800
  },
  {
    "username": "Deji24",
    "rating": 5.0,
    "comment": "I see the appeal, just not my cup of tea!",
    "timestamp": 1684965600
  },
  {
    "username": "Cyrlle",
    "rating": 5.0,
    "comment": "PC",
    "timestamp": 1684620000
  },
  {
    "username": "edubvidal",
    "rating": 5.0,
    "comment": "Largo y repetitivo. Es cierto que tus acciones van definiendo tu estrategia sobre el tablero, pero se hace demasiado largo, incluso a dos jugadores.",
    "timestamp": 1684015200
  },
  {
    "username": "CharlieMnemonic",
    "rating": 5.0,
    "comment": "I like the player board, the way you choose actions, and the way you upgrade abilities. The gameplay in general didn't grab me.",
    "timestamp": 1682719200
  },
  {
    "username": "MotherMary",
    "rating": 5.0,
    "comment": "Gameplay is a 5. I dont care if you overpaid for unnecessary miniatures. The gameplay stands.",
    "timestamp": 1682460000
  },
  {
    "username": "SeraFlint",
    "rating": 5.0,
    "comment": "Ugh. Reminds me of 'Dune: Imperium' which I also dislike.\nSoulless strategy game. Produce, build, avoid combat until endgame. Weird WWII/SciFi hybrid style-wise.\nHad some cool miniatures, the rest was wooden meeples, quite odd.\nTried it 4 times because of raving reviews, but it bored me every single time.",
    "timestamp": 1681596000
  },
  {
    "username": "dukane",
    "rating": 5.0,
    "comment": "The complaints of player boards strongly steering you towards a strategy are pretty accurate, but for me that doesn't bother me. Not all games have to be sandboxes. This is mostly a euro with just a hint of battle. The game does nothing new and exciting, but it recycles other ideas and throws a lot together in a relatively quick and concise package.\n\nId say its a great entry to longer 4X, Action Selection or Engine Building games. Games range from roughly 60 minutes to 150 minutes depending on count and experience. Expect play time to be drastically reduced with experienced players.\n\nUpdate: haven't played this game in years, haven't had the urge to bring it to game night, tried an expansion to see if that would renew some interest....nope.\n\nMight be trade fodder.",
    "timestamp": 1681509600
  },
  {
    "username": "jkrenner",
    "rating": 5.0,
    "comment": "it has some interesting mechanics, but it's a strange blend. Beautiful, but a sloooow start and then opens up more. Unforgiving in a way and not very transparent.",
    "timestamp": 1679526000
  },
  {
    "username": "Clutchpedal",
    "rating": 5.0,
    "comment": "its good. its fine. the world design and such is great and while the game is well-designed and such, it ultimately just? doesnt excite me for some reason.",
    "timestamp": 1678921200
  },
  {
    "username": "414448",
    "rating": 6.0,
    "comment": "One play. Three players. Very involving and seemingly LOTS to explore.\n\nDoesn't hurt that the game looks gorgeous and the map extension makes it wonderfully huge, and that the rules are rather simple and there's a great flow to the gameplay with short turns. It starts out simple and grows gradually more complex as the turns go by.\n\nEdit: Rating started shrinking soon, and I got rid of it. What initially seemed so intriguing turned out to be fluff on top of a all too dry game. Just like Wingspan, this game does not stand up to repeated plays.",
    "timestamp": 1762599300
  },
  {
    "username": "divibyzero",
    "rating": 6.0,
    "comment": "The art by Jakub Rozalski is awesome but the gameplay looks a bit boring with each faction having strategy already defined by design.",
    "timestamp": 1762598040
  },
  {
    "username": "Tobi_S",
    "rating": 6.0,
    "comment": "Own digital edition",
    "timestamp": 1762124400
  },
  {
    "username": "StefanieB",
    "rating": 6.0,
    "comment": "Keller",
    "timestamp": 1761429600
  },
  {
    "username": "BlarghMiez",
    "rating": 6.0,
    "comment": "Chris",
    "timestamp": 1761256800
  },
  {
    "username": "rubiks777",
    "rating": 6.0,
    "comment": "This games feels like a lot of missed opportunity. There's nothing particularly exciting about the game that gets me amped to play. Player interaction is minimal but it's still there in negative and what feels like predetermined ways - battling is mostly a negative experience for both parties and it's pretty predictable what a battle outcome will be beforehand.\n\nSimilar to other Stegmaier games, there's a big reliance on card draws, in secret objectives, but few ways to get more cards so you can synergize to your faction or play style. It's a fine worker placement and happy to play occasionally but it's not going to be top of list to suggest.",
    "timestamp": 1760824800
  },
  {
    "username": "shmonkey",
    "rating": 6.0,
    "comment": "First impression: Not sure how i feel about this one yet. It has a lot of great mechanics, but didnt necessarily feel satisfying to play. Need more time to make a call on this one.\n\nAfter a second play, i can appreciate the design, but the cold war maneuvering and lack of interesting things to do ultimately fell flat for me. It feels like trying to solve your tableau and jump around the map. Resources are plentiful enough that you can conservatively turtle.\n\nAfter a couple more tries, Theres some more subtle push and pull. This is never going to be a favorite of mine, but Im open to playing when someone wants to.",
    "timestamp": 1759874400
  },
  {
    "username": "vyntoo",
    "rating": 6.0,
    "comment": "I need more plays before having an opinion.\nIt'll likely bump down for me.",
    "timestamp": 1759615200
  },
  {
    "username": "selwyth",
    "rating": 6.0,
    "comment": "At the most cynical level, this is really taking turns to perform one of 4 possible arbitrary actions that do 4 things, with the arbitrary actions varying for each player. But the race to be first to complete 6 of 10 objectives provides some refreshing soul, and I do like the setting and artwork. The low-luck engine-building aspect with randomness coming only from a triangle dig associated with combat and exploration makes this a lighter cousin of Eclipse for me. Also, nice place to do blind bidding for combat outside of Dune.\n\n4+3",
    "timestamp": 1759528800
  },
  {
    "username": "Jasonlin778",
    "rating": 6.0,
    "comment": "來源：財神",
    "timestamp": 1759356000
  },
  {
    "username": "Avid_Equinox",
    "rating": 6.0,
    "comment": "Interesting ideas for the game, but not one I feel like I need to revisit:\n\n+ Simple to teach for the weight of the game\n+ Interesting, tight action efficiency puzzle\n- Runaway leader/obvious who is in contention and who isn't\n- A high skill floor to play: understanding which actions are stronger than others, need to know which Stars are noob-bait and which are worth pursuing (Stonemaier game balancing)\n- Experienced players have a huge advantage that can't be mitigated in-game (no alliances, no politics, no trading).\n- I dislike the movement progression in the game: you're restricted to your own island at the start until you can move off which is a little boring - and then having tunnels means you can instantly be almost anywhere on the board",
    "timestamp": 1759183200
  },
  {
    "username": "zarpator",
    "rating": 6.0,
    "comment": "too much solitaire for my taste, too much looking on your own player board",
    "timestamp": 1759010400
  },
  {
    "username": "Ironclad_Board_Gamer",
    "rating": 6.0,
    "comment": "Collection",
    "timestamp": 1759010400
  },
  {
    "username": "Alaena",
    "rating": 6.0,
    "comment": "I've only played on steam. It's an interesting game, but it requires the player to really know the game. I don't want to commit my life to that. It's also very long. It's also kind of soul-less. And I wanted more from the mechs. More violence and fighting.",
    "timestamp": 1758232800
  },
  {
    "username": "Iraperkins82",
    "rating": 5.8,
    "comment": "8/10: Really great game, almost always keeping. I may not suggest it all the time, but will never turn down a game.\n\nPlayed this out. One of my first board games ever.",
    "timestamp": 1758060000
  },
  {
    "username": "HughCross",
    "rating": 6.0,
    "comment": "BGA, steam",
    "timestamp": 1757282400
  },
  {
    "username": "mingrkli",
    "rating": 6.0,
    "comment": "You like giant mechs? You like gritty alternate history worlds where farming fields and waging war go hand in hand? You like carving out your faction’s destiny in the icy lands of 1920s Europa, all while eyeing the secrets of a mysterious Factory? Here is Scythe! A 1–5 player engine-building strategy game where you lead one of five unique factions, each with their own starting resources, location, and secret goal.\n\nHow do you win? By earning the most wealth and glory through expansion, combat, popularity, and progress before your rivals can. You’ll harvest resources, recruit villagers, build structures, and unleash hulking mechs to secure territory and intimidate your opponents. But here’s the twist there’s no player elimination, so you’ll always be in the fight, even if someone else rolls up with war machines at your doorstep. Gameplay runs smooth and fast thanks to Scythe’s action-selection system no waiting around for long rounds or phases. Every turn feels like momentum: upgrading your abilities to become more efficient, building your engine to snowball power, and choosing how your faction grows. Do you focus on military dominance? Economic might? Political popularity? Or a balanced mix that keeps everyone guessing? Encounters with the people of Europa give you choices help them, exploit them, or something in between shaping your path forward and adding just enough unpredictability to keep every game fresh. Combat isn’t luck-driven either; it’s all about outthinking your opponent and managing your resources wisely.\n\nIn the end, Scythe is about building something that feels like yours: an evolving faction engine, growing stronger every turn, racing against rival nations. Will your empire rise from the ashes of war to dominate Europa… or will your people be crushed beneath the treads of someone else’s mechs?",
    "timestamp": 1757109600
  },
  {
    "username": "Mintyfreshtaste",
    "rating": 6.0,
    "comment": "It's probably illogical, but I feel a bit weird playing a game that I know has, in theory, a lot of solvable problems. The fact that there is an objective best way to handle most things, and the fact that you could calculate it with just a little bit of effort, can make it extremely frustrating. Still, I think it takes a good few plays to squeeze all the juice out of it and get into that pseudo-solved space.\n\nAnecdotally, my groups were a lot more prone to fighting than many people's experience, which probably made it more fun early on. And I respect the design philosophy of turning combat into a high-stakes experience that both sides are hesitant to enter, but it's pretty annoying when the game disincentivizes combat to this degree.",
    "timestamp": 1757023200
  },
  {
    "username": "zabriskie_point",
    "rating": 6.0,
    "comment": "Me parece que funciona mejor de lo que me entretiene. Soy más de mayorias que de colocación de trabajadores.",
    "timestamp": 1755900000
  },
  {
    "username": "Nonceaux",
    "rating": 6.0,
    "comment": "I'll give it another chance someday",
    "timestamp": 1754431200
  },
  {
    "username": "aresil",
    "rating": 6.0,
    "comment": "",
    "timestamp": 1753394400
  },
  {
    "username": "sad366",
    "rating": 6.0,
    "comment": "When I first played this, I thought it was awesome. A little hard to learn, but once I figured it out I thought it was very clever and ended up buying it. I got a great deal on a \"played-once\" copy - got the base game, Invaders expansion, and custom insert for $50, so couldn't pass that up. Enjoyed the game for a few plays, but it quickly became stale. I'm not sure why, but it fizzled out for me and now I don't really feel driven to play it. My son likes it so we still pull it out from time to time, but there are many other games I would much rather play.",
    "timestamp": 1753308000
  },
  {
    "username": "disposable.superhero",
    "rating": 6.0,
    "comment": "July 2025 - stopped playing, as a group not enough excitement to pull it out and play.\n\nJordon owns. Enjoy playing with the group.",
    "timestamp": 1752962400
  },
  {
    "username": "bmbmjmdm",
    "rating": 6.0,
    "comment": "Good engine-builder, but unfortunately I think the player-interaction falls short. The combat is fun and intuitive, but because of how big the board is, there's rarely a need for it. So you often spend the whole game preparing for a fight that never happens.",
    "timestamp": 1752703200
  },
  {
    "username": "Vydar",
    "rating": 6.0,
    "comment": "Euro gaming at its finest.",
    "timestamp": 1752616800
  },
  {
    "username": "saoneal",
    "rating": 6.0,
    "comment": "This feels very rote to me. Little action upgrades here and there, a slight boost to this or that, an arguably perfunctory map despite its massive size. For all the infrastructure and iconography and lore propping it up, it just doesn't feel like it amounts to much.",
    "timestamp": 1751839200
  },
  {
    "username": "terrakhan",
    "rating": 6.0,
    "comment": "My second game was a 4 player. 2 that had never played before and me that had played once. It took 4 hours! And that's subtracting and hour for the interuptions/breaks that happened. Even for the setting we were in, that's just way to long! The game box states 2 hour game length. Umm...maybe if nobody talks. who doesn't talk during a 4 player game?\nIt wouldn't be my first choice but would be happy enough to play if other players were pushing for a game. Beautiful, quality components show a great passion in the making of this game.\n\nsome thoughts after my 3rd game - Maybe it was partly because I had just completed and overly long - 4 hour - game of Dune Imperium - Uprising, but did not enjoy the game. I still give the game itself props for having wonderful components/playerboards/tokens, but there's just too damned much of them...of everything! There's just so much nonsense going on and it doesn't add up to anything that feels thematic and/or fun.",
    "timestamp": 1751666400
  },
  {
    "username": "muscatred",
    "rating": 6.0,
    "comment": "Scythe is nice, you'll have a decent time playing it, but nothing it does is special and hasn't been done better in a hundred other games.",
    "timestamp": 1751407200
  },
  {
    "username": "raggededge",
    "rating": 6.0,
    "comment": "Fun concept and bold style, but the gameplay didn’t quite click for me. Some mechanics felt clunky, and it lacked the depth to keep me coming back",
    "timestamp": 1751234400
  },
  {
    "username": "paulrrahn",
    "rating": 6.0,
    "comment": "I considered buying this game, but the bizarre alternative history theme is too weird for me. It doesn't help that I am not a miniatures fan, either. The art is interesting, but at first glance, it looks like someone spewed all over the board. Play feels too constricted.",
    "timestamp": 1750543200
  },
  {
    "username": "IceTyp",
    "rating": 6.0,
    "comment": "Played it again after many years. I would really like to love this game but it keeps frustrating me.\n\nIf players take long for their turns, the game time vastly increases. But if you don't plan 2, 3 turns ahead, you might have a shortage of resources making you feel powerless.\n\nI assume with only experienced and quick players on the table, you will have a much nicer experience but I won't get that far. There are better and far less frustrating games out there.",
    "timestamp": 1750543200
  },
  {
    "username": "stude",
    "rating": 6.0,
    "comment": "Versatile and pretty thematic, nice game where the battle-driven playing turns me off. Also the picked actions in my first game were rather repetitive, not sure if any further games would change it.",
    "timestamp": 1750543200
  },
  {
    "username": "glutealgeometry",
    "rating": 6.0,
    "comment": "I'm realizing it's just not my bag. I still quite like the mechanisms of the individual player boards, but i kinda hate the common board, which is weird because i usually thrive on heavy interaction on a hexmap. I guess the combat has a bit too much Ameri-trash vibe for me even though it's not decided by dice, while the layout of resource production areas is too... i dunno.. kinda clunky & tedious or something? I like the artwork a lot, but the theme feels just a bit too \"forced\" somehow.\n(years earlier) Pretty much lives up to the hype. I especially like that you're punished with loss of popularity (a point multiplier at games end) for aggression so you'll only attack to get your 2 victory achievement stars or if you can win a big positional advantage.\nThe individual player mats are very nifty. I can, however, see how the common map can become a problem if you're stuck next to/between bullies or just get off to too slow a start.",
    "timestamp": 1749765600
  },
  {
    "username": "_Dynomite_",
    "rating": 5.5,
    "comment": "There are better worker placement games but the art is great. Plus the known broken faction start.",
    "timestamp": 1749420000
  },
  {
    "username": "winolopez",
    "rating": 6.0,
    "comment": "Classic. Even better with expansions.",
    "timestamp": 1749420000
  },
  {
    "username": "Heppy03",
    "rating": 6.0,
    "comment": "Bit too luck-based in set-up: you can end up with a civilization and resources next to your start location that match well - or don't. Apart from that an interesting game and much less war-gamy than the presentation suggests",
    "timestamp": 1749420000
  },
  {
    "username": "JudgeJacket",
    "rating": 6.0,
    "comment": "Visually stunning, of course. It's why everyone bought it (mostly). Hard to get away from too, it never left the public eye for months on end. Now that we have it, I must say it's actually kind of alright after all! (Not amazed by the combat however, it's very basic and copied almost exactly from Dune, but hey we expected as such and that's not the point of the games vision.) As impressed as I am by its production, it's not a game that evokes tonnes of excitement and raving from me in anticipation for game night since I have a huge swathe of more intresting options at hand. I'm sure Jamie is fine without my patronage.",
    "timestamp": 1749074400
  },
  {
    "username": "l3p0s",
    "rating": 6.0,
    "comment": ".",
    "timestamp": 1748988000
  },
  {
    "username": "RicardoRix",
    "rating": 6.0,
    "comment": "Gonna go with ShutUp'n'SitDown review. The combat mechanism is just too knife edge, the loser regrets the moment they said 'yes' to playing.\nFactions seem preloaded. Gameplay is sluggish. Terra Mystica wins over this in every way.",
    "timestamp": 1748383200
  },
  {
    "username": "gethralkin",
    "rating": 6.0,
    "comment": "The art gives the theme of 1920s but little else in this game immerses the player into that dieselpunk realm. Artwork and the choice mech miniatures doesn't make up for the dragging gameplay the designer leans into with the stilted engine building, refusing to provide alternate tactics mid-game to balance play when one or two players manage to severely outpace the rest of the table (and, yes, I've asked him personally, and he personally rejected any mild critique of the engine building).\n\nToo large for my table. I would need an especially large table is necessary for players to fit all of their cards and player boards around the main board. Not to mention downtime between turns makes the game that much longer with each player added. Best played with 2 or 3 players. Overall, this is just a period piece-themed game of Monopoly.\n\nI have no desire to put this on the table - I packed this up and am storing it in a closet until I find a buyer. Much less can I recommend it to others, especially after my individual experience with the attitude of the publisher.",
    "timestamp": 1747000800
  },
  {
    "username": "A1ucard",
    "rating": 6.0,
    "comment": "I respect its efficiency puzzle. But I think the first several turns are pretty repetitive solitaire. The player interaction is there in spirit, but mostly non-existent because of the cost of combat.\n\nA little overhyped in my opinion.",
    "timestamp": 1746741600
  },
  {
    "username": "BreakfastatTisiphone",
    "rating": 6.0,
    "comment": "like new - only played once after punching.",
    "timestamp": 1746482400
  },
  {
    "username": "Kyllebylle",
    "rating": 6.0,
    "comment": "It's a good game for people who wanna get into strategy games but while it's great in some ways it's also very \"meh\". A lot of people I have played it with liked it but no one loved it.",
    "timestamp": 1746136800
  },
  {
    "username": "geekshah",
    "rating": 6.0,
    "comment": "Rating based on solo, 2 & 3 players.",
    "timestamp": 1746050400
  },
  {
    "username": "Destrio",
    "rating": 6.0,
    "comment": "For now the hype hasn't fully gotten me on this game but I can see how the sandbox nature of your choices present an interesting puzzle for modern BGGers. Overhyped but great art and components. Would play again for now.",
    "timestamp": 1745964000
  },
  {
    "username": "theboredbird",
    "rating": 6.0,
    "comment": "Best presentation of any board game perhaps ever. Completely let down by trying to be 3 kinds of games at once and kinda boring? I got through 2 3.5 hour games with 5 people that felt like nothing interesting had really happened.",
    "timestamp": 1745704800
  },
  {
    "username": "Shawcio",
    "rating": 6.4,
    "comment": "1-5 (1-7 dodatek) Phalanx - Stegmaier\nekonomiczna, strategia\nbrak losowości, negatywne interakcje\nróżne umiejętności frakcji\nalternatywna historia, S-F\nkoszulki",
    "timestamp": 1745272800
  },
  {
    "username": "Peekstrom",
    "rating": 6.0,
    "comment": "Unbalanced, encounters can be too strong. Artwork is brilliant.",
    "timestamp": 1745100000
  },
  {
    "username": "crappy75",
    "rating": 6.0,
    "comment": "The map looks kind of dirty.",
    "timestamp": 1744927200
  },
  {
    "username": "black_daveth",
    "rating": 6.0,
    "comment": "Kind of neat, but kind of clunky. Need to play it again.",
    "timestamp": 1744495200
  },
  {
    "username": "Truthsketcher",
    "rating": 6.0,
    "comment": "Not what I expected when I picked it up. Definitely possible to play without ever interacting with other players. I kinda wish that was forced more.",
    "timestamp": 1744408800
  },
  {
    "username": "geoffder",
    "rating": 6.0,
    "comment": "First game went fairly well, learning on BGA over a 2p game (with voice chat). Not in my usual wheelhouse, but we still had some fun after we finally internalized all the moving parts and turns started flowing quicker (after watching Modern Cardboard's tutorial twice and reading the rulebook). I still feel that I prefer games that focus more sharply the individual mechanics that make up this big whole, but I'll still return to give it another go sometime.",
    "timestamp": 1744322400
  },
  {
    "username": "sion111",
    "rating": 6.0,
    "comment": "Looks better than it actually is. Still solid though.",
    "timestamp": 1743976800
  },
  {
    "username": "Beast_of_Leisure",
    "rating": 6.2,
    "comment": "Definitely a better game with 4-5 although I've taught this game a few too many times now and would prefer to play with those that know it (the rules explanation can take up to 30 mins if players want to know everything in advance). I look forward to trying the expansion factions.\n\nMy desire to play this has plummeted after the 15th game. I can't be bothered with it any longer.\n\n< August 2016\n\n+ Invaders from afar, Wind Gambit\n> March 2025",
    "timestamp": 1743458400
  },
  {
    "username": "Aleogod",
    "rating": 5.5,
    "comment": "Digital Version on Steam is also very good!",
    "timestamp": 1743202800
  },
  {
    "username": "rauschpotato",
    "rating": 6.0,
    "comment": "Couple two, tree plays, 4p:\nNobody plays this anymore, or at least I never see it. Great artwork, and there are Crossroads cards I think? But it's mostly a personal player board optimization, and chasing gold stars here and there. The mechs are not supposed to fight, because it's expensive for both players.\n\nOverall, I don't remember liking this game during The Hype of 2016-2018, but maybe I'm interested to try it again??? It's probably still an overstuffed, mediocre Stegmaier game.",
    "timestamp": 1742338800
  },
  {
    "username": "TheGreatGayAspie",
    "rating": 6.0,
    "comment": "Fantastic production and setting but just didn't ever seem to get chosen to play over other games. Sold on in March 25.",
    "timestamp": 1742252400
  },
  {
    "username": "GDB_",
    "rating": 6.0,
    "comment": "This game got interesting mechanics. It's gorgeous for sure, but after a few plays I just do not find the fun in it. Resold it.",
    "timestamp": 1741993200
  },
  {
    "username": "LordAlfredo",
    "rating": 6.0,
    "comment": "I want to like this but holy hell it is not balanced without house rules",
    "timestamp": 1741820400
  },
  {
    "username": "HerrTom",
    "rating": 6.0,
    "comment": "I really wanted to like this game. The art is beautiful and it has interesting and nicely physical mechanics... but it unfortunately feels like less than the sum of its parts. The game feels like it wants to be many things but never really leans into any of those directions. It is still certainly a good game, fun too, but there are many others I would rather play.",
    "timestamp": 1741561200
  },
  {
    "username": "Blitz37",
    "rating": 6.0,
    "comment": "A good game that's more eurogamey than wargamey as winning fights is more of a personal boon and doesn't harm the opponent much at all. Looking at it from a eurogame standpoint I really like it for it's unique pacing starting from a crawl and quickly escalating into an explosive finish.",
    "timestamp": 1740006000
  },
  {
    "username": "Monochromize",
    "rating": 6.0,
    "comment": "Loved it at first, but lost interest pretty quickly.",
    "timestamp": 1739228400
  },
  {
    "username": "enavico",
    "rating": 6.0,
    "comment": "+ One of the best artwork ever seen on a table. Top notch material production.\n+ One of the most brilliant \"4X\" euro/american hybrids, with so many things to care about and many objectives, with a good sense of race and a smart points scorings.\n+ High asymmetry, many faction combinations.\n\n= Some factions/board combinations may seem tougher than others to use and develop during the game.\n\n- The objective cards are not balanced: some are super-easy, some are not.\n- The sudden end of the game may be really penalizing, especially if you play with >5 players. It feels like a really anti-climatic ending. I don't find it an appropriate choice...\n- ...and it may lead to disappointing kingmaking situations, sometimes.\n\nPlayer count performance: 4>5=3>1>>2NO",
    "timestamp": 1739142000
  },
  {
    "username": "vip_chicken",
    "rating": 6.0,
    "comment": "Borders and territory don't mean much in when there's so many ways to teleport to different areas of the board (and possibly steal a victory point, or even the whole game). A bunch of posturing but little payoff.",
    "timestamp": 1739142000
  },
  {
    "username": "Bertuccia",
    "rating": 6.0,
    "comment": "I understand why it’s such a high rated game: production is amazing (miniature, art, player boards), light asymmetry, the game flows well after few rounds, and there is a lot of replayability.\n\nBut rules are not so immediate nor clear, it feels like some strategies and factions imbalanced, the engine feels very pointless and slow, and the losing a fight to return to the start position is very impactful. Maybe few plays will change my score, but it’s okay so far.",
    "timestamp": 1738364400
  },
  {
    "username": "mhoku",
    "rating": 6.0,
    "comment": "A little overrated in my opinion. Had all the elements of a great game but moves feel random too much of the time. Not my favorite of the euro games",
    "timestamp": 1737586800
  },
  {
    "username": "pulla",
    "rating": 6.0,
    "comment": "- Nice: Shortness for a strategy game\n- Less nice: Feel like player boards / starting places are unequal.\n\nEDIT: Don't know why I originally gave this an 8 (1-2017). I clearly don't want to play it again.",
    "timestamp": 1736809200
  },
  {
    "username": "Jardinko",
    "rating": 6.0,
    "comment": "It's fun enough.",
    "timestamp": 1736722800
  },
  {
    "username": "morimementos",
    "rating": 6.0,
    "comment": "I enjoyed this one, it’s just too “okay” for me to justify keeping, since it’s a big box and storage space is a premium for me.",
    "timestamp": 1736377200
  },
  {
    "username": "SirGrenadealot",
    "rating": 6.0,
    "comment": "Fantastic look and good mechanisms, just not my type of game",
    "timestamp": 1736204400
  },
  {
    "username": "MeepleMomma",
    "rating": 6.0,
    "comment": "*at a board game cafe - I need to try it again",
    "timestamp": 1736204400
  },
  {
    "username": "Egwood",
    "rating": 6.0,
    "comment": "Very nicely done elegant game. Played only once, would like to play again. Quite easy to get into.",
    "timestamp": 1735858800
  },
  {
    "username": "dougfoolery",
    "rating": 6.0,
    "comment": "Clean design with an amazing production. Love exploring the map and tinkering with the different ways you can build each faction. Battles are calculated and rarely happen though the threat of escalation is felt throughout. Very smooth gameplay and fun if you treat it as an efficiency puzzle rather than a war game. There is almost no player interaction outside of racing for lucrative spots on the map or a few calculated battles, which can be disappointing given all the cool mechs you have.",
    "timestamp": 1735858800
  },
  {
    "username": "yoyomanhihi",
    "rating": 5.5,
    "comment": "I really wanted to like this game, since I love territory war games and development games, and this games is a combination of both. Unfortunately, even though the game is great mechanically, I have two main drawback that prevent me from wanting to play more.\n\nFirst, my main drawback is that the games feels like a multiplayer solitaire, which is something that I really dislike in games (of course, it's very personal). This feeling is the same that I had with Ark Nova, where I expected some interactions but in fact everybody is only looking at his own board, and the interaction is minimal. Here, it's even more disappointing, as I expected a lot of interaction from a war game, but here I feel like everybody will only do the minimal number of wars possible and focus on his own area.\n\nMy second drawback is that I feel like the strategy is straightforward depending on where you start, and you only do what the game expects you to do. For example, I started the game at the left, where a river was blocking the path. My first X turns were therefore only focusing on deploying a mech to traverse rivers, and the strategy was therefore already written for me. Therefore, I also feel like the game can be repetitive if you play it a lot, and the game is probably already \"resolved\", with some pre defined set of actions that are the best depending on where you start.",
    "timestamp": 1735858800
  },
  {
    "username": "B4umgeist",
    "rating": 6.0,
    "comment": "Sarahs Freund",
    "timestamp": 1735772400
  },
  {
    "username": "digitalbeachbum",
    "rating": 6.0,
    "comment": "Becomes pointless after a while due to limited strategy",
    "timestamp": 1735686000
  },
  {
    "username": "TheGiN",
    "rating": 6.0,
    "comment": "1-5\nBest: 4\nsleeved",
    "timestamp": 1735599600
  },
  {
    "username": "secondofthenew",
    "rating": 6.0,
    "comment": "+Invaders from Afar\n+Encounters\n\nEvery time I play this game is an enjoyable experience. There's a great deal of variability within the constraints of the design, and it's fascinating to me how much the end-game board state varies from game to game. The automata is good for solo play, and I enjoy the experience even with just 2 players.\n\n+I have good experiences using this as a gateway game for people who enjoy video games and games like Risk.\n+Beautiful artwork.\n+Fun engine optimization puzzle.\n+Great asymmetry.\n-Some aspects of randomness in the encounter cards that may feel bad to some people.\n-Can run long at higher player counts.",
    "timestamp": 1735513200
  },
  {
    "username": "Nekrocow",
    "rating": 6.0,
    "comment": "It's a game with beautiful art, kinda good mechanics, but overly repetitive with certain combos that get boring a little fast.",
    "timestamp": 1735340400
  },
  {
    "username": "Grobbs",
    "rating": 6.0,
    "comment": "Included realistic resources, large map, large box\n\nSell price: $120",
    "timestamp": 1735254000
  },
  {
    "username": "Beneneiz77",
    "rating": 6.0,
    "comment": "Non mi è piaciuto. Pur riconoscendo che è un gioco ben costruito non mi ha entusiasmato né come meccaniche né come ambientazione",
    "timestamp": 1735167600
  },
  {
    "username": "ckomiya",
    "rating": 6.0,
    "comment": "solitario",
    "timestamp": 1735081200
  },
  {
    "username": "BGMafia12",
    "rating": 5.5,
    "comment": "Resource management with action selection that plays well at higher player counts (4+), as it makes for more interaction. The ships add more variety and change strategies while adding very little rules overhead. Once players have played a few times you can play 4 player games quite quickly, less than an hour is possible. Really don't enjoy the race mechanic, which in the end brings the game down for me substantially.",
    "timestamp": 1734735600
  },
  {
    "username": "DadDialTone",
    "rating": 6.0,
    "comment": "Not a bad game. It's actually pretty fun. I just can't imagine myself ever recommending to play it. I would be down if someone else loved it and wanted to play it.",
    "timestamp": 1734476400
  },
  {
    "username": "SGgrayfox",
    "rating": 6.0,
    "comment": "Sold",
    "timestamp": 1734130800
  },
  {
    "username": "MrMuzzled",
    "rating": 6.0,
    "comment": "Great components and an interesting game; however it feels like you are playing alone when you play it so it never clicked with the rest of the family.",
    "timestamp": 1734044400
  },
  {
    "username": "tolhs",
    "rating": 6.2,
    "comment": "2024:+1\n\nNotR < 10: 3,4,5\nBest: 4,5\n\ntbp:30-40",
    "timestamp": 1733958000
  },
  {
    "username": "TheBrainlessdude",
    "rating": 6.0,
    "comment": "I think my Dad liked this game a lot more than he let on.",
    "timestamp": 1732662000
  },
  {
    "username": "Root308",
    "rating": 6.0,
    "comment": "This is a cool and well designed game but it's one of those where the layers of complexity feels more a little bit more tedious than interesting to me.\n\nAlso a lot of the game is looking at your board, looking at your map, and figuring out the best course of action for the next several turn. But it feels like at any given time there is a single optimal solution you should figure out and most of the other options will be surprisingly slow and inefficient.\n\nOpen to play it more and see if I change my mind but we'll see.",
    "timestamp": 1731798000
  },
  {
    "username": "FuriousBroccoli",
    "rating": 6.0,
    "comment": "Giant area control game with some neat concepts; ultimately felt like it ended before our engines got humming (and I was the one who ended it and won bc my engine was about to get eclipsed). I remember disliking the movement rules since they are faction specific, so we were all constantly surprised at how each other could break the basic movement restrictions.\n----8.2\nNot super keen to play again, but I would give it another shot\n-----7.8\nPlayed the app this time - baffled at the popularity of this game; it is beautiful (though the app is real ugly) but it's just weirdly unsatisfying and the movement rules are super obtuse. Definitely has depth though I will give it that.",
    "timestamp": 1731625200
  },
  {
    "username": "Jamiri",
    "rating": 6.0,
    "comment": "Overhyped in my opinion and does not hold up to more recent game designs.",
    "timestamp": 1730415600
  },
  {
    "username": "Radziszz",
    "rating": 6.0,
    "comment": "7.5 -> 6 I just don't feel this game when playing. Most of the time I feel like I am loosing and even if I think I'm doing well the game ends and I'm loosing as I could not achieve what I wanted. Maybe this game is just not for me.",
    "timestamp": 1729807200
  },
  {
    "username": "dhable",
    "rating": 6.0,
    "comment": "It was interesting and I could use a few more plays before I can really give it a good rating. Not sure that I really like the rewarding the losing side of a conflict because it turns this from area control into more of an engine builder. Open to giving it more plays in the future.\n\n\n15 Oct 2024 - 6 (1 play)",
    "timestamp": 1728943200
  },
  {
    "username": "parrox",
    "rating": 6.0,
    "comment": "Not a bad game. I think the theme and art direction just don't click for me. I thought I could look beyond that if the gameplay would draw me in, but there are games with similar mechanics that I enjoy much more.",
    "timestamp": 1728770400
  },
  {
    "username": "Niedwiediew",
    "rating": 6.0,
    "comment": "Look of this game promises different kind of experience it actually delivers. The game is much shorter than anticipated and doesn't involve much fighting at all. There are even mechanics, which disencourage you to do so. Some aspects of following what is done by other players as their action because you might get a tiny profit out of it was annoying to follow and didn't had much impact. I wanted to like this very much, but it's just not what this game is.",
    "timestamp": 1728597600
  },
  {
    "username": "Caplette",
    "rating": 6.0,
    "comment": "A good engine building game. Area control is a part of the game but not just around it , so it is good. I just play 2 players and I think it would get better for 4 players",
    "timestamp": 1728597600
  },
  {
    "username": "jellyfishjoe",
    "rating": 5.7,
    "comment": "A game where the threat of war is the more present than war itself. The game is beautiful, and there are a lot of neat, interspersed mechanisms. There's a lot of things in this game that feel unnecessary though. It's a bit like an ameritrash rpg-like game crashed into a mostly finished resource management euro, and the two don't mix very well.",
    "timestamp": 1728338400
  },
  {
    "username": "Russland3",
    "rating": 6.0,
    "comment": "very dependent on Order of Play",
    "timestamp": 1728252000
  },
  {
    "username": "sharklord65",
    "rating": 6.0,
    "comment": "I enjoy playing this game but I feel like the base game really needs the expansions before it can take off",
    "timestamp": 1726696800
  },
  {
    "username": "Link007",
    "rating": 6.0,
    "comment": "Good : I always have a good time playing it, but I'm yet to have a great time. The lack of player interaction hurts the experience, and the theme feel wasted on this game. The race of optimizing my own action is somewhat fun. But the biggest issue is that the design is too simple compared to the length of the game.",
    "timestamp": 1726264800
  },
  {
    "username": "cbazler",
    "rating": 6.0,
    "comment": "An interesting, surprisingly light Euro-Ameritrash hybrid. I say \"surprisingly\" because, despite all the bells and whistles in that huge box, the game at its core is a pretty simple area control game with some neat, easy-to-understand scoring mechanisms. I love that you can score points for doing all sorts of things, making combat only one small part of the gameplay. In this regard, the game reminds me of Eclipse: apart from some small skirmishes, players generally spend the game diversifying as they gear up for the aggressive endgame.\n\nIf I had one complaint, it's that the goals are a little too easy to get, and are mostly fulfilled by all players the end of the game. So, by the end most people will have built all of their mechs. Most people will max out their workers, etc.\n\nI wish there were more ways to specialize (i.e. to score more points within a particular strategy), and thus vary your strategy from game to game: so, a \"mech strategy\" would incentivize going heavy into mechs early, and then provide more ways to score with them. A \"worker strategy\" would do the same within that track. As it is, each play of this feels kind of \"samey.\"",
    "timestamp": 1726178400
  },
  {
    "username": "littlechandler",
    "rating": 6.0,
    "comment": "Initial Impressions: If this is a 4X game as it was sometimes advertised as it is missing many of the 4X elements, and if it isn't a 4X game it is a good but far from amazing Euro.\n\nThe game seems more about completing objectives and managing resources so that you can always pay for the bottom action when you do the top one too (with a little bit of timing in case of opponent interference). Some of the ways to get stars also feel not really thematically tied at all (e.g. you have military power, but don't spend it). Therefore, it doesn't give the civilization building feel at all, and while there are upgrades they don't feel like you are learning new technologies, as they only make your other actions better.\n\nIt obviously lacks explore since the map is static and nothing is hidden, and its exterminate aspect while somewhat present is really weak. Combat is more a threat than something that actually happens frequently (in my game there were only 2 combats, and while I could see some play styles that would cause it to happen more frequently it still seems amassing troops is more as a deterrent). That you only have 1-5 combat units on the board at a time doesn't help with making combat more nuanced. I also don't like secret bidding especially for combat.\n\nThe poor combat also hurts the expand aspect, as while you can get a lot of points for expanding the lack of constantly jockeying for territory makes the expand less interesting.\n\nThe game also seems like it would be fairly samey in the beginning of each game, in that despite the different factions/action boards/objectives/you can go for different ways to achieve stars each game, they overall feel of what you do is still similar.\n\nThe encounter cards just don't feel that thematic. The story behind each one feels too disjointed from the rest of what you are doing, and so while they have flavor art and text that makes sense with the setting they just feel like random resource bonuses.\n\nAs for why I rate Terra Mystica so much higher, to be honest maybe I was too caught up in the hype of it. I don't remember my play of it enough to have a good gauge of it is actually my type of game. If I do like Terra Mystica more, I think it is due to the balance of being near opponents so you pay less for settlements vs. being far enough away that you have space to build (whereas here it seems like you basically always want your workers far away from opponents, and mech relatively close), you can build more, the factions feel more different, and that while there isn't movement it feels like you can affect the land more by terraforming.\n\nDespite all the things I mentioned I dislike about this game, I did enjoy it and feel that the relatively simple action selection turns tied to chaining of these actions, along with the added logistics of the spatial map was cool. It just wasn't super innovative or anything deserving the hype, the artwork, or its ranking, and so it left me really disappointed.\n\nEDIT: I've enjoyed this more on repeated play. All the issues I mentioned above I still have issues with, but they bother me less. I can enjoy it as an abstract action efficiency game with some confrontation that doesn't get too in your face, and I love my maps. Usually in a confrontation you will only start one if you are definitely going to win or going to tank it, so losing a bunch of combat resource while still losing doesn't happen too often, even if it feels terrible. I also always like games with player controlled endings. I can see the opening moves being scripted for experienced players, but I think the game still has enough legs for some exploration of each a couple times per player before you figure that out (assuming you don't read up on it online beforehand).\n\nEDIT 2: nevermind, back down to a 6.",
    "timestamp": 1725919200
  },
  {
    "username": "leumas88888",
    "rating": 6.0,
    "comment": "Good, but not much more than that. Really not much player interaction at all, with limited choice, and can be quite boring at times.",
    "timestamp": 1725832800
  },
  {
    "username": "Tkopach",
    "rating": 6.0,
    "comment": "Solo play needed.",
    "timestamp": 1725487200
  },
  {
    "username": "GrimThunderbrew",
    "rating": 6.0,
    "comment": "I like asymmetry, but it is annoying that it is hard to know what everyone else has that is different. So far theme doesn't shine through. \"luckless\" combat isn't really when some players draw combat cards worth 5 and others only 2s and 3s. Player boards would be easier to use if actions were color coded so you could easily see where actions were on other player boards. Also, movement abilities of other factions were hard to parse out and it seems like some factions cant get to some places even with full upgrades(I am sure not a problem in 5 player, but in 3 player it seemed weird)? Also, so much resources were put into this game, the player boards, the wooden resources, the tiny plastic models, etc., Why only 2 combat wheels to share???",
    "timestamp": 1725400800
  },
  {
    "username": "zoldaria",
    "rating": 6.0,
    "comment": "It's a good thematic engine building game. The art is fantastic. The games are varied and interesting and the variance is low. The reason I'm not rating it higher is that I like my games to have a lot of player interaction. Scythe is higher than wingspan and terraforming mars but not by much. I don't see this getting to the table very often when there are games that fill a similar niche but have more interaction.",
    "timestamp": 1725141600
  },
  {
    "username": "Lasve16",
    "rating": 6.0,
    "comment": "Not what i was expexting",
    "timestamp": 1725055200
  },
  {
    "username": "Duke_Rufus",
    "rating": 6.0,
    "comment": "I can't. I won't.",
    "timestamp": 1724968800
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 6.0,
    "comment": "After 4 plays, my desire to play has wavered.",
    "timestamp": 1724709600
  },
  {
    "username": "Deuterazamus",
    "rating": 6.0,
    "comment": "Things that I like: theme, elegant design\nThings that I don't like: combat reawarding attacker, quality of player interaction, with equally skilled players the whole game it's just a race for optimization - do it properly and you'll win, make a mistake and you've thrown to the garbage the whole game. No room for fun. First turns are almost scripted.\nWhat I lack the most is satisfaction of play.",
    "timestamp": 1723327200
  },
  {
    "username": "GlorifiedGutsyGaming",
    "rating": 6.0,
    "comment": "I think this game came in too hyped for me. Not a lot of player interaction. Individual player powers are cool, but didn't seem balanced. This is not what I think of when I think of 4X. Which is fine I guess just not what I had really hoped for.\nTraded for Empires of the Void II and Tsuro.",
    "timestamp": 1722808800
  },
  {
    "username": "Shinako",
    "rating": 5.5,
    "comment": "TimpCon 2019 - Plays closer to a 4X instead of wargame, but direct conflict is fairly optional as there are many other objectives to focus on in order to gain points. Uses personal action selection as the vehicle to propel the game forward.\n\n2022 - this game is unbalanced depending on your starting faction and action mat. Some combinations are amazing, and some are just absolutely terrible. While learning the metagame and using pre-game draft/bidding may be an acceptable fix for some people, I have no interest in that. While I could play with casuals who don't know the meta game either, it irks me to know that winning/losing can be influenced by random asymmetrical starting positions. Did I win because I was good at the game, or did I just get an easy combo? Did I lose because I could have played better, or was my combo just weak? Even if the imbalances aren't that big in casual play, for me it just ruins the whole idea of rewarding skill expression, and will make me question whether any future victories or losses are actually deserved.\n\nOwn digitally - Steam",
    "timestamp": 1722117600
  },
  {
    "username": "WeNeedthePooh",
    "rating": 6.0,
    "comment": "Huge, long and impossible to set up for a solo play. Need to try it again for multiplayer.",
    "timestamp": 1721858400
  },
  {
    "username": "MrErmak",
    "rating": 6.0,
    "comment": "Meh\nAt least we have new printings of all major Jaime games in Russia after two years of fake smiles)))",
    "timestamp": 1721685600
  },
  {
    "username": "marcuslind1",
    "rating": 6.0,
    "comment": "Different player mats and factions makes for lots of combinations to explore, but in the end play can feel a bit too scripted and there are irritating balance issues. With a little experience games run pretty fast and smooth and can provide a good time. Problem is that with experience the balance issues will also be more clear, and the game may seem too long to play just for casual, friendly play.\n\nI don't get the interlocking turns where you are supposed to start your turn before your opponent finishes. Why wouldn't you want to know what they choose to do before you act, what mech they choose to build etc?\n\n4 players is a minimum. Very nice components, except for warping player boards.\n\nLots of engine building and action optimization, if that's your thing. Plus cool mechs.\n\nScythe seems to have had a big impact on modern boardgame design (amerithrash-euro hybrid with lots of different mechanisms, with miniatures and distinctive artwork) and boardgame Kickstarters. If that's a good thing or not is a matter of some debate.",
    "timestamp": 1721340000
  },
  {
    "username": "t_rentasaurus",
    "rating": 6.0,
    "comment": "Loved this game for the first 25-50 plays, but now it's feeling very...optimized. Great game, I just think it's time to part ways with this one.",
    "timestamp": 1721340000
  },
  {
    "username": "Coralouwho",
    "rating": 6.0,
    "comment": "#LetterS\n#BGA",
    "timestamp": 1720648800
  },
  {
    "username": "aspru",
    "rating": 6.0,
    "comment": "C",
    "timestamp": 1719439200
  },
  {
    "username": "Freshcactus",
    "rating": 7.0,
    "comment": "3-5",
    "timestamp": 1762650600
  },
  {
    "username": "TheMiddleAgedGamer",
    "rating": 7.0,
    "comment": "perosnally i thouht it wa pretty cool but my gfirends didnt like it so i;ll probaly never plaue ot agiain. beautiful game though.",
    "timestamp": 1762615620
  },
  {
    "username": "Tallonar",
    "rating": 7.0,
    "comment": "Keith",
    "timestamp": 1762210800
  },
  {
    "username": "Final_Meeple",
    "rating": 7.0,
    "comment": "Top 50 Games of 2024 - #42",
    "timestamp": 1761865200
  },
  {
    "username": "The_eighth_colour",
    "rating": 7.0,
    "comment": "Good game, but I personally don't like the connected actions system, to me it feels like \"artificial difficulty\". Also the while the automa is easy enough to run (takes a few games to learn though), it does moslty the same thing every game. Would be nice if there where different \"personalities\" for the automa.",
    "timestamp": 1761429600
  },
  {
    "username": "netfilterz",
    "rating": 7.3,
    "comment": "My first ever kickstarter. Back then I considered it had gorgeous components and innovative gameplay. Would still play, but it's gone down in my rating since.",
    "timestamp": 1760997600
  },
  {
    "username": "EugeneGK",
    "rating": 7.0,
    "comment": "Often Unexpected ends",
    "timestamp": 1760738400
  },
  {
    "username": "Technarius",
    "rating": 7.0,
    "comment": "It's a wannabe area control game, which is actualy an economic euro game with some small area movement/control elements. It's actially a standard \"ressources conversion\" and \"moving up tracks\" euro Game, nothing Really special\n\nPros:\n+ Interactive\n+ Beautiful Artwork and Game material\n+ Cool theme\n+ I Like that you have to transport and defend your ressources\n\nComs:\nIn my opinion this Game has some Problems:\n- On the standard map it is absolutely solvable / repetitive as there is always the one and only \"best actions sequence\" for wach combination of faction mat and state / player mat. On the variable map the game is badly balanced as the starting points don't always match to the current faction.\n- The game feels punishing in many ways - you are punished for battles which involve workers, your own workers consume too many ressources during \"production\" action and you always lacking at least one ressource for a decent turn. Satisfscting turns are rare.\n- The game ends very abruptly.\n- Randomness of Card Draw\n\nVerdict: I sold my copy as i have way better games in my collection.",
    "timestamp": 1760565600
  },
  {
    "username": "Auroric",
    "rating": 7.0,
    "comment": "Scythe is an interesting mix of a bunch of different mechanics, but ultimately you're trying to upgrade your action efficiency in order to race to 6 points faster than your opponents. There's a ton of variability in what order you acquire these stars, and I like that there's both a faction board and an action board that changes every time. Personally I actually really enjoyed the \"cold war\" style interaction, where the threat of being attacked looms over you the whole game, while actual conflict is few and far between. I find that quite unique and enjoyable, and it's refreshing to have in what's mostly an efficiency game. The theme is also fresh and done very well here.\n\nI will say I find it to feel a little samey from game to game. Although the variability seems extremely high, I don't find that much really feels different. Like we're all doing the same things in slightly different orders, and hoping we don't get attacked, and that's kind of it.\n\nI will definitely continue to explore this one, but there's nothing here that I find particularly exciting compared to other interactive Euro's. I'd rather play something in the Terra Mystica family. I see why this made waves when it came out, but for me it's just a good game, with a refreshing interactive layer, but nothing amazing.",
    "timestamp": 1760392800
  },
  {
    "username": "Nathiboy",
    "rating": 7.0,
    "comment": "Lacks interactivity with the table. You could play alone, kinda.",
    "timestamp": 1760047200
  },
  {
    "username": "DevOpsProDude",
    "rating": 7.0,
    "comment": "44x67 - 42\n57x87 - 56\n70x110 - 92\n\nPlayed on board game night.",
    "timestamp": 1760047200
  },
  {
    "username": "turtol",
    "rating": 7.0,
    "comment": "Played 5 times, rating may change, played at 5+\n\nPros: if everyone is familiar with the game, it can get quite intense\n\nCons: no catchup mechanics for people who fall behind, if a starting combination is unfair, there's almost no way to beat a competent player",
    "timestamp": 1759874400
  },
  {
    "username": "DoctorPhil",
    "rating": 6.8,
    "comment": "review after 10 plays: https://spotifyanchor-web.app.link/e/VBjpee3u1Fb\n\nRules complexity 3\nPlaytime/complexity ratio 3\nStrategic avenues 4\nMechanism strength 4\nThematic integration 4\nVariability 3\nReplayability 3\nFun factor 2\nSolo mode\nPlayer interaction 4\nElement of mastery 4\n\nOverall 6.8 out of 10",
    "timestamp": 1759356000
  },
  {
    "username": "Nunius",
    "rating": 7.0,
    "comment": "It's an outstanding game, even worker placement and engine building are not my type of games.\nJust like Wingspan (another game from SM), this game has a great board presence and excellent game components. It has a high learning curve, but the gameplay is amazing.\nI like the solo mode - Autonoma (SM's solo system/mechanism).\nAt moment, I'm playing solo (until my playgroup feels confortable e prepared with the game). I'm still using/learning the factions from the base game, I haven't played yet with the 2 new factions from the\nexpansion.",
    "timestamp": 1759356000
  },
  {
    "username": "Codarl",
    "rating": 7.0,
    "comment": "Expansions:\nEncounters\nModular Board\nInvaders from Afar\nThe Wind Gambit\nThe Rise of Fenris",
    "timestamp": 1759010400
  },
  {
    "username": "Micpi",
    "rating": 7.0,
    "comment": "in Poland with rise of fenris",
    "timestamp": 1758492000
  },
  {
    "username": "FranzK",
    "rating": 7.0,
    "comment": "First experience with this game was super-fun. It was 5-player and my first post-COVID in-person game day. Took about four hours (with lots of distractions from 6-year-old and just catching up) and didn't know what we were doing at first. But it clicked fairly quickly. Just an epic, fun experience.\n\nGreat theme, not too hard to learn, and nice opportunity for interaction. It doesn't feel particularly deep and it's not a brain-burner but it doesn't need to be - there's still plenty of opportunity to be tactical and strategic. It's a nice sweet spot in terms of not being too hard to learn but still being an interesting experience.\n\nFirst game at 2-player with my kid was also great.\nI was worried it wouldn’t be interactive enough but we played factions right next to each other and it worked out well. It only took about an hour, too.\n\nOverall, really enjoyed my time with this game but there are a lot of other games I would choose to play first so I sold it.\nSolo automa is also decent as well. Easy to run but not easy to beat.",
    "timestamp": 1758405600
  },
  {
    "username": "GattoNero25",
    "rating": 7.0,
    "comment": "perfect !",
    "timestamp": 1758319200
  },
  {
    "username": "PiecesOfToast",
    "rating": 7.0,
    "comment": "Solid game, but 2p games are not as good. It's best when playing with 4 or more players as it adds to chaos in controlling territories making the gamplay more enjoyable",
    "timestamp": 1758146400
  },
  {
    "username": "peterlevi",
    "rating": 6.9,
    "comment": "4 (5,3)\n(open)\n\nAmazing art and world-building. But mechanically and in terms of \"Wow\" moments, it somewhat falls flat. Turns are quick, which is nice. Need to play more, it may grow on me.\n\nEdit:\nAfter several games at two players and two games at five players. Neither of these counts works well. It promises waaay more than it delivers. Not enough interactivity. Most times you're not interested in other players' turns almost at all. No \"wow\" moves. Not enough fun. It feels like a somewhat dull hotchpotch of mechanics in a very shiny pretty wrap.\n\nI played Yellow & Yangtze recently and there are some distant similarities between the two games, but Y&Y is so much more streamlined and there are way more interesting moments....\nReducing rating to 6.9. The art and presentation is great enough to keep me interested in playing a couple more times, but I think I'd be suggesting other games.",
    "timestamp": 1758060000
  },
  {
    "username": "kompanjon83",
    "rating": 7.0,
    "comment": "Finally I played it and I can only confirm what others were saying for so long. Such an interesting game that gives you feeling of grandness as you expand your faction around the map.\n\nI hope to play it again, soon.\n\nedit: I played it more and the granduer dissipated. All that was left was a mediocre game where ppl race to produce resources faster and finish the 6 stars in the fewest turns. It's not rare that the winner is decided by the right quest at the right time.\np.s. we are more of a pacifist group, so we don't really fight over resources with the mechs. Maybe it's our fault and not the game's.. but this was my experience nontheless.",
    "timestamp": 1757887200
  },
  {
    "username": "djsturz",
    "rating": 7.0,
    "comment": "Fun efficiency puzzle with one of my favorite combat systems, but can feel a little repetitive even within a single game",
    "timestamp": 1757455200
  },
  {
    "username": "The Flame of Error",
    "rating": 6.5,
    "comment": "Average game. I really want to like Scythe, but I always walk.away disappointed.",
    "timestamp": 1757282400
  },
  {
    "username": "themikeman",
    "rating": 7.0,
    "comment": "BGA: Slow start to the game and interaction is low, but there is something satisfying about the slow build up and simple action selection mechanism. Combined with the theme and components, this might be the best version of low interaction \"simple\" 4x game. For a game that I'm not excited about, the time commitment and setup and rules overhead may be too much to justify keeping though.",
    "timestamp": 1756936800
  },
  {
    "username": "minitj",
    "rating": 7.0,
    "comment": "Сыграли одну партию на четверых за 2:40.\n\nМне игра понравилась. В игре есть 10 задач, выполнив 6 из них наступает конец, все! Сам решай какие и в каком порядке делать, мне нравится такая свобода выбора. Какую-то часть на себя берёт планшет героя, определяя какие цели тебе будет легче достичь, но он комбинируется со вторым планшетом, который у всех игроков как и герои разный, в этом и кроется большой интерес игры - искать правильную раскачку планшетов, чтобы первым завершить все цели, хотя это и не является гарантией победы. Так же, важно грамотно перемещать своих миплов, есть события которые предлагают один бонус из трёх на выбор и прочие интересные нюансы. Кароч, в игре много всякого и мне было интересно решать, что и когда лучше прокачать, куда походить или какое действие выбрать сейчас.\n\nUPD:\nСыграли ещё 1 партию на 4 с разными дополнениями. Был заменён планшет на \"не конфликтный\" где не было военных целей, взяли разные фракции из дополнений, были доп. жетоны на старте. Глобально это не повлияло на игру, но старт был пободрее из-за жетонов ( я благодаря жетону смог построит на старте бесплатно здания, кто-то удвоил ресурсы и тд). Мне понравилась партия, но как-то меньше чем первая, возможно из-за отсутствия битв или пропал эффект новизны, но в любом случае игра хорошая и не откажусь ещё поиграть.",
    "timestamp": 1756504800
  },
  {
    "username": "Doogiesham",
    "rating": 7.0,
    "comment": "More of a “Cold War” game than a “war game”, which means that this game sometimes doesn’t fit players expectations. Combat and conflict is something that happens and is a threat, but it isn’t obligated and the attacker is generally deterred from starting a fight.\n\nWhat this actually is is an efficient puzzle/engine builder where the resources and buildings are on an actual board. There are many avenues to scoring and many strategies to take with asymmetric factions and boards.\n\nI want to shout out the action upgrade system, which to me is the neatest mechanic. You remove a cube covering a reward of your choice and place that cube on a cost of your choice, making one action more rewarding and one action cheaper simultaneously. Very cool.",
    "timestamp": 1756504800
  },
  {
    "username": "Smoothsmith",
    "rating": 6.8,
    "comment": "------------------------------------\nExpansions: Invaders from Afar\n------------------------------------",
    "timestamp": 1756418400
  },
  {
    "username": "wroday",
    "rating": 7.0,
    "comment": "Sleeved",
    "timestamp": 1756159200
  },
  {
    "username": "Cosinus42",
    "rating": 7.0,
    "comment": "Solo rules",
    "timestamp": 1755208800
  },
  {
    "username": "Jstegmann89",
    "rating": 7.0,
    "comment": "Upgraded Components",
    "timestamp": 1755036000
  },
  {
    "username": "alshek",
    "rating": 7.0,
    "comment": "5 players",
    "timestamp": 1754863200
  },
  {
    "username": "rutherford82",
    "rating": 7.0,
    "comment": "The board is bigger than my table and the realistic resource tokens are amazing!",
    "timestamp": 1754604000
  },
  {
    "username": "PPotter81",
    "rating": 7.0,
    "comment": "Digital",
    "timestamp": 1754344800
  },
  {
    "username": "Doctor_Cowboy",
    "rating": 7.0,
    "comment": "This is a great second game to teach people who are getting into heavier board games. Basically \"what is Risk was really good and fun?\" I like the randomized economic boards, although I have yet to feel truly different when playing one versus the other. But the factions do feel very different, and not necessarily better than each other. Very difficult to balance that, but I think they've done it. Overall fun playing almost all of them, and good replayability for at least 6-10 games.",
    "timestamp": 1754344800
  },
  {
    "username": "Galvalao",
    "rating": 7.0,
    "comment": "It's a very good game overall but there is too many things to do and to track in the game (including what other players are doing) to be enjoyable in my personal opinion",
    "timestamp": 1753912800
  },
  {
    "username": "Metadna",
    "rating": 7.0,
    "comment": "played with variants",
    "timestamp": 1753567200
  },
  {
    "username": "bombotcg",
    "rating": 7.0,
    "comment": "w/ all 3 expansions\n\ncan be a bit imbalanced, game can sometimes feel slow if no one is fighting each other\n\nnot too hard of a teach, but a lot to set up and clean up\n\nwill play if big group down for a big board game",
    "timestamp": 1753567200
  },
  {
    "username": "gyroscope1045",
    "rating": 7.0,
    "comment": "Sleeved\nVG/LN 35",
    "timestamp": 1753394400
  },
  {
    "username": "marpaj123",
    "rating": 7.4,
    "comment": "price 54.57 amazon ordered 11-24-18, first played 12-1-18,",
    "timestamp": 1753394400
  },
  {
    "username": "franagor80",
    "rating": 7.0,
    "comment": "Jeu guerrier pas trop mon trip, erreur de choix",
    "timestamp": 1752876000
  },
  {
    "username": "Neluran",
    "rating": 7.0,
    "comment": "Resource management coupled with area control and very interesting action selection mechanisms. This game also oozes theme and has very high production quality which can be increased even more with premium resource tokens, metal coins and other things if you so desire.\n\nI very much like this game and it's brilliant automa system. For some people the automa is hard to manage and they use an app for that. I don't think that's necessary at all but ymmv. It's great solo and as a two player game. I haven't yet played it with more players but that should only be even better.\n\nEdit: It's much better with more players. And I've cooled quite a bit on the automa system. This perspective change comes mostly from less time in my life. There are some slight balance problems and most of the expansions are unnecessary but you only know that once you've played them. I sold my game 2 years ago but still think about it from time to time.\n\nUnfortunately Scythe is a game on rails. I love asymmetry and great table presence but I also love different paths to victory. Scythe doesn't have that. It's a game on rails. For every faction there is an optimal path (sometimes so optimal that it has been banned) and the whole game revolves around finding or learning that path because it's a race. I want more actual choice in my games and not just the illusion of choice.",
    "timestamp": 1752530400
  },
  {
    "username": "Amekins",
    "rating": 7.0,
    "comment": "Received at White Elephant party then sold at DTC 2925 $35\n\nKickstarter Collectors Edition funded on Nov 5 2015\nPledge Level: COLLECTOR'S SCYTHE $99 - 1 board extension 50% bigger hexes, wooden resource tokens replaced by realistic tokens, individually numbered box, 80 custom metal coins, 4 plastic containers, 1 Factory promo pack, stretch goals\n\nSold on BGG 08-21-2017 for $350 to lowridingorilla",
    "timestamp": 1752357600
  },
  {
    "username": "Cocoabine",
    "rating": 7.0,
    "comment": "7/10: Fun dudes on a map game with the most misleading theme ever. Looks like a war game but plays like a farming game, where the mechs are basically glorified tractors. Claim land and build up your engine, with just a handful of conflicts in an entire game. Even at 5 players you are not waiting too long for your next turn. Overall, pretty good fun.",
    "timestamp": 1752271200
  },
  {
    "username": "Major Geek",
    "rating": 7.0,
    "comment": "7/11/25\nKickstarter special edition with promos",
    "timestamp": 1752271200
  },
  {
    "username": "OneMinus",
    "rating": 7.0,
    "comment": "Finally got around to playing this with Matthew and Liam when Matt visited. Fun artwork, lots of different things going on and unclear what to go after at first. Can't even remember who won (maybe Matthew?)",
    "timestamp": 1752184800
  },
  {
    "username": "Historicus",
    "rating": 7.0,
    "comment": "App",
    "timestamp": 1752098400
  },
  {
    "username": "hihimorton",
    "rating": 7.0,
    "comment": "Euro and Geman game mixed.\nSeems is a battle game but not really. Just a racing game.\nTo me it is so so.",
    "timestamp": 1751493600
  },
  {
    "username": "Infernotitan2",
    "rating": 7.4,
    "comment": "42",
    "timestamp": 1751234400
  },
  {
    "username": "HarryCrocker",
    "rating": 7.0,
    "comment": "Some great strategy here with different factions. I'm curious about the expansions but I've heard mixed reviews. Pretty darn slow at higher counts. I'd play with 3-4 max\n\n\nEdit: played at 4 with wind gambit, damn this game is tight, a single turn of sub optimal actions left me in the dust. Good game!",
    "timestamp": 1750370400
  },
  {
    "username": "d3struct10n",
    "rating": 7.0,
    "comment": "A bit too heavy and very long to my taste, this game offers a ton of depth and strategy for the passionate and - most importantly - patient mind",
    "timestamp": 1749247200
  },
  {
    "username": "Crikrunner",
    "rating": 7.0,
    "comment": "a fun game, but so many better ones out there. After a few plays it got stale, plus it's a race game which feels anti-climatic sometimes when it just ends",
    "timestamp": 1749074400
  },
  {
    "username": "capt_neb",
    "rating": 7.0,
    "comment": "All-timer!",
    "timestamp": 1748988000
  },
  {
    "username": "gorlim",
    "rating": 7.0,
    "comment": "New in shrink. Includes The Rise of Fenris expansion.",
    "timestamp": 1748556000
  },
  {
    "username": "paulastoria",
    "rating": 7.0,
    "comment": "ok",
    "timestamp": 1748469600
  },
  {
    "username": "andytaylor",
    "rating": 7.0,
    "comment": "Played Simon’s copy",
    "timestamp": 1748296800
  },
  {
    "username": "hendecatope",
    "rating": 7.0,
    "comment": "Reacquired March 2024. w/Invaders, Fenris, Encounters, Modular Board",
    "timestamp": 1747778400
  },
  {
    "username": "Maarten1998",
    "rating": 7.2,
    "comment": "Played this the first times with newer players and I liked it. Then played it with experienced players and it was not fun. Just rushing the game... and it takes the fun out. It is okay to learn good strategies in games but here it is like you should never do certain things and you cannot just wait and see what happens. So game feels broken sometimes and you need to appreciate having OP stuff. Maybe a rate this lower because of playing this with really experienced players (something that every game can suffer from). Need to give this another shot.",
    "timestamp": 1747519200
  },
  {
    "username": "chrisonfire",
    "rating": 7.0,
    "comment": "+Invaders from Afar\n+Objectives",
    "timestamp": 1747346400
  },
  {
    "username": "elkselk",
    "rating": 7.0,
    "comment": "3-6",
    "timestamp": 1747346400
  },
  {
    "username": "Momo80",
    "rating": 7.5,
    "comment": "This game isn't for those looking for a 4x experience. It's more of a low interacting pretty euro. Very streamlined for a mid-style. The artwork is stellar. The problem for me is finding regular players as there's a learning curve that pays off in the long run.\nIt allows you to play casually or really jump into the strategy rabbit hole (similar to opening chess moves).\nI prefer to keep it light and \"go with my gut\" with certain choices rather than memorizing certain plays and combos.\n\n*I’ve cooled on this over the years. The bidding aspect saves it from blatant imbalances but for casual players it doesn’t get to the table that much anymore.",
    "timestamp": 1762470000
  },
  {
    "username": "Nedudddki",
    "rating": 8.0,
    "comment": "Own German version. Will trade with English version.",
    "timestamp": 1762383600
  },
  {
    "username": "smobolob",
    "rating": 8.0,
    "comment": "Fantastic game with plenty of replayability to keep it fresh. The simplicity of the action system without removing strategic depth really makes this game shine.",
    "timestamp": 1762124400
  },
  {
    "username": "Erikk78",
    "rating": 8.4,
    "comment": "I recently started playing Scythe again. I undervalued this game earlier. What a great game. What an amazing artwork and setting.\nAnd 'The rise of Fenris' makes it even better!\n\nIncludes: Invaders from afar, Encounters and Modular board.",
    "timestamp": 1762038000
  },
  {
    "username": "bonster20",
    "rating": 7.8,
    "comment": "[had an extra NIS copy, which I sold at a garage sale]",
    "timestamp": 1761778800
  },
  {
    "username": "SiddGames",
    "rating": 8.0,
    "comment": "SoloX.\n\ng1 g2 g3 b4 g5\n90-115m\nrtp",
    "timestamp": 1761429600
  },
  {
    "username": "PBandJellyfish",
    "rating": 8.0,
    "comment": "@SC & @Digital",
    "timestamp": 1761170400
  },
  {
    "username": "federik21",
    "rating": 8.0,
    "comment": "My first modern boardgame and my first love.\nConcatenating actions, considering the asymmetrical factions, is always a nice puzzle. Long term strategy and quick decisions have the same importance.\nThe flow is so smooth you can have a 5P game with experienced players in about one hour.\n4+ Players only.",
    "timestamp": 1760911200
  },
  {
    "username": "RougeHemlock",
    "rating": 8.0,
    "comment": "Also have all expansions. I've cooled on this game a lot, but it's still a really fun 4x game with a really neat setting. Alternate history 1920s Europe where Nikola Tesla invented mechs. Fantastic. Good asymmetry, though some of the factions still feel a bit samey after a while. I like that it can be hard to tell who's actually going to win until scores are being counted. It can still be obvious who's winning sometimes, but usually people can kinda hide a little bit and it helps people not feel too discouraged by being behind.",
    "timestamp": 1760824800
  },
  {
    "username": "Deguchi_BE",
    "rating": 8.0,
    "comment": "I really like this one. The one \"gripe\" I have with it is combat. It usually gets avoided when being played and it's because It's just a bit weird.\nBut the placement, strategy, movement. All very good.\nTo me it was an introduction into the somewhat more heavy tactical games, and I still love it as much as day one.\n\nThe graphics and vibe are also very good. Kudo's to the artist(s)!",
    "timestamp": 1760824800
  },
  {
    "username": "hairysoup",
    "rating": 8.1,
    "comment": "If you're looking for an action-packed wargame, this is not for you!\n\nIf you want to build up your economy in a game that scales and escalates into border tensions and becomes a wargame, then this is for you!\n\nThis game is polarizing, you either love it or hate it I find. A veteran player will always demolish a newbie.\n\nWe have been finishing all of our recent games in under 2 hours with 4-7 players.\n\n+Extra encounters\n+Invaders from Afar\n\nEdit: With Rise of Fenris, this game becomes closer to a 9 for me.\nExtra encounters can feel very swingy compared to the base game encounters, but add some interesting variance.",
    "timestamp": 1760738400
  },
  {
    "username": "Gomer",
    "rating": 7.5,
    "comment": "Kickstarted 2015.\n\n2016 acquisition. Box survived minimal packaging provided by the shipping game company.\n\nLegendary box acquired 2018.",
    "timestamp": 1760565600
  },
  {
    "username": "jlobo",
    "rating": 7.5,
    "comment": "Audrony",
    "timestamp": 1760306400
  },
  {
    "username": "moonerie",
    "rating": 8.0,
    "comment": "I need more brain power for this but pretty fun time and lovely components.",
    "timestamp": 1760306400
  },
  {
    "username": "Mr Mjeh",
    "rating": 7.5,
    "comment": "Amazing game that offers truly unique and fun gameplay, while still building on Stonemaier's old games as well",
    "timestamp": 1760220000
  },
  {
    "username": "Minic00p",
    "rating": 7.5,
    "comment": "Gorgeous game, multiple paths to victory and variable player powers all combined for a quite good euro/war game.",
    "timestamp": 1760220000
  },
  {
    "username": "gothaw",
    "rating": 8.0,
    "comment": "S",
    "timestamp": 1760220000
  },
  {
    "username": "Astrotron",
    "rating": 8.0,
    "comment": "My initial playthrough was awesome. The gameplay is fun and interesting, and the components are high quality. Looking forward to digging much deeper into this game.",
    "timestamp": 1760047200
  },
  {
    "username": "eldub",
    "rating": 8.0,
    "comment": "What is there to say about Scythe that hasn't already been said? A brilliant efficiency puzzle that, in my opinion, is great at all player counts.",
    "timestamp": 1760047200
  },
  {
    "username": "tokkinho",
    "rating": 8.0,
    "comment": "a fantastic board game. plenty of interaction, quick turns, crunchy decisions and fun optimization. while not being a wargame first, the combat system is among the best i have seen: simple yet with little luck involved. artwork on cards is gorgeous, only the board feels a bit too busy. what makes scythe stand out is its critical distance to war and conquest and how it requires players to reflect on their (un)ethical decisions. it poses question what kind of leader we want to be and what sacrifices we are willing to make on our way to glory. jamey stegmaier's personal touches in the rule book are amazing and make one feel very welcome. thank you.",
    "timestamp": 1759874400
  },
  {
    "username": "DustyRhino",
    "rating": 8.0,
    "comment": "Looks like a unique experience.",
    "timestamp": 1759874400
  },
  {
    "username": "vensy",
    "rating": 8.0,
    "comment": "+ Захватчики из далёких земель\n+ Небесный Гамбит\n+ Восхождение Фенриса\n+ Приключения",
    "timestamp": 1759788000
  },
  {
    "username": "0Kage",
    "rating": 8.3,
    "comment": "5P",
    "timestamp": 1759701600
  },
  {
    "username": "TheGayBert",
    "rating": 8.0,
    "comment": "A heavy game to learn but worth it if you can commit. Every player has their own unique abilities and conditions to help them win the game. I never would have thought a game that thematically mixes Oregon Trail and Titanfall would work, but here we are... it is very unique and appealing.\n\nThere are many different things to consider when trying to win, maintaining loyalty and planning 3 turns ahead feels necessary. Combat can be brutal, so be prepared to make enemies in order to win the game.",
    "timestamp": 1759528800
  },
  {
    "username": "GrandPseudonym",
    "rating": 7.5,
    "comment": "Solo Mode\nGood with 3\nBest with 4\nGood with 5\n~150 Minutes\nHeavyweight\nCompetitive\nEuro\nAmerican\nStrategy\nThematic\nCombat\nWorker Placement\nEngine Building\nArea Control\nEconomy",
    "timestamp": 1759528800
  },
  {
    "username": "Hawksteader",
    "rating": 8.3,
    "comment": "**PAINTED**",
    "timestamp": 1759442400
  },
  {
    "username": "GCZ745",
    "rating": 8.0,
    "comment": "Overall - 8/10\nScythe has a weird way of being intimidating at first, easy and super fun once you get the hang of it, and then a bit dull as you improve and figure out the optimal sequence of moves for the first 6-8 turns. The game is a blast when everyone is new and trying to figure things out together, but if the players have varying skill levels, it can be a bore as everyone sits around waiting for the \"good\" player to execute their perfect sequence of moves and end the game before the rest have even gotten started.\n\nThere's just enough randomness to keep things interesting from one game to the next, but good/experienced players will crush poor/inexperienced players every time; unfortunately, the game is too heavy/long to expect a casual group to improve quickly enough to make for competitive games.\n\nTheme - 2/2\nRules - 1.25/2\nTurn Simplicity - 1.5/2\nFun Factor - 1.5/2\nChallenge and Replayability - 1.75/2",
    "timestamp": 1759269600
  },
  {
    "username": "atlas64gaming",
    "rating": 7.5,
    "comment": "AUGUST 2025: 10TH\nFEBRUARY 2025: 28TH\nAUGUST 2024: 50TH\nFEBRUARY 2024: 85TH\nAUGUST 2023: 74TH",
    "timestamp": 1759096800
  },
  {
    "username": "alanbyrne",
    "rating": 7.8,
    "comment": "- w/ Encounters Expansion",
    "timestamp": 1758924000
  },
  {
    "username": "jecabreradc",
    "rating": 8.0,
    "comment": "With everything including the metal mechs. Rating is with all expansions.",
    "timestamp": 1758751200
  },
  {
    "username": "s-man",
    "rating": 8.0,
    "comment": "Almost ten years after its release still an excellent tableau building and action combination game that remains engaging and challenging. Efficiency is key in everything you do.",
    "timestamp": 1758405600
  },
  {
    "username": "WadeB1977",
    "rating": 8.2,
    "comment": "My favorite game for 5-7 player counts. Action and resource management with a great theme and good solo experience. One of the best games to play with seven players and offers a great evening of engaging game play every game. The Fenris expansions offers a nice storyline and opens up some more gameplay options once unlocked.",
    "timestamp": 1758319200
  },
  {
    "username": "mjhm",
    "rating": 8.0,
    "comment": "in wpg\ngreat game, have played too much now overplayed",
    "timestamp": 1758319200
  },
  {
    "username": "DatDudeTho",
    "rating": 8.0,
    "comment": "Faction and player mat combinations are terribly unbalanced. Combined with starting locations, in any game few players will have a massive starting advantage compared to others. Beautiful production and interesting to learn initially. But the charm falls off once you realize the unbalance issues.",
    "timestamp": 1758232800
  },
  {
    "username": "Beyond2D",
    "rating": 8.4,
    "comment": "You have to love this one if your in to tactical and strategic games",
    "timestamp": 1758146400
  },
  {
    "username": "JonasBang",
    "rating": 8.0,
    "comment": "1-5",
    "timestamp": 1758146400
  },
  {
    "username": "Kbzombie",
    "rating": 8.0,
    "comment": "W/ complete rules compilation and board ext.",
    "timestamp": 1757887200
  },
  {
    "username": "A1v1to",
    "rating": 8.0,
    "comment": "This is a cool game, but asymmetrical starting points and characters can be a bit annoying. Plus, the game board size is massive.\nOther than this, the game is good, and all of us enjoyed playing it.",
    "timestamp": 1757800800
  },
  {
    "username": "Daniel_Enriko",
    "rating": 8.0,
    "comment": "sleeved",
    "timestamp": 1757628000
  },
  {
    "username": "Abysmul",
    "rating": 8.0,
    "comment": "Invaders from Afar & The Wind Gambit.\nBeautiful, thematic, and more importantly such a pleasure to play each time. With the varied setup each game it is always different enough to always wonder what each game will turn into.",
    "timestamp": 1757368800
  },
  {
    "username": "Cereo",
    "rating": 8.4,
    "comment": "Including Rise of Fenris, Invaders from Afar, Encounters",
    "timestamp": 1757282400
  },
  {
    "username": "Fogshaper",
    "rating": 8.0,
    "comment": "This game is fast and complex. There's a ton of interaction, but you're not forced into any of it. There's multiple ways to win the game, each fraction has their own specific ways of playing through the early, mid- and late game.\n\nSome balancing issues prevented this one from beoming a mainstay or something we played a lot more.",
    "timestamp": 1757196000
  },
  {
    "username": "Manzarak",
    "rating": 8.0,
    "comment": "e-R Insert\nMEEPLESTICKERS",
    "timestamp": 1757023200
  },
  {
    "username": "Tom_Sandy",
    "rating": 8.0,
    "comment": "Great even better with the expansions and at full player account.",
    "timestamp": 1756764000
  },
  {
    "username": "GreatRoy",
    "rating": 8.0,
    "comment": "Hours and hours of fun strategic and cold war",
    "timestamp": 1756764000
  },
  {
    "username": "marinexx",
    "rating": 8.0,
    "comment": "Why can't we buy the promos anywhere for a normal prise? Why didn't the legendary box come will all the promos when the box (ONLY) comes to half price of the game itsef? Questions, questions...\n\nDowntime is also a killer, especially if there is a fight. Higher player count than 3 is absolutely not reccomended! I need to try 4 but 5+ NEVER AGAIN!",
    "timestamp": 1756677600
  },
  {
    "username": "dragonilo",
    "rating": 8.0,
    "comment": "I really like it but a bit heavy for everyone I try to get to play it.",
    "timestamp": 1756504800
  },
  {
    "username": "AirikH",
    "rating": 8.1,
    "comment": "Грали десятки незареєстрованих ігор",
    "timestamp": 1756418400
  },
  {
    "username": "lostfanatic6",
    "rating": 8.0,
    "comment": "*PERMANENT SPOT IN MY COLLECTION*\n\n\nThere are so many things to like: the theme, the art, the mechanics, the boards with the pieces intuitively moving, the interaction with players, the engine building. There is SO much to love!\n\nAfter every single game I find myself thinking about it for the next day or two, debating how I could have been more efficient or how I could have played differently. My absolutely favorite at this time.\n\n\n***This may have dropped out of my favorite spot, but it is still one of my favorites. Incredible game!",
    "timestamp": 1756072800
  },
  {
    "username": "DLad",
    "rating": 8.0,
    "comment": "Player:7",
    "timestamp": 1755900000
  },
  {
    "username": "Lionalth",
    "rating": 7.8,
    "comment": "Core + Auge de Fenris + Invasores de tierras lejanas + Encuentros + Tablero Modular.\nMuchisima rejugabilidad, un euro de control de areas y guerra fria.",
    "timestamp": 1755727200
  },
  {
    "username": "Marroway",
    "rating": 8.0,
    "comment": "One of my first board games and one I searched high and low to bling as much as possible, and it does not disappoint! The fact that it looks like a war game but is far from that is great! So many different ways to play and so much to explore with all of the expansions. Definitely a master piece",
    "timestamp": 1755727200
  },
  {
    "username": "hobbitg",
    "rating": 8.0,
    "comment": "2-5 Players\nBest = 4",
    "timestamp": 1755727200
  },
  {
    "username": "skent22",
    "rating": 8.0,
    "comment": "Sleeved",
    "timestamp": 1755640800
  },
  {
    "username": "duanewulf",
    "rating": 7.8,
    "comment": "Expansions owned:\nScythe: Invaders from Afar\nScythe: Promo Pack #1 – Encounter Cards 29-32\nScythe: Promo Pack #2 – Encounter Cards 33-36\nScythe: Promo Pack #3 – Objective Cards 24-27\nScythe: Promo Pack #4 – Factory Cards 13-18\nScythe: Bonus Promo Pack – 6 Promo Encounter Cards numbers 37-42\nScythe: The Wind Gambit\nScythe: The Rise of Fenris\nScythe: Encounters\nScythe: Modular Board",
    "timestamp": 1755554400
  },
  {
    "username": "BrunoDeVries",
    "rating": 7.5,
    "comment": "A great euro game standing on the shoulders of several other grand euro games - Terra Mystica seems an obvious inspritation. That said; This isn't the thematic ameritrash/euro hybrid some hope it would be. It's a through and through euro engine building logistics puzzle with a bit of conflict and thematic encounters. There are not much euro games as thematic as this one, but it's resource optimization at heart nonetheless.\n\nPlayed it around 15 times now I guess, and my appreciation of the game went down and up again. There's enough to explore to play it many more times over. One of the drawbacks I saw that it needed the right crowd... Well, that crowd proved to be much broader than I initially thought. This seems a keeper in my collection.\n\nOh yeah, it's darn pretty also.",
    "timestamp": 1755468000
  },
  {
    "username": "Var_Kenarah",
    "rating": 7.5,
    "comment": "R",
    "timestamp": 1755381600
  },
  {
    "username": "SirSalzburg",
    "rating": 8.0,
    "comment": "sleeved",
    "timestamp": 1755295200
  },
  {
    "username": "solo59",
    "rating": 8.0,
    "comment": "Fantastic game. I just regret how much factions and mats are unbalanced (good luck to win with Nordic).\nsecured",
    "timestamp": 1755295200
  },
  {
    "username": "YoLYcmqZ",
    "rating": 8.5,
    "comment": "Thoughts: A brilliant engine builder hidden in a war game. Nothing else quite like it and we absolutely love it—bought everything for a reason. Mostly play at 2 players and it's still great. Recently finished Rise of Fenris which provided a new twist. Invaders from Afar and Wind Gambit add variety when we want to mix things up.\n\nTag(s): Engine Builder, Area Control, Asymmetric\nBest Player Count: 1-5, {4}\nRating: 8.5, +0.0\nOwn: Physical, Digital\n+ Scythe: Invaders from Afar\n+ Scythe: The Wind Gambit\n+ Scythe: The Rise of Fenris (for trade)\n+ Scythe: Encounters (for trade)\n+ Scythe: Modular Board (for trade)\n+ Metal Coins / Deluxe Resources\n+ Promo Packs",
    "timestamp": 1762653060
  },
  {
    "username": "K0U30SH",
    "rating": 8.5,
    "comment": "Best with 4 player (3 or 5 are oK too)",
    "timestamp": 1762383600
  },
  {
    "username": "front_ed",
    "rating": 9.0,
    "comment": "Engine Building, Area Control: Wargame, Economic",
    "timestamp": 1762383600
  },
  {
    "username": "ditterio",
    "rating": 9.0,
    "comment": "SCYTHE (1-5 players)\nSCYTHE: RISE OF FENRIS (1-5 players)\nSCYTHE: ENCOUNTERS (1-5 players)\n\nFrequently Overlooked Rules: https://boardgamegeek.com/filepage/164974/scythe-frequently-...\n\nRules summary and reference: https://boardgamegeek.com/filepage/135174/universal-headesot...\n\nStrategy guide: https://boardgamegeek.com/thread/3138719/scythe-beginners-st...",
    "timestamp": 1762297200
  },
  {
    "username": "ChaucerThibault",
    "rating": 9.0,
    "comment": "Printed copy and digital version on Steam",
    "timestamp": 1762210800
  },
  {
    "username": "THE_GODFATHER",
    "rating": 8.5,
    "comment": "X",
    "timestamp": 1761951600
  },
  {
    "username": "Seefeder",
    "rating": 9.0,
    "comment": "Digital",
    "timestamp": 1761951600
  },
  {
    "username": "NotBrandonJaspers",
    "rating": 9.0,
    "comment": "Have metal coin upgrade\n[Digital]\n?",
    "timestamp": 1761865200
  },
  {
    "username": "andkunz",
    "rating": 9.0,
    "comment": "best area-control and ressourcen management game without dices.",
    "timestamp": 1761778800
  },
  {
    "username": "Alejandrosh",
    "rating": 9.2,
    "comment": "Euro estratégico, que luce en mesa genial. Solitario muy bueno y escala fenomenal a dos, tres y cuatro jugadores.",
    "timestamp": 1761778800
  },
  {
    "username": "BrutusA",
    "rating": 9.0,
    "comment": "Aesthetic: 2\nMechanism: 2\nInvolvement/length/fluid: 2\nReplayability: 2\nOther: 1",
    "timestamp": 1761519600
  },
  {
    "username": "Freydey",
    "rating": 9.0,
    "comment": "1-5 Versus",
    "timestamp": 1761343200
  },
  {
    "username": "yodadood",
    "rating": 9.1,
    "comment": "Expansions & Upgrades:\n- Painted Minis\n- Invaders from Afar\n- The Wind Gambit\n- Promo Cards & Dials\n- Upgraded Resources & Tokens\n- Metal Coins\n- Extended Board\n- The Rise of Fenris\n- Encounters\n- Modular Board\n- Legendary Box",
    "timestamp": 1760911200
  },
  {
    "username": "magic_erwt",
    "rating": 8.5,
    "comment": "Special Edition Content\n● Encounter cards (1-28) + (29-36)\n● Factory cards (1-12) + (13-18)\n● Objective cards (1-23) + (24-27)\n● Power dials (Nordic/Polania/Crimean/Rusviet/Saxony)\n\nExpansions\n● Invaders from Afar\n● The Wind Gambit\n● The Rise of Fenris \n\nAdd-ons\n● Encounter cards (37-42)\n● Encounter cards promo pack (43-74)\n● Metal coins (80: 25x1$, 15x2$, 15x3$, 15x5$, 15x10$, 10x20$)\n● Special Metal coins (15x5$, 15x10$)\n● Realistic resources (4x20)\n● Power dials (Albion/Togawa)\n● Wooden tokens (11 encounters, 4 flags, 4 traps)\n● Modular board",
    "timestamp": 1760911200
  },
  {
    "username": "Stonlim",
    "rating": 8.5,
    "comment": "1-5 jogadores - 120 minutos",
    "timestamp": 1760824800
  },
  {
    "username": "Mster_P",
    "rating": 8.5,
    "comment": "Definitely complex that's for sure; but hands down my favorite game! I really love it and enjoy it. Building,collecting, fighting, all great times playing this game",
    "timestamp": 1760479200
  },
  {
    "username": "GusiX",
    "rating": 9.0,
    "comment": "- Base -",
    "timestamp": 1760306400
  },
  {
    "username": "orangecat17",
    "rating": 8.5,
    "comment": "One of the best-looking games on the table, especially with a blinged-out copy and painted minis. I've gone on a journey with Scythe, from being disappointed/dissatisfied with what it isn't, to genuinely enjoying and appreciating it for what it is. In the midst of endless medium-heavy Euro releases, it still manages to stand out as a unique experience. One of my favorite board game \"worlds\" to spend time in.",
    "timestamp": 1760133600
  },
  {
    "username": "GWondowski",
    "rating": 8.5,
    "comment": "May 2025",
    "timestamp": 1760047200
  },
  {
    "username": "tinymeteor",
    "rating": 8.5,
    "comment": "9279/11320",
    "timestamp": 1759960800
  },
  {
    "username": "NithGamer",
    "rating": 9.0,
    "comment": "Bought it from WoB including extended board, metal coins and the first expansion. Got it 3 jan 2017. Really nice game that I would want to play more. Went down really well at work.",
    "timestamp": 1759960800
  },
  {
    "username": "Nakira",
    "rating": 9.0,
    "comment": "Scythe – A game that looks like war but plays like finely tuned engine-building art. Behind its stunning alternate-history visuals — dieselpunk mechs trudging through misty farmlands — lies a deeply strategic Eurogame about resource management, optimization, and careful planning. You’ll expand territories, produce goods, and upgrade actions, all while keeping an eye on your neighbors and their imposing metal beasts. Combat exists, but it’s more a threat than a focus — deterrence through diesel. It’s sleek, smart, and endlessly satisfying, with a table presence that turns heads and gameplay that rewards precision over aggression. Scythe proves that sometimes, the biggest weapon is a well-oiled economy.",
    "timestamp": 1759874400
  },
  {
    "username": "fervera28",
    "rating": 9.0,
    "comment": "It may not be a pure 4x war game, but i love resource management games and a little bit of skirmish so I do enjoy a lot this euro cold war simulator.",
    "timestamp": 1759701600
  },
  {
    "username": "Darknlves",
    "rating": 9.0,
    "comment": "I'm impressed! 10 years later, trying it solo vs 2 oponents. This game is really good. Super easy to setup and get into despite the weight. I need to play it more, but for now, wow.\n\nUpdate: it's starting to click. This game is amazing, I'm not giving it a full 10 only for the reason that the automa is a bit to hard to manage, just a bit. Still, loving this game, one of my favorites.",
    "timestamp": 1759701600
  },
  {
    "username": "FredrikEspedal",
    "rating": 9.0,
    "comment": "I think this game is always fun to bring to the table, and I love the balance between making a long term strategy and doing tactical choices. Going through the engine and improving it over the course of the game is really satisfying.\nMy only issue is that there is not much incentive to initiating combat and this reduces the player interaction a lot.",
    "timestamp": 1759701600
  },
  {
    "username": "Edu207",
    "rating": 9.0,
    "comment": "Its a wonderful game, with cool mechanics and an beautiful art. But the rulebook are too too too too boring and long. The gameplay is really simple, but the rulebook make the first game a nightmare.",
    "timestamp": 1759701600
  },
  {
    "username": "DesignXception",
    "rating": 9.0,
    "comment": "includes all expansions.",
    "timestamp": 1759528800
  },
  {
    "username": "alllright",
    "rating": 9.0,
    "comment": "Talking about extraordinary games...",
    "timestamp": 1759442400
  },
  {
    "username": "Adripg3",
    "rating": 8.5,
    "comment": "2025",
    "timestamp": 1759356000
  },
  {
    "username": "Dexpert",
    "rating": 9.0,
    "comment": "Our group uses this as a go to when we can't all agree on a title for our game night!",
    "timestamp": 1759356000
  },
  {
    "username": "Dozwa2902",
    "rating": 9.0,
    "comment": "played, digital",
    "timestamp": 1759096800
  },
  {
    "username": "Kasitka",
    "rating": 9.0,
    "comment": "It's hard to understand at the beginning but amazing gameplay",
    "timestamp": 1759010400
  },
  {
    "username": "gianlucadario87",
    "rating": 9.0,
    "comment": "B_A4",
    "timestamp": 1758751200
  },
  {
    "username": "stevejuggler",
    "rating": 9.4,
    "comment": "Andy has this",
    "timestamp": 1758492000
  },
  {
    "username": "ahmadreza76",
    "rating": 9.0,
    "comment": "54: 57x89\n42: 44x68\n50: 70x110",
    "timestamp": 1758405600
  },
  {
    "username": "SLYD3V1L",
    "rating": 8.5,
    "comment": "Fully sleeved, mint condition. All in sale/trade only (excluding playmat), I will not separate expansions/accessoires!",
    "timestamp": 1758232800
  },
  {
    "username": "pcopeland",
    "rating": 9.0,
    "comment": "",
    "timestamp": 1758232800
  },
  {
    "username": "kwhite1",
    "rating": 9.0,
    "comment": "P",
    "timestamp": 1758060000
  },
  {
    "username": "kitchendon",
    "rating": 9.0,
    "comment": "Amazing art that's dripping with atmosphere. Interesting decisions to make each turn. Giant battle-mechs - but you're not constantly fighting. The Solo mode flows smoothly. I'd definitely like to try this with more players.\n\nUpdate after 35 plays:\n\nI brought this out and played solo through the Fenris campaign. It'd been a year and a half since my last game. I had so much fun! I remember now why I was so into this game and grabbed up every expansion and upgrade. \n\nThe Legendary Box is probably one of the reasons It had sat un-played for so long. It's just so...Much. Mine was made worse by a custom insert that I didn't like. I 3D printed a new one as I played through the campaign and it's much easier to use now.",
    "timestamp": 1757887200
  },
  {
    "username": "blaklyte",
    "rating": 8.5,
    "comment": "Expansion:\n- Invaders from Afar\n- The Wind Gambit\n- The Rise of Fenris\n\n\nAdd-On:\n- Metal Coin\n- Realistic Resource Tokens",
    "timestamp": 1757887200
  },
  {
    "username": "AlPacino11",
    "rating": 8.9,
    "comment": "Excellent choices in a quick game!",
    "timestamp": 1757887200
  },
  {
    "username": "Meadbeard",
    "rating": 8.6,
    "comment": "I came late to Scythe, in part because I took Paul's review at Shut Up and Sit Down at face value.\n\nMy tastes often align with SU&SD. It's acceptable to be wrong. No one is infallible.\n\nPaul was wrong, even to the extent that I think he completely misrepresented this game.\n\nI love Inis and Concordia too. I'm pretty sure I can find space on my shelf and at my table for those and Scythe.\n\nMechanically, it develops much of the elegance of \"Eclipse\" (2011) and takes it much farther in a cleaner system (which is an achievement).\n\nThe win conditions and combat system are excellent. The fact that Scythe is decidedly not 4x was an outstanding design choice regarding scope.\n\nAlso, the only way to characterize movement as \"plodding\" is not to understand how it works.\n\nSorry, Paul: love you, but sometimes you have to take your licks.\n\nFinally, Scythe has an excellent rulebook, and you can learn 90% of what you need to know from the two-sided rules reference broadsheet. Read that first, and the rules are a breeze. That was surprising for a game that has this much depth.",
    "timestamp": 1757541600
  },
  {
    "username": "Wendyjo73",
    "rating": 9.0,
    "comment": "Initial rating 9. May improve with expansions when we get them. I’ve heard great things about Rise of Fenris.\nI love this game. Have only played 3 times, but I really like it! It has quickly jumped to my top 10 list!\n\nUpdate: After a couple more plays, it’s a 10 for me now. I love this game!\n\nAnother Update: After completing Rise of Fenris, this game moved into my top 3. I would never turn down a game of Scythe. So satisfying!",
    "timestamp": 1757455200
  },
  {
    "username": "bbolch",
    "rating": 8.5,
    "comment": "Scythe blends Euro-style strategy with Ameritrash elements to create one of the most dynamic and engaging modern board games. Its outstanding components paired with consistently meaningful choices deliver a unique, strategic experience every time it hits the table.",
    "timestamp": 1757455200
  },
  {
    "username": "dennisbowe",
    "rating": 8.8,
    "comment": "The first play I was surprised I didn’t like it more, it was good but it was missing something. However, after about 10+ plays, I realize how to better get the engine up and running and I absolutely love the entire game. I find myself on the edge of my seat and despite some negative reviews regarding the combat rules, I find threat of combat every turn (into the mid game) is so powerful that it is better than fighting. Brilliant.",
    "timestamp": 1757282400
  },
  {
    "username": "GeorgeMeade",
    "rating": 9.2,
    "comment": "This game offers a flawless play experience, whilst also providing enough asymmetry to allow for different approaches and strategies in game. Although some may argue the gameplay to be stale and lacking player interaction, I've found it offers one of the most intriguing mind crunches I've ever found in a board game.",
    "timestamp": 1757282400
  },
  {
    "username": "ice3ice3ice3",
    "rating": 8.9,
    "comment": "Great optimization game - also a good app",
    "timestamp": 1757196000
  },
  {
    "username": "d_a_d_o",
    "rating": 8.5,
    "comment": "This is my epic game of choice. Love everything about it.\nSLEEVED + METAL COINS",
    "timestamp": 1757023200
  },
  {
    "username": "LudicrousBeeswax",
    "rating": 9.0,
    "comment": "I love the world and art here. The gameplay is amazing, but it definitely gets a boost from the presentation. I like it when there are enough curveballs to keep it from becoming the same efficiency puzzle time after time. Rise of Fenris is probably the best way to play",
    "timestamp": 1756764000
  },
  {
    "username": "Aition",
    "rating": 9.0,
    "comment": "Unieke combinatie van ‘Europese stijl’ (economie, grondstoffen, …) en ‘Amerikaanse stijl’ (oorlog, miniaturen, …). De spelers hebben asymmetrische eigenschappen die ze zo efficiënt mogelijk moeten benutten. Die asymmetrie maakt het spel een beetje ongebalanceerd. Het artwork is prachtig.",
    "timestamp": 1756677600
  },
  {
    "username": "newset",
    "rating": 9.0,
    "comment": "I really like Scythe. When I first encountered it I was drawn in by the art and production, but was hesitant about what at first glance looked to be a combat focused game. Instead, I was delighted to find the focus was much more on generating resources, building up a production engine and expanding out across the map.\n\nI like the slow build up of the game, from having just a couple of workers hanging around home base at the start, to slowly get out that first mech, then before you know it there's more mechs and buildings and you're out exploring the other side of the map.\n\nAnd although the combat still doesn't excite me, I do kinda like that's there's not that much of it but instead an interesting tension of potential conflict that runs throughout much of the game.",
    "timestamp": 1756677600
  },
  {
    "username": "les_",
    "rating": 9.0,
    "comment": "Reminder: The faction mat/player mat combinations Rusviet/Industrial and Crimea/Patriotic are banned.",
    "timestamp": 1756591200
  },
  {
    "username": "OneTrueRowan",
    "rating": 9.0,
    "comment": "Scythe is the game that me and my housemates end up playing the most often - almost all of our long deliberations about what to play result in a game of Scythe, even if we just played it the day before. Overall, a great time.",
    "timestamp": 1756332000
  },
  {
    "username": "Thaemin",
    "rating": 9.0,
    "comment": "A beautiful mix of Risk with sci-fi elements which drew me in. A little slow to understand the nuances initially but very enjoyable since.",
    "timestamp": 1755900000
  },
  {
    "username": "Safear_rj",
    "rating": 9.0,
    "comment": "One of my favorite game. I've played a lot of game with and I still want to play again and again.",
    "timestamp": 1755900000
  },
  {
    "username": "Sr Kiwi",
    "rating": 8.8,
    "comment": "Con minis pintadas\n\n+ Tapete de neopreno\n\n+ Inserto Feldherr\n\n+ Recursos realísticos\n\n+ Pack Promo 1 (KS): Incluye las cartas de encuentro 29-32\n\n+ Pack Promo 2 (KS): Incluye las cartas de encuentro 33-36\n\n+ Pack Promo 3 (KS): Incluye las cartas de objetivo 24-27\n\n+ Pack Promo 4 (KS): Incluye las cartas de factoría 13-18\n\n+ Pack Promo 5 (KS): 3 diales de poder para facciones juego base\n\n+ Promo 6, 7, 11-14: Cartas de encuentro 37-42\n\n+ Promo 9: 7x Monedas metálicas 50$\n\n+ Promo 10: 15x Monedas metálicas 2$\n\n+ Promo 15: 15x Monedas metálicas 10$\n\n+ Promo 16: 25x Monedas metálicas 1$\n\n+ Promo 17: 15x Monedas metálicas 5$",
    "timestamp": 1755640800
  },
  {
    "username": "TOSBoardgames",
    "rating": 8.5,
    "comment": "One of the very best games out there in my book. Everything is top nodge for me!",
    "timestamp": 1755640800
  },
  {
    "username": "Naaopy",
    "rating": 9.0,
    "comment": "I feel bullied by the game every time. So much FOMO lol",
    "timestamp": 1755554400
  },
  {
    "username": "JayTi",
    "rating": 9.0,
    "comment": "Plays: + App",
    "timestamp": 1755468000
  },
  {
    "username": "ClintAchilles",
    "rating": 10.0,
    "comment": "I've never sat down to play this and not have a good time. It's very satisfying moving those little wooden pieces out of your board and putting them somewhere else, either on the game board or into another slot. And don't underestimate the appeal of those exploration cards with their choices. You kind of have to do a little bit of everything to win, and also manage those tracks to maximize your points. The push and pull of when to close out the game is fun tension. The production quality certainly helps. It's a modern classic.",
    "timestamp": 1762383600
  },
  {
    "username": "GamechangerWithHoney",
    "rating": 9.6,
    "comment": "Super smooth gameplay. Easy rules and streamlined play. It's a modern classic. Love the production of it. Over the time I bought absolutely everything interesting for it. Invaders from afar, Wind Gambit, Rise of Fenris, Board extension, modular board, legendary box, insert, Metal coins, Realistic ressources, Factory mini, upgraded encounter tokens, painted minis, upgraded action Markers. Surely it was an overkill but I'm not sure wether someone else has such a perfect version of scythe as I do '",
    "timestamp": 1762038000
  },
  {
    "username": "rinanagashima",
    "rating": 10.0,
    "comment": "A more complex game - you need the right people to play it with. Very strategy heavy and complex bc there are so many diff ways to win.",
    "timestamp": 1761519600
  },
  {
    "username": "Mercer505",
    "rating": 10.0,
    "comment": "- Legendary Box\n- Foldspace insert\n- Painted minis\n- Custom player markers\n- Metal coins\n- Custom board minis\n- Official playmat\n- Meeple source characters meeples",
    "timestamp": 1761519600
  },
  {
    "username": "Awesomiser",
    "rating": 9.5,
    "comment": "When I first dipped my toe into the bespoke board game world I played some amazing games. It wasn’t until I played this game that I realised that it was THIS I’d been searching for",
    "timestamp": 1761256800
  },
  {
    "username": "DMLeo",
    "rating": 10.0,
    "comment": "Definition of an extremely well thought board game.",
    "timestamp": 1761256800
  },
  {
    "username": "Albus123",
    "rating": 10.0,
    "comment": "Solo",
    "timestamp": 1761084000
  },
  {
    "username": "wheesh",
    "rating": 10.0,
    "comment": "8.1 3.45/5\n115mins\n1-5\n\nPlayers conquer territory, enlist new recruits, reap resources, gain villagers, build structures, and activate monstrous mechs.\nminis\nengine-building\nhidden goal\ndirect conflict /no player elimination\nencounter cards\nstreamlined action-selection mechanism/ upgrade actions",
    "timestamp": 1761084000
  },
  {
    "username": "Ajohnny101",
    "rating": 10.0,
    "comment": "While the game doesn't have as much combat as you think it might, the way the threat of combat is ever present really sells the imminent war vibe the setting evokes. Epic art, mini's and theme really sell the game, and the efficiency puzzle that is the game is fun and engaging. This is the game that has my favorite non-dice related combat mechanisms.",
    "timestamp": 1760911200
  },
  {
    "username": "Neysmeey",
    "rating": 10.0,
    "comment": "▪Scythe: Najeźdźcy z Dalekich Krain\n▪Scythe: Fenris Powstaje\n▪Scythe: Modularna Plansza\n▪Scythe:Karty Spotkań 29-32\n▪Scythe: Karty Spotkań 33-36\n▪Scythe: Karty Celów 24-27\n▪Scythe: Karty Fabryki 13-18\n\n▪realistyczne surowce\n▪drewniane znaczniki spotkań\n▪metalowe monety (1$, 2$, 3$, 5$, 10$, 20$, 50$)\n▪powiększone piony frakcji\n▪drewniany insert",
    "timestamp": 1760824800
  },
  {
    "username": "fazermozg",
    "rating": 9.8,
    "comment": "+",
    "timestamp": 1760652000
  },
  {
    "username": "TiLLi_Guse",
    "rating": 10.0,
    "comment": "Alongside Ark Nova, this shares our number one spot. It´s the game you could wake me up in the middle of the night for an Ißd start plying right away. I love the factions and the versatility. It´s always a joy to play whether solo, with two, three, or four players.",
    "timestamp": 1760652000
  },
  {
    "username": "Bateyes",
    "rating": 10.0,
    "comment": "Ich habe:\n- Basisspiel.\n- Invasoren aus der Ferne (Erweiterung).\n- Aufstieg der Fenris (Erweiterung).\n- Kolosse der Lüfte (Erweiterung).\n- Modulares Board (Erweiterung).\n- Begegnungen (kleine Erweiterung).\n- Promo-Kartenpacks 1-4, 6, Bonus 6, 7, 11-14 (Promo), mit (ALLES NACHSCHAUEN!!):\n--- Encounter Cards 29-42.\n--- Objective Cards 24-27.\n--- Factory Cards 13-18.\n- Promopack 5: Basisspiel: Fraktionen fehlende Power-Räder (Addon).\n- Promopack 8: Invasoren aus der Ferne: Fraktionen Power-Räder (Addon).\n- Promopack 9: Metallmünzen $50 (Addon) (SCHAUEN WIE VIELE PACKS!).\n- Promopack 10: Metallmünzen $2 Albion (Addon).\n- 2x Promopack 15: Metallmünzen $10 Nordisch (Blau) (Addon).\n- 2x Promopack 17: Metallmünzen $5 Rusviet (Rot) (Addon)\n- Metallmünzen (Set) (Addon) (SCHAUEN WIE VIELE PACKS!).\n- Board Erweiterung (kleine Erweiterung).\n- Legendary Box (Addon).\n- Realistische Ressourcen (Addon).\n- 4x Set Metall-Mechs (1x in Box: Scythe Legendary) (Addon).\n--- Silikonringe für Metall-Mechs, jeweils 4 in den 7 Fraktionsfarben (eigentlich 2x vorhanden, aber bei der ersten Lieferung fehlt(e) noch ein roter Ring!) (Box: Scythe Legendary) (Addon).\n- Metallmünzen Scythe & Expeditions (Set) (Box: Scythe Legendary) (Addon).\n- 2x Metallmünzen Scythe & Expeditions (Lila $5) (Box: Scythe Legendary) (Addon).\n- 1x 2 Mech-Würfel aus \"Aufstieg der Fenris\" (Box: Scythe Legendary) (Addon).\n- Scythe-Spielmatte (Playmat) (Addon).\n\nEs fehlen:\n- Promopacks 16-17 (jeweils mit Sonder-Metallmünzen) (Addon).\n\nSchauen ob da!!!:\n- Automata Deck (kleine Erweiterung).\n- Große Aktionstoken (Addon).",
    "timestamp": 1760220000
  },
  {
    "username": "larrydurbin",
    "rating": 10.0,
    "comment": "The best from Jamie Stegmier. Scythe has climbed up my top 100 every year. A perfect example of why I play board games. The more I play it the more I enjoy it. The art is the best in boardgaming and explodes the immersive experience. The table presence is top tier. We love the 32 encounter card expansion pack. It's such an inexpensive way to make the game deeper. We have Wind Gambit, Fenris, and Invaders From Afar. We play it exclusively at the 2p count and we love it! Stonemeier games are always in print and that's good for the board gaming community and why they're our favorite publisher. We love the engine building that happens on your player mat and racing for area control before the game ends. The different civilisations are well balanced and creative. After over 20 plays , and many teaches , Scythe is reaching iconic status for us and just keeps on giving that original excitement! My #6 game of all-time and game of the year from 2016 , and it's not even close. So much beautiful boardgaming to enjoy here , its difficult to describe it all.",
    "timestamp": 1760220000
  },
  {
    "username": "fletch49er",
    "rating": 9.5,
    "comment": "I've finally got my hand on a copy an I've finally played Scythe. It is everything I thought it would be.",
    "timestamp": 1759615200
  },
  {
    "username": "hockeyjones",
    "rating": 9.5,
    "comment": "26\n\nPlayed in 2023",
    "timestamp": 1759615200
  },
  {
    "username": "Ddyraw",
    "rating": 10.0,
    "comment": "One of the greatest games of all time, strategic, smooth, and feels evergreen to me. Works with family, never played it with the game group, but I know it would play well.",
    "timestamp": 1759356000
  },
  {
    "username": "Lendengold",
    "rating": 10.0,
    "comment": "Gereon\n(geschenkt von Anne 28.02.2021)",
    "timestamp": 1759356000
  },
  {
    "username": "angstyzebra",
    "rating": 10.0,
    "comment": "Engine Builder/Area Control\n\nExpansion:\nInvaders from afar\nCoins\nBoard expansion\nEncounters",
    "timestamp": 1758578400
  },
  {
    "username": "Abelardo_Blue",
    "rating": 10.0,
    "comment": "You like alternate history? You like plans within plans within plans? You like WW1?\nYou like... Games? This is it.",
    "timestamp": 1758319200
  },
  {
    "username": "CaskA1981",
    "rating": 10.0,
    "comment": "Sleeved\nInsert\n\nMy number one at the moment.",
    "timestamp": 1757541600
  },
  {
    "username": "Sinashakiba",
    "rating": 10.0,
    "comment": "Masterpiece",
    "timestamp": 1757455200
  },
  {
    "username": "KS313",
    "rating": 9.5,
    "comment": "This really is a brilliant game, which is NOT a war game. It combines resources, dudes on a map, and your own board development with some asymmetrical abilities to create a lovely strategy experience. The multitude of different ways you can gain stars makes each game different, and end game targeting quite open.\n\nThe combat is minimal, unless you want to attack a lot, with winning a combat giving you a victory star (maximum two per player) of 6 stars to finish the game, but also being detrimental to you in loss of power and possibly popularity (arguably the most important thing in the game). This balancing act is genius as a mechanism.\n\nGet to 6 stars and the game ends (unless you're playing an expansion) but then you all add up points (euro style) and there's every chance the player who triggered the end might not win.",
    "timestamp": 1757196000
  },
  {
    "username": "mrange",
    "rating": 10.0,
    "comment": "One of my favorite games of all times. Like with Blood Rage I didn't think I like it because it seems like there's lot of conflicts in it (there's not a lot but usually at least conflict per game). I think this was my first serious engine building game and it a long time to understand Scythe but once I did I really enjoyed it.",
    "timestamp": 1757109600
  },
  {
    "username": "Baruu_",
    "rating": 10.0,
    "comment": "Great game. Probably my favorite of all time. I enjoy all player count and the campaign feels very great too.",
    "timestamp": 1756936800
  },
  {
    "username": "tugdad93",
    "rating": 10.0,
    "comment": "My all time favorite strategy game! In fact, this is the only game that I rate a \"10\" without any expansion content. The expansions add variety (in the case of Invaders from Afar), novelty (in the case of The Rise of Fenris), and some flexibility/speeding up the early game for new players (in the case of The Wind Gambit), but don't improve the game in the least, in my opinion.\n\nI even completely pimped this one out with metal coins and realistic resources from Stonemaier Games, wooden encounter tokens, flags and traps (for Invaders from Afar) and action selection markers from MeepleSource. I have gotten every promo item available from Stonemaier Games (available at MeepleSource or Top Shelf Gamer), as well, and just recently acquired a custom copy with hand-painted mechs/characters and a Smonex wooden organizer!!! (https://www.etsy.com/listing/761775312/scythe-board-game-org...)\nThe collection is now complete",
    "timestamp": 1756850400
  },
  {
    "username": "DoomBoyHD",
    "rating": 10.0,
    "comment": "Love this game.",
    "timestamp": 1756850400
  },
  {
    "username": "aaronrojo",
    "rating": 10.0,
    "comment": "Good game!!!",
    "timestamp": 1756677600
  },
  {
    "username": "jimmyhuha",
    "rating": 10.0,
    "comment": "Keep: J, R, JJ",
    "timestamp": 1756677600
  },
  {
    "username": "John163",
    "rating": 10.0,
    "comment": "Legendary box, realistic resources. From meeplesource: upgraded action markers, cloth faction bags, faction selection markers, encounter tokens.",
    "timestamp": 1756591200
  },
  {
    "username": "Nightdream",
    "rating": 9.6,
    "comment": "#pocztaplanszówkowa",
    "timestamp": 1756332000
  },
  {
    "username": "Mark0_KaiserRitt",
    "rating": 10.0,
    "comment": "One of the best Engine Builders",
    "timestamp": 1755640800
  },
  {
    "username": "DicePilgrim",
    "rating": 10.0,
    "comment": "Early games can feel like there’s too much going on, but once you understand the flow, the mix of engine building and map control really shines.\n\nThe choices you make stick with you. I’ve rushed upgrades only to leave myself too exposed on the board, and those decisions come back to haunt me. The different factions and player mats bring a lot of variety, and even after several plays I still feel like I’ve only scratched the surface.",
    "timestamp": 1755122400
  },
  {
    "username": "Secondguess",
    "rating": 10.0,
    "comment": "1-7 Player\nCompetitive\n120 mins",
    "timestamp": 1754863200
  },
  {
    "username": "pampam121",
    "rating": 10.0,
    "comment": "1-7 fő + 7 kieg",
    "timestamp": 1754517600
  },
  {
    "username": "jangopool",
    "rating": 10.0,
    "comment": "Love this game - combination of Risk and Catan - probably my most favorite game of all time.",
    "timestamp": 1754431200
  },
  {
    "username": "dalembertian",
    "rating": 10.0,
    "comment": "I'm coming to the conclusion that all Jamey Stegmeier games feel super tight, like in Viticulture. But in both cases, still very satisfying: every turn you have a good action to play, with many options towards victory, and when you manage to combine good combos, it feels awesome. Very smart way to combine the different possible actions, and important to notice that it's NOT about war so much, as the (really beautful) art might imply. Also, there's a lot of humour in the game, between the lines. Remark: there's a virtually unknown game (published by deceased TMG) that's a \"mini Schythe\": Crusaders, Thy Will Be done. Check it out for a simpler, faster and yet very satisfying \"version\" of Scythe.",
    "timestamp": 1753999200
  },
  {
    "username": "JayMcDonald",
    "rating": 10.0,
    "comment": "Super fun, lovely art and very thematic. Engine building to the max.",
    "timestamp": 1753999200
  },
  {
    "username": "BrandonTheodore",
    "rating": 9.5,
    "comment": "I have only played this game with my wife so far. A couple of plays in and we love it. We use the modular board to better serve the 2 player experience. Just yesterday I went and picked up Invaders From Afar and The Wind Gambit.\n\nEdit: Played with 5 players and it is also awesome!",
    "timestamp": 1753826400
  },
  {
    "username": "Zortac88",
    "rating": 10.0,
    "comment": "+Legendary box\n+Metal coins\n\nThis is a perfect game that delivers exactly what it promises. The components are top quality, gameplay is high tension, mechanics are area control and action efficiency puzzle. The only problem is finding time to play.",
    "timestamp": 1753653600
  },
  {
    "username": "Robman",
    "rating": 10.0,
    "comment": "Excellent condition. Cards sleeved. Miniatures from core game, Invaders from Afar, and Wind Gambit are painted and based. Miniatures from Rise of Fenris are unpainted. Everything stored in the Broken Token Legendary wooden insert inside the Scythe: Legendary box. Includes...\n\n- Scythe: Invaders from Afar\n- Scythe: Wind Gambit\n- Scythe: Rise of Fenris\n- Scythe: Realistic Resource Tokens\n- Scythe: Encounter and Expansion Tokens\n- Scythe: Large Action Tokens\n- Scythe: Promo Pack #1 - Encounter Cards 29-32\n- Scythe: Promo Pack #2 - Encounter Cards 33-36\n- Scythe: Promo Pack #3 - Objective Cards 24-27\n- Scythe: Promo Pack #4 - Factory Cards 13-18\n- Scythe: Promo Pack #5 - Original Faction Power Dials\n- Scythe: Promo Pack #6 - Encounter Card 37\n- Scythe: Promo Pack #7 - Encounter Card 38\n- Scythe: Promo Pack #8 - Invaders from Afar Power Dials\n- Scythe: Promo Pack #9 - $50 Metal Coins\n- Scythe: Promo Pack #10 - $2 Albion Metal Coins\n- Scythe: Promo Pack #11 - Encounter Card 39\n- Scythe: Promo Pack #12 - Encounter Card 40\n- Scythe: Promo Pack #13 - Encounter Card 41\n- Scythe: Promo Pack #14 - Encounter Card 42\n- Scythe: Promo Pack #15 - $10 Nordic Metal Coins\n- Scythe: Promo Pack #16 - $1 metal Coins\n- Scythe: Promo Pack #17 - $5 Rusviet Metal Coins\n- Scythe: Standard Metal Coins",
    "timestamp": 1753567200
  },
  {
    "username": "winchesterkaveman",
    "rating": 10.0,
    "comment": "One of my top 5, Scythe has a very fond place in my heart. Both in game play and in style/theme it is a real personal favourite.\nRobust and refined action selection, tip top art, deeply thematic gameplay, area control and positioning... Scythe really ticks a lot of my boxes for a winner.\nThe expansions are good but not essential, and the various component upgrades are well worth the cost, though playing with the base game wont have any detriment on the overall experience.\n\nSimply one of my favourite gaming experiences, every time, despite being rather terrible at it.",
    "timestamp": 1753308000
  },
  {
    "username": "Flatirons",
    "rating": 10.0,
    "comment": "Have:\nInvaders from Afar,\nThe Rise of Fenris,\nRealistic resources,\nMetal coins,\nModular board (w/ red vinyl tunnels & anti-slip mats)\n\nOn BGA premium.\n\nSetup (0-Slow | 4-Quick): 2/4\nEasy to teach (0-Hard | 4-Easy): 2/4\nPlayer Interaction (0-Solitaire | 4-Plenty): 4/4\nDowntime (0-Long | 4-Short): 2/4\nLuck Influence (0-Swingy | 4-None/Counterable): 3/4\nReplayability (0-Barely any | 4-Almost infinite): 4/4\nFun (0-Boring | 4-Heck Yeah): 4/4",
    "timestamp": 1753135200
  },
  {
    "username": "Bthomps4",
    "rating": 10.0,
    "comment": "I love scythe and only complain I don't get to play it more and the set up time, which is way less than gloom heaven but far more than monopoly.",
    "timestamp": 1752962400
  },
  {
    "username": "John501",
    "rating": 10.0,
    "comment": "(2018) Scythe stands in a class of its own. The design combines familiar mechanics (e.g. action selection, area control, card combat) in unique ways that set the game apart from the crowd. The much-loved and celebrated art work lives up to the hype and it is complemented by rather lavish production choices. Scythe is not a war game and it doesn’t fit neatly into any extant genre of Euro. It is rule heavy- not suitable as an introduction to board games or even as an intro to the heavier end of board games. Still, though it’s a lot to digest, that lot is all quite good.\n\n(2024) I won’t lower Scythe’s perfect ‘10’, but I will note that after 5 years in the rotation it started to feel scripted. My last few plays have felt a bit stale, even when including some of the more bonkers expansion factions. Still- it took a long time to get here.",
    "timestamp": 1752962400
  },
  {
    "username": "Bastian123",
    "rating": 10.0,
    "comment": "Great game in a spectacular and unique setting, high tension in a tough engine building game with elements of area control, conflict, worker placement, victory run, asymmetric and so on. The artwork is phenomenal!",
    "timestamp": 1752444000
  },
  {
    "username": "Papou86",
    "rating": 10.0,
    "comment": "Fr",
    "timestamp": 1752444000
  },
  {
    "username": "creator1113",
    "rating": 10.0,
    "comment": "With full set of metal mechs + factory miniature + campfire encounter tokens + wooden Fenris pieces + wooden action pieces + 3D printed Togawa and Albion tokens.\n\nAll expansions and promos available. Modular map (stored outside legendary box).\n\n1 metal coins set + $2 Albion coins + 25 extra $1 coins + part of a second set (4 extra $20, 4 extra $10, 15 extra $5).\n\n+ $2/$50 metal coins from SMG webstore",
    "timestamp": 1752012000
  },
  {
    "username": "ZootCat",
    "rating": 10.0,
    "comment": "Didnt like it at first but the more I played it the more I fell for it",
    "timestamp": 1751493600
  },
  {
    "username": "Aleboth93",
    "rating": 9.5,
    "comment": "One of the best eurogames I have ever played. Its complex in its own way, because you can face the game in many different ways, in fact for the first games I was disoriented and I had to play 3-4 times before deeply understand and appreciate the mechanics. Only small flaw: how the end condition triggers and the impossibility to perform one last turn",
    "timestamp": 1751320800
  },
  {
    "username": "Parsdunk",
    "rating": 10.0,
    "comment": "X Everything is in the Legendary Box apart from Rise of Fenris which is in its own box.\n\nHave kept Collectors edition box number 553/11320. Have also kept Wind Gambit box.\n\nAll metal coins, extra combat dials, wooden tokens etc. are in here.",
    "timestamp": 1751234400
  },
  {
    "username": "kReal92",
    "rating": 10.0,
    "comment": "Sleeved\nDeluxe - Etsy Components missing\ne-Raptor\nPainted: no",
    "timestamp": 1750716000
  },
  {
    "username": "codewizpt",
    "rating": 9.5,
    "comment": "Kallax: B5",
    "timestamp": 1750543200
  },
  {
    "username": "jeRm!",
    "rating": 10.0,
    "comment": "+ Rise of Fenris\n+ Modular Board\n+ Invaders from Afar",
    "timestamp": 1750197600
  },
  {
    "username": "carbohm",
    "rating": 10.0,
    "comment": "Buena rejugabilidad. Es más euro que wargame, pero interesante la amenaza de guerrita.",
    "timestamp": 1750197600
  },
  {
    "username": "clawp1995",
    "rating": 10.0,
    "comment": "3D Insert\nSleeved\n44 x 67 Ultimate guard premium soft sleeves\n3D Printed:\n- Factory\n- Flags\n- Traps\n- Encounters\n- Fenris Tokens\n\nPainted:\n- Factory\n- Mech/Heroes\n- Flag/Traps/Influence",
    "timestamp": 1749938400
  },
  {
    "username": "scoreczek",
    "rating": 10.0,
    "comment": "top game",
    "timestamp": 1749592800
  },
  {
    "username": "richcharters",
    "rating": 9.6,
    "comment": "Great Game.\n\nYou control one of 5 factions. You try to build the best society by achieving different objectives (building, combat, other things).\n\nEach turn you select one of 5 spaces on your board (the 5th is only available after you've traveled to the center of the board). Each space has 2 possible actions you can take. Won't be able to take them all, as you won't have the resources to do it.\n\nSo you control territory, manage production, build mechs, have encounters, manage your military power, manage your popularity, etc....\n\nI've painted the miniatures.\nAll 5 Characters:\nhttps://www.boardgamegeek.com/image/3897746/scythe\nhttps://www.boardgamegeek.com/image/3901336/scythe\nhttps://www.boardgamegeek.com/image/3901335/scythe",
    "timestamp": 1749592800
  },
  {
    "username": "Jonstandring13",
    "rating": 10.0,
    "comment": "One of the greatest games for fun, strategy, and quality of design and production.",
    "timestamp": 1749506400
  }
]