[
  {
    "username": "Drrabbits",
    "rating": 1.0,
    "comment": "Overcomplicated. Symbolism isn't very clear. Anticlimactic ending. Joyless mechanisms I've yet to meet someone who enjoyed this game irl. Garbage.",
    "timestamp": 1756850400
  },
  {
    "username": "mickhah1",
    "rating": 1.0,
    "comment": "Since you get how Phase IV works, the game becomes another stupid engine builder.",
    "timestamp": 1755122400
  },
  {
    "username": "BIGGIE_JR",
    "rating": 1.0,
    "comment": "i want to play but it wont let me >",
    "timestamp": 1748037600
  },
  {
    "username": "djakarn",
    "rating": 1.0,
    "comment": "Daube",
    "timestamp": 1724968800
  },
  {
    "username": "mattczak",
    "rating": 1.0,
    "comment": "The game that almost stopped me from getting into games. I know the symbols are known to be awful, but I don't know what the excuse is for not revising it. I would rather go home than play this.",
    "timestamp": 1706137200
  },
  {
    "username": "lorax21",
    "rating": 1.0,
    "comment": "The box is 3 times larger than it should be. For this abhorrent, unconscionable business practice, I'm going to rate this game as low as I can, until I get around to playing it -- which, given the turn-off, will be a while.",
    "timestamp": 1700694000
  },
  {
    "username": "Harbard",
    "rating": 1.0,
    "comment": "I like this game but I can't play the first version of it because it's not colorblind friendly...",
    "timestamp": 1678662000
  },
  {
    "username": "JakeDave",
    "rating": 1.0,
    "comment": "~$20 shipped on eBay",
    "timestamp": 1672354800
  },
  {
    "username": "foxrain4",
    "rating": 1.0,
    "comment": "Outdated art but gameplay looks promising",
    "timestamp": 1662760800
  },
  {
    "username": "jasonbluefire",
    "rating": 1.0,
    "comment": "Overly Complex, bad quality, cards contain redundant info, hard to learn.",
    "timestamp": 1643065200
  },
  {
    "username": "LanternMedia",
    "rating": 1.0,
    "comment": "I know this is a popular game for many, but it is just so overly complicated and confusing that it almost turned me off gaming forever... I even had \"an expert\" teach me how to play it, and I just hated it from the get-go...",
    "timestamp": 1612220400
  },
  {
    "username": "tearhsuke2011",
    "rating": 1.0,
    "comment": "其實我蠻猶豫是否該因為非遊戲性的因素給遊戲評價（不論高低）\n但後來想想，美術、配件、主題...甚至於價錢都可以影響評價\n那為什麼我不能因為非遊戲性的因素給評價呢？\n\n我給1分的原因很單純，戰棋會版買來就發霉，而且據說是常態\n下次請慎選代理商\n偉哉",
    "timestamp": 1572649200
  },
  {
    "username": "airjudden",
    "rating": 1.1,
    "comment": "This \"game\" blows so many chunks that you could erect a Eurogame monument from those chunks, which, while gross, would be quite appropriate.\n\nYou might be thinking, \"Yeah, you just don't understand the icons.\" Wrong. I played it enough times to learn the icons. My beef with this game is as follows:\n\nThis game is no \"race.\" It has nothing to do with space. Like most Eurogames' it has nothing to with anything.\n\nWant to save money and get the gist of this game? Call 3 friends over. Give each person a set of playing cards. Play solitaire. Whoever gets the most cards played at the top wins. That's it. I just saved you about $30 (USD). You're welcome.\n\nYou know what chaps my @ss about this game? I have a powerful military (also known as \"red\" cards). I'm the friggin' galactic Empire loaded to the hilt with Star Destroyers and led by Darth Vadar himself! You are a bunch of peace loving hippie beatnecks. I come over and demand that you pay tribute (in other words, extortion) and if not, then I will conquer some of your planets filled with long haired weirdos.\n\nThe problem is I can't. Why not? I have lasers! I have disruptors, photon torpedoes. You have Joan Baez singing \"How many roads must a man go down?\" I'm about to implement some Pax Instersellerica on you, but I can't do it. Why not? Because the rules say I can't interact with you!\n\nWhy is that? The only rational explanation is that we are too far apart, like on the opposite sides of the galaxy or something. Huh? Then how are we able to play off of the same roles? How do you know who won the \"race?\" How did you even agree on the terms of what the race was? I bet I can get to the end of my town before you can get to the end of yours. By the way, I'm in Kansas and you in France. Ready? Set? Go!\n\nSee, that's the problem with Eurogames: there is nothing rooted in reality. It's just a multi-player solitaire puzzle masquerading as a group game.\n\nDefenders of this corpse are quick to point out to me that if I go buy a bunch of expansions, THEN, I actually get to, you know ... interact with you. My answer?\n\n*Mic Drop*\n\nIt's an acknowledgement that you have to spend a bunch of money just to make it not suck as much.\n\nSo if you are a sad Eurogamer who can't break free, I'll help you out. If you want a game using these mechanics that is a LOT more fun go play San Juan. If you want something more challenging, with more interaction than San Juan or Race, with more paths to victory and more things to track, then play Glory to Rome.",
    "timestamp": 1555365600
  },
  {
    "username": "MatthewJohnsonApps",
    "rating": 1.0,
    "comment": "Here's an idea - let's take San Juan, paste a space theme on it (including mediocre artwork) and throw away everything we've learned about card design, iconography and language to create a game that is basically impenetrable for new players. I had heard that it was bad, but I never imagined it could be THIS AWFUL. I'm sorry, I don't care if this is some kind of classic, there are so many other games that are user friendly as well as challenging and fun. Seriously PLAY SAN JUAN INSTEAD. It's easy to teach, the card powers are instantly understandable to anybody who's played a few euro/tableau building games and you have the same basic mechanics and tension.",
    "timestamp": 1552777200
  },
  {
    "username": "Katmandave",
    "rating": 1.0,
    "comment": "The worst game i have ever played.{and i have been gaming for 40 years} A game with no player interaction,the player who knows the cards the best,or who draws the best cards wins.",
    "timestamp": 1510786800
  },
  {
    "username": "vbpr",
    "rating": 1.0,
    "comment": "For some reason this, really doesn't do the trick for me although my friends are big fans.",
    "timestamp": 1499896800
  },
  {
    "username": "NoxMortem",
    "rating": 1.0,
    "comment": "It is a multiplayer solitaire. Your choices dont effect your gaming group at all or at least not very much.\n\nUpdate 2016: Reduced down to 1. Since I played Roll for the Galaxy I do not see why I would under any circumstances play Race for the Galaxy which is essentially the same itch but just plays worse. Race ftG is a pain, while Roll ftG is fun!",
    "timestamp": 1460066400
  },
  {
    "username": "lynx1998",
    "rating": 1.0,
    "comment": "Soulless and abstract.....blech!",
    "timestamp": 1372456800
  },
  {
    "username": "evanbrooks",
    "rating": 1.0,
    "comment": "01/03/08",
    "timestamp": 1371333600
  },
  {
    "username": "dead jawa",
    "rating": 1.0,
    "comment": "I am tired of having to mark cards or write on cards just to be able to play a game, to correct for game designers poor color choices and/or obliviousness to even common color-blindnesses. These issues make your game unplayable.\n\nThis is a one and will remain a one until there is a color blind accessable version.",
    "timestamp": 1340488800
  },
  {
    "username": "spetz",
    "rating": 1.0,
    "comment": "beuark",
    "timestamp": 1314050400
  },
  {
    "username": "AnalogGamer",
    "rating": 1.0,
    "comment": "\"Agricola\" in space.",
    "timestamp": 1286661600
  },
  {
    "username": "thexdish",
    "rating": 1.0,
    "comment": "Overrated!",
    "timestamp": 1255125600
  },
  {
    "username": "crazyyog",
    "rating": 1.0,
    "comment": "The cards are way too busy with stupid little symbols that needs a cheat sheet that is like the Rosetta Stone to decipher! I am sure it would become easier to remember them after several plays, but I am not sure I want to invest the time or energy. Once you learn the game I would dread playing it with new players anyway, as I would have to watch them go through the same frustration of learning the damn thing. Also, there is no way in hell I would want to teach this thing to anyone for the same reasons.\n\nI really don't see what all the fuss is over this. There is really nothing new here. San Juan may be not be as \"deep\", but is fills the niche for the this kind of game perfectly fine. In the end I just think this is just another way over-hyped flavor of the month Euro! BLECH!!!!!\n\nMy rating is only from 1 play, but right now I am not all that anxious to try again. I just don't see my score going up with repeated plays.",
    "timestamp": 1254175200
  },
  {
    "username": "matthiske",
    "rating": 1.0,
    "comment": "Mundane graphics, OK game play. I can see why geeks like it because of the space theme.",
    "timestamp": 1236898800
  },
  {
    "username": "fenainternet",
    "rating": 1.0,
    "comment": "It's have to new gamers.",
    "timestamp": 1200524400
  },
  {
    "username": "Eliya84",
    "rating": 2.0,
    "comment": "One of the worst game which i have ever played. Will never play it again. 100 % luck feast.",
    "timestamp": 1747864800
  },
  {
    "username": "immatipyou",
    "rating": 2.0,
    "comment": "Its an incredibly boring game with too many symbols",
    "timestamp": 1707433200
  },
  {
    "username": "okiedokie",
    "rating": 2.0,
    "comment": "Xx I've played this three times and it is a very unfriendly game. There is no real interaction between the players, just everyone working on their own little game. If you don't know the cards inside & out, you're totally screwed.",
    "timestamp": 1704841200
  },
  {
    "username": "Marshaa",
    "rating": 2.0,
    "comment": "Overrated! Meh.",
    "timestamp": 1689976800
  },
  {
    "username": "GarfieldKlon",
    "rating": 2.0,
    "comment": "After reading the rules and some playtesting not want to keep it. Rules are not very good, lack of examples with pictures. Too many icons that you have too look up during game. And it's a multiplayer solitaire that is driven by random cards.",
    "timestamp": 1687989600
  },
  {
    "username": "Ahab2001",
    "rating": 2.0,
    "comment": "No fun.",
    "timestamp": 1674169200
  },
  {
    "username": "LDO91",
    "rating": 1.9,
    "comment": "Vu son classement dans la top tric trac, je m'attendais à mieux.\nles cartes ne sont pas très lisibles, 0 interaction. Oui on peut optimiser mais a quoi bon être plusieurs autour de la table? si on ne joue pas ensemble.",
    "timestamp": 1671231600
  },
  {
    "username": "DSix",
    "rating": 2.0,
    "comment": "You don't need other human players to play this. You barely pay attention to their cards and only take some passing vague interest into what action they take.\nSome people say they'd rather play the app version, and I clearly see why.",
    "timestamp": 1667430000
  },
  {
    "username": "Varunwe",
    "rating": 2.0,
    "comment": "Cheating ugly bot. The rest of the artwork was ugly as well. The only way to win was military.",
    "timestamp": 1664748000
  },
  {
    "username": "HilkMAN",
    "rating": 2.0,
    "comment": "When I play games, I want laughter, cunning plans, spectacular failures, drama. Other people want to put cards on the table and count points. Race for the Galaxy embodies this other hobby that seems so dissimilar from mine. Add the spectacularly ugly artwork, the microscopic font and the plethora of soulless icons, and you get me terribly bored. A few hours after playing, I would not be able to tell you the name of any of the cards, or what was depicted on them. It meant nothing to me. I did not care about my score because it was entirely abstract and I had zero sense of achievement. Obviously, there are many, many people who like such games, and that's fine. But I just hope I will never have to play this again.",
    "timestamp": 1655503200
  },
  {
    "username": "brazwhazz",
    "rating": 2.0,
    "comment": "The barrier to entry was just too high for me.",
    "timestamp": 1635980400
  },
  {
    "username": "behemothjosh",
    "rating": 2.0,
    "comment": "Need to be familiar with deck. Poor symbols. No catchup mechanic.",
    "timestamp": 1628114400
  },
  {
    "username": "John Rogers",
    "rating": 2.0,
    "comment": "Feels like a cross between Puerto Rico's role selection and San Juan's tableau without any interaction. That last part is a problem for me.\n\nOh and the icons. The icons! Not only do I have to learn the entire deck, all its ins and outs, but I have to learn it in picture form. I mean what happened to words? Didn’t we move beyond hieroglyphics, like I don’t know thousands of years ago? And now they are de rigueur, a requirement of modern boardgaming. Thanks RftG. And I get it. We want games to be universal, inclusive, not a gate bolted by language. But isn’t there a better way to do this? One that doesn’t require me learning the game in two different languages? A cleaner more intuitive iconography perhaps?",
    "timestamp": 1614639600
  },
  {
    "username": "ned_poreyra",
    "rating": 2.0,
    "comment": "Not fun at all. I don't understand where people see fun in this game. I've never bounced off of a game so fast and so hard. Horrible iconography, horrible to learn, ugly, non-intuitive and, worst of all, I don't even see where the payoff could be for all my effort put into learning this dry, mathematic mess. I don't like any ideas about these game - choosing phases, paying for cards with cards, card effects mostly about numbers, all of those are terrible, mundane, unfun ideas.\nActually I'm happy about this game. Because now I finally know which game I hate the most in the world. And it's this game. The only reason I gave it 2/10 instead of 1 is that it works. I can't deny that - it works. But so does a coal mine, yet people don't go there expecting fun.",
    "timestamp": 1607554800
  },
  {
    "username": "TDGR",
    "rating": 2.0,
    "comment": "Horrendously complex at first for what it is with all the iconography. Art is reasonable, but San Juan is much more elegant and Puerto Rico is a masterpiece.",
    "timestamp": 1598565600
  },
  {
    "username": "ionas",
    "rating": 2.0,
    "comment": "Boring, abstract, tedious, too many non-selfexplanatory icons and symbolds, mediocre artwork.",
    "timestamp": 1571004000
  },
  {
    "username": "aSfSteve",
    "rating": 2.0,
    "comment": "Played ~5 times, never without penny sleeves. Must take expansion with it, Race for the Galaxy: The Gathering Storm.",
    "timestamp": 1566338400
  },
  {
    "username": "Quiron1",
    "rating": 1.7,
    "comment": "Race for the Galaxy is way too far from deserving its high ranking in BGG. I'm sure I will never ever play it again.\n\nThe game is quite absurdly abstract for its \"spatial\" coating. What you do all the time doesn't really feel related with the intended theme, which is seen nowhere but on the cards titles and backgrounds (forced into them, indeed), and I don't rate it lower because, yes, this may be a \"game\" after all (a multiplayer solitaire game though!) but it's a very bad one. You can get much better GAMES for your money. Do you want to build a resources engine? Go to \"Splendor\"! Do you want to expand your galactic empire? Go to \"Gaia Project\"! Do you want a super dull abstract solitaire? Well, try \"Race for the Galaxy\", as such it won't dissapoint you.\n\nUninteresting. Not fun. The icons are an insult to iconography. While that at which the icons point out couldn't be any simpler, decyphering them will defintely take a time to master and once you do you'll still hate having to deal with a hand of 10 cards and a \"galactic empire\" (LOL, believe!) composed of up to 12 more cards in front of you, all of them equally awfully expressed with the same cryptic unnecessarily HARD TO READ shitty icons and effects. Consider having to have them all in your mind in order to make your decisions while, also, the same cards serve as currency in the game! (I mean, come on!) so you are all the time needing to chose what to let go (discarding or using it as money) and what may be worth to keep wether to \"settle\" or \"develop\" (thematic names for \"playing card from your hand\"). Dealing with all that squeezes your mental resources to the point you end up tired and having got in return no real fun for the hassle. ... But hey! it's a \"game\"! you play it in front of somebody who is suffering the same low quality design game conditions and then count up Victory Points for each afterwards.\n\nBut asuming you get to overcome this issue with the icons and master their decyphering (it's not impossible, it will just take some eye training), now the game demands from you to get to memorize more than a houndred individual cards in case you want to do more at than just playing, like actually tracing a winning strategy so that your decisions as you play feel like they make some sense indeed.",
    "timestamp": 1559340000
  },
  {
    "username": "Petrus Lugduni",
    "rating": 2.0,
    "comment": "Tedious to learn and boring to play. Just an over-complicated and overrated solitaire game.",
    "timestamp": 1548543600
  },
  {
    "username": "robdnose",
    "rating": 2.0,
    "comment": "Ughh...I don't get it, and don't want to get it.",
    "timestamp": 1548543600
  },
  {
    "username": "Chris Barnard",
    "rating": 2.0,
    "comment": "Steep learning curve due to the many unintuitive and unhelpful symbols on the cards. This game has a solitaire feel to it and ends in an anti-climax when someone simply announces that they have won.",
    "timestamp": 1507327200
  },
  {
    "username": "petegrey",
    "rating": 2.0,
    "comment": "Late adopter, I tried to like it. Many friends certainly do. Doesn't feel like San Juan to me, although knowing that one well helps.\n\nDefinate randomness here. In a 3p game, one person cruised to the end (12) in the time the next (who was experienced) player had got to 6 cards. Thats not strategy people, thats luck. I can see how this won't happen often, but it will happen.\n\nI thought the expansion might get me up the learning curve by playing solo a bit. It didn't.\n\nGot in trade for ParisParis\n\nNo thanks. I'll stick with San Juan.\n\nTraded this away for Heroquest.",
    "timestamp": 1501279200
  },
  {
    "username": "callasmar",
    "rating": 2.0,
    "comment": "Terrible! No link to the theme whatsoever. You´re not building up a galactic empire. You´re collecting symbols, colours and optimize this to get the most points. This is what I hate about many euros: take some cool looking art or theme, combine it with any desired mechanic and then sell it as a sci-fi, fantasy or whatever game to the public.",
    "timestamp": 1499810400
  },
  {
    "username": "eisenphx",
    "rating": 2.0,
    "comment": "Really don't know what to think of this game; an exercise in learning the cards and then the appropriate strategies for what you get dealt. Interaction with other players is almost zero.\nUpdate: I plain don't like it, it annoys me.",
    "timestamp": 1498255200
  },
  {
    "username": "Mozart78",
    "rating": 2.0,
    "comment": "With time, I came to realize that I truly disliked this game. I disliked the almost cliquey nature of the hieroglyphic symbols on the cards (\"Well, if you don't know what they all mean, then you obviously aren't smart enough blah, blah, blah...\"). I would play its far more elegant and user-friendly cousin, San Juan, every day and twice on Sunday over this sacred cow of BGG. Thus, its banishment...",
    "timestamp": 1491256800
  },
  {
    "username": "njesse99",
    "rating": 2.0,
    "comment": "Basically simultaneous solitaire. Pretty boring.",
    "timestamp": 1477087200
  },
  {
    "username": "Ginewra",
    "rating": 3.0,
    "comment": "bga",
    "timestamp": 1739660400
  },
  {
    "username": "MarshallStaxx",
    "rating": 3.0,
    "comment": "Boring, impenetrable, obtuse, not fun. The engine-building equivalent of watching space-coloured paint dry.",
    "timestamp": 1736895600
  },
  {
    "username": "Jardinko",
    "rating": 3.0,
    "comment": "It's too complicated for a multi-player solitaire game. Going through such a hard and long teach and then not interacting with your opponents is awful.\n\nI like the art and the universe.",
    "timestamp": 1734908400
  },
  {
    "username": "kamomillatee",
    "rating": 3.0,
    "comment": "Pretty much a solitaire game with tableau building / using cards as resources. Lack of theme and awful iconography makes the game harder to learn than the game actually is and the game providing no player aids does not help at all.\n\nI can feel that the game would get better at least for some degree but I don't think it is even close to be worth the investment. Terraformin Mars: Ares expedition is just better in pretty much every way",
    "timestamp": 1732748400
  },
  {
    "username": "Scot_y",
    "rating": 3.0,
    "comment": "I fail to see a game here. This game is just an mess of variability and total randomness. There are so many variables I don't see how you can determine a winner or loser by anything other than luck. As in this game may be almost 100% luck. It's literally who gets the better card combos wins.\n\nThere is so much pointless randomness in Race for the Galaxy. For instance why are the 6 cost developments in this game at all? They add such a high degree of luck. They can literally swing a game by over 30 points. Get the right combo and it's auto win. Plus some are almost totally worthless.\n\nWhy do you have to chose between 2 start worlds? It's so unbelievably limiting and so many times neither start world helps your hand of 4 cards. Just draw 10 cards and discard two and start the game. It's that easy and then you don't have to dig the start cards out every new game.\n\nWhy doesn't Contact Specialist and the world counter part let you play yellow worlds? Yellow is such a weak strategy as is Green.\n\nUpdate this game please.",
    "timestamp": 1730156400
  },
  {
    "username": "BlinkingEyeTTV",
    "rating": 3.0,
    "comment": "I understand the engine building intrigue, but the art substantially hinders the game design with poor use of iconography. There are better games that accomplish this same mechanic in a cleaner and more interesting way: Puerto Rico, Gizmos, Evergreen.",
    "timestamp": 1726524000
  },
  {
    "username": "zenmester",
    "rating": 3.0,
    "comment": "I did not like this game and do not get what all the fuss is about",
    "timestamp": 1725573600
  },
  {
    "username": "robochase6000",
    "rating": 3.0,
    "comment": "first play was a bad teach; i could be convinced to try again",
    "timestamp": 1722808800
  },
  {
    "username": "jcoopersd",
    "rating": 3.0,
    "comment": "A very overrated game, especially among my GeekBuddies. I've played this game dozens of times on BGA and in the app trying to find the fun, and have been left empty-handed.\n\nPeople will often compare this game to Chudyk tableau builders and man. This game is so, so much worse. Innovation, Glory to Rome, and Mottainai blow this game out of the water. Why, you ask? This game is fundamentally BORING. Every single card is just. +1 to production. +1 military strength. Three points. The six value developments are almost kinda cool, but not really. Apparently the expansions make it better but the base game is so much worse than other tableau builders that I don't care to see what else there is from this system. Play a Chudyk game instead. Or a Pax game. Or any other engine builder. They're all easier to teach / learn and have more interesting gameplay.\n\nAlso the box sucks and is ridiculously oversized.",
    "timestamp": 1714168800
  },
  {
    "username": "ourmove123",
    "rating": 3.0,
    "comment": "Overview:\n```\nRace for the Galaxy is a dynamic card game where players build galactic civilizations using cards that represent worlds or technological and social developments.\n\nEach card's role is part of a greater narrative of space exploration and empire building.\n```\n\nTheme:\n```\nThe game immerses players in a rich sci-fi universe where various factions compete to dominate the galaxy through technological advancements, economic development, and military might.\n```\n\nMechanisms:\n```\nUtilizes a unique iconography system to manage resources, world developments, and actions.\n\nPlayers select roles each turn that determine what actions all players can perform, promoting strategic foresight and planning.\n\nThis role selection combined with a hand management mechanic drives the game's depth and replayability.\n```\n\nPros:\n```\n+ Deep strategic gameplay with multiple paths to victory supports diverse tactical approaches.\n\n+ Designed to allow complex decision-making within a relatively short game duration (for experienced players), catering to players who enjoy dense, strategic experiences.\n```\n\nCons:\n```\n- The game's steep learning curve, due to its unique icons and the variety of card functions, can be daunting for newcomers.\n\n- Limited player interaction, focusing more on individual strategy development rather than direct conflict, might not suit everyone’s taste.\n\n- I did not like the actions/feature related to production and consumption, as they did not feel intuitive to use.\n```\n\nDesigner Insights:\n```\n+ The use of cards to represent multiple game mechanics is a clever design choice that adds strategic complexity and replayability.\n\n~ Balancing these mechanics so no single strategy overpowers others remains a significant challenge.\n\n- Yhe game sometimes feels too complex compared to more streamlined games like Jump Drive\n\n- The solo nature of gameplay can detract from the sense of competition and achievement.\n```",
    "timestamp": 1713909600
  },
  {
    "username": "Euroman",
    "rating": 3.0,
    "comment": "Interesting game, but not one I like. Was kind of like playing chess. Familiarity with the cards gives a huge advantage to that player.\nToo many icons!",
    "timestamp": 1710457200
  },
  {
    "username": "Forgeforgeforge",
    "rating": 3.0,
    "comment": "Cannot get my head around the appeal of this game.\n\nSeemingly requires total deck memorization to play strategically, otherwise it's basically gin rummy in terms of how much control you have over the deck and how arbitrary your decisions of what to keep for the future are.",
    "timestamp": 1700089200
  },
  {
    "username": "PoFul",
    "rating": 3.0,
    "comment": "I don't have a problem with the rules, or with the mechanics, I might say that the symbols on the cards make it a bit complicated.\nwhat concerns me is that it costs definitely way too much (35€ on sale for basically a deck of 156 cards), so I'm not recommending it.\nAlso, i'm tired of useless giant boxes that could keep 4 times more what they actually contain.",
    "timestamp": 1689112800
  },
  {
    "username": "DaniDCR",
    "rating": 3.0,
    "comment": "Éste es el típico juego con cartas que no me gusta nada. No le pongo un 1 el esfuerzo del que intentó enseñarme a jugar...",
    "timestamp": 1682460000
  },
  {
    "username": "Fd12",
    "rating": 3.0,
    "comment": "Genre and strategy are both things I generally love. But this pile of bad iconography with huge index numbers and colored borders for most important effects, after 4 hours of gaming, I still don't understand. Absolutely hate it when playing with non-beginner rules.\nAfter 10 rounds played, plus 30 rounds of roll for the galaxy.\nDuplicate cards I would put down in real life accidentally, in digital play I draft them and my tactics for a turn fail b/c I am not allowed to put them down. UX is terrible: no tokens for good, but cards discarded?!",
    "timestamp": 1675465200
  },
  {
    "username": "A_Rebours",
    "rating": 3.0,
    "comment": "Ingenious game but dry as hell. After playing a dozen times either opposed or against the app, I have no desire to ever play this again. The lack of interaction has killed its appeal pretty fast (I know, you're supposed to leech off the other player's card selection, but that doesn't count as interaction as far as I'm concerned).",
    "timestamp": 1666908000
  },
  {
    "username": "sunyushen",
    "rating": 3.0,
    "comment": "暂时还没有太上瘾，但是在这个时长内算是优秀的策略游戏",
    "timestamp": 1662242400
  },
  {
    "username": "Nicolas Weiss",
    "rating": 3.0,
    "comment": "I've spent a good decade summarising Race of the Galaxy to myself as \"that very popular game I can't be bothered to give a chance to\" on the grounds of its iconography.\n\nIt turns out I had not been missing out.\n\nThe main culprit here is clearly the constant random draw from a moderately large card pool to individual hands. On top of forcing things to be overy tactical on your side, it makes opponents equally hard to predict and removes any layer of indirect interaction that other similar VP engine games like Dominion (with its central common market of cards) would have. Besides, even if I could picture a level of expertise where it would be possible to start accounting for the action phases opponents are likely to select, and even if the requirement of basically internalising everyone else's complicated tableau on top of mine didn’t sound like stabbing my eyeball with a wooden spoon, the amount of 100% pure multiplayer solitaire sessions necessary for me to develop that skill would not be worth it, when I’d probably still deem the result a mockery of multiplayer.",
    "timestamp": 1650664800
  },
  {
    "username": "RJBoston",
    "rating": 3.0,
    "comment": "Just could not get past the iconography.",
    "timestamp": 1643756400
  },
  {
    "username": "Quangel_",
    "rating": 3.0,
    "comment": "This game is not color blind friendly. Would rate it higher if it was. But as it is now it doesn’t work at all for me.",
    "timestamp": 1640646000
  },
  {
    "username": "OscarR",
    "rating": 3.0,
    "comment": "I don't like this game at all. One of the most loopsided games I've played. Novice player against two experiences players.",
    "timestamp": 1635980400
  },
  {
    "username": "zinniye",
    "rating": 3.0,
    "comment": "Possible Puerto Rico replacement?",
    "timestamp": 1627596000
  },
  {
    "username": "Firsteros",
    "rating": 3.0,
    "comment": "Horror to introduce to new players.",
    "timestamp": 1625090400
  },
  {
    "username": "mistermarino",
    "rating": 3.0,
    "comment": "This game may have made me realize that I am not merely stubborn to the point of self-harm but that I actually hate myself.\n\nI say maybe because there was the whole pre-divorce ritual...er...marriage. But that's another story.\n\nAnyway, I thought I liked this after a first play. Because, I suppose, it seemed science fictioney (it's in space!) and innovative and possibly fun. Did I mention that it's in space?\n\nIt turns out I was wrong about two of those things. And I might as well have been wrong about the space setting, for all the difference it makes.\n\nBy now it is likely passe to complain about the nigh incomprehensible iconography. It's hard, one assumes, to put a lot of non-incomprehensible thingies on a card in a manner that pleases everyone. Or anyone.\n\nIt's also hard, one assumes, to make a game at all in a manner that pleases everyone. Or anyone. Or me.\n\nI give the designer credit for trying, at least. I mean, it's in space! But other than that? Sorry, just...no.\n\nI also give the designer credit for adding mechanics that create \"interaction\" of a sort. You do not merely build your tableau--lord, how I shudder at the use of that word, signifying as it does that a game is not any fun--but must (pay attention, Eurogamers, because I know this is a difficult concept for you) look at what the other players have done so you can leech off their actions.\n\nI suppose this was an attempt to make the game more entertaining by forcing \"interaction.\" Forget for a moment how far you must define interaction down in order for this claim to be true. The problem is, and this is fundamental, that you can't look at stuff when you're asleep. Because looking at a tableau of incomprehensible squiggles, shuffling cards, marveling at how military cards do not cause any, you know, fighting to happen, is a surefire cure for insomnia.",
    "timestamp": 1622239200
  },
  {
    "username": "slp2dream",
    "rating": 3.0,
    "comment": "This is one of the early games I played but I remember the issue I had with it, all the symbology, most of the time I did not even know what I was doing. I am sure if I decided to replay it now it would probably not be an issue but it left such an awful impression for me that I can't see myself returning to this ever",
    "timestamp": 1617832800
  },
  {
    "username": "joebelanger",
    "rating": 3.0,
    "comment": "Symbols and crap... Something, something space.",
    "timestamp": 1610406000
  },
  {
    "username": "CarsonChandler",
    "rating": 4.0,
    "comment": "Confusing. I think I would enjoy this if I understood it, but my wife wouldn't based on the theme.",
    "timestamp": 1762653120
  },
  {
    "username": "nhjelmberg",
    "rating": 4.0,
    "comment": "Quickly played tableau builder where you choose actions to build a strong engine. Knowledge of the many different cards and how they interact is necessary to appreciate this game. But even then, the interaction between the players is low and the decisions are limited to which actions to choose and which cards to discard.",
    "timestamp": 1758837600
  },
  {
    "username": "Food_Please",
    "rating": 4.0,
    "comment": "First impression (1 play):\nVery complicated iconography, overwhelming amount of cards and options, yet somehow the turns felt repetitive and with little incentive or capacity to check what the opponent is up to.\nNot a game for me, but as my gaming buddy is keen on it, I'll try it another time (4/10).\n\nUpdate after 3 plays:\nPlays much better when you know the symbols. Still not a fan, stays at a 4 for the terrible learning experience. 4/10.\n\nAfter 5 plays:\nManaged to get a win. But its just so boring, sitting there maximising my engine efficiency without interacting with my opponent. I'd rather play any simple game where I at least have time to look at my opponent. Barely staying at 4/10",
    "timestamp": 1757455200
  },
  {
    "username": "IsolatedPawn",
    "rating": 4.0,
    "comment": "Probably the “classic” i seem to be the most out of step with. I just don’t understand the praise for this game.",
    "timestamp": 1757196000
  },
  {
    "username": "latschediwes",
    "rating": 4.0,
    "comment": "There are elements of similarity to a 3x space game and the way the cards show up (explore), how they are played out (expand) and how you use them (exploit). Otherwise it's something similar to the usual dry tableau/engine-building games as well as combinatorial card games in MtG's legacy. It's quiet and non-interactive race for victory points that is played in a heads-down fashion; one is chaining symbols, building combos and exploiting synergies. It seems like it's a purer destillation than most, also in the context of later releases.\n\nThe illustrations are nice. I didn't have any problems with the iconography, which I actually found quite helpful and not difficult to understand by the end of the first game.\n\nI understand that one interesting part is adopting strategies to the environment as well as the comparable high complexity in a very short play time.\nHowever, in the best case scenario you take the opponent's tableau into account when choosing your action, but you need more or less precise knowledge of the card pool and possible sequence combinations, which requires dozens to hundreds of games. And when this point is reached you can't even describe this as modest interaction.\n\nOne would be better served if one plays the app version, which is good for for falling asleep, and skips the human part completely.\n\n-----\n\nI‘ve made several attempts to get something out of it. I just can't do it. It's simply not worth the effort.",
    "timestamp": 1754344800
  },
  {
    "username": "Nodens",
    "rating": 4.0,
    "comment": "Without physical components this would play in a couple of minutes. It's less a race than a frantic 100m dash. No time to look at the scenery so to speak. That said, it bored me after a couple of rounds.",
    "timestamp": 1752616800
  },
  {
    "username": "gmcnish",
    "rating": 4.0,
    "comment": "Tom Lehman himself led us through a game. It's good. Liked it more on second play. Would like to play this some more.\n\nBut I didn't, and everyone else did; so now I flail around trying to remember ugly icons while they score big and know what opportunities await.\n\nStill most of my geek buddies rate this very highly, so maybe one day I'll learn it properly.",
    "timestamp": 1752271200
  },
  {
    "username": "sigtaulefty",
    "rating": 3.5,
    "comment": "Played a few times - I just didn't see this as a great game. Felt like a form of San Juan in space, but would rather just play San Juan.\n\n:EDIT -- let me put it THIS way. It is probably a very good game, well designed and fun for some. It's just not ever gonna be fun for ME.\n\n\n\nThe guessing game of role selection favors the experienced player and I just don't want to spend more time playing this game to become experienced.\n\nThere are many complex rules and each card has it's own special ability (which is fine in most cases) but unless you're familiar with each special ability you spend a lot of time staring at your cards blankly thinking \"WTF should I do here\" while experienced opponents blast through.\n\nLowered from 3 to show I would rather play this than chess, but would rather play anything 3 and higher than this.",
    "timestamp": 1751925600
  },
  {
    "username": "Lord Leuber",
    "rating": 4.0,
    "comment": "As a highly rated game similar to San Juan I really wanted to try this out, but the first and only play left both of us thoroughly unimpressed. Yes I know that’s not fair, but over the years we have had some solid experience in figuring out when a game just happens to be not for us, as was the case here. Bonus negative points for my perception that this is a significant predecessor to the tableau builders that are a big part of the industry today, which I see as a negative development in relation to what board games can be.",
    "timestamp": 1735686000
  },
  {
    "username": "Joey_A",
    "rating": 4.0,
    "comment": "Respect the design, but the description for \"4\" really suits my feelings after playing it. It reminds me of Terraforming Mars (which I also feel the same about) in that there's a deck with high value cards, low value cards, and everything in between, and luck determines what you get. Maybe if the cards were divided by levels that unlocked the further the game got I'd like it better, but that is one design element that just doesn't do it for me.",
    "timestamp": 1734390000
  },
  {
    "username": "Febrium",
    "rating": 4.0,
    "comment": "Just play it digitally. The base game is simple. Is it fun to play? Yes, If all players understand the rules and icons. It has so many expansions and setup is messy in the rule book. Use online guides for better experience. A new print or edition to meet current board games standards would make this so much better.",
    "timestamp": 1732921200
  },
  {
    "username": "hiimjosh",
    "rating": 4.0,
    "comment": "Lots of intertwining strategies; you can find cards with major and minor support for your archetype. The game can be very luck dependent and any slow play drags down the entire experience considerably. One of my most played games which has steadily gotten worse for me over time. After maybe 200 games, I'm just plain sick of it.",
    "timestamp": 1732489200
  },
  {
    "username": "Daedalica",
    "rating": 4.0,
    "comment": "It could have been the time (late night) or the player count (4), but this game doesn't really stood out for me. There are better Engine Building card games. The theme is ok, the art is horrifying (old-school 3D-Animations).",
    "timestamp": 1729029600
  },
  {
    "username": "Chaliz",
    "rating": 4.0,
    "comment": "Terrible iconography",
    "timestamp": 1725746400
  },
  {
    "username": "Zete",
    "rating": 4.0,
    "comment": "The only thing I remember about playing this is that the last two icons on each card are in the wrong position and that threw me off over and over again. No idea why, but my brain wanted them in the other order. And so, I don't want to play this again. Besides, Roll is way more accessible and entertaining.",
    "timestamp": 1720476000
  },
  {
    "username": "Elfving71",
    "rating": 4.0,
    "comment": "I did not like this game",
    "timestamp": 1708124400
  },
  {
    "username": "Usul68",
    "rating": 4.0,
    "comment": "no solo and boring",
    "timestamp": 1705186800
  },
  {
    "username": "Tall_man",
    "rating": 4.0,
    "comment": "Too many card combos to memorize to be enjoyable when only played occasionally.",
    "timestamp": 1704322800
  },
  {
    "username": "AdmiralCrunch",
    "rating": 4.0,
    "comment": "Cool Sci-fi themed card game. High learning curve. Iconography can be a headache, and difficult to remember. One of those games that is more interesting to own than to play.",
    "timestamp": 1700348400
  },
  {
    "username": "soki86",
    "rating": 4.0,
    "comment": "i do not understand why it is so popular",
    "timestamp": 1695852000
  },
  {
    "username": "billthepirate",
    "rating": 4.0,
    "comment": "Includes the Gathering Storm expansion",
    "timestamp": 1694037600
  },
  {
    "username": "djmerk",
    "rating": 4.0,
    "comment": "i've decided i don't really like card games. i couldn't have any fun because i was too busy explaining what all the symbols meant to other players.",
    "timestamp": 1691100000
  },
  {
    "username": "Alannamairead",
    "rating": 4.0,
    "comment": "I know this is really popular but it just isn't my thing, it contains a lot of my archnemesis: cards covered in dozens of icons",
    "timestamp": 1686434400
  },
  {
    "username": "anasxatzi",
    "rating": 4.0,
    "comment": "Got rid of it because i dreaded teaching the iconography to any new player.A serious barrier to entry.\nCombine this with the fact that in your first plays it is very difficult to understand the actual impact and value of each card that reaches your hands and thus it VERY difficult for this game to make a good first impression.",
    "timestamp": 1683151200
  },
  {
    "username": "RalfMalf",
    "rating": 4.0,
    "comment": "Not my type of game and made worse by having my first plays with people who had played dozens if not hundreds of times.",
    "timestamp": 1677625200
  },
  {
    "username": "byronator",
    "rating": 4.0,
    "comment": "I found the iconography in this one to be the biggest barrier to understanding how to play. It's not a terribly complex game, but I found myself getting confused about what the different symbols mean. In all honesty, I prefer San Juan to this game simply because it is clearer and shorter.",
    "timestamp": 1677106800
  },
  {
    "username": "quietcorn",
    "rating": 5.0,
    "comment": "The mechanisms are good, but the iconography is unplayably bad.",
    "timestamp": 1762297200
  },
  {
    "username": "Auroric",
    "rating": 5.0,
    "comment": "Quick little engine building game. I like how fast it plays and how many varying approaches there are to building out your tableau. Learning the iconography and different cards can take a minute, but it's easy enough just to look for icons that match what you're already doing.\n\nEnd of the day though, it's just fine. If I had tried this in my early gaming days I may have loved it, but now it feels like just another engine builder, which isn't a genre I particularly enjoy in the first place.",
    "timestamp": 1760565600
  },
  {
    "username": "shawnmackay1593",
    "rating": 5.0,
    "comment": "Not a big fan of the '1 person picks an action, everybody else does a lesser version of that action' mechanic so I am not the target audience. I thought it was fine but nothing more.",
    "timestamp": 1759960800
  },
  {
    "username": "toorwell",
    "rating": 5.0,
    "comment": "I see why some people absolutely love this game. I'm not one of them, but I'd play occasionally.",
    "timestamp": 1758924000
  },
  {
    "username": "Dumkirk",
    "rating": 5.0,
    "comment": "App works better. Lots of iconography to learn. Lacklustre art.",
    "timestamp": 1757800800
  },
  {
    "username": "Jayadevhaddadi",
    "rating": 5.0,
    "comment": "solitare game... engine building... kinda boring\ninteresting machanics though...",
    "timestamp": 1753394400
  },
  {
    "username": "starspangledgirl",
    "rating": 5.0,
    "comment": "I don't see what the appeal is. Just not my cup of tea. I need to try it again though, to make sure",
    "timestamp": 1753308000
  },
  {
    "username": "seb_48784",
    "rating": 5.0,
    "comment": "after 3 games on BGA and a handful of games in the app: I've tried it after having played its lighter sibling, Jump Drive. That one already didn’t click with me, Race for the Galaxy even less so. As much as I enjoy science fiction, the world portrayed on the cards doesn’t really come alive — you end up mostly playing with symbols. (Unlike in Forest Shuffle, where a wolf actually feels like a wolf.) And for some reason, I just don’t find the symbols intuitive. Overall, the gameplay feels like I'm just pushing around cards with strange icons, trying to squeeze out points.",
    "timestamp": 1751407200
  },
  {
    "username": "noel344",
    "rating": 5.0,
    "comment": "Fiddly, crap iconography, lots of buts, ifs and maybes.\nSan Juan much cleaner",
    "timestamp": 1749765600
  },
  {
    "username": "NotThatSalem",
    "rating": 5.0,
    "comment": "Only good if you spend a lot of time learning both the symbols and the cards. Good for it's time, but there are better games out there and most don't require a 6-week instructional course to play.",
    "timestamp": 1749592800
  },
  {
    "username": "zeotter",
    "rating": 5.0,
    "comment": "Traded to Noble Knight",
    "timestamp": 1741042800
  },
  {
    "username": "bitatmoonl",
    "rating": 5.0,
    "comment": "Mar'13 Bogged down by bad briefing or perhaps it's the space theme ......\nJan 25 down to 5 from 5.5. after 12 years, I am sure I really don't like it. Lol.",
    "timestamp": 1737759600
  },
  {
    "username": "buzzlife",
    "rating": 5.0,
    "comment": "I really don't get the love for this game. I played it on BGA, and maybe I just didn't understand what I was doing, but I didn't really enjoy the play at all.",
    "timestamp": 1737241200
  },
  {
    "username": "camidon",
    "rating": 5.0,
    "comment": "Good game. Interesting card playing mechanics. I like civilization building games, but this is still just a card game. Lots of small details to keep track of. I'd play this again, but don't think I need to own it.\n\nTRADED",
    "timestamp": 1734908400
  },
  {
    "username": "FlamezOfGamez",
    "rating": 5.0,
    "comment": "I continually feel like I'm playing this game blindly, only slightly being able to plan ahead for future events, and basically being incapable of taking advantage of other players' decisions. The only saving grace is that I can play this game with automation through BGA in a heartbeat, which save it from an diagnosis of being overly complex for what it is. I still prefer San Juan.",
    "timestamp": 1734735600
  },
  {
    "username": "ConraDargo",
    "rating": 5.0,
    "comment": "What a disappointment this game was - nothing like me and my friends had expected. It was just so... well dull, even though lots of things were going on among the players but what we really missed was some kind of interaction between us.",
    "timestamp": 1730847600
  },
  {
    "username": "boto2137",
    "rating": 5.0,
    "comment": "As a quick engine building game, it's great.\n\nThe short play time turned out to be a con for me - the game starts a little slow, and before you can get your engine really going, it ends.",
    "timestamp": 1730242800
  },
  {
    "username": "lou_mein",
    "rating": 5.0,
    "comment": "Iconography blows",
    "timestamp": 1726783200
  },
  {
    "username": "MissP1ggy",
    "rating": 5.0,
    "comment": "Can escalate quickly! I like roll for the Galaxy and jumpdrive better.",
    "timestamp": 1724191200
  },
  {
    "username": "Stephen Glenn",
    "rating": 5.0,
    "comment": "(car)\n\nHaving difficulty rating this because I'm still finding my way. Even though I finally feel like I have the rules down, I still don't feel myself drawn to it. What's wrong with me?",
    "timestamp": 1722549600
  },
  {
    "username": "kiwipaul",
    "rating": 5.0,
    "comment": "Is ok, I see why others like it but not for me",
    "timestamp": 1722463200
  },
  {
    "username": "Glic2003",
    "rating": 5.0,
    "comment": "Seems like the solo app version would be the preferred way to play. I'm never excited about game that have no interaction between players, and the aesthetic is extraordinarily bland.",
    "timestamp": 1713736800
  },
  {
    "username": "PotatoKing_",
    "rating": 5.0,
    "comment": "형만한 아우는 없다, 아트워크도 너무 아쉬움",
    "timestamp": 1713650400
  },
  {
    "username": "guacamolen",
    "rating": 5.2,
    "comment": "The game is perfectly serviceable in its own right, but it just feels like San Juan too much.",
    "timestamp": 1713304800
  },
  {
    "username": "rogedavi",
    "rating": 5.0,
    "comment": "Played a dozen times. I can see that its a good game but I think there are better alternatives out there. Also thought the theming was a bit bland, and what on earth were they thinking with those mind boggling symbols.",
    "timestamp": 1711839600
  },
  {
    "username": "Animepops",
    "rating": 5.0,
    "comment": "Great theme and ideas. Rules and mechanics along with iconography are a bit tough to consume espessially after long periods of not playing. Have to relearn it all each time. Art is aging a bit. New Frontiers is a much better implementation on the series. Bought accidentally thinking it was \"Roll\" for the Galaxy. Still don't have that lol",
    "timestamp": 1710889200
  },
  {
    "username": "Mschaer",
    "rating": 5.0,
    "comment": "Liking this much better as a 2 player game",
    "timestamp": 1710543600
  },
  {
    "username": "squiffles",
    "rating": 5.0,
    "comment": "Culling",
    "timestamp": 1709420400
  },
  {
    "username": "Mykander",
    "rating": 5.0,
    "comment": "Combined with Rebel vs Imperium, The Brink of War, & The Gathering Storm",
    "timestamp": 1708210800
  },
  {
    "username": "ZacharyRD",
    "rating": 5.0,
    "comment": "I have never liked this game -- it feels like it has to big an advantage for folks who have memorized the deck and winning paths.",
    "timestamp": 1705878000
  },
  {
    "username": "StevenKiel",
    "rating": 5.0,
    "comment": "Jump Drive cleaned this game up. Maybe 10 years ago it would have been an 8 but better games have come out.",
    "timestamp": 1705100400
  },
  {
    "username": "boettler",
    "rating": 5.0,
    "comment": "Complexity of 2.99. I just couldn't get into it. Prefer to play other games.",
    "timestamp": 1701126000
  },
  {
    "username": "sverige",
    "rating": 5.0,
    "comment": "Irrelevant",
    "timestamp": 1700607600
  },
  {
    "username": "dogzard",
    "rating": 5.0,
    "comment": "Received from Secret Santa '07\n\nIf I had one word to describe this game, it would be Theme, theme, theme,...\n(OK, that's 3 words, but you get the point)\n\nReally, I want like this game. The card art is stunning, and really enhances the play, at least for me. I like that it has been designed very open-ended, with features that will only be used in future expansions. I can't wait for those.\n\nHowever, I do have issues with the game. For one, the rules - they are not clear at all. In fact, in a lot of cases, they appear to be deliberately ambiguous. That makes it hard to play correctly. Also, the iconography is not very intuitive and is very difficult to learn. I know that I've screwed up every time I've played it. I hope that someday, I'll get a chance to play it correctly, but my game group doesn't care much for it.\n\nDecided not to wait. Traded if for a whole lot of GeekGold.",
    "timestamp": 1698444000
  },
  {
    "username": "kitwick",
    "rating": 5.0,
    "comment": "I ended up selling this - it just didn't grab me. I really wanted to like it, because lots of people whose opinions I respect rave about it, but I just couldn't get into it. Tha space theme is a turnoff for me, and the gameplay was kind of opaque and frustrating. I'm sure there's a great game in there, but with all the other games I have access to that I prefer, I'm not going to put the time in to try to find it.",
    "timestamp": 1694383200
  },
  {
    "username": "Ruwakh",
    "rating": 5.0,
    "comment": "This is a prime example of a game where I can see the brilliance of the design, but it's simply not my cup of tea. I prefer games with high player interaction, and this game has very little. If you are more like my friends who love engine building and optimization puzzles, give this one a try.",
    "timestamp": 1691532000
  },
  {
    "username": "leafbreath",
    "rating": 5.0,
    "comment": "Game is too ugly and has poor iconography.",
    "timestamp": 1691013600
  },
  {
    "username": "poboy",
    "rating": 5.0,
    "comment": "Tried this back in late 2000s and never could get my head around it. Would like to try again.",
    "timestamp": 1686607200
  },
  {
    "username": "spencyrrh",
    "rating": 5.0,
    "comment": "I see a strong solo numbers game here, and a fair metagame as well. Unfortunately, I don't especially like to play multiplayer solitaire engine builders. If I must, I want them to sparkle with a beautiful setting, and offer an intuitive visual language. This game offers none of that. Learning and teaching it is hell.\n======\n\n2023-05-08 (4 plays at 2 & 3 on BGA): I guess what this has over other engine-builders is its speed and lack of other bits. But it's still obtuse and solo.",
    "timestamp": 1683496800
  },
  {
    "username": "data00",
    "rating": 5.0,
    "comment": "────────────────────────────────────────────────────\n푸코처럼 Variable Phase Order 메커니즘이 있고, 호평이 많은 게임이어서 기대를 많이 했습니다.\n\n푸코와 크게 다른 점은, 레포갤은 단계를 카드를 선택해 동시에 공개하여 한다는 것입니다.\n각자 Ⅰ단계 카드, Ⅱ단계 카드... 이렇게 단계 카드 풀을 받고 게임을 시작합니다.\n내가 이번 라운드에 Ⅱ단계 행동을 하고 싶다면, 누군가가 Ⅱ단계 카드를 내면 됩니다.\nⅡ단계 카드를 낸 사람이 2명이어도 Ⅱ단계는 1번만 진행되고 나머지 Ⅱ단계 카드는 무력해집니다.\n\n푸코의 경우에는 단계 이름을 보면 그 내용이 대강이라도 짐작이 가는데요(‘생산’ 단계는 뭔가 생산물이 나오는 단계이겠거니)\n\n레포갤은 단계가 그냥 로마 숫자로 쓰여있습니다.\n\n각 카드에 ‘어느 단계에 어쩌고...’ 이런 내용이 있는데 어느 단계가 뭐하는 단계인지 알려면 (숙달하여 외우지 않았다면)단계 카드를 봐야 합니다. 이 점이 참 번거롭습니다.\n\n손패를 얻는 행동을 할 때 꼭 단순히 뽑는 게 아니라, 뽑은 카드들 중에서 어느 걸 가질지 선택하여 가지게 되는데요,\n손패를 또 비용으로 많이 쓰게 됩니다.\n어느 카드를 가질지 기껏 고민해서 골랐는데, 금방 또 비용으로 내야 하니\n내가 이러려고 어느 카드를 고를지 열심히 고민했나, 자괴감이 들고 괴롭습니다.",
    "timestamp": 1683151200
  },
  {
    "username": "Thip",
    "rating": 5.0,
    "comment": "What I like:\n\n-A good quick fun game. Even though it's short, it still feels satisfying and fulfilling. It doesn't sacrifice strategy for this either. This is usually very hard to accomplish.\n\n\nWhat I dislike:\n-Action selection where you are dependent upon what others do. I don't want to spent my whole game primarily looking and guessing what you might do and try to plan for that. It's fun to some extend, but this mechanic is just too much.\n-The symbols are a pain to learn and teach.",
    "timestamp": 1682805600
  },
  {
    "username": "creid4444",
    "rating": 5.0,
    "comment": "Not as fun as Roll for the Galaxy",
    "timestamp": 1680472800
  },
  {
    "username": "Finnchowder",
    "rating": 5.0,
    "comment": "New. In Shrink.",
    "timestamp": 1680386400
  },
  {
    "username": "tamsynulthara",
    "rating": 5.0,
    "comment": "I remember this as vaguely boring, and difficult to track how well everyone is doing mid-game.",
    "timestamp": 1679612400
  },
  {
    "username": "walkincarpet",
    "rating": 5.0,
    "comment": "missing 1 single point token - otherwise like new. Most tokens / cards unopened.",
    "timestamp": 1679526000
  },
  {
    "username": "bainewedlock",
    "rating": 5.0,
    "comment": "Rating 6 = To someone with a similar taste like me: Try this game once if you get a chance.",
    "timestamp": 1679180400
  },
  {
    "username": "jaceycole",
    "rating": 5.0,
    "comment": "I don't think my wife ad I want to commit the time necessary to really learn and get into this game. Not a game you will enjoy the first couple plays. Likely won't be introducing this to new people. If you had a gamer group that could play this consistently, then could be a good filler. However, I think I'll prolly just end up playing this on BGA.\n\nCouldn't convince wife to play. Will likely just play on BGA.",
    "timestamp": 1678402800
  },
  {
    "username": "dukane",
    "rating": 5.0,
    "comment": "After one play knowing full well that this game is a rough learn, I can both see why it's well liked...but also don't think its better than other similar more streamlined games.\nIt makes me want to try San Juan. I want to give it a few more tries, but unless I play it again soon, I'm probably going to forget what all the symbology means and will have to completely re learn the game.\n\nUpdate: I prefer San Juan, gave this game about 5 chances and I just don't care for it. San Juan is a cleaner game, and I don't miss the supposed depth of RftG.",
    "timestamp": 1678143600
  },
  {
    "username": "churchie679",
    "rating": 5.0,
    "comment": "After a dozen plays of each, Roll for the Galaxy is just more fun to play.",
    "timestamp": 1676934000
  },
  {
    "username": "SVan",
    "rating": 5.0,
    "comment": "I'd rather play Race's main inspiration, Puerto Rico over it. Now that Terraforming Mars Card game uses a similar mechanic (but much more interesting game play), I'd play that over this too.\n\nI thought it was interesting at first, but it feels like you have little control over what you do, unless you draw the right cards. People say you can control the randomness, but I never felt that way.\n\nPlus the theme and gameplay feel uninspiring outside of using Puerto Rico's best mechanic. At least in Puerto Rico, the buildings feel interesting, I didn't feel like many of the cards in Race for the Galaxy were interesting.\n\nMaybe the expansions make the game more interesting to people, but the base game should be good enough to stand on its own. Race for the Galaxy doesn't do that for me.",
    "timestamp": 1675897200
  },
  {
    "username": "valdovinho",
    "rating": 5.0,
    "comment": "Por suerte lo vendí. Me pareció un rollo el juego y normas infumables, iconografía extraña... no me gustó",
    "timestamp": 1675206000
  },
  {
    "username": "Jalix",
    "rating": 5.0,
    "comment": "Learning the iconography was the most challenging part. Repeated plays would solve that however the game just wasn't for me.",
    "timestamp": 1674601200
  },
  {
    "username": "shmonkey",
    "rating": 6.0,
    "comment": "First impression: Fell somewhat flat for me. I see the potential strategy but it wasnt very exciting.\n\nI might have to give this one another shot.",
    "timestamp": 1759874400
  },
  {
    "username": "dj_koen",
    "rating": 6.0,
    "comment": "Fun engine builder game",
    "timestamp": 1759528800
  },
  {
    "username": "Gendalm",
    "rating": 6.0,
    "comment": "Rating based mainly on 2 player games always without direct conflict but including all the cards from the expansion.\n\nI like it as a game giving me the feeling of exploration, conquer and resources management. Comparing to Rune Age (see my comment), it seems faster and to have more replayability and interesting choices.\n\nI am not a big fan of the sci-fi theme, and some lucky draws/combinations may favour one player, but for such short playing time is ok.\n\n9/25 UPDATE: lowered score from 7 to 6 based on comparison with other games I have. It is a bit too complex for new players due also to the symbols I often forget as well and the theme is not appealing enough for me.",
    "timestamp": 1758146400
  },
  {
    "username": "cturner0034",
    "rating": 6.0,
    "comment": "Digital Version",
    "timestamp": 1757023200
  },
  {
    "username": "pmmeyer",
    "rating": 6.0,
    "comment": "A fun game with interesting decisions. I feel like the game ends too abruptly, just when the combos are getting interesting, but a much better game than Roll for the Galaxy.",
    "timestamp": 1756332000
  },
  {
    "username": "ditterio",
    "rating": 6.0,
    "comment": "All the icons were overwhelming. I didn't like my plays of this game. Maybe if I delve deeper in this game, I would appreciate it more? I dunno.",
    "timestamp": 1755208800
  },
  {
    "username": "antonkartashov",
    "rating": 5.9,
    "comment": "2p (duel) or 4p (2×2)\n\nСложность: ●●○ (средняя)\nДлительность: 1 час\n\nКарточная игра 2007 года, которая уже 20 лет держится в топ-100 настолок на BGG. Видимо, хорошо сбалансированная, реиграбельная и интересная.",
    "timestamp": 1755208800
  },
  {
    "username": "Hogsoup",
    "rating": 6.0,
    "comment": "Very good",
    "timestamp": 1752012000
  },
  {
    "username": "Darknlves",
    "rating": 6.0,
    "comment": "Really good game. I'm really just not into it. I would prefer playing something else, even though it's rare for a game to have this deph and play this quickly. It's just not for me.",
    "timestamp": 1751148000
  },
  {
    "username": "Mestail",
    "rating": 6.0,
    "comment": "just so so, poor art and icon display",
    "timestamp": 1750197600
  },
  {
    "username": "Wigdogger",
    "rating": 6.0,
    "comment": "I own Roll for the Galaxy, which I enjoy, but card-based tableau games are not my thing. That probably explains why I hadn't played this game until 2025. After trying it on BGA and playing once in person, it's a fine enough game. The bonuses you get, compared to Roll, are satisfying at times, and the ability to consume more efficiently in this game is welcome.\n\nBut there are just a shit-ton of icons to keep track of on the cards. To be fair, most are fairly straightforward, but when you mix in some of the ones that you have to stare at a bit, and then reference, and then compare to your engine, that can get a bit annoying. Familiarity helps, of course, but it's just one of those things that hurts the game's accessibility to new players.\n\nAs with Roll, the mind game of what phase others pick is the meat of things, and the timing of the end game can add some interest. For me, I found this fine, and I'd play if the mood struck, but I feel the kinetic excitement of Roll, with the allotment of dice, is just more my speed.",
    "timestamp": 1748728800
  },
  {
    "username": "shannyn_north",
    "rating": 6.0,
    "comment": "Chris Wray 6.5\nA bit complicated for what it is. I prefer London, or even San Juan. There are too many symbols to learn, and I don't see this game as being anything so special as to make me want to learn them. Race for the Galaxy strikes me as a game that needs to be played a couple dozen times before it really gets good.",
    "timestamp": 1748642400
  },
  {
    "username": "rkleopold",
    "rating": 6.0,
    "comment": "Keep",
    "timestamp": 1748556000
  },
  {
    "username": "dreamer1789",
    "rating": 6.0,
    "comment": "Learning all the iconography was though and sadly my gamegroup isn't into it. But I am glad to try this one out some more on BGA: snappy turns and lots of strategy. Kudos.\n\nI would pick New Frontiers over this one, though.",
    "timestamp": 1748383200
  },
  {
    "username": "botticus",
    "rating": 6.0,
    "comment": "At times I had too few cards and then too many. It's ok, but I do prefer Roll for the Galaxy a bit more.",
    "timestamp": 1747951200
  },
  {
    "username": "greggles1983",
    "rating": 6.0,
    "comment": "I think this deserves a better score from me, it is a bit tarnished from playing online against experienced players.",
    "timestamp": 1747087200
  },
  {
    "username": "Tyakraman",
    "rating": 6.0,
    "comment": "+ good amount of complexity and possibilites for \"just a cardgame\"\n+ interesting player interactions due to mutual benefits from role selection\n- might get boring once one figured out the optimal strategy",
    "timestamp": 1745532000
  },
  {
    "username": "DarkShelke",
    "rating": 6.0,
    "comment": "Played",
    "timestamp": 1744754400
  },
  {
    "username": "pezpimp",
    "rating": 6.0,
    "comment": "This game has a lot of potential, but it is not very new user friendly, since it helps to know the cards and possible combinations ahead of time. It has a nice Puerto Rico like mechanic of choosing roles each turn and cards that create so many possibilities. After several plays, it gets addictive but you need to play with others of the same level and play often. Those who do will surely love it, just not for me.",
    "timestamp": 1743372000
  },
  {
    "username": "bm6262",
    "rating": 5.5,
    "comment": "Very fast 2-player game, maybe a little too fast. I'd rather play Ares Expedition but the play lengths aren't comparable at all.",
    "timestamp": 1743372000
  },
  {
    "username": "PoisonJamUK",
    "rating": 6.0,
    "comment": "Sadly didn't like up to the hype for me. I'd rather play Res Arcana.",
    "timestamp": 1742166000
  },
  {
    "username": "UndutifulCarrot",
    "rating": 6.0,
    "comment": "Meh. A lot of iconography with a lot more going on, most of which I didn't really care about. Nothing really grasped me about this game.\n\nAlso some of the names were real dumb. Alien Rosetta Stone Planet anyone?",
    "timestamp": 1740956400
  },
  {
    "username": "risune",
    "rating": 6.0,
    "comment": "为啥有人喜欢这个？",
    "timestamp": 1738623600
  },
  {
    "username": "Trachten",
    "rating": 6.0,
    "comment": "Steam",
    "timestamp": 1737932400
  },
  {
    "username": "defexx",
    "rating": 6.0,
    "comment": "card game where the cards are currency as well as actions",
    "timestamp": 1736895600
  },
  {
    "username": "memento_mori_92",
    "rating": 6.0,
    "comment": "Loved Roll for the Galaxy; probably prefer Roll to Race, but want to try Race.",
    "timestamp": 1735858800
  },
  {
    "username": "Mijjy",
    "rating": 6.0,
    "comment": "Like San Juan in space, only not as good as it's another exercise in card churning.",
    "timestamp": 1735426800
  },
  {
    "username": "VeStil",
    "rating": 6.0,
    "comment": "Hard to learn and even harder to master, but well worth it as it is a really tension filled race game. RtfG is a classic for a reason!",
    "timestamp": 1735254000
  },
  {
    "username": "TheBeach0",
    "rating": 6.0,
    "comment": "Removed my rating since it has been so long since I last played.",
    "timestamp": 1734562800
  },
  {
    "username": "tolhs",
    "rating": 6.2,
    "comment": "2024:+1\n\nNotR < 10: 2,3,4\nBest: 2\ntbp:30-40",
    "timestamp": 1733958000
  },
  {
    "username": "tectactoe",
    "rating": 6.0,
    "comment": "+Base Game [6.0] The people that mistake this game for an engine builder fail to realize that the game is called “RACE” FOR THE GALAXY for a reason. Sometimes it’s better to be fast than good. I am amazed at the relatively large decision space that this game crams into both a small box and a very modest playtime.\n\n+Race for the Galaxy: The Gathering Storm [6.0] The additional cards are great and add even more variety to the game. Still unsure about my overall feelings on the global scoring goals—I don’t think they \\hurt\\ the game experience at all, but I’m not sure they can be viewed as a direct improvement, either.",
    "timestamp": 1733958000
  },
  {
    "username": "Dodb66",
    "rating": 6.0,
    "comment": "enjoyable game, lots of combo’s",
    "timestamp": 1733266800
  },
  {
    "username": "ebz28",
    "rating": 6.0,
    "comment": "board with coffee",
    "timestamp": 1733180400
  },
  {
    "username": "pastabatman",
    "rating": 6.0,
    "comment": "It was good for a while, then it became dry as toast. It would take a significant bribe to get me to play this now.",
    "timestamp": 1732143600
  },
  {
    "username": "MathKat",
    "rating": 5.9,
    "comment": "It’s just ok. Will play if that’s what everyone else wants, but I’m over Race and Roll for the Galaxy. Just not that interesting.\n\nRated 5.9 because 6 on BGG means “Ok - will play if in the mood” and I will never be in the mood to play this one again.",
    "timestamp": 1732057200
  },
  {
    "username": "mephezar",
    "rating": 6.0,
    "comment": "a bit fiddly, icons are sometimes hard to recodnize, texts are printed very small",
    "timestamp": 1731970800
  },
  {
    "username": "GrandMasterJ",
    "rating": 5.6,
    "comment": "Very solitaire game. Without player interaction, I found little joy in this game.",
    "timestamp": 1730761200
  },
  {
    "username": "rafiiki",
    "rating": 6.0,
    "comment": "Gameplay seems very dated by today standards, and graphic design a lot more so.",
    "timestamp": 1730329200
  },
  {
    "username": "sr925713",
    "rating": 6.0,
    "comment": "This was a great game. No doubt about it. But we could not get past the (in our group's opinion) terrible iconography and art. Playing was great once you understood the icons but starting at the cards was painful. If they revamped it id consider buying it again.",
    "timestamp": 1728424800
  },
  {
    "username": "ygram",
    "rating": 6.0,
    "comment": "It is a fun game, but the interaction is a too low for my taste. Have only played with 5 players and it is hard to guess what phases are going to happen. Perhaps more interaction on lower player counts?",
    "timestamp": 1728252000
  },
  {
    "username": "Ajohnny101",
    "rating": 6.0,
    "comment": "Played once late at night, it was interesting but didn't really click. I want to give this another go because I think i'll like it more with more plays.",
    "timestamp": 1724796000
  },
  {
    "username": "RobDF",
    "rating": 6.0,
    "comment": "You will get more from the game the more you play it.\nLove the concept.",
    "timestamp": 1723240800
  },
  {
    "username": "cenny",
    "rating": 6.0,
    "comment": "A card game with one interesting mechanic about what phases are actually played. I loved this mechanic, the rest of the game is nothing special. I might need more plays of this to appreciate it more, but the little player interaction is always a turn off for me.",
    "timestamp": 1720389600
  },
  {
    "username": "bbolch",
    "rating": 6.0,
    "comment": "One of the hardest games to learn based solely on the iconography but once learned games are quick and a lots of fun at all player counts.",
    "timestamp": 1718575200
  },
  {
    "username": "PK1988",
    "rating": 6.0,
    "comment": "As popular as this is and as solidly as I assume it is designed I am just not a fan, sorry \n\ngot a copy in trade, going to give it another shot",
    "timestamp": 1717538400
  },
  {
    "username": "tibbles",
    "rating": 6.3,
    "comment": "I liked it, but I wouldn't suggest a game of it. Obscure symbols made it surprisingly hard to teach for a relatively easy game. Base game felt luck dependent once everyone knew how to production cycle and it came down to who got more planets that matched.",
    "timestamp": 1716933600
  },
  {
    "username": "PizzaChip",
    "rating": 6.3,
    "comment": "Nie jestem fanem tego typu gier. Po jednej partii działałam po omacku. Dużo symboli do zapamiętania. Chętnie jeszcze kiedyś bym spróbowała, głównie dlatego, że brat bardzo lubi tę grę i ma wysokie oceny.\n\nOcena po 1 partii w 2 osoby. Średni czas gry = 15 min.\n\nbga\nPrzemek",
    "timestamp": 1716242400
  },
  {
    "username": "luckystreak",
    "rating": 6.0,
    "comment": "I've decided to put this one on the purge pile. Never warmed to it despite all the praise. Player interaction is minimal; unintuitive Action order; a stiff solo mode (Gathering Storm expansion); a business model that kinda sorta wants you to buy expansions to benefit from some of the factions more, and generally all a bit too 'nerdy' for me. I have San Juan which ticks all the boxes where this one doesn't.",
    "timestamp": 1715724000
  },
  {
    "username": "Nactra",
    "rating": 6.0,
    "comment": "Unsure what to think. Artistic direction is rather immature, game is good but maybe overrated. Compared to Innovation, it's pretty bad.\n\n2022 update: it's better than it's a wonderful world, and it's probably fairer to compare those to than to compare it to the marvel that is Innovation.\n\n2023: 8>7. Maybe it will be more to my tastes with the drafting variant ? i could see it being a strictly better drafting game than IaWW.",
    "timestamp": 1715205600
  },
  {
    "username": "Serbin",
    "rating": 6.0,
    "comment": "Decent card game. Giant stack of cards, suffers from a bit of luck. The best games are where both players get bad draws and have to figure out a solution. If two players of equal skill go at it, the player who draws the better cards will win.\n\nAlso, the art is just bad. Bad perspective, weird faces. You can make the argument that the figures on the cards are aliens and it's ok that they look weird, but it's quite a coincidence that all the aliens look like humans as drawn by someone with a poor sense of perspective. Iconography is very concise, but that's not necessarily good. Why is there a teal color and a lime green color? Why is the \"goods\" icon shaped exactly like the card draw icon? Why are there cards with a reddish brown circle surrounded by a red circle? These are just poor choices that just stand out as unexpected inconveniences when compared to a modern game.",
    "timestamp": 1714946400
  },
  {
    "username": "Citan7",
    "rating": 5.5,
    "comment": "I have some fun playing this, but I think it's showing its age as other games have built upon its ideas so much. I feel like I missed out on when this would have felt like a better one to play, but I can see where once it shined. Not too interested in playing it anymore, but it's quick enough that I won't turn it down if someone else is interested.",
    "timestamp": 1714946400
  },
  {
    "username": "NoClueDough",
    "rating": 6.0,
    "comment": "On APP, only.\nIt's ok.",
    "timestamp": 1714428000
  },
  {
    "username": "Savcore",
    "rating": 7.2,
    "comment": "It is a good game. Short engine building, that it surprisingly complex for the length. You need 5+ games to understand it. The engine part of it is satisfying, but too short. I feel it is a too hard of a squeeze for the juice. As a short engine building, i think \"Its a wonderful world\" is more intuitive and modern and a better pick.",
    "timestamp": 1762596540
  },
  {
    "username": "FaseMenosUno",
    "rating": 7.0,
    "comment": "Precio de compra 31,5. Precio de venta 27,5. Total 4",
    "timestamp": 1762557240
  },
  {
    "username": "bigduke8",
    "rating": 7.0,
    "comment": "2-4 R 2-4 B 2",
    "timestamp": 1762383600
  },
  {
    "username": "Gatts95",
    "rating": 7.0,
    "comment": "BGA",
    "timestamp": 1762297200
  },
  {
    "username": "Urbanwatts",
    "rating": 7.0,
    "comment": "Online implementation is fine but these games thrive in person. Excited to dive more into it!",
    "timestamp": 1762297200
  },
  {
    "username": "Ephorus",
    "rating": 7.0,
    "comment": "What I like:\n- Highly addicting.\n- Card shedding in order to play cards is a constant struggle of \"do I play now\" or \"do I wait another turn\".\n- Card drawing luck is present but mitigated due to card draw +5 action.\n- Works with any player count - does especially shine with 2 players.\n- A game only lasts around 10 to 15 minutes.\n\nWhat I dislike:\n- Is less interactive compared to my other favorites.",
    "timestamp": 1762038000
  },
  {
    "username": "optimo65",
    "rating": 7.0,
    "comment": "VARATTU\n35 €\nincluding the three expansions",
    "timestamp": 1761778800
  },
  {
    "username": "MorelliBuendia",
    "rating": 6.5,
    "comment": "Great 2p game. Fast game, a race for the points. You finish a game and you want to play another. Can be played in about 30 minutes. I recommend the advanced rules for 2p. We started using them in our second game and it improves everything a lot, allowing for more combos and improving the flow of the game.\n\nMogul Scale: 2/B. Pretty easy once you get used to the iconography.",
    "timestamp": 1761692400
  },
  {
    "username": "rws2029",
    "rating": 7.3,
    "comment": "Achieving classic status…\n• There have been many spin-offs, but the original is still the best.",
    "timestamp": 1761692400
  },
  {
    "username": "rongbeo93",
    "rating": 7.0,
    "comment": "At first, Race for the Galaxy can feel overwhelming with its dense iconography—it’s a real hurdle for new players. But after 5–6 plays, once you start recognizing the cards and icons, the game opens up into a crunchy, fast-paced card game full of endless strategies and combinations. The action selection system is clever, reminiscent of Puerto Rico, but streamlined into a much faster experience. I strictly play the digital version since the setup is instant and the playtime much quicker. The game shines best as a 2-player experience, though it doesn’t scale as well with larger groups.",
    "timestamp": 1760392800
  },
  {
    "username": "DevOpsProDude",
    "rating": 7.0,
    "comment": "63.5x88 - 695\n\nPlayed with friends.",
    "timestamp": 1760047200
  },
  {
    "username": "danielmleitao",
    "rating": 7.0,
    "comment": "Rated: 04/2022\nEdited: -",
    "timestamp": 1759183200
  },
  {
    "username": "brunogaia",
    "rating": 7.0,
    "comment": "More than 200 games played, then we lost count...\nExcellent game, especially with the expansions that bring some interaction into it!",
    "timestamp": 1759183200
  },
  {
    "username": "gianlucadario87",
    "rating": 7.0,
    "comment": "B_F3",
    "timestamp": 1758751200
  },
  {
    "username": "Wolcik",
    "rating": 7.0,
    "comment": "Digital version available (PC, Android and BGA)",
    "timestamp": 1758751200
  },
  {
    "username": "ahrnge",
    "rating": 7.0,
    "comment": "I prefer rftg as a quick two player duel. Good, light engine building with a bit of mind games.\n\nPlaying this game on BGA, the game runs about 8 minutes, and you routinely run into folks who have 20,000+ plays under their belts. I feel like I more or less understand the strategy after about a hundred plays, but I still consistently get stomped by the best online players, so obviously I don't.\n\nI suspect the system of discarding cards to pay for other cards, along with the wide variety of viable archetypes to combine or pivot between, accounts for a lot of the high skill ceiling. The game presents a wide range of real options each turn, many of which you must immediately opt out of permanently.\n\nOn the whole I'm quite impressed by rftg, but in terms of how much I actually like it, it's definitely not more than an 8. It's ugly. The symbols are rough. The theme is meh for me. I'm often simply frustrated by not having enough time to achieve what I want, or frustrated by watching my opponent achieve EXACTLY what they want and knowing it's too late to do anything about it. RFTG doesn't pull punches, and sometimes it's more annoying than fun for me.",
    "timestamp": 1758664800
  },
  {
    "username": "rafaelpaz",
    "rating": 7.0,
    "comment": "The game looks good, but I haven't seen everything they say.\n\nI won games without even looking at what the other player was doing, this bothers me a lot.\nFurthermore, it is past time for a new version with revamped symbolism.\n\nMaybe with more games it will improve in my opinion, I played it 4 times and for now this is the rating.",
    "timestamp": 1758232800
  },
  {
    "username": "Ooluong",
    "rating": 6.5,
    "comment": "[Played once]",
    "timestamp": 1758060000
  },
  {
    "username": "esayitch",
    "rating": 7.0,
    "comment": "SOLD because it did not hook Jenny, and I prefer to play other games with my group as I play it often enough on the app.\n\n~\n\n1) Build a vast space-empire by exploring, developing, settling, consuming, and producing.\n2) THE engine/tableau-builder. Cards are used to denote goods, to be built (denote developments and planets in your empire), and as money. The winner is the one with the most points after a single empire has been completed or after the VP pool has been exhausted.\n3) I loved: The insane variety in just the base game, coupled with an elegant and simple game system, the satisfaction of building and using your engine to score big, the satisfaction of successfully predicting what role your opponents will select and thus piggybacking off of their action, how quick it plays and how many deep decisions it spans, the app.\n4) Could be improved: Graphics and theme are a bit drab and generic, respectively... and in general the components are so-so.\n5) I think this is a great design and a fantastic game. I play it mostly on the app and enjoy playing it, but the generic theming and lacklustre components reduce my enjoyment of it.",
    "timestamp": 1757973600
  },
  {
    "username": "AlPacino11",
    "rating": 7.3,
    "comment": "Nice, but overrated. I prefer San Juan.",
    "timestamp": 1757887200
  },
  {
    "username": "destro",
    "rating": 7.0,
    "comment": "Ph",
    "timestamp": 1757800800
  },
  {
    "username": "Blix",
    "rating": 7.0,
    "comment": "Respect, Not Love",
    "timestamp": 1757714400
  },
  {
    "username": "deadpanavocado",
    "rating": 7.0,
    "comment": "i've only played this mobile so i have no idea how to play and i win like 25% of games against 2 AIs so don't take my word for this",
    "timestamp": 1757455200
  },
  {
    "username": "ultimoratio",
    "rating": 7.0,
    "comment": "Update: APR 2025\n\nBrink of War BAD!\n\n========================\n\nUpdate: MAR 2023\n\nIt really doesn't matter which expansion arc to use as they are all great.\nGS + RvI is awesome with the goals and takeovers. Never tried it with BoW though.\nAlien Artifacts is great. Without the Orb mode is the closest to OG Race.\nXeno Invasions gave military interaction more heft.\n\n==============================\n\nNot as accessible as San Juan nor Fields of Green, but this card game is the best one out there. Race for the Galaxy is the benchmark - If I'm playing a card tableau game and I end up saying \"I'd rather play Race\", then you just failed. That's how I highly regard Race.\n\nThe simultaneous action selection made the game deeper and more subtle. The addition of goals from the first two expansions made the game more interesting.",
    "timestamp": 1757368800
  },
  {
    "username": "tar heel",
    "rating": 7.0,
    "comment": "Had to have it. I have only played it running multiple hands myself. I haven't found anyone else to play, but I have the expansion that adds solo and I should get around to that eventually. Although at this point I'm pretty much just playing on my computer and finding other games to play that do have local players.",
    "timestamp": 1757109600
  },
  {
    "username": "Astronica",
    "rating": 7.0,
    "comment": "Really good game, one of it's main advantages is that it's relatively quick and easy to play once you've wrapped you head around the actions and symbology. Really enjoyable game.",
    "timestamp": 1756936800
  },
  {
    "username": "korosuuu",
    "rating": 8.0,
    "comment": "???",
    "timestamp": 1762383600
  },
  {
    "username": "Cricote",
    "rating": 8.0,
    "comment": "+ The Gathering Storm\n+ Rebel vs. Imperium\n+ The Brink of War",
    "timestamp": 1762124400
  },
  {
    "username": "Derianhorgen",
    "rating": 8.0,
    "comment": "SpielboxRating 6-9, av. 7,67",
    "timestamp": 1762038000
  },
  {
    "username": "PBandJellyfish",
    "rating": 8.0,
    "comment": "@SC",
    "timestamp": 1761170400
  },
  {
    "username": "thegreatbandini",
    "rating": 8.0,
    "comment": "A wonderful game with so much depth",
    "timestamp": 1761084000
  },
  {
    "username": "HarryCrocker",
    "rating": 8.0,
    "comment": "Superb at 2",
    "timestamp": 1760652000
  },
  {
    "username": "Kovie2",
    "rating": 8.0,
    "comment": "One of the best engine building card games. Has a bit of a learning curve. The base set has a lot of replayability even though it doesn't seem like it would.\nThe 1st expansion is solid, though I'm a bit torn on the objectives.",
    "timestamp": 1760392800
  },
  {
    "username": "joseverdin10",
    "rating": 8.0,
    "comment": "Love this game so much! Gets satisfying engine building right. Plays super fast digital but still plays compact physical. Love it best at 2 players. This game I have not gotten tired of even after about 100 plays now. Talk about depth and staying power! My favorite 2 player game at the moment.\n\nUpdate, down to an 8 from a 10. I think this game is hard to table and is actually more fun digital since it speeds the game up to my liking.\n\nUpdate: Sold",
    "timestamp": 1760306400
  },
  {
    "username": "Bramblingfool",
    "rating": 7.5,
    "comment": "(Digital)",
    "timestamp": 1760133600
  },
  {
    "username": "Petito",
    "rating": 8.0,
    "comment": "Obaleno\n1 - Expansion and Brinkmanship\n2 - Xeno Invasion",
    "timestamp": 1760047200
  },
  {
    "username": "edubvidal",
    "rating": 8.0,
    "comment": "Un juego evolucionado del San Juan y mejorado pero que también lo hace más complejo las primeras partidas. El tema espacial dejó de interesarme pero es un gran juego de cartas. Qué carta me quedo, con qué cartas pago... Una carrera por ser el primero en terminar bajando diez cartas y obtener más puntos.\nEl solitario de la primera expansión era un poco rollo.\nLa segunda y tercera expansión eran para muy fans. Terminábamos jugando sólo con el base.",
    "timestamp": 1759960800
  },
  {
    "username": "Ddyraw",
    "rating": 8.0,
    "comment": "Fast card game with lots of extras, want to reacquire and play with game group",
    "timestamp": 1759442400
  },
  {
    "username": "DoctorPhil",
    "rating": 8.2,
    "comment": "Criteria (out of 5)\nRules complexity 4\nPlaytime/complexity ratio 5\nStrategic avenues 5\nMechanism strength 4\nThematic integration 3\nVariability 4\nReplayability 4\nFun factor 4\nSolo mode\nPlayer interaction 4\nElement of mastery 4\n\nOverall 8.2 out of 10",
    "timestamp": 1759356000
  },
  {
    "username": "Arseny_Vasily",
    "rating": 7.5,
    "comment": "An entertaining economic engine building game for set collection, hand management and multi-use cards with huge replayability due to the large content and game strategies adjusted to the release of cards and the opp's game, as well as strong skill dependence and competitiveness. There is no straight conflict, but there is an element of the race, where the actions of the players act as a timer. The game lives up to its name and is a real race for galactic supremacy!",
    "timestamp": 1758924000
  },
  {
    "username": "canemarrone",
    "rating": 7.5,
    "comment": "Very unattractive but well designed game. I kind of like it but maybe too abstract. The compactness factor is high, I really appreciate all this content being just a deck of cards with minimal text. The simultaneous selection action cards are fun and really elevates the experience. I can see the potential for many plays without getting stale.",
    "timestamp": 1758751200
  },
  {
    "username": "LittleDuke",
    "rating": 8.0,
    "comment": "Great tableau card game, with many interesting interactions and strategies to choose from.",
    "timestamp": 1758492000
  },
  {
    "username": "lapin",
    "rating": 7.5,
    "comment": "Attic",
    "timestamp": 1758319200
  },
  {
    "username": "nickvdb22",
    "rating": 8.0,
    "comment": "SELLING",
    "timestamp": 1758232800
  },
  {
    "username": "Lecaro",
    "rating": 7.5,
    "comment": "Kurzrezension:\nEin \"Race for the Galaxy\" ist gestartet, bei dem jeder Spieler möglichst schnell die Galaxie bevölkern, um damit Ruhm zu erlangen. Um dieses Ziel zu erreichen, müssen Planeten besiedelt oder erobert sowie neue Technologien erforscht und zur Anwendung gebracht werden.\n\nSpielablauf:\nDie Spieler starten mit einer kleinen Hand voll Karten. Diese dienen im Spiel neben ihren Eigenschaften nach dem Ausspielen als Zahlungsmittel.\nDas Spiel ist in fünf Phasen aufgeteilt. Welche davon gespielt werden, wird von den Spielern selbst bestimmt, indem sie zu Beginn jeder Runde eine Phasenkarte wählen und jeder seine dann gemeinsam aufdeckt.\nIn Phase '1', der 'Erforschung' erhalten die Spieler neue Handkarten vom gemeinsamen Nachzugstapel. In Phase '2' der 'Entwicklung' dürfen die Spieler Entwicklungskarten ausspielen und müssen diese mit ihren restlichen Handkarten bezahlen, indem sie diese abwerfen. Beim 'Besiedeln' in Phase '3' verhält es sich ähnlich, nur dass Planetensysteme ausgespielt werden, auf denen Güter hergestellt werden können. Militärische Welten benötigen obendrein genügend Stärke, um ausgespielt zu werden. Phase '4' kümmert sich dann um den Verbrauch von Gütern, die auf den Planetensystemen liegen und sorgen so für Punkte oder neue Handkarten. Um an diese Güter zu kommen, ist die 'Produktion' in Phase '5' zuständig, womit alles erklärt ist.\nDiejenigen Spieler, die eine Phase ausgewählt haben, erhalten in dieser eine etwas stärkere Fähigkeit als die anderen Spieler, aber alle gewählten Phasen werden dennoch von allen Spielern genutzt. Phasen, die nicht gewählt wurden, werden in der Runde einfach übersprungen.\nSobald ein Spieler 12 Entwicklungs- und/oder Planeten vor sich ausliegen hat oder der Vorrat an Siegpunktechips zur Neige geht, endet das Spiel und derjenige mit den meisten Punkten gewinnt.\n\nMeinung:\n\"Race for the Galaxy\" ist bereits einige Jahre alt, hat aber keinesfalls an Charme verloren. Besonders clever ist natürlich die Mechanik, die Handkarten sowohl als auszuspielende Karten, als auch als Zahlungsmittel zu verwenden. Das sorgt dafür, dass sich die Spieler immer wieder von Karten trennen müssen, die sie eigentlich ausgespielt vor sich liegen sehen wollten. Ein toller Konflikt.\nDie Symbolsprache ist das, worüber viele Spieler bei \"Race for the Galaxy\" stolpern. Sobald sie einmal verstanden ist, kann sie aber gut nachvollzogen werden. Zu Beginn versteht sie aber wirklich niemand. \nIch finde \"Race for the Galaxy\" ein sehr gutes Spiel, das über die Jahre nur sehr wenig Spielreiz verloren hat. Leider kommt es dennoch nicht sehr häufig auf den Spieltisch, was definitiv geändert werden muss.",
    "timestamp": 1758232800
  },
  {
    "username": "peterlevi",
    "rating": 7.5,
    "comment": "(open)\n\nIt's biggest asset is that it plays very fast (20-40 min per game), and in this time gives sufficient options to build a real engine and exploit it a bit.\nIt's biggest downside is interaction is too low. Yeah, there is some with trying to predict the action selection, but that's about it.\nCards lead to variability, but not to a huge extent.\nOverall it's still a fun game.\n\nFor a much more varied experience with a lot higher interaction and more table talk, another card game I highly recommend is Innovation, but it plays slower.\n\nEpic: Upping a tad to 7.5 cause I find I'm often seeking RftG as a quick game with enough level of depth that works well at two. But I still lack more interaction in it.",
    "timestamp": 1758060000
  },
  {
    "username": "TribalTiger",
    "rating": 8.3,
    "comment": "2007",
    "timestamp": 1758060000
  },
  {
    "username": "MrRib",
    "rating": 8.0,
    "comment": "Sleeved",
    "timestamp": 1757973600
  },
  {
    "username": "SatchmoZ",
    "rating": 8.0,
    "comment": "Own physical and iOS versions. Fun. A bit more complex due to all of the symbols and things, but it is still a great game once you get into the flow of it. Excited to play more!",
    "timestamp": 1757714400
  },
  {
    "username": "WVinz",
    "rating": 8.0,
    "comment": "2.99",
    "timestamp": 1757714400
  },
  {
    "username": "bnordeng",
    "rating": 8.0,
    "comment": "This is a really well designed game. Unfortunately, I feel no theme what-so-ever when I play it. That doesn't ruin the game for me, it just doesn't help it either. One problem I have is that I am a middlish-level player. So, when I play against people who haven't played, I almost always win by a lot and when I play against people who've played a lot, I almost always get killed. Not enough close games... but I'm looking to play it more. Thank you secret santa 2008!",
    "timestamp": 1757455200
  },
  {
    "username": "Rubeus",
    "rating": 8.0,
    "comment": "EN VENTA.",
    "timestamp": 1757368800
  },
  {
    "username": "zyklonc",
    "rating": 8.5,
    "comment": "R",
    "timestamp": 1762622340
  },
  {
    "username": "NairHotel",
    "rating": 9.0,
    "comment": "Faster Puerto Rico. Such a fun game to play, so quick once you get the hang of it",
    "timestamp": 1762470000
  },
  {
    "username": "Cerberus777",
    "rating": 9.0,
    "comment": "(App owned)\n\n My Best Value Game!\n My Best Digital Board Game!\n My Best Engine-Building Game!\n My 3rd Best Hand Management Game!\n My 2nd Best Variable Phase Order Game!\n My 2nd Best Simultaneous Action Selection Game!\n\n\n IMPORTANT NOTE: This rating is done considering that I have played both the game in it's tabletop form (base game only) and digitally (base game and with some expansions).\n\n\nBase Game: BGA Digital Games Played = 174 times\n (I could have paid for these and it would have been an EPIC purchase!)\n\nBase Game: App Digital Games Played (Standalone / With Expansions) = 229 + 639 = 868 times\n EPIC Purchase! (Less than 25¢ per hour!)\n\nWith The Gathering Storm Expansion: App Digital Games Played = 639 times\n EPIC Purchase! (Less than 25¢ per hour!)\n\nWith Rebel vs Imperium Expansion: App Digital Games Played = 436 times\n EPIC Purchase! (Less than 25¢ per hour!)\n\n**********\n\nBase Game: Games Played (Standalone / With Expansions) = 12 + 0 = 12 times (26-52)\n Great Purchase! (Less than 4$ per hour!)\n\n\n\n COMPLETE RATING\n\n\nSCORE  CRITERIA       WEIGHTING       ------- STAR RATING SCALE -------\n\n(9.5) FUN             (x15):         BORING  REALLY FUN\n\n(10!) GAMEPLAY         (x5):       NO DEPTH  LOT OF DEPTH (FOR THE WEIGHT)\n(8.5) GAME FLOW        (x5):         FIDDLY  SILKY SMOOTH\n(9.5) DOWNTIMES        (x2):         LOT OF  ZERO\n(8.0) RANDOMNESS       (x2):      PURE LUCK  PURE SKILLS\n(8.5) MECHANICS        (x2):         BORING  INTERESTING / INNOVATIVE\n\n(9.5) REPLAYABILITY    (x5):           ZERO  INFINITE\n(7.0) SCALABILITY      (x3):           POOR  GREAT AT ALL PLAYER COUNTS\n(8.5) PORTABILITY      (x1):          BULKY  SUPER EASY TO PLAY ANYWHERE\n\n(9.0) THEME            (x1):   UNATTRACTIVE  ATTRACTIVE\n(7.0) AESTHETICS       (x1):           UGLY  GORGEOUS\n(6.0) COMPONENTS       (x1):    LOW QUALITY  HIGH QUALITY\n(10!) VALUE            (x2):  TOO EXPENSIVE  REALLY CHEAP(LOW COST FOR WHAT WE GET)\n\n(9.5) SETUP TIME       (x2):           LONG  ZERO\n(10!) GAME LENGTH      (x2): TOO SHORT/LONG  JUST PERFECT\n(6.0) RULES COMPLEXITY (x1):        COMPLEX  SIMPLE\n\n\nTOTAL = 451.0/50 = 9.02\n\n\n POSITIVE POINTS:\n\n++ Excellent medium weight tableau-builder / engine-builder card game where players need to adjust to what is available (mostly a tactical game).\n++ Great replayability from the different card drawn and the many path to victory already included in the base game.\n++ I really like all the little winks to the classics of Sci-Fi movies/series/novels that we can find in this universe.\n++ Good card graphic design, that is clean and clear, although I would have not put as many remainder icons on the cards (like the ones upside down about the production at the right of the card's name) which overload newer players. I would also use a bit more often the text description boxes of special powers, in order to ease player into the icons.\n++ Fast to set-up and fast to play, especially with experienced player.\n++ There are several expansions available for this game (which is useful to refresh the game when we have overplayed it).\n\n\n NEGATIVE POINTS:\n\n-- I would have like another way other than cards for the phase selection: a lot of people have made awesome other means like selector dials, heptagone/disk selector, magnetic selector, etc.\n-- The art, although fine, feels a bit dated now (and low resolution), as the black border cards (instead of having borderless card with full art).\n-- The components are overall of good quality for the price but the VP chits feels a bit cheap as they are small and they were harder to punch than usual.\n-- For these three complains above, a deluxe version of the game with upgraded components and updated art would be awesome and I would be a first day backer/buyer if it was real, but I really doubt it will happen, but we can always hope.\n-- Really hard to teach or learn as there is so many icons on the cards (though they are logical and mostly well thought out once it clicks) and the so many little rules here and there (less streamlined than San Juan), so the learning curve for this game is steep and require new player to invest time for 4-5 games in order for the game to click.\n\n\n OTHER GAME INFO:\n\nGame Weight = 3.0/5\nRelease Date = 2007\nNumber of Player = 2-4\nBGA online game length = 10-15 min.\nApp game length = 5-10 min.\n2-player length = 30-45 min.\nX-player length = 45-60 min.\nPlayer Count Preference = Best at 2, great at 3, recommended at 4!",
    "timestamp": 1762383600
  },
  {
    "username": "WindSoul",
    "rating": 9.0,
    "comment": "@ jobbet",
    "timestamp": 1762297200
  },
  {
    "username": "AndiHOhneYpsilon",
    "rating": 9.0,
    "comment": "One of the best engine builders on the market. With tons of cards and possible synergies it delivers a endless replayability.\nThe hard to read iconography makes it a bit difficult to learn and you will constantly have to look up for the players aid.\n\nsleeved",
    "timestamp": 1761692400
  },
  {
    "username": "mikee385",
    "rating": 9.0,
    "comment": "This game definitely feels exactly like what San Juan should've been. In San Juan, I always feel like there isn't enough time to actually play the cards I want and I end up simply being at the mercy of the cards in my hand, but with Race, I've generally been able to plan out strategies, execute them well enough, and have a decent chance of winning the game. I like that there's a distinction between military planets, non-military planets, and developments, which allow you a variety of methods for building, and I especially like that the military buildings don't require discarding cards from your hand. There's a large diversity of cards and abilities that can be found in the deck, which numerous choices about which strategy to pursue. However, I've become tired with it as the additional expansions have greatly increased the \"race\" aspect of the game and limited the engine-building aspect. After many years away from this one, I've started playing it solo recently and have been loving it. I expect my rating will climb higher with more plays. It perfectly satisfies my desires for an engine builder that is quick, fun, and easy to play.",
    "timestamp": 1761606000
  },
  {
    "username": "merez",
    "rating": 9.0,
    "comment": "Rating for 2p advanced variant.",
    "timestamp": 1761606000
  },
  {
    "username": "Asphodele",
    "rating": 8.5,
    "comment": "Non official solo variant",
    "timestamp": 1761429600
  },
  {
    "username": "antiproton",
    "rating": 9.0,
    "comment": "It's a strange game, the learning curve is very very long",
    "timestamp": 1761429600
  },
  {
    "username": "LannisterCrimson",
    "rating": 9.0,
    "comment": "Bling Status ✓\n\nExpansions: ✓\nPromos: -\nSpecial Edition: -\nUpgraded Components: ✓ acrylic tiles",
    "timestamp": 1761256800
  },
  {
    "username": "Groak",
    "rating": 9.0,
    "comment": "Classic card game with a stunning strategic variability.",
    "timestamp": 1760738400
  },
  {
    "username": "MoochyMania",
    "rating": 9.0,
    "comment": "* Solo Mode ✓\n* Sleeved - why not",
    "timestamp": 1760652000
  },
  {
    "username": "kldonnelly",
    "rating": 9.0,
    "comment": "Also own:\nNew Worlds promo\nRetrofit Cards\n\nRebel vs Imperium\nThe Brink of War\nThe Gathering Storm\n\nAlien Artifacts\nXeno Invasion\n\nWant to Buy:\nXeno Counter-Strike (when it's released)",
    "timestamp": 1760652000
  },
  {
    "username": "CharlesKink",
    "rating": 9.0,
    "comment": "with expansions",
    "timestamp": 1760652000
  },
  {
    "username": "revloc06",
    "rating": 9.0,
    "comment": "Feel like I need to play 20-30 more times before I get a feel of the cards and their uses. Looking forward to the expansion though...now that I've played 20-30 times, I love this game. The learning curve on the cards is steep, otherwise this game rightly deserves to be a top 10 game in my closet.",
    "timestamp": 1760565600
  },
  {
    "username": "strongbadia",
    "rating": 9.0,
    "comment": "X",
    "timestamp": 1760479200
  },
  {
    "username": "lehalls999",
    "rating": 8.5,
    "comment": "15€ Walla",
    "timestamp": 1760306400
  },
  {
    "username": "pibastro28",
    "rating": 8.5,
    "comment": "Bello Bello. Ma simbologia veramente cervellotica.",
    "timestamp": 1760047200
  },
  {
    "username": "thefiddler",
    "rating": 9.0,
    "comment": "Greate game. Fast and meaty. The app is also great.",
    "timestamp": 1759960800
  },
  {
    "username": "WurliMonkhaven",
    "rating": 9.0,
    "comment": "Great fun. A nice tableau builder that lets you create a wide variety of engines. Honestly one of my favourite games.\n\nOnly criticisms would be:\n1. Can be difficult to teach newbies at it relies heavily on abstract iconography rather than written rules on cards.\n2. Military OP.",
    "timestamp": 1759442400
  },
  {
    "username": "Adripg3",
    "rating": 9.0,
    "comment": "2025",
    "timestamp": 1759356000
  },
  {
    "username": "davidystephenson",
    "rating": 9.0,
    "comment": "Great use of simultaneous action selection and multi-use cards. Tense, skillful, and easy once you wrap your head around the symbology. Still too much luck for my tastes.",
    "timestamp": 1758751200
  },
  {
    "username": "qaiden",
    "rating": 8.5,
    "comment": "Android + bg",
    "timestamp": 1758578400
  },
  {
    "username": "tobytoast",
    "rating": 9.0,
    "comment": "Great game! But one that needs a graphic design revamp – *not* including the delightfully wonky 80s Dr. Who-esque background illustrations. Love those.\n\nDie-hard fans of RFTG would probably rebel against that kind of modernising imperial maneuver, but grey backgrounds? Yeesh. To be fair, the style reminds me of Commodore 64 game manuals which is pleasantly nostalgic, and yes the iconography clear and understandable (don't understand the complaints there). It’s probably also colour-blind friendly, but I'd buy a colour-blind antagonistic deluxified big box edition with a more subtle palette and typography in a heartbeat.",
    "timestamp": 1758232800
  },
  {
    "username": "dominustrick",
    "rating": 9.0,
    "comment": "Im giving this one a high rating. While player interaction is limited, I feel that the game mechanics are solid and since it is not a fighter (in any way shape or form) I'll forgive the lack of deep player interaction. For me I really think the use of the cards is exceptional, it reminds me of the efficiency of a card battle game to get all the components taken care of. I only wish that someone would take the same concept and take it to that level of player interaction that many people are looking for",
    "timestamp": 1758060000
  },
  {
    "username": "kwhite1",
    "rating": 9.0,
    "comment": "P",
    "timestamp": 1758060000
  },
  {
    "username": "I_Cheese",
    "rating": 10.0,
    "comment": "My Number One Game.",
    "timestamp": 1762383600
  },
  {
    "username": "JosiahCuff",
    "rating": 10.0,
    "comment": "Very fun tableau building game with some enjoyable strategy (even if those icons can be hard to teach to new players).",
    "timestamp": 1762210800
  },
  {
    "username": "serscop",
    "rating": 9.8,
    "comment": "Che giocone. Un pool di carte da giocare, costruire, pescare ma soprattutto scartare per attivare abilità e risorse nella galassia. Un card game che nasconde fin troppo bene una serie di processi e strategie. Bellissimo!\n\nP.S. Spero solo in una rivisitazione grafica",
    "timestamp": 1762210800
  },
  {
    "username": "Scifi66",
    "rating": 10.0,
    "comment": "->25Mar Update coming back to this game after a break makes me realise just how great RftG is. Truly elite. I'd give this an 11 if I could. One of a handful of games I'd take with me from a collection fire.\n\n->23Aug Updat.e It is hard to track how many plays on this one but hundreds of IRL plays and a thousand online?\n\n->22Oct Update after many more games on BGA. The implementation is superb and you can find players of all levels for 5-10 minute games.\n+ Have more appreciation for the goals, not my preferred setup but they do give the game some interesting variance.\n\nLove, love this game. Once you are over the barrier of the symbology, one of the best tableau builders in gaming.\n++ Quick! Two players who know the game can crank out a in 10-15 mins! Superb for the decision space and weight.\n+ Diverse strategies\n+ Art is very well done\n+ Great depth\n+ Many expansions can take the game where you want it to go, solo mode, 5th player, orbs, extra cards, takeovers, goals etc.\n- Teaching it\n- Some strategic paths in the base box are a bit too niche but this is fixed by changes with Gathering Storm or Aliens Artefacts expansion either of which I recommend as a must buy.\n\nI have both Alien Artefacts and Gathering Storm expansions. GS is my favourite.",
    "timestamp": 1761951600
  },
  {
    "username": "samwood321",
    "rating": 10.0,
    "comment": "My only criticism is that it's tough the first few times you play it to understand the iconography, but it's a really fast, fantastic game. Particularly good at two players.",
    "timestamp": 1761692400
  },
  {
    "username": "Imsevimse",
    "rating": 10.0,
    "comment": "Best in class. Quick setup, short playtime, yet remarkably strategic gameplay. The card design is sleek and elegant, and the in-game card economy is superb. I’m not usually a fan of role/phase selection, but here it’s handled brilliantly—creating meaningful decisions and just enough player interaction. While it leans more mechanical than thematic, the art and setting still draw me in. Top-tier design!",
    "timestamp": 1761606000
  },
  {
    "username": "Penguinised",
    "rating": 10.0,
    "comment": "Race has been my favourite game for the better part of 15 years at this point, and that position is only further cemented by each additional play. This design feels like playing Puerto Rico but with 100 different buildings and almost limitless freedom of decision making.\nIt's complex for sure, but if you can get past your first few plays learning the hugely intuitive iconography, there is a galaxy of possibilities in this box.",
    "timestamp": 1761606000
  },
  {
    "username": "414448",
    "rating": 10.0,
    "comment": "This game just keeps giving. It's so tense and deep! Great \"weight per minute\" ratio!\n\nI've reviewed this game. See my list of reviews:\n\nhttps://boardgamegeek.com/threads/user/1294622?forumname=rev...",
    "timestamp": 1761519600
  },
  {
    "username": "whitecatplays",
    "rating": 10.0,
    "comment": "It's like the Rolls-Royce of games.",
    "timestamp": 1760738400
  },
  {
    "username": "fazermozg",
    "rating": 10.0,
    "comment": "+",
    "timestamp": 1760652000
  },
  {
    "username": "godunow",
    "rating": 10.0,
    "comment": "+ Gathering Storm\n+ Rebel vs Imperium\n+ New Worlds",
    "timestamp": 1760479200
  },
  {
    "username": "gwsharkerik",
    "rating": 10.0,
    "comment": "Definitely a deep dive to learn for the casual gamer. But very addictive once you're in.",
    "timestamp": 1759960800
  },
  {
    "username": "ValerianofEternia",
    "rating": 10.0,
    "comment": "Pros :\n• High replayability thanks to a huge variety of cards and strategies paths\n• Elegant and deep engine-building with quick, satisfying turns\n• Clever role selection mechanic rewards smart predictions\n\nCons :\n• Steep learning curve due to icon-heavy design and phase system\n• Dated visuals and average components\n• Generic sci-fi theme lacks immersion\n\nConclusion :\nA smart and face-paced engine-building card game with deep strategy and great replayability.",
    "timestamp": 1759788000
  },
  {
    "username": "psicek",
    "rating": 10.0,
    "comment": "One of the best boardgames of all time when thinking about the ration between setup & play time and game depth. The teach is much easier than it used to be, as we've become more used to complex games, Race for the Galaxy actually comes off as relativelly straight-forward and not too hard to teach.",
    "timestamp": 1759528800
  },
  {
    "username": "logopolys",
    "rating": 10.0,
    "comment": "Comparisons to San Juan aside, Race for the Galaxy provides an interesting take to the card game. It's systems are far more complicated than expected (though not negatively so), and represent far more of what might be expected from a board-board game instead of the card-board game that it is. The player interaction makes this something a bit more difficult than just optimizing and flying through card draws.",
    "timestamp": 1759356000
  },
  {
    "username": "GeorgW",
    "rating": 10.0,
    "comment": "This game is perfect.\n\nPros:\nIt's my favourite game, and I suspect it always will be. It's just so packed with interesting decisions in such a short playtime with plenty of variety and interaction while not feeling mean or random. It's unique, absolutely brilliant and maybe one of very few perfect games. The cards as currency is a great conceit and makes the whole game feel very smart and streamlined.\n\nThe ratio of interesting decision-making to playtime is the highest of any game I've ever played, which makes it such a force to be reckoned with. Why play Terraforming Mars or Wingspan when I could play this in an eighth of the time and make more interesting decisions?\n\nIt has simple but deep tableau building with cards with multiple, interesting effects. I love that not only does each card have different uses as both a currency or its printed effect, but the printed effects can fit into your engine in a multitude of different ways because of how much utility is packed into a single card. Maybe you care about the color of goods it produces, maybe it allows you to leech off of a phase your opponent will call often or maybe it's just worth the most points and you know you'll fill your hand later in the round.\n\nI think it's one of the most interactive games I've played where you can only affect each other in a positive way. The phase system works really well and is one of my favorite mechanisms in any game. The bluffing and double-thinking is such a subtle but strong interaction point that newer players don't realize even exists, but is a big part of why experience players will almost always crush a newer player. If you can play around what your opponent(s) have played, you have a huge advantage and it's all about reading your opponent(s) and understanding their intentions based on their open board state.\n\nThe game scales excellently. The 2PA variant is my favourite version and the most strategic, but I like all player counts and I appreciate that they all feel differently. Sure 6 players is pretty chaotic, but it's still a fun game that just has a bit more of a lighthearted feel.\n\nCons:\nA lot of people complain about iconography, but I think that's more of a meme than actual fact. It's a bit hard to teach, but I think that's more because the decision space is so large. Your tableau can become quite complex quite quickly and the iconography is in fact the only reason this works so well, with poorer iconography the game would be unplayable. The fact that you have 2 hands and both need to be hidden at all times also makes the game hard to teach, since many players don't want to ask about hidden information. The game is best after you've played it more than a dozen times and that is a hard sell these days, but it's just so worth it.\n\nIf you introduce the game to someone that hasn't been on BGG and heard the decries of the \"iconography hell\" they won't have any trouble learning the 8 or so icons of the base game with the help of the excellent player aid. This isn't some argument I'm pulling out of a hat either, I've taught this game to dozens of relatively novice gamers and iconography was never where they stumbled.\n\nMost instead stumbled getting an economy going and exhaust their resources and end up exploring throughout the mid-game. I can totally understand complaints relating to the difficulty of learning to play well, but that's not related to the iconography.\n\nI think a lot of people complaining about iconography are influenced by e.g. the SU&SD review of RftG, where they, perhaps unintentionally, showed a bunch of admittedly very intimidating icons that were all from expansions. I found most of those difficult to learn as well, but I expect a higher learning curve from the third expansion so the point is moot.\n\nIt's a card game so there's some randomness, but it's rare for draws to decide a game. Yes, you can get a god-draw that ends a game quickly without the other players having a chance, but even such a rare occurrence isn't much of an issue for such a fast game. The extremely large amount of cards you see compared to how many you play in a single game and the fact that cards have multiple effects and uses means that luck of the draw is rarely a game-deciding factor.\n\nAn actual problem I have with this game is that the setup is a bit too long and cumbersome compared to the play time, especially the part about shuffling in the start worlds. Other games in this series, like Roll for the Galaxy and New Frontiers have separate start worlds that don't get shuffled and that would have been a nice change in the second edition. I may try to print extra copies of the start worlds, but it's not a very elegant solution.",
    "timestamp": 1759269600
  },
  {
    "username": "btasam",
    "rating": 9.5,
    "comment": "There have been times when I have increased my rating for RftG after playing a non-RftG card game. It's just in a class of its own.",
    "timestamp": 1759183200
  },
  {
    "username": "ReploidArmada",
    "rating": 10.0,
    "comment": "My favorite card game of all time, likely. When playing with people who know the game, playing it is fast, deep, and surprisingly cutthroat.",
    "timestamp": 1759010400
  },
  {
    "username": "Marlharr",
    "rating": 9.5,
    "comment": "When I first played this, I didn't care for it much. The iconography and phase structure were a lot to wrap my head around, but I did appreciate the clean design. Coming back to it a year later after enjoying Res Arcana, this game has hooked me. It's fast, but it still involves multiple paths to victory and interesting decisions. I've now logged 100+ plays on the app and I prefer the integration of the first two expansions (Gathering Storm + Rebel vs Imperium), minus the takeovers and goals.",
    "timestamp": 1758837600
  },
  {
    "username": "beaglestorm",
    "rating": 10.0,
    "comment": "Sleeved - 150 -Standard Card Game - Gray (FFS05):\nhttps://boardgamegeek.com/geeklist/164572/item/2914630#item2...",
    "timestamp": 1758232800
  },
  {
    "username": "fzudema",
    "rating": 10.0,
    "comment": "It's a quick, rewarding game that excells at replayability.\nTo me it works best as a 1v1. With more players it gets less sharp tactically.",
    "timestamp": 1758232800
  },
  {
    "username": "Sitnam",
    "rating": 10.0,
    "comment": "Few can do as much with as little (Glory to Rome, Adventures of D, etc.) but none do it better.",
    "timestamp": 1757973600
  },
  {
    "username": "vader3001",
    "rating": 10.0,
    "comment": "Among my favorite games of all time",
    "timestamp": 1757282400
  },
  {
    "username": "Jesse Terrell",
    "rating": 9.9,
    "comment": "10/ Flawless.",
    "timestamp": 1757109600
  },
  {
    "username": "bryce_z",
    "rating": 10.0,
    "comment": "Similar to San Juan? Bigger variety of cards? Cool artwork? Yes, please. Try playing this a few times before you form an opinion of it--it's a lot to take in at once, and your first couple games will be chaos. Once you start seeing what's happening, it's tons of fun.",
    "timestamp": 1757023200
  },
  {
    "username": "mspider_89",
    "rating": 9.7,
    "comment": "The best simultaneous action selection in my perspective, mixed with a cool concept of an engine-building. Cards have two purposes: to be played in your tableau (planets or technologies) and currency for play them.\nSuper strategic, but you need to know how to get your cards to work and how to adapt in the necessary cases. Reading your opponents (possible) actions has a lot to do with it. It has a big learning curve due to this, but it is worth it.",
    "timestamp": 1756936800
  }
]