[
  {
    "username": "Blackoth",
    "rating": 1.0,
    "comment": "This version lost all of my respect because somehow the designers think bounty hunting people is more acceptable to society than trading with people. Truly Unbelievable.\n\nAnd the new artwork is smudgy garbage compared to the original art.",
    "timestamp": 1756072800
  },
  {
    "username": "ultimoratio",
    "rating": 1.0,
    "comment": "UPDATE: June 2022\n\nNo significant change in the play style to change my opinion from 1st edition.\n\n===========================\n\nUPDATE: Mar 2022\n\nThe game is too linear and tactical to the point that it gets boring. Going for any strategy doesn't lead to any significant difficulty on achieving them.\n\nI'm consider if I should downgrading it to 1 star\n\n============================\n\nFor a heavy game, Great Western Trail is pretty pleasant. It doesn't make me overload with the processes \"Oh before I can do this, I have to do X and Y, but before I can do X, I have to do Z\". No. None of that regimental malarkey.\n\nAnd the game makes the ending satisfying. Having staff in your personal player board. Cows in your deck. Deliveries reaching San Francisco and your train reaching far. The game doesn't feel soulless.\n\nThe game is still a very solitaire experience. It lacks player interaction though, and lack of the playful jabs you can do to your friends, unlike Mombasa. Indeed, while the game has buildings in which everyone travels on, I don't really care with everyone's moves.",
    "timestamp": 1750975200
  },
  {
    "username": "Floating World",
    "rating": 1.0,
    "comment": "The same game should not be ranked twice",
    "timestamp": 1719957600
  },
  {
    "username": "selvalabelva",
    "rating": 2.0,
    "comment": "Brainburn         Longevity    \nLuck impact       Rules/Setup  \nInteraction       Involvement  \n\nAftertaste           Enthusiasm   \n\n Played at 4 player count only\n Confrontation: multiplayer solitaire",
    "timestamp": 1751320800
  },
  {
    "username": "yiechow",
    "rating": 2.0,
    "comment": "Barely remember, hardly played once.",
    "timestamp": 1715205600
  },
  {
    "username": "toguopp",
    "rating": 2.0,
    "comment": "This edition shouldn't have erased Native Americans from the history. See Pfister's original good reasoning in this Interview: https://www.dicebreaker.com/games/great-western-trail-second...",
    "timestamp": 1647990000
  },
  {
    "username": "Hinmatt",
    "rating": 3.0,
    "comment": "It's a mix of mechanisms and a rather heavy Eurogame. There are a lot of different things going on here.\nUnfortunately, I don't like it. The strangest thing for me is the roll and move without the rolling. Your meeple walks along a track, but you can decide freely how far you go within a range the game allows. Sometimes it's better to stay at a spot and build a building. Although there is no rolling and there are different ways to reach your destinations this still feels like an outdated element to me.\nThere is one thing I generally like in this game though. And that's deck-building. Unfortunately, it's only a really limited element of the game.\n\nNot a game for me, but I am not a big fan of heavy Eurogames anyways. But this game somehow feels especially boring for me.",
    "timestamp": 1756245600
  },
  {
    "username": "darkfinale",
    "rating": 3.0,
    "comment": "Need more plays.\n\nGreat theme and design.\n\nCard collection with the cows.\n\nNeed to update rating after more plays but starting off really well. Works.",
    "timestamp": 1744495200
  },
  {
    "username": "JFinkeldey",
    "rating": 3.0,
    "comment": "I can appreciate the design and gameplay, but am simply terrible at the game and get no enjoyment whatsoever out of playing it.",
    "timestamp": 1719093600
  },
  {
    "username": "ThinkingThatsAll",
    "rating": 3.9,
    "comment": "Yet another euro with a dozen mechanisms to min/max.",
    "timestamp": 1743116400
  },
  {
    "username": "arthurcucumber",
    "rating": 4.0,
    "comment": "Inferior art that makes things harder to see. Creates historical disconnect to appease the modern gamer. Tweaking things for the sake of tweaking things results in a lesser experience.\n\nOverall a substandard package.\n\nOf course this is not a real 4/10 game and if I hadn't played the original this would have been more of a 8/10 but unfortunately this isn't a vacuum and the original does exist and and is far superior in every regard.\n\nThere's simply no reason to get this version.",
    "timestamp": 1730329200
  },
  {
    "username": "Zaungast",
    "rating": 4.0,
    "comment": "Point salad the board game provided with a rondel mechanism to make it repetitive on top.",
    "timestamp": 1729288800
  },
  {
    "username": "sykano",
    "rating": 5.0,
    "comment": "(see my comments on the original \"Great Western Trail\")\n\nAlthough it was necessary to improve the game, I'm not really happy about the 2nd Edition because I already own the old one. :/\n\nThe insert is terrible! You can't even store the 1/2/3-tiles in their bags and not all cards fit into the insert and especially not with sleeves. What a waste of production budget!!",
    "timestamp": 1758405600
  },
  {
    "username": "Scifi66",
    "rating": 5.0,
    "comment": "New game balance changes are good (except for KC very disappointed that this still isn't fixed). But the new graphics redesign lessened functionality, ie it is arguably prettier but not as clear! Really would have preferred an upgrade kit. I basically did my own, keeping first edition and kitbashing it for new rules. For such minor changes it feels wasteful to have to buy another edition.\n+ Adjusting building value / functions mostly better\n+ Moving the neutral building site in the centre / trading locations\nx KC delivery destination needed to be reduced more. This was a problem with first edition and it remains in 2nd. Strong players are still doing double deliveries here and winning. Boo!\n? Using the same cowboy template for bandits was an odd choice\n– Hats are oversized, I'm not a fan, they cause meeples to fall over!\n– Colour of the board, buildings and components is muted, more natural look but harder to parse and read\n– Especially had trouble with the paths and coin values on board, it isn't clear once buildings multiply\n– Difficult to see individual train positions on the train track, some confusion resulted\n– Neutral buildings are not as distinct as they were previously this might be a printing issue\n– No upgrade kit!",
    "timestamp": 1756677600
  },
  {
    "username": "Steezish",
    "rating": 5.0,
    "comment": "3/16/25: This game feels like a miss for me. I just felt bland.",
    "timestamp": 1755036000
  },
  {
    "username": "silenceisgolder",
    "rating": 5.0,
    "comment": "Good, but not quite to my taste. Good play requires early commitment and then ruthless adherence to a pre-baked strategy. The interaction that drives the tactical decisions that follow feels too incidental for me to really enjoy.",
    "timestamp": 1753135200
  },
  {
    "username": "rcog",
    "rating": 5.0,
    "comment": "(see GWT review)",
    "timestamp": 1744149600
  },
  {
    "username": "goethean",
    "rating": 5.0,
    "comment": "The rules overhead is literally about ten times that of a typical hobbyist board game. Unless you are here specifically for games that have a ridiculous number of rules, I don't see the appeal. There are thousands of other games that are far easier to learn and provide a good strategy game.",
    "timestamp": 1740438000
  },
  {
    "username": "Lowengrin",
    "rating": 6.0,
    "comment": "The first edition isn't \"new to me\", but as BGG insists second edition is a new game, here it is. As I haven't played the original recently, I'm not sure what all the differences are between first edition and second other than the \"native\" obstacles became \"outlaws\". And there's \"exchange tokens\" (which came out of the expansion). And a new breed of cattle. Overall, not enough to make me want to upgrade to this most recent edition.",
    "timestamp": 1760652000
  },
  {
    "username": "tectactoe",
    "rating": 6.0,
    "comment": "Excellent, as far as point salad-style eurotrash games go, and just about as balanced as these sorts of games can be. Enough choices to make and various paths to victory without being lopsided or overwhelming. Plays very well but also very differently at 2, 3, and 4 players. A big part of the game is recognizing which strategies are likely to be the most viable or highest scoring upon seeing the opening game state (neutral building location, personal building sides, worker market, hazard distribution, station master tiles, etc.). Opening bidding for turn order is an absolute must. A wonderful game.",
    "timestamp": 1760306400
  },
  {
    "username": "selwyth",
    "rating": 6.0,
    "comment": "Cycle your hand and prune your deck, but there are so many arbitrary point-scoring opportunities on the way to your big payout at the end of the trail. The nice visual of repeatedly going through the trail and figuring out the pace you want to do it at sets this apart. Nice sandbox feeling.\n\nThis cleverly makes the deckbuilding aspect really trivial and simple (how it should be: only the color and number matter), while clunking up the rest of the game.\n\nIf only the player interaction weren't so incidental. Hey I got some unexpected passive income because you crossed over my buildings, here's some passive income for you because I'm crossing over your buildings. Isn't that neat? There were so many places where it could have been a race, and it isn't.\n\n4+3",
    "timestamp": 1759528800
  },
  {
    "username": "Ddyraw",
    "rating": 6.0,
    "comment": "I wanted to like this so much more, I really did, feels uneventful.",
    "timestamp": 1759442400
  },
  {
    "username": "Beefy79",
    "rating": 6.0,
    "comment": "Played Mike's Copy",
    "timestamp": 1758146400
  },
  {
    "username": "halabatfrank",
    "rating": 6.0,
    "comment": "Dull and confused theme; rancher, developer, and railway executive.\n\nThere are other euros I'd prefer to play.",
    "timestamp": 1754344800
  },
  {
    "username": "johngarrison",
    "rating": 7.0,
    "comment": "While an interesting and solid game, the three main systems (cards, tiles, trains) don't feel like they really mesh well. Feels like playing 3 different games at once, that only tangentially relate to each other. And it's pretty difficult to feel like you're getting a good engine set up, though maybe that's just a personal failing. It also runs too long for what it is. I enjoy it enough to not turn down a game, but I won't be the one suggesting it.",
    "timestamp": 1761429600
  },
  {
    "username": "Drausqo",
    "rating": 7.0,
    "comment": "Game",
    "timestamp": 1761343200
  },
  {
    "username": "Quadenstein",
    "rating": 6.9,
    "comment": "The changing rondel is interesting. The game itself felt like work.",
    "timestamp": 1760824800
  },
  {
    "username": "Korwin",
    "rating": 7.5,
    "comment": "Very good game but \"Great Western Trail: Argentina\" is better",
    "timestamp": 1762647480
  },
  {
    "username": "skytostar",
    "rating": 7.5,
    "comment": "Excellent !! Well made game !!\nDifficult to notice roads on the map. I don’t like that but i like the game very much !!",
    "timestamp": 1762570260
  },
  {
    "username": "Bkoons",
    "rating": 8.0,
    "comment": "w/ RtN expansion",
    "timestamp": 1762124400
  },
  {
    "username": "Karahkwa",
    "rating": 9.0,
    "comment": "Excellent challenge to find the best choices. The theme is present and it feels good to create your route. Love the mental grind to squeeze out points",
    "timestamp": 1762668660
  },
  {
    "username": "Wyte Cell",
    "rating": 8.7,
    "comment": "Great game! I call the 2nd edition the \"woke\" version! Anyway, the artwork is better in this edition and at least I don't have to look at that horrible 1st edition cover!",
    "timestamp": 1762618020
  },
  {
    "username": "jnharr",
    "rating": 9.0,
    "comment": "GWT 2.0 is a Swiss watch. There are so many tight, smart design choices here that really hum along nicely. The decision space is vast, leaving players with a myriad of options to consider:\n\nShould you race to KC as fast as you can, making more deliveries than your opponents? Or should you make more stops along the way, improving your position in other aspects and making fewer but stronger deliveries? How far should you advance your train, and when? Is that station master tile worth it? What about the objective card? How many buildings should you build? Which ones? And where? Oh and don't forget about hazards and outlaws.\n\nThis can feel like a dizzying array of options initially, but after a play or two it all fits together. But after grasping the rules, you've only just begun to scratch the surface of the strategic depth of this game. There are so many paths to victory. Push that train to the end of the line! Build that 13pt building! Sell to NY for a 3rd time! Complete another objective!\n\nWhile this these misses me completely, I'm enamored with the gameplay. An improvement on an already solid game. Bravo!",
    "timestamp": 1762612500
  },
  {
    "username": "barnstorm",
    "rating": 9.5,
    "comment": "2-4p",
    "timestamp": 1762383600
  },
  {
    "username": "Auroric",
    "rating": 9.5,
    "comment": "Wow, this game is not overrated in the least. I love how many different layers and approaches are all viable in this game: it's fantastically balanced. It feels almost sandboxy while still being extremely tight. There's a great amount of indirect of interaction: every move made adds or takes away from the shared ecosystem, and you're extremely invested in what your opponents are doing. Choosing how you are going to weave your strategy through and around other players is key in this game. Upgrading your \"techs\", choosing how quickly to deliver, managing your deck and hand, building buildings, oh man this is a juicy one. Many strategies are viable even in high level play.\n\nIt's not my favourite theme ever, but it works extremely well here. It's also a doozy to teach, but most of my favourites are. My main critique is the balance of some of the buildings. A few of them feel borderline useless, especially in higher level games where the opportunity cost to build them is just too much. It's not a huge issue, as most of the options in the game have at least fringe uses, but there's some that could really use a bit higher power. This game can also feel impossible to come back from a losing position, which can definitely hamper some players enjoyment. It doesn't happen often, but sometimes the right combination of blocking and bad luck can make for a lemon of a play.\n\nAfter playing many many games of GWT: New Zealand, I don't have much need to own this one anymore. The fourth player in turn order gets shut out less often, and it's just the same system I fell in love with here with more interesting layers added. This brings my rating of GWT: 2E down slightly, but this is still an incredible game, and a great place to start. Must try Argentina.",
    "timestamp": 1761778800
  },
  {
    "username": "Solamar",
    "rating": 10.0,
    "comment": "Box insert is completely useless.\n* Cannot fit sleeved cards.\n* Cannot fit all unsleeved cards.\n* Cards will spill all over if box stored on its side. They could have made the card well wider and allowed cards to be on their side.\n* Hats are not stored with cowboys\n* All the tokens have to be lined up perfectly to store.\n* All the money has to be lined up perfectly to store.\n* Tiny, tiny space for tokens.\nThey could have easily made full deep wells and leave space for everything!\n\n\n\nFernando Moritz: Here is a full list of the gameplay / rules changes of second edition:\n1) Changed from -6VP/$6 to -6VP/$4 when delivering to Kansas City\n2) RTTN exchange tokens are included starting with 1\n3) The link between Wichita (4) and Colorado Springs (6) now earns an exchange token instead of losing -1VP\n4) Values ​​of the teepees (which are now bandits) changed to: Take exchange token / $1 / $2 (row) $3 / $4 / $5 / $6 / $8 / $10\n5) The neutral building space 'D' has been moved to the left (at the intersection)\n6) The action of trashing a card now also requires to gain $1 (gain $1, move your train back to trash a card)\n7) The risk action of the first building space after the flood hazard changed to \"Discard any cattle card to get 1 certificate\"\n8) Added 4 station masters tokens (from RTTN expansion) to shuffle all 9 SM and randomly choose 5 to place on the stations\n* Gain 2 certificates / 2VP per building\n* 1 permanent certificate / 3VP per upgraded station\n* 2 permanent certificates / 0VP\n* Gain $12 / 0VP\n9) Players will start with more cards in their hand according to the starting order (4 / 5 / 6 / 7 cards) in addition to the money ($6 / $7 / $8 / $9) and discard the extra cards until you have 4 in your hand just before your first move.\n10) You can't use the same building actions twice on the same turn\n11) Added buildings 11 and 12\n* 11a: Remove a hazard for -$2 / Remove a hazard for -$2 (12C/20VP)\n* 11b: Move your train for each hazard you removed (5C/10VP)\n* 12a: Gain $1 per builder you own / Advance 1 step forward (4C/5VP)\n* 12b: Gain $2 per upgraded station / Take 1 exchange token (3C/4VP)\n12) Old building changes (changes are underlined):\n* 2b: Discard 1 Dutch Belt (green) to move your train 2 spaces / Discard 1 Jersey (grey) to gain $2 (1C/1VP)\n* 5a: Discard any cattle card with a value of '3' (yellow, red or blue) to gain $7 / Double auxiliary action (3C/4VP)\n* 6a: Hire a worker at a discount (+1) / Move your train by engineers (4C/5VP)\n* 6b: Copy actions from an adjacent building (4C/5VP)\n* 8b: Discard any cattle card to gain $6 / Take an objective card straight into your hand (6C/8VP)\n13) The Simmental breed variant\n\n01-50160ENLK2021Q2 - Matte Finish\n02-50160ENLK2021Q4 - Glossy Finish\n\nSetup tweaks for 1, 2, or 3 player games (fewer tiles and cards)",
    "timestamp": 1761084000
  }
]