[
  {
    "username": "LittleIskender",
    "rating": 1.0,
    "comment": "you win without producing any wine wtf",
    "timestamp": 1760652000
  },
  {
    "username": "GuySamstag",
    "rating": 1.0,
    "comment": "Just go play some Rosenberg's.",
    "timestamp": 1755986400
  },
  {
    "username": "p00q",
    "rating": 1.0,
    "comment": "The combination of the random wines you get, in combination with the random wine orders and two other decks with extremely high point variance cards (0-4 points) makes this just feel sort of pointless to play. It's fast and relatively straightforward, but I have enough games at this length that offer some more control.\n\nLet's see how many times I can copy and paste this. Large decks of random stuff isn't game design. It's camouflage to make the game feel different every time you play it and to disguise the lack of meaningful interaction.",
    "timestamp": 1744668000
  },
  {
    "username": "Dasoogle",
    "rating": 1.0,
    "comment": "Making wine feels secondary to card play. Worker placement doesn't feel tense nor particularly liberating. Lords of Waterdeep is a better recipe crafting low-stress worker placement game. Agricola fits the theme of farming better and is a significantly more tense worker placement game.",
    "timestamp": 1739574000
  },
  {
    "username": "muzrobertson",
    "rating": 1.0,
    "comment": "Stonemaier in a nutshell: style over substance. Undeniably beautiful components, paper-thin theme, a crapshoot with very little play mitigation. Not even point-salad optimisation is possible unless you happen to draw a card that aligns with your previous randomly-drawn cards. Incredible marketing, awful boardgaming.",
    "timestamp": 1736290800
  },
  {
    "username": "tectactoe",
    "rating": 1.0,
    "comment": "Does very little to address the problems and concerns I have with the original. Namely, the mechanical order of operations, and the abysmal random card draws that will effectively dictate the game.",
    "timestamp": 1736204400
  },
  {
    "username": "iplaybgnaked",
    "rating": 1.0,
    "comment": "Bad worker placement game, even with the expansions that supposedly fix it, the dominant strategy issues are still prominent, the grande meeple removes what little tension there is with the worker placement, and the overall strategy is boring to execute that there is little reason to play this over any other more competently designed worker placement game.",
    "timestamp": 1731625200
  },
  {
    "username": "jodokast4",
    "rating": 1.0,
    "comment": "bleh",
    "timestamp": 1727733600
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "So if someone's finished with all their actions, they remove their workers and free up spaces for others.... ok I have no idea what that mechanism respresents anymore.",
    "timestamp": 1726264800
  },
  {
    "username": "Scifi66",
    "rating": 1.0,
    "comment": "Worker placement with a massive amount of randomness in the card draws. Not tense, wasn't worried about blocking. Visuals and components are nice.",
    "timestamp": 1725141600
  },
  {
    "username": "terraform",
    "rating": 1.0,
    "comment": "Absolute bore.",
    "timestamp": 1724277600
  },
  {
    "username": "Suckonmytoes",
    "rating": 1.0,
    "comment": "Literally my least favorite game of all time. Painfully boring. I'm not huge into worker placement games, but the theme. the components, the worker tokens just all disgust me. I cannot stress how much I dislike this game.",
    "timestamp": 1714860000
  },
  {
    "username": "Rednas79",
    "rating": 1.0,
    "comment": "Boring theme.\nGameplay not great. Card drawing is bad.",
    "timestamp": 1666648800
  },
  {
    "username": "pdruzik",
    "rating": 1.0,
    "comment": "Худший органайзер в истории настольных игр. За такую цену - это позор.",
    "timestamp": 1646348400
  },
  {
    "username": "ultimoratio",
    "rating": 1.0,
    "comment": "The Essential Edition did nothing to improve my view of this game.\n\nAs I said in the original: The game made two serious offences to be a 1/10: 1.) Significant thematic disconnect, in which the game is mainly about scoring via visitor cards. 2.) Visitor cards, as a main way of scoring, are series of random inputs from the game telling me, in a very reactive manner, what my goals are, if I want to win the game.",
    "timestamp": 1646262000
  },
  {
    "username": "xvatat",
    "rating": 1.0,
    "comment": "It's so hard to see any appeal to this game. The strategy is all laid out for you: get vines, plant vines, harvest, make wine, sell wine. The visitors are not interesting as a variation, since they mostly just do a part of this path. The structures don't leave nearly enough room for decision, since you have to build some to store wine or to fulfill requirements. For all the cards and pieces, there are so incredibly few decisions that even after one play I was bored, let alone after the dozen subsequent times I reluctantly restarted this assembly line of a board game experience",
    "timestamp": 1642374000
  },
  {
    "username": "NotMyHeart",
    "rating": 2.0,
    "comment": "Viticulture is far too slow for my taste. It took us 2 hours to get started and play three rounds of four players. The mechanics have some interesting elements but there were too many of them to wrap our heads around and start enjoying playing. There wasn't anything to hook us so I won't be playing again.",
    "timestamp": 1706742000
  },
  {
    "username": "adi_venturer",
    "rating": 2.0,
    "comment": "I was bleeding my eyes out, waiting for this horrendous game to be over. One of the more painful experiences of my existence.\n\n(Plays: 1)",
    "timestamp": 1695765600
  },
  {
    "username": "hiimjosh",
    "rating": 2.0,
    "comment": "Long, random, not very interactive not much payoff for the effort. Viticulture isn't terrible, however it is uninspired and edgeless.",
    "timestamp": 1691618400
  },
  {
    "username": "UmbrellaCakes",
    "rating": 2.0,
    "comment": "I do not understand why this game is rated so highly, it is weirdly complicated for what it is with so many fidely rules that it ended up being the first game my group ever abandoned part way through.",
    "timestamp": 1684706400
  },
  {
    "username": "Sir Pent",
    "rating": 2.0,
    "comment": "Worker placement game with a theme of making wine. Not as fun as Agricola, but just as complex. And I'm not a big fan of the theme.",
    "timestamp": 1671058800
  },
  {
    "username": "mOCHU035",
    "rating": 2.0,
    "comment": "10 Plays (5 2p with SO)\n\n+1 cause my wife loves playing it at 2p with me.\n\nBaseline worker placement game as far as I am concerned. Easy enough to teach to folks new to boardgames as well. The randomness is a bit much for me though.\n\n-1 cause I have dodged it so many times. Bland in retrospect.",
    "timestamp": 1670281200
  },
  {
    "username": "immatipyou",
    "rating": 2.0,
    "comment": "This is just a mediocre worker placement game. There is no way of mitigating bad card draws and you’re constantly at the mercy of the deck. You’re gated in how many points are possible to be scored every turn. And you have very little reason to care what anyone else is doing as there is no way of blocking their moves or interacting with them other than a couple visitors acting as random gotcha type events.",
    "timestamp": 1660255200
  },
  {
    "username": "Topanga",
    "rating": 2.0,
    "comment": "Boring",
    "timestamp": 1656367200
  },
  {
    "username": "klebinaldo",
    "rating": 2.0,
    "comment": "the use of cards is extremely boring",
    "timestamp": 1653343200
  },
  {
    "username": "Fragasnap",
    "rating": 2.0,
    "comment": "Any amount of interest that I could muster in the tableau-building is undone by ridiculously powerful and unbalanced Summer and Winter visitor cards that are drawn totally randomly.\nAnd further plays show that drawing vine cards in conjunction with order cards is equally if not more asinine. At least the visitors can pretend to be balanced.",
    "timestamp": 1645743600
  },
  {
    "username": "odie73",
    "rating": 2.0,
    "comment": "Tried it now twice to see if the game has any redeeming features but could not really find any besides a nice production value and a good match between theme and the basic mechanics.\n\nAt its heart, Viticulture is an engine-builder with a fairly linear progression: Plant fields, harvest grapes, produce wine, fulfill orders for VP. The problem is that most of that is driven by totally random card draws. For planting you need green cards. If you do not have any at the beginning or only bad ones you will never get your engine going in time. That is exacerbated by the fact the game is essentially a race with the first person to get to 20 VPs ending the game. Hence, lucking into good cards early sets you up for playing for the win, otherwise you are only going through the motions for over an hour. Rarely have I played a game where early in the first round I could already tell that I will have no chance of winning.\n\nAdd to that a bunch of puzzling design decisions:\nThe \"Mama & Papa\" asymmetric starting positions which seem unbalanced (as in many Stonemaier games).\nInstead of making up for the luck of the draw by letting players get lots of cards and hold on to some that will only be useful later; no, you have to discard back down to 7 without any compensation.\nThe weird choice of giving the first player choosing a worker placement spot an additional bonus, further enhancing the imbalance introduced by the turn order.\n\nI could go on but needless to say that I find Viticulture to be a hot mess. It is surprising to me how this game can be among the top 25 games on BGG. Maybe the Tuscany expansion fixes some of those issues but then that expansion should be rated that highly, not the flawed base game.",
    "timestamp": 1633125600
  },
  {
    "username": "neltole",
    "rating": 2.0,
    "comment": "Very dull game with one of the most racist theme ever seen. The epitome of imperialistic/pateralistic behavior that some americans reservse to Italy and Europe in general. If you want a eurogame that really revolvs around wine try Vinhos, it's heavier but at least it doesn't insult anyone.",
    "timestamp": 1632520800
  },
  {
    "username": "NormandyWept",
    "rating": 2.0,
    "comment": "On a surface appraisal, a lighter game and more compact than Agricola, without the feeding tension, and suggests itself as a worker placement gateway.\n\nWhilst you don’t have to eat your VP, however, it remains extremely dominated by card draw (although this was substantially improved versus the original Viticulture) and I feel that you can lose before the game has really got going.\n\nI have enjoyed some of my plays but I feel this is ultimately a flawed game. Although improved by the expansions, I wonder if it is worth playing in a world that contains the oeuvre of Uwe Rosenberg.",
    "timestamp": 1619647200
  },
  {
    "username": "Affensohn",
    "rating": 2.0,
    "comment": "Play Tzolk'in or Agricola instead. Heck, even the family-friendly Stone Age is less luck-driven and more diverse in adaptable strategies.",
    "timestamp": 1537912800
  },
  {
    "username": "theory",
    "rating": 2.0,
    "comment": "You’d think that the game would have been fixed by the second try.",
    "timestamp": 1534111200
  },
  {
    "username": "Bobby4th",
    "rating": 2.0,
    "comment": "a.k.a., the Inferior Edition. Why anyone would ever buy another game from Stonemaier when this has gone through three rapid editions, changing the rules constantly. So if you own the initial edition, someone else owns the second, revised edition, and someone else owns this, you will be playing with different rule.",
    "timestamp": 1482793200
  },
  {
    "username": "namle",
    "rating": 3.0,
    "comment": "No player interaction. Each person focuses on their own board...",
    "timestamp": 1757109600
  },
  {
    "username": "_Dynomite_",
    "rating": 3.0,
    "comment": "No, has a beatable system",
    "timestamp": 1749592800
  },
  {
    "username": "elijah234",
    "rating": 3.0,
    "comment": "Completely uninteresting. Everyone has to have the same strategy. I wonder if the game designer realised this and tried to use random cards to inject some variety into the game. All that means is the player with the best luck of the draw with the cards has the best chance of winning the game. Still it’s not broken and so might have been bearable. But the game length is insane. I would not waste my time again.",
    "timestamp": 1748728800
  },
  {
    "username": "MegaHamster",
    "rating": 3.0,
    "comment": "Nice middle-weight Euro. Very much enjoyed the theme and excuse to drink wine. Seems like a game you could win off the back of some early lucky draws on the fulfilment cards which I find distasteful.\n\nAfter further play I find myself liking this game less, it's heavily reliant on luck with the fulfillment cards. I don't mind luck in games but in a long Euro strategy should trump good fortune and that's not the case here. If you don't get the cards that match your strategy you have to waste time getting new ones.\n\nWhat is further jarring is that the luck destroys the excellent theme. Why if I mainly planted white grapes? would I have fulfillments for red and rose? Who runs a vinery this way? Planting random varieties of grapes then trying to fulfill completely random wine orders? You'd go under in a season.\n\nAlso you can win a game about making wine without making any wine.",
    "timestamp": 1745445600
  },
  {
    "username": "langschnabel",
    "rating": 3.0,
    "comment": "After some plays and having a bit of fun discovering the visitor cards the first plays, there is not really something interesting in this game. It´s one of those games, that are starting slowly, but then exploding is a few turns into the finish. Sometimes i like those games - like Space Base or Cubitos, but if they don´t offer you interesting choices on the way, it´s nothing for me.\nTo me it feels like a game, that was good 10 years ago when it came out, but there are so many good and innovative worker placement games out right now, that Viticulture just feels outdated and boring ...\n\nPro:\n- Nice, calming Artwork, beautiful meeples\n- It is a game about wine\n\nNeutral:\n- Visitor cards are the heart and meat of the game. It is interesting to get those effects and to shock your opponents sometimes. But at the same time, you have to wait for what you get, sometimes they are useful, sometimes not. So they are really luck dependent.\n\nNegative:\n- There are some thematic points i cannot overlook longer: Grapes are getting more precious, the longer you just let them laying around after the harvest? NO! Thats not the case! And in the expansion it is on top a bonus. Harvested grapes don´t get more ripe after 3 years ... the go bad in reality! Thats just not thematic.\n- Same for the cellar: It´s more useful to let grapes laying around outside if your cellar is not big enough, because inside they are stopping to get more pricey? But they ripe, after you expand your cellar? Also just not thematic!\n- These points wouldn´t be making it a bad game. But doing the same thing all of the time just doesn´t feel good. It feels like work for me. Also the expansion doesnt make it better.\n- The balance between rules and depth doesn´t feel right for me. Ther are a lot of rules, but not really depth in the decisions you make.\n- Contract fulfillment is lucky ... often you draw high point cards in the beginning and low point cards in the end. And in the final the one player who was lucky and drew a good contract/visitor card wins. Also winning this does not feel exciting.\n\nIt´s a theme for me, but not the game for me. I was really interested in this one and really wanted to like it.",
    "timestamp": 1739142000
  },
  {
    "username": "Baskey",
    "rating": 3.0,
    "comment": "Bought and played this a couple of years ago with my wife. We played it once and I think it might be the least fun we've ever had playing a game. I held off getting rid of this base game until I'd played it with Tuscany which I also bought. (I know it's supposed to be a lot better with it) It's been two years and we just can't make ourselves try it again, even with the expansion, so I've had to sell.",
    "timestamp": 1738537200
  },
  {
    "username": "MichielTummers",
    "rating": 3.0,
    "comment": "I think its kinda meh, mostly play this solo though, since my gaming group hates the game (lasts too long, too convoluted, too much luck).\n\nWhat i dont like is the avoidance of conflict. A good WP for me is one where people block each other and deny eachother spots. This one is almost too polished and safe, you always have a grande worker etc, where people all would do the same thing if it wasnt for the random card distribution.\n\nMost euro gamers loathe dice luck, yet they don't seem to mind card luck at all. It's a weird phenomena\n\nFor competent worker placement games, check out stone age, even lord of waterdeep does the job better.",
    "timestamp": 1736118000
  },
  {
    "username": "btasam",
    "rating": 3.0,
    "comment": "Felt too dependent on drawing the right cards, but maybe I'm wrong. Maybe it's Maybelline",
    "timestamp": 1735513200
  },
  {
    "username": "svenne",
    "rating": 3.0,
    "comment": "Beautiful game, nice mechanics but you have to be lucky when drawing cards, otherwise you can give up quite early. Easy to calculate who is winning and no need to play it to the end.",
    "timestamp": 1732230000
  },
  {
    "username": "Korwin",
    "rating": 3.0,
    "comment": "A hot mess, the cards aren't balanced and the mechanics doesn't really clicks with the theme. One can win the game without selling single bottle of wine",
    "timestamp": 1730588400
  },
  {
    "username": "erichenyey",
    "rating": 3.0,
    "comment": "Bought it based on BGG's consensus rating and was sorely disappointed. The worker placement concept has some clever twists (bonus space, grande worker) but that's the prime attraction. I was interested in the theme but it is SO poorly implemented - this is NOT how winemaking really works, especially not in Tuscany! And while I do like a little chance in the games I play, the cards introduce far too much luck. Components are nice but the box organizer insert seems to have been chosen at random.",
    "timestamp": 1722031200
  },
  {
    "username": "MartynF",
    "rating": 3.0,
    "comment": "This game seems to be a strategy game. But it actually is more of a tactical game. And I feel that the cards determine what you should do, if you're lucky enough to get cards that match. Because of the randomness of the cards, you can't really plan ahead. The 2-player game is also pretty hard. You have only one Grande. And if you misjudge the intentions of your opponent, you can get into trouble and possibly lose the game.\n\nThe Tuscany expansion addresses a lot of the problems from the base game. But the fact remains that quite a bit of randomness from drawing cards is still a big part of the game. In a lot of games this not such a huge problem. But with this game I feel you can't really work around it and most of the time lose because of that.",
    "timestamp": 1719957600
  },
  {
    "username": "Entropology",
    "rating": 3.0,
    "comment": "Nothing of consequence different for me from the original. The changes don't address my overwhelming frustration with the wine cards/grape cards randomness; so no change in my opinion.",
    "timestamp": 1700866800
  },
  {
    "username": "Adietk",
    "rating": 3.0,
    "comment": "Theme - don't mind it, well simulates vine making\nArt - visually clustered, don't like UI stacked over a picture\nMechanics - from the first round the game made me feel that I needed to pick specific actions in order, otherwise would fell behind immediately\nChoices - in a bad way, need to pick specific actions each round\nRandomness - in a bad way, victory conditions are randomly drawn throughout the game\n\nI could see it being a good vine making simulator but not necessarily a fun game",
    "timestamp": 1699570800
  },
  {
    "username": "bubblepipemedia",
    "rating": 3.0,
    "comment": "I hesitate to rate this a 3 since it’s been so long since I played it so I’m rounding up my score a bit. We played at 5 or 6, so it’s possible this is just great or something at 2-3. But this was just one of the most frustrating and unfun games I’ve ever played. Among those who played I still know friends who go “it’s not that wine game is it?” years later. No. No it isn’t. Never again.",
    "timestamp": 1699052400
  },
  {
    "username": "apuity",
    "rating": 3.0,
    "comment": "Unthematic & infuriating mess, where\nWin-loss is largely dictated by swingy and powerful visitor cards that are unthematic and most importantly imbalanced. The visitor system reduces the game from a euro to a braindead card game based on luck of the draw - the problem is too deep-rooted to simply brush off. Too easy to draw suboptimal pairing of grapes & orders, often the efficiency of the vineyard is largely dictated by card draw",
    "timestamp": 1696197600
  },
  {
    "username": "IsolatedPawn",
    "rating": 3.5,
    "comment": "There’s a bit of a disconnect here, as the game thematically looks like a strategic worker placement game about producing wine, but it’s actually very card driven, very tactical, and it’s actually possible to win without producing any wine. This isn’t automatically bad, but if and when players realize this, it may detract from the theme. Overall, it’s easy to see why this was so successful, but there’s so many other worker placement games I enjoy more.",
    "timestamp": 1757800800
  },
  {
    "username": "PotatoKing_",
    "rating": 4.0,
    "comment": "환상적인 아트워크, 파멸적인 액션 밸런스",
    "timestamp": 1750629600
  },
  {
    "username": "jesberpen",
    "rating": 4.0,
    "comment": "My favorite eurogame. Love the theme and the simplicity of it, but is so very well thought that you really need to create a good strategy to win. I like every aspect of it, components, gameplay, thematic.\n\nAnd Automa is just awesome to play against.",
    "timestamp": 1748815200
  },
  {
    "username": "TertiaVigilia",
    "rating": 4.0,
    "comment": "The game is fine, but too random. The same concept without the random card draw would have been great.",
    "timestamp": 1747519200
  },
  {
    "username": "Crouch__",
    "rating": 4.0,
    "comment": "Bought into the hype and nice art/theme primarily as a gift for winemakers.\nMechanically the game does not really make sense in the wine making process, aging grapes in the crush pad to improve quality?? What the hell was the dev team smoking?\nCard draw is very luck based and usually you can win by not making wine at all, therefore cannot recommend.",
    "timestamp": 1743372000
  },
  {
    "username": "CMagex",
    "rating": 4.0,
    "comment": "07162024 - Seriously turned around on this one, feels like another in a sea of nonsense where its ok and random, but could go for a bajillion others over it.\n\nCoins - Viticulture specific if I buy? for now use Colosseum ones\n\nKeeper-with Tuscany, great worker placement, medium weight - worker placement in the medium weight category is common, but I think this one really does a good job with a unique theme and a great gameplay loop\n\nCategorization: medium weight, worker placement with unique theme - luck from visitor cards, but mainly strategic\n\n#12",
    "timestamp": 1742338800
  },
  {
    "username": "Beastly_Venturer",
    "rating": 4.0,
    "comment": "6 plays. This never sat well with me. Light-medium Euro. Swingy cards which needed a few iterations to fix. I find most of Stonemeier games like this. I don't know why the masses lose their minds over Jamey's designs. Dude really needs to play test outside of his 'yes' person chamber. Name 3 games that have not required additional version patches or expansions to fix?",
    "timestamp": 1740783600
  },
  {
    "username": "so_not",
    "rating": 4.0,
    "comment": "Nothing wrong with the game. I just enjoy Agricola, Champions of Midgard, Everdell and Architects of West Kingdom a lot more so I have no desire to play this.",
    "timestamp": 1739660400
  },
  {
    "username": "themikeman",
    "rating": 4.0,
    "comment": "BGA: To be fair, I did not give this game a fair chance. But I found it so so dull. Maybe I'm not a fan of beige/sepia toned games, which does not bode well for other games like El Grande, Hansa, Concorida, etc.\n\nI'm sure there's fun and satisfying gameplay somewhere, but I didn't find it. Maybe under different circumstances I would rate this similarly to Wingspan or Everdell but there are so many of those types of games out there",
    "timestamp": 1739574000
  },
  {
    "username": "sambalamaento",
    "rating": 4.0,
    "comment": "steam app",
    "timestamp": 1737846000
  },
  {
    "username": "BoardGamingCouple",
    "rating": 4.0,
    "comment": "4/5\nViticulture is an amazing worker placement game. The theme, components, and gameplay loop all sing. The game can suffer from some card randomness (most card games), but you need to pivot and make a strategy with the cards you have. The game does have some luck mitigation which helps. The AI is wonderful! 300+ plays.\n\n5/5\nThere are several Viticulture expansions. Some are better than others. The special workers & grande worker make this game amazing. The tuscany board is what makes this game sing. The extra wine order scoring cards are a nice addition which dont hinder the experience. The orange building cards are an excellent addition for some added variety & extra VPs. The card packs are lovely; 1 deck is VP based, the other is engine building based. The mafia module can easily be skipped as it doesn't add much. Fromaggio & Arboriculture are wonderfully crafted experiences & modules; however, it requires you to increase the endgame trigger by +10 points; otherwise, these elements don't get utilized. While they are fun to play with, the added game length is not great.\n\nHouse Rule:\nIgnore the area control map point scoring & just simply take the bonuses for placing stars. This speeds the game up & keeps it snappy instead of bogging it down for an overall difference of 1-2VP.\n\nViticulture generally has all players gather their workers as fast as they can. It might be a good idea for everyone to start with +1 worker. This might help add a bit more variety in the early game.",
    "timestamp": 1735599600
  },
  {
    "username": "drmilli6",
    "rating": 4.0,
    "comment": "Played once. Admittedly, I didn't really know what I was doing, so I employed a free points strategy. Turns out it's a viable strategy and that broke the game for the entire group.",
    "timestamp": 1735340400
  },
  {
    "username": "SkyGlad",
    "rating": 4.0,
    "comment": "I don’t care for worker placement, and this does nothing to overcome that for me.",
    "timestamp": 1734908400
  },
  {
    "username": "EddyVaffen",
    "rating": 4.0,
    "comment": "A board game disguised as a Euro game. But don't be fooled. once again one of those poorly achieved SM designs",
    "timestamp": 1732143600
  },
  {
    "username": "HackFin",
    "rating": 4.0,
    "comment": "My expectations were too high I guess. The luck factor on the card draw is crazy for a worker placement game.",
    "timestamp": 1727647200
  },
  {
    "username": "Joey_A",
    "rating": 4.0,
    "comment": "Yikes, one play in, my wife and I just looked at each other, put it away, and listed it on ebay. Dull euro that offers nothing new or exciting.",
    "timestamp": 1725228000
  },
  {
    "username": "enavico",
    "rating": 5.0,
    "comment": "+ Good theme\n+ Nice worker placement mechanics\n+ Solid materials and good ergonomics\n+ Really good for casual gamers\n\n= The engine building effect has a really slow start, maybe too much for a medium-light weight game like this one\n\n- The scoring system is really unbalanced (some cards may reward you or punish you a lot, for no reasons)\n- The random cards drawing affects the gameplay lowering the control way too much\n- Seems that if you want the real game you should buy Tuscany: not a great move from the publisher.",
    "timestamp": 1760997600
  },
  {
    "username": "Hugmenot",
    "rating": 5.0,
    "comment": "7 - Good - usually willing to play.\n\nI like that you're competing against others as to which actions to take but that these decisions don't feel as much as a take-that mechanic as in most other games.\n\nI would rate it higher if not for the luck of the draw (especially for orders) being a bit too high for my tastes.\n\nEdit:\n\nI downgraded my rating to \"5 - Average - Slightly boring, take it or leave it\". My son and I played it a dozen time 1 vs 1 and the more we played, the less we liked (4). It worked well as a 4-player family game (6.5) but it would not see the table more than once a year due to being no one top 3 family game.\n\nTraded away in a PiF list.",
    "timestamp": 1760911200
  },
  {
    "username": "Bagherra",
    "rating": 5.0,
    "comment": "Includes metal coins, tuscany, visitors from the moor and rhine valley.",
    "timestamp": 1760133600
  },
  {
    "username": "gram_niebieskim",
    "rating": 5.0,
    "comment": "My BGG:\n10 - excellent game, always have a great time\n7 - enjoyable game, I'm willing to play again\n5 - not bad but it's not my cup of tea\n2 - won't play ever again",
    "timestamp": 1758924000
  },
  {
    "username": "Fluidmilk",
    "rating": 5.0,
    "comment": "You dont even need to make wine to Win the game... How does that make sens?",
    "timestamp": 1757282400
  },
  {
    "username": "emelvin",
    "rating": 5.0,
    "comment": "Pretty one dimensional and boring. Many better worker placements at the same complexity level and play time.",
    "timestamp": 1755986400
  },
  {
    "username": "zuppafreak",
    "rating": 5.0,
    "comment": "I got this second-hand as a gift from someone who didn't want to play it anymore and wouldn't want to charge any amount for it. So, I saved it from the trash in very good condition. Fully sleeved. With a warning: this game was ruined by the last expansion (...won't even buy more games from SM ever). My gain but, the publisher lost a client and his entire social-network.",
    "timestamp": 1754776800
  },
  {
    "username": "HypnoticSpecter",
    "rating": 5.0,
    "comment": "it's not bad, but I don't understand the love for this one. It's good but not Top 20 good. Stonemeier games have been pretty hit and miss with me, they have great productions for overall pretty mediocre games.",
    "timestamp": 1754690400
  },
  {
    "username": "Deus_Ex_Machina",
    "rating": 5.4,
    "comment": "Ehhhhhh. Whenever I play Viticulture, I first go hey why don't I like this game more? And within a few turns I remember. There is so much luck of the draw for a relatively tight worker placement game, and not just the draw the right card for the right situation kind of luck but the cards massively vary in power level. A lot the game provides it is good (eg. the wrestling for turn order) but most has been implemented more successfully elsewhere. I don't think Viticulture has aged particularly well.",
    "timestamp": 1754690400
  },
  {
    "username": "daddylonglegs86",
    "rating": 5.0,
    "comment": "after a few plays it really feels like its on rails. It give you the illusion of choice, but most turns, it is very obvious what you should do.",
    "timestamp": 1753135200
  },
  {
    "username": "recklesswind",
    "rating": 5.0,
    "comment": "feel pretty repetitive and boring after several plays",
    "timestamp": 1751148000
  },
  {
    "username": "Addiction2k",
    "rating": 5.0,
    "comment": "The game play is super swingy and you can win without making very much wine. I like the game play but the cards are super overpowered and it spoils the game.",
    "timestamp": 1750888800
  },
  {
    "username": "ourmove123",
    "rating": 5.0,
    "comment": "Do wine-related actions using worker placement.\n\nThe first player to cross (or exceed) 20 points wins.\n\nThe visuals to me are not great.\n\nThe components are decent.\n\nI found it interesting that the grape/wine tokens are hemispheric transparent pieces.\n\nThe board text is terrible as it is often slanted.\n\nWhile playing with two players, I feel that the worker placement space bonuses are non-existant, and could have been utilized better. What's the point of the bonuses in the two player game?\n\nThe benefits from the visitor cards feel extremely luck based and unbalanced, as some are clearly more powerful than others.\n\nThe worker placement aspect of the game is pretty great as ALL actions in the game require a worker. This means this game is, in a sense, a pure worker placement game.\n\nThe gameplay intertwining with the theme is its strong point, as the player feels like they are closely involved with the wine-making process.\n\nMy main issues with the game are:\n```\nthe luck-based draws (i.e., four sources of luck: vine, summer visitors, wine orders, and winter visitors),\nthe balance of the visitor cards,\nthe first action advantage (due to the wake-up chart)\n```",
    "timestamp": 1748728800
  },
  {
    "username": "shawnmackay1593",
    "rating": 5.0,
    "comment": "I know this is extremely popular but I found it long and drawn out, even when trying a game on BGA. As someone who doesn't care about wine, the theme didn't help but I can usually get past that. In this case, I just didn't find the mechanisms that interesting.",
    "timestamp": 1747000800
  },
  {
    "username": "Peneda1",
    "rating": 5.0,
    "comment": "Overrated game. Played this 3 times:\n1st time: Loved it, amazing game!\n2nd time: Why did 1st player got 20 points and last player got 1 point?\n3rd time: THIS GAME IS SHEER LUCK ON CARD DRAW!!!! The strategy you chose will mean nothing if you dont have the right cards!! Bad design!",
    "timestamp": 1742166000
  },
  {
    "username": "Versifex",
    "rating": 5.0,
    "comment": "Tuckboxes created.",
    "timestamp": 1741042800
  },
  {
    "username": "gwebOn",
    "rating": 5.0,
    "comment": "I don't play this anymore.\nI wouldn't even sell it, I'm giving it away.",
    "timestamp": 1740956400
  },
  {
    "username": "ninjapenguinone",
    "rating": 5.0,
    "comment": "Fun, except \"not making wine\" is a viable strategy in this game. Very upsetting.",
    "timestamp": 1740092400
  },
  {
    "username": "sykano",
    "rating": 4.5,
    "comment": "work placement game with vine production theme\noverrated\nhas problems\n\n+ has some ideas (seasons, placement bonus, grande worker, aging products, visitor cards, order cards, residual payments, game end trigger and score, ...)\n+ components are good, but some of the wooden pieces are very fragile (!), using tiles for the buildings would have been so much better!\n+ playable with up to 6 players is nice\n-- balancing issues and gameplay problems (after planting not that interesting, too much points for wine orders, money almost useless in the endgame, payments and aging almost irrelevant, the last worker is a trap, some buildings are not good enough, ...)\n- luck-dependent\n- The theme is not for everyone.\n- gameplay a bit boring (!) and a bit too restrictive, also takes a bit too long for what it is\n- the insert doesn't give enough space, can be problematic with the fragile pieces and additional cards or card sleeves\n- exotic box format\n- expensive for what it is\n\nThe luck of the card draw is odd for such a game, I'm not sure if it is balanced enough. At least the grapes and wine orders should be take 1 out of 2 or 3 or something like that. But after you managed to plant a field full of grapes the game just becomes harvest and sell and is done.\n\nGame ends after relative few rounds. The big wine orders give a lot of points. The residual payments are relatively weak. The VP bonuses seem also quite strong. I think the game could be better if it would be played to 25 points instead of just 20.\n\nI think the harvesting should be an automatic thing at end of each year. It doesn't make sense to have wine growing and not harvesting it. It also doesn't make sense to sell wine directly after it was harvested. It takes at least a bit more time to make.\n\n\nspecially positive points:\n- worker placement with seasons\n- the role of the visitor cards, and having 4 different decks of cards\n- the need to find the right moment to switch gears from build up to scoring (e.g. you can win without maxing out on workers)\n- spring decision\n\nspecially negative points:\n- unbalanced cards, luck of the draw\n- endgame too short\n- money useless in endgame\n- limitations in what you can do (fixed order: get, plant, harvest, make, sell)\n- traps (=misleading game aspects that turn out mostly useless): last worker, payments, 3 fields, some buildings, ...\n- often runaway leader ?\n- people like the game mainly because of the expansion replacement board with 4 seasons, makes the basegame board obsolete",
    "timestamp": 1738278000
  },
  {
    "username": "Batareziz",
    "rating": 5.0,
    "comment": "One of the earlier buys, and one of the earlier sells. Decent game, but not that great regardless of whether I played with or without different modules.",
    "timestamp": 1737414000
  },
  {
    "username": "resolvecherry",
    "rating": 4.5,
    "comment": "Very bland worker placement. Used to really like this, but have since played so many better games and now see this game's limitations. Too luck-dependent, too complex to be beginner-friendly but not really meaty enough to want to play again with the same group. Unbearably slow at 6, still quite slow at 5. Ugly art and graphic design - the landscapes are brown and bland, the people look horrible, and the font and some iconography look like a prototype version. But I'd still play a 3-4p game with an experienced group if offered, once in a blue moon.\n\n3p: Best\n4p: Good\n5p: Fine (as long as most people aren't new)\n6p: Painful",
    "timestamp": 1733266800
  },
  {
    "username": "kylpo",
    "rating": 5.0,
    "comment": "(after 1 play solo using Worlds, 1/2 play at 3p with Tuscany)\n\nRating: 5\n\nLong teach, too much luck in the cards, linear gameplay, little interaction/tension, and overall kind of boring (contract fulfillment for points alone is not fun for me). May've been a good game when it came out, but Dune Imperium has surely replaced it (insert joke about Viticulture not ageing like a fine wine...). I'd also rather play Lords of Waterdeep, Caylus, or Agricola.\n\nI've learned the hard way that my interests do not align with Brothers Murph or Boardgameco. I think I'm done trying Stonemaier games, too",
    "timestamp": 1731625200
  },
  {
    "username": "den2soo",
    "rating": 5.0,
    "comment": "S2",
    "timestamp": 1730674800
  },
  {
    "username": "NIG_WAFC",
    "rating": 5.0,
    "comment": "RIK",
    "timestamp": 1730415600
  },
  {
    "username": "kareds",
    "rating": 5.0,
    "comment": "I go back and forth on this one. I've never had a bad time with it, it just isn't that exciting. But then, just writing this is making me want to play it again.\n\nEverybody that I introduce it to loves it, though, which is worth a lot and earns it a spot on my shelf.",
    "timestamp": 1730070000
  },
  {
    "username": "DatDudeTho",
    "rating": 5.0,
    "comment": "Desent production and fun mechanics. Base game suffers terribly with randomness of visitors and vine/order card draws. Usually a player getting synergic draws or overpowered visitors will run away with win. Fun to play if winning is not a concern, but not strategic for competitive play.",
    "timestamp": 1729893600
  },
  {
    "username": "Quail_Daddy",
    "rating": 5.0,
    "comment": "The game is ok, I don't like the card play which can feel useless as its difficult to pivot strategies for random cards. Its also easy to be left with turns where you cant do much at all if a worker spot has been taken. I feel playing with all the modules of Tuscany can fix this but then it just adds complexity to the game to fix underlying problems.\n\nWeakest worker placement game I have, will likely move it on.",
    "timestamp": 1729548000
  },
  {
    "username": "ObzidiaN",
    "rating": 5.0,
    "comment": "Boring.",
    "timestamp": 1729288800
  },
  {
    "username": "msyterhe",
    "rating": 5.0,
    "comment": "boring long euro, with a gimmick \"wine\" track, otherwise standard worker placement. The premium components and box has people rating this higher than it should be. Also way longer than what it is",
    "timestamp": 1727474400
  },
  {
    "username": "lou_mein",
    "rating": 5.0,
    "comment": "Don’t wanna play it again, I’d rather put my hands in a blender",
    "timestamp": 1726783200
  },
  {
    "username": "Anbucku",
    "rating": 4.5,
    "comment": "Nice player order mechanic, but for the game of its length and type this is way too swingy, because of the cardluck involved.",
    "timestamp": 1726783200
  },
  {
    "username": "RespyII",
    "rating": 5.0,
    "comment": "Sleeved 45x68, 63x88",
    "timestamp": 1726610400
  },
  {
    "username": "Qhorin",
    "rating": 6.0,
    "comment": "Balance tweaks, new art and components. Mamas and Papas provide some necessary direction but also imbalance.",
    "timestamp": 1762297200
  },
  {
    "username": "Rollmops28",
    "rating": 6.0,
    "comment": "The gameplay is very nice but the cards are not at all balanced. Also, some of the strategies always work, which means it can have a limited lifetime.",
    "timestamp": 1762210800
  },
  {
    "username": "t3hjonneh",
    "rating": 6.0,
    "comment": "Includes all expansions and big box.",
    "timestamp": 1760479200
  },
  {
    "username": "mawilson4",
    "rating": 6.0,
    "comment": "A good \"next step\" worker placement game, I enjoy how thoroughly the theme is brought to life through the mechanics. Insofar as all board games are abstractions, it really does feel like you're running a winery.\n\nI've cooled on this quite a bit over the years due to how my tastes have changed, but for the audience it's targeting, I think Viticulture: EE remains an excellent entry in the worker placement genre.\n\nMy Review:\nhttps://bumblingthroughdungeons.com/viticulture-essential-ed...",
    "timestamp": 1759096800
  },
  {
    "username": "Iraperkins82",
    "rating": 5.8,
    "comment": "8/10: Really great game, almost always keeping. I may not suggest it all the time, but will never turn down a game.",
    "timestamp": 1758578400
  },
  {
    "username": "francobollus",
    "rating": 6.0,
    "comment": "Not unpleasant when playing, but somehow I miss finesse in this game. Artwork and theme are great, gameplay is standard and dry worker-placement. Have sold it.",
    "timestamp": 1758578400
  },
  {
    "username": "johnjihoonchang",
    "rating": 6.0,
    "comment": "I really wanted to like this worker placement game, but I found the visitor cards so overpowered that you could mostly just ignore the actual working of the vineyard except when it's rewarded by the visitor cards, especially since it's so hard to line up the winemaking missions with the grapes you have available. Could be fixed with a card market instead of a blind draw off the top of the deck maybe. I hear it's much better with Tuscany, so I'm going to try with the expansion first before deciding to shove this one off.",
    "timestamp": 1757714400
  },
  {
    "username": "Nodens",
    "rating": 6.0,
    "comment": "Sort of the epitome of worker placement. I like how friggin' long it takes to manifest a bottle of wine, so the theme is there. Would play if I want a nice, relaxing evening.",
    "timestamp": 1753048800
  },
  {
    "username": "galakey",
    "rating": 6.0,
    "comment": "Best",
    "timestamp": 1752962400
  },
  {
    "username": "mikymugs",
    "rating": 6.0,
    "comment": "Je n'ai pas vraiment apprécié ma première partie. On était quatre et ce jeu donne le sentiment qu'on ne peut que rarement faire l'action qu'on aurait voulu et que la machine prend du temps à se mettre en route. La gestion des ressources et des cartes et vraiment très(trop) serrée.",
    "timestamp": 1752616800
  },
  {
    "username": "willbeplayin",
    "rating": 6.0,
    "comment": "Stonemaier games tend to end really abruptly to my liking. Mechanics are clear and simple. Some of the visitor cards seem a bit OP but even then, this is one of the more thematic gateway worker placement games there are with really nice production values.\n\nNow that I've played with Tuscany EE and the Visit from the Rhine Valley, Viticulture: EE is much higher on my list due to the changes that those two expansions do to the game. Now it actually feels like you're actually running your own vineyard, rather than having god-like weird visitors coming throughout the year.",
    "timestamp": 1751839200
  },
  {
    "username": "actiondan87",
    "rating": 6.0,
    "comment": "This was my first solo Euro, and it turned me away from competitive thematic euros for years. The solo automa is boring and disappointing because it does nothing except block worker spaces and gain points automatically at the end of its turn (the game was made well before the days of sophisticated Turczi bots).\n\nHaving revisited Viticulture with the World expansion, I still don't care for it. It feels very similar to an Uwe BYOS solo mode, and none of those games have lasted long in my collection.",
    "timestamp": 1751148000
  },
  {
    "username": "ShoddySleeper",
    "rating": 6.0,
    "comment": "Good game but too dry. Good evolving board state with solid worker placement mechanics but lends itself too much towards another resource conversion game without a lot of standout moments",
    "timestamp": 1751061600
  },
  {
    "username": "BggTroll",
    "rating": 5.5,
    "comment": "solo, sold",
    "timestamp": 1750975200
  },
  {
    "username": "Ostropol",
    "rating": 6.0,
    "comment": "Southold/Peep",
    "timestamp": 1750629600
  },
  {
    "username": "yoc660cc",
    "rating": 6.0,
    "comment": "This rating is based on the solo mode only.\nI like the theme, but there are plenty of other games out there now with great solo modes made by Automa Factory.",
    "timestamp": 1749074400
  },
  {
    "username": "HamedS",
    "rating": 6.0,
    "comment": "Not a very good game.",
    "timestamp": 1748901600
  },
  {
    "username": "Oliksandra",
    "rating": 6.0,
    "comment": "Nice gameplay",
    "timestamp": 1748383200
  },
  {
    "username": "SkidFro",
    "rating": 6.0,
    "comment": "Another over-rated Euro game.",
    "timestamp": 1748210400
  },
  {
    "username": "rgtft",
    "rating": 6.0,
    "comment": "Okay game. Score one point lower because it's Stonemaier Games. The last Stonemaier game I will buy.",
    "timestamp": 1747000800
  },
  {
    "username": "LitheLyricist",
    "rating": 6.0,
    "comment": "Has been surpassed by more interactive modern euros",
    "timestamp": 1746050400
  },
  {
    "username": "quori82",
    "rating": 6.0,
    "comment": "설명만 보면 재밌어보이는데, 점수 레이싱/잡다한 카드 종류/와인만드는 느낌 안남/영역싸움 등 묘하게 싫어하는 요소들만 모여있어서 재미가 없던 게임.\n스톤마이어 게임들이 전반적으로 나랑 다 잘 안맞는다.",
    "timestamp": 1745186400
  },
  {
    "username": "alek2",
    "rating": 6.0,
    "comment": "Light worker placement with simple rules and nice theme. Basic game is too schematic to be really good. Tuscany expansion makes this game much better.",
    "timestamp": 1744754400
  },
  {
    "username": "yoyomanhihi",
    "rating": 6.3,
    "comment": "Good worker placement. However, it's really a pure worker placement without anything really original that would have made it more interesting. I would be ok to play again if someone asks, but I wouldn't play by myself.",
    "timestamp": 1744668000
  },
  {
    "username": "D3C6",
    "rating": 6.0,
    "comment": "Sone of the guests are sooooooo good while others are meh. You can end up with no fulfilled purple cards and the game ends. Can be fun you like moving peaces around the board.",
    "timestamp": 1744322400
  },
  {
    "username": "Avid_Equinox",
    "rating": 6.0,
    "comment": "+ overall good worker placement, if a little dull / standard\n- low replay value (each game feels like you do the same things).\n- more RNG heavy than other worker placement games like Stone Age because you draw blind from multiple decks of cards.",
    "timestamp": 1742943600
  },
  {
    "username": "IBashar",
    "rating": 6.0,
    "comment": "Played digitally.\nThe theme is not amazing even though I live in an word-renown wine area. The game is tight-ish while being flimsy at the same time. Seasonal visitors are game-breaker: they do everything better than any action.\nEverything feels out of your control: you're merely trying to do whatever objective you've been delt with the hand you've been delt.",
    "timestamp": 1742857200
  },
  {
    "username": "totero",
    "rating": 6.0,
    "comment": "Medium - 9.5 - (Stored and Sleeved)",
    "timestamp": 1742770800
  },
  {
    "username": "bobjohnson",
    "rating": 6.1,
    "comment": "+ Clever mechanisms, like the wine aging, grande worker, and bonus spaces.\n- Not a lot of opportunity for clever plays.",
    "timestamp": 1742684400
  },
  {
    "username": "Kurierpl",
    "rating": 6.0,
    "comment": "Frustrating and sooooooo random. You have only one way to win. If you don't draw good cards in good time, you can't win.",
    "timestamp": 1742598000
  },
  {
    "username": "Fantazindy_",
    "rating": 6.0,
    "comment": "A popular medium-weight worker placement game\n+ Attractive to a wide audience\n+ Grand workers introduce additional strategies for placing workers and blocking opponents\n- Fulfilling orders requires a long chain of actions, making blocking frustrating\n- Limited ways to score victory points besides fulfilling orders",
    "timestamp": 1740956400
  },
  {
    "username": "2d20",
    "rating": 6.0,
    "comment": "Only play with Tuscany and many modules. Enjoyable 'basic' WP game. A little over rated but can see the appeal for its time, in the genre. More importantly my wife finally got to enjoy the game so that keeps it in a very occasional rotation.",
    "timestamp": 1740610800
  },
  {
    "username": "Auroric",
    "rating": 7.0,
    "comment": "I like Viticulture, for a straight up worker placement game it's very good. Theme is charming, and the mechanics really give you the feeling of running a vineyard. The decision space as to how many grapes to plant (maybe none!), when to harvest, when to let them age is all very fun. The card play is where it shines though. It's where actions are saved and the real tactical play comes in; it's what really decides the game. The ruleset is straightforward, and the game feels tight. The bonuses vs. turn order tradeoff is particularly interesting to me.\n\nIt's still a mostly head-down worker placement, and I do wish there was some direct interaction. It can also feel overly random sometimes, when you just don't get the right grapes or useful visitors. I can also see it getting dry with repeated plays.\n\nFor me it occupies a somewhat similar space to Everdell or Dune Imperium, so I don't necessarily see a place in my collection for it. The theme however could be a big selling point.",
    "timestamp": 1762470000
  },
  {
    "username": "trozei123",
    "rating": 7.0,
    "comment": "very enjoyable. may rate higher if I ever can play with other people.",
    "timestamp": 1762383600
  },
  {
    "username": "js220",
    "rating": 6.5,
    "comment": "Fairly nice classic worker placement game. Not great depth but nice and relaxing to play.",
    "timestamp": 1761606000
  },
  {
    "username": "burgundy90",
    "rating": 7.0,
    "comment": "5/31/2025 - I've had a chance to revisit Viticulture with Tuscany after a long hiatus. Like wine, it is holding up with age but more of a 7 rating - \"good, usually willing to play\". I appreciate the unique theme, production quality, and the strong \"blocking\" as is typical of worker placement. The cards you draw can be very swingy which may not suit everyone. There aren't any satisfying big combos, the strategy feels limited to what buildings you choose to build, and making the most of available worker placement spots.",
    "timestamp": 1761256800
  },
  {
    "username": "emilcavan",
    "rating": 7.0,
    "comment": "Lo tiene David S. (octubre 2025)",
    "timestamp": 1761256800
  },
  {
    "username": "hakamarci",
    "rating": 7.0,
    "comment": "With Tuscany",
    "timestamp": 1760479200
  },
  {
    "username": "HarryCrocker",
    "rating": 7.0,
    "comment": "One of my favourite worker placements after a single play with good tension vying for optimum turn order and the cards bring enough variety to warrant several replays. The personal player card would have benefited from small recesses where the buildings could sit.",
    "timestamp": 1759701600
  },
  {
    "username": "worador",
    "rating": 7.0,
    "comment": "Cards win you the game, not the worker placement or action efficiency. Even with Tuscany. Tuscany also extends the game length a long way.",
    "timestamp": 1759615200
  },
  {
    "username": "Ddyraw",
    "rating": 7.0,
    "comment": "Great Euro, not sure I need to own it though, there are other simple Euros I would grab first",
    "timestamp": 1759442400
  },
  {
    "username": "Mitchwarb",
    "rating": 7.1,
    "comment": "There is a fair bit of fixing needed for this game - but still enjoyable.",
    "timestamp": 1759096800
  },
  {
    "username": "Danielka7",
    "rating": 7.0,
    "comment": "Great family game, entry game to more complex games.",
    "timestamp": 1758664800
  },
  {
    "username": "NordRunner",
    "rating": 6.5,
    "comment": "We both like this. Can be stuck never catching up if you don't get decent vines planted from the start.",
    "timestamp": 1757541600
  },
  {
    "username": "Zete",
    "rating": 7.0,
    "comment": "I played this a few times with some promo cards which seem to have seriously unbalanced the game. I did find it did not capture running a winery as I would have hoped. I tried to stay in character for the game, harvesting varietals, etc. and then making my wine only to watch as one player simply led tours, made lots of money, and won the game. It felt wrong. To the point that we've decided to never play with certain cards again. Of course, my friend now has the most recent edition which has various cards tweaked so it'll be interesting to see if it's as broken as it felt the first times I played it. But it has so much promise that I gave it an 8 because up until the last few turns it was a great game.\n\nNever seemed to get back to the table. Purged",
    "timestamp": 1757282400
  },
  {
    "username": "birki69",
    "rating": 6.5,
    "comment": "Secret Santa",
    "timestamp": 1756591200
  },
  {
    "username": "dougfoolery",
    "rating": 7.0,
    "comment": "Highly thematic worker placement game about running a vineyard. Tuscany expansion is a must, as it introduces more interesting placement spots and opens up more ways to score points. Not the most innovative worker placement game but definitely one of the most thematic. Visitor cards introduce a lot of randomness and detract from the core wine making process. They are not well balanced and some may feel unfair, muddying what is otherwise a clean design.",
    "timestamp": 1756418400
  },
  {
    "username": "SleepyKei",
    "rating": 7.0,
    "comment": "1–6 Players\nCommunity: 1-5 — Best: 3-4",
    "timestamp": 1756159200
  },
  {
    "username": "BrittPH",
    "rating": 8.0,
    "comment": "Meeples with stickers",
    "timestamp": 1762616280
  },
  {
    "username": "celenac",
    "rating": 7.5,
    "comment": "So strategic, but not that brain-burny/thinky as Everdell. It's strategic, but still feels relaxing, maybe because there is no set number of rounds. Players play through as many \"years\" until one reaches 20 victory points.\n\nI'm not into wine or wine-making, but I love how thematic this game is. The mechanisms and game design just makes sense. Some game design choices that make the game fun and strategic include:\n- Not having all locations available to place workers at during every season because some actions are season-dependent (e.g. players can only can harvest and make wine in the winter, players can only plant vineyards and build buildings in the summer)\n- The spring season being used to determine the player order. The \"starting player\" gets to pick the \"bonus\" they want to receive in the coming year first, but the order players go for each season depends on where they place their rooster piece. I think this is really cool and adds another thing players need to think about / account for in their strategy.\n- Players fighting for placement spots because spots are limited.\n- Players needing to account for how important it is to them to be the first player to choose where to place their workers in each season to guarantee they can take the actions they want to take.\n- Players generally needing to strategize how they decide to do the wake up order, how they lay out your fields, from which visitor card deck they should draw from, etc.\n\nThe limited worker placement spots makes it so that it doesn't feel like solitaire. I like that I feel the presence of other players (e.g. via fighting for resources, etc.).\n\nThere does seem to be a bit of luck involved. It seems like which wine orders/cards players draw determine their game projection. And sometimes players can draw up really helpful visitor cards that just work with their scenario. Can be swingy because the random visitor cards can really make a difference.\n\nThis is very fun and seems very replayable. I feel like I'd need to play this multiple times to really digest the whole board game and appreciate the intricate game design.\n\nRulebook is easy to follow. Iconography is great.",
    "timestamp": 1762470000
  },
  {
    "username": "madtimmy",
    "rating": 8.0,
    "comment": "w/ tuscany\n\nsleeved",
    "timestamp": 1762383600
  },
  {
    "username": "Bkoons",
    "rating": 8.0,
    "comment": "w/ Tuscany EE, Moor visitors, and Visit from Rhine Valley expansions",
    "timestamp": 1762124400
  },
  {
    "username": "Suleckja",
    "rating": 8.0,
    "comment": "Everything in this game just works and it is a worker placement game, which is probably one of my favorite mechanics in games right now.\n\nYou're making wine and must choose certain actions that determine your turn order, but choose wisely because this game is tight and if you miss what you need, the impact to your game and final score could be huge!",
    "timestamp": 1762124400
  },
  {
    "username": "Zephyr_Falcon",
    "rating": 8.0,
    "comment": "8",
    "timestamp": 1762038000
  },
  {
    "username": "reswob",
    "rating": 7.5,
    "comment": "its a great game. pleasent complexity. my girlfriend also loves it (the most of all) and so... i also love it",
    "timestamp": 1762038000
  },
  {
    "username": "Budgetface",
    "rating": 8.0,
    "comment": "500",
    "timestamp": 1761865200
  },
  {
    "username": "Agent Chi",
    "rating": 8.0,
    "comment": "Expansions:\nViticulture: Tuscany Essential Edition\n\nViticulture: Moor Visitors Expansion\n\nExtras:\nViticulture: Custom Metal Lira Coins",
    "timestamp": 1761692400
  },
  {
    "username": "whitecreamer",
    "rating": 7.5,
    "comment": "+Tuscany Essential exp\n+Moor Valley\n+Visitors from the Rhine\n\nStart with 1 extra worker",
    "timestamp": 1761692400
  },
  {
    "username": "RunningRed",
    "rating": 7.5,
    "comment": "Sleeved with:\nGGS10065ML Mini European Matte (46 x 71)",
    "timestamp": 1761519600
  },
  {
    "username": "guiler31",
    "rating": 8.0,
    "comment": "1–6 Players\n45–90 Min\nAge: 13+\nWeight: 2.89 / 5",
    "timestamp": 1761519600
  },
  {
    "username": "rebergan",
    "rating": 8.2,
    "comment": "+ Tower Rex Insert\n+ Metal Coins\n+ Moor Visitors Expansion\n+ Tuscany Essential Edition\n+ Visit from the Rhine Valley",
    "timestamp": 1761429600
  },
  {
    "username": "Steve9999999",
    "rating": 8.0,
    "comment": "Amazing art work in this game. Plays even better with the Tuscany expansion.",
    "timestamp": 1761343200
  },
  {
    "username": "07734",
    "rating": 8.0,
    "comment": "Main",
    "timestamp": 1761170400
  },
  {
    "username": "PBandJellyfish",
    "rating": 8.0,
    "comment": "@SC",
    "timestamp": 1761170400
  },
  {
    "username": "Nonlocal",
    "rating": 9.0,
    "comment": "Strong mid-weight worker placement euro. Not many euros have compelling gameplay that also feels thematic (e.g. aging of the wine/grapes).",
    "timestamp": 1762559880
  },
  {
    "username": "clawp1995",
    "rating": 9.0,
    "comment": "3D Insert\nGamegenic Sleeves 66 x 91 Value Pack (200 pack)\nSleeve Kings Mini Euro 45 x 68 (110)",
    "timestamp": 1761951600
  },
  {
    "username": "Connduit",
    "rating": 9.0,
    "comment": "2-6",
    "timestamp": 1761951600
  },
  {
    "username": "Elakansise",
    "rating": 8.7,
    "comment": "Never plays whitout Tuscany.",
    "timestamp": 1761865200
  },
  {
    "username": "Eca333",
    "rating": 9.2,
    "comment": "I need to try it at higher player counts. Will update this rating when I do.",
    "timestamp": 1761865200
  },
  {
    "username": "plbogen",
    "rating": 9.0,
    "comment": "3d Printed Insert",
    "timestamp": 1761778800
  },
  {
    "username": "ditterio",
    "rating": 9.0,
    "comment": "VITICULTURE (1-6 players)\nVITICULTURE: TUSCANY (1-6 players)\nVITICULTURE: VISIT FROM THE RHINE VALEY (1-6 players)\nVITICULTURE: MOOR VISITORS (1-6 players)\n\nGreat game but the Tuscany expansion is a must have for this. Or you can buy the Viticulture World coop game which is great too.",
    "timestamp": 1761692400
  },
  {
    "username": "Nerdvik",
    "rating": 9.2,
    "comment": "Good Edition of a Great game.",
    "timestamp": 1761606000
  },
  {
    "username": "YoLYcmqZ",
    "rating": 8.5,
    "comment": "Thoughts: Amazing game with untouchable theme, especially while enjoying a bottle of wine. Struggles to get to the table IRL. Been playing on BGA without Tuscany and might prefer the simplicity. Tried Visit from Rhine Valley but prefer how the original deck focuses on points—what a board game should be about. Simple, elegant, and thematic as hell.\n\nTag(s): Worker Placement, Thematic, Engine Builder\nBest Player Count: 1-5, {3-4}\nRating: 8, +0.5\nOwn: Physical, BGA\n+ Tuscany Essential Edition\n+ Visit from Rhine Valley\n+ Metal Coins",
    "timestamp": 1761606000
  },
  {
    "username": "sahelanthropus",
    "rating": 9.0,
    "comment": "My wife's favourite game. Controversially, we enjoy it far more as an intro-medium worker placement game without the addition of Tuscany.",
    "timestamp": 1761170400
  },
  {
    "username": "Grape_Deuce",
    "rating": 8.5,
    "comment": "Myself and my OH love this one!",
    "timestamp": 1760911200
  },
  {
    "username": "grayzilla",
    "rating": 9.0,
    "comment": "All cards are sleeved.",
    "timestamp": 1760738400
  },
  {
    "username": "Ineken",
    "rating": 9.0,
    "comment": "Very fun game. Highly thematic.",
    "timestamp": 1760047200
  },
  {
    "username": "DevOpsProDude",
    "rating": 9.0,
    "comment": "44x67 - 472\n63x88 - 252",
    "timestamp": 1760047200
  },
  {
    "username": "Jugamek",
    "rating": 9.0,
    "comment": "2,9",
    "timestamp": 1759874400
  },
  {
    "username": "Tythyrn",
    "rating": 9.0,
    "comment": "This is a really good game. My wife and I have played this together more than any other game and we have fun every time. This will likely stay in my collection permanently.",
    "timestamp": 1759615200
  },
  {
    "username": "Karahkwa",
    "rating": 9.8,
    "comment": "my go-to double date game.",
    "timestamp": 1762668540
  },
  {
    "username": "Niara7",
    "rating": 10.0,
    "comment": "Very good game. I like how there isn't a set number of rounds, but the end of the game is determined by player progress.",
    "timestamp": 1762210800
  },
  {
    "username": "larryonov",
    "rating": 10.0,
    "comment": "Best: 4, 3, 2, 1, 5",
    "timestamp": 1762038000
  },
  {
    "username": "MegaWestWolf",
    "rating": 10.0,
    "comment": "My wife and I enjoy playing this together. She's become really good at it, and I enjoy how we are racing for points.",
    "timestamp": 1761606000
  },
  {
    "username": "el_crosso",
    "rating": 10.0,
    "comment": "I love the setting here and also like this as a very accessible worker-placement game.\n\nI do think I want to add the Tuscany expansion to spice it up a little and maybe add the World coop one too.",
    "timestamp": 1761084000
  },
  {
    "username": "mr_merns",
    "rating": 9.5,
    "comment": "550",
    "timestamp": 1759701600
  },
  {
    "username": "GrandPseudonym",
    "rating": 9.5,
    "comment": "Solo Mode\nGood with 2\nBest with 3\nBest with 4\nGood with 5\n~120 Minutes\n~150 Minutes\nMediumweight\nCompetitive\nEuro\nThematic\nStrategy\nTableau\nWorker Placement\nCardplay\nEngine Building\nEconomy",
    "timestamp": 1759615200
  },
  {
    "username": "Simicic",
    "rating": 10.0,
    "comment": "For first several games, just great. Component quality, top, number of cards, unique feel when playing, overall great game. I thought it could maybe bit boring since most people say you have to buy tuscany etc...also people rate this game as 3+ players while i play in 2....but i find if very interesting and satisfiying...",
    "timestamp": 1759528800
  },
  {
    "username": "Daninaj",
    "rating": 10.0,
    "comment": "In love of this game ?",
    "timestamp": 1759269600
  },
  {
    "username": "AngryBunny07",
    "rating": 10.0,
    "comment": "Last played: 2022-01",
    "timestamp": 1759010400
  },
  {
    "username": "Satchfan350",
    "rating": 10.0,
    "comment": "Who knew wine-making could be this fun!?",
    "timestamp": 1758664800
  },
  {
    "username": "RoyalGames",
    "rating": 10.0,
    "comment": "One of very few worker placement games I enjoyed. Excellent mechanics and the components are top notch, box storage is decent. Another plus is non-gamers like the theme enough to want to play.\n\nI didn't find the solo nearly as engaging, I may try again at some point.",
    "timestamp": 1758664800
  },
  {
    "username": "noboardom",
    "rating": 10.0,
    "comment": "Worker Placement, Hand Management, Contracts\n\nFavorite Mechanics:\n- Resources upgrade at end of rounds (Grapes & wine age)\n- Reward base turn order\n- No End Game Scoring\n- Contracts",
    "timestamp": 1758578400
  },
  {
    "username": "DazBro",
    "rating": 9.5,
    "comment": "Fantastic worker placement game with a clever mechanism where workers have to be kept for certain spots that are only available as the round progresses through different seasons. A great thematic, linear engine building process from planting grapes to selling wine that helps teach the game.",
    "timestamp": 1758405600
  },
  {
    "username": "DSAdixits",
    "rating": 10.0,
    "comment": "This is one of my favorite worker placement games because it adds a hefty dose of luck via visitor cards in order to increase the fun factor. Get the Tuscany expansion.",
    "timestamp": 1757368800
  },
  {
    "username": "Kubidi",
    "rating": 10.0,
    "comment": "Players: 01 - 06\nBest: 03 - 04",
    "timestamp": 1756072800
  }
]