[
  {
    "username": "Floating World",
    "rating": 1.0,
    "comment": "Expansions should not be ranked",
    "timestamp": 1754172000
  },
  {
    "username": "ManEatingHippo",
    "rating": 1.0,
    "comment": "Stop the madness.",
    "timestamp": 1742770800
  },
  {
    "username": "SabrinaUBerni",
    "rating": 1.0,
    "comment": "Production errors, which are not solved after several years. Offering a defective product is a no-go.\n\nElse: Nice game.",
    "timestamp": 1734822000
  },
  {
    "username": "hstefan",
    "rating": 2.0,
    "comment": "My biggest issue with this game is that it's extremely unrewarding. When we managed to play really well the story development and bonuses felt underwhelming, and when you failed the results was disproportionately negative.\n\nOur group was very dedicated but it felt like the game would always screw us over regardless of how hard we tried. I suspect most people who claim this is an easy game are either extremely lucky or just aren't following the rules very closely.\n\nThe only reason we kept the box is to set it on fire during midsummer.",
    "timestamp": 1682978400
  },
  {
    "username": "Elanif",
    "rating": 2.0,
    "comment": "The worst installment in the Pandemic Legacy series, in my opinion. The new theme defies the title and It feels like there is no danger at all. the new mechanics aren't as fun as the ones in the previous two games.",
    "timestamp": 1622844000
  },
  {
    "username": "TheRoyalPieMaker",
    "rating": 2.0,
    "comment": "- most of the actions in this game are dictated by the cards you draw. You don’t get a sense of agency and instead it feels like the cards are playing the game. There’s no smart or interesting decision making. You’re just buying time until you draw the right cards.\n- only played the prologue but the debrief were just that. Brief. Not much was learned from the story. In fact when we read the other option which was for losing, it gave more information that if we had completed the objective.",
    "timestamp": 1608073200
  },
  {
    "username": "vinayplusj",
    "rating": 3.0,
    "comment": "A big let down compared to other Pandemic games. The story is predictable and weak. Has combined the weaknesses of Pandemic style coops and legacy games.\n\nHas the Pandemic series jumped the shark?",
    "timestamp": 1731366000
  },
  {
    "username": "Zoleeka",
    "rating": 3.0,
    "comment": "Huh, this was a terrible experience. I have to say that the original Pandemic was my first modern board game and the first co-op ever. The fact amazed me that we can play against the game. But during the years I played too much with it (also on app) so I got bored with it. Meanwhile I have seen that the legacy version became the top one and it is still the top two. When my friend called me whether I wanna play with it, I said why not, let's give it a try. The first game had the same boring flow for me, however I didn't give up. I thought by time it will get better...but not. At the contrary, it became worse. Repetitive, boring, long, incaptivating. So after the 4th game night I told to my friends I don't wanna continue playing with it and wasting my time. After this bad experience I have decided to skip any Pandemic-mechanic game and I honestly don't understand how this game can be the 2nd on the BGG top list. I wouldn't even put in the top 500.",
    "timestamp": 1721080800
  },
  {
    "username": "Jason245",
    "rating": 3.0,
    "comment": "This game is too convoluted with way to much crap for what it is and story is not engaging.",
    "timestamp": 1689976800
  },
  {
    "username": "Masterblocker",
    "rating": 4.0,
    "comment": "Just a priorization number no actual rating",
    "timestamp": 1736550000
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 4.0,
    "comment": "We have never really played much Pandemic prior to hopping into this. Our first three attempts at the prologue were not successful.\n\nAnother night… it took three attempts but we beat the prologue. At the very last possible moment.. we went on and tried January…. What a bad outing. Nothing completed.\n\nStill here, but I have a plan to gift this.",
    "timestamp": 1724709600
  },
  {
    "username": "mi_de",
    "rating": 4.0,
    "comment": "More pandemic crap.",
    "timestamp": 1689544800
  },
  {
    "username": "MvRens",
    "rating": 5.0,
    "comment": "Great at first, personally did not enjoy the gameplay loop anymore from midway to the end. If my wife didn't push us to finish the story I wouldn't.",
    "timestamp": 1758319200
  },
  {
    "username": "FrayedEdges",
    "rating": 5.0,
    "comment": "Not close to Pandemic or season 1. Have played (restarted) the first mission 3 times. No urge to play this campaign. Something is missing here.",
    "timestamp": 1757887200
  },
  {
    "username": "eddieb",
    "rating": 5.0,
    "comment": "I'm halfway through and beginning to hate the game. I loved the first two. This is just getting to be too much stuff. Not a small change. but huge random changes every game.\nUpdate- almost all the way through and wish I never played. having fun because I'm with friends. but this game is not for me. loved season 1. mediocre season 2. this agent stuff in the underground facility while the others try to save the world is a pain.",
    "timestamp": 1754690400
  },
  {
    "username": "yayg",
    "rating": 5.0,
    "comment": "DNF",
    "timestamp": 1747519200
  },
  {
    "username": "jonsbane",
    "rating": 5.0,
    "comment": "We are 5 games into this now and so far it hasn't been challenging enough! The theme is perfect and the components are top notch. Compared to Season 1, they have improved so much. However it just hasn't been hard at all. Hoping this changes in the remaining games, e.g. maybe we get a loss at some point, or really have to think hard to work out what to do, or scrape through on some luck - none of which applies so far.",
    "timestamp": 1739746800
  },
  {
    "username": "Hugobossgames",
    "rating": 5.0,
    "comment": "Het coöperatieve werkt niet lekker in dit spel.\nEn het is uitdenken van details en dat vind ik niet leuk.",
    "timestamp": 1735426800
  },
  {
    "username": "MatroidX",
    "rating": 6.0,
    "comment": "Still very early on, but having a blast. The Teams and Safe Houses are nice changes to the Pandemic formula; we'll see how our modifications and purchases affected things \n\nUpdate: I feel the rules are getting a bit too convoluted. I love many of the changes, but there's just so many... Sadly looks like we abandoned it ~June (all perfect wins except 1 partial win iirc).",
    "timestamp": 1760911200
  },
  {
    "username": "Milpus",
    "rating": 6.0,
    "comment": "Good for non gamers.",
    "timestamp": 1753567200
  },
  {
    "username": "hiyou",
    "rating": 6.0,
    "comment": "パンデミックレガシー:シーズン0。\nシーズン1と2と来て、今度は0だ。オリジンが一番熱いですからね。スクラッチが削れないという遊べないレベルの不良、ぎこちない翻訳、緊張感のないアウトブレイク、たくさんの瑣末なモジュール。面白い部分も多々あったけれど、デベロップが行き届いていない感。",
    "timestamp": 1749420000
  },
  {
    "username": "marklcmlsc",
    "rating": 6.0,
    "comment": "Stuck at around March and never got to finish the season, unlike Seasons 1 and 2.\n\nSeason 0 has departed from the healthcare/post-apocalyptic theme into a full-on espionage flick. While this would be a plus for some, my SO and I are not big fans of espionage or Cold War history, and the theme change zapped away a lot of the fun. We weren't able to engage with the story, and weren't keen to continue with the campaign.",
    "timestamp": 1739142000
  },
  {
    "username": "Rygel",
    "rating": 6.0,
    "comment": "Not as good as Season 1.",
    "timestamp": 1731366000
  },
  {
    "username": "y1n4",
    "rating": 6.0,
    "comment": "初期玩法和一般《瘟疫危機》相仿，但需要控制的不再是『瘟疫』而是紅色勢力的『特務』。\n基本上每回合除了需要解決冒出的敵方特務外，就是完成不同月份的任務：找出目標所在城市，做好準備前往該處並解決。\n\n難度不算太高，有原先普通版《瘟疫危機》經驗的玩家理應可以很快上手，只是各任務間會加入新的機制需要去學習\n\n遊戲最大缺點是本系列長久以來的弊病：玩家彼此完全開放資訊導致的指揮型玩家Alpha Player狀況。",
    "timestamp": 1730934000
  },
  {
    "username": "Qhorin",
    "rating": 7.0,
    "comment": "Heavily rethemed Pandemic takes it to an interesting place - killing agents and running missions instead of curing. Fundamental escalation and waiting for specific card draw remains the same.",
    "timestamp": 1762124400
  },
  {
    "username": "jerevinan",
    "rating": 7.0,
    "comment": "해야됨",
    "timestamp": 1760652000
  },
  {
    "username": "Anne_Claire",
    "rating": 7.0,
    "comment": "Adult - co-op legacy game",
    "timestamp": 1760392800
  },
  {
    "username": "RougeHemlock",
    "rating": 8.0,
    "comment": "Really neat take on the Pandemic system where instead of diseases spreading, it's cold war era spy shenanigans. Lot of fun tie-ins to season 1 and season 2. I do recommend playing this AFTER 1 and 2. Easily the most unique of the 3 seasons, but not quite as fun as season 2 for me which made it feel a little anti-climactic to end on.",
    "timestamp": 1760824800
  },
  {
    "username": "blake33",
    "rating": 8.0,
    "comment": "Love the theme and the components are great. Gameplay is a lot of fun, just like 1 and 2. My only complaint is the randomness of the punishment for incident markers getting placed.",
    "timestamp": 1759269600
  },
  {
    "username": "alialkabah",
    "rating": 8.0,
    "comment": "SOLD\nbecause it staid for a long time without being played\n\ncan't seem to be able to start the campgain on this one, been playing prologue for 3 times, we forget the rules and don't want to begin not knowing how to play, even in prologue we lost twice and won once, but is very fun (yes even prologue was fun)",
    "timestamp": 1757973600
  },
  {
    "username": "Elwenion",
    "rating": 9.0,
    "comment": "✅Season0",
    "timestamp": 1761343200
  },
  {
    "username": "Barbarrodja",
    "rating": 9.0,
    "comment": "Casi el juego perfecto, es realmente apasionante, lo único es que la expansión de los agentes soviéticos queda un poco rara.\nOtro problema es que la traducción al español no es tan buena como debería y que las ciudades no están bien ubicadas.",
    "timestamp": 1759442400
  },
  {
    "username": "xilia",
    "rating": 9.0,
    "comment": "one shot game, so only 9 of 10",
    "timestamp": 1752530400
  },
  {
    "username": "CharliewithCat",
    "rating": 10.0,
    "comment": "First legacy game of mine. I've played Pandemic before but THIS omg, a whole new experience, it still have the mechanism of Pandemic but the theme is completely different and I love it. Omg i hope I can have a team of 4 to try this out, cus the last time i played was just me and my boyfriend",
    "timestamp": 1760479200
  },
  {
    "username": "Ironclad_Board_Gamer",
    "rating": 10.0,
    "comment": "My favorite of the three",
    "timestamp": 1759010400
  },
  {
    "username": "pupykises",
    "rating": 10.0,
    "comment": "worth the rating. this one is arguably better than season 1, but i wouldn't fault you if you said otherwise. my time spent with both was really terrific.",
    "timestamp": 1758837600
  }
]