[
  {
    "username": "mickhah1",
    "rating": 1.0,
    "comment": "The game is a pure disappointment. No matter how you play on stategic level, if you don't get needed dice results you can't hunt or conquer strongholds. Everything depends on pure luck. I score one hit from 12 dice rolls on 6+ and 0 on 4+ battle cards, my opponent scores 5 sixes from ten dice rolls. 0 successful hunt rolls on 6+ from 12 dice throws. You play half a day and lose because rolls are bad.\nRule book is horrible. Tons of exceptions which are scattered around so you need to watch through every page every time you need to find anything.\nThis game is just an overrated pile of crap.",
    "timestamp": 1762210800
  },
  {
    "username": "zmartianov",
    "rating": 1.0,
    "comment": "The author of this book glorifies cultural conquest",
    "timestamp": 1754604000
  },
  {
    "username": "NavayaTCG",
    "rating": 1.0,
    "comment": "Impossible to win as frodo",
    "timestamp": 1750024800
  },
  {
    "username": "Monkeydeeznutz",
    "rating": 1.0,
    "comment": "Bruh no one wants to learn ts\n\nDogshit",
    "timestamp": 1743372000
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "I assumed this would be a similar level as learning Star Wars: Rebellion. It’s way more complex. And in some ways more scripted.\n\nI feel like this is my fault, being too dumb for this game. But it’s not really inviting enough either, unless you’re a HUGE LotR fan.",
    "timestamp": 1729893600
  },
  {
    "username": "Floating World",
    "rating": 1.0,
    "comment": "The same game should not be ranked twice",
    "timestamp": 1683928800
  },
  {
    "username": "Daddy18",
    "rating": 1.0,
    "comment": "I’m going to give it a 5 for now. I intend to revisit this game and give it an updated rating when that happens. Few things that really hurt it though.\n1st. The rule book is huge to digest and organized really poorly, having to flip back and forth between pages to resolve how one thing works is extremely annoying.\n2nd. The minis are low quality. At the very very least have the different nations come in different colors. No all red or all blue. Less than ideal.\n3rd. Guys c’mon with the typos dce instead of dice sege instead of siege, and the wording could use a little clean up too. I don’t want to go back to that novel right now to point out examples but jeeeeeeezzzzzzz.",
    "timestamp": 1677538800
  },
  {
    "username": "Superherocjc",
    "rating": 1.0,
    "comment": "Not up to the hype, mostly luck-based and the implementation of the figures and rulebook are lacking. The figures could have at least been different colors for each nation and the rulebook is very dense and lacks organization. As is it also feels very unbalanced in favor of the shadow player.\nIf you want a strategic war game then play Dune.",
    "timestamp": 1663020000
  },
  {
    "username": "Thierrex",
    "rating": 1.0,
    "comment": "Boring outdated gameplay. Only for LotR Fans because of the theme. For everyone else: stay away.",
    "timestamp": 1654639200
  },
  {
    "username": "supergraci",
    "rating": 1.0,
    "comment": "Mi calificación más baja en la BGG. Quien redacto el reglamento es el nuevo Demogorgon o uno de los jinetes de la Apocalipsis. Me tiré un fin de semana para darle sentido al mismo, afortunadamente no tenía ningún arma en casa que me pudiera haber dejado en otro mundo.\n\nVendido con fiesta incluida.",
    "timestamp": 1633989600
  },
  {
    "username": "Dimaus",
    "rating": 1.0,
    "comment": "pls nooo",
    "timestamp": 1603753200
  },
  {
    "username": "sorentheborn",
    "rating": 1.0,
    "comment": "ew",
    "timestamp": 1595973600
  },
  {
    "username": "cosmin augustin",
    "rating": 1.0,
    "comment": "......",
    "timestamp": 1372111200
  },
  {
    "username": "EnderWiggin",
    "rating": 1.0,
    "comment": "Not a valid separate game entry",
    "timestamp": 1361055600
  },
  {
    "username": "fritopunk",
    "rating": 2.0,
    "comment": "I really do not like this game",
    "timestamp": 1757973600
  },
  {
    "username": "Chakoburito",
    "rating": 2.0,
    "comment": "Didnt like game at all. Btw i am a fan of lotr theme, however this game is boring in addition to being so long",
    "timestamp": 1723500000
  },
  {
    "username": "Pellestor",
    "rating": 2.0,
    "comment": "Feels too much like work, like 5 different games packaged together. I’m not invested enough to dedicate that much time to learn a game.",
    "timestamp": 1707606000
  },
  {
    "username": "PwrSrg",
    "rating": 2.0,
    "comment": "This game is absolutely horrible. I have NO idea why it is so high on the BGG chart. We love heavy games, and gave this numerous tries, but just could NOT get into it no matter how hard we tried to like it.",
    "timestamp": 1691877600
  },
  {
    "username": "GarfieldKlon",
    "rating": 2.0,
    "comment": "#25\n\nGave up while reading the rules. Takes at least 5 hours to learn the game. Just too much text with no pictured examples. Dozens of rules and exception that you all have to keep in mind.\n\nJust too complicated for a board game and I'm not willing anymore to spend hours and hours to learn a game to have fun.\n\nI would play it if someone asks me and explains it to me.",
    "timestamp": 1685484000
  },
  {
    "username": "uduhno",
    "rating": 2.0,
    "comment": "I had a lot of issues with the game and my opponent disliked it more than I did.",
    "timestamp": 1682028000
  },
  {
    "username": "Jyabura",
    "rating": 2.0,
    "comment": "I really wanted to like this game, but it was just not the game for me. Too much dice rolling, and really felt like you had to follow a particular strategy without much variance.",
    "timestamp": 1650751200
  },
  {
    "username": "howdydodat 9",
    "rating": 2.0,
    "comment": "A game about the illusion of free will, apparently.",
    "timestamp": 1602972000
  },
  {
    "username": "Malaggar",
    "rating": 2.0,
    "comment": "Boring game with stupidly big map and crappy minis to make everything even more bigger and table space-hungry.",
    "timestamp": 1599948000
  },
  {
    "username": "CommonWalker",
    "rating": 2.0,
    "comment": "Very long, very boring.. This game have nothing common with Tolkien Trylogy - only the theme. Happy i sold it.",
    "timestamp": 1579215600
  },
  {
    "username": "sonatajessica",
    "rating": 2.0,
    "comment": "Woah, you better be a huge LOTR fan, and even more important, a fan of long war games. While I can on board with the LOTR stuff, the length and especially the intensive learning curve: we played for 3 hours and had hardly moved along at all. You have to look up everything, some people online say you should just keep going, you don't need to understand everything but I found it hard to make any decisions if I don't know what is going and what are the consequences.\nBut even if I could muster up the patience to learn this, I don't think I would like it. The dice combat system is bad, it is not better than your outdated Risk combat and that is at least quick. It seemed as if no matter what you strategized and cards you played, the dice just decide and anything else doesn't matter. I hate that mechanic. And when you pair with endless lengthiness that boils down to whether you can roll a 5 or a 6, I am a bit pissed to be honest.\nAdditionally, the looks of the game are a bit disappointing. Lots of minions and a cool map board but I have seen better looking games, and similar games that pull of a better design.\nI know, there is love for this game but I feel that comes from a very specific type of gamer (love theme? love immersion? want to get lost in LOTR for hours and more hours while you occasional roll battle dice?) and I am not that type.",
    "timestamp": 1578956400
  },
  {
    "username": "Jixashi",
    "rating": 2.0,
    "comment": "Takes too long to learn, takes too long to set up, takes too long to play it out. I hate RNG, and this game has plenty. Only plus is the game is highly thematic. However, the game plays out as, sauron beats the living shit out of free peoples up until ring bearer brings the ring to mordor, which is decided by dice rolls over several turns.",
    "timestamp": 1577574000
  },
  {
    "username": "Duke_Rufus",
    "rating": 2.0,
    "comment": "Extremely well-cared for, pieces in miniatures boxes.",
    "timestamp": 1569189600
  },
  {
    "username": "OverEngineered",
    "rating": 2.0,
    "comment": "Far too many rules and down time. Probably an orgasmic experience for LotR fanatics, but the theme makes me yawn. Definitely not worthy of such a high ranking when there are numerous games that are more fun.",
    "timestamp": 1446764400
  },
  {
    "username": "j11change",
    "rating": 3.3,
    "comment": "Way too overcomplicated for it to be less fun than Axis and Allies or even Risk. Also felt very limited or win con's for each side.",
    "timestamp": 1752789600
  },
  {
    "username": "theaaron",
    "rating": 3.0,
    "comment": "My biggest issue is the length. Not just that it is a long game, but the way that it is a long game. When attacking, you usually only hit on a 5 or a 6, and if someone retreats into a stronghold (which they will do often), it is even harder to successfully attack. This means that most battles feel unwinnable and the game would be much shorter if it weren't for this one issue. I've only played once so far, so hopefully this will improve with more plays.\n\nThat issue aside, the gameplay is pretty unique and has an epic feel because of all of the different armies and Frodo's quest to secretly enter Mordor.\n\nUpdate: Could never really get this to the table because of the play time and complexity. I also picked up The Battle of Five Armies which I think I can actually get people to play and gives a similar feel.\n\nSold.",
    "timestamp": 1717365600
  },
  {
    "username": "DanFred",
    "rating": 3.0,
    "comment": "Way too random, way too long, way too imbalanced, way too slow, way too fiddly, way too long set up (seriously took an hour just to set up the game) and the pieces are hard to distinguish from one another. There are things here I enjoyed but not enough for the amount of negatives. If the game gave more agency, less luck, quicker turns, faster setup, less downtime between turns I would enjoy it more but the negatives don’t outweighs the positives.",
    "timestamp": 1707519600
  },
  {
    "username": "Entropology",
    "rating": 3.0,
    "comment": "Just too many rules and niggling production issues kept me from really diving into this. I can see the interesting aspects, but just never reached them. Too much setup, too much searching for locations, too much rules hunting, too much to track. I'm sure if I really dedicated myself to this, there is gold down there, but there are other options that are gold with 99% less pain.",
    "timestamp": 1692568800
  },
  {
    "username": "Victoria_hermit",
    "rating": 3.0,
    "comment": "Still Risk.",
    "timestamp": 1667080800
  },
  {
    "username": "Growal",
    "rating": 2.5,
    "comment": "This one is a dice game. And in my option, it isn't well designed. It takes forever and the luck factor when rolling dice takes away the strategic element. Although you need to think and plan a lot, everything can be turned upside down by dice. We played 264 distinct games. This one is the one we like least. Never had less fun playing a boardgame. In addition, the rulebook is a mess. Don't understand the point by now, but we will keep on trying. What you really need to enjoy this one is a lot of time, a lot of luck when rolling dice and an enormous frustration resistance when it comes to finding information in the rulebook.",
    "timestamp": 1662760800
  },
  {
    "username": "DiploC3PO",
    "rating": 3.0,
    "comment": "sORRY, 4 GAMES, IT ALL DEPENDS ON ROLLS AND DRAWS",
    "timestamp": 1662501600
  },
  {
    "username": "lovelace",
    "rating": 3.0,
    "comment": "Great theme, but not my kind of game. Not planning to play it again, thus 2/10 for me.\nI can definitely see that it will be a 10 for others.",
    "timestamp": 1653948000
  },
  {
    "username": "Mayasty",
    "rating": 3.0,
    "comment": "All mechnisms are subordinated to the book and movie and from the game perspective are full of absurds and useless. Free People have a lot of troops scatterd all around the map but it doesn't pay off for them to fight, because they are doomed to fail anyway. So all these troops rarely move and fight and are just frozen useless on the map where they are. Their only role is to be a cannon fodder against the attacks of Shadow Armies. So why are they on the map? Just to reflect the book, not to make the game interesting. The only reasonable objective for the Free People is then to forget about their armies and rush the Team of Ring towards Mordor in as few moves as possible.\n\nBesides, there are plenty of tiny mechanisms and heavy texted cards that try to reflect the niuances of the book but from the game perspective are just weird, annoying and barely playable. Thus the game is pretty crude.\n\nIn terms of huge power asymetry between the players it resembles \"Star Wars Rebelia\" but in \"Star Wars\" I had much more fun than here.\n\nOne time experience only.",
    "timestamp": 1645657200
  },
  {
    "username": "mdrozdziok9595",
    "rating": 3.0,
    "comment": "Epic game and epic dissapointment. Game similar to „Risk” with an addition of race. Not worth this 3-4 hours of suffering even though game end was pretty exciting",
    "timestamp": 1645570800
  },
  {
    "username": "abdiqanimoh12",
    "rating": 3.0,
    "comment": "However is good game",
    "timestamp": 1641337200
  },
  {
    "username": "Kurokami",
    "rating": 3.0,
    "comment": "I really really wanted to like this game since I am a huge lord of the rings fan. I've tried to learn how to play it 3 times by watching videos, reading the rules, googling easy ways but it is such a soul crushing process that after many hours I gave up.",
    "timestamp": 1612738800
  },
  {
    "username": "ZootCat",
    "rating": 3.0,
    "comment": "Hard to play",
    "timestamp": 1609369200
  },
  {
    "username": "heartpiece013",
    "rating": 3.0,
    "comment": "Unreadable rulebook, lots of dice-rolling, high luck factor. My partner loves Lord of the Rings, so this was a huge disappointment for him. If you are looking to play as Frodo in a strategic Euro, this isn't that game.",
    "timestamp": 1595455200
  },
  {
    "username": "kilianbognar",
    "rating": 4.0,
    "comment": "Okay, so I know it's called WAR of the Ring, but hear me out. I don't claim to be a huge Lord of the Rings expert, but as far as I can tell, there are maybe three major battles in the trilogy. Meanwhile, War of the Ring allows battles to break out everywhere, all the time. It feels more like total war, and the strategic possibilities often veer into weird, narrative wise unlikely situations, so to me, it doesn't really capture the essence of LotR.\n\nThat said, my low rating isn’t really because of that. I actually found it easier to learn than most people say, and my one session was blissfully concise. But it’s just a bit fiddlier to play compared to some newer modern troops-on-a-map games and it comes with the huge board with large unimportant territories around the edges and more than 200 small plastic figures, and I don’t really feel any urge to return to it. And I can only play it with 2.",
    "timestamp": 1759010400
  },
  {
    "username": "honk3d",
    "rating": 4.0,
    "comment": "+3 np",
    "timestamp": 1758146400
  },
  {
    "username": "tectactoe",
    "rating": 4.0,
    "comment": "Need to spend more time with this one to get better and/or more accurate feelings, but my initial thought is that it is a great game with deep gameplay that suffers just a bit from the burden of its rules and the absolute mess of game pieces. Had a ton of fun with my first playthrough, saw the strategies of each side slowly congeal as the rounds marched on, started to understand the value of taking (or \\not\\ taking) certain actions at certain times, felt appropriately torn between the various paths to victory (and, conversely, how to properly \"defend\" against my opponent's paths). My first (and thus far, only) game was played as the Shadow Armies, for the record. There are, of course, a couple ways to preplan or sort of mitigate, but nevertheless you can totally end up victim to poor and unlucky dice rolls, which is admittedly disappointing in a game that is so rich and otherwise governed entirely by player decisions.\n\nAnd yes, I understand that a game this elaborate is going to have a lot of rules. I've played many games with a ton of rules. But for whatever reason, I had trouble internalizing a good portion of the rules in this one, especially the little situational caveats and whatnot. Even then, I don't think these rules or their burden makes this a bad game, but it DID great a somewhat sluggish experience, because I was \\constantly\\ referencing the rulebook or player aid. Like, nearly every turn. I suspect it might have at least a little to do with my disconnect from the game's central theme (not a big Lord of the Rings fan, truthfully, so a big chunk of the terminology isn't second nature, and the rules that might have a thematic parallel are lose on me). Is that MY problem and not the game's? Possibly. But hey, what can do you. In any case, I still quite enjoyed this one and am looking forward to playing again...Whenever I can find the time.",
    "timestamp": 1757887200
  },
  {
    "username": "shmonkey",
    "rating": 4.0,
    "comment": "Partial play with Chris. It's got all the hallmarks of an epic game, including the rules overhead and playtime. I don't think I would play this again unless prompted And I had nothing better going on for the next 8 hours.\n\nAfter a full play, the game is really thematic and despite my combat rolls being abysmal for the first half of the game, got to see how things work on both sides. This is a long one like 18xx, so its definitely a \"special event\" game. lots of good decisions to be made and a good time was had by all. Its tough to apply a standard rating to really long and really short games. For long games such as this, you really want some amount of downtime between plays. But i would play again.",
    "timestamp": 1738191600
  },
  {
    "username": "quietcorn",
    "rating": 4.0,
    "comment": "Long and complicated war game that I just couldn't manage to get through. The game essentially being 2 players didn't help either. It might be a decent book emulator, but as a game we didn't find it very enjoyable.",
    "timestamp": 1721685600
  },
  {
    "username": "sudothefox",
    "rating": 4.0,
    "comment": "This is a tough one to rate. It's very well designed, thematic and easy to understand once you get through the rules and setup. There's more than enough to take multiple gameplay to fully understand and leverage all the mechanics.\n\nThat all said it took 2 and a half hours to set up and learn and another 5 hours to play the game. It felt stale and repetitive well before we were halfway through. I kept wishing the game would have a mechanic to automatically push us forward and to an end, but the length of the game largely depends on the players involved.\n\nThis game is also a bear to learn if you aren't familiar with the media it's based on. While I am aware of the Lord of the Rings, I am not familiar with the lore, names of races or locations or characters, or the story beyond a high level overview. If I wasn't playing with someone who was very familiar with those things, I don't think I would have made it through the game. Too many times I had no idea what the card or rules in my hand were trying to tell me or reference.\n\nThis is all mostly on me, in the end, I'm not a fan of war games and this fell exactly where I expected it to. I can appreciate why others enjoy it, but I wouldn't be quick to play it again myself.",
    "timestamp": 1712613600
  },
  {
    "username": "Quickdraw2197",
    "rating": 4.0,
    "comment": "Too dull for me, perhaps exciting for some, but I just can't get into it concerning setup times and what I get out of the game.\nThe minis are also ugly as sin.",
    "timestamp": 1711580400
  },
  {
    "username": "Neokarasu",
    "rating": 4.0,
    "comment": "Dice rolling is one of my least favorite mechanism in a game and this game runs on it. There are some mitigations available (Elven rings, leaders reroll, combat cards, etc.) to reduce the luck factor but it isn't enough especially since games will run 2-3 hours. Personally, I like the LOTR theme and it does feel very thematic but this game is still not something I'll ever play again.",
    "timestamp": 1708729200
  },
  {
    "username": "MotherMary",
    "rating": 4.0,
    "comment": "I firmly believe this game is so popular because it is wrapped in the LOTR IP only. It would not hold up to a historical wargame of an 8 or 7 purely on gameplay. Maybe even a 6.5.\n\nAlso despise miniatures in board games. Wish they were counters. Miniatures are just candy to attract kickstarter backers, and to distract from bad gameplay. Miniatures are for terrain, not printed boards.\n\nPlayed twice, gifted to a friend.",
    "timestamp": 1679526000
  },
  {
    "username": "netes",
    "rating": 4.0,
    "comment": "Tan apasionante como jugar al Risk a 2 jugadores",
    "timestamp": 1676761200
  },
  {
    "username": "BlindWo1f",
    "rating": 4.0,
    "comment": "While I do need to go back & give it another go, so far I find this game rather obtuse. The rules feel convoluted & far more complex than needed, the pieces are too many, all thrown in 1 bag when you get it & hard to tell the difference between.\nIf I want to play a long 2 player head to head war game I'd always chose star wars rebellion over this.",
    "timestamp": 1659132000
  },
  {
    "username": "JoshmyGosh",
    "rating": 4.0,
    "comment": "I should love this game. It is interactive, strategic, thematic, and epic - in theory it is right up my alley. In reality, I find this game to be a slog.\n\nFor one, the game has way too many rules for the experience that it offers. Army movement and combat, for example, pretty much boils down to \"move a space and roll some dice\", but it has six pages of rules. I understand that this is called \"chrome\" and it exists to allow wargames to accurately simulate their source material, but the gameplay here isn't too far off from Risk. Risk plus chrome does not equal a good game in my book.\n\nMy second big problem with this game is that it is a war of attrition. The primary strategy of the free people is to literally hide behind walls and stall for as long as possible. That is certainly in keeping with the theme of LOTR, but it doesn't exactly make for a fun game. To be clear, there ARE some really exciting and thematic moments in this game, but they are completely buried behind the four hours of tedium (five if you count set up).",
    "timestamp": 1655935200
  },
  {
    "username": "Ravensburg24",
    "rating": 4.0,
    "comment": "Outcompeted by Star Wars: Rebellion. Can be rather ponderous.",
    "timestamp": 1647990000
  },
  {
    "username": "SWxNW",
    "rating": 4.0,
    "comment": "Among the Action Dice rolls, the Hunt Pool draws, and the thick stacks of incredibly situational Event Cards, there are just way too many fickle vectors. It's just a frustration fest.\n\nMoreover, the graphic and physical design choices are atrocious. Almost everything is too small and baroque to tell apart. From the symbols on the Nation's Political markers to the units on the map and even the chits marking the Companions and the Companion minis themselves. Just a nightmare to look at.\n\nI was genuinely surprised at how not good this game ended up being.",
    "timestamp": 1642719600
  },
  {
    "username": "SFRR",
    "rating": 5.4,
    "comment": "Reasonably fun game...does an excellent job with theme and feeling the Middle Earth vibe. Game is very imbalanced though, I've read lots of tournament data, FP wins maybe 30% of the time. Our group: FP 3, Shadow 8.\n*NOTE - all FP victories were against first-time WotR players.\n\nI have only won as FP because I was playing a Shadow player who had never played the game before.\n\nYes, I know and have employed all the strategy recommendations written for the FP; \"always move the Ring every round, twice in a round when possible.\" Moving the Ring twice means you have 2 action dice left for everything else.\n\nAll the videos and training / strategy aids say the same things for the FP, there's nothing in them that isn't patently obvious...\"move the Ring at least once every game round.\" Last game as FP (8/8/'24) moved the Ring 8 times in 6 game rounds. Rohan fell, all of Gondor fell, Lorien fell...game over. My Fellowship had 0 corruption and no Companions had been killed. Shadow player just followed a very simple and very obvious strategy; build lots of units, move Armies, attack with Armies...game over by Military Conquest in 6 game rounds 10-0.\n\nANY, and I do mean ANY, brand new Shadow player who is nothing more than basically competent in military strategy games will win 90%+ of the time.\n\nComment 8/15/2025: I want to like this game so badly, I watch videos, I read people's strategy guides, I try their moves...but the game to me still seems hugely biased in favor of the Shadow. So let's say I spend hours and hours of more game play time getting better, and finally in 6 games I win 3 as FP achieving a 50% win-rate...will it have been worth it (?), or, should I just play something else that doesn't require all this commitment and memorization to just achieve basic competitive parity?\n\nUpdate 8/11/2025: Shadow wins again, brand new player but competent in the basics of strategy wargames, easy win, game wasn't even close.\nUpdate 8/14/2025: Shadow wins again in a very lop-sided 10-0 / \"Ring-not-in-Mordor\" overwhelming victory.\nUpdate 8/25/2025: what a surprise, another win by the Shadow, destroyed the fellowship on corruption 2 steps from the Mordor track. Shadow player also had 8 points towards military vistory. Not a close game.\nUpdate 9/14/2025: another win by the Shadow, not really a close game.",
    "timestamp": 1757887200
  },
  {
    "username": "Saume",
    "rating": 5.1,
    "comment": "Not my kind of game, just too long for what it is (ultimately just dudes on a map with dice combat).\n\nMy first game lasted 6 hours (including a long setup and explanations). There are a lot of stall mechanics when defending, which really elongates a game. These mechanics, however, are somewhat needed given how the map is, otherwise the Free Peoples wouldn't last long. I personally do not feel like a game like this (essentially a dice chucker) should last even close to 3 hours (seems to be around that length after your first game).\n\nA major negative point for me is that the events are all plain text and WAY TOO SITUATIONAL. Most of these events aren't powerful enough to warrant such restrictive conditions. I understand that they wanted to simulate the movies and books somewhat, but this should be our version of the Lords of the Ring. The fact event cards are so verbose also makes it a pain for new players. So much text to read during gameplay. They should've greatly simplified those and tried to incorporate more iconography over long descriptions. I guess on those aspects, this game really shows its age.\n\nThe rulebook was around 50 pages, but honestly, it wasn't that bad to read through. While there are many small rules, they usually make sense logistically. It could've been less verbose for sure, though. The only part that was a little more complex in the rules is the Fellowship of the Ring, moving them and the Hunt for the Ring.",
    "timestamp": 1756764000
  },
  {
    "username": "Mandurang",
    "rating": 5.0,
    "comment": "Gets a pass from me mostly for its thematic and evocative aspects. The actual gameplay doesn't feel that good to me. I would rather play a whole bunch of things at 2p before I sit at a WotR table.",
    "timestamp": 1753912800
  },
  {
    "username": "stude",
    "rating": 5.0,
    "comment": "Too much miniature battle oriented wargame to my taste.",
    "timestamp": 1750543200
  },
  {
    "username": "Antura_V",
    "rating": 5.0,
    "comment": "T (sold)",
    "timestamp": 1744236000
  },
  {
    "username": "marriedcouple",
    "rating": 5.0,
    "comment": "Do you like spending hours just to set up a game? Back pain from bending over? Then this is the game for you.\n\nOtherwise, it's fine but it's long and it takes too long to set up.",
    "timestamp": 1735772400
  },
  {
    "username": "zfairborn",
    "rating": 5.0,
    "comment": "Notable improvement from 2nd Edition. Rule-book includes a visual setup guide.\n\nStill quite deep and complicated for a 2-player game, which requires you to have a dedicated opponent playing multiple games for the value of the game to come to full light.\n\nStill, if you CAN find a dedicated 2nd player for that, it would be worthwhile!",
    "timestamp": 1732748400
  },
  {
    "username": "trihydroboron",
    "rating": 5.0,
    "comment": "Reading the rules made this game seem like it was going to be epic, but it ended up just feeling dry and tedious.",
    "timestamp": 1722722400
  },
  {
    "username": "Mack1993",
    "rating": 5.0,
    "comment": "There's a lot to love about the game but the complete picture leaves me wanting more. I love the card system, action dice, and thematics. I wanted more from the hunt for the ring system especially.",
    "timestamp": 1720821600
  },
  {
    "username": "Aphexia31",
    "rating": 5.0,
    "comment": "Just Meh.",
    "timestamp": 1718748000
  },
  {
    "username": "CotB",
    "rating": 5.0,
    "comment": "Rankings\n5th Best Game 2017\n64th Best Game 2018\n92nd Best Game 2019",
    "timestamp": 1712354400
  },
  {
    "username": "BenWH",
    "rating": 5.0,
    "comment": "Could be a fun game, and turns up some quite interesting 'what ifs' etc. More fun if you know the books well. However the game has two quite serious flaws: an army retreat rule that can be used to manouvre, and an endgame that appears connected to the rest of the game, but in reality is wildly unpredictable and somewhat ignores it.",
    "timestamp": 1706482800
  },
  {
    "username": "brownsound",
    "rating": 5.0,
    "comment": "Duża, złożona gra z mnóstwem zasad, wymagająca zaangażowania i najlepiej stałego partnera, dobrze znającego mechaniki.\n\nZe względu na tematykę, która nie jest mi dostatecznie bliska, nie ma na nią miejsca w kolekcji.",
    "timestamp": 1705273200
  },
  {
    "username": "blanket221",
    "rating": 5.0,
    "comment": "是一款人民與國家爭鬥的遊戲，每個遊戲回合都圍繞著動作骰子的滾動：每個骰子對應於玩家在回合中可以執行的一個動作。根據每個骰子上滾動的面，可以採取不同的行動（移動軍隊、角色、招募軍隊、推進政治軌道）。遊戲規則算是簡單，有時間可以玩玩看！",
    "timestamp": 1704668400
  },
  {
    "username": "Smeary",
    "rating": 5.0,
    "comment": "heavy",
    "timestamp": 1700694000
  },
  {
    "username": "LaRoix",
    "rating": 5.0,
    "comment": "This game is way too long, way too laborious to set up, and far more complicated than it needs to be. The book is a jumbled mess where key points of information are not where they should be so you have to flip through pages of text to find an answer. I've played it twice now, and it's exhausting to learn. Once I felt I understood the rules and mechanics, I can only say its a convoluted mess: Why do we need hunt tiles? Just make a die roll with a chart! Why is a sword the symbol for character movement? That's easy to remember! Why is it so slow to move troops and why are so many territories undefended to begin with? I like long, complicated games, but this game just goes way too far.",
    "timestamp": 1699657200
  },
  {
    "username": "GeorgW",
    "rating": 5.0,
    "comment": "Thematic and swingy!\n\nPros:\nI think that if you have any interest in the IP, it's a game that's worth it to play once. I'm happy to have played it, it's very thematic and I really like the asymmetry and dice action system.\n\nThe different card effects, and choosing whether to use them for the top action or to save them for their bottom combat action works well. There are interesting and thematic effects in the decks, but as with any of this type of games you need some basic familiarity with the range of effects to play competently.\n\nThe dice action system is really well done. I like the asymmetry of it, that the Shadow has more dice but must use some for looking for the fellowship. It constrains options in an interesting way, as sometimes one of the players takes a risk or rolls an unusual result, and the game is all about exploiting those opportunities.\n\nThe different characters and how their effects reference the source material creates a great thematic framework. I like that getting extra dice is especially relevant for the Free Peoples and how they must play to achieve that.\n\nI really like the whole Fellowship mechanism. Pushing your luck trying to get closer to Mordor and choosing which path to take to either avoid risk or gain time. It's very evocative.\n\nCons:\nI want to be very clear that this game was never going to be for me. I don't like big and complex games, and prefer cubes to miniatures. I also don't do well with dice. I like them, but I'm serious when I say that they don't like me, as exemplified by losing a 6% die roll in my one play of this, dooming my chances early in the game.\n\nIt's very fiddly with the many different, similar-looking miniatures and it took 5 hours to play in addition to the 1h teach (though I probably could have conceded a lot quicker once things started to go downhill if I was more familiar with the arc of the game).\n\nBut my biggest complaint is unsurprisingly the dice. 5 dice for combat is just way too few for me, it creates these wild swings that weren't satisfying at all for a game that takes 5 hours. If it was closer to 1 hour I'd be all for more swingyness, but it didn't gel for me with the rest of the game.\n\nAlso, with a game this huge with all of its chrome, why the hell aren't there enough dice for both of us to roll at once? If I was developing a 3rd edition of this game, all I'd change would be to put in 10 red dice and 10 blue dice and change the combat to use 2 dice per unit (a simple doubling) and for the hit results to be half as likely on average (probably using some comparative measure instead of a static check to make it feel more dynamic).",
    "timestamp": 1698706800
  },
  {
    "username": "TigerAce",
    "rating": 5.0,
    "comment": "I'm a LotR fan, but this is clearly not my kind of game. Yes, it looks beautiful when set up and it is highly thematic. But too much depends on random dice rolls. I was the Free Peoples player and it felt like all I could do is wait and hope that Frodo gets to Mount Doom before my armies are totally crushed by the Shadow. Which is not the kind of gameplay experience that I enjoy.",
    "timestamp": 1692223200
  },
  {
    "username": "Kukko",
    "rating": 5.0,
    "comment": "Axis & Allies: Middle-Earth. Too strategically one-dimensional and too dependent on the die rolls to justify the length. The Shadow side better forget about the ring and just rush Gondor. And the good guys can ignore the hopeless war and concentrate on pumping the Fellowship track.\nStar Wars: Rebellion did the \"stealthy good guys vs. the overwhelming horde\" ameritrash so much better, I'm not crazy about giving this one another chance, but in case it might play a lot faster the next time, still giving a hopeful 5.",
    "timestamp": 1676156400
  },
  {
    "username": "Paulermo",
    "rating": 5.0,
    "comment": "To long, for just 2 players we played better games",
    "timestamp": 1674082800
  },
  {
    "username": "fjaellraeven",
    "rating": 5.0,
    "comment": "+Baumbart\n+Die Herren von Mittelerde\n+Die Krieger von Mittelerde\n+hölzernes Inlay",
    "timestamp": 1672268400
  },
  {
    "username": "JasonHine",
    "rating": 5.0,
    "comment": "Convoluted rules and slow gameplay make it unapproachable. Not a game to play when you're tired or it's getting late.",
    "timestamp": 1663884000
  },
  {
    "username": "OfTheAngels",
    "rating": 5.0,
    "comment": "Screams into Void. SOMEONE PLAY THIS WITH ME!\n\nI'm sure ill give this game a 10/10 but finding someone else to donate their time is impossible I guess.\n\nThis is place holder review.",
    "timestamp": 1655935200
  },
  {
    "username": "andy61",
    "rating": 5.0,
    "comment": "Long and strategically challenging but very thematic implementation of Lord of the Rings in board game form. Needs a day set aside to do it justice.",
    "timestamp": 1653602400
  },
  {
    "username": "cfarrell",
    "rating": 5.0,
    "comment": "There is a decent module for this on Tabletop Simulator, so this is another game I'm revisiting in the era of COVID. I can see why this game always drove me nuts! It's not actually that good, and it fundamentally misunderstands Tolkien. But it's kind of fun, you get to move stuff around on a map of Middle Earth, the dice occasionally inflict some drama. It's irritating in many ways, but also has a few legitimate interesting decisions. It takes way to freaking long. It reminds me a lot of Rebellion, also not very good, although it's probably better than that. It also really surprises me how many rules they had to use to do the two expansions - I think it could almost have been done exclusively with new characters, cards and maybe dice.\n\nI think ultimately the length and dead pacing probably will keep me from ever enjoying this that much. There are two legit great Lord of the Rings themed games: Knizia/Kosmos' The Lord of the Rings, and ICE's Middle-Earth CCG. This is not even close to those games. It's also not even close to Sophisticated Games' The One Ring RPG. It's WotR-themed Risk, with a lot of theming. But that's not the worst thing in the world, in all honesty. As in so many things, overproduced nostalgia has a place. But that's about all this is. Star Wars: The Queen's Gambit is better. It isn't great either though.",
    "timestamp": 1640386800
  },
  {
    "username": "Rabidboxer",
    "rating": 5.0,
    "comment": "a 5 on the BGG scale. For my tastes too much to know before you can be competitive (aka gotta memorize the cards). I found the theme gets sucked out when so much of the game is just a dice roll. I can see why people like it but not for me.",
    "timestamp": 1622152800
  },
  {
    "username": "TumbleSteak",
    "rating": 5.0,
    "comment": "The game leans too heavily on the hunt for the ring mechanic. Which is essentially just a series of dice rolls to see who wins.",
    "timestamp": 1614985200
  },
  {
    "username": "Trebuh",
    "rating": 5.0,
    "comment": "Awesome Climate, map and epic feel of journey during a raging storm but I do not like miniatures, fight system and definitely the descriptions on cards should be shorter and more precise.",
    "timestamp": 1605308400
  },
  {
    "username": "AlbertoRavioli",
    "rating": 6.0,
    "comment": "65/100",
    "timestamp": 1761519600
  },
  {
    "username": "salaba",
    "rating": 6.0,
    "comment": "With all expansions which destroyed this game for me. Drop from 8 to 6 rating, but if I would rate how I feel about the setup and dices in the game I would rate it as 3. That much I dislike the system after playing a lot of different games since I bought this one. There are plenty of better games out there and I really prefere the Card version now.",
    "timestamp": 1760479200
  },
  {
    "username": "logopolys",
    "rating": 6.0,
    "comment": "War Game\n Two-Player Game\n\nMy 1st edition comment: \"There's a lot happening for this game, and I respect everything it set out to do. Theme-wise, it has come second only to Confrontation for Tolkien games. The action dice system is one of the best parts; every other dice mechanic it has (read: combat) is what kills this game. Bah. Still, a good time and a better spectator sport.\"\n\nThe new edition is much like the first. The production is outstanding and the art beautiful. I was taught the first edition and had to teach myself this edition, so I can say categorically that the rulebook is pretty terrible. It's organized in a way that's not useful, and provides few examples and little indication of exceptions.",
    "timestamp": 1759356000
  },
  {
    "username": "Piston",
    "rating": 6.0,
    "comment": "这款游戏有两个维度：军事和魔戒远征队。军事本质就是一个倒计时机制，因为基础游戏里，自由阵营不可能在军事上赢得黑暗阵营。自由阵营要做的就是在无法避免的军事溃败之前把远征队送进末日山（符合原著的自由阵营赢得佩兰诺平野之战需要运气爆棚才能实现），而黑暗阵营要做的就是一心抓住远征队，或者一心打下刚铎走军事胜利。\n远征队看似选择自由，有五条路线可走：\n符合原著从墨瑞亚穿过迷雾山脉（风险来自墨瑞亚）、\n穿过艾森加德和洛汗（最危险）、\n从幽谷东边的高隘口跨过迷雾山脉后向南与原著路线合并（风险来自多古尔都的魔多军队）、\n穿过高隘口后继续向东经过黑森林到达河谷镇之后向南从黑门进入魔多（可以号召沿路的精灵、人类、矮人参战，但第二长）、\n到达艾森加德西边后继续向西绕过白色山脉从刚铎西境进入刚铎（最安全，但最长）。\n但实际上自由度几乎不存在。因为走艾森加德形同送死；而走最长的两条完全不符合原著的路线，你就会发现原著中的远征队不是傻子，走此等远路妥妥是保证在你看到末日山长什么样子之前，刚铎便早已陨落的最佳方式。所以从此角度讲该游戏利用软性限制很好的复刻了原著。但代价就是自由阵营是真TM无聊，每局的区别就只剩下在游戏开始时从两条路里选一条了。剩下的体验全都任由RNG之神摆布。加了几个扩展之后平衡性直线上升，然而这里评价的是基础游戏。",
    "timestamp": 1759096800
  },
  {
    "username": "yangtze2000",
    "rating": 6.0,
    "comment": "I should love it, but it's a bit clunk mechanically and the minis detract from the experience. I think it would be better with chits/counters instead of minis, but then I'd want to be playing SPI's Middle Earth game instead.",
    "timestamp": 1758837600
  },
  {
    "username": "jaceycole",
    "rating": 6.0,
    "comment": "7.5 - 1 play, 2 players - Finally learned this game, which was a sizable undertaking as there are lots of little exceptions to the rules. I really liked the action dice system, the right amount of randomness and constraints on decision making to help avoid overmuch AP. I like the combat system and the mix of dice and cards. The way the game seems like it can play out seems like just the right amount of similarity to the story and room for new stories to be written. I could see us wanting to play this once a year.\n\n6.0 - 2nd play - I was the free peoples this time and found it much less enjoyable. Four dicemans generally you end up with fewer actions to take, and usually moving. The fellowship is a given, so that makes for boring moves. Knowing that the strategy is basically to get to Mordor as fast as possible makes playing these people's less interesting. Overall, this game is just too complex and takes too much time to refresh before every play, still there's lots of rulebook checking which makes it very cumbersome and like you're just lumbering along..",
    "timestamp": 1757368800
  },
  {
    "username": "DiceMind",
    "rating": 6.0,
    "comment": "Only played a learning game. Would have to play again to rate.",
    "timestamp": 1755813600
  },
  {
    "username": "Dhel",
    "rating": 6.0,
    "comment": "Ok, honestly I see the appeal of this game but for me this is:\n- too long\n- although there are many actions in the middle earth, I see that option for Free People to destroy the ring is the best one, which limits a lot tactical options\n- the biggest con - too luck dependent! Basically - you have better rolls - you can win, you have the worst possible rolls, doesn't matter what you do, you can't win. For me such design is just old dated and I have zero interest playing this game ever again.",
    "timestamp": 1754258400
  },
  {
    "username": "gabrieln",
    "rating": 6.0,
    "comment": "A rich thematic area control light wargame that allows players to make some interesting decisions and to use strategic reasoning to achieve what they need in order to win. But the game is more about the experience, about re-relling the story of the most important event of the third age of middle-earth. However, the game requires too much involvement from you and others around you, and unfortunately I have many more games and not enough people to play them. I also dislike the card management and play, it is an unnecessary extra layer of complexity.\n\nLords of Middle earth expansion i a must. I think the game works much better with it.\n\n• MECHANICS (INNOVATION/IMPLEMENTATION): 8/10\n• THEME-MECHANICS INTEGRATION: 9/10\n• DEPTH (COMPLEXITY VS. IMMERSION): 6/10\n• INTERACTION: 10/10\n• BALANCE: 6/10\n• COMPONENT QUALITY AND CONSISTENCY: 6/10\n\nStyle: American\nPlayer mode: 1 vs. 1\nGenre: Fantasy Wargame\nSubgenre: Area Control\n2 players.",
    "timestamp": 1752444000
  },
  {
    "username": "MichaelaPat",
    "rating": 6.0,
    "comment": "2025",
    "timestamp": 1751407200
  },
  {
    "username": "Miiitra",
    "rating": 6.0,
    "comment": "Juego bélico por equipos donde enfrentaremos a los ejércitos del mal y del bien. Todo ello mientras la Comunidad avanza para destruir el anillo.\nEl juego es demasiado azaroso en los enfrentamientos y el sistema de diplomacias, aunque es temático, solo supone un inconveniente a los jugadores.\n2 jug - 3 jug - 4 jug",
    "timestamp": 1750629600
  },
  {
    "username": "DrJULIK",
    "rating": 6.0,
    "comment": "Not our cup of tea. Set up is annoying.",
    "timestamp": 1745704800
  },
  {
    "username": "maejohns",
    "rating": 6.0,
    "comment": "I probably need to give it more of a chance. Or maybe play an online version to learn more of the flow of the game. But when the two of set this up and stepped back, we said ... wow this game is overrated.",
    "timestamp": 1744495200
  },
  {
    "username": "joshelliott1513",
    "rating": 6.0,
    "comment": "Super tough to get to the table, but I enjoy it when I do.",
    "timestamp": 1744063200
  },
  {
    "username": "D6Veteran",
    "rating": 6.0,
    "comment": "This is one of the games I really want to continue to love, but it has not aged well. There are much better strategy/war games available that make this game seem bogged down and monotonous.\n\nCan no longer justify the space this game takes up, and giving away to local gaming group.",
    "timestamp": 1741474800
  },
  {
    "username": "BryanKromrey",
    "rating": 6.0,
    "comment": "Not for me. Dice and Cards determine your actions instead of the players. You play the game fishing for the right cards, you don't draw them, game over!",
    "timestamp": 1740265200
  },
  {
    "username": "Gia187",
    "rating": 6.0,
    "comment": "Zeer thematisch spel dat nog relatief snel speelt.\nImo vergelijkbaar met star wars rebellion maar ander thema en andere win/loss conditions. Speelt best wel met 2.\nDe dice rolls kunnen soms wel dik tegenvallen maar dat mag je op een spel als dit niet afrekenen.\n\nHet leuke is ook dat je vooral de verhalen achteraf herinnert.\nDe mechanismen in war of the ring zijn wel beter dan star wars rebellion. Je hebt je kaarten die je extra's kunnen laten spelen maar je dice bepalen wat je kan uitvoeren van acties.\n\nHet grootste negatieve voor mij is dat praktisch alles door dice wordt beslist en je niet altijd een manier hebt om deze te modifien. Je hebt wel je kaarten die je tactisch kan spelen maar er is niet echt een engine die je kan opbouwen. Zo is het maximum dice in combat altijd 5 en kun je je tegenstander niet overtreffen met aantallen. Ook het feit dat elites gewoon standaard units zijn met 2 hp is voor mij wat zwak om onderscheid te maken qua units.",
    "timestamp": 1732489200
  },
  {
    "username": "schrifterz",
    "rating": 6.0,
    "comment": "Thematically nice, mechanically meh and I am not the biggest LotR nerd",
    "timestamp": 1731366000
  },
  {
    "username": "loony4ever",
    "rating": 6.0,
    "comment": "SELL",
    "timestamp": 1730502000
  },
  {
    "username": "VadymH",
    "rating": 6.0,
    "comment": "A lot of things are complicated, I couldn’t master the rules",
    "timestamp": 1723672800
  },
  {
    "username": "hagensam",
    "rating": 6.0,
    "comment": "not really a fan of the mechanic, but I guess people just favor the theme over the mechanic.",
    "timestamp": 1723154400
  },
  {
    "username": "sbconstant",
    "rating": 6.0,
    "comment": "Plausibly replayable and good atmosphere. Might be more fun in teams of two, where you focus on your particular group's adventure. The expansions would be fun. I don't like minis and these certainly don't make an argument in their favor. An ugly map too. Better to get SPI's or ICE's game.",
    "timestamp": 1720562400
  },
  {
    "username": "BearDot25",
    "rating": 6.0,
    "comment": "I finally got a friend of mine to commit to play this... and I have so many thoughts. Despite both coming prepared with learning the rules, we ended up playing for almost 8 hours total, which was completely ridiculous. Most of that was the first few rounds taking like 2-3 hours because of looking up exceptions and making sure we were getting everything right. By the end we were playing quickly--I think we could do a full game in 3-4 hours now.\n\nI played Free People and he played Shadow. I think FP have a bit of an advantage in the first game; it's very easy for the SP to make mistakes and overcommit early on, whereas the beginning seems more forgiving for the FP (as you tend to gain strength as the game goes along). For example, he killed Gandalf the first turn, but then I just brought him back as Gandalf the White and made Strider my guide (who is kind of better anyway). We also got in a huge battle right at the start around Moria, and he ended up throwing way too many troops to their death trying to take the Elven Stronghold there because he didn't realize how difficult it is to take.\n\nI also killed Saruman a few hours in because he left him alone in Isengard, not knowing I have cards that can kill him if he does that. He also let the Witch King die in a doomed assault on Minas Tirath, though that was mostly because I somehow got 4 hits in one roll. The result was the game was kind of over about half way through... by the end I won by military victory (I took Isengard after I fought back his siege on Helms Deep and sent Aragorn and a huge force rolling through the Southerlings), though I also had Frodo on the last step to Mount Doom in case that failed.\n\nI also think he didn't realize how much of the game for the SP is attrition, then sending an overwhelming force to take strongholds. He kept assaulting and getting me down to a few guys but didn't have enough to finish me off. He'd have to slowly build up and move out again, but by the time he was back in position I'd rebuilt and was ready to fight again. By the last turn I was almost completely out of reinforcements, but still had all my companions alive except Boromir (of course), strong forces in and around around every major stronghold, and had Frodo in position with plenty of corruption left to take (I got him to Minas Tirath and let him heal back down to 1 corruption before moving to Mordor).\n\nOverall, I think the game is a genius design. But we both agreed that it's very, very restricting and laboriously slow. It pushes you to do certain things so that the theme comes through, which I think is both good and bad. On the one hand, it creates great stories and makes the LOTR nerd in me happy. But on the other hand, there's not much room to be creative and if you are unaware of those restrictions it can bite you (like not knowing FP can kill Saruman if you leave him alone)--and if you mess up, you'll be dealing with the consequences for hours. I think my friend was frustrated by the combination of very deterministic gameplay, long playtime, and the luck of rolling (at one point he literally said\" I really hate this game\" after a few bad rolls), but by the end he'd learn how to work around all the punishing little rules and restrictions and mitigate luck.\n\nAll that said, now that we've played the game and know how restrictive it is, I think we could be more creative playing within the barriers the game creates for you. And I definitely want to play it again--it really wouldn't be worth all the investment if we didn't!",
    "timestamp": 1715205600
  },
  {
    "username": "John Rogers",
    "rating": 6.0,
    "comment": "Thematic, high stakes, devastatingly tense for the free peoples. Also long (4hr+). Can feel simultaneously incremental and inevitable. Makes sense given the subject matter. Tolkien fans should definitely give this one a go.",
    "timestamp": 1714341600
  },
  {
    "username": "cosmolsmith",
    "rating": 6.0,
    "comment": "Pros:\n- Massive war game with mechanics that push you towards huge battles.\n- Decisions feel hugely impactful and you can imagine the theme based on the characters involved.\n\nCons:\n- It feels grueling, everything happens very slowly as pieces advance territory by territory.\n- The luck introduced by dice might not be for everyone.\n- Fiddly rules (you will definitely be referencing the rulebook, and the rulebook is not the best)\n\nBut one of my biggest gripes: the rulebooks and board just don't feel well thought through, especially for a 2nd edition. There are just so many small things this game could have had to make it easier to play:\n- Distinguish the armies better (different colors? Better figures?)\n- Add shorthand rules for things like the ring bearing mechanics to the player sheet as those are a big thing in the game.\n- There are definitely rules that feel important that are hard to discover in the rulebook (e.g. are the wring wraiths leaders for army movement? Yes they are, but it's not discussed in the army movement section, in the player sheet glossary it specifically says that Nazgul are not leaders. It's mentioned in the 'component figures' section of the rulebook...)\n\nI feel like if everyone's playing for the first time you just have to expect that a lot of rules will be played wrong. But it doesn't have to be that way if the rulebook and iconography were better.\n\nOverall, I can see that that this game can feel deep, thematic and strategic. I can see why LotR fans would love it. But in my first 2 plays it feels like a slog to me (apart from a few epic battles).",
    "timestamp": 1709074800
  },
  {
    "username": "Hedgehobbit",
    "rating": 6.0,
    "comment": "Only played this once and it was OK. It seemed like going for a military victory for Sauron just isn't possible. That there aren't enough turns to capture enough of the map.",
    "timestamp": 1708124400
  },
  {
    "username": "jkach91",
    "rating": 6.0,
    "comment": "Very large and involved game that unfortunately, we have not been able to really get into. Like many of my larger games, I feel that I need to set aside an entire day if not a weekend to review the rules, set up the game, go through certain scenarios before actually sitting down to play the game. And for a game like War of the Ring to be entertaining, I think both sides need to approach it with equal skill ability.",
    "timestamp": 1705791600
  },
  {
    "username": "Buchas",
    "rating": 6.0,
    "comment": "Too much dice based luck.",
    "timestamp": 1704841200
  },
  {
    "username": "Paddouken",
    "rating": 7.0,
    "comment": "Owned it but sold it few years later. It is not a bad game but it is a little bit retro. The rules, rulebook and artwork jeed a little fresh up. Also, with the expesnions, this game is just too much stuff. Always had to read a lot of the rules again because they feel not self explaining.",
    "timestamp": 1761606000
  },
  {
    "username": "Technarius",
    "rating": 7.0,
    "comment": "Initial Impression after 3 Games (2x2 Players and 1 x 4 Players):\n\nI really like the game but it has it's problems.\n\nI believe it is the best Epic Duel Wargame with miniatures out there. The Battles are tight, Troop replenishment and reinforcement is challenging, the mind game/ social deduction aspect is interesting and expansions are really great.\n\nThis game suffers from the same problems as Star Wars Rebellion though:\n- High Randomness / Dice Luck on really meaningfull Battles and Hunt for The Ring stuff. The Hunt for the Ring has additional random Tile Draw on top of it. The outcome of a game CAN and high likely WILL depend on randomness if 2 equally players play against eachother.\n- Random card Draw often leads to situatios, in which you can not play your whole hand...\n- Takes waaay too long for a 2 Player Game\n- Very complex, so it is hard to find somebody to bring that much passion, which is needes to learn and understand the rules.\n\nVerdict: If asked, I will love to play it - if i find the right amount of time. The problem is - in my group nobody will ask me to play it. I sold it because of the problems i mentioned earlier.",
    "timestamp": 1760565600
  },
  {
    "username": "CallicoJ4ck",
    "rating": 6.5,
    "comment": "early ranking. For what it is and the time one needs to probably get into it and get it down to 2h playtime I am not sure if its worth it. Yet friends have managed to play it 15-20 times and are now down to 2h playtime and THEN it seems to shine. But the way there, all the rule digging and getting everything right - maybe just many more rounds of MN:E and rather 4-6 player games instead.",
    "timestamp": 1757023200
  },
  {
    "username": "Telaz",
    "rating": 7.0,
    "comment": "My rating (50%): 7\nMy “want to play-again” rating(50%): 7\nMy averaged rating: 7\nPlays: 1",
    "timestamp": 1754172000
  },
  {
    "username": "Unitoch",
    "rating": 7.0,
    "comment": "A bit better balanced than the first edition and with some small improvements, but largely the same game. My comments from that apply here as well. In short, the game is wonderfully thematic with nice production values and a lot of love in it. Mechanically, I don't love that the ring seems to be the most important piece of the gameplay. There's a lot of attention focused on the combat but it has relatively little influence over who does/does not win. The winner gets decided based on bag pulls and action dice rolls, which are a much smaller piece of the game.",
    "timestamp": 1750024800
  },
  {
    "username": "bobyams",
    "rating": 7.0,
    "comment": "Love it! Ultimately too long and difficult to bring to the table. I switched to the card game War of the Ring and never looked back.",
    "timestamp": 1749592800
  },
  {
    "username": "Nathan_and_Joe",
    "rating": 7.0,
    "comment": "2-4 Players",
    "timestamp": 1748815200
  },
  {
    "username": "KingInTheCorner",
    "rating": 7.0,
    "comment": "Arguably a more faithful novel adaptation than the movies were. All the better for it.",
    "timestamp": 1747692000
  },
  {
    "username": "cbradley7",
    "rating": 7.1,
    "comment": "Enjoyment: Good\nMechanics: Good\nReplayability: Good\nTheme: Great\nElegance: Good\nArtwork: Good\nComponents: Good\n\nOverall Rating: 7.1",
    "timestamp": 1746914400
  },
  {
    "username": "cadaverous",
    "rating": 7.0,
    "comment": "Even with significant preparation this game is difficult to play, and only partly because it is very rules heavy. There are some poorly selected visual design elements that make certain actions much harder to see and perform than necessary.\n\nI hope a future play-through will result in a higher rating.",
    "timestamp": 1746828000
  },
  {
    "username": "Zondag",
    "rating": 7.0,
    "comment": "It shoul be a 9, but I cannot play it often because of the game length. And it ends with a lottery.",
    "timestamp": 1746482400
  },
  {
    "username": "infinitepeaks",
    "rating": 7.0,
    "comment": "I have played one game of War of the Ring. I very much want to play more - I wish the accessibility of the game was better (I am deeply tempted to do a Whole Cube Replacement for the minis - but the minis! I'm not a mini guy but they do add to the _vibe_), but the decisions, the stories, the drama, it's all so good here.",
    "timestamp": 1741647600
  },
  {
    "username": "LordEnlil",
    "rating": 6.5,
    "comment": "3",
    "timestamp": 1739487600
  },
  {
    "username": "computer82",
    "rating": 7.0,
    "comment": "Italian Version",
    "timestamp": 1737846000
  },
  {
    "username": "ImZhe",
    "rating": 7.5,
    "comment": "Awesome game\n\nGood Things:\n\n-Massive amounts of replayability and strategies can differ greatly from one game to the next based on which cards you draw early on.\n\n-Games are memorable because they each tell their own story through what happens and it is balanced very well.\n\n-Extremely thematic, for example the Fellowship's shortest path to Mordor is through Moria but it is more dangerous since getting revealed while traveling through Moria will cause you to take extra hits of corruption. The second shortest path is over the mountain, as suggested by Aragorn in the actual story, however, for the second half of the journey past Rivendell the Fellowship won't pass by any Free People Strongholds to rest and heal corruption at, it's just a straight trek through the barren northeastern part of the map to Mordor. There is a slightly longer path if you go south, and that path also passes by Rohan and Gondor, so you can warn those nations or rest at the cities if you want but it will take even longer and that extra time is all Sauron needs to crush the strongholds across middle-earth.\n\nA couple issues I have with the game:\n\n-Once you get onto the Mordor track, it's pretty much all dependent on luck whether the Free People will be able to dunk the ring or lose to corruption. This falls flat compared to the rest of the game where you are making strategic decisions and tough choices.\n\n-The different factions should have really used different color plastics, it would have reduced setup time greatly.\n\n-Long learning time, takes a few playthroughs and rulebook checking in order to fully understand how the rules work. Definitely need a committed partner to play against.\n\n-Initial starts feel a little wonky, it is thematic for Gandalf to die and become Gandalf the White but it ends up being you trying to intentionally kill off Gandalf ASAP to respawn him for an extra action die. Similar weird things with the action die for Aragorn and the Shadow leaders.\n\nFinal Thoughts:\n\nStill a really cool game, but have lost interest over time in getting it to the table.",
    "timestamp": 1761606000
  },
  {
    "username": "MoochyMania",
    "rating": 8.0,
    "comment": "* Custom Insert ✓",
    "timestamp": 1760652000
  },
  {
    "username": "arnadil84",
    "rating": 8.0,
    "comment": "Amazing game, but the rules are rather complicated and not well connected. There are just too many details that make the rules unnecessary complicated instead of simply complex (which I have no problem with in other games). Besides that the game captures the feeling ot LoTR perfectly and is a lot of fun to play.",
    "timestamp": 1760306400
  },
  {
    "username": "vladdie",
    "rating": 7.5,
    "comment": "A long game with very nice components. The rules are rather difficult if you play it occasionally.",
    "timestamp": 1759615200
  },
  {
    "username": "Profecia91",
    "rating": 7.8,
    "comment": "A very thematic war game, the theme is very well implemented, the gameplay is very strategic and as a lot of tension, the mechanisms in the game are well done, the combats system is good and fast, I don't like the quantity of small rules, the quality of the components and the huge amout of reading.\nIn this 2nd edition there are upgrades in the rules and the componnents, but my pro's and con's continue to be the same.",
    "timestamp": 1759615200
  },
  {
    "username": "bhudson1972",
    "rating": 8.0,
    "comment": "This game delivered on my expectations. It is very thematic. The miniatures are distinct. The cards reference the many details from the books. Plenty of ways to deluxify the game even more if one desires. The winning options available to both sides are different and challenging. The only reason I don't rank this higher is that it still relies heavily on dice rolling.",
    "timestamp": 1759442400
  },
  {
    "username": "peterlevi",
    "rating": 8.0,
    "comment": "2\n(open)\n\nSetup is a total pain. But it's thematic, and usually there's a good buildup during the game until both players are close to winning. We've had games end on a final draw, where either player could have won depending on which tile was drawn.\n\nRules are complex, but tie well with the theme and make enough sense, that actually once you understand them and start playing, it's not hard to follow them correctly, there aren't that many exceptions.\n\nBut with the complex setup, hundreds of pieces, and fiddly rules that require some refreshing every time we open the game, and the fact it's a table hog that we may have to play over several consecutive evenings (so we play it on the floor), the result is we play it only 1-2 times per year.",
    "timestamp": 1758060000
  },
  {
    "username": "Mintyfreshtaste",
    "rating": 8.0,
    "comment": "Haven't done much more than scratch the surface of the game, but what I've seen has been enticing. Wonderful interplay of systems, constant difficult decisions and tight moves, genuine intensity and emotion to most every turn. Hope to get a good few more plays in.",
    "timestamp": 1757023200
  },
  {
    "username": "bdeink",
    "rating": 8.0,
    "comment": "Incl. custom coloured dice and boardgamerbynight's excellent army banner standees from Etsy.\n\nWar of the Ring is a great homage to Tolkien's world of orcs and dwarves and elves and men. The game is both thematic and tense, and functions wonderfully as a story generating cardboard machine. This is a game of large lumbering armies slowly traversing Middle Earth, a game of sieges and of heroic death against the forces of Darkness which are pouring out of Mordor. At times it can feel both slow and obtuse, but the experience is always memorable, and always enjoyable.\n\nThe experience is greatly heightened by familiarity with the Lord of the Rings source material, which is captured impressively well in the game.",
    "timestamp": 1756418400
  },
  {
    "username": "duanewulf",
    "rating": 8.1,
    "comment": "Expansions owned:\nWar of the Ring: Warriors of Middle-earth",
    "timestamp": 1755554400
  },
  {
    "username": "zepphit",
    "rating": 8.3,
    "comment": "Jan 2025 9.25 -> 8.75\nAug 2025 8.75 -> 8.25",
    "timestamp": 1754863200
  },
  {
    "username": "GeminiWeb",
    "rating": 7.8,
    "comment": "1st edition + 2nd edition upgrade kit",
    "timestamp": 1754863200
  },
  {
    "username": "kaiax33",
    "rating": 8.0,
    "comment": "w/ Treebeard expansion and War of the Ring: Colored Plastic Rings - Core Set",
    "timestamp": 1754776800
  },
  {
    "username": "DrAdam_Bricker",
    "rating": 8.0,
    "comment": "No aporto nada nuevo si digo que el reglamento es horroroso.\nEl juego es inmersivo 100%.\nLa tensión se mantiene todo el tiempo.\nLas cartas de evento hacen fidelizar la historia y ayudan a hacer giros a la partida.",
    "timestamp": 1754776800
  },
  {
    "username": "Strewth78",
    "rating": 9.2,
    "comment": "4.1",
    "timestamp": 1762589400
  },
  {
    "username": "BlueEyesLX",
    "rating": 9.0,
    "comment": "Sleeved with Docsmagic Clear Premium Sleeves\nInsert by E-Raptor",
    "timestamp": 1762210800
  },
  {
    "username": "Sly_Quick",
    "rating": 9.2,
    "comment": "+ Lords of Middle Earth Expansion\n+ Warriors of Middle Earth Expansion\n+ Kings of Middle Earth Expansion\n+ Promos - Treebeard, Tidings Not Burdens & The Seeing Stones,\n\n(Folded Space Insert)",
    "timestamp": 1761951600
  },
  {
    "username": "Dusty27",
    "rating": 9.1,
    "comment": "I can see why this one is so highly rated! It was a blast. Got the first two expansions and insert. Wish the rules held in my head a little more firmly. I wish the expansions didn't hog so much table room. Would love to buy a streamlined third edition.",
    "timestamp": 1761778800
  },
  {
    "username": "Scifi66",
    "rating": 9.0,
    "comment": "Status:Shelf\nThe GAME for LoTR fans! Retell the Lord of the Rings story in an epic, sprawling conflict.\n+ Epic narrative\n+ Well balanced\n+ LoTR in a box\n+ Good depth\n- Considerable setup time\n- Table hog\n- Rulebook isn't the best, wargamers will find it vague in parts and Eurgamers might struggle without a teacher\n->Includes Lords of Middle Earth expansion",
    "timestamp": 1761778800
  },
  {
    "username": "Evertore",
    "rating": 9.0,
    "comment": "sleeved tbp",
    "timestamp": 1761519600
  },
  {
    "username": "alcofa",
    "rating": 9.0,
    "comment": "Para mim este é o melhor jogo já publicado em termos de adaptação, ambientação e imersão. A partida é uma verdadeira imersão no universo dos livros e sonho com o dia em que eles lancem algo para o Silmarillion (assim como fizeram com o Hobitt - Batalha dos 5 Exércitos).\n\nO jogo tem mecânicas até simples, porém são dezenas de detalhes, fases e para quem nunca jogou, recomendo fortemente a leitura do manual duas vezes, assistir reviews, gameplays e explicação de regras, além de ter ajuda aos jogadores a mão o tempo todo.\n\nUm jogo que todo fã de Senhor dos Anéis merece e precisa ter na coleção. Se não tiver, merece pelo menos passar pela experiência de jogar ele.\n\n+ Guerra do Anel (Segunda Edição): Senhores da Terra-média (eng)\n+ Guerra do Anel: Guerreiros da Terra-Média (eng)\n+ Barbavore Promo (pt)\n+ Reis da Terra Média (eng)\n\nFor me, this is the best game ever published in terms of adaptation, atmosphere, and immersion. Playing it truly feels like stepping into the world of the books, and I dream of the day they release something for The Silmarillion (just like they did with The Hobbit – The Battle of the Five Armies).\n\nThe game’s mechanics are actually quite simple, but it’s full of details and stages. For those who have never played it before, I strongly recommend reading the rulebook twice, watching reviews, gameplay videos, and rules explanations, as well as keeping player aids handy throughout the game.\n\nThis is a game every Lord of the Rings fan deserves and needs to have in their collection. And if not, they should at least experience playing it once.\n\n+ War of the Ring (Second Edition): Lords of Middle-earth\n+ War of the Ring: Warriors of Middle-earth\n+ Beardtree Promo\n+ War of the Ring: Kings of Middle-earth",
    "timestamp": 1761256800
  },
  {
    "username": "davidric",
    "rating": 9.0,
    "comment": "One of the best War games ever based on one of the best stories ever written.... I only play 2 players, but it is always a blast!",
    "timestamp": 1761256800
  },
  {
    "username": "yodadood",
    "rating": 8.9,
    "comment": "Expansions & Upgrades:\n- Lords of Middle-earth\n- 3D Mountains and Mt. Doom\n- Colored Faction Bases",
    "timestamp": 1760911200
  },
  {
    "username": "picklethehutt",
    "rating": 9.0,
    "comment": "Anniversary edition with painted strongholds, Mt Doom, and Mountains.",
    "timestamp": 1760824800
  },
  {
    "username": "Warlock_bylandt",
    "rating": 9.0,
    "comment": "+ Kings of Middle Earth",
    "timestamp": 1759442400
  },
  {
    "username": "ooLANZELOToo",
    "rating": 9.0,
    "comment": "go for the collector editon, it's worth it, believe me.",
    "timestamp": 1759183200
  },
  {
    "username": "CKaefe",
    "rating": 8.8,
    "comment": "For the longest time, I avoided playing LOTR games due to sheer saturation. The overwhelming presence of Tolkien’s works, looming over every piece of media I encountered, felt like the Eye of Sauron—constant and inescapable. And frankly, it exhausted me.\n\nBut then came the day I decided to open myself up to the possibility of playing this beloved game, and now I regret not surrendering to Tolkien’s “corruption” sooner. War of the Ring is a stellar fusion of cinematic action and long-term strategy. Though the dice still refuse to do my bid, it’s the cards that truly shine in this dudes-on-a-map experience. Their dual-purpose design—both in and out of combat—forces tough decisions at every path of the road.\n\nThe journey is long, but that’s precisely what makes it so fitting to the theme. It demands time and careful thought, which only enhances the immersion. Looking back, I realize that another reason I hesitated to dive in was the artwork. Initially, it didn't impress me, but over time, it grew on me.\n\nWar of the Ring is an outstanding game, fully deserving of all its acclaim.",
    "timestamp": 1758751200
  },
  {
    "username": "Guthwine3",
    "rating": 8.7,
    "comment": "After literally years of watching (and re-watching) reviews and debating over whether or not to take the plunge with this game, I finally received it during the holiday season 2020 and could not wait to get it to the table.\n\nSpent (literally) a couple of months (all of June and most of July of 2021) trying to get my head around the rulebook and watching (and rewatching) the excellent Ricky Royal play-throughs.\n\nAs a longtime Tolkien and Lord of the Rings fan, I had really high hopes for this one. After loads of careful and patient research into the pros and cons of WOTR, I'm cautiously optimistic that I'm going to really enjoy the game.\n\nUPDATE: July 26, 2021. Began our first game at around 230pm and at 10pm stopped to resume the game tomorrow. I have to say, it's pretty amazing. There is very little that I don't like about it. Hasn't felt long at all - the back-and-forth has been very thematic and extremely entertaining. My son really likes the game (he's a fan of asymmetric games where players have plenty of time to build up his/her armies/engines before final execution). Also, it didn't hurt the experience that we played the complete and unedited TWO TOWERS soundtrack/score whilst playing! The game really does capture the drama, excitement, tension and essence of the book.\n\nI'm sure the game won't take nearly as long next time (we're learning and are not playing as economically nor as efficiently as we should be, and of course are looking a lot of things up so as to avoid developing bad habits). UPDATE: Yep - our third play came in under 2 hours. Phenomenal game.",
    "timestamp": 1758578400
  },
  {
    "username": "SnickNamed",
    "rating": 10.0,
    "comment": "Been privileged enough to play it over a dozen times and have enjoyed it each time.\nHeavy weight learn but incredibly thematic.",
    "timestamp": 1762613040
  },
  {
    "username": "StevenNYC",
    "rating": 9.6,
    "comment": "Pros: Some of the best area control pvp board game rules of all time with excellent siege mechanics. Perfect map from a Lord of the Rings fan point of view and organically perfect map for area control pvp. Truly an epic experience from start to finish.\n\nCons: Unpainted minis can be hard to discern between others. Boardstate always starts the same (which can be a pro for some). Setup time is a beast even for people who enjoy table presence. Regions of the map quickly get overcrowded by minis.",
    "timestamp": 1762611300
  },
  {
    "username": "Vormwald1",
    "rating": 10.0,
    "comment": "Beginning to doubt that I will ever get this to the table.\n\nEdit: This game is awesome. I love the combination of the mechanics and the cards. Very thematic to play.",
    "timestamp": 1762470000
  },
  {
    "username": "jennazaid7",
    "rating": 10.0,
    "comment": "+ expansions",
    "timestamp": 1762210800
  },
  {
    "username": "93rdBen",
    "rating": 10.0,
    "comment": "The best game that I never get to play.",
    "timestamp": 1762038000
  },
  {
    "username": "Imsevimse",
    "rating": 10.0,
    "comment": "Epitome of thematic design and asymmetry. The action-dice system superbly captures the struggle between the Free Peoples and the Shadow Forces—especially Sauron’s obsession with the One Ring. Two stories unfold in parallel: the war and the journey of the Ring. Both constantly demand attention, through the dice and on the board, creating a wealth of intriguing choices.",
    "timestamp": 1761951600
  },
  {
    "username": "chateauzou",
    "rating": 10.0,
    "comment": "The Lord of the Rings ultimate tabletop experience.",
    "timestamp": 1761951600
  },
  {
    "username": "JohnGotti",
    "rating": 10.0,
    "comment": "● Ares Games 2014 Catalog.\n● Ares Games Original Plastic Insert.",
    "timestamp": 1761865200
  },
  {
    "username": "Francaher",
    "rating": 10.0,
    "comment": "",
    "timestamp": 1761865200
  },
  {
    "username": "juanmanuca",
    "rating": 9.6,
    "comment": "VENDIDO 49",
    "timestamp": 1761692400
  },
  {
    "username": "callidusx3",
    "rating": 10.0,
    "comment": "Selling/Trading only Card Upgrade tin (to 2nd ed.)\n\nOwn 2nd Ed., Lords of ME & Warriors of ME Collector's Ed.",
    "timestamp": 1761429600
  },
  {
    "username": "t_ovatum",
    "rating": 9.5,
    "comment": "7/20:  9 \n\n\nUPDATE 10/20:\n\nyeah, this game is a 10 for me. it's just so much fun. i personally love the Lord of the Rings books so this is such an easy sell for me. it's just so very evocative. design is more important in my book than theme and this delivers very well there as well. it plays like a wargame where ahistorical outcomes are possible (acanonical would be the word here, i suppose?). quite a bit of randomness but i don't really mind since there are lots of ways to meaningfully interact with those mechanisms. just an undeniable game.\n\none complaint i have at this point is the amount of models. it's a bit stupid. my solution was to paint the ones that matter: the companions, the minions, and the Nazgûl. i also got models for the strongholds and mountains which is a HUGE improvement thematically. all other models were replaced with various wooden components. check the picture for how it all looks.\n\nanother corner case complaint is that the game can be sunk by a run of bad luck but this has been a relatively rare occurrence from what i've seen. (but it has happened and it's pretty frustrating)\n\nFIRST IMPRESSION 7/20:\n\n\n“I wish it need not have happened in my time,” said Frodo.\n\n\n\n“So do I,” said Gandalf, “and so do all who live to see such times. But that is not for them to decide. All we have to decide is what to do with the Action Dice that are given us.”\n\n\nhigh randomness input between action dice and card draws pen you into interesting decision spaces. it's fascinating and absolutely white knuckle the entire time.\n\nmassively thematic moments where that ONE ARMY holds out in Minas Tirith just long enough for the ringbearers to 360 windmill slam dunk a mean boy's jewelry into a fiery hole in a big, dumb mountain. (BOOMSHAKALAKA!)\n\nif you have any interest, no matter how small, in Lord of the Rings, you owe it to yourself to play this. if you don't, this just might make you interested.\n\np: 2 - 4; 2",
    "timestamp": 1761170400
  },
  {
    "username": "SkyeHalon",
    "rating": 10.0,
    "comment": "Paint Minis\nBaggie ID",
    "timestamp": 1761084000
  },
  {
    "username": "Cristi07",
    "rating": 10.0,
    "comment": "THE BEST",
    "timestamp": 1760997600
  }
]