[
  {
    "username": "Freshcactus",
    "rating": 1.0,
    "comment": "2-3",
    "timestamp": 1747087200
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "Noticing some patterns here with Agricola. You've got responsibilities, gotta feed those people! But they're the most dull responsibilities ever. This one also provided tons of ways to convert one resource into another, turning eurogames into really dull and limited computer games.\n\nI guess that's it. There's a few neat ideas like building out the town, but that mostly comes down to controlling a building so you can kick someone else out when you need to, so the execution stinks.",
    "timestamp": 1730502000
  },
  {
    "username": "Emperor_Andy",
    "rating": 1.0,
    "comment": "I literally made my BGG account to rate this game.\n\nIt lasts way too long because you have to think 3 steps ahead and it’s ok when you’re doing that in chess with just 2 people. The problem is when 4 people are trying to think 3 steps ahead of each other you start the game at 9pm and go to bed at 1am. It gets to the point where I’m just doing things randomly because I just want to speed the game up. This game is prone to people with analysis paralysis!",
    "timestamp": 1688940000
  },
  {
    "username": "FutureSpec",
    "rating": 1.0,
    "comment": "fish",
    "timestamp": 1672268400
  },
  {
    "username": "andrebr",
    "rating": 1.0,
    "comment": "-WEG\n30–150 Min 1–5 Players p1 p2 p3 p4 p5 Weight: 3.74 / 5",
    "timestamp": 1632002400
  },
  {
    "username": "l111",
    "rating": 1.0,
    "comment": "MASTER CLOSET",
    "timestamp": 1613602800
  },
  {
    "username": "W33k5",
    "rating": 1.0,
    "comment": "This game actively punishes you for playing it. There's an infinite death spiral you can get caught in that there is no pulling out of.",
    "timestamp": 1613602800
  },
  {
    "username": "UnknownSoldier",
    "rating": 1.0,
    "comment": "I have waited as long as I could to post a rating on this game, but after a dozen plays I feel it is time. I wanted to love this game. It is a game I should like based on other games I enjoy. However, it is just not good. It should be good, but it doesn't deliver. Every game I played ended with me feeling unsatisfied (win or loss). It just all feels pointless. I have played all games with 3 players. By round 13/14, the game feels like it should end but there are still more rounds (18 total). I am surprised this game is ranked as high as it is (and was once as high as 7 on BBG (maybe even higher?)). I feel people ranked this game high because it should be a great game based on all of the decisions and possible options you have on every turn. Instead of exciting, each turn feels like a chore and is exhausting. I think I will take a break from this game and come back to it at a later point as I am surprised it has not delivered and I still want it to (and think it can).\n\nEdit - Played it more. Everyone is duped into believing complexing = greatness. No, that is not true. Especially here.",
    "timestamp": 1588111200
  },
  {
    "username": "Frozen Flesh",
    "rating": 1.0,
    "comment": "I came here, because of all the people rating mature themed games like KD:M or Hate with a 1, just because of their mature theme.\nThis games theme is boring!",
    "timestamp": 1547074800
  },
  {
    "username": "Clwe",
    "rating": 1.0,
    "comment": "Well, now I see where all those cowardly french jokes come from. This utterly lifeless, souless POS has less conflict than a bunch of baby chicks...and is signficiantly less entertaining. too.\n\nInteraction is not normally something I get hung up on, but it really is almost non-existant here - you can't even reasonably deny people from resources like in similar games, for f**k sake. Everyone continually loops round a straight 'track' with different resources on each spot, and only the player whose turn it currently is can decide to take the resources there or not. The closest you'll get to interaction is buying a good building first, or blocking others from using a building while you're in it (looks like they couldn't completely eliminate conflict, ha)\n\nIn addition, the game is absoloutely painful if anyone suffers from AP. Mind you, even if everyone takes their turns fairly quick, it still goes on for far too long. Lame ducks are potentially forced to sit through an excruciating 1 to 2 hours for the end to finally come. F**k you for wasting my time, Le Havre, and take your so-called 'theme' with you.",
    "timestamp": 1540767600
  },
  {
    "username": "danamark",
    "rating": 1.0,
    "comment": "Same crap, collect things, upgrade those things, feed some workers, harvest, repeat. This thing isn't exciting, it's boring. How many of these things can this guy crank out?\n\nIs this man capability of anything else?\nPick a theme buy one game, you got all you need.\n\nThe other cash cow, pull out a small mechanism, slap 2 players on the box, phone it in.\n\nThere are reviewer who go into rants, major ones, when they see repeated themes, Egyptian, Mediterranean trading, but have no problems with basically the same core mechanism with only the player count changed and a different theme glued on.\n\nWhat's up with that?",
    "timestamp": 1461016800
  },
  {
    "username": "BlueSapphire",
    "rating": 1.0,
    "comment": "Too long, even with the quick rules.",
    "timestamp": 1439848800
  },
  {
    "username": "matthiske",
    "rating": 1.0,
    "comment": "Far Too Long For Me For What It Is! Ship after ship after ship. This would be a little better if they cut the duration by a couple hours and half the ship deck.",
    "timestamp": 1269298800
  },
  {
    "username": "alunos",
    "rating": 1.0,
    "comment": "Agricola rules.. but this one.. so many open action and boring theme...",
    "timestamp": 1255471200
  },
  {
    "username": "amatyarakshasa",
    "rating": 1.0,
    "comment": "Le havre is like Agricola, except without the good parts and the bad parts made worse. The game is not as tight as agricola. It requires a huge investment in terms of getting familiarized with the cards and card combinations. The game is wayyy slower than Agricola because you have only one worker. The markets are horrendously incomplete, imagine playing settlers of catan except without the inter player trade, so if you wanted an ore you pretty much have to wait till you mine one or exchange four for one. There isn't any reason at all for me to play Le Havre when I can play Agricola. Le Havre is just an exceedingly poor immitation of the original Agricola.",
    "timestamp": 1245621600
  },
  {
    "username": "dtmoney75",
    "rating": 2.0,
    "comment": "1 Play\n\nPlayed at: 4",
    "timestamp": 1729548000
  },
  {
    "username": "sidetrackgames",
    "rating": 2.0,
    "comment": "Painfully boring with some analysis paralysis.",
    "timestamp": 1705618800
  },
  {
    "username": "brownsound",
    "rating": 2.0,
    "comment": "Le havre jest po prostu popsute. Nikt nie namówi mnie już na Rosenberga. Za żadne skarby.",
    "timestamp": 1690063200
  },
  {
    "username": "Bumbusia",
    "rating": 2.0,
    "comment": "d***, zepsute, kręcenie się w kółko. Do połowy partii było spoko, potem nie",
    "timestamp": 1690063200
  },
  {
    "username": "themagicbeatle",
    "rating": 2.0,
    "comment": "1 of only 3 games I've quit midway through playing as it was so boring. There are no real decisions to be made.",
    "timestamp": 1678748400
  },
  {
    "username": "NormandyWept",
    "rating": 2.0,
    "comment": "I am usually a fan of Uwe Rosenberg's designs, including the on-the-surface-similar Ora et Labora, but I could not get in to this at all when I owned it, despite trying multiple times. It didn't just \"not click\" with me every time I played it, it seemed to barely be a game at all. I just don't understand it.",
    "timestamp": 1626645600
  },
  {
    "username": "kanz",
    "rating": 2.0,
    "comment": "IOS",
    "timestamp": 1604530800
  },
  {
    "username": "Gaap",
    "rating": 2.0,
    "comment": "Boring. Constantly moving around chits to manage menial accounting tasks. I like heavy games. This game, however, feels like I'm managing a spread sheet. It has no flair, and no mystery. The rule book was poor. It lasts far too long given the very limited set of moves you have available to you. Playing feels like you are just going through the motions. Agricola and Caverna blow this game out of the water.",
    "timestamp": 1559426400
  },
  {
    "username": "itsmarty",
    "rating": 2.0,
    "comment": "Feels very hollow to me, probably because you're racing for a final score the whole time and not doing anything you can take pride in along the way. At the end you just have a score, rather than territory, railroad tracks, a farm, etc.",
    "timestamp": 1544742000
  },
  {
    "username": "neuroblaster500",
    "rating": 2.0,
    "comment": "Filter resources for other resources.... boring.",
    "timestamp": 1522274400
  },
  {
    "username": "Legomancer",
    "rating": 2.0,
    "comment": "A game from the Agricola school of, \"If you want to pick your nose, start producing boogers 25 turns in advance and hope that the index finger is available when you're done\" design, which I find tedious. Rated slightly higher than that one because at least I feel like I'm accomplishing *something* instead of just grinding away for 200 turns just to get a pig.",
    "timestamp": 1520290800
  },
  {
    "username": "BajaBlaster",
    "rating": 2.0,
    "comment": "I understand how the game works. Just too fiddly and takes too long.",
    "timestamp": 1499378400
  },
  {
    "username": "Zerosum",
    "rating": 2.0,
    "comment": "Needs U-boat pens.",
    "timestamp": 1493157600
  },
  {
    "username": "AleS1o",
    "rating": 2.0,
    "comment": "Boooooooring. I wish I never spent time learing how to play it and worse, playing it.\nOr maybe I´m to dumb for this game...",
    "timestamp": 1492639200
  },
  {
    "username": "TwinkleVT",
    "rating": 2.0,
    "comment": "Lordy, this was a painful experience. Way, way too complicated and in no way fun. I love board games, but if the directions are 12 pages long... I can't understand all the good reviews and awards, but I can see where this type of \"game\" might appeal to certain folks. My friend I made a determined effort but eventually gave up. Wish he hadn't spent so much for it!!",
    "timestamp": 1463349600
  },
  {
    "username": "Lusorculus",
    "rating": 3.0,
    "comment": "Would I buy it now: No\n\nPlays too long for me to be always in the mood for, hence the rating. Other than that, I found enjoyable and the length has a quality of its own too.\n\nMy favourite part about Le Havre is the ship track and how resources respawn.\nResource management part was a little too computational for me with a lot of a little tricky recipes to compare for maximum efficiency.\n\nOverall I enjoyed it but less so than I anticipated. I think I just find engine builders with a little simpler cards more. That said, I have not found an engine building or resource management game that perfectly suited my taste.\n\nRecommend to try before you buy.",
    "timestamp": 1742166000
  },
  {
    "username": "Joel_L",
    "rating": 3.0,
    "comment": "Long and dull resource-collection and excessive building construction.",
    "timestamp": 1741474800
  },
  {
    "username": "tectactoe",
    "rating": 3.0,
    "comment": "Have only played digitally and have really enjoyed those plays but feel like this could benefit greatly from being played physically, in person, with real people. A deceptively tight 'engine builder' that almost always ends just as soon as you're ready to finally run that engine",
    "timestamp": 1733785200
  },
  {
    "username": "Dunkelzahn2061",
    "rating": 3.0,
    "comment": "Very long, and not worth it. Eventually someone will start winning and you'll see him or her win all the way because there's absolutely nothing you can do to turn the tables. Even if you win, you'll feel bored. This game was hyped because it was made by the man who created Agricola, but Le Havre is not nearly as good as Agricola.",
    "timestamp": 1731625200
  },
  {
    "username": "ncjeff",
    "rating": 3.0,
    "comment": "Played this when I was starting to get into gaming beyond the social games and really enjoyed it. Looked forward to playing it again, which didn't happen for an extended period. Fast forward a couple of years and it has not held up well. There are so many other games that I would play before playing this I suspect it will not come back to the table again for years, if ever.\n\nFeeding your people is a trap. In the early stages of the game if you work to feed your people that will quickly become all that you do each round. You'll end up way behind and will pretty much be out of the game. Take loans instead. By the time the game progresses where loans would be more painful there should be ships and buildings that would mitigate the impact.\n\nThis isn't a worker placement game, nor is it an engine builder. It's more of a puzzle, You're trying to figure out how to use the goods and buildings to assemble a collection of goods that will allow you to make a sprint in the last maybe half-dozen turns to score a majority of your points. Like any puzzle, this leads to long stretches of staring at the table trying to plan out a sequence of turns to get to an end goal. And this will drive you crazy as the game slows to a crawl as you get further in.\n\nThis game has a known number of turns. For 3 players its 129 and 144 for 4. Allow a minute and a half per turn and the game will run 3 1/4 for 3 and 3 1/2 (ish) for 4. At that duration it feels like it has overstayed its welcome. If you don't nudge folks to control AP this game will drag.",
    "timestamp": 1730502000
  },
  {
    "username": "miguelfranciscof",
    "rating": 3.0,
    "comment": "Boring, slow and takes too long.\n\nDisliked the one action per turn and the setup randomness of the tokens to get the resources.\n\nSuffers from the \"runaway leader\" problem and you are forced to play the rest of the (long long) game even though you know it is hopeless.",
    "timestamp": 1720735200
  },
  {
    "username": "quietcorn",
    "rating": 3.0,
    "comment": "the game is perfectly fine. It's mostly turning resources into other resources like we've now seen in many games. The graphic design is somewhat poor in that the central board has a lot of wasted space and the colors are garish. The troublesome part is that the game's big draw for me is that players can buy these building cards, which add worker placement spots, but give the owner of the building some benefit when it's used. This is a mechanism I enjoy, and am drawn to in many other games, but in Le Havre it seems especially hard to tell what the buildings do from across the table.\n\nThere's also a strange design decision where each player gets an uneven number of turns each round. By the end of the game it all works out to even turns, but when preparing for a feeding phase, you sometimes have enough actions and sometimes you don't. It just feels uncomfortable.\n\nI would play this again in theory, if someone felt strongly that they wanted to play it, but I don't think I need to own it.",
    "timestamp": 1718920800
  },
  {
    "username": "Suncubed",
    "rating": 3.0,
    "comment": "Played twice on 2023, little action with non-impressive mechanism, bitter experience and long downtime. I don't think it's a good game in current era. Disappointed.",
    "timestamp": 1714428000
  },
  {
    "username": "weidox",
    "rating": 3.0,
    "comment": "Game tries to be as good as Agricola (which I really like except it's hard to hold nerves because of tension) or Caylus (which I accept as an average game as it's dry, boring but has great ideas and mechanics). But, Le Havre fails seriously to be good. Most of the game is just managing a pool of many types of duplicated resources. Plus, 1 worker \"placement\" to ~20 buildings.",
    "timestamp": 1695160800
  },
  {
    "username": "kareds",
    "rating": 3.0,
    "comment": "Disappointed by this. Maybe big Uwe games are just not for me, but I found this over long and incredibly incremental. I was ready for it to be over at the halfway point.",
    "timestamp": 1693519200
  },
  {
    "username": "Danzo",
    "rating": 3.0,
    "comment": "Another ugly, joyless resource conversion game from the master of ugly, joyless resource conversion games.",
    "timestamp": 1672959600
  },
  {
    "username": "Mattias",
    "rating": 3.0,
    "comment": "Very nice worker placement game which plays a little quicker than Agricola. The theme is however also a bit thinner. A bit too abstract for my tastes.\n\nGave away to a friend.",
    "timestamp": 1669935600
  },
  {
    "username": "Varunwe",
    "rating": 3.0,
    "comment": "Theme doesn't interest me.",
    "timestamp": 1664748000
  },
  {
    "username": "alandric",
    "rating": 3.0,
    "comment": "snoozefest",
    "timestamp": 1660687200
  },
  {
    "username": "JustinRRizzo",
    "rating": 3.0,
    "comment": "I'll stick to Labora, Glass Road and Odin.",
    "timestamp": 1647990000
  },
  {
    "username": "FranzK",
    "rating": 4.0,
    "comment": "I enjoyed trying this but it’s one more game that affirms that Uwe just isn’t my style. It is way too focused on feeding for my taste, and ultimately just feels like another banal resource trading game. It is very well designed, just not for me. Too many other games to play.",
    "timestamp": 1758405600
  },
  {
    "username": "dakotamassie",
    "rating": 4.0,
    "comment": "I really hate constantly putting resource tiles on the board every single turn\nEspecially in the last five rounds where it dosen't matter because nobody needs them\nThe game is also way too long\nBut it was fun despite all these issues",
    "timestamp": 1752962400
  },
  {
    "username": "Mushmo",
    "rating": 4.0,
    "comment": "Man this game is punishing. After the first play through I have to say this game is rough. I think we understood how the game wants you to play by the end, but if you misplay the first round, you will be scraping back only to break even. It felt like we had missed some rule that gives us money or a way to earn money/food. The stock only stocks 2 resources a turn. Barely enough to keep up with the later rounds requiring 18-25 food. It's insane how little we were able to generate an income. Need to play it again and like other games with loans (London) I would choose to go into debt sooner. For now this is a frustrated 4/10.",
    "timestamp": 1749074400
  },
  {
    "username": "MikeBwithoutadot",
    "rating": 4.0,
    "comment": "Heavier on the brain than Agricola, but less fun: to me it's a bit more multiplayer solitaire, since you're more busy working out how to get to all the possible goals than in Agricola.\n\nBut it has some of the same pros as Agricola: Nice buildup of tension through each round, planning stuff and the need to constantly adapt, etc.\n\nSo far I have played Le Havre 6 times in almost 6 years. Agricola got on the table 37 times in those years. Says enough.\n\nStill a nice game, but there are so many better games out there that I wonder why this is rated so high.\nUPDATE dec'20 : traded away after not playing it for 7 years\n\nNL: Pittiger spel dan Agricola van dezelfde maker. Ondanks een aantal vergelijkbare spelprincipes toch een totaal ander spel.",
    "timestamp": 1729807200
  },
  {
    "username": "shoemoney",
    "rating": 4.0,
    "comment": "There is a compelling arc to the game, and the constantly increasing resource spaces create interesting decisions, but I feel as though this one has dated. The seven different base resources, each of which can be upgraded into a higher processed form, lend themselves to a repetitive, grind-ey conversion loop as you build progressively better buildings and/or ships. Ultimately this game has too many mechanisms that I’m not really a fan of. It has the micro-turn, which tends to lack satisfying progression; recipe fulfilment, which can be tedious and fiddly; and the feed-your-people mechanism, which is a bit strategically boring unless there is a twist (as in Lorenzo). Unfortunately, this one wasn’t for me.",
    "timestamp": 1717452000
  },
  {
    "username": "esteves91",
    "rating": 4.0,
    "comment": "SOLD - 05/28/2024 $65\n\nExtras:\nLe Havre: GeekUp Bit Set\n\nEdition:\nComplete Edition",
    "timestamp": 1716847200
  },
  {
    "username": "sbsimp1",
    "rating": 4.0,
    "comment": "Column O",
    "timestamp": 1716760800
  },
  {
    "username": "familygaming",
    "rating": 4.0,
    "comment": "Update December 2023: I have just lost interest in this older style of more pure resource manipulation. Newer euros and making resource conversion a better puzzle integrated with more mechanisms. This is a bit too pure. From 8 to 4. See older comments for what I liked about this.\n\n\nPre-2019: Swap this for that, then build, buy, and ship! Excellent design with good variability. I own this and plan to keep it for years.\n\nMy rating history: 8|6.|8......|10|8....\n\nPlayed 19 times with 1-3 players.\n1p: 4\n2p: 6\n3p: 6\n\n\n\n2011: My first two plays left me a little dizzy and unsure of myself.\n\nPlays #3-15: \nMay 2014: Having re-discovered the joy of playing Agricola, I've been looking into Rosenberg's other games, and been wondering if I'd like Ora & Labora. My main concern is the main mechanic: resource conversion. So I played Le Havre again to see if my opinion of the mechanic has improved. Well...it hasn't. Yet. But I have a feeling it will. I think the key with complex conversion games is getting a handle on all the parts. Until you do, you're just dizzy and lost. Just spitballing here, but I see a ceiling of 8 for this, and maybe 9 for Ora et Labora.\n\nPlay #16: \nMid-May 2014: Up to an 8 as I see what the special buildings really add, and start to get a handle on the game. Taught this to three 6th grade students, and they LOVED it. (Short game.) I was shocked as I assumed this was too brainy/mathy. I'm still of the opinion this will stay at an 8 for me, and still feel Ora & Labora is the one I want.\n\nPlays 17-19: \nNOV 2014: Still a lot of fun, and I'm discovering more styles to play the game with. Last one was wood denial and wooden ships, then ignoring food while setting up an Industrial engine with two Special Buildings. Really fun. Kevin is really enjoying this one.\n\nBest solo scores:\n282 using Fish Restaurant for $, then late game Smelter for steel rush\n260 using Football Stadium and Fur Industry\n\nAs a curious sidenote, Le Havre fell out of the top 10 rankings at approximately 10:30am PST on June 1, 2014.",
    "timestamp": 1704063600
  },
  {
    "username": "kamomillatee",
    "rating": 4.0,
    "comment": "I do like some aspects of the game like expanding decision space but I fail to see games playing differently enough. I would have rated this higher years ago but Le Havre clearly shows it's age.\n\nFar too long for what it is. Anno 1800 scratches the exact same itch with like 1/3rd of the playtime of this.\n\nFor some reason Le Havre is rated as medium heavy which it absolutely false. This one is medium light, take it or leave it.",
    "timestamp": 1699225200
  },
  {
    "username": "harnas1207",
    "rating": 3.5,
    "comment": "Hatalmas csalódás, bár nem volt magasan a léc. 2023-ra ez a játék szerintem nagyon elavult. Eleve botrányosan csúnya, és érthetetlenül bugyuta a kialakítása. Uwe amúgy sem a változatosság híve, de itt főleg nem tudott semmi újat nyújtani, max egy kis Caylus koppintást. A játékélmény rendkívül monotom és száraz.",
    "timestamp": 1696197600
  },
  {
    "username": "sdiberar",
    "rating": 4.0,
    "comment": "Fussy and not as wide-open strategically as it looks. Def a mistake to play full game first time. Would try again if it's the three-player short game.",
    "timestamp": 1672959600
  },
  {
    "username": "BallenFam",
    "rating": 4.0,
    "comment": "Played at the dice cup in Nottingham. Too redundant with little reward.",
    "timestamp": 1672614000
  },
  {
    "username": "sashiuma",
    "rating": 3.7,
    "comment": "3.73",
    "timestamp": 1669762800
  },
  {
    "username": "Bergbau",
    "rating": 4.0,
    "comment": "Fiddly and tedious. Takes way too long for what it is.\nGame setup is not quick, either. Lots of preparations needed.\nI guess you should like meatier games, where you build up your economic engine, but this one was not for me.",
    "timestamp": 1644274800
  },
  {
    "username": "mpappy",
    "rating": 4.0,
    "comment": "I own the iOS version, but I will pass on ever wanting to own this as a physical copy. I wanted to really like it, but I find it dull and dry, and the theme is uninteresting. It feels like spreadsheets, working on accouting and taxes. I realize the artwork and components are decent and the concepts/mechanics fine, but the \"fun\" factor is just not there.\n\nI know there's a fair amount of people who like it---just not me.",
    "timestamp": 1643756400
  },
  {
    "username": "btasam",
    "rating": 5.0,
    "comment": "Le Havre continues to leave me in awe of its design simplicity and exponential depth in gameplay, but I wish it to be a bit more refined in terms of execution.\n\nStrategically, I'm obsessed with the tension that Le Havre presents between collecting resources or using building actions. The parallel of generating resource-heavy engines as oppose to financial engines is quite intriguing. There's a rich dynamic of incentives for players invested in the game state when every building is up for grabs. It's a shame that the game can be so polarizing at different player counts because the foundational elements are really good.\n\nAbout two-thirds of the way through, the game progresses into this slog. Many of the necessary cards are always made available even if they arrive at different times. Players have usually honed in on some decent multi-step strategy but everything feels predictable.",
    "timestamp": 1759874400
  },
  {
    "username": "Scifi66",
    "rating": 5.0,
    "comment": "Tight with blocking. Strategic and tactical. Very cool. I'm over Euros but this is pretty good.\n\nOct24->There are other strategies available! Marketplace gives you the headsup on what is coming. This is a good Euro although the graphic design could be better to improve visibility across table.\nAug23-> 2 plays and they felt the same. Would play again as there is some interaction in this. Smooth and simple, it works well.\n+ The game has a terrific arc, at first you are scrapping for 2 wood but by the end are producing steel, shipping leather and eating meat/smoked fish from your stores.\n+ The board being comprised of all the players' buildings is really good, there is blocking\n+ Multiple paths to get points for the end game",
    "timestamp": 1756677600
  },
  {
    "username": "Pamponiros",
    "rating": 5.0,
    "comment": "Not the best game for solo. rating is for that.",
    "timestamp": 1756591200
  },
  {
    "username": "selvalabelva",
    "rating": 5.0,
    "comment": "Brainburn         Longevity    \nLuck impact       Rules/Setup  \nInteraction       Involvement  \n\nAftertaste           Enthusiasm   \n\n Played at 3 player count only\n Rated base game w/o additional modules\n Confrontation: indirect",
    "timestamp": 1751320800
  },
  {
    "username": "CotB",
    "rating": 5.0,
    "comment": "Rankings\n89th Best Game 2019",
    "timestamp": 1751320800
  },
  {
    "username": "libonati",
    "rating": 5.0,
    "comment": "Played at 01/31",
    "timestamp": 1751148000
  },
  {
    "username": "LeBao",
    "rating": 5.0,
    "comment": "not the type of game for me",
    "timestamp": 1740870000
  },
  {
    "username": "Sedd",
    "rating": 4.5,
    "comment": "Kurz: Optisch schön + Thema toll umgesetzt. Gehobenes Kennerniveau, aber ziemlich lang und tendenziell grübellastig. Für mich ist es wie ein harter Arbeitstag am Hafen.\n\nLangform:\nWo fangen wir an? Am besten mit den relativ einfachen Regeln. Heruntergebrochen: Nimm einen Stapel einer Rohstoffart oder aktiviere mit deinem Arbeiter ein gebautes Gebäude.\n\nWas mir sonst noch gefällt:\n-Die Interaktion untereinander: z.B. die Überlegung, ob ich mir jetzt einen Rohstoffhaufen nehme oder ob das noch warten kann. bzw. \"Wann sollte ich welches Gebäude aktivieren?\"\n-Der Grafikstil spricht mich sehr an\n-Optimierspiel, das es ermöglicht von Partie zu Partie besser zu werden\n-Es ist abwechslungsreich, da man verschiedene Strategien austesten kann, jedes mal andere Sondergebäude im Spiel sind und der Startaufbau variiert.\n\nHier bin ich gespaltener Meinung:\n-Strategien zum Sieg: gibt mehrere Möglichkeiten für Punkte, glaube aber manche Wege sind besser. (Ohne zu spoilern.) Das haben auch \"Le Havre\"-Vielspieler durchscheinen lassen.\n-Ernährungsphase: Es ist mechanisch super umgesetzt (auch die steigenden Kosten) und war 2008 etwas herausstechendes. Für mich passt es thematisch nur bedingt und fühlt sich daher eher hinderlich an. (Mir ist bewusst, das Andere gerade diesen Aspekt spannend finden.) Bei bspw. Agricola mag ich es.\n-Baugebäude und Flussplättchen: sorgen für Varianz, können aber auch Glück/Pech bedeuten (je nach Spielerreihenfolge).\n->Denn die Auswahl der ersten Rohstoffe, die man ergattert, sowie der Häuser die man kauft sind schon relevant, wie man am Ende da steht. (Bsp.: Tendentiell bringen Korn und Vieh in der Vermehrungsphase etwas ein, während Fisch einige (und tendenziell mehr) Aktionen brauch. Dazu das Schlachthaus in seinem Eigentum, sorgt wahrsch. für geringes, aber dauerhaftes Einkommen.)\n-Spieleranzahl: Gut das es auch zu 5. spielbar ist. Dementsprechend werden Runden eingekürzt, um die Spieldauer zu minimieren. Empfehlenswert ist es m.M.n. trotzdem nur bis max. 3. Spielenden, da sich die Interaktion nicht viel ändert, dafür die Planbarkeit. Außerdem braucht es Ewig bis man wieder dran ist und benötigt auch insgesamt länger, trotz gekürzter Runden.\n\nWas mir nicht gefällt:\n-großer Punkt ist der Zeitfaktor: Eine Partie zu 3. mit 3-4h ist mir für ein Kennerspiel zu viel. (Dann lieber etwas Episches/\"Goßes\"/\"Richtiges\".)\n-Thema: Auch wenn es gut durch Grafik und Mechanik umgesetzt ist, habe ich wenig Berührungspunkte damit. ( Ja das ist sehr subjektiv, aber auch meine Bewertung ;-) Dadurch besser einschätzbar, wem das Thema zusagt. :-) )\n-Jede Runde wird anstrengender, da die Züge immer länger werden, weil mehr Optionen zur Verfügung stehen.\n> Daher gutgemeinter Tipp: niemals mit Grüblern spielen.\n-kleiner Punkt: In den ersten paar Zügen macht man oft sehr ähnliches. (Überlegung: man hätte mit anderem Startkapital 2-3Runden sparen können (balancing unklar) )\n\nFazit: Für mich ist es eher nichts. Ich würde es dann wieder mitspielen, wenn es jmd. unbedingt gern spielen möchte.",
    "timestamp": 1738191600
  },
  {
    "username": "CorumCoram",
    "rating": 5.0,
    "comment": "For some reason, it just doesn't feel as slick as when it first came out.",
    "timestamp": 1722463200
  },
  {
    "username": "Xstream",
    "rating": 5.0,
    "comment": "Own the app. It's just so dry. I just have a strong aversion towards Uwe Rosenberg games. A big part is the graphic design I think ... because I generally like building things and create an engine, but his games never resonated with me. I just don't get immersed.",
    "timestamp": 1719180000
  },
  {
    "username": "myszywur",
    "rating": 5.0,
    "comment": "I can see why some people loved this game when it first came out, but it has not aged well. Compared to some modern euros it is tedious, strategies are hard to execute due to random, it can be punishing for no reason, theme is weird and board state is not clear to read. While playing it I can`t stop wishing it would be an hour shorter. A classic, but has not stand the test of time for me, nevertheless I`d play it from time to time.",
    "timestamp": 1718056800
  },
  {
    "username": "Mayasty",
    "rating": 5.0,
    "comment": "Since I first played it 14 years back with wow effect and rate 10 it has unfortunately grown up very ugly. There are always 33 same cards in each game (basic buildings) + 6 of 36 varying special buildings cards which makes the game almost unreplayable. This cards pool even shrinks with less players. So, after 2 plays it becomes very repeatable, boring and loooong.\n\nNo matter that Grand Humeau expansion ads new 46 special buildings cards. They are all mixed together with special buildings from the basic game to create the pool of 82 card and always only 6 out of it come into play. So the replayability sucks compared to similar games in this genre like Terraforming Mars or Ark Nova that have around 200 all in play cards each. It looks like the designer was so sticked to the mathematical strict balance that he didn’t dare to give his game a bit of spontaneity and live.\n\nMoreover the game is designed to create couple of technological lines based on the cards that show up in sequence. However these cards are shuffled and randomly set in 3 cascade displays. If by chance they overlap in inconvenient way you'll never be able to launch desired technological line enough early in the game to be able to score on the proper level.\n\nBye, bye forever.",
    "timestamp": 1712613600
  },
  {
    "username": "B_Moores",
    "rating": 5.0,
    "comment": "Agricola meets Puerto Rico; not a bad mix but could do with more player interaction",
    "timestamp": 1706482800
  },
  {
    "username": "JoshuaStarr",
    "rating": 5.0,
    "comment": "A design certainly worth appreciating even though I don't particularly seek out playing it. Rather than have the players build their own engines, the game's engine comes online on its own in a predetermined sequence. The primary value of owning a building is not a passive income but reserving the right to use that building in a critical moment. A very neat game of tempo and blocking.",
    "timestamp": 1700262000
  },
  {
    "username": "Knollusk",
    "rating": 5.0,
    "comment": "Busy Work: The Game\n\nNot a \"bad\" game, just an uninteresting and overlong one. Too many options and too much card overhead to be compelling.",
    "timestamp": 1700175600
  },
  {
    "username": "iplaybgnaked",
    "rating": 5.0,
    "comment": "Very good Uwe game that's light weight enough to teach as an entry level euro. Unfortunately it gets pretty samey on repeated plays as you always pursue the same things to score points in the mid to late game despite the the cards' attempt at shaking up the early game.",
    "timestamp": 1699657200
  },
  {
    "username": "Sir Pent",
    "rating": 5.0,
    "comment": "Pretty fun, but nothing original about the gameplay, and there is almost no theme. It's a bit of a puzzle to figure out how to be most efficient with your actions. I would houserule it so that players take back their marker if they grab an offer so that they don't \"camp\" in other player's buildings.",
    "timestamp": 1691532000
  },
  {
    "username": "TheMightyLo",
    "rating": 5.0,
    "comment": "quit before game was over. no one at table liked it. we were all new so maybe better after a few plays. way too fiddly and hard to ship unless you plan for it a few hours in advance. do not buy",
    "timestamp": 1688162400
  },
  {
    "username": "kendallgrubbs",
    "rating": 5.0,
    "comment": "I like it at two players, but beyond that it gets irritating as tableaus build. The simple mechanics make it a delightful teach and play, but it is too reliant on the resource conversion over what is entirely too long of a game of its type north of two players.",
    "timestamp": 1687471200
  },
  {
    "username": "JSMA",
    "rating": 5.0,
    "comment": "Am besten Solo in der Kurzen Version",
    "timestamp": 1684188000
  },
  {
    "username": "Maglinkinpark",
    "rating": 5.0,
    "comment": "My Least played Uwe. I think the sheer amount of bits in this game, and the piles that build up on the board make it less of a go-to.",
    "timestamp": 1680386400
  },
  {
    "username": "lexen",
    "rating": 4.5,
    "comment": "An OK game. Big decision tree but lots of bookkeeping.\ngames moves slower as the game goes on...",
    "timestamp": 1680127200
  },
  {
    "username": "Gorgoneion",
    "rating": 5.0,
    "comment": "Played in the \"fast\" mode.\n\nAfter the harrowing experience of playing this iron maiden of a game, I felt utterly exhausted.\n\nIn the end you have too many things to do and not enough actions for the half of what you ought to do just to survive. In theory this would make for an enticing experience where you have to make always the BEST move every time you play.\n\nThe fact is, and I discovered this by playing the game, that there is a fine line between games that give you difficult choices, and this one where you're barely able to keep afloat. The former is fun, the latter is stressful and it is a long frustrating experience you are going for.\n\nI don't know you, but I prefer to reserve stress and fatigue to a job, not to a game.\n\nOn the other hand you cannot admire enough this implacable vice that crushes you slowly and inexorably.",
    "timestamp": 1679439600
  },
  {
    "username": "PJWagner",
    "rating": 5.0,
    "comment": "played virtual- meh.",
    "timestamp": 1676242800
  },
  {
    "username": "Ldayjones",
    "rating": 5.0,
    "comment": "It was fun, but even two=player it is just too long.",
    "timestamp": 1675465200
  },
  {
    "username": "kaepone",
    "rating": 5.0,
    "comment": "I do not understand the hype, but I don't care for Agricola or Caverna either. The gameplay is not fun. I don't enjoy struggling to manage food or go in debt because I was one food or coin short, or because I made the decision to pick up some bricks instead of food so in the future I could build a building. Food requirements ratcheting up each round without your workforce being more productive makes no sense. The game is about a harbor but it seems like you don't ship anything until the last turn of the game to be most efficient. Available building cards are mostly fixed to player count with a few special buildings mixed in, but getting to what you want is annoying if it's buried and you have to buy/build others first. Overall not enjoyable and I've nicknamed this Misery Port.",
    "timestamp": 1675465200
  },
  {
    "username": "Gendalm",
    "rating": 5.0,
    "comment": "Preliminary rating after a few plays. It feels like a variant of Agricola but with more freedom on the possible strategy which could be followed to win. Still I think Agricola has the edge, probably due also to its components and theme.",
    "timestamp": 1672614000
  },
  {
    "username": "VKolbe",
    "rating": 5.0,
    "comment": "Probably the worst-looking game I own. Baffling production and art choices all-around.\n\nPlayed about 3 or 4 times so far, and I feel like I need a couple more to really know how I feel, but I'm fairly certain this is my least favorite Uwe Rosenberg game out of the handful that I've played. I know this is considered a classic, but I just don't see myself ever picking this over Caverna, Odin etc.\n\nI'm sure many would call this blasphemy (and I'm open to hearing you out!!) but so far this was a big disappointment.",
    "timestamp": 1669849200
  },
  {
    "username": "tilouboy",
    "rating": 5.0,
    "comment": "Two and 3-player only. Quick turns interesting decisions, lot of possibilities. Best Rosenberg.",
    "timestamp": 1664056800
  },
  {
    "username": "szurla",
    "rating": 5.0,
    "comment": "E3",
    "timestamp": 1663884000
  },
  {
    "username": "Forgeforgeforge",
    "rating": 6.0,
    "comment": "not alot I can say that hasn't already been said.\n\nvery clean design, in most ways, compared to his other games. and I prefer it to nusjford I think. I love the simple turns and immense tension between grabbing resources and using buildings.\nI mostly dislike resource conversion games but I wasn't particularly annoyed by this.\n\ntibbles: \"What I just can't get into, at least on my limited play count, is the buildings. There are a bunch to learn and due to the stacking display it is much more of a pain to try to look up what they do. Also, unlike Caverna where you can often forget about a building once an opponent plays it, remembering what all your opponents have available to use is crucial and that means a lot of awkward, upside down card reading.\"\n\nThe game has a logic that's entirely its own. There's no rhyme or reason to the building entrance costs or limit to the number of conversions they can do. The game reflects nothing about the landscape of reality and you can't bring lessons here to other games or vice versa. If you want to be good at le havre you just study le havre, mostly the cards.\n\n\"There’s a thread about Le Havre that I really like. It’s called “Le Havre is a game about shipping as much steel as possible”. \"",
    "timestamp": 1760392800
  },
  {
    "username": "MissP1ggy",
    "rating": 6.0,
    "comment": "Very good game!",
    "timestamp": 1760220000
  },
  {
    "username": "MartynF",
    "rating": 6.0,
    "comment": "Once upon a time, I loved this game. I still like it. But it is too much about grabbing raw materials at the right time. Also almost all cards are the same for every game. I prefer Agricola.",
    "timestamp": 1759874400
  },
  {
    "username": "logopolys",
    "rating": 6.0,
    "comment": "My record with Uwe Rosenberg has been shaky. I really didn't like Bohnanza or Caverna, but I was okay with Space Beans and Patchwork. But this was thrust onto the table when I was visiting some friends, and who am I to make trouble? This game is incredibly straightforward. It's a worker placement game that doesn't actually require you to place your worker each turn. There are offers of basic goods progressively refilled each turn that you can select one of; alternately, you can move your worker to an empty building to do that action. Buildings can be unowned, in which case the action cost is paid to the bank, or owned by players, in which case the action cost is paid to the owner or deferred if it's your own building. The goods in this game are the star, with all goods being double-side and many buildings allowing you to upgrade the goods to a usually better version, like fish being upgraded to smoked fish or coal being upgraded to coke. There's almost an overabundance of different types of goods, and figuring out how to generate or convert these goods appears to be the principle riddle of the game. There's also the apparently standard Rosenberg mechanic of needing to provide an increasingly larger amount of food each round. This food can be paid with crockpots or cash, and if you lack sufficient amounts of both, you are forced to take loans. The game is fine. I'd probably be willing to play it again. So now Uwe is over .500 for me.",
    "timestamp": 1759356000
  },
  {
    "username": "dotneko",
    "rating": 6.0,
    "comment": "en Málaga",
    "timestamp": 1759183200
  },
  {
    "username": "Zengoeroe",
    "rating": 6.0,
    "comment": "Le Havre has big Eurostyle game written all over it, the basic rules are very easy to understand, (1) collect resources by taking them from one of the available docks in the harbour or converting/trading them in the available projects/buildings that are owned by you, or your opponent or the community or (2) use your resources to build buidings/projects. However you can do additional sales or purchases with the money you have earned or even get rid of your loans. The choices you have to consider get more extensive progressing further in a game AND you have to watch out for what your opponents can possibly do and have in mind a backup action because in Le Havre, available buildings/projects can be blocked ! There is one card that can change this, but you don't know if it's going to be in the game you are playing and neither when it will appear in the game. The game takes really long to play and you are basically an AI doing calculations.\nToday, Le Havre feels more like a math exercise than experiencing fun, so as a player you have to be prepared for this fact and have a really fresh mind going into it.\n\nI've rated this game high a long time ago, 8,5, but it has lost its shine for me. The constant math exercise and also the long playtime kills it for me. Cycling the possible community cards (6 cards from 36) every game should make for a very versatile game every time you play, but, just as Agricola, the amount of hours you have to commit to it just to discover the different options is just insanely high. This is an amazing addition made by the designer and should prevent that there is a clear win strategy and thus breaking the game. Unfortunately, the desire for me to discover this high replayability has faded away because the math exercise is no longer fun.\n\nI have to admit, for a game released in 2009, this game still looks esthetically pleasing.\n\nSo, would I recommend this game?\n\nThis is not for casual or occasional gamers, this is not a family game, it is a pure eurostyle game and I applaud the designer for it. In its genre, objectively, it is truly amazing and that's why my rating was 8.5 back in the day.\nBut when a game becomes too long and too exhausting to play and there is no fun factor besides just calculating for many hours giving it a doing math homework vibe, then I have to be true to my personal feelings when I play this game and the desire to still play Le Havre has sadly gone. I'm giving Le Havre a 6 rating today. By consequence, this could mean that after all these years, Le Havre may even possibly leave my collection. Oh, and don't forget that more players involved means even longer games !!!",
    "timestamp": 1758405600
  },
  {
    "username": "ditterio",
    "rating": 6.0,
    "comment": "I've played this a long long long time ago. It was a very long and unpleasant experience. Maybe I will now appreciate it more. I don't know.",
    "timestamp": 1755208800
  },
  {
    "username": "wooloo1",
    "rating": 6.0,
    "comment": "Mostly played at 2p. From experience, it is possible to take Le Havre along on a bicycle tour. Surprisingly accessible for a 'heavy' euro. A '6' because at 2p, we could never quite get the loan right, so the game either felt too loose or too stressful.",
    "timestamp": 1754517600
  },
  {
    "username": "dreamer1789",
    "rating": 6.0,
    "comment": "I like the building variety and the game flow. I prefer the shortened game. The whole 'feed your people'-mechanic I'm kinda done with.",
    "timestamp": 1753567200
  },
  {
    "username": "dale12",
    "rating": 6.0,
    "comment": "It was just very boring for us. Played two players and at the beginning of round 9 we quit. We are big fans of Caverna and AFFO so we were excited to try this. Didn't feel the them at all. Felt like a large scale cube pusher.",
    "timestamp": 1752789600
  },
  {
    "username": "DarkJjay",
    "rating": 6.0,
    "comment": "It's got an interesting tempo to it, and figuring out the most efficient way to get to the buildings you need is interesting. It still has the annoying \"GOTTA FEED UR PPL\" thing from Agricola, which I genuinely don't like in a game that's already as tight as this, but here we are. Would play again, don't need to own",
    "timestamp": 1747951200
  },
  {
    "username": "Col Hogan",
    "rating": 6.0,
    "comment": "1 - 5 players",
    "timestamp": 1745618400
  },
  {
    "username": "morsi",
    "rating": 6.0,
    "comment": "bought on BGG market",
    "timestamp": 1745532000
  },
  {
    "username": "Avid_Equinox",
    "rating": 6.0,
    "comment": "Resource conversion, worker placement game\n\n+/- plenty of special building tiles but not enough come out to change enough to keep me interested\n\n- low player interaction - just indirect via worker placement and resource accumulation spots\n\n- Agricola exists and makes it harder to hit the food requirements (which adds excitement), is cleaner (rules wise) and has way better variety with the different cards you have access to from turn 1. It's the same but better for me.",
    "timestamp": 1744581600
  },
  {
    "username": "PhanSiPance",
    "rating": 5.5,
    "comment": "It’s like New Bedford but without the whaling, more city building and a lot more resources and a lot less fun.",
    "timestamp": 1743289200
  },
  {
    "username": "Alrami",
    "rating": 6.0,
    "comment": "Greta game for a couple of plays then gets a bit same-ish and now rarely play it",
    "timestamp": 1742511600
  },
  {
    "username": "ekloff",
    "rating": 6.0,
    "comment": "Le Havre is almost exclusively focused on resource conversion, which is quite unusual for a game of this length and weight. On its face that may sound horribly boring, but Le Havre is quite an enthralling design. I'm a big fan of Uwe Rosenberg's early output, and I am very happy to have played Le Havre as its very clear that this game has significant depth. Balancing the demands of the looming harvests while trying to pursue points creates a tension that persists throughout the game. And the variety of buildings that will emerge will have players adapting to different constraints each game. Le Havre is without doubt too long, which conflicts with my desire to dig into this rather unforgiving system, but its a robust design which I would like to revisit.",
    "timestamp": 1737414000
  },
  {
    "username": "Stavros79",
    "rating": 6.3,
    "comment": "Resources the game. Starting to think Uwe isn't for us. I liked the theme and the art had charm. Too long for what it is though and the charm soon faded.",
    "timestamp": 1735858800
  },
  {
    "username": "Javajoesworld",
    "rating": 6.0,
    "comment": "Another classic that did not do much for me. It felt too long and repetitive. I’d play if it was one of the only options but not a game I would seek out or choose if other game options were available.",
    "timestamp": 1735340400
  },
  {
    "username": "raspberrywrath7",
    "rating": 6.0,
    "comment": "Solo high score: 166",
    "timestamp": 1733871600
  },
  {
    "username": "Nickeddy01",
    "rating": 6.0,
    "comment": "A squillion pieces, and lots of detail, and good variance on victory techniques. Game can drag a bit, however; the moment you think it's dragging is simultaneous with the instant that you suddenly realise there are limited turns remaining, and oh my god, how am I going to achieve everything I want to in that time. Game is great, but it's also available as an app, which saves all the setup and set down time.",
    "timestamp": 1732748400
  },
  {
    "username": "marcomagno",
    "rating": 6.0,
    "comment": "The game is good, but I never feel like I want to play it",
    "timestamp": 1732316400
  },
  {
    "username": "Daniel_Enriko",
    "rating": 5.5,
    "comment": "sleeved",
    "timestamp": 1730847600
  },
  {
    "username": "Qhorin",
    "rating": 6.0,
    "comment": "OK Economic Engine game. Disappointing after the huge amount of hype. The long game goes about 30% too long. The short game seems a bit better. Not as \"tight\" as Agricola, where your board seems to come together all at the last minute. Feeding also seems less urgent since you can pay it off with currency.\n\nW/ special buildings 2008 Essen promo",
    "timestamp": 1730847600
  },
  {
    "username": "Geoboffin",
    "rating": 6.0,
    "comment": "Just noticing all the options available towards the end gets too much like hard work.",
    "timestamp": 1729720800
  },
  {
    "username": "missmemuch",
    "rating": 6.0,
    "comment": "Gave to Noble Knight 9-30-24",
    "timestamp": 1727733600
  },
  {
    "username": "Stevemould",
    "rating": 6.0,
    "comment": "Lovely engine building game, with more options than Agricola but less tension.",
    "timestamp": 1726178400
  },
  {
    "username": "Patatasal",
    "rating": 6.0,
    "comment": "相对于它的游戏性来说，时长有点太长了。以及，小token也太多了吧！！！",
    "timestamp": 1724191200
  },
  {
    "username": "keekohmygod",
    "rating": 6.0,
    "comment": "Mayday Euro",
    "timestamp": 1723413600
  },
  {
    "username": "VikingBurger",
    "rating": 6.0,
    "comment": "Engine építés, erőforrás menedzselés, \"etetés\", de legalább poliomino nincs benne.\nNagyon hosszú, de nekem a témája miatt se dobban meg a szívem, az alkalmazott mechanikákban pedig van más, ami sokkal jobban leköt.",
    "timestamp": 1722549600
  },
  {
    "username": "baguio_beans",
    "rating": 7.0,
    "comment": "K",
    "timestamp": 1762657560
  },
  {
    "username": "Nuvium",
    "rating": 7.0,
    "comment": "Good but repetitive",
    "timestamp": 1762297200
  },
  {
    "username": "Derianhorgen",
    "rating": 7.0,
    "comment": "SpielboxRating 8-9, av. 8,50\nThomas",
    "timestamp": 1761865200
  },
  {
    "username": "Kieranslack",
    "rating": 7.0,
    "comment": "Rating based on just one play, but I was pretty impressed by the simplicity of rules and the potential depth here. It's very tight and can be pretty unforgiving, but in my case I had only myself to blame! This isn't really my cup of tea so hard to rate higher, I also felt it went on a little too long, but I'd definitely be up for playing it again sometime.",
    "timestamp": 1761692400
  },
  {
    "username": "blake33",
    "rating": 7.0,
    "comment": "Too long.",
    "timestamp": 1759269600
  },
  {
    "username": "Dozwa2902",
    "rating": 7.0,
    "comment": "digital",
    "timestamp": 1759096800
  },
  {
    "username": "swornabsent",
    "rating": 7.0,
    "comment": "Big Move Cull",
    "timestamp": 1758405600
  },
  {
    "username": "robindavid",
    "rating": 7.0,
    "comment": "Another excellent Rosenberg game. This one is quite different from a lot of his other big box designs, with so many resources and conversion engines all going at one. It runs quite long, so probably best played at 2 or 3 players.",
    "timestamp": 1756850400
  },
  {
    "username": "jakoozzi",
    "rating": 7.4,
    "comment": "One of my first heavy Euro games, always had to brace for it since it goes long.",
    "timestamp": 1756591200
  },
  {
    "username": "Killi",
    "rating": 7.0,
    "comment": "Good Uwe game. I like that it starts easy with not much to do and it slowly develops into more things / combos to do. Which is good, as it doesn't overwhelm you at the beginning like other Uwe games.\n\nRecommend it at 3p most of the times.",
    "timestamp": 1756504800
  },
  {
    "username": "yabluz",
    "rating": 7.0,
    "comment": "avevo l'app su iPad non il gioco in scatola",
    "timestamp": 1754863200
  },
  {
    "username": "GeminiWeb",
    "rating": 6.5,
    "comment": "Provisional rating. May rise with additional plays",
    "timestamp": 1754863200
  },
  {
    "username": "Dion1974",
    "rating": 7.0,
    "comment": "Digital",
    "timestamp": 1753999200
  },
  {
    "username": "Profecia91",
    "rating": 7.0,
    "comment": "I played this once and I didn't grab the major objective of the game and whant to play again very soon",
    "timestamp": 1753912800
  },
  {
    "username": "ueyinnafesh",
    "rating": 7.0,
    "comment": "발전하는 항구와 내 엔진! 게임의 설계는 기가 막히다. 특히 이번 라운드에 내가 몇 턴인지, 식량을 해결하면서 엔진을 키우기 위해 뭘 할지 고민하는 부분이 백미. 상품을 받고 내고 하는 부분이 반복적이라 불편하다.\n고점은 무조건 반드시 기필코 3인 긴게임.",
    "timestamp": 1753308000
  },
  {
    "username": "DeKerstman",
    "rating": 8.0,
    "comment": "Part of Uwe Rosenberg's harvest trilogy. I own and enjoy Agricola (and Caverna), but haven't played The Gates of Loyang yet. Have only played Le Havre once and enjoyed it quite a bit. Would like to play again soon and might buy/trade this one into my collection.",
    "timestamp": 1762297200
  },
  {
    "username": "Lgb-JohnDoe",
    "rating": 8.0,
    "comment": "Signed by the designer.",
    "timestamp": 1762124400
  },
  {
    "username": "funandfunky",
    "rating": 8.0,
    "comment": "Great game - I wish I could win at it someday!",
    "timestamp": 1761951600
  },
  {
    "username": "Imsevimse",
    "rating": 8.0,
    "comment": "A true gamer’s game of timing and opportunity. Tight player interaction and crunchy decisions: take goods or use a building. Simple, yet remarkably intriguing. The balance between ease of play and depth of decisions is outstanding, though it can feel a bit wonky with four players and even intolerable at five.",
    "timestamp": 1761865200
  },
  {
    "username": "Eugeniosaracino",
    "rating": 7.5,
    "comment": "Esp) No es mi preferido de la trilogía de la cosecha de Uwe pero está muy muy bien!",
    "timestamp": 1761778800
  },
  {
    "username": "Jillys",
    "rating": 7.7,
    "comment": "Kanske",
    "timestamp": 1761606000
  },
  {
    "username": "apax",
    "rating": 8.0,
    "comment": "H",
    "timestamp": 1761519600
  },
  {
    "username": "louisj2016",
    "rating": 7.5,
    "comment": "Expert++",
    "timestamp": 1760824800
  },
  {
    "username": "ItsMagic",
    "rating": 8.4,
    "comment": "roleplaying economize specializing unlocking diverse participating peaceful",
    "timestamp": 1760824800
  },
  {
    "username": "igor_f",
    "rating": 8.0,
    "comment": "1-5",
    "timestamp": 1760220000
  },
  {
    "username": "DoctorPhil",
    "rating": 8.0,
    "comment": "Review after 10 plays: https://anchor.fm/board-game-doctors/episodes/Le-Havre-After...\n\nCriteria (out of 5)\nRules complexity 3\nPlaytime/complexity ratio 3\nStrategic avenues 4\nMechanism strength 3\nThematic integration 4\nVariability 5\nReplayability 5\nFun factor 4\nSolo mode 4\nPlayer interaction 5\nElement of mastery 4\n\nOverall 8.0 out of 10",
    "timestamp": 1759960800
  },
  {
    "username": "garykagan",
    "rating": 8.0,
    "comment": "5 player",
    "timestamp": 1759615200
  },
  {
    "username": "Ddyraw",
    "rating": 8.0,
    "comment": "Really great game. Played the app a bunch, but never got to the table, got rid of it.",
    "timestamp": 1759356000
  },
  {
    "username": "gianlucadario87",
    "rating": 8.0,
    "comment": "B_A2",
    "timestamp": 1758924000
  },
  {
    "username": "thetuism",
    "rating": 7.5,
    "comment": "mechanic is clean and easy to learn, soloing can get a bit repetitive as there is no contention for resources and buildings.",
    "timestamp": 1758837600
  },
  {
    "username": "HokieGeek",
    "rating": 8.9,
    "comment": "I primarily play this solo\n\nFinally got around to playing this at a con and really, really liked it. I wish I had bought it all those times I came close to doing so",
    "timestamp": 1762383600
  },
  {
    "username": "SergeBabiychuk",
    "rating": 9.0,
    "comment": "Le Havre - “Kid In a Candy Store” Experience // YT Review (10): https://youtu.be/V9Gi78CTspM\nLe Havre is a fantastic resource conversion game. Even though it is rated as Medium-Heavy, it feels like Medium-Light because it is very streamlined and easy to play. A great introductory game to heavy games. A delight to play as you always have plenty of resources and options.",
    "timestamp": 1761778800
  },
  {
    "username": "muuntautuja",
    "rating": 9.0,
    "comment": "Immediately became one of my favorite Uwe Rosenberg games. Quite different from his other games - the brutal economy and the amount of blocking makes it feel more like a Splotter game.",
    "timestamp": 1761692400
  },
  {
    "username": "07734",
    "rating": 9.0,
    "comment": "Main",
    "timestamp": 1761170400
  },
  {
    "username": "JFed01",
    "rating": 9.0,
    "comment": "1-(3)-5p 30-150m. Want to play 3p game.",
    "timestamp": 1760911200
  },
  {
    "username": "Higgs4047",
    "rating": 9.0,
    "comment": "Great game, a little intimidating to start with but the learning curve is gentle, especially compared to the crunch of increasing action breadth you have available as the game goes on. As well as the increasing food demand!\n\nThe 4 of us all preferred Le Havre compared to Agricola, and we like Agricola!\n\nWe've just played Le Havre once so far, but there would be good replay value from the 36 different special building cards of which 6 are randomly chosen each time.\n\nWe're looking forward to playing it again!",
    "timestamp": 1760738400
  },
  {
    "username": "Qumpelblase",
    "rating": 9.0,
    "comment": "Sehr sehr cleveres Spiel, bei dem die Regeln eigentlich pupsieinfach sind. Fülle die Auslage nach und besuche ein Gebäude oder räume eine Auslage leer. So einfach kann es sein! Trotzdem sehr viel Spieltiefe, die sich für mich darin äußert, dass ein planloser Spieler oft einfach nicht weiter weiß. Kein Spiel, in dem man einfach irgendwas machen kann und irgendwie Punkte bekommt. Man muss sich schon über mehrere Runden reinfuchsen, um in jedem Spielmoment genau zu wissen, was als nächstes zu tun ist, um eine effiziente Engine aufzubauen (die dann auch läuft und nicht hier und da ins Stocken gerät). Das hat mich in den ersten Partien etwas gestört, zeigt mir aber auch, dass ich mich als Spieler mit mehreren Spielrunden bestimmt auch weiterentwickeln werde. Und genau das werde ich versuchen, weil mir Le Havre echt gut gefallen hat.",
    "timestamp": 1759874400
  },
  {
    "username": "Asphodele",
    "rating": 9.0,
    "comment": "Great solo and 2 players in the short mode.\nPlay time too much long in a normal mode (7/10)",
    "timestamp": 1759528800
  },
  {
    "username": "blaklyte",
    "rating": 9.0,
    "comment": "Add-on:\n- GeekUp Bit",
    "timestamp": 1759442400
  },
  {
    "username": "OGRussHood",
    "rating": 9.5,
    "comment": "My 2025 Top 250: #188\nMy 2024 Top 250: #160\nMy 2023 Top 250: #151\nMy 2022 Top 250: #134\nMy 2021 Top 250: #182\nMy 2020 Top 250: #148\nMy 2019 Top 200: #136\nMy 2018 Top 100: #87",
    "timestamp": 1758492000
  },
  {
    "username": "beaglestorm",
    "rating": 9.0,
    "comment": "Sleeved - 157 - Standard European - Purple (FFS04) https://boardgamegeek.com/geeklist/164572/item/2909932#item2...",
    "timestamp": 1758232800
  },
  {
    "username": "turzin",
    "rating": 9.0,
    "comment": "SOUS-JOUÉ",
    "timestamp": 1758232800
  },
  {
    "username": "MaryPatriceJoanne",
    "rating": 8.5,
    "comment": "I love this game.",
    "timestamp": 1758146400
  },
  {
    "username": "andyliu33756",
    "rating": 9.0,
    "comment": "神game啊",
    "timestamp": 1757368800
  },
  {
    "username": "Difference",
    "rating": 8.5,
    "comment": "There are so many tactic possibilities in this game. Normally I can handle quite a lot, but at the end of this game it really starts to get impossible to grasp everything. Because of this, the game tends to take a lot of time with quite some down time.",
    "timestamp": 1756591200
  },
  {
    "username": "Zouzou825",
    "rating": 10.0,
    "comment": "Probably the best economic game of Rosenberg. However it's a bit pain to feeding, as in most of other Rosenberg's games.",
    "timestamp": 1762124400
  },
  {
    "username": "wiim",
    "rating": 10.0,
    "comment": "I don't know why, but this one really hits the spot for me. It really matters what other people are doing and what strategy they're playing. There's some push your luck with the piles of resources growing bigger every turn ... I find myself really looking forward to playing it again so upgraded from 9 to 10.",
    "timestamp": 1761170400
  },
  {
    "username": "tarmin8",
    "rating": 10.0,
    "comment": "The best of the trilogy. Just a tad long.",
    "timestamp": 1760824800
  },
  {
    "username": "chateauzou",
    "rating": 10.0,
    "comment": "Chef-d’oeuvre.",
    "timestamp": 1759788000
  },
  {
    "username": "MorelliBuendia",
    "rating": 9.5,
    "comment": "There’s a thread about Le Havre that I really like. It’s called “Le Havre is a game about shipping as much steel as possible”. Yes, there were some divisive opinions, such as “shipping coke can be more profitable”, or “sometimes the person who ships the most doesn’t win, buildings are important”, etc. However, the OP was on point.\n\nThe game starts with a very small town that can grow when you build more buildings… thanks to the goods that come by ships. There is a ship on the cover. The rulebook literally tells you “In the long term, building ships is important for every player. The game essentially cannot be won without ships”. Do you get the hint? The different options of this game are not strategies, but tools to help you as you work towards the goal: you want to build profitable buildings and ship expensive stuff. There is no such thing as a “making bread” strategy. There is no “smoking fish strategy”. And that doesn’t make the game broken. That makes the game GREAT.\n\nI really like games like Brass or Great Western Trail, where you choose a strategy and they’re viable. When you play Brass, you can be the person who goes heavy on shipyards, or on cotton, maybe. You can be the builder in GWT, or the cowboy, and sure, you’ll be bothering each other throughout the game, but it feels a bit more like you’re each choosing a separate path and then comparing scores at the end.\n\nIf you lose sight of the actual goal in Le Havre you will lose, and I think that’s good. Some games, you will go heavy on loans, some others you won’t take any. Maybe you’ll build a lot of wooden boats, or maybe you’ll bring a bunch of cows to the slaughterhouse to buy you some time until you build a couple of steel ships. However, the fact that everybody is going for the same things is what makes the game so tight and competitive every time, but it's not for those who want to explore many different paths and strategies to victory, all of them equally balanced for the final point salad.\n\nThis is a game that improves with each play. I started out rating it a 7 or 7.5 and thinking I didn't really need to own it. Now it's a top 5 game for me. Variability doesn’t seem huge, but the order in which goods get to the port, the order in which the buildings come out, and the four special buildings that come out in each game really make things different. I often start a game of Le Havre thinking “I’m going to go heavy on loans so I can get a lot of iron” and end up with zero loans. You really need to react to what other players do and what the game throws at you.\n\nThe more I play, the more I see this as an economic game rather than just another resource conversion, worker placement game. Your final score will be determined by money - cash and value of your buildings. Throughout the game, you will be investing that cash. Selling buildings for half their price is often a reasonable and necessary move, and loans can be very profitable in the long term. I love how Agricola scales and the fact that it works great at 2-4p, but I consider Le Havre to be Uwe Rosenberg’s masterpiece, and if I have three players, it would be very hard to find a game I would choose over this one.\n\nMogul Scale: 3/D. Almost tempted to put this at 2, but realistically, it's a 3. The rules are very simple: you can only buy, sell, take resources, or go to a building. Each individual action is very simple, even if its implications are not. The actions in the buildings are mostly conversion represented by an arrow, that's it. However, there's a few rules restrictions about buying/selling, a couple of buildings that should be explained from the beginning, loans, etc., that push this to a 3. The rules are definitely simpler than Agricola, though.",
    "timestamp": 1759528800
  },
  {
    "username": "dprcooke",
    "rating": 9.5,
    "comment": "Insert: Bit Boxes",
    "timestamp": 1759356000
  },
  {
    "username": "tphon",
    "rating": 10.0,
    "comment": "Sleeved - Sleeve Kings\n3D Printer Insert",
    "timestamp": 1759269600
  },
  {
    "username": "bwridge",
    "rating": 10.0,
    "comment": "I'm most impressed by the depth of Le Havre considering its simple mechanics (on your turn, take resources or take an action). The game is pretty wide open in terms of paths to victory, with every game a little different depending on what buildings come out and in what order. Great game...",
    "timestamp": 1758664800
  },
  {
    "username": "slantysteve",
    "rating": 9.5,
    "comment": "Le Havre is one of Uwe Rosenberg's masterpiece. A game of economic strategy, blending resource management, engine building, and tough decision-making into a deeply satisfying experience. Every turn feels meaningful, with endless paths to prosperity through clever shipping, building, or feeding strategies. Its depth, replayability, and elegant design make it a definitive classic.",
    "timestamp": 1758146400
  },
  {
    "username": "rkfan",
    "rating": 10.0,
    "comment": "Played 2025.",
    "timestamp": 1757282400
  },
  {
    "username": "dthomas97",
    "rating": 10.0,
    "comment": "This game is incredible with 2. So rich in both theme and mechanics. A masterpiece of design. Simply the greatest game ever created.",
    "timestamp": 1756591200
  },
  {
    "username": "kulczon",
    "rating": 9.5,
    "comment": "12\n\nsolo",
    "timestamp": 1756418400
  },
  {
    "username": "nwocge",
    "rating": 10.0,
    "comment": "剛開始覺得還好 不過越玩越好玩 現在已經常駐在桌上暫時不收起來了",
    "timestamp": 1754863200
  },
  {
    "username": "Sigurd1410",
    "rating": 10.0,
    "comment": "Simple, elegant and HIGHLY enjoyable title from mr. Rosenberg.",
    "timestamp": 1754776800
  },
  {
    "username": "Gernial",
    "rating": 10.0,
    "comment": "Great game. Iw ork on an expansion since 2021.",
    "timestamp": 1754604000
  }
]