[
  {
    "username": "redcatseye",
    "rating": 1.0,
    "comment": "건조하고 같은 웨이트 대 게임들과 비교 했을 때 룰이 잘 안 외워지는 편. 메인 메커니즘은 2018년 게임치곤 카탄처럼 고전 특유의 단순함. 같은 멤버로 할 경우 리플레이성도 의문임. 결론 재미는 단순하고 이해는 어려움.",
    "timestamp": 1762383600
  },
  {
    "username": "mickhah1",
    "rating": 1.0,
    "comment": "That's the most boring and ugly game I've ever played. Viscous snot is the most suitable description for it. 1000% overrated.",
    "timestamp": 1762210800
  },
  {
    "username": "vik_he",
    "rating": 1.0,
    "comment": "not fun no matter how hard i try",
    "timestamp": 1762038000
  },
  {
    "username": "Brianc198",
    "rating": 1.0,
    "comment": "The absolutely most overrated game ever. Boring and stale. Lacking a lot of variation and dynamic to be even near a good game for me.",
    "timestamp": 1761519600
  },
  {
    "username": "Sotislosky",
    "rating": 1.0,
    "comment": "du palle",
    "timestamp": 1760047200
  },
  {
    "username": "KerriCo",
    "rating": 1.0,
    "comment": "Having to start all over again from t1 buildings to t2 buildings is not fun at all, the concept of debt and the preassure of paying that debt is something not really funny in a board game. To real to be honest and the game overextends his welcome.",
    "timestamp": 1758924000
  },
  {
    "username": "kilicool",
    "rating": 1.0,
    "comment": "For balance stupid rating",
    "timestamp": 1758319200
  },
  {
    "username": "royno7",
    "rating": 1.0,
    "comment": "If you want to have a better experience of shared prosperity, play Terra Mystica series. If you want to play a real Euro game, try Ark Nova or Dune Imperium. If you want to play a serious talk game, try Twilight Imperium 4. Combining all the above mechanisms seems to result from having a drunken designer.",
    "timestamp": 1757109600
  },
  {
    "username": "zmartianov",
    "rating": 1.0,
    "comment": "This game is about businessmen who exploited workers",
    "timestamp": 1754604000
  },
  {
    "username": "slesk",
    "rating": 1.0,
    "comment": "Boring.",
    "timestamp": 1752703200
  },
  {
    "username": "Gindarel",
    "rating": 1.0,
    "comment": "I played it 3 or 4 times and I came to the conclusion that I detest this game. I'm not saying it's not good, but for my taste... it's just a nightmare.\n\nMy hatred against this boils down to: in my opinion the rules, the scoring... the game makes no sense.\nHow?\nWell, the rules:\n- Coal needs connection. Check.\n- Beer needs connection, unless it's yours because then it warps. Oooookay?\n- Iron, always warps. What?\n\nThe game:\nYou're trying to be a successful businessman during the industrial revolution by handing over your resources to just anyone... for free. Because after your mine runs out it starts to produce revenue. Because that's what it does!\nYou can also get successful by building connections between the cities aka. you can have a transportation business. Sounds good! It pays absolutely nothing and only gives victory points at the end of the eras, but it can give half your points! So during the game it's almost entirely useless and you build most of it out of necessity but it's a huge factor in your success. Makes sense? Not for me.\n\nAnd what absolutely doesn't influence your success is how much money you make from round to round... because money plays absolutely no role in business, right?!\n\nBtw, it's not a strategy game. The biggest strategy you have to \"build\" is when not to spend money. Other than that it's mostly opportunitism and making the most out of the random cards you draw. It's not bad, I just do not understand how is it the no.1 strategy game without any strategy. :/\n\nOh, and the interaction between the players is not positive. Everyone gonna try to take their opponents resources in a way that it is the least beneficial for their opponent. The one taking the resource is not interested in emptying the tile while just getting rid of 1 resorce gives nothing for the owner. It is more like passive agressive.\n\nIn short: the game is illogical and the lack of agency over your resources annoys me so much that if I never see this game again even that will be too soon.",
    "timestamp": 1752271200
  },
  {
    "username": "Boardgamer80",
    "rating": 1.0,
    "comment": "Worst game I've ever played. Twice, silly as I am.\n\nBrass has been on top of the game lists for a while now. I've always had a particular interest to try the game, and finally got my chance. And I was very disappointed.\n\nIt doesn't start well if I need to put on my glasses to read the board, my own player board and the cards. But, in the end it is about gameplay so I could forgive that.\n\nWhat I can't forgive is the poor theming. It just does not fit the gameplay. Brass should be about making money. But here is seems that lending money is the better way. In essence, Brass a game where a certain theme is slapped onto a generic \"construct buildings and boats/trains\" boardgame, with no depth whatsoever.\n\nThen... I played the game... and won... by having zero interaction with fellow players. My table mates were also flabbergasted that it worked out this way, as the game insinuates advantages if people use your items.\n\nAlso the game is very card dependent. You need some luck to get the right cards and if the location cards are too spread over the board or you have too many different product cards, it just doesn't work well for you and you are just filling a seat at the table.\n\nAnd the game takes way too long. Waiting, waiting, waiting. It is so boring as nothing happens.\n\nI don't understand the hype for this game.",
    "timestamp": 1751061600
  },
  {
    "username": "NavayaTCG",
    "rating": 1.0,
    "comment": "I thought this board game was boring.",
    "timestamp": 1750024800
  },
  {
    "username": "MuchoPene",
    "rating": 1.0,
    "comment": "Just boring",
    "timestamp": 1746136800
  },
  {
    "username": "Namenotfound999",
    "rating": 1.0,
    "comment": "Mid, disgusting, rubbish. Bite me if you want The Behind the \"8\" Ball Game is the greatest game in all of mankind.",
    "timestamp": 1741561200
  },
  {
    "username": "mmueller03",
    "rating": 1.0,
    "comment": "Just another dry, boring game with no theme. Nothing new or creative. If you need help falling asleep, this is the game for you.",
    "timestamp": 1734217200
  },
  {
    "username": "Knave13",
    "rating": 1.0,
    "comment": "Overhyped, geek rating is a fake, ignore this one. It is unworthy.",
    "timestamp": 1733094000
  },
  {
    "username": "cotomel",
    "rating": 1.0,
    "comment": "Overrated, bland game",
    "timestamp": 1732662000
  },
  {
    "username": "AliezMax",
    "rating": 1.0,
    "comment": "it's too boring",
    "timestamp": 1730156400
  },
  {
    "username": "CookedFish",
    "rating": 1.0,
    "comment": "I know people really value this game highly, I tried to play this game and I hated it. Why does a game need a multiple phases? It just makes your brain have hard time for no benefit imo. I played many other euro games usually I understand the complex rules but even a super heavy game like TI made much much more sense. This game somehow made no sense. I think this game single handedly turned my partner off BG rest of her life.",
    "timestamp": 1728770400
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "I suspect this gets rated higher than Brass Lancashire because the income tracker consistently reaches even higher levels. YAY MORE FREE MONEY.\n\nThe beer is kind of stupid in how players get scared of interacting with each other when they hear the convoluted rules governing it. But I can't blame it too much, the other resources are kind of flawed too. And in secret it's really just a train game since most of the points come from quick rails, not selling goods.",
    "timestamp": 1721685600
  },
  {
    "username": "Arielucsc",
    "rating": 1.0,
    "comment": "muy complejo para explicar",
    "timestamp": 1721253600
  },
  {
    "username": "Eton2343",
    "rating": 1.0,
    "comment": "I don't know why is this 1st. place, there is much better games.",
    "timestamp": 1711839600
  },
  {
    "username": "cjay2",
    "rating": 1.0,
    "comment": "Very dry and boring euro.",
    "timestamp": 1710025200
  },
  {
    "username": "Neronus",
    "rating": 1.0,
    "comment": "Very very bad.",
    "timestamp": 1709679600
  },
  {
    "username": "VultR",
    "rating": 1.0,
    "comment": "WSBG 2024\nIt's the top game and noone disagrees so need to check it out",
    "timestamp": 1706137200
  },
  {
    "username": "gamerdoge",
    "rating": 1.0,
    "comment": "it is unnecessarily long because it is unnecesarily complex. Players interaction is minimum and not worth your time. JASE Just another Soulless Euro.",
    "timestamp": 1705359600
  },
  {
    "username": "RootForever",
    "rating": 1.0,
    "comment": "The most boring and overrated game you could imagine. No tension: if you do not have resources, you borrow them. Almost no variability: even the two maps have just different colors. I don't understand why on earth this game is number one.",
    "timestamp": 1698098400
  },
  {
    "username": "sumer",
    "rating": 1.0,
    "comment": "Rating is for 2p. Some interesting mechanisms are wasted on boring actions, a tedious setup that is the same every single time, and almost no variability. Winner of the Dumbest Board Game Design award: a 2-sided game board that is exactly the same on both sides.\n\nVery overrated due to brigade-ing that went on.",
    "timestamp": 1695247200
  },
  {
    "username": "SombreroDeLaNuit",
    "rating": 1.0,
    "comment": "Im restarting the rating war !!! ^^",
    "timestamp": 1693260000
  },
  {
    "username": "LouisVilenge",
    "rating": 1.0,
    "comment": "Overrated egine-builder game. There are much better balanced eurogame titles with similar mechanics. Not worth the hype. I rated it 1/10 to balance out the poll.",
    "timestamp": 1692914400
  },
  {
    "username": "greb256",
    "rating": 1.0,
    "comment": "Too many chits. Regular boring euro track game. Theme is fine but kind of bland.",
    "timestamp": 1690581600
  },
  {
    "username": "nandastone",
    "rating": 1.0,
    "comment": "Martin Wallace was a jerk to by good friend Jimmy.",
    "timestamp": 1686261600
  },
  {
    "username": "PlacidMoose",
    "rating": 1.0,
    "comment": "My new WORST game I've ever played. An absolute hellgame by every measure.",
    "timestamp": 1685829600
  },
  {
    "username": "mchecky",
    "rating": 1.0,
    "comment": "This game literally murdered my dog",
    "timestamp": 1685484000
  },
  {
    "username": "fenadoruk",
    "rating": 1.0,
    "comment": "Too slow game, economics is weird... Cards are adding too much luck for what this game is trying to be. You find yourself pushed to an action out of no better alternatives.\nVarious unintuitive exception rules here and there, very fiddly.",
    "timestamp": 1681941600
  },
  {
    "username": "Boltana",
    "rating": 1.0,
    "comment": "Way too long (no where near the 1-2 hours on box) and honestly nothing to write home about. No idea why so many rave on this game.",
    "timestamp": 1680645600
  },
  {
    "username": "flyingdcc",
    "rating": 1.0,
    "comment": "the rules is not straightforward, some rules are non sense. The strategy might be good, but the background is not well.",
    "timestamp": 1678748400
  },
  {
    "username": "Boltana",
    "rating": 1.0,
    "comment": "A complete miss for me and for 3 of the 4 who played it.",
    "timestamp": 1678402800
  },
  {
    "username": "ericniemi",
    "rating": 1.0,
    "comment": "A convoluted euro game that is so much fun I'd rather have major surgery than play it again. Unless you enjoy heavy number-crunching and complicated rules, play something else.",
    "timestamp": 1677538800
  },
  {
    "username": "soy1bonus",
    "rating": 1.0,
    "comment": "Don't like the theme, too eurogamey for me.",
    "timestamp": 1677452400
  },
  {
    "username": "flotnie",
    "rating": 1.0,
    "comment": "Boring.. aawwwwww…",
    "timestamp": 1677279600
  },
  {
    "username": "Mystic_Mouse",
    "rating": 2.0,
    "comment": "Tedious and boring VP pusher with instant railway transition. Not my cup of tea? No, I’d rather smear my genitalia with fish paste and dangle them in a pool of hungry piranha.\n\nDingo",
    "timestamp": 1762576860
  },
  {
    "username": "Ironclad_Board_Gamer",
    "rating": 2.0,
    "comment": "Zero fun in this game",
    "timestamp": 1759010400
  },
  {
    "username": "Extermiknuter",
    "rating": 2.0,
    "comment": "Very dry eurogame, you need a loooooooot of water to play it...",
    "timestamp": 1755468000
  },
  {
    "username": "familygaming",
    "rating": 2.0,
    "comment": "Don't get me wrong, I see the appeal here for people who like economic, route-building games. But I am shocked that 51,000 people have rated it so highly as to push it to #1.\n\nI like heavy euros, and within that broad category, I would say I like route-building. But I would rather play Barrage over this, and Nucleum more than Brass or Barrage. So much so that I would play Barrage 10 times out of 10 when given the choice between Brass and Barrage. (I'd play Nucleum 7 times out of 10 over Barrage.)\n\nBrass is not very attractive looking, the readability is not great (board is busy and the tiles smallish), and the game play is fairly dry and spreadsheet-like. All those different buildings on your mat? Just different combos of iron and coal costs, with VP and income benefits. Nothing interesting here for me.",
    "timestamp": 1754604000
  },
  {
    "username": "tmkang",
    "rating": 2.0,
    "comment": "Incomprehensible. You can't give players a sheet with 6 different paths of varying counts of tokens and then have some convoluted system for everything. I think there might be some good player interactions here, but nothing is intuitive.",
    "timestamp": 1749852000
  },
  {
    "username": "ashendary",
    "rating": 2.0,
    "comment": "After playing this several times trying to see what others liked about the game, but I just don't see it. Not enjoyable at all. I will go back to playing other games as this is a waste of my time.",
    "timestamp": 1746482400
  },
  {
    "username": "zhunGamer",
    "rating": 2.0,
    "comment": "Rented. This game was effectively a mash of Everdell, Luna Maris, and Scythe, but all the parts that weren't fun, and absolutely no aspect that was fun.\n\nDo you want to do anything? Well here are your cards, you can't do this, you can't do that, oh this beer only works for this, that thing if you sell it only gives you 1 income instead of 7, I guess the game is about determining which level of which building at which track after using how many upgrades to throw away potential, completely unnecessary upgrades in the upgrade tree, you will somehow min-max something across the poverty simulator going into \"oh Lv1 buildings are destroyed because idk\" and you're reset to zero.\n\nOf course! I did 2 hours of nothing to gain +7 income! I could have just started the game with these stats and I would have been spared 2 hours of this trash! Here, enjoy the second phase where you don't have any resources to do anything, all your buildings are gone, and you don't have resources to build networks anymore either (because those are also destroyed)!\n\nThis is the #1 on board game geek? Well I'm not playing this again. There was not a single moment in the game that was fun/enjoyable, and it took 3.5 hours.\n\nThe best thing about this game was the final turn, knowing I no longer have to bother with this. Play literally any other game.\n\nI honestly can't really recall a single game where I really hated every single turn as much as I did in this one...",
    "timestamp": 1746309600
  },
  {
    "username": "kbkuno",
    "rating": 2.0,
    "comment": "I don't understand, why peoply love this game so much. Its very ugly and nothing special in it.",
    "timestamp": 1743976800
  },
  {
    "username": "elijah234",
    "rating": 2.0,
    "comment": "Played Brass years ago. This latest version is not an improvement. Same old problems. Fiddly, AP game design. Small fonts, messy board ‘visual’ game design. Repetitive for its game length. 60-120 mins playing time? Not even close. Learning game is 4 hours, which can be cut down to 3 with experience, tops. But if I had 3 hours, I would be playing something else.",
    "timestamp": 1741042800
  },
  {
    "username": "WalkerGame",
    "rating": 2.0,
    "comment": "meglio una giornata di duro lavoro in miniera , fa meno male",
    "timestamp": 1735599600
  },
  {
    "username": "BoardGamingCouple",
    "rating": 2.0,
    "comment": "2/5\n\nboring dull game with a yucky theme. ticket to ride, concordia, and power grid are all similar gameplay wise, but much quicker & better.",
    "timestamp": 1735254000
  },
  {
    "username": "ShutUpMichael",
    "rating": 2.0,
    "comment": "The usual BS from Mr Wallace. The game is multiplayer solitaire with random input before your turn. It does not matter what anyone else does, you just sit and wait for your turn, then decide once everything is clear. Great for those who hate having friends, terrible if you are wanting something fun.",
    "timestamp": 1725746400
  },
  {
    "username": "kchaugum",
    "rating": 2.0,
    "comment": "Theme is bleak and dreary. We love Eurogames, but this one made us want to play anything else.",
    "timestamp": 1724623200
  },
  {
    "username": "eik44",
    "rating": 2.0,
    "comment": "First Brass is better, widely",
    "timestamp": 1720648800
  },
  {
    "username": "Ctrlalt",
    "rating": 2.4,
    "comment": "A game I strongly dislike and will try to avoid as much as possible.",
    "timestamp": 1719093600
  },
  {
    "username": "Ender02",
    "rating": 2.0,
    "comment": "Not sure how the spam review bombing campaign managed to get this to #1 or how it has managed to stay there. It is one of the most boring games that I have ever played. I wanted to give it a try since it has been hyped so much over the last year, but I was ready to quit less than halfway through. Definitely will be avoiding this and its other versions from now on. For some reason there is a fanbase, but I guess it is not aimed at me.",
    "timestamp": 1716674400
  },
  {
    "username": "mrappbrain",
    "rating": 2.0,
    "comment": "Very dry economic euro. Don't really feel the theme, and there's nothing to hang my imagination on. Good for folk who like deep strategy I guess, but not really 'fun'.",
    "timestamp": 1712181600
  },
  {
    "username": "Bigfinsfan13",
    "rating": 2.0,
    "comment": "Tried it to give it a fair shake. I considered it slow. Don't see the hype.",
    "timestamp": 1711494000
  },
  {
    "username": "sijin",
    "rating": 2.0,
    "comment": "1 piont for Internet marketers",
    "timestamp": 1709334000
  },
  {
    "username": "Zomerdromen",
    "rating": 2.0,
    "comment": "Too dry and competitive for my taste.",
    "timestamp": 1708729200
  },
  {
    "username": "Kbjordan",
    "rating": 2.0,
    "comment": "I know people love this game but it is very much not my style. Way too many little rules that kept me from doing what I wanted. Felt like work, not fun.",
    "timestamp": 1706655600
  },
  {
    "username": "Thane13",
    "rating": 2.0,
    "comment": "Just like Lancashire: pick the player at the table who's best at math, they win, go play something fun.",
    "timestamp": 1704495600
  },
  {
    "username": "Ozymandias123",
    "rating": 2.0,
    "comment": "One of the most boring games I've ever played",
    "timestamp": 1700348400
  },
  {
    "username": "Simonc17",
    "rating": 2.0,
    "comment": "Always Trains",
    "timestamp": 1700089200
  },
  {
    "username": "asfhgwt",
    "rating": 2.0,
    "comment": "Far too complicated for me. Zero fun.",
    "timestamp": 1696370400
  },
  {
    "username": "Luminati444",
    "rating": 2.0,
    "comment": "too dry...really not for me",
    "timestamp": 1696197600
  },
  {
    "username": "Billmatic",
    "rating": 2.0,
    "comment": "I understand that everyone has different tastes, but I cannot for the life of me understand how this could be the #1 rated game on this site. There is an insane amount of games infinitely better than this. Without question the most dry, boring, themeless, dull and stale game I have EVER played (Disclaimer: I usually only play games that interest me so Im very aware that there are obviously games much worse than this, I just wont ever play them in the first place.) I hate this game to my core and will never play it again.",
    "timestamp": 1690581600
  },
  {
    "username": "cjkeppner",
    "rating": 2.0,
    "comment": "I fully admit I got into Brass: Birmingham with the wrong expectations. I thought a game with an exceptional theme, beautiful artwork, and interesting market mechanics HAD to be a hit. But my whole group found the game to be so needlessly complex that it meant we were constantly checking the rule book, all to just sell resources. It was so taxing that of the three times I tried to run the game, the rest of the party decided to quit halfway through. If you like truly complex resource games, this might be a hit…but to me it’s fun-factor didn’t justify the complexity.",
    "timestamp": 1686866400
  },
  {
    "username": "Neon_Riot",
    "rating": 2.0,
    "comment": "Played with 4, the game dragged on painfully long and to me felt extremely repetitive. When entering the second era, I was ready for the game to be over. Wanted to try our a highly rated economy game but the genre just isn't for me. If you dislikes a game like pipelines, probably stay away from this.",
    "timestamp": 1686348000
  },
  {
    "username": "Fredholm",
    "rating": 2.0,
    "comment": "I hate everything about it. Too long, too boring. Can't even remember a single redeeming feature after playing this soulless monstrosity for four hours. And I use \"playing\" loosely as most of the time consists of waiting around while other players debate endlessly what to do with their two actions.",
    "timestamp": 1685311200
  },
  {
    "username": "schtefan",
    "rating": 2.0,
    "comment": "What a sad, fiddly game. Complicated, not complex. Many small unnecessary rules (on level 1 you need 1 beer to sell this. Level 2: 1 beer. level 3: no beer. level 4: 2 beer...). And hence, it is AP prone, drags slowly, has no stop the run away leader potential. I regret the hours of my plays of it. Waiting all the time without any potential to neither plan ahead (since someone could destroy all your plans out of nothing with the right card) nor have some table chat, because everyone else was crunching all the possibilities all the time (to have their plans destroyed right before their eyes). And this was with my favourite gaming group who loves dune imperium and the like.\nSo, a game to forget. But I am happy for all the people who, for whatever reason, seem to like it.",
    "timestamp": 1685052000
  },
  {
    "username": "R0lly",
    "rating": 2.0,
    "comment": "I shouldn't have tried this one to be fair... You may like.",
    "timestamp": 1677625200
  },
  {
    "username": "Ashenz",
    "rating": 2.0,
    "comment": "overvoted crap",
    "timestamp": 1677538800
  },
  {
    "username": "TexT12",
    "rating": 2.0,
    "comment": "Punishing",
    "timestamp": 1677020400
  },
  {
    "username": "kiwipaul",
    "rating": 2.0,
    "comment": "Way overhyped. Heavy strategic game but not anywhere near other games of development, resource management",
    "timestamp": 1676847600
  },
  {
    "username": "NormandyWept",
    "rating": 2.0,
    "comment": "Someone looked at the original Brass, didn't notice how it's much better than the vast majority of games released in the past ten years, and set out trying to make it more 2018 and therefore, a pale shadow of the original.\n\nI quite like the more generous implementation of \"playing wild\" (getting the Wild Location & Industry cards, vs. just making a single wild move) and it has been done in an inventive and interesting way, however it works toward the overall objective of filing away \"rough edges\", or as they're also known, interesting parts of the design.\n\nAll elements of \"co-opetition\", where players could work together in certain domains to further them both, have been stripped away in the name of an efficiency exercise where each player runs their individual business empire and tries to shut out the others. It's perhaps more competitive than some contemporary designs but it plays almost as if someone read the rulebook of Brass but never played it.\n\nWorst of all, this new version has inspired some insipid play of the original where players go out of their way not to interact with others and lean away from some of the interesting specialisation and cooperation that is the way to score highly in Brass, or as we are apparently now forced to call it, \"Brass Lancashire\". (No doubt I should anticipate a visit from a modern-Euro bailiff that tries to force entry to my home to write \"Lancashire\" on my box with a permanent marker.)",
    "timestamp": 1676674800
  },
  {
    "username": "gragatrim",
    "rating": 2.0,
    "comment": "Downtime is brutal, barely bearable at 2p.",
    "timestamp": 1661896800
  },
  {
    "username": "secondofthenew",
    "rating": 2.0,
    "comment": "Brass Birmingham felt very tactical to me. It's a mishmash of elements (board resets, hand management, non-engine building, weak interaction, unintuitive transport mechanisms) that--at best--I am lukewarm on. Overall, it was just a wholly uncompelling package, absolutely overhyped, and left me with a disappointing feeling of ennui.\n\nIf I'm going to play a game with shared infrastructure, I'd much prefer Sol: Last Days of a Star or The Great Zimbabwe.",
    "timestamp": 1626645600
  },
  {
    "username": "dorafans91",
    "rating": 2.0,
    "comment": "The rules are not just abstract but counter-intuitive: why connection to my network is needed for consumption of coal but not for iron? Why players can gain more income and points when all coal on a coal mine are used up? Shouldn't a coal mine generate coal for use every turn? Why players can consume other players' resources without paying while they are required to pay when buying from the market? What is the point of the cards when only 1 out of the 6 possible actions is related to the card discarded? Why sometimes I can build using other players' canal but sometimes I can't? There are more but what I want to point out is that the theme is just completely irrelevant to the game. I don't see how this game is fun and I would prefer more simple, yet comprehensible economic game over Brass.",
    "timestamp": 1625868000
  },
  {
    "username": "AbnRgr",
    "rating": 2.0,
    "comment": "After walking away from it several times due to its graphics, finally tried to play it. Very difficult, slow and confusing due to graphics. Good game whose graphics make it mostly unplayable. Dark ugly theme even on the \"day side\". Tiny text and symbology not good for 20-20 aging eyes.",
    "timestamp": 1624658400
  },
  {
    "username": "thiefofsanity",
    "rating": 2.0,
    "comment": "People seem to like this. Not me!",
    "timestamp": 1599602400
  },
  {
    "username": "egg_timer",
    "rating": 2.0,
    "comment": "Terribly boring. The current (high) rating utterly bewilders me. This game is seriously bad.",
    "timestamp": 1590098400
  },
  {
    "username": "candoo",
    "rating": 3.0,
    "comment": "I loathe this as much as I loathed the original Brass. And now add in hunger games for beer.\n\nOne and done.\n\nThe #1 game on BGG? Someone euthanize me.",
    "timestamp": 1762582560
  },
  {
    "username": "Edheldui",
    "rating": 3.0,
    "comment": "This game is not about deciding what to do. It's about figuring out what you can do by navigating the silly amount of clunky exceptions slowly but surely chipping away your decision space until only 1-2 options are remaining. Turns take a long time not because of strategy, but because of how fiddly everything is. The rules are nonsensical from a logic standpoint. Some resources follow networks, some teleport, some do both, sometimes, except x and y and z. And then, halfway through the game, the connections between the places you worked on for the last hour and a half have to be removed and redone from scratch in the second half. The graphic design is abysmal, symbols are lost in the unnecessary detail, everything becomes a blurry mess, while important information is hidden away in the corners. The player aids that come in the box are worthless, the game is genuinely unlearnable and unplayable without the user-made ones. Furthermore, the setup and the mid-game scoring/upkeep are tedious, fiddly and take way too long. This game does not deserve the praise it gets, at all.",
    "timestamp": 1762124400
  },
  {
    "username": "NotThatSalem",
    "rating": 3.0,
    "comment": "Dull. Just very dull. Coal and iron (whoopie), plus tiny steps that take forever. Do no understand the love for this one.",
    "timestamp": 1759788000
  },
  {
    "username": "Albergonx",
    "rating": 3.0,
    "comment": "Boring",
    "timestamp": 1759528800
  },
  {
    "username": "Serge0118",
    "rating": 3.0,
    "comment": "Not understanding the hype. Mediocre game, nice design though.\nLots of better games out there.",
    "timestamp": 1754776800
  },
  {
    "username": "Saaur_",
    "rating": 3.0,
    "comment": "I really couldn’t care less about what was going on on the it’s just stuff for fluff - building a little network, searching to optimise scoring and hoping some cards show up, or hoping you opponent doesn’t have them.... Also the interaction feels very engineered - like Puerto Rico. Only played it once, but have no desire to play again - would let myself be pressured into a game so that puts it at a 5. But to the Brass crew I’d softly whisper KaiVai or even Wildcatters in the hope they’ll suggest one of those.",
    "timestamp": 1750284000
  },
  {
    "username": "lost1n5pace",
    "rating": 3.0,
    "comment": "I was duped by non-other then myself. Everyone told me it was a good game, why else would it be at the top of the rankings. My first play I could barely follow along, so I rated it a seven thinking I just didn't get it. played it several more times thinking there is an enjoyable game here somewhere, why else would everyone love it. Well after numerous plays I understand that this is not a fun game. It's slow, everyone suffers from AP and I never feel satisfied after playing. I will go back to playing the games I like such as Ark Nova and Dune Imperium.",
    "timestamp": 1746482400
  },
  {
    "username": "Davolous",
    "rating": 3.0,
    "comment": "#1 BGG rated game and my wife hates it, she would give it a 1.\n\nI don't hate Brass Birmingham, and I would be happy to play it. However, I really don't understand why it as been the #1 game on BBG for so long. It's not in my top 10 for sure.\n\nSince my wife hates it... It's hard for me to get to the table.",
    "timestamp": 1743289200
  },
  {
    "username": "Heriadoros",
    "rating": 3.0,
    "comment": "I just don't see the point of it. So many complicated rules, none of them precise. Analysis paralysis from meaningless options. Absolute nightmare to navigate boardstate, thanks no less to graphical design. And tedious to setup. If this wasn't one of highest rated games to date I could be less critical, but seeing it on pedistal of best games of all time is just wrong.",
    "timestamp": 1741993200
  },
  {
    "username": "I_made_a_username",
    "rating": 3.0,
    "comment": "Pros: tight mechanics once you know how to use them, satisfying systems, wide decision space.\n\nCons: dingey look to the board, inconsistent or idiosyncratic rules (why can iron be used anywhere but coal needs to be connected to be consumed?), theme and gameplay are not well linked (see last example), fiddly with too many components, boring theme, the inability to plan ahead due to the constantly changing board state makes players' turns take too long.",
    "timestamp": 1738450800
  },
  {
    "username": "Jellybelly1018",
    "rating": 3.0,
    "comment": "2-4 best 3-4",
    "timestamp": 1736463600
  },
  {
    "username": "WonkoMT",
    "rating": 3.0,
    "comment": "Overly complex, fiddly, and boring. I really don't get the hype with this.",
    "timestamp": 1733180400
  },
  {
    "username": "Citery",
    "rating": 3.0,
    "comment": "Loosens some of Lancashire's annoyingly tight bolts: the Scout action is vastly better than the double discard, the variable setup adds some spice, and the splintering of cotton into different sub-industries gives a little more creative freedom to players.\n\nMuch of Brass's trademark interdependency is now carried out through beer, as it is required to flip pretty much every other building type. It's a decent replacement for Lancashire's ports, other than the supremely silly rule that your own beer can be teleported across the map without using links, which leads to very un-Brass-like plays of exploiting your own isolated, untouchable resource supply rather than forcing entanglement with a common stock.\n\nDespite this uninterractive blunder, I do appreciate that beer attaches a much-needed brake pedal to link development in the rail era, as it's now a resource requirement for the double build action. Unfortunately, and despite this bottleneck, Birmingham is still stricken with Brass's unforgiveable curse: links are still boring and they're still way too efficient for how unilateral and unimaginative of a point source they are. I was excited when I heard that Birmingham had industries that provide variable link points, as I assumed that meant the overall point density would go down. Insanely, it's the exact opposite: certain key locations on the map can now be (and often are) stacked with multiple 2-point tiles, and links make up even more of your score. Ugh.\n\nThe original Brass is a game I consider almost-great. To see the best (and possibly only) attempt at remastering it fail to reach this potential is a terrible, painful waste.",
    "timestamp": 1729288800
  },
  {
    "username": "Egwood",
    "rating": 3.0,
    "comment": "From what I've heard and read, I will probably like Brass:Lancashire more than Brass:Birmingham. I found this game unintuitive and fiddly, with a surprising amount of luck. Some of the rules (which apparently don't appear in B:L) feel overly complex and unnecessary. Not looking to play again.\n\nUpdate: Upped the rating from 3 to 4. Decided to give another chance after 2 years. Played 2p, This went a lot better and SO quite liked it. I can see why people adore it, but the same critiques remain from me. Willing to play again, but only with non-AP players.",
    "timestamp": 1720562400
  },
  {
    "username": "DaveMann",
    "rating": 3.0,
    "comment": "My issue with this game is that it requires the player to have excellent math skills to be proficient with the game flow. Math isn't my strong suit, and this kills my motivation for this game. Otherwise, it has enjoyable mechanics.",
    "timestamp": 1719698400
  },
  {
    "username": "Azikin",
    "rating": 3.0,
    "comment": "Uhhh, I hope I won't play this ever again. I prefer games over brain excersises. From the similar type of games, I'd play Le Haver over this any time.",
    "timestamp": 1718834400
  },
  {
    "username": "Thorrk",
    "rating": 3.0,
    "comment": "- With an absurd amount of exceptions in the rules making the game complicated and very fiddley to play.\n- The game gives you analysis paralysis not because there are many options to explore, but because it takes a very long time to realize how little options you have.\n- Because of all that, the game takes much longer to play than it should.\n- The game offers very little freedom, everybody is symmetrical and play the exact same game from start to finish, you have no freedom to choose your own playstyle you just do whatever you can given your cards and the board set up.\n- This also means that the game has very low replayability, after playing one game you've seen everything the game has to offer and there is not much content/strategy to explore.\n\nOn the positive side the game has some very satisfying moments alongside a couple of interesting mechanism but so do MANY other euro games that are far more enjoyable to play and don't have the flaws written above.",
    "timestamp": 1717020000
  },
  {
    "username": "Nabeel56",
    "rating": 3.0,
    "comment": "Not for me. Too dry. Connection rules too fiddly.",
    "timestamp": 1714082400
  },
  {
    "username": "Tolis71BG",
    "rating": 3.0,
    "comment": "There are similar board games that are nicer. Much ado about nothing.",
    "timestamp": 1710630000
  },
  {
    "username": "Sockheaven",
    "rating": 3.0,
    "comment": "I purchased this game because of its #1 status, and because of how much I enjoyed Radlands (same publisher).\n\nThe theming of the game is great (abeit teleporting iron still rubs me the wrong way).\n\nWith the good out of the way, key red flags that made me give this game away after only playing twice:\n1) There is no reasonable way to track score till the end - there is a point tracker, but there are so many points scored at the end, you can't tell if your strategy is putting you in the lead or not.\n2) While scoring, if someone accidentally moves the wrong tracker token, there is no way to figure out the mistake - since there are so many steps to scoring its easy to mess up the board\n3) the board has so many pieces, if the table gets jostled, its hard to place all the pieces back since the board has no recessed troughs for pieces (we have a 300lb game table, and this was still a problem).\n4) there is a defined mechanic to discard one card from the deck per player (this starts each players discard pile). However, while this is stated as required and makes the turns even out, this is incorrect - it leads to half of the players getting 1 extra turn in the first half and half of the players getting 1 extra turn in the second half. Depending on how the game plays out, the same group of people may get both extra turns. By simply ignoring this rule, the turn counts even out.\n\nFull transparency: I like pure strategy, no luck and clear tracking of progress. Perhaps this game just isnt for me, but it seems to have serious design flaws. I am at a loss for why this is sitting at #1, even more confused as to how it got there.",
    "timestamp": 1710284400
  },
  {
    "username": "Fevin",
    "rating": 2.7,
    "comment": "Avec de grandes attentes vient une grande déception. Possible que si je m'était attendu à pas grand chose ma déception aurait été moindre.\n\nAprès j'imagine aussi qu'entre très bons joueurs qui connaissent parfaitement le jeu c'est probablement mieux (comment pourrait il en être autrement d'ailleurs ?).\n\nMais c'est le jeu le plus triste qui existe. Pas que je sois un fan de party game mais la c'est la tristesse.\n\nEnsuite c'est un jeu jouable qu'en ligne tant il y'a de manipulation, pire que Saint Petersburg. De la thune avec des contraintes de monnaies. Des cubes à ne pas oublier de déplacer. Des cartes à ne pas oublier de défausser.\n\nD'ailleurs parlons en des cartes. C'est quoi cette mécanique qui fait défausser de cartes 75% sans lire leur texte. Et c'est quoi cette mécanique complètement aléatoire et frustrante d'ailleurs.\n\nLe fluff aussi c'est bien parfois, la il y'a aucune linéarité dans les bâtiment, certains dans un arbre sont cher, d'autres pas cher, un peux donner des thune le suivant des PV sans aucune logique juste pour l'équilibrage.\n\nLe kingmaking aussi est largement possible.\n\nJ'ai gagné les 3 games mais aucun intérêt.",
    "timestamp": 1705100400
  },
  {
    "username": "Powellk",
    "rating": 3.0,
    "comment": "Not sure what the hype is about on this one.",
    "timestamp": 1705014000
  },
  {
    "username": "Jub8Jub",
    "rating": 3.0,
    "comment": "Did not feel rewarding and I had to ask myself why am I doing this action.",
    "timestamp": 1704063600
  },
  {
    "username": "hinson3rd",
    "rating": 3.0,
    "comment": "Played",
    "timestamp": 1702162800
  },
  {
    "username": "Arnaud3013",
    "rating": 3.0,
    "comment": "No fun at 2 players usally playing in coop.",
    "timestamp": 1699743600
  },
  {
    "username": "trashmyego",
    "rating": 3.0,
    "comment": "It's no Nucleum.",
    "timestamp": 1697925600
  },
  {
    "username": "jcarvin",
    "rating": 3.0,
    "comment": "Typical Brass; more work than fun and I want to like it more than I do. I've come to terms with those realizations and so I've sold my copy and I really won't play it again unless it's the only thing on the table.",
    "timestamp": 1695938400
  },
  {
    "username": "Gamegrunt",
    "rating": 3.0,
    "comment": "I enjoyed my nearly 2 year ownership of Brass Birmingham and played it, mostly with my wife, 18 times. It's really a bit too heavy for my household so I sold it. I'll play it whenever the opportunity presents itself.\n\nRecently I jumped at the opportunity to sit in on a 4 player session with 2 new players. I thought I played the game well, focusing on manufacturing. I came in dead last, and wasn't even close to 3rd place. I guess I've reached a point where I must admit that while I understand how the game is played, I haven't been able to grasp the strategic elements that would make me competitive. At this point I must conclude that it is not a game that I can play with any degree of competence, therefore the 3 rating.",
    "timestamp": 1692655200
  },
  {
    "username": "Jsheebz",
    "rating": 3.0,
    "comment": "Overrated. Hated this game. Components were nice though. Especially the deluxe money clay chips.",
    "timestamp": 1690927200
  },
  {
    "username": "DeadWeight92",
    "rating": 3.0,
    "comment": "Dull and dark and overstays its welcome",
    "timestamp": 1688335200
  },
  {
    "username": "astinoff",
    "rating": 3.0,
    "comment": "Mejor es el original",
    "timestamp": 1683064800
  },
  {
    "username": "iuioi",
    "rating": 3.0,
    "comment": "Good game, but slightly overrated for #1. I won't play it again.",
    "timestamp": 1682892000
  },
  {
    "username": "wingnut338",
    "rating": 3.0,
    "comment": "played twice. could only manage to play the short game each time as the game is way too long with 2 or 4 players. the rules are way too fiddly.",
    "timestamp": 1681682400
  },
  {
    "username": "ppsacco",
    "rating": 3.0,
    "comment": "not my kind of game...simply put...I wanna play against my opponents not game scores and tracks.",
    "timestamp": 1679698800
  },
  {
    "username": "TheFlashisBarryAllen",
    "rating": 3.0,
    "comment": "too much grey and brown",
    "timestamp": 1678834800
  },
  {
    "username": "Brandizzle",
    "rating": 3.0,
    "comment": "I love the look, production quality, and idea of this game... but both times I played, it seemed like a pretty big time investment to just repeatedly hear people say \"sorry, it's just the card I had.\"\nFor this specific style of game, if it was shorter, or not so reliant on the cards, I'd like it a lot more.",
    "timestamp": 1677193200
  },
  {
    "username": "LisArtist",
    "rating": 3.4,
    "comment": "Probably the best \"train game\" out there and I hate it. The game is meaty and I enjoyed learning the mechanics enough to scratch the surface. I see why people love it. I will never ever play this game at a convention with players I don't know. It invites ruthless players who will play it to extinction and suck the fun out of puzzling for points. It's weighty enough that I will forget the mechanics between plays and it's not the type of game that frequents our dining table over the weekends, making it an occasional game where I will re-learn with friends, enjoy myself, be mostly fodder and will hopefully (barely) hold my own. I honor this game and its players. 8/10/21\n\nAvoid like the plague while appreciating it from afar. Very, very, afar. Like never. 2/23/23",
    "timestamp": 1677106800
  },
  {
    "username": "bobdan19",
    "rating": 3.0,
    "comment": "Ce jeu est bon mais ne peut être le numéro 1 mondial sur BGG… quelle déception, c’est un Aventurier du Rail en plus évolué… il y a tellement mieux sur le marché ludique.",
    "timestamp": 1676674800
  },
  {
    "username": "Ryuu",
    "rating": 3.0,
    "comment": "I usually like worker placement games, but did not enjoy this. (Sorry, Eric!)",
    "timestamp": 1676674800
  },
  {
    "username": "72tigers",
    "rating": 3.0,
    "comment": "Worker placememt",
    "timestamp": 1676674800
  },
  {
    "username": "amitche1",
    "rating": 3.0,
    "comment": "I fail to see the love for the brass system, but I had no fun playing this. I'd rate it lower, but I don't want to be that guy who is over reacting to a beloved game.",
    "timestamp": 1670972400
  },
  {
    "username": "bbolch",
    "rating": 3.0,
    "comment": "Brass: Birmingham is tremendously popular and has many fans but for me it was not a hit. I found the economy in the game to be tight to the point of suffocation. And the two separate eras made the game artificially long.",
    "timestamp": 1655330400
  },
  {
    "username": "dj_koen",
    "rating": 4.0,
    "comment": "I dont like this game its way too finnicky and crunchy, its tedious and frustrating",
    "timestamp": 1759528800
  },
  {
    "username": "naturally",
    "rating": 4.0,
    "comment": "Takes forever to play",
    "timestamp": 1757541600
  },
  {
    "username": "rolf_smit",
    "rating": 4.0,
    "comment": "Many players seem to be absolutely in the clouds about this game, but after a few rounds it didn’t click for me. If you enjoy calculating every move to perfection rather than having a relaxed, fun game night, Brass may be your kind of game. I personally struggle to see why it’s considered a #1 on BGG, even for people who enjoy these strategic traits, there must be something missing.\n\nWhat I really miss is a sense of achievement or progress. There are indicators, but they’re mostly numbers, nothing that feels satisfying or sparks joy. Some rules feel like “patches” added to fit the theme, such as the canal and rail periods, which add complexity without much payoff. Thematically, I also feel disconnected: I never get the sense that I’m truly building something meaningful. I’m placing industries purely for resources or points. While efficiency is common in many games, a strong theme usually gives you additional satisfaction for why you’re building, which Brass largely misses.\n\nAll things considered, I could play it again, but it won’t spark joy.",
    "timestamp": 1755900000
  },
  {
    "username": "Grugnur",
    "rating": 4.0,
    "comment": "Not a fan of this game. Only played it once. Every strategy I attempted (to gain a resource or whatever) seemed to require multiple resources or gains that were unattainable. I was very limited on what I could do, I felt my hands were always tied, so that it took the fun out of the game. I suppose I should give it another try. I'm surprised it gets such high ratings. It just wasn't fun for me. It made me angry.",
    "timestamp": 1752357600
  },
  {
    "username": "Jrtolf",
    "rating": 4.0,
    "comment": "I didn't completely hate it, but I still didn't really like it. Just another soulless euro to me.",
    "timestamp": 1742252400
  },
  {
    "username": "Carlos Palomino",
    "rating": 4.0,
    "comment": "I find this title to have aged very poorly. The decision space is cramped, which leads to AP; never mind the long-noted confusion of “iron teleports, coal does not, beer teleports (but only from your own production facility).” I find myriad recent euros to have surpassed this.",
    "timestamp": 1740610800
  },
  {
    "username": "el_marko",
    "rating": 4.0,
    "comment": "Every decision feels punishing, too much like hard work, not enjoyable for us.",
    "timestamp": 1737327600
  },
  {
    "username": "koflo1",
    "rating": 3.5,
    "comment": "2-4 (3-4)",
    "timestamp": 1735945200
  },
  {
    "username": "troncodune",
    "rating": 4.0,
    "comment": "I've played it 3 times and i don't need it but i would give it a 4. chance",
    "timestamp": 1734130800
  },
  {
    "username": "olliundjan",
    "rating": 4.0,
    "comment": "Interesting abstract points cruncher, heavily relying on luck. Not at all an economic game, as too many mechanisms just don’t reflect economic reality. So, I would play this again, but not for any of the reasons the game advertises. Honestly, I don’t get the buzz it has been creating.",
    "timestamp": 1732662000
  },
  {
    "username": "noom777",
    "rating": 4.0,
    "comment": "Feels like working overtime in an underpaying job. Clever but not fun.",
    "timestamp": 1732402800
  },
  {
    "username": "ashkai",
    "rating": 4.0,
    "comment": "We really liked the network building and how players can use the factories of others.\n\nIt was just too much set up for a competitive game for us personally.",
    "timestamp": 1730934000
  },
  {
    "username": "Therayofhope",
    "rating": 4.0,
    "comment": "The game has literally no theme that makes the game play hardly engaging. The loan mechanism is miserable and you can hardly see what it is leading to.",
    "timestamp": 1730761200
  },
  {
    "username": "jelsepa",
    "rating": 4.0,
    "comment": "Having now experimented thousands of boardgames, I came to the conclusion that Brass Birmingham is mediocre at its best. It's far from being the best from Wallace; it's even further than being the best game of the world. I understand how people are really attached to this game, since it checks all the boxes modern euro amateurs would want in a game.\n\nBrass: Birmingham limits player interaction from its predecessor, which leads more often than not to a multiplayer solitaire experience. Granted, there is some interaction, and there are other games much more prone to falling into this trap (hi Ark Nova!), but there are not enough ways to sustain mid or long-term conflicts between players. It is immediate and blend: someone took your spot, or your beer, or screwed your short-term planning. After 2 or 3 rounds, you went past it and are now on to something else.\n\nOverall, I appreciate to play Birmingham as an activity and to please fellow gamers, but as a game, this has nothing that stands out to me. Mediocre mechanisms that lead to low-level player interaction. And the leaves a sugar-free shortbread cookie taste in my mouth when I'm done playing it.",
    "timestamp": 1728424800
  },
  {
    "username": "vikingcode",
    "rating": 4.0,
    "comment": "The friend who own this described it as \"not a very fun game but the puzzle is great!\". If this is the peak of Martin Wallace's designs, I'll skip his other games.\n\nThe thematic explanations for some things are terrible at best and actively got in the way of the game",
    "timestamp": 1718488800
  },
  {
    "username": "Erik_G",
    "rating": 4.0,
    "comment": "Much like Ark Nova, just way too complicated for the fun I got out of it. I'm open to playing it again, but I'd sooner give Ark Nova another spin purely for the theme.",
    "timestamp": 1717884000
  },
  {
    "username": "alandric",
    "rating": 4.0,
    "comment": "Not great, not terrible.",
    "timestamp": 1715637600
  },
  {
    "username": "swingingsteel",
    "rating": 4.0,
    "comment": "I love a good euro but I thought this was mechanically and thematically just so bland and boring.",
    "timestamp": 1713650400
  },
  {
    "username": "spencyrrh",
    "rating": 4.0,
    "comment": "2024-04-03 (1 play at 4): I can see the pitch. What if your ruthless, thinky optimisation puzzle Euro was interactive?\n\nI don't want to do edge-case cascading arithmetic for four hours, so I don't. I play with my gut. But I will always be outplayed by the mathsiest gamer. And once the game starts, there's no getting out.\n\nEven if I stood any chance of competing, the game runs too long, and has too many fiddly rules. One player didn't even bother learning the game, and just asked if every conceivable action was legal on each of their turns. There are many exceptions and contortions. It is not fun trying to remember these of an evening.\n\nYou know, I'm a big weirdo and I like silly things. But I am simply not this kind of pervert.\n\nSomeone said that everything this does, Power Grid does better. They're not even on the same planet. This is a shared spreadsheet. Power Grid is a shounen manga by comparison. An auction here or there could reall brighten this up! But then it would be even longer.\n\nI like seeing a game with Birmingham in it.\n\nEDIT 2024-04-03: Do you know what though, I was pretty sleep-deprived, and I played with a slow, mathy player. Maybe it would be very different under different circumstances.\n\nIt feels highly machined, and very carefully balanced. But the machinery felt totally unlubricated, and my experience was utterly without humour.\n\nIn this game, interaction emerges from mastery of quite fiddly rules. Everything we do is on a shared board, and your decisions affect other people, but it can be hard to see that under the weight of improvising a strategy, remembering exceptions, etc.. So for me, as a beginner player, it still feels like I need to game the system, and not the other players. So while Brass offers much fundamentally different and more interaction than comparable games in its genre, I still felt like I was playing an efficiency puzzle. And I got crushed under the weight of my misplays.",
    "timestamp": 1712181600
  },
  {
    "username": "uduhno",
    "rating": 4.0,
    "comment": "I find the theme of the game to be a bit boring. I also was not a huge fan of the mechanics where people can steal resources you build, particularly the beer. No solo mode. Random draws of cards are not great for a strategic game.",
    "timestamp": 1709506800
  },
  {
    "username": "TagoVane",
    "rating": 4.0,
    "comment": "Very convoluted, expensive and not logical",
    "timestamp": 1709247600
  },
  {
    "username": "Wojciechhhhhh",
    "rating": 4.0,
    "comment": "Seems to be boring, typical Euro game where small mistakes punish you very badly and there is no comeback mechanism. Another minus for very long sessions. Game looks nice but I guess it is mostly for euro games fans.",
    "timestamp": 1705964400
  },
  {
    "username": "xylantrax",
    "rating": 4.0,
    "comment": "After a couple more plays, I strictly prefer Lancashire. Too many problems here: beer and roads dominate the games to the point that 2/3 of second era is just beer and double-road spamming. Too many cotton tiles, too many efforts to reach 4th level (I can just build pottery), boxes are useless 80% of the time. And that's not even all the problems.",
    "timestamp": 1705446000
  },
  {
    "username": "WombatBrunft",
    "rating": 4.0,
    "comment": "Nice concept and design. But by far to much downtime with 4 players. And simple mistake at the beginning might be impossible to correct. For people that like to see others thinking and not play so much themselves.",
    "timestamp": 1705186800
  },
  {
    "username": "Hdgami",
    "rating": 3.5,
    "comment": "* 1.5/2 : Art/Craft\n* 1/2 : Interactions\n* 1/2 : Mechanisms\n* 0/2 : Tempo/Fluidity\n* 0/2 : X-Factor\n*\n* Total: 3.5/10\n\nX-Factor :\nHate the card system",
    "timestamp": 1699052400
  },
  {
    "username": "duodora",
    "rating": 4.0,
    "comment": "Another \"objectively good game that I do not enjoy.\" I realize there is a lot to be said for the interconnectedness of the game and player interaction that derives from it, but the theme and dryness make the game relatively unappealing to me. The more games I play, the more I realize that one of my personal pet peeves in games is \"opaqueness.\" We tend to play a lot of games not very many times, so I have a fairly limited amount of tolerance for games that require multiple plays to understand how the systems are interconnected. I realize this game holds up very well to lots of repeat plays, but isn't going to be one that I particularly enjoy.",
    "timestamp": 1698879600
  },
  {
    "username": "theaaron",
    "rating": 4.0,
    "comment": "Just not my kind of game. The early game feels aimless as you just make moves for the sake of making moves. Then later in the game it's all about opportunistic moves/blocking based on the cards you have.",
    "timestamp": 1698444000
  },
  {
    "username": "gotrunks712",
    "rating": 4.0,
    "comment": "Game just isn't for me.",
    "timestamp": 1697925600
  },
  {
    "username": "anarablehill",
    "rating": 3.5,
    "comment": "Great game, but the theme and artwork bore me to death and I rarely pull it off the shelf.",
    "timestamp": 1693260000
  },
  {
    "username": "Jabbergeist",
    "rating": 4.0,
    "comment": "All the mental exhaustion of setting up moves and plans in a complex game system with none of the satisfaction of seeing them pay off. Ever. This is the game of 'settling for less' because someone else took your resources, you can't get to the resources, someone else took your spot, you can't get to the spot, you can't do anything with the cards you were randomly dealt, on and on and on. So much about this game is unpleasant to play.\n\nI have been talked into playing this a number of times and every time I have sworn I will never play it again.",
    "timestamp": 1691791200
  },
  {
    "username": "AxysKilgore",
    "rating": 4.0,
    "comment": "Unfortunately quite underwhelming given its reputation. While strategically very complex, it lacks any dramatic or social aspects present in most other network building games. It also lacks significant dips and surges in particular markets, making it nigh impossible to weigh the benefits of different actions. Still, the systems are very clean and flow well among small groups, and I appreciate the dedication to the historical theme. 4/10.",
    "timestamp": 1691359200
  },
  {
    "username": "idefix08",
    "rating": 4.0,
    "comment": "I simply expected more",
    "timestamp": 1687816800
  },
  {
    "username": "rick3623",
    "rating": 4.0,
    "comment": "Abstract and not fun for me.",
    "timestamp": 1686520800
  },
  {
    "username": "Rockpaper",
    "rating": 4.1,
    "comment": "Reported to have balance issues. Too dry even aside from this although more interesting than most economy-themed games. Auction and stock-market elements are deemphasized in favor of a focus on spatial networks, which adds appeal.",
    "timestamp": 1684965600
  },
  {
    "username": "gigafiend",
    "rating": 4.0,
    "comment": "Played a couple games and it was not enjoyable for the group. Fiddly rules, unclear winning strategy and long playtime. Hope to have a better experience if I play it again.",
    "timestamp": 1680472800
  },
  {
    "username": "Allxmen",
    "rating": 4.0,
    "comment": "Just not my cup of tea.",
    "timestamp": 1677711600
  },
  {
    "username": "sipols",
    "rating": 4.0,
    "comment": "Comparably to Lancashire, game is more complex. but BAD complex.\nWhile Lancashire is streamlined and polished, the extra resource and complication in trading and buildings in Brimingham feels somewhat clumsy and artificially more complex.\n\ngame needs to be worked on and polished to reach similar smoothness as older version...\n\n+ i am not beer addict, so having it in game do not raise my opinion of game...",
    "timestamp": 1677452400
  },
  {
    "username": "zero712",
    "rating": 4.0,
    "comment": "Easy game, the \"difficult/complex\" part is when another player takes something you want or \"harms\" your game route. I found Lancashire better, this one has new cards to help players, making it easier.",
    "timestamp": 1676934000
  },
  {
    "username": "KaSaKakaDemola",
    "rating": 4.0,
    "comment": "Ciekawa pozycja z rozpychaniem się na planszy, nawet we 2kę. Piękno różnych priorytetów w obu rundach. Spoko - od kogoś kto nie trawi tego typu pozycji.\n\nUWAGA: Nie wskazana na początek przygody ze światem planszówek, instrukcja może poważnie przytłoczyć. Lepiej Carcassone/Zamek (jeszcze lepiej) na początek. [:",
    "timestamp": 1676761200
  },
  {
    "username": "Siroggak",
    "rating": 4.0,
    "comment": "Hated the arbitrary 'because game' rules.\nWhy does every second pottery give you zero points? Because game\nWhy do you not need to be connected to consume your own Breweries’ beer, but must be connected to other players’ Breweries? Because game",
    "timestamp": 1676761200
  },
  {
    "username": "Jdcnl",
    "rating": 4.0,
    "comment": "I really don't get why this game is rated so high. I guess as far as euro games go it's okay. I still hate the \"reset\" during the first and second part of the game. This was the thing I also really hated in the original. It has some good things going for it, but I just don't think this is my game.\n\nWhen it comes to euro's I prefer games like Snowdonia, Viticulture and Power Grid. I would play it if somebody else really wants to, but it would never even cross my mind as a gaming suggestion.\n\nWhen it comes to Martin Wallace games. I have several others that I like way more, like Nanty Narking, Wildlands, Via Nebula, A Study in Emerald, A few acres of snow and Onward to Venus",
    "timestamp": 1670626800
  },
  {
    "username": "aflemos",
    "rating": 4.0,
    "comment": "Too slow paced.",
    "timestamp": 1668812400
  },
  {
    "username": "joanmoreno",
    "rating": 5.0,
    "comment": "Reglas un poco obtusas, con excepciones y muchos detalles que hacen que tengas que estar revisándolas constantemente. La explicación hay que preparársela bien, no es sencillo asimilar los conceptos.\n\nMe gusta que todo el mundo participe en el tablero central y que pueda aprovecharse de las rutas y recursos de los demás, hay mucha interacción, sin duda lo que más me gusta del juego. La edición, una chulada también. Sin embargo, el juego tiene demasiadas reglas poco intuitivas y demasiados detalles por los que hay que estar pendiente (puede provocar entreturnos largos). Viendo que es un juego tan querido le he dado varias oportunidades pero definitivamente no es lo mío.",
    "timestamp": 1762210800
  },
  {
    "username": "brutemong",
    "rating": 5.0,
    "comment": "Pros:\nGreat theme and artwork. It looks beautiful on the table.\nUsually finishes within reasonable time\nCons:\nSome of the mechanics in this game are unnecessarily complex for complexity sake.\nTransition from canal to rail era breaks the rhythm of the game . Scraping all those old tiles off the map is fiddly and annoying.\nSetup is a drag. Having to meticulously place all the tiles on player boards feels like a chore and is annoying due to the fact that most of them don't get used.",
    "timestamp": 1761865200
  },
  {
    "username": "merismo",
    "rating": 5.0,
    "comment": "It's.... fine. Would you have told me this is the number 1 rated board game on BGG after playing it I would have never believed you.\n\nMaybe I need to try it again?",
    "timestamp": 1761606000
  },
  {
    "username": "GuySamstag",
    "rating": 5.0,
    "comment": "Martin Wallace's games typically always need more developmental work and general refinement.\nBut this ain't how you do it.",
    "timestamp": 1759356000
  },
  {
    "username": "iplaybgnaked",
    "rating": 5.0,
    "comment": "Excellent economic euro with a wealth of depth and strategy to it. The card play keeps it fresh on repeated play while not being random enough to prevent consistent strategies. Plays best at 2-3 players.",
    "timestamp": 1758060000
  },
  {
    "username": "jubilant_decimeter",
    "rating": 5.0,
    "comment": "too long for me and the gameplay felt like i had to be reactive to others stealing my stuff instead of building towards my own goal\n\nmight be because the teach was really bad tho",
    "timestamp": 1757023200
  },
  {
    "username": "CXXXIV",
    "rating": 5.0,
    "comment": "For me, the game feels rather tedious, offering no variable abilities and lacking substantial interaction. I don’t think it deserves the top ranking in the world. I’ve played it six times, and each experience was disappointing. The integration of mechanics and theme is also subpar, with the mechanics feeling quite abstract.",
    "timestamp": 1756159200
  },
  {
    "username": "DonWalker",
    "rating": 5.0,
    "comment": "Beer makes absolutely no f***ing sense. Play Brass:Lancashire for a round game. Play this is you like soulless pseudo thematic games.",
    "timestamp": 1755036000
  },
  {
    "username": "Scifi66",
    "rating": 5.0,
    "comment": "MkII Brass/best with 3? It's a softer, more MPS version of Lancashire. After a dozen plays know my optimum strategies. Which means this is less interesting.\n+ Variable end market demand counters changes which board locations are popular\n+ Ironclays\n- Why does beer fly only for you? Encourages hoarding! Beer is too strong\n- Can 90% of the time plot your own strategy and get away with it, much less interaction than Lancashire\n- Dark board art",
    "timestamp": 1751148000
  },
  {
    "username": "Erboka",
    "rating": 5.0,
    "comment": "Friend's game",
    "timestamp": 1745272800
  },
  {
    "username": "Legion5o2",
    "rating": 5.0,
    "comment": "zagrałem pół gry, nie wiem skąd taki szał",
    "timestamp": 1742166000
  },
  {
    "username": "Kreha6",
    "rating": 5.0,
    "comment": "Great game but the fact that you can't do certain action only because you don't have necessary card in hand i frustrating. IMO heavy economic games shouldn't rely on pure luck. On the other hand without that system, all plays would be the same......so I have mixed feelings about it :/",
    "timestamp": 1741734000
  },
  {
    "username": "K2vA",
    "rating": 5.0,
    "comment": "Gra jest niesamowicie skomplikowana, a do tego instrukcja choć niezła wiele rzeczy niestety nie tłumaczy jasno i trzeba zagrać kilka gier aby w miarę ogarnąć mechanikę. To nie znaczy że gra sama w sobie jest zła. Jest ciekawa, dość ładnie wykonana plansza (mogły by być o ton bardziej kontrastowe), jest dobrze wykonana. Ogólnie gra mogła by mieć lepszą notę przy lepiej zrobionej instrukcji.",
    "timestamp": 1738623600
  },
  {
    "username": "LizGamerGirl",
    "rating": 4.5,
    "comment": "Not a game for me, but I can see why others like it.",
    "timestamp": 1738364400
  },
  {
    "username": "Ciel_Bleu",
    "rating": 5.0,
    "comment": "Felt the game was too restrictive. Guess this game wasn't for me.",
    "timestamp": 1736722800
  },
  {
    "username": "PermaFrost88",
    "rating": 5.0,
    "comment": "The theme is not great. The colors are all different shades of grey, and industrial.\n\nTheme aside, it is mechanically sound. I would most likely revisit this game and update the score.",
    "timestamp": 1736463600
  },
  {
    "username": "Jeff_the_Zebra",
    "rating": 5.0,
    "comment": "I understand what makes this game good but I just cant get onboard with it.\n\nIf you ever have one little thing with a game that bugs you to the point where you start to notice every little issue with the game that it ruins it ?\nThats me with this.",
    "timestamp": 1736204400
  },
  {
    "username": "honeybeast25",
    "rating": 5.0,
    "comment": "Just not for me.",
    "timestamp": 1735772400
  },
  {
    "username": "Rob Beekman",
    "rating": 5.0,
    "comment": "Owned by Lieuwe",
    "timestamp": 1735340400
  },
  {
    "username": "gidorah",
    "rating": 5.0,
    "comment": "03.2023\n\nGAMEPLAY\nOn a turn, a player plays two cards from hand, taking an action with each card. Actions include take loans, build links, develop industries, build industries, sell goods, scout (i.e., get wild cards), and pass. VPs are scored by 1) building industries and then flipping them to their profitable side, either by consuming their resources or selling the goods they produce; and 2) link VP scored by connecting two cities or a city and offboard area. Birmingham takes place over two eras, the canal era and rail era, and the game ends when players play all their cards in the rail era.\n\nTHOUGHTS\nI was excited by the idea of Brass becoming a “system” game, similar to Age of Steam or Power Grid where different maps make slight tweaks on a very interesting foundation. And while I’m still excited by the possibilities, Birmingham is most definitely NOT for me as it revels in all the worst, modern Euro impulses. To wit, when compared with Lancashire, it’s longer, it’s more complicated, and—most damning of all—it’s softer.\n\nThe complicated side. Although I tried to make excuses for beer, it’s a pain in the ass to teach, not to mention the constant reminders and rules questions that come up regarding it’s consumption and use. Add to this all the faffing with offboard areas and the merchant tiles and bonuses, and I often feel like I spend more time helping players internalize the rules than enjoying the game play.\n\nThe soft side. The scout action, while I think it’s evidence of a suboptimal move, provides an unnecessary flexibility. Also eased are the restrictions on taking late-game loans. But the worst offender in this category are the coal and iron markets that make it nearly impossible to ever overbuild an opponent.\n\nAll this said, I actively dislike Birmingham because why put all that time and effort in when I’d only be playing a facsimile of a good game.",
    "timestamp": 1734649200
  },
  {
    "username": "Harroguk",
    "rating": 5.0,
    "comment": "RotW is a better network builder.\nFCM is a better economic game.",
    "timestamp": 1733266800
  },
  {
    "username": "mekane",
    "rating": 5.0,
    "comment": "I just can't get into it. I don't find it thematically engaging or rich. The strategy is opaque and not very interesting to me. I find the rules frustratingly non-intuitive and full of special cases.",
    "timestamp": 1732230000
  },
  {
    "username": "CharlieMnemonic",
    "rating": 5.0,
    "comment": "Fun twist on Brass. I like the added bits, but they feel more like they were added simply to increase complexity, not because they were entrenched in the theme like the original mechanisms. Not sure we really needed this edition. I guess I am in the minority here!",
    "timestamp": 1731279600
  },
  {
    "username": "Eternaldecay",
    "rating": 5.0,
    "comment": "Game is decent, just not super exciting",
    "timestamp": 1730761200
  },
  {
    "username": "M4sterFlex",
    "rating": 4.5,
    "comment": "Platz 1 auf BGG und das seit geraumer Zeit, dass muss doch dann auch zwangsläufig ein gutes Spiel sein oder? Weit gefehlt, zumindest hat es meinen Geschmack leider nicht getroffen.\n\nAngefangen von der viel zu dunklen und wenig ansprechenden Illustration, bis hin zu einem Gefühl durch die Spielmechanik an Solitär erinnert zu werden. Spielspaß bedauerlicherweise kaum vorhanden. Das ging sogar so weit, dass sich zeitweise, dass spielen des Spiel wie „Arbeit“ angefühlt hat. Auch die Spielregeln gehen nicht leicht von der Hand.\n\nDaher empfehle ich, falls sich jemand bei dem Spiel unsicher sein sollte, sich vorher ein Lets Play anzusehen, um besser zu beurteilen, ob das Spiel etwas für einen ist oder nicht.",
    "timestamp": 1730415600
  },
  {
    "username": "Bradley_V",
    "rating": 5.0,
    "comment": "Meh.",
    "timestamp": 1729893600
  },
  {
    "username": "ultimoratio",
    "rating": 5.0,
    "comment": "UPDATE: JAN 2024: It's a good game. Shared incentives exists, but the brewery remains really annoying, clearly designed with Euro gamer philosophy in mind. There's nuance with network developing. But then, so is Brass: Lancashire\n\n==================\n\nUPDATE - MAY 2020: This game feels solitaire now, in comparison to Brass: Lancashire. The fact that the game is much more open and the random market tiles didn't help at this. You can play this and not pay attention to your friends for 90% of the time and still win. Lame.\n\n------------\n\nA game of establishing factories, building railway networks, and selling your goods using those networks you've built. The game is very satisfying whenever you manage to sell your goods.\n\nIt has excellent player interaction in which it's not all about destructive moves against your friends, but a cooperative and mutually beneficial move that would result with scores on both sides. This is good as this forces you to be savvy on which opportunities you would take and weight in your options, giving you so much decision space.\n\nIt's quite a pain to teach and learn, with so many exceptions and so many unintuitive rules, which stops this game from entering my favourite games of all time.",
    "timestamp": 1728856800
  },
  {
    "username": "General Clifford",
    "rating": 5.0,
    "comment": "After a couple of games I am waiting to see something interesting about the game play. I will give it some more plays to hopefully see what all the fuss is about.",
    "timestamp": 1727042400
  },
  {
    "username": "sebnic",
    "rating": 5.0,
    "comment": "Basic game with basic mechanics. The best thing? Its marketing campaign...",
    "timestamp": 1726869600
  },
  {
    "username": "Vrooman",
    "rating": 5.0,
    "comment": "\"You can't do that\" sums up my experience. So many fine rules coupled with a very loose theme makes for a difficult game to learn and that's without even considering the strategy required. Well designed, but it's heavy and very dry. Repeat plays required to conquer the learning curve, but not engaging enough (minimal theme and fiddly) to make me want to play often.",
    "timestamp": 1720908000
  },
  {
    "username": "Entropology",
    "rating": 5.0,
    "comment": "Certainly a significant step up from the original. Still not my cup of tea, but I can at least recognize why this is so popular. Great player interaction, nice balance of maintaining different goals. Still, extra rules for the sake of rules (coal vs iron vs beer transport) and just finicky stuff like: only one building in each city first age, lvl 1's wipe from main board but not player board, can't play some lvl 1's in 2nd half but can play others... Nothing huge, but together they just make it a pain.\n\n[Edit]: I seem to be the outlier here. My group really enjoys it, so it'll stay in the collection (for now).\n\n[Edit]: Quietly traded it away and no one in game group has noticed for more than a year. Not bad, but not so fun that anyone asks for it.",
    "timestamp": 1716674400
  },
  {
    "username": "saci23",
    "rating": 5.0,
    "comment": "Given the excellent ratings I was surprised by a very dark board and boring theme. The mechanics were fine but station access was restricted at 2p and play began to feel a bit repetitive.",
    "timestamp": 1716415200
  },
  {
    "username": "Michelsan",
    "rating": 5.0,
    "comment": "I'm very surprised that this one got the first place with those funny and unlogicals rules.\nJe ne comprend rien à la logique des règles. Sérieusement... ? pas de transaction commerciale si on a pas de bière ? Une poterie coûte 3 fois plus cher qu'une aciérie ? A l’époque des transports par canaux un même entrepreneur ne peux pas construire 2 usines dans la même ville ? On utilise gratuitement les ressources d'un concurrent pour construire son usine ?...Bref tout cela m'échappe.\nSauf le graphisme de la boite...Superbe.",
    "timestamp": 1706914800
  },
  {
    "username": "mavo",
    "rating": 5.0,
    "comment": "Only traded because Lancashire is enough...good game",
    "timestamp": 1706828400
  },
  {
    "username": "JoshuaStarr",
    "rating": 5.0,
    "comment": "This game takes the exemplary qualities of Brass and paints over them with a Euro brush. To me, Brass is about opportunity and interdependence. This game takes focus away from other players over to one's own board. Even though this game is using the Brass system, the times I'd choose to play this game isn't when I'd want to play Brass, but when I'm in the mood for something like Terraforming Mars or Lisboa (which is never).",
    "timestamp": 1700262000
  },
  {
    "username": "wellevorkanagawa",
    "rating": 5.0,
    "comment": "I love what you do on the board, but I hate the cards, which could have been removed in this new edition. But it wasn't at that irks me...",
    "timestamp": 1699138800
  },
  {
    "username": "SWxNW",
    "rating": 5.0,
    "comment": "The corners have been padded in comparison its predecessor, far less aggressively competitive than the original due to the new resource constraints and the diversity of industry to choose from. What results is less of a knives-out fight for territory and more of a balance of parallel competitive interests (so: less interdependent).\n\nBreweries are too good. They score well AND they have good income AND all players need beer for just about any meaningful action they want to take. Breweries are a terrible replacement for Ports, which were the crux of the interdependent incentive structure in Lancashire. Moreover, the rules for beer consumption are bordering on nonsensical.\n\nThe economy is much looser, and the opportunity cost for the Scout action is virtually zero compared to the real tension around the double action build requirements in the original.\n\nThere are far too many multi-industry spaces. Sure choices are wide and varied, but it's far less important what your opponents are doing.\n\nI also dislike the rule that you're allowed to build a link before you build any industry. It removes most of the timing considerations around who gets down the first Ironworks.\n\nBasically, Birmingham has sacrificed competitive interdependencies and the beauty of a player-created supply/demand system for the tragically modern design aesthetics of \"setup variability\" (which the game didn't need) and \"multiple paths to victory,\" which is euro-design speak for \"I'm more interested in beating a gaming system than my opponents.\"\n\nBirmingham doesn't completely lack interdependencies/interaction, but there are far fewer here than in the original game.\n\nIt's basically as good as some of the middling Age of Industry maps. Even still, it's a decent game, and I don't mind playing it from time to time as a bit of a change of pace.",
    "timestamp": 1698271200
  },
  {
    "username": "ninja_trilobite",
    "rating": 5.0,
    "comment": "Played twice, at 2 players, and loathed it both times. I love heavy games; Lacerda games, Gaia Project, T-games, Suchy games, and Mindclash games are all among my favorites. Brass is such a joyless exercise in tile-flipping. I am baffled that it somehow rose to the top of the BGG rankings.",
    "timestamp": 1693173600
  },
  {
    "username": "Thronx",
    "rating": 5.0,
    "comment": "Ive played most of the BGG Top50, but this is the first game among those that felt very overrated.\nAre the good ratings bought?",
    "timestamp": 1692396000
  },
  {
    "username": "Bumbusia",
    "rating": 5.0,
    "comment": "takie sobie, nigdy nie byłam jakimś wielkim fanem",
    "timestamp": 1690063200
  },
  {
    "username": "martinh",
    "rating": 5.0,
    "comment": "I don't understand why you'd play this when Age of Industry does the same decision making in a shorter game with multiple easier to read maps",
    "timestamp": 1688940000
  },
  {
    "username": "LovebloomOhYeah",
    "rating": 5.0,
    "comment": "I'm sure it would be awesome at higher player counts...",
    "timestamp": 1688162400
  },
  {
    "username": "mattstrickler89",
    "rating": 5.0,
    "comment": "Just 'meh\" for our gaming group. New version put a lot of bells and whistles on the original Brass but it's still the same, somewhat dry, build your own machine with virtually no interaction between players game. And that beer mechanism; ppffllbffffb. There's just no room for 'dull/drab' on my shelves these days. That said, this is an honest review. Only numbskulls would rate this game a 1 just for rankings.",
    "timestamp": 1682373600
  },
  {
    "username": "indubitably14",
    "rating": 5.0,
    "comment": "Solid game mechanically but for me, this feels like taking a class in accounting. More work than fun.",
    "timestamp": 1681423200
  },
  {
    "username": "arcer7",
    "rating": 5.0,
    "comment": "21",
    "timestamp": 1678834800
  },
  {
    "username": "HouseRuler",
    "rating": 5.0,
    "comment": "It‘s so complicated and it takes have a day.",
    "timestamp": 1677970800
  },
  {
    "username": "tobyskov",
    "rating": 5.0,
    "comment": "I can appreciate the game for what it is. But for whatever reason I cannot get into it and I do not enjoy it, whether or not I am in a winning position. It is difficult to put to words what I don't like.",
    "timestamp": 1677798000
  },
  {
    "username": "KatherineNaomi",
    "rating": 5.0,
    "comment": "With all the praise I was really hoping to like this but it fell flat for me. Too fiddly and I don't really like the theme.",
    "timestamp": 1677452400
  },
  {
    "username": "The_Philosophers_Die",
    "rating": 5.0,
    "comment": "Played the game twice. Didn't enjoy it. Most of the time I felt that there was not a single good option for the turns to take. I will give it another chance.",
    "timestamp": 1677452400
  },
  {
    "username": "Jhontitor",
    "rating": 5.0,
    "comment": "Is Grass ir brass? I chosse Grass ❤️",
    "timestamp": 1677020400
  },
  {
    "username": "Faolain",
    "rating": 5.0,
    "comment": "There's things I like about it, but it's long and I don't feel any sense of accomplishment. Better than Lancashire though. The addition of beer does make this game better, as being partially sloshed you can actually enjoy the game!",
    "timestamp": 1676847600
  },
  {
    "username": "smijatov",
    "rating": 5.0,
    "comment": ".",
    "timestamp": 1676761200
  },
  {
    "username": "BorgBoss",
    "rating": 5.0,
    "comment": "Sokkal jobb Wallace játékok is vannak. Nem érdemel ennyi pontot.",
    "timestamp": 1676674800
  },
  {
    "username": "Hegiel",
    "rating": 5.0,
    "comment": "Mediocre - I will play if in the mood and if friends will bring it to the table, however I can't force my mind to get any entertainment nor satisfaction from this game.",
    "timestamp": 1675465200
  },
  {
    "username": "wendlm",
    "rating": 5.0,
    "comment": "Don't like the theme - I have no fun playing this game",
    "timestamp": 1670626800
  },
  {
    "username": "Lollipopper",
    "rating": 4.5,
    "comment": "Thought the gameplay was fine until we reached the halfway point and I realized oh wow I have to do that all again??? Gameplay was interesting and strategic but got pretty old after the first 2 hours. Not sure why this is recommended so highly to play with 4 people; personally I prefer to not have to wait 20 minutes between each of my turns",
    "timestamp": 1669330800
  },
  {
    "username": "KristoferP",
    "rating": 5.0,
    "comment": "Most overrated game on BGG",
    "timestamp": 1662933600
  },
  {
    "username": "tblick05",
    "rating": 5.0,
    "comment": "Feels like it’s overhyped. It’s ok but unless everyone knows the game well it’s really boring.",
    "timestamp": 1661464800
  },
  {
    "username": "MegaHamster",
    "rating": 5.0,
    "comment": "It's fine. Hard to have a run away leader so that's probably why people like it.",
    "timestamp": 1659477600
  },
  {
    "username": "Kamaitatchi",
    "rating": 5.0,
    "comment": "It's good and fun to play but... I feel like I'd need to play more to really get the fun out of this game and instead I'd just rather play so many other game instead.",
    "timestamp": 1654812000
  },
  {
    "username": "RogueM",
    "rating": 4.5,
    "comment": "Any game that has a mechanic that requires you to have a hand of cards as an excuse for timing the game gets a raised eyebrow from me.\n\nWhen said game, in addition, pretends the hand management is where the art is when providing a game of short-term opportunistic moves I draw the line.\n\nJust played an introductory game (canal era), which may well be all I’ll be willing to be subjected to.",
    "timestamp": 1653688800
  },
  {
    "username": "ledvolta",
    "rating": 5.0,
    "comment": "deluxe edition",
    "timestamp": 1651010400
  },
  {
    "username": "eagerbeaver",
    "rating": 5.0,
    "comment": "Meh. It was alright, but just couldn't get as excited about this game as I wanted to be.",
    "timestamp": 1647039600
  },
  {
    "username": "kornfee",
    "rating": 5.0,
    "comment": "way too dark, I liked the \"former editions/versions\" much better",
    "timestamp": 1641769200
  },
  {
    "username": "knightofstyx",
    "rating": 5.0,
    "comment": "Too unforgiving if you make a mistake.",
    "timestamp": 1640041200
  },
  {
    "username": "alcollad",
    "rating": 5.0,
    "comment": "Compared with its predecessor (Lancashire) I´ve found this one quite dissapointing; it´s more complex to play but, at the same time, much less rewarding in terms of enjoying while developing your network.",
    "timestamp": 1634421600
  },
  {
    "username": "Cam_O_Meal",
    "rating": 5.0,
    "comment": "Played it, and the strategy is sound but thematically and artistically is bland.",
    "timestamp": 1633384800
  },
  {
    "username": "paprik",
    "rating": 5.0,
    "comment": "Unfortunately, for me it fell apart because of poor balancing which makes only one tactic work (BLIC). Could be great with some house ruling / balance.\n\nThere also seems to be a lot of downtime when players try to optimize for points or recalculate a move when they get blocked.\n\nLastly, the game length is longer then advertised (about 3-3.5 hours) and the setup is pretty fiddly.",
    "timestamp": 1632261600
  },
  {
    "username": "pwoloszun",
    "rating": 5.0,
    "comment": "Lancashire clone, feels like an expansion map with couple rule changes. Imho less thematic.\n\nIf you like Lansashire you'll like Birmingham as well.\n\nIts not abad game, it just does not thrill me at all.",
    "timestamp": 1630274400
  },
  {
    "username": "GaiaHero",
    "rating": 5.0,
    "comment": "Depressing boredom",
    "timestamp": 1624744800
  },
  {
    "username": "wswb",
    "rating": 5.0,
    "comment": "normal.......",
    "timestamp": 1622239200
  },
  {
    "username": "Doogles",
    "rating": 5.0,
    "comment": "Elegant mechanics, but took too long without enough strategic payout.",
    "timestamp": 1620424800
  },
  {
    "username": "Mech_Patrolling",
    "rating": 5.0,
    "comment": "2 - have not yet played this game.",
    "timestamp": 1618956000
  },
  {
    "username": "Moxanthia",
    "rating": 5.0,
    "comment": "A smart network building game of collecting shared resources. The issue comes when one of those important resources is greatly limited and can all be plucked up by whichever player happens to be next in line.",
    "timestamp": 1609628400
  },
  {
    "username": "Butsegs",
    "rating": 5.0,
    "comment": "Played it, not my cup of tea. I experienced the game as very \"snowbally\": If you're not ahead by the start of the second era, you're most probably not going to take the victory, this session + it's also very hard to make a comeback due to the fixed number of turns each era.\n\nI get why others like it though, and the art style is amazing.",
    "timestamp": 1608937200
  },
  {
    "username": "Jonboyz",
    "rating": 5.0,
    "comment": "A good euro game, but as dry as chalk.",
    "timestamp": 1608505200
  },
  {
    "username": "Blaystro",
    "rating": 5.0,
    "comment": "How to take few of the mechanics of Ticket to Ride to make a great economic game.\n\nThe gameplay is simple yet hard to master (6 actions). You have to build factories to produce ore (coal/iron) and goods to sell.\n\nFew things :\n\n- you can build in your network (connected by factories or boats/trains) with production cards or use city-cards\n- cards are randomly draw but bad luck can be mitigated by taking one action for drawing \"jokers\"\n- building factory is half the job as selling ore or goods are requires to get the victory points and income bonus. Therefore one of the biggest strategy is to minimize the time of \"dead assets\" and selling as fast as possible\n- the is almost no way to get instant money, instead selling ore/goods increase slowy your income rate. However you can take one action to make juicy loan and reduce your income.\n\nOKAY, so why so bad review (5) ?\n\nBecause I found that this game as almost no long-term strategy. It is mostly instant reaction to the current situation (what card in my hand, what can I do NOW to maximize income/VP). The reason is because you have to sell everything FAST.\n\nExemple :\n- the coal ore market is tight. It will be very JUICY to build a coal mine NOW. If you can't, you'll miss a ONE time opportunity because someone else will build this coal mine. Did you do something to influence the market ? No. Did you control if you have a mine card right now ? Probably not (you have to draw a joker which is one action less for more important things).\n\nIt is just of example of the numerous situations in which long term planning just don't work. And I find it very unsatisfying because the game somehow make luck and situation have more importance than strategy.\n\nI would love this game if it could completely remove the random elements. Clearly, drawing card may have been a sufficient mechanic for family game as Ticket to Ride but it is a poor mechanic for advanced strategy game.",
    "timestamp": 1603317600
  },
  {
    "username": "huffa2",
    "rating": 5.0,
    "comment": "Oct20: It feels a bit weird to give such a well designed game a 5 but this is based off the BGG descriptors for the ratings. I was happy to try it but it just isn’t my type of game. And now I’ve played it in actually really interested in the original version as this is a very Wallacey game but it’s very long and complex and hard to plan ahead. I think the original will be worth a try as it should look and feel more Wallacey.",
    "timestamp": 1602799200
  },
  {
    "username": "DeliriousWave",
    "rating": 5.0,
    "comment": "Needlessly complicated",
    "timestamp": 1601935200
  },
  {
    "username": "Juulhub",
    "rating": 5.0,
    "comment": "I played this game one time and it was pretty fun. It felt easy to pick up and some cards/paths felt counterintuitive.",
    "timestamp": 1595023200
  },
  {
    "username": "Mrwright321",
    "rating": 5.0,
    "comment": "I really wanted to like this game as it looks fabulous but it's just a bit too fiddly for my liking. I don't mind a complex game but this one felt unnecessarily so.",
    "timestamp": 1592949600
  },
  {
    "username": "brokasaphasia",
    "rating": 5.0,
    "comment": "Age of Industry is better",
    "timestamp": 1582671600
  },
  {
    "username": "Ashavan",
    "rating": 5.0,
    "comment": "Intro: Jason Taylor",
    "timestamp": 1580943600
  },
  {
    "username": "Immaterial",
    "rating": 5.0,
    "comment": "This game is ok. It feels that the rules are lacking some elegance in several points.",
    "timestamp": 1579906800
  },
  {
    "username": "farne123",
    "rating": 6.0,
    "comment": "Less fluid than the black edition.",
    "timestamp": 1762124400
  },
  {
    "username": "sad366",
    "rating": 6.0,
    "comment": "Too many little nit-picky rules. It's fine, but I always get frustrated when I play it. Wish it was a little more intuitive and elegant in its design. I can see why people like it - my group loves it - just not my favorite.",
    "timestamp": 1762124400
  },
  {
    "username": "Rob Doupe",
    "rating": 6.0,
    "comment": "Took another run at Birmingham after hitting 20+ plays of Lancashire. Confirmed that for our tastes, it's worse in every way. A frustrating, lengthy, overly procedural experience that offers less interaction than the original. Lowered rating to a 6. I'm surprised more gamers new to the system don't bounce off Birmingham.\n===================================================\nFinally got this to the table after almost a dozen plays of Lancashire.\n\nBirmingham is much fiddlier. Much more difficult to put together a sequence of useful actions. The addition of beer, and the wonky benefits of manufactured goods and pottery, make for a more uneven and frustrating experience all around. That’s not sour grapes - I won handily.\n\nPresumably, Birmingham is intended to refresh the challenge for people who have played out Lancashire. Fair enough. But I won’t be coming back to it any time soon - Lancashire isn’t a lifestyle game for me, so at 6-7 plays a year I expect I have years of play before it starts to get stale. I doubt Birmingham sees the table again in that time.",
    "timestamp": 1760652000
  },
  {
    "username": "Esqar",
    "rating": 6.0,
    "comment": "Setup: Extremely hard to setup and start\nLearning: Hard to learn\nGame Design: Well designed, with multiple integrated mechanics and a lot of replayability\nArt: Very stylized, finding towns are a challenge\nSocial: Not really social, people play alone, don't even have to be here\nCompetitive: Can be competitive, but more, can create a lot of achievements as there are probably 100s of strategies that work\nScoring: Not too hard as most of the stuff is scored during game",
    "timestamp": 1760306400
  },
  {
    "username": "winorlose1",
    "rating": 6.0,
    "comment": "It was a good game. Personally I don't know how it has the top spot on BGG though. I've played plenty of better games.",
    "timestamp": 1759528800
  },
  {
    "username": "logopolys",
    "rating": 6.0,
    "comment": "I've never played any Brass game, and while I would have rather played OG Brass first, I did take advantage of an open seat at a table of the current rankings leader for this site. Much of this game is what I would have expected from a Martin Wallace game: two actions per turn, punishing economy, and precise theme. I'm going to preface the rest of this with a few contextual caveats. First, this is a first impression after a single play. Second, I don't think our teach was particularly good, which I've noticed before from this person (who is otherwise perfectly nice). And third, I did terribly. So with that understood, I really didn't care for the game. I definitely understood what the puzzle was supposed to be, especially with how you could set up select infrastructure during the canal phase to best maximize income and victory in the rail phase. I understood how the shared infrastructure could be a blessing and a curse all at once. And I understood how there was a tight scarcity for resources that could sometimes be mitigated through planning and a dash of luck. But I was just miserable the entire time. The restrictions provided by the game weren't interesting for me. The economy was both brutal and brittle, and didn't really allow for a change to recover from early mistakes. A lack of recovery usually isn't a problem for me, but when your game is decided in the first hour of a three hour game, there's not much to say for the game. A game this brutal needs either guardrails, brevity, or dedication; none of those are really available for a pickup game at a weeknight meetup. I definitely will play this again, since even just this bad experience was enough to show me how to have a better time next time. But my overall impression of the game is that it's probably really fun for people who want to play it a lot, and I don't think I'm there.",
    "timestamp": 1759269600
  },
  {
    "username": "STERMI",
    "rating": 6.0,
    "comment": "",
    "timestamp": 1758837600
  },
  {
    "username": "Verling86",
    "rating": 6.0,
    "comment": "OK - No need to ever own however.",
    "timestamp": 1758578400
  },
  {
    "username": "Odukla",
    "rating": 6.4,
    "comment": "Network/Hand Management/Tech Tree",
    "timestamp": 1758232800
  },
  {
    "username": "data00",
    "rating": 6.0,
    "comment": "양상이 더욱 역동적이게 탈태한 브라스.",
    "timestamp": 1757887200
  },
  {
    "username": "mesenius",
    "rating": 6.0,
    "comment": "Competition for spots is not as interesting in this one. Would rather play the original.",
    "timestamp": 1757714400
  },
  {
    "username": "dimproark",
    "rating": 6.0,
    "comment": "Не фанат евро, это могло быть неплохо, не против сыграть в нее снова, если что, но сам предлагать ее не буду. И да, это точно не первое место BGG.",
    "timestamp": 1757541600
  },
  {
    "username": "uoonsek1",
    "rating": 6.0,
    "comment": "so so",
    "timestamp": 1757455200
  },
  {
    "username": "Jim_Preston",
    "rating": 6.0,
    "comment": "Thoroughly average.",
    "timestamp": 1756418400
  },
  {
    "username": "Jclancy15",
    "rating": 6.0,
    "comment": "I don't really like how this game handles networks and the reliance on cards to provide positional character to player positions. But network building and economic games are fun so it's still a good time.",
    "timestamp": 1756332000
  },
  {
    "username": "Tyson2015",
    "rating": 6.0,
    "comment": "Have real mixed views on this game. I only own four other economic games and this one would be the lowest rated of the five. Venetia, John Company, Infamous traffic and the Dutch Golden age were far more engaging games on compelling topics. Their components were about equal to this game in quality. This games rules were abit fiddly and required constant review. The theme was unique and building a serious of interconnected industries has its merits in terms of game play. It kept my interest to a degree but it also at times felt like a tedious affair that often became repetitive. You build coal plants, then an ironworks and connected them to a network. Then you build factories and attempt to sell them , but wait you need beer to do so. After a few rounds I started to think is this it? Why is this game rated number one? It is OK but number one? So overall I was not that impressed with this one. I have rated close to 650 games here on bgg and have been playing mainly wargames for 45 years and found this one to be one that was costly and from a cost benefit viewpoint expensive. Compare it to John Company on the east India companies economic take over of India. Much more involved, better historical theme and far more player interaction. Far better value when you consider the amount of playing time you get out of John Bull.",
    "timestamp": 1756159200
  },
  {
    "username": "GypoNolan",
    "rating": 6.0,
    "comment": "I really dislike the graphic design, it's so dark. You wouldn't be able to play this im natural lighting at all. It's also too long for me and I don't think I appreciate the large teck tree. I enjoyed my half game of the original Brass more, both in terms of the visuals and the rules. Birmingham gives me a pretentious vibe.",
    "timestamp": 1755554400
  },
  {
    "username": "lowkeyloki",
    "rating": 6.0,
    "comment": "The friendly interaction (regarding resources) is really cool but everything else is meh to me. Board is hard to read, theme feels barely connected to the game, cards are ugly and not really needed.",
    "timestamp": 1754776800
  },
  {
    "username": "boardmathias",
    "rating": 6.0,
    "comment": "Although being a good game Brass has its problems. It has a few detailed rules, people tend to forget about. Less complexity would have been better here. Also I dislike the random elements in the cards, which limit you actions somewhat.",
    "timestamp": 1754431200
  },
  {
    "username": "Hinmatt",
    "rating": 6.0,
    "comment": "The look of the game is not very appealing to me, but the industrial theme with a historic touch is interesting. It's a long game with a lot of things going on. Therefore, some players' considerations take some time.\nI prefer less \"heavy\" and less \"euro-style\" games that look more appealing and are easier to learn and master.\nThis is not a bad game, but I don't really have much fun playing it.",
    "timestamp": 1754344800
  },
  {
    "username": "ske19",
    "rating": 6.0,
    "comment": "This game seems to be overhyped.\n\nThe game is card driven so your choices depend on the hand at the given moment which isn't necessarily bad per se but you can't really create a long term plan - your decisions are ad hoc and you shift your goals as you get new cards. The set up is incredibly tedious with a lot of chits that mostly end up not being used at all like the ceramics past level 1 or higher level manufactured goods so it feels like a waste of time.\n\nFlipping the tiles is super satisfying I'm not going to lie. The production is also great.\n\nTraded in for BUS.",
    "timestamp": 1753912800
  },
  {
    "username": "amazinga",
    "rating": 6.0,
    "comment": "Quite interesting, but design makes it hard to understand sometimes. Maybe it became better after several plays. Initial impression very mixed",
    "timestamp": 1753740000
  },
  {
    "username": "KingBong",
    "rating": 6.0,
    "comment": "It’s good, but I don’t know why it’s so popular.",
    "timestamp": 1752789600
  },
  {
    "username": "Weirdsalmon",
    "rating": 6.4,
    "comment": "6.4/10: This did not live up to the hype at all for me. The network system is unnecessarily confusing like I was warned. The rest of gameplay was fine, I was not particularly excited by it.\n\nThere were no silly moves that I could make and once again it comes down o the fact that I would like to play a different long crunchy game.",
    "timestamp": 1751925600
  },
  {
    "username": "Hfufj748",
    "rating": 6.0,
    "comment": "03/04, 02\nreco-npi, reco-bw, reco-byp, no-alol",
    "timestamp": 1751839200
  },
  {
    "username": "aethy",
    "rating": 6.0,
    "comment": "Brilliant design. High level of strategy and interaction. However, the game overstays its welcome by an hour or two (we played 6h with 4p, for two of us it was the first time) and I'm not convinced playing time will go down by a lot next time. In most games, I can plan my turn in advance, and having to change my plans moderately when it's my turn in about 1/4 of the times. In this game, the board state can change drastically with every turn, and there are just so many options to reevaluate.",
    "timestamp": 1750716000
  },
  {
    "username": "Zorlk",
    "rating": 6.0,
    "comment": "It's obviously quite good, and I'm usually willing to play. Can be long and unforgiving to early mistakes.",
    "timestamp": 1749420000
  },
  {
    "username": "einpivo74",
    "rating": 6.0,
    "comment": "I've played both, and I think the original is way better than this new version. I love it when you struggle with money, and you feel that tension and frustration during the turns, watching other players do what you've been wanting to do for several rounds.\nIn the new version, money isn't an issue, and you can turn your cards into 'jokers' to build anywhere on the board, and you can keep resources for yourself, without having to share them with others.",
    "timestamp": 1749247200
  },
  {
    "username": "paulastoria",
    "rating": 6.0,
    "comment": "good game",
    "timestamp": 1748469600
  },
  {
    "username": "jkach91",
    "rating": 6.0,
    "comment": "(2025.05.27), played it again with Aps and I think the flow of the game came together a little better for me. I could see how certain industry tiles would benefit everyone and make my particular engine work a little better. Some of the rules were hard for me to remember so I'd like to try playing again with more players or just play again soon so I can try some other strategies.\n\nAll my plays have been 2 player with Aps. I'd like to try this with more players because of all the wonderful things people have to say about this. I'm having a hard time putting the pieces together for it to feel as intuitive as it does to others. I think if I were to play a 3-player game, I might feel that interactivity more.",
    "timestamp": 1748383200
  },
  {
    "username": "Samuel Vriezen",
    "rating": 5.5,
    "comment": "Well done for reaching nr. 1 but, of course, Lancashire is better and y'all know it",
    "timestamp": 1747864800
  },
  {
    "username": "emoprzemoc",
    "rating": 6.0,
    "comment": "Probably the best game that only gets a 6/10 from me. I was astonished by the design when I first played it and I continue to praise it up to now. It's so clever, it doesn't need expansions, it has great level of player interaction though it's sometimes funnily unrealistic with the theme (you need a connection to get some coal, but iron is something you can pick up everywhere!).\n\nBut... I. Hate. Setting. It. Up. Lots of tokens that you need to sort and then you have to make a stack out of them in a right order... I don't know why, but it feels so annoying, more annoying than other games where the setup even takes more time. But here, I just can't get over it. Sorry.\n\nIf my rating wasn't according to BGG's suggested rating system of 'how likely I'd play it' and I was just rating how GOOD the game is, I'd give B:B 9/10... or even more.\n\nI'd like to play the OG 'Brass'/'Lancashire' some day to compare them.\n\n+ hard and simple at the same time\n+ AWESOME level of interaction and FORMS of it\n+ a lot may happen between your current move and your next one\n+ the game feels complete, like, there are no gaps for any unnecessary expansion\n+ it fits in such a thin box! saves lots of space on a shelf\n\n\n\n- painful setup\n- it's hard because of some concepts (network!) and mostly because of special microrules - about how many buildings you can buy in this phase and in that phase etc., what can you doif you don't have anything, etc.\n- i feel like we screwed a few games because someone didn't play their cards properly or because they were wrongly dealt to players lol\n- i just usually prefer more lightweight games these days\n- but seriously, this setup is not that LONG, but is so ANNOYING",
    "timestamp": 1747692000
  },
  {
    "username": "sirmaroc",
    "rating": 6.0,
    "comment": "Would rather play Castles of Burgundy.",
    "timestamp": 1747346400
  },
  {
    "username": "MorelliBuendia",
    "rating": 5.5,
    "comment": "After a while I sold this and I bought the original. If Lancashire didn't exist, this rating would higher. The problem is, they made a worse version of a good game.\n\nIt is more convoluted than Lancashire, with more little bits and adapted to modern eurogamers. The game is more forgiving. No matter how bad the situation is, you can always do something, it is not nearly as tight as the original. Second era is just everyone placing connections and beer. The variable setup is nice, but Lancashire is superior in every other aspect.",
    "timestamp": 1745359200
  },
  {
    "username": "Markuson",
    "rating": 6.0,
    "comment": "Not my cup of tea, but I can see why people love it.\nVery euro, but also very interactive. First plays can be very punishing for new players.\nIt is easy to teach, but there are many nuances difficult to remember and spot when playing. It can cause AP very easily. I would not seek it but I can play it again",
    "timestamp": 1744581600
  },
  {
    "username": "VoteForPedro",
    "rating": 6.0,
    "comment": "There is a steep learning curve and difficulty wall. The game itself is easy to teach, but the strategy is deep. Shared network building - the player interactions with using each other's networks and resources also comes into play. It can be quite merciless with player interaction, knowing when to build industries, link them, and sell goods. It can be quite mean with people cutting each other off, taking spaces, routes, or resources (even if not directly hurting your opponent). A lot of player interaction and reacting to what others are doing. Going to get some more plays in to see if it's the right fit for me.",
    "timestamp": 1743717600
  },
  {
    "username": "bazyliszek10000",
    "rating": 6.0,
    "comment": "A good game, but it's not a 10/10. The game can be both tactical and, for players who know it well, strategic. There is little randomness, a little resulting from the cards, but it's not DB, so the cards are equal and concern what and where we build, which we have a big influence on. During the game, there are so many variables resulting from the expansion of cities that it can't be called repetitive. However, there are a few things that irritate, e.g.: destroying canals and first-level buildings. I know what it's for, what you can do with it, how to use it, why it's mechanical, but I don't really like that halfway through the game, we start it from the beginning. The rules are also a bit pieced together, sometimes resources teleport to us, e.g. beer, other times we have to have a network of connections to deceive them. Mechanically, it works well, we have different resources, we use them differently, you can be more creative, but when it comes to consistency and remembering the rules, it's so ehhhhh, weak. I will play, I won't refuse, I will propose, but I know games that I like more and are more consistent mechanically and atmospherically, where the rules are more fluid.",
    "timestamp": 1743631200
  },
  {
    "username": "chimusicguy",
    "rating": 6.0,
    "comment": "It's a good, clean game. Works well at two players. The only differences in replay are the random cards you get. We'll keep it and probably play again, but it doesn't amaze us.",
    "timestamp": 1743372000
  },
  {
    "username": "mtross",
    "rating": 6.0,
    "comment": "I need to play some more. The gameplay is almost smooth, but the weird idiosyncrasies and rules exceptions (as much as they are presented as thematic) detract from this. In general Birmingham seems to be the preferred game, but it sounds like Lancashire is the cleaner of the two (despite being an older design). I wish Age of Industry would get a reprint as, to my tastes, it seems like the best rule set of the bunch.\n\nUpdate: Really don't get the love for this game. The whole thing is a bit clumsy. It feels dated in all the wrong ways, despite Roxley's coat of paint. I know Roxley are working on another edition. Maybe I'll give it a go, but we'll see.",
    "timestamp": 1743289200
  },
  {
    "username": "AhabXXX",
    "rating": 6.0,
    "comment": "Best strategy game ever? I don't think so, but it's absolutely a solid game.",
    "timestamp": 1742857200
  },
  {
    "username": "Geekishgamer",
    "rating": 6.0,
    "comment": "This game to me seems like a more complicated and less fun version of Catan. The building of railways and canals reminds me of building roads in Catan. However, this game has allot of fiddly rules that I didn't really like. I wasn't too keen on the theme either. For a competitive territory and resource grabbing game, I much prefer Scythe of even Catan. I gave it 3 play throughs, and we all agreed that we didn't really care to play again, so I ended up just getting rid of it.\n\nThis game staying at number 1 for so long makes me question the validity of BGG's rating system. The game to me is just ok. There are so many better games that I would rather play. Don't believe the hype; there are much better games out there!",
    "timestamp": 1741820400
  },
  {
    "username": "Creativenothing",
    "rating": 6.0,
    "comment": "I haven't felt like playing brass again. It's a highly praised game, but to me it lacks excitement. There are no big plays you can do, everything is just slowly working towards your goal.\n\nThe cogs are set in motion, and theres often little you can do to change up your strategy/tactics, it's not that your decisions don't matter, but they do feel like they lack weight.\n\nIf you like making lots of smaller, low impact choices, working methodically and consistently, then this game might be for you.",
    "timestamp": 1741042800
  },
  {
    "username": "Ariley",
    "rating": 6.0,
    "comment": "Good game, but not so much",
    "timestamp": 1740956400
  },
  {
    "username": "dunedragn",
    "rating": 6.0,
    "comment": "8.5",
    "timestamp": 1740697200
  },
  {
    "username": "ASihm",
    "rating": 6.0,
    "comment": "quite complex, but unique theme.",
    "timestamp": 1740610800
  },
  {
    "username": "HowitzerBug",
    "rating": 6.0,
    "comment": "The theme is a little dry, but the mechanics are interesting. It's strange having a semi-permanent strategy that you have to adapt over time. Quite a deep game I feel if you were to play multiple times, but I'm not sure I'd play enough to get to that point.",
    "timestamp": 1739919600
  },
  {
    "username": "dopebones",
    "rating": 6.0,
    "comment": "I appreciate the design changes here, this is more forgiving for sure than the original version of Brass. The beer for incremental shipments and absence of the foreign market with its random demand makes shipping all yours goods at the same time a less dominant strategy. Also the replacement system for doing wild locations and industries makes the game more approachable. I initially didn't like this version, but after several plays of both this one might be more fun than the original -- it is easier and perhaps a bit faster too. I am not very good at this game yet always play with high-skill players, so in this version I can play more competitively and keep better pace with them than in the original version where they crush me with their superior intellects.",
    "timestamp": 1739746800
  },
  {
    "username": "Cicerone",
    "rating": 6.0,
    "comment": "Overly complicated and hard to grasp. Might need more plays",
    "timestamp": 1739142000
  },
  {
    "username": "Razorkale",
    "rating": 6.0,
    "comment": "Good, but is the bad Brass.\n\nLancashire >>>",
    "timestamp": 1738278000
  },
  {
    "username": "cheppsn",
    "rating": 6.0,
    "comment": "I'm not too keen on simulations. Played this with a friend who acquired it and it took us about 2.5 hours to set up and get the rules straight. Then we played a round. In the end we got for most stuff how it works (although I think the rule book is far from good, some contradictions and not linear), but I can see how people like the game. The mechanics are good, and the economical constraints are well modeled, the look & feel is okay, there is a lot of variety, and players have a lot of freedom when developing, i.e. to follow an own strategy. Certainly a game that requires many plays to get the most out of it. Requires concentration and - as mentioned - has quite a steep learning curve. I will play again when asked, but would not suggest it, except for persons who really are into economical simulation games.",
    "timestamp": 1738105200
  },
  {
    "username": "luminous48",
    "rating": 6.0,
    "comment": "Very interesting as we were figuring the game out, a couple of players at the table tripped over on what they can/cannot do, which is always a little frustrating. Now that we've got a couple of games under our belt, none of us are really keen to go back to further explore it. I am not sure it has the depth to reward a ton of repeated play. From game to game, I found myself always reaching the same unexciting destination of flipped tiles & tracks. I understand the whole point of the game is to build tracks and flip tiles, but it is just not fun for me beyond the 'figuring out' phase of the game.",
    "timestamp": 1738018800
  },
  {
    "username": "Alco1971",
    "rating": 6.0,
    "comment": "Ok, not an elegant euro, which is what I like. Reminds me of power grid, but not nearly as good. Play power grid instead for a superior experience",
    "timestamp": 1737759600
  },
  {
    "username": "Darage",
    "rating": 6.0,
    "comment": "Pain in the ass to learn by yourself, but quite enjoyable after that until you figure out the \"winning\" tactics, then it gets boring.",
    "timestamp": 1736204400
  },
  {
    "username": "Aladin1k1",
    "rating": 6.0,
    "comment": "Strategy, Economic",
    "timestamp": 1735772400
  },
  {
    "username": "llopis",
    "rating": 6.0,
    "comment": "Only one play, but it seemed like a different map of the original Brass. I'm not sure it adds anything worthwhile and the values for income as you go up in levels is really weird.\nIt would probably be an 8 but I'm knocking a whole point off for the absolutely HORRIBLE map (either side).",
    "timestamp": 1735340400
  },
  {
    "username": "tursel",
    "rating": 6.0,
    "comment": "I can understand a niche appeal - but I can't fathom the mass appeal. I know BGG loves heavy games, but I'm still surprised how popular it is.\n\nIt's ok, not really my style of game. Will gladly play if someone wants, but I would not suggest it myself.",
    "timestamp": 1735254000
  },
  {
    "username": "ByAsKa",
    "rating": 6.0,
    "comment": "Bof, très déçu du \"meilleur de strategie BGG\" le jeu est bon mais est clairement survendu de meilleurs jeux existent selon moi.",
    "timestamp": 1735254000
  },
  {
    "username": "sahilrhapar",
    "rating": 5.5,
    "comment": "Great game. Theme is done almost perfectly but a little too boring for me. I always look for alternatives.",
    "timestamp": 1734476400
  },
  {
    "username": "danvand",
    "rating": 6.0,
    "comment": "Overall 'good' game. Love the theme and art. Fairly easy to learn. I do however strongly disagree with the game being ranked nr 1 overall and nr 1 in strategy. My main criticisms is that it's just too low in replayability and it lacks depth and variety. You get bored of it too quickly and each play is quite similar to the previous ones. I can easily name a handful of strategy games that are far better and which I think outrank Brass Birmingham with ease: Terraforming Mars (especially with all expansions), Through the ages, Scarface 1920, Istanbul, to name a few",
    "timestamp": 1732575600
  },
  {
    "username": "Wiitus",
    "rating": 6.0,
    "comment": "280zł(220zł)",
    "timestamp": 1731452400
  },
  {
    "username": "dakotamassie",
    "rating": 6.0,
    "comment": "It's too long, it's ranked #1 on bgg which is insane\nBrass lancashire is way better",
    "timestamp": 1729807200
  },
  {
    "username": "mattlowder",
    "rating": 6.0,
    "comment": "Ugly, dry, complex, overly-long game for people who like math and spreadsheets and efficiency puzzles. Over-praised, though objectively well-designed, but I'd rather play Great Western Trail, Teotihuacan. It is just not fun. It's un-fun. I'd never pick this off the shelf. Definitely not a top 100 game by almost any other metric outside of the small, frothing cohorts of the BGG faithfuls.",
    "timestamp": 1728424800
  },
  {
    "username": "DarkJjay",
    "rating": 6.0,
    "comment": "Should not have bought this, it's not for me",
    "timestamp": 1727647200
  },
  {
    "username": "Ferran Renalias",
    "rating": 6.0,
    "comment": "Not my cup of tea.",
    "timestamp": 1726956000
  },
  {
    "username": "Ghost6Fire",
    "rating": 6.0,
    "comment": "The strength that this game has synergy type of environment building atmosphere, where one person to can provide raw materials for another person to use to craft a product while both players score points. Other optional stuff is buiding networks in manufacturing routes, or importing materials at a higher cost from outside the game map, or refining your factories to make more of the same stuff. There is also optional to use \"loans\" to gain some quick money at a cost, but it's a risky action to take... the risk can either be \"expert\" move or a huge mistake. This game is long, and has a \"medium\" level of replayability. I would say there is alot of combinations of future gameplay with \"experienced\" players but love this type of theme and like refining their strategy, but for me it will get really boring when you play it way too many times. There is no flavor text or events, or whatever. It's hard to believe that is the #1 game for overal rank and strategy. There is way more replayability in other games like Twilight Struggle, Gloomhaven, or Pandemic Legacy. They also has more theme and look ALOT nicer. This game seems way too long\n\n\nThe theme is boring and ulgy to look at. Ark Nova or Through the Ages has a more fun theme for euro games.",
    "timestamp": 1726437600
  },
  {
    "username": "wagglybean",
    "rating": 6.0,
    "comment": "This one was just not for us. As a Brummie I wanted to love it but it's just too dry for our tastes. Sold.",
    "timestamp": 1725660000
  },
  {
    "username": "GarfieldKlon",
    "rating": 6.0,
    "comment": "#17\nBGExpansions in Box\n\nNot sure what I should think about this after 1 play. It took us 3 hours to finish with 3 players, rules explanation not included...\nTowards the end it's just about who can lay more train tracks?\n\n\n\nTheme:           I didn't feel it\nGameplay:        Ok\nInteraction:     Fighting for the spots\nArtwork:         Ok\nLuck:            Not sure\nStrategy:        Not sure\nComponents:      Good\nPlay duration:   Too long\nEasy to teach:   Nah\nRules quality:  not read\nSetup time:      Ok\nNo downtime:     Ok\nReplay value:    Different strategies",
    "timestamp": 1724450400
  },
  {
    "username": "VadymH",
    "rating": 6.0,
    "comment": "Interesting. No interest in playing often",
    "timestamp": 1723672800
  },
  {
    "username": "aledrugo1977",
    "rating": 6.0,
    "comment": "It's actually a very good game but I honestly never play it.... I prefer the original Brass Lancashire which I play whenever I can and every time is a joy: in my opinion it is a masterpiece.\n\nBirmingham is easier and less punishing. I recognise that it is an excellent alternative within reach of a wider audience.",
    "timestamp": 1723586400
  },
  {
    "username": "threhane",
    "rating": 6.0,
    "comment": "A good network building resource management game.",
    "timestamp": 1723413600
  },
  {
    "username": "LittleLamb4u",
    "rating": 6.0,
    "comment": "The games is just fine. I wouldn't mind playing it but not going to seek it out. The card play is a bit wonky.\n\nThe Brass fan-boys are so obsessed with this game that they tank ratings of other games just to boost this one...sad.",
    "timestamp": 1722981600
  },
  {
    "username": "NoodleyOne",
    "rating": 6.0,
    "comment": "Good game in it's own right, but it felt markedly inferior to Lancashire. I don't necessarily see what is added by increasing the number of goods and replacing port tiles and the foreign market with beer and randomized delivery locations.",
    "timestamp": 1722376800
  },
  {
    "username": "tymmaaaay",
    "rating": 6.0,
    "comment": "Brass reminds me of pizza Margherita. Pizza Margherita relies on a few simple ingredients in balance and all of high quality. It needs to cook just right, it is easy to burn and easy to undercook. There is beauty in simplicity and balance. I don’t like Margherita pizza. I like pizza with tons of toppings, I like pizza with unusual toppings. Pizza with caramelized onions, goat cheese, and arugula? One of the best things I’ve had the pleasure of eating!\nBrass is a good game and I understand why it is a lot of peoples’ favorite game. Everything is balanced, there is a lot to think about. Small and subtle variations matter.\nBut I prefer a different experience. I have young kids at home, and I only manage a game day once every few months. I’m more interested in drama and long shot gambits that tell exciting stories.\nI bought this once and traded it away. Then acquired a copy again a few years later…I might trade this copy too and leave this as a note to myself that this is other people’s favorite game, but it won’t be mine.\nIf you’ve read this, I hope you find it useful, in one way or another.",
    "timestamp": 1722204000
  },
  {
    "username": "criticalcomma",
    "rating": 5.9,
    "comment": "Respectfully, BGG, y'all need to calm down about this game, haha. Was excited to play it because it's been #1 for so long; it was a pretty lengthy teach, which had some of our players struggling to focus. The mechanics are interesting, but so cascadingly myriad that even our experienced board game players were struggling with AP - there were so many possibilities and it was so unclear what moves might ripple or chain or benefit. Keeping up with scoring was a little tricky too. I like the overall theme a lot, and the mechanic of drawing/discarding location cards to take actions, but it was just too heavy for me to see our group tabling it with anything resembling regularity.",
    "timestamp": 1722117600
  },
  {
    "username": "randomphantom",
    "rating": 6.0,
    "comment": "I'm sure it's a good game but it doesn't seem to connect to me. It's easy t learn and very hard to master. The mechanism with the two different eras is fascinating and annoying at the same time and makes planning ahead really difficult. Although I generally enjoy brain teaser games, this one makes my brain hurt really badly. I may be persuaded to play it once in a while because I know all my friends really enjoy it, but it's definitely not one of my favourites.",
    "timestamp": 1722117600
  },
  {
    "username": "Jixashi",
    "rating": 6.0,
    "comment": "Nice theme, nice components, amazing mechanics. I love the decisions, I love the preplanning, I love building up to final scoring. Some rules might be missed on first games though.",
    "timestamp": 1722117600
  },
  {
    "username": "malittle",
    "rating": 6.0,
    "comment": "玩完唔知玩乜，get唔到",
    "timestamp": 1722031200
  },
  {
    "username": "Loddar78",
    "rating": 6.0,
    "comment": "Everybody loves it, but for me it´s unspectecular. I also don't like the style and setting. For me just an \"OK game\".",
    "timestamp": 1721772000
  },
  {
    "username": "Golden Aegis",
    "rating": 6.0,
    "comment": "Didn't think I would like this! The production is what really sucked me in, and then I stayed for the thinky gameplay,",
    "timestamp": 1720908000
  },
  {
    "username": "Desigual",
    "rating": 6.0,
    "comment": "So rich in terms of strategic options and tactical decisions, while being rather simples when it comes to the rules. Adding the high amount of players interaction and the random merchant tiles that gives replayability to the game that Lancashire don't give you. Lancashire is more punishing and tight while Birmingham is more forgiving and variable.\n\nSold my Kickstarter Edition.\n\nbest with 4",
    "timestamp": 1720562400
  },
  {
    "username": "Vroenis",
    "rating": 6.0,
    "comment": "Too long & too many rules for me but it's a good game.",
    "timestamp": 1720044000
  },
  {
    "username": "MatthewGZ",
    "rating": 6.0,
    "comment": "There is a place for this game. It's a super crunchy euro with opportunities for fantastic long-term play and varied strategies derived from an interconnected network of resource management and card play... and hoo, boy, did it not work for our game group. They just couldn't wrap their heads around just about any element, and even trying again just at two, it felt like there was a LOT to keep track of. Unlike something like Ark Nova or Endless Winter, the art and theme didn't suck us in, so it just felt crunchy and a bit too much like work for us. I can definitely see the appeal of the game, and I'd honestly play it again, and happily... but it's not one we need to own, and isn't one we'd table regularly if we did. (And I genuinely don't see how this is the highest rated BGG entry, but what can you do.)",
    "timestamp": 1719439200
  },
  {
    "username": "Roleplayer",
    "rating": 6.0,
    "comment": "Someone in Microsoft play group has it.",
    "timestamp": 1719007200
  },
  {
    "username": "kyhre",
    "rating": 6.0,
    "comment": "Returned to this in 2024 after a few year pause. It’s still good. I find the network building satisfying and thought provoking. The markets of iron and coal are fascinating and fun.\n\nI find the variety of the industry tiles on the player boards overwhelming and annoying.\n\nI really dislike the point salad scoring.",
    "timestamp": 1718316000
  },
  {
    "username": "Elty_",
    "rating": 7.0,
    "comment": "A bit too repetitive",
    "timestamp": 1761951600
  },
  {
    "username": "Nonoku",
    "rating": 7.0,
    "comment": "2-4 B: 3-4\nW: 3.87",
    "timestamp": 1761606000
  },
  {
    "username": "lboucheron",
    "rating": 7.0,
    "comment": "English retail edition. Includes https://boardgamegeek.com/boardgameaccessory/306354/brass-bi...\n\nBox has moderate shelf wear and whitening, seen here:\nhttps://boardgamegeek.com/image/9176195/lboucheron\nhttps://boardgamegeek.com/image/9176197/lboucheron\nhttps://boardgamegeek.com/image/9176194/lboucheron\n\nThe previous owner glued together the Folded Space insert. I believe they put away the game components before the glue was fully dry, which led to a few pieces sticking and tearing when removed. All the damaged pieces I could find are shown here:\n\nhttps://boardgamegeek.com/image/9176196/lboucheron\n\nAll other components are in excellent condition. Cards are sleeved in premium sleeves.",
    "timestamp": 1761084000
  },
  {
    "username": "ygram",
    "rating": 7.0,
    "comment": "One play: Nice game, random location of selling points made half the map unused.",
    "timestamp": 1760911200
  },
  {
    "username": "wooloo1",
    "rating": 7.0,
    "comment": "I don't like beer.",
    "timestamp": 1760824800
  },
  {
    "username": "uzeeyo",
    "rating": 7.0,
    "comment": "It's a good game. Is it worthy of being #1? I don't think so but is definitely up there if euro is your thing. I enjoy playing but it would be rare for me to suggest out of my other games.",
    "timestamp": 1760306400
  },
  {
    "username": "Sidekicken",
    "rating": 7.0,
    "comment": "A solid game, I'm just not as excited about it as most other people seem to be. Bought at Essen Spiel '19.",
    "timestamp": 1760306400
  },
  {
    "username": "Aleogod",
    "rating": 6.5,
    "comment": "Digital Version on Steam is also very good!",
    "timestamp": 1759356000
  },
  {
    "username": "Bempa24",
    "rating": 7.0,
    "comment": "Played this to few times to make a fair review. I do feel it is one of the ultimate euroes. The few times I have played I have tried different focuses and it seems to work well.",
    "timestamp": 1759269600
  },
  {
    "username": "Savcore",
    "rating": 7.0,
    "comment": "felt it was a lot of effort to set up rules for a game thats 1-1.5h. Played it 3 times. Ended to early for me. Dont like when it is limited by turns to end game.\n\nCant believe this is nr one at bgg for so long. Feels like I missed what was so great with it...",
    "timestamp": 1759010400
  },
  {
    "username": "yeknom02",
    "rating": 6.5,
    "comment": "Slightly inferior to the original (Lancashire). The game offers some extra dimensions and enjoys more popularity. Would play it with few complaints if no one is up for its sibling, or a more interesting and interactive economic euro. Serves as a good gateway drug for people to get into econ games.",
    "timestamp": 1758924000
  },
  {
    "username": "sairam71",
    "rating": 7.0,
    "comment": "Played it many times to try to see the hype and get into it. You work with what you have basically and I keep doing the same thing over and over again. Hard to move out of that script. I think you need other players who really understand the game to create some level of interaction.the coal beer iron transport rules are annoying.",
    "timestamp": 1758751200
  },
  {
    "username": "Eyesis",
    "rating": 6.5,
    "comment": "I would not choose it to play, but I would play it if it is choosen.",
    "timestamp": 1758751200
  },
  {
    "username": "DeFarmello",
    "rating": 7.0,
    "comment": "Most overrated game in this rating... Easy to play, no mechanics\nDissapointment for top 1, top-100, top-200 will be fair...",
    "timestamp": 1758232800
  },
  {
    "username": "Beefy79",
    "rating": 7.0,
    "comment": "Played Mike's Copy",
    "timestamp": 1758146400
  },
  {
    "username": "oscaresgil",
    "rating": 7.0,
    "comment": "It's fine, but it's expressiveness fades off quickly and the theme gets kind of boring over time.",
    "timestamp": 1758060000
  },
  {
    "username": "Qhorin",
    "rating": 7.0,
    "comment": "Really great improvements from the original - art and mechanics alike.",
    "timestamp": 1757541600
  },
  {
    "username": "arisep",
    "rating": 6.5,
    "comment": "The game is mechanically ok, but don't like this game type so much.",
    "timestamp": 1757455200
  },
  {
    "username": "yxd20250823",
    "rating": 7.0,
    "comment": "规则稍微有点复杂，上手有难度，没有想象的那么好玩",
    "timestamp": 1757109600
  },
  {
    "username": "Luisjoey",
    "rating": 7.0,
    "comment": "ok railed game",
    "timestamp": 1756936800
  },
  {
    "username": "HoserBelow",
    "rating": 7.2,
    "comment": "The turn order mechanic is amazing, but the rest of the game's systems and actions seem arbitrary. Though figuring them out is fun, the whole thing doesn't come together for me.",
    "timestamp": 1756850400
  },
  {
    "username": "Zouzou825",
    "rating": 7.0,
    "comment": "A bit dry, but OK fairly balanced game. Maybe it's because the game is currently no.1, so it's a bit overpriced.",
    "timestamp": 1756677600
  },
  {
    "username": "SleepyKei",
    "rating": 7.0,
    "comment": "2–4 Players\nCommunity: 2-4 — Best: 3-4",
    "timestamp": 1756159200
  },
  {
    "username": "Fjellplistre",
    "rating": 7.0,
    "comment": "Fun and highly strategic, but too little variation across games for my taste. Bored with the game after 4 plays. Even if more variation would mean more luck, I think I'd prefer that.",
    "timestamp": 1756159200
  },
  {
    "username": "Termino476",
    "rating": 7.0,
    "comment": "En lo de Azul",
    "timestamp": 1756072800
  },
  {
    "username": "emelvin",
    "rating": 7.0,
    "comment": "Too loose compared to Lancashire.",
    "timestamp": 1755986400
  },
  {
    "username": "DONALD65",
    "rating": 7.0,
    "comment": "It is a good game on a unique topic. Who knew that the Industrial Revolution could be such a great topic to game. Overall as a gaming experience I found it interesting. You take on the role of a industrialist who builds an industrial empire. The mechanics have a unique historical flair but are abit fiddly on your first game. It takes some time to internalize key game concepts. As a result I was constantly reviewing the rule book on my first plays. The components are way above average but one negative is the dark feature or shading. You will need good lighting to fully appreciate the art work. The game is a fairly expensive one but when you consider the amount of playing time it is rather reasonable in terms of entertainment costs.",
    "timestamp": 1755813600
  },
  {
    "username": "RippedFromTheCrypt",
    "rating": 7.3,
    "comment": "I don’t understand the hype. It’s fine but nothing unique. And a bit fiddly.",
    "timestamp": 1755727200
  },
  {
    "username": "Alfasto_Barker",
    "rating": 7.0,
    "comment": "One of very few games that everyone is happy to play.\n\nOpponents don't fully restrict your own plans although you must look out to slow down players doing too well.\nOnly game flaw is that its almost impossible to come back if you make a mistake. An allowance for more complex strategies wouldn't go amiss.\n\nThere's a fairly apparent first player advantage.",
    "timestamp": 1755554400
  },
  {
    "username": "BoardGaymesJames",
    "rating": 7.0,
    "comment": "\"Mechanics: 8: Strong - Well-balanced and fun.\nApproachability: 4: Challenging - Manageable but requires effort to understand.\nReplayability: 5: Average - Some variety, but it starts to feel the same. (Multiple Campaigns)\nTheme & Art: 6: Solid - Feels like it all belongs.\nEnthusiasm: 6: Moderate Interest - Generally open to playing when the mood strikes.\"",
    "timestamp": 1755295200
  },
  {
    "username": "ItsMagic",
    "rating": 7.4,
    "comment": "historic offering combining spreading sustaining diverse constructing risky continuously specializing convincing;\nTerra Mystica? favoured; favoured over Brass: Lancashire",
    "timestamp": 1755208800
  },
  {
    "username": "Lemem",
    "rating": 7.0,
    "comment": "Even though Brass: Birmingham isn't nearly as perfect as its predecessor, it does make some positive changes and is still a lot of fun to get to the table.",
    "timestamp": 1755036000
  },
  {
    "username": "MRomeo99",
    "rating": 7.0,
    "comment": "After a couple of plays, I like it. I think it can run a little long for what it gives you. It probably depends on who you play with. I'm not sure it deserves to be #1.",
    "timestamp": 1754949600
  },
  {
    "username": "KingAwesomeBGG",
    "rating": 7.0,
    "comment": "Played TTS",
    "timestamp": 1754776800
  },
  {
    "username": "Antch007",
    "rating": 7.0,
    "comment": "Nothing really special, like one of dozens of other euro economic games. Expectations where much higher",
    "timestamp": 1754258400
  },
  {
    "username": "yelske",
    "rating": 7.0,
    "comment": "Good, but not amazing.",
    "timestamp": 1753999200
  },
  {
    "username": "jacorg",
    "rating": 7.0,
    "comment": "Sold",
    "timestamp": 1753912800
  },
  {
    "username": "kivi2004",
    "rating": 7.0,
    "comment": "All Cards Sleeved",
    "timestamp": 1753480800
  },
  {
    "username": "mikhail_wind_rises",
    "rating": 7.0,
    "comment": "Классическая экономическая игра. Судя по рейтингу, игра хороша и нравится большинству. Но мне показалась достаточно однообразной, после примерно десяти партий стало скучновато. Я говорю про ощущение, будто делаешь одно и то же каждую партию. Многие говорят, что Брасс — великая игра. Ну да, вроде механики работают хорошо, но, чтобы игра была действительно великой, она должна быть лаконичной и при этом глубокой и разнообразной на сотни партий. У меня с разнообразием стратегий не сложилось. К тому же игра кажется затянутой, и это усиливает недостатки.\nПохвалить могу баланс и масштабирование игры на разное количество игроков, отличный продакшен и компоненты делюкс издания.\nЧастого желания поиграть в эту игру у меня не было, отчего игра отправилась на перепродажу",
    "timestamp": 1753048800
  },
  {
    "username": "zWobble",
    "rating": 7.0,
    "comment": "Fun but I feel like I know the optimal strategy so it’s just the same thing over and over.",
    "timestamp": 1751839200
  },
  {
    "username": "nanobastaddo",
    "rating": 7.0,
    "comment": "I usually used to think that the board was really dark. Dark for no reason and not really appealing. but if you wish this game was brighter, just go to see the brighter lancashire and then come here.\nwhen I look at lancashire I see that birmingham with this board actually gains more attitude. It is graphically more different from any other game about industrial revolution. or from any other game about networks and industries. those games that usually can appear similar one to each other at first (important) sight. Birmingham board for sure has an impact.",
    "timestamp": 1751666400
  },
  {
    "username": "KingAndy",
    "rating": 7.0,
    "comment": "Kann den Hype nicht nachvollziehen. Das Spiel ist schon ok (aber mehr auch nicht). Leider ugly af. Denke da ist die Zielgruppe so ü50.",
    "timestamp": 1751493600
  },
  {
    "username": "SWNGKD",
    "rating": 8.0,
    "comment": "It's a great game, would struggle to get consistent plays.",
    "timestamp": 1762470000
  },
  {
    "username": "AkuAdan",
    "rating": 8.0,
    "comment": "Great game!",
    "timestamp": 1762383600
  },
  {
    "username": "tatooinehermit",
    "rating": 8.0,
    "comment": "+ Engaging tactics and strategy\n+ Agonizing decisions and tradeoffs\n+ Tight economy\n+ Player interaction\n+ Climactic ending\n- AP prone\n- Finicky rules and fiddliness\n- Downtime",
    "timestamp": 1762297200
  },
  {
    "username": "Imsevimse",
    "rating": 8.0,
    "comment": "It’s Brass with a more-is-better approach: more buildings, more locations, more connections—and then beer. Less cutthroat and leaning toward a point-salad feel. The high rail scoring makes the rail era predictable, though some might see it as a more forgiving, flexible evolution of the original. Could rate higher, but I’d always pick Lancashire over this, which brings the rating down a bit.",
    "timestamp": 1762210800
  },
  {
    "username": "Samman13",
    "rating": 8.0,
    "comment": "Loaned to Connor Smith on 11/3/2023, returned 1/22/2024\nLoaned to Cade Loving on 3/16/2024, returned",
    "timestamp": 1762038000
  },
  {
    "username": "Connduit",
    "rating": 8.0,
    "comment": "2-4",
    "timestamp": 1761951600
  },
  {
    "username": "Rhythm_and_Blues",
    "rating": 8.0,
    "comment": "A crunchy and smooth euro. Certainly a bit heavy, but the game is a blast to play. I really need to play this one more. This game is another proof that hand-management is the best mechanism in gaming. The current king of BGG, it's definitely one of the best euros that I've ever played. The set up is a bit long, but it's all worth it. All the mechanics of the game shines through, and it's very engaging and fun to construct new \"buildings\" and deliver goods. And the beautiful artwork is just the cherry on top.\n\nThat being said, it does still feel a bit dry and less exciting compared to lots of other heavy euro games that I love. I personally enjoy A Feast for Odin, Kanban EV, and Great Western Trail a lot more. Maybe because the currency and numbers in those games are smaller and less math-y.",
    "timestamp": 1761692400
  },
  {
    "username": "rws2029",
    "rating": 7.5,
    "comment": "This is a very interactive game: players must look for ways to interfere with their opponents’ plans by blocking access to markets and resources. While that’s going on, you must somehow implement a plan of your own while factoring in all the ways your opponents could mess it up. The result is a fascinating but often frustrating game.\n\nThe art and graphics are too dark, even on the “daylight” side of the double sided board. This is too bad because the art is excellent. The dark shading is meant to be thematic by portraying the dirty coal smoke pollution of the period. It’s as if a dark grey filter is overlaid on the board but it’s so dark it's difficult to discern the features necessary for play without bright room lighting.",
    "timestamp": 1761692400
  },
  {
    "username": "BrutusA",
    "rating": 8.0,
    "comment": "Aesthetic: 1\nMechanism: 2\nInvolvement/length/fluid: 2\nReplayability: 2\nOther: 1",
    "timestamp": 1761519600
  },
  {
    "username": "Jeffs042",
    "rating": 8.0,
    "comment": "Theme is so great. I was born in Dudley and am very proud of our industrial heritage. This game is the best attempt to place the player at the heart of the industrial revolution.\n\nAfter playing a few games I realised it requires a lot of time investment to play and improve but having spent that time I really appreciate the nuance of this tight design. Exclusively played at 2 players.",
    "timestamp": 1761429600
  },
  {
    "username": "Har0ldinh0",
    "rating": 8.0,
    "comment": "Complex game with many strategies available. Great game of it's genre",
    "timestamp": 1761084000
  },
  {
    "username": "Dreadnaut87",
    "rating": 8.0,
    "comment": "Find this one a little harder to get my head around than Lancashire, but probably just because I don't own it.",
    "timestamp": 1760997600
  },
  {
    "username": "bluestem",
    "rating": 8.0,
    "comment": "For two players, it isn't our household first choice. But it's a really fun game to have in the collection and play with 3 or 4.",
    "timestamp": 1760911200
  },
  {
    "username": "Mr_Gre3n",
    "rating": 8.0,
    "comment": "Really enjoyed they game. It was challenging to set up your turns but it was fun. Played it with 2 others.",
    "timestamp": 1760738400
  },
  {
    "username": "BarFightBill",
    "rating": 8.0,
    "comment": "Best: 3-4\nOwner: Adam A",
    "timestamp": 1760738400
  },
  {
    "username": "MoochyMania",
    "rating": 8.0,
    "comment": "* Sleeved ✓\n* Custom Insert - I want one",
    "timestamp": 1760652000
  },
  {
    "username": "HaoTien",
    "rating": 8.0,
    "comment": "电厂的plus版，但是总感觉没有电厂那么简洁，刚开始玩会很容易村，多玩几把了会懂点他的设计意图",
    "timestamp": 1760565600
  },
  {
    "username": "Hokkus",
    "rating": 8.0,
    "comment": "DS",
    "timestamp": 1760565600
  },
  {
    "username": "david_os",
    "rating": 8.0,
    "comment": "Played at Mini Wellycon 2024. Very smart highly interactive and interconnected economic Euro. A bit dry but really interesting. Only played once and clearly it's the sort of game you need to play a few times to really get to grips with it. I wouldn't put it #1 on my personal list, but I can see how it's such a BGG hit.",
    "timestamp": 1760306400
  },
  {
    "username": "MoMahili",
    "rating": 8.0,
    "comment": "Keep",
    "timestamp": 1759874400
  },
  {
    "username": "JJGamePlayMaster",
    "rating": 8.0,
    "comment": "[Gracze] 2-4 (najlepiej 3-4)\n[Czas] 60-120m\n[Wiek] 14+\nS: Full\nI: No",
    "timestamp": 1759874400
  },
  {
    "username": "Marlharr",
    "rating": 8.0,
    "comment": "I enjoy this game for how interactive it is, even with two players. The rules are a bit fiddly but I do appreciate the thematic integration. Quite similar to Lancashire.",
    "timestamp": 1759701600
  },
  {
    "username": "a_joonas",
    "rating": 8.0,
    "comment": "Nothing beats Lancashire. Especially when the alternative takes longer, asks for less racing against opponents, and adds a new resource that often feels like extra math rather than an exciting new layer of interaction. But hey, it’s still Brass, and I appreciate the variety.",
    "timestamp": 1759701600
  },
  {
    "username": "parzi42",
    "rating": 8.0,
    "comment": "I am not a big fan of the theme, but the game mechanics are amazing. Hate to say it, but this is a must buy for every collection.",
    "timestamp": 1759615200
  },
  {
    "username": "halogen64",
    "rating": 8.0,
    "comment": "Keep",
    "timestamp": 1759615200
  },
  {
    "username": "mondauge",
    "rating": 8.0,
    "comment": "Nice variant of classic Brass. Not sure which one I prefer. Might be the old one but both highly appreciated.",
    "timestamp": 1759442400
  },
  {
    "username": "tjbizzle",
    "rating": 7.5,
    "comment": "I really like the \"feel good\" nature of this game. There's such a well-balanced element of competition and synergy with the other players. If I build beer for myself and you take it, it helps me get points! If you build a canal/rail where I wanted to, no problem! I can still use that connection later on. A brilliant game that I only don't rate higher because my other favorite games give me a better \"dopamine hit\". This game limits the awesome turns because you only do 2 things at a time.",
    "timestamp": 1759442400
  },
  {
    "username": "K_oroviev",
    "rating": 8.0,
    "comment": "Good game. It works great with 3 and four players. The rules for using resources can be confusing at first, but once it clicks it is great.\n\nThe beer makes it less interesting than Lancashire, and the more open map means there is less gameplay around blocking each other. However, the core gameplay about righty timing your actions and managing your cards is still here, and it is still excellent.",
    "timestamp": 1759442400
  },
  {
    "username": "Circe81",
    "rating": 7.5,
    "comment": "Brass: Brimingham est un très bon jeu, mais ce n'est pas non plus le meilleur jeu de tous les temps. Il est probable que son évaluation bénéficie d'un biais de conformisme, c'est le numéro 1 sur BBG donc il devient nécessairement excellent. Mais personnellement, je ne le qualifierais que de très bon, il ne suscite pas en moi l'excitation qui rend certains jeux exceptionnels.\n\nDe la même façon sa note de poids est grandement surévaluée, je m'explique : comme il est numéro 1, il attire un public curieux peu habitué aux jeux experts et comme c'est un excellent jeu d'introduction à ceux-là, il peut apparaître lourd et complexe à un public non averti. Mais en soi, les mécaniques du jeu sont simple et les actions très faciles à assimiler avec des stratégies plutôt commodes à mettre en place et lisibles. Il est assez facile de savoir ce que poursuit un adversaire. Reste alors à évaluer s'il est plus intéressant d'interférer avec son projet d'action ou plutôt de se concentrer sur sa propre stratégie, ou mieux encore de parvenir à faire les deux à la fois. Mais globalement le jeu reste d'une difficulté plutôt moyenne et même assez accessible (un nouveau joueur ne sera pas perdu comme devant un Dune ou un Narak).\n\nUne partie prendra deux à trois heures selon l'expérience des joueurs et leur rapidité d'exécution. La séparation en deux périodes avec une réinitialisation presque complète, à l'exception de quelques bâtiments de niveau II ou III est assez intéressante. Autre intérêt du jeu, on est rarement bloqué, avec un chemin d'action assez variées (tout en restant simples et aisées à prendre en main). Cependant, si un déséquilibre se fait, il sera malgré tout assez complexe à endiguer et parfois le vainqueur est connu six ou sept actions avant la fin.\n\nBref, un bilan globalement très positif, mais sans doute pas à la hauteur des promesses suscitées par ses notes et sa hype.",
    "timestamp": 1759442400
  },
  {
    "username": "rainbowflight",
    "rating": 7.5,
    "comment": "Network building. Lots of decisions to make. Lots of ways decisions impact the future of everyone else. Interesting and fun.",
    "timestamp": 1759442400
  },
  {
    "username": "GrzegorzPL",
    "rating": 8.4,
    "comment": "Since Nucleum is avaiable it fall from the strong postion of 9+ it had",
    "timestamp": 1759183200
  },
  {
    "username": "mjacobsca",
    "rating": 7.5,
    "comment": "Not as good as the original, in my opinion. It's still good (hence my 7 rating), but it adds a little bit more stuff that reduces some of the tension in the game. I'd happily play it, though.",
    "timestamp": 1759096800
  },
  {
    "username": "beaglestorm",
    "rating": 8.0,
    "comment": "New in Shrink, Deluxe Kickstarter with poker chips",
    "timestamp": 1759010400
  },
  {
    "username": "GoldenGilbert21",
    "rating": 8.0,
    "comment": "Popular game for many. Great but not the best.",
    "timestamp": 1758837600
  },
  {
    "username": "rharn",
    "rating": 8.0,
    "comment": "Solid heavyweight game that has a great system of shared incentives early on with everyone using each other's resources to develop networks, then an exciting endgame where players' gameplans are humming at full speed. I'd say this version is a bit bloated compared to Lancashire, which I'd rather play at any given moment.",
    "timestamp": 1758751200
  },
  {
    "username": "Kaczim",
    "rating": 8.0,
    "comment": "Jakie to jest dobre. Genialna gra z prostymi zasadami,ale wygrać w nią...to już inna para kaloszy.",
    "timestamp": 1758664800
  },
  {
    "username": "Petersilio",
    "rating": 8.1,
    "comment": "has insert",
    "timestamp": 1758405600
  },
  {
    "username": "Tygrone",
    "rating": 8.0,
    "comment": "Glad i finally got to play the nr1 game on bgg.\n\nGameplay is fairly easy and straightforward. The choices you have to make turn it into a heavy game. The game also completely changes after stage1, which can be a total insanity to wrap your mind around.\n\nAs far as economy games go, it's amongst the better ones. A real brainbuster.\n\nPersonally i wouldn't see this game a bgg#1. I can understand a gloomhaven-fatigue but would not justify to bomb its ratings. Nor to upvote this game.",
    "timestamp": 1758405600
  },
  {
    "username": "Stump1960",
    "rating": 7.5,
    "comment": "Sleeved",
    "timestamp": 1758319200
  },
  {
    "username": "klane",
    "rating": 8.0,
    "comment": "Rules are not easy. One needs at least 2 or 3 playings to understand how to play this game.",
    "timestamp": 1757973600
  },
  {
    "username": "IndomitableGoat",
    "rating": 8.4,
    "comment": "So far, the game seems to have great mechanics but we misplayed it a bit the first time. Looking forward to play it again with the right rules xD\n\nUpdate: the rules are really hard to remember and it feels like you have to relearn the game everytime.",
    "timestamp": 1757887200
  },
  {
    "username": "OurMrMajestyk",
    "rating": 8.0,
    "comment": "Absolutely brilliant, does so much with so little. A dynamic game about symbiotic relationships that allows for clever play unlike much else.",
    "timestamp": 1757800800
  },
  {
    "username": "Azovic",
    "rating": 8.5,
    "comment": "B3u4, G2",
    "timestamp": 1762646940
  },
  {
    "username": "Pastor_Mora",
    "rating": 9.0,
    "comment": "La primera partida había sido media trabada. En parte por las nuevas reglas y en parte porque, en el azar de la distribución de mercados iniciales, terminamos con uno de ellos cerrado y eso trastocó cómo se desenvuelve la partida (no lo rompe, pero no es lo más fácil de encarar la primera vez). En principio, me había dejado la sensación de que el agregado de opciones y profundidad no compensaba la pérdida del paso fluido del original.\n\nEn la última que participé, pasó lo mismo con los mercados iniciales y dijimos fuggit, y los shuffleamos de nuevo. Con las reglas más aceitadas y más mercados abiertos, la partida voló con la fluidez que recordaba que tenía el original, así que me reconcilié con esta nueva versión.\n\nPero hay que usar el lado del tablero de día, el lado del tablero de noche, salvo que uses un casco de minero con luz, no se distingue un pomo.\n\nTampoco sé qué traerá el juego como dinero, porque siempre usamos fichas de póker.\n\nUn clásico que conserva lo mejor de los eurojuegos de esa época: profundidad, opciones, decisiones, interacción, fluidez, con un cromo actualizado.\n\nMuy recomendable",
    "timestamp": 1762558620
  },
  {
    "username": "Deacis",
    "rating": 8.5,
    "comment": "Much more fun than the (old) original version. This took a few plays to grow on me. No in game text, has a central board and good balance between tactical and strategical play. Maybe a bit on the long side, but it's a really nail-biter till the end. I can see why this is rated so high as it is.",
    "timestamp": 1762470000
  },
  {
    "username": "Kamil2310",
    "rating": 8.5,
    "comment": "+ 3D Printed insert\n+ Sleeves",
    "timestamp": 1762470000
  },
  {
    "username": "Edudinkin",
    "rating": 9.0,
    "comment": "Euro medio muy limpio.",
    "timestamp": 1762383600
  },
  {
    "username": "jordashing",
    "rating": 9.0,
    "comment": "Great game\n-scratches the economic itch\n-tight gameplay, but does not feel too limiting\n-not too long after you learn\n-straightforward ways to score\n-has a semi cooperative element to the game which make other players turns more interesting\n-can be a bit tough to learn/teach first time\n-rules can feel contradicting when learning",
    "timestamp": 1762383600
  },
  {
    "username": "ditterio",
    "rating": 9.0,
    "comment": "BRASS BIRMINGHAM (2-4 players)\n\nDeluxe player aids: https://boardgamegeek.com/filepage/179522/deluxe-player-aids...\n\nFanmade solo variant:\n\nhttp://www.mautoma.com/mautomas/brass-birmingham\n\nOnline app for solo variant so you don't have to print the cards:\n\nhttps://boardgamegeek.com/filepage/168370/brass-birmingham-g...\n\nBrass Birmingham is better than Brass Lancashire. The Mautoma Solo variant is quite good but I prefer to play Brass as a multiplayer game. The game is a dry euro but a VERY good dry euro.",
    "timestamp": 1762297200
  },
  {
    "username": "MarslandX",
    "rating": 9.0,
    "comment": "Loved playing and would recommend playing but did take us 4 and a half hours to learn and play as a 3. Worth it though",
    "timestamp": 1762210800
  },
  {
    "username": "BlueEyesLX",
    "rating": 9.0,
    "comment": "Sleeved with Shield Titan Super Sleeves (Clear)\nInsert included",
    "timestamp": 1762210800
  },
  {
    "username": "marklcmlsc",
    "rating": 9.0,
    "comment": "Tentative rating.\n\nI understand how this game got its reputation. The puzzle involved is unique, which is such a rarity among the hundreds of Euros we see each year. It felt like the game is stimulating a whole new part of my brain's strategy center that I didn't know existed, and I love it.\n\nThe game is complex, the strategy is opaque, and it was a pain to teach with all of its minor titbits and exceptions. However, these won't matter after 20+ plays, and the game is solid enough to warrant that.",
    "timestamp": 1762210800
  },
  {
    "username": "SJHong",
    "rating": 8.9,
    "comment": "great euro styled game.\nflow of interaction is just a masterpiece.\nMartin is genious.",
    "timestamp": 1762124400
  },
  {
    "username": "Wario1962",
    "rating": 9.0,
    "comment": "25\n50€",
    "timestamp": 1762124400
  },
  {
    "username": "Kazz711",
    "rating": 9.0,
    "comment": "Was my #1 game! (2022)\nI love the shared economy, board building, income, and theme of this game.",
    "timestamp": 1762124400
  },
  {
    "username": "bordspelkampion",
    "rating": 9.2,
    "comment": "good game ,\nbrass Birmingham = wildcatters ( underrated )\nhas the same feel:\n-pick an area through cards on a map\n- play your actions , build, develop, trains ... in that area\n- use each other's network\n....",
    "timestamp": 1762038000
  },
  {
    "username": "Soapermania123",
    "rating": 8.5,
    "comment": "+Incredible depth of strategy. Brain burning turns trying to figure out what, where and in which order to build.\n+The player economy and heavy interaction is a joy. \"Helping\" other players out by flipping their tiles makes everyone feel good, but can quickly swing to tense denial as someone takes your last beer. Need to always be on your toes to see how changes in the board state benefits or harms you.\n+Lots of opportunities to feel clever in short-term tactics to take advantage of board/market state, and also longer-term planning for big sales.\n\n-Easily creates AP in players, making the game drag at 4p.\n-Takes a couple plays to really see the tactics and strategies. First play is mostly just figuring out WHAT you can do with your cards.\n\n≈The cards act as a limit to what you're able to do, which is not my preference for a heavy strategy game. The \"do the best with what you've been given\" feels more tactical. Contrast this with Terra Mystica where all the actions are available to you, but it is your resources that limit your choices.\n≈Strategizing and playing well is a massive brain burn. It's a lot of work just figuring out what the cards allow you to do, before you can even work out an optimal strategy from the available options.\n\n8 > 7.8 > 8",
    "timestamp": 1762038000
  },
  {
    "username": "abicsab",
    "rating": 8.5,
    "comment": "Overall, it’s a solid game, but I expected more from something ranked #1. If it held a lower position, I’d likely view it more favorably. Also, the theme drags everything else down.",
    "timestamp": 1761951600
  },
  {
    "username": "funandfunky",
    "rating": 9.0,
    "comment": "A superb economic game",
    "timestamp": 1761951600
  },
  {
    "username": "aliprandifabio",
    "rating": 9.0,
    "comment": "The perfect german.",
    "timestamp": 1761865200
  },
  {
    "username": "VikingBurger",
    "rating": 9.0,
    "comment": "Nagyon okos pozitív-negatív interakció.\nSzuper a változó piac és a játékkossorend okos kezelése.\nA téma \"meh\", de legalább szépen van megvalósítva.\nA sör mechanikája számomra nem olyan érdekes, mint a kikötőké.\nSokkal több a lehetőség, mint a Lancashireben, emiatt veszít kicsit a feszültségből.\nMegérdemelten BGG top 1.",
    "timestamp": 1761778800
  },
  {
    "username": "Luiz_Struijk",
    "rating": 8.9,
    "comment": "It it great",
    "timestamp": 1761778800
  },
  {
    "username": "TheSlushySnake",
    "rating": 8.5,
    "comment": "Industrial Revolution England-Themed, Heavy Economic Euro-Game.\n2-4 Players. (Best With 3-4 Players).\n\n'Deluxe Edition Comes With Upgraded Player Mats, A Custom Insert, And Upgraded Money Chips'.\n\n“Sleeved”",
    "timestamp": 1761692400
  },
  {
    "username": "RunningRed",
    "rating": 9.0,
    "comment": "Sleeved with:\nGGS10063ML Standard Card Game Matte (66 x 91)",
    "timestamp": 1761519600
  },
  {
    "username": "apax",
    "rating": 9.0,
    "comment": "H",
    "timestamp": 1761519600
  },
  {
    "username": "Qbus81",
    "rating": 9.0,
    "comment": "Played only once with friends and fell in love. Awesome game. Will try it again to get more of it.",
    "timestamp": 1761429600
  },
  {
    "username": "fuxoft",
    "rating": 9.0,
    "comment": "Excellent. Deep strategy with clear rules that are not even that complex. The only downside is that you constantly have to do a LOT of coin exchange to have exact change.",
    "timestamp": 1761429600
  },
  {
    "username": "Games_Franco",
    "rating": 9.0,
    "comment": "Gave it a shot to see what all the hype was about, and I was pleasantly surprised! The economic choices are varied. Stealing resources from others, or getting your resources stolen, does not feel too cutthroat since you get hefty benefits from depleting resources, no matter who was responsible for this. This makes these \"take that\" choices feel less malevolent and the less obvious choice to take, because you need to think about whether it helps them more than it helps you. It's also surprisingly not a super long game unless you have players with bad cases of AP. The setup is a bit tedious, but I always measure games by the setup/fun ratio, and the fun in this case is worth it.",
    "timestamp": 1761170400
  },
  {
    "username": "mike_hammer",
    "rating": 9.0,
    "comment": "2024:I\n2025:IIII",
    "timestamp": 1761084000
  },
  {
    "username": "Knuspriger_Typ",
    "rating": 9.0,
    "comment": "Kickstarter Spieleschmiede mit Iron clays",
    "timestamp": 1760997600
  },
  {
    "username": "Rogue128",
    "rating": 8.8,
    "comment": "Highest Rank: 1 in 2025",
    "timestamp": 1760911200
  },
  {
    "username": "Lord McMatty",
    "rating": 9.0,
    "comment": "Puzzle-y and thinky game. Lots of strategies to explore. Good player interaction, in terms of racing for certain spots and resources, and using other player's connections and resources (coal, iron, & beer). Very crunchy.",
    "timestamp": 1760911200
  },
  {
    "username": "DeKerstman",
    "rating": 9.0,
    "comment": "See other copy.",
    "timestamp": 1760911200
  },
  {
    "username": "PBandJellyfish",
    "rating": 9.2,
    "comment": "@TX",
    "timestamp": 1760824800
  },
  {
    "username": "leon10293",
    "rating": 9.0,
    "comment": "30% luck , 70% strategy",
    "timestamp": 1760652000
  },
  {
    "username": "Jumicorinbo",
    "rating": 9.0,
    "comment": "Hard to teach but smooth as silk once everyone gets it. The game gives you that perfect desire a game should - to play it again because you think you know where you can do better next time.",
    "timestamp": 1760479200
  },
  {
    "username": "YoLYcmqZ",
    "rating": 8.5,
    "comment": "Thoughts: Not sure this deserves #1 on BGG, but it's an amazing game without question. Doesn't get to the table as much as we'd like so it takes a minute to get back into the rules. When we do though, it's always a joy. Every decision matters and the economic engine is unlike anything else.\n\nTag(s): Economic, Heavy Euro, Network Building\nBest Player Count: 2-4, {3-4}\nRating: 9, -0.5\nOwn: Physical",
    "timestamp": 1760392800
  },
  {
    "username": "Hamboard20",
    "rating": 9.0,
    "comment": "참신하고 재밌음",
    "timestamp": 1760306400
  },
  {
    "username": "igor_f",
    "rating": 9.0,
    "comment": "2-4\nNoEng",
    "timestamp": 1760220000
  },
  {
    "username": "mrssallyintown",
    "rating": 9.0,
    "comment": "Pretty complicated game, but the mechanics really compliment each other and the theme of the board game.",
    "timestamp": 1760220000
  },
  {
    "username": "Pura_Vida",
    "rating": 9.0,
    "comment": "Excellent game this is. The interconnection and mutually reinforcement of strategy and theme is very strong and the many tactical and situational choices you can make, with using each others beer, coal and iron to mutual benefit, is just great.",
    "timestamp": 1760047200
  },
  {
    "username": "TempestBlade",
    "rating": 9.0,
    "comment": "10 4 20",
    "timestamp": 1759874400
  },
  {
    "username": "thefatcyclist",
    "rating": 9.0,
    "comment": "***VI-1",
    "timestamp": 1759788000
  },
  {
    "username": "identisick",
    "rating": 9.0,
    "comment": "Absolute S-tier Euro. Probably do prefer Lancashire for 2p though",
    "timestamp": 1759788000
  },
  {
    "username": "terminalhiccup",
    "rating": 10.0,
    "comment": "Previously 9. The more you play this game the more it shines!\n\nIt has a relatively simple rule set with incredible depth. No need for expansions.... It's a modern classic.\n\nIf you like strategy without the need to attack your opponents to win, this is for you.\n\nThe interplay of you using up the other players resources benefitting both you and them is very satisfying and keeps everyone engaged.\n\nGreat family strategic game!",
    "timestamp": 1762608480
  },
  {
    "username": "Fleax",
    "rating": 9.5,
    "comment": "kickstarter",
    "timestamp": 1762297200
  },
  {
    "username": "Exodusland",
    "rating": 9.5,
    "comment": "We played together with my wife. We love the game, the its number 1 place on the ranking list is well deserved. The learning curve took some time, we watched tutorials as some rules were not easily understandable in the hungarian rule book (at least for us).\n\nThe game with 2 players is fun and pretty fast, with little downtime. Both eras are fun and once you figure out certain rules it can be fun. There are more detailed reviews, but what I have to say is that this is a well designed game (a bit too dark for my taste and eyes) made for us, as we like euro games with less or zero luck.",
    "timestamp": 1761865200
  },
  {
    "username": "bukke2",
    "rating": 10.0,
    "comment": "A heavy boardgame classic with a short rulebook presenting relatively few and absolutely clear rules, a simple and convincing iconography, a truely atomspheric artwork and an outstanding thematic embedding.\nTons of tactical options, dilemmas and decisions just wait to be explored, interaction galore. Gameplay is very demanding, entertainment guaranteed. Sheer enthusiasm if a plan works, pure frustration if it doesn´t,\nThe board game companion to \"Hard times\" by Charles Dickens or \"North & South\" by Elizabeth Gaskell.\nBest board game ever? I don´t know, but it´s extraordinary.\n(SPIEL25 Essen 25.10.25)",
    "timestamp": 1761865200
  },
  {
    "username": "GoldenOlaf",
    "rating": 10.0,
    "comment": "Solo",
    "timestamp": 1761606000
  },
  {
    "username": "Boardvadda",
    "rating": 9.5,
    "comment": "+ Iron Clay Upgrade\n+ Playmat",
    "timestamp": 1761519600
  },
  {
    "username": "ma_rylou",
    "rating": 10.0,
    "comment": "We played Brass as Kickstarter and Deluxe edition (which is the same quality and tokens) and as 4, 3 and 2 player games. Its incredibly flexible and game mechanics are challenging enough to keep you busy during downtime (which it has) but overall, player interaction is very good and we can truly recommend it because of its re-playability in all constellations.",
    "timestamp": 1761429600
  },
  {
    "username": "DaneTheBeast",
    "rating": 10.0,
    "comment": "Played (IRL & TTS)",
    "timestamp": 1761429600
  },
  {
    "username": "LordShamberhood",
    "rating": 10.0,
    "comment": "tiefe strategische Möglichkeiten, Wettbewerb um Platz, Mitnutzung von Ressourcen von Mitspielern...\nWiederspielwert aus meiner Sicht hoch",
    "timestamp": 1761343200
  },
  {
    "username": "Sly_Quick",
    "rating": 10.0,
    "comment": "N/A Expansions\n\n(Folded Space Insert)",
    "timestamp": 1761256800
  },
  {
    "username": "el_crosso",
    "rating": 9.9,
    "comment": "Such an excellent design and the reprint is out of this world!",
    "timestamp": 1761084000
  },
  {
    "username": "Gunkus",
    "rating": 10.0,
    "comment": "I mean what can I even say that anybody else hasn’t already? It’s Brass Birmingham. That’s all you need to know, and while it isn’t one of my all time favorites it’s undeniably fantastic. Brass keeps you on your toes in way that rewards both long term planning and clever decisions on the fly, making you constantly adjust to the ever fluctuations of the market. Brass can feel very frustrating at times, sure. However anyone with a love of the hobby who is willing to give it a good amount of plays will see why this is the number one game of all time. At least until camel up inevitably overtakes it as it should.",
    "timestamp": 1760997600
  },
  {
    "username": "Stankiem",
    "rating": 10.0,
    "comment": "Had a lot of fun with this, great mechanics for the most part and lots of interesting interaction. Really enjoy the markets, loans, network building etc.. So much interaction and so many great small quick decisions.",
    "timestamp": 1760824800
  },
  {
    "username": "Papillon564",
    "rating": 9.5,
    "comment": "Sleeved / Inserted",
    "timestamp": 1760824800
  },
  {
    "username": "Auroric",
    "rating": 10.0,
    "comment": "What a cool game. The aesthetic is great, the strategy runs deep, and I absolutely adore the interconnectedness of the economy. Seeing this level of interaction in a Euro is so refreshing. The players have immense agency over the state of the game, and the way it all comes together is magical.\n\nThat said, some of the rules are incredibly unintuitive, bordering on arcane (iron can teleport, coal cannot, beer can for you, etc). There's enough weirdness to make it genuinely difficult to explain with a straight face. It's not particularly complex in the traditional sense; there's not that many actions you can take, but these strange caveats combined with the obtuse nature of how to actually play the game well makes for a large barrier to entry. I also find the game can veer into being slightly dry after many plays.\n\nStill, this is an amazing design. My only real critiques are in regards to the teach, and once players learn it this is a masterpiece. The fact that this game allows for this level of enmeshment between the players is a breath of fresh air, and something I must find more of.",
    "timestamp": 1760565600
  },
  {
    "username": "Click86",
    "rating": 10.0,
    "comment": "Mary and I love this game. Such a fun strategy game that does not get boring.",
    "timestamp": 1760479200
  },
  {
    "username": "Proezas",
    "rating": 10.0,
    "comment": "This is the best economic game I have. I am really proud to have the Kickstarter edition. It is a number 1 more than deserved.",
    "timestamp": 1760392800
  },
  {
    "username": "Aurion254",
    "rating": 10.0,
    "comment": "This is a great game. I don't know whether I'm slightly biased being from the Midlands but this is surely better than the Lancashire one! ? The number of components can be a little daunting at first but once you see past the sheer number of little tokens stacked on your player boards, underneath is quite a simple game with a couple of key mechanisms to remember. Unfortunately, my wife's not there yet, so it doesn't hit the table enough but I would probably play this game most weeks if I could.",
    "timestamp": 1760392800
  },
  {
    "username": "fallenvalkyrie",
    "rating": 10.0,
    "comment": "I love it. It's simple, easy to set up, easy(-ish) to teach and still gets a lot of depth, despite its relatively simple mechanics.\n\nThe only criticism I have is really the rules around building being a little weird and not the clearest and the manual being about as nicely ordered as that drawer we all have for \"miscellaneous stuff\" (as in: not at all).\n\nI do however like the concept of the introductory game, and the backside of the manual with beginner tips, those were quite helpful.",
    "timestamp": 1760220000
  },
  {
    "username": "Mentatgamer",
    "rating": 10.0,
    "comment": "Interactive euro. Heavy economics integrated well with theme. Just not quite as good as Lancashire",
    "timestamp": 1760220000
  },
  {
    "username": "Falkar",
    "rating": 9.5,
    "comment": "The perfect mix of strategy and tactical decision making. I love the different options the game gives you. Flows well. I really enjoy the payoff that comes with nailing the network bonuses. Artwork is perfect for the theme.",
    "timestamp": 1760133600
  },
  {
    "username": "KS1N",
    "rating": 10.0,
    "comment": "Steam 소장",
    "timestamp": 1759960800
  },
  {
    "username": "maritn",
    "rating": 10.0,
    "comment": "Economic game with lots of interaction.\n\n+ Setting\n+ Components\n+ Quite interactive. You need to pay close attention to what other players are doing and change your plans if their actions open more lucrative opportunities.\n+ Short downtime\n\nI guess it's more forgiving than Lancashire, so might be the more gentle entry into the Brass series. But I think I prefer Lancashire, because it seems to be more interactive than Birmingham.",
    "timestamp": 1759960800
  },
  {
    "username": "Indiana__Jones",
    "rating": 10.0,
    "comment": "¿Número 1 en BGG después de tanto tiempo? El hype siempre es mal consejero, pero si hay un juego capaz de zanjar semejante debate es este. En muchos sentidos, aprieta mucho más las limitaciones a la hora de colocar las losetas que el propio dinero, y gestionar el número de acciones por ronda, la estrategia que vas a seguir en la partida, como te vas a ir colocando en el mapa, o los recursos que vas a destinar componen un rompecabezas absolutamente imprescindible. Sí, es un 10. Insuperable.\n\n* LO MEJOR: El rompecabezas al que te somete y sus múltiples caminos para puntuar.\n\n* LO PEOR: Algunas de las limitaciones a veces son algo farragosas.",
    "timestamp": 1759874400
  },
  {
    "username": "shmonkey",
    "rating": 10.0,
    "comment": "One of my favorites. Very tactical. Most of the interaction is positive, as opponents get paid for using your resources. That said, there is a tremendous amount of depth to the game. A strategy seems very powerful, but we've been able to find counter-play options each time. The game does rely on multiple plays to really shine, as the strategies between newcomers and veteran players can vary quite significantly.",
    "timestamp": 1759874400
  },
  {
    "username": "Damper666",
    "rating": 10.0,
    "comment": "New",
    "timestamp": 1759788000
  },
  {
    "username": "Deathron123",
    "rating": 10.0,
    "comment": "Best euro i played",
    "timestamp": 1759615200
  },
  {
    "username": "nmarkus",
    "rating": 9.5,
    "comment": "I really enjoy this game. It's very tight on actions but it's doesn't feel unforgiving if you mess up a bit. The level of player interaction relative to completing your own puzzle is fantastic.",
    "timestamp": 1759528800
  },
  {
    "username": "tuttutZOOM",
    "rating": 10.0,
    "comment": "Great fan-made solo mode\nCustom wooden organizer for pieces, cards sleeved",
    "timestamp": 1759442400
  },
  {
    "username": "Waterhook",
    "rating": 10.0,
    "comment": "No wonder this game is #1!",
    "timestamp": 1759356000
  },
  {
    "username": "Jasonlin778",
    "rating": 10.0,
    "comment": "來源：財神",
    "timestamp": 1759356000
  },
  {
    "username": "blake33",
    "rating": 9.5,
    "comment": "Beautiful board game that is very fun to play.",
    "timestamp": 1759269600
  },
  {
    "username": "AliReza_Ka",
    "rating": 10.0,
    "comment": "after some 2p games I must say that game is outstanding. heavy strategies but also enjoyable.\none of the best Board Games I have ever experienced.",
    "timestamp": 1759183200
  },
  {
    "username": "noboardom",
    "rating": 10.0,
    "comment": "Hand Management, Resource Management, Route Building, Economy\n\nTheme: Industrial",
    "timestamp": 1759010400
  },
  {
    "username": "lionellyyn",
    "rating": 9.5,
    "comment": "Brass Birmingham is not BGG #1 for no reason, the game is really engaging and each play is significant. This is also well balanced and has one of my favorite mechanics which is to advance in the game most of the time you have to help one of your opponent.",
    "timestamp": 1758924000
  },
  {
    "username": "arivincenti",
    "rating": 9.5,
    "comment": "I love this game! The art is amazing.",
    "timestamp": 1758837600
  },
  {
    "username": "angstyzebra",
    "rating": 10.0,
    "comment": "Network Builder/Economic Euro\n\nExpansion:\nIron Clays\nUpgraded trains & resources",
    "timestamp": 1758578400
  },
  {
    "username": "srfdevotee",
    "rating": 9.9,
    "comment": "Straightforward rules -- the only real learning curve is remembering the requirements for being connected to coal, and if necessary, beer, and what \"your network\" means, but this isn't difficult. The high BGG Weight of this game comes not from its rules from its depth, which is meaty and juicy with medium-term strategy and short-term tactics. The game is beautiful to look at in in base version, but there are many aftermarket upgrades available that can elevate the game even further. High replayability and meaningful player interaction on a variety of levels. Worthy of the top spot on BGG.",
    "timestamp": 1758578400
  },
  {
    "username": "OGRussHood",
    "rating": 10.0,
    "comment": "My 2025 Top 250: #38\nMy 2024 Top 250: #29\nMy 2023 Top 250: #32\nMy 2022 Top 250: #36\nMy 2021 Top 250: #38",
    "timestamp": 1758492000
  },
  {
    "username": "Wuyley",
    "rating": 9.5,
    "comment": "Best 3/4",
    "timestamp": 1758492000
  },
  {
    "username": "tickettogloom",
    "rating": 10.0,
    "comment": "Took a few plays to grok it, but my oh my, this is a deep, layered, thinky euro. Great game!",
    "timestamp": 1758405600
  },
  {
    "username": "peterlevi",
    "rating": 10.0,
    "comment": "(open)\n\nInteresting, beautiful and thematic. This is one of the games that best model economy. The feeling of supply and demand is very real. High levels of interaction.\n\nSetup and tear-down are pretty nasty. It could also get a bit fiddly at moments, e.g. players looking for what they actually can do. As a result, it usually runs longer than one plans.\n\nEdit: After having played it 10+ times, I do think I like the mood of Birmingham a little bit more than Lancashire. Overall both versions are some of the very best games out there. Raising rating to 10.",
    "timestamp": 1758060000
  }
]