[
  {
    "username": "realityfoible",
    "rating": 1.0,
    "comment": "This is not a game.\nYou do not play Cthulhu: Death May Die.\nYou are merely the flesh engine moving the components as the game plays itself.\nDecisions don't matter. Players don't matter. Free will is an illusion.\nOnly the capricious will of dice and card effect decks.\n\nIt doesn't even have the grace keep my torment short.\nFitting for the theme, I can feel my mind melting out my ears as time goes on. I have no agency and I must scream.\n\nThe minis are nicely detailed though!",
    "timestamp": 1760392800
  },
  {
    "username": "hildrethjack73",
    "rating": 1.0,
    "comment": "Game great Cmon customer service terrible",
    "timestamp": 1748642400
  },
  {
    "username": "lililililil",
    "rating": 1.0,
    "comment": "RNG",
    "timestamp": 1747432800
  },
  {
    "username": "Y3ll0wH4sh",
    "rating": 1.0,
    "comment": "CMON is a scam",
    "timestamp": 1726437600
  },
  {
    "username": "magyarsatan",
    "rating": 1.0,
    "comment": "As long as CMON continuous its dusgusting business practices with the way they handle Kickstarter exclusives I'll never buy a single game from them.",
    "timestamp": 1695679200
  },
  {
    "username": "bobyams",
    "rating": 1.0,
    "comment": "Total garbage. Thematic, how? Lovecraft in name ONLY. For shame Mr. Lang, you call Lovecraft a racist (justifiably) and then turn around and make money off him? Hypocrite! I have no respect for your opinion anymore.",
    "timestamp": 1666908000
  },
  {
    "username": "Farstar84",
    "rating": 1.0,
    "comment": "wonderful artwork and miniatures, terrible gameplay, from every point of view, either by looking at the lovecraftian theme, totally absent, but even if you look at it as a simple cooperative monster slasher, you wander randomly around the map, kill something, then move, kill another something, finish",
    "timestamp": 1666821600
  },
  {
    "username": "crow13",
    "rating": 1.0,
    "comment": "Kind of a mess. So much to keep track to and when to keep track of it makes it stressful. So many cheat or “forget a rule” when playing. Another unfair (mostly) Cthulhu game where they have scenarios that boil down to putting in things you have to do that take up your actions. This feign difficultly. Some scenarios, even with cheating, were barely winnable. First couple of episodes were fun but it got samey and with episode 5 became the unfair game I describe above. With all the games I have I wish I never purchased this and it’s expansion.\nChanged to a 1. Everyone in the play throughs cheat to win. This is an impossible game on most every scenario past the first 4. Look at what you are up against. Game is broken beyond belief. When my gaming group of older veteran gamers cheat and still lose then a problem exists. The YouTubers stack the deck and edit their videos to get the outcome they want. You say no? Then why is it you never see them have such bad luck that they lose? Horrible cash grab luck fest.",
    "timestamp": 1661464800
  },
  {
    "username": "OlegKlishin",
    "rating": 1.0,
    "comment": "Lovecraft works being in public domain influence game industry in a really bad way. Psychological cosmic horror is reduced to the level of firing machinegun at tentacles. FFG games from Arkham files series at least try to implement Cthulhu mythos. They often misfire, but sometimes atmosphere is there. Death May Die is a completetly shallow, primitive monster slasher, just using lovecractian theme as a trendy backdrop. Judging by kickstarter success, this is exactly what players want: huge minis, whatever familiar theme and pointless dice rolling at endlessly respawning monsters. Player agency and meaningful choices are laughable at best. I have many of the same grudges with Arkham Horror, but comparing to DMD those are much better games.\n\nUPDATE: After trying this once more in solo I decrease rating even further. Completely dumb, empty experience, having little in common with it's theme. Worst gamification of mental health included. I don't understand how does it get this high of a rating. Are decent art budget and 1kg of plastic really enough?\n\nUPDATE 2: Eric Lang openly saying \"Lovecraft was a racist piece of shit\", but still profiteering from those works, makes him a grandiose hypocrite. If Eric stood by his words, he should have made his own lore. Instead he chose to parasitize on someone else's. Bravo.",
    "timestamp": 1600725600
  },
  {
    "username": "mcsid",
    "rating": 1.0,
    "comment": "investigators everywhere！ poor monster~！ fxxking stupid game i think i can call “call of investigators ” for this game",
    "timestamp": 1580425200
  },
  {
    "username": "prolestellare",
    "rating": 1.0,
    "comment": "just a money machine, big miniatures shallow gameplay",
    "timestamp": 1578006000
  },
  {
    "username": "neatbender",
    "rating": 2.0,
    "comment": "It's just not my style of game. Mostly dice rolls, random cards, feel like a party game for nerds. The game is mostly about having fun while loosing together and enjoy a crazy pyromanic girl with an axe on fire while having a fire extinguisher, or a catatonic brawler who is always safe.",
    "timestamp": 1754085600
  },
  {
    "username": "ManEatingHippo",
    "rating": 2.0,
    "comment": "Talk about an uninspired dungeon crawler. This is everything that is wrong with modern board games.",
    "timestamp": 1742770800
  },
  {
    "username": "BoardGamingCouple",
    "rating": 2.0,
    "comment": "2/5\n\ninteresting co-op game that plays similar to most survival co-op games. simply pick the theme you prefer. expensive and overproduced, but lovely components.",
    "timestamp": 1735254000
  },
  {
    "username": "Chyy",
    "rating": 2.0,
    "comment": "Pros: Theme, most of the investigators, minies and sanity track & investigate.\nMixed: Some insanity cards' were great, others were ok and some were bad. Mythos deck can be pretty hit or miss.\nCons: Episodes 2 and 3 were bad as was Cthulhu's the Sleeper Awakens. Only 6 Episodes, two Elder Ones and not enough replayability especially when some episodes are just bad.\n\nArkham Horror LCG is a lot better if you like the theme and Zombicides are a lot better if you want action & minies.",
    "timestamp": 1732748400
  },
  {
    "username": "AdmiralCrunch",
    "rating": 2.0,
    "comment": "So sick of Cthulhu games, and this one is worst than most",
    "timestamp": 1729893600
  },
  {
    "username": "FAyrolo",
    "rating": 2.0,
    "comment": "Nice! Another 10kg Chtuhlhytu dungeon crawler!",
    "timestamp": 1708470000
  },
  {
    "username": "EHngel",
    "rating": 2.0,
    "comment": "All of my plays are solo\n\nI played 10 games before trading this game.\nI played with many Characters, against a variety of Ancient Ones, and with a handful of Episodes.\n\nPros\n- Thematic Episodes\n- Minor Character Ability Asymmetry\n\nCons\n- All Characters had the same amount of health/stress/sanity. This didn't make any thematic sense at all.\n- Only way to level up was by losing sanity, usually from die rolls. I've had many times where characters didn't level up because they never rolled poorly, always successes. Thematic disconnect when I would use stress to re-roll successes in the hopes of losing sanity so I could level up.\n- Some of the Discovery Cards were useless once the Ancient One Awoke (episode dependent)\n- Advancement Symbols on Mythos cards could end a game quickly\n- Long setup\n- Too many boxes! Took up way too much room on my shelf",
    "timestamp": 1650146400
  },
  {
    "username": "vinayplusj",
    "rating": 2.0,
    "comment": "This is one of the games which pretend that having lots of miniatures makes a game thematic.\n\nScenarios are similar. Gameplay is shallow and simplistic. Too many unnecessary component to justify the high price tag. The board can get crowded.",
    "timestamp": 1633557600
  },
  {
    "username": "Gaertner3031",
    "rating": 2.0,
    "comment": "Ameritrash ist einfach nichts für mich. Wilde Würfelorgie.",
    "timestamp": 1599602400
  },
  {
    "username": "JasonSaastad",
    "rating": 2.0,
    "comment": "",
    "timestamp": 1576191600
  },
  {
    "username": "Jedo1",
    "rating": 2.0,
    "comment": "Shoot Cthulhu in the face...yeah Eric, that's original.",
    "timestamp": 1574550000
  },
  {
    "username": "jyhuh35",
    "rating": 3.0,
    "comment": "세팅이 빡세다. 개인적으로 크툴루가 싫다.",
    "timestamp": 1753135200
  },
  {
    "username": "larrydurbin",
    "rating": 3.0,
    "comment": "Soooo much plastic. Why can't they publish games like this with full color cardboard or acrylic standees? Box is oversized because of it. No thanks.",
    "timestamp": 1740438000
  },
  {
    "username": "jtrleone",
    "rating": 3.0,
    "comment": "Very ameritrash. Only novel and redeeming aspect is the faster game progression. Otherwise more of the same and overproduced.",
    "timestamp": 1736722800
  },
  {
    "username": "tobydjones",
    "rating": 3.0,
    "comment": "Tedious waiting for every other player to do all their actions, pull a mythos card and investigate/get attacked. Rules spread over multiple cards mean it's easy to miss something. I like that by going mad you get extra abilities, but it's somehow anti-climatic to achieve our goal, and then all die to Azathoth.",
    "timestamp": 1733526000
  },
  {
    "username": "simopetitrouge",
    "rating": 3.0,
    "comment": "a game lacking in many aspects. Little immersion, banal mechanics and questionable art. A disappointment since I love the theme and genre",
    "timestamp": 1718575200
  },
  {
    "username": "JustinRRizzo",
    "rating": 3.0,
    "comment": "Nap may nap.",
    "timestamp": 1713650400
  },
  {
    "username": "bainewedlock",
    "rating": 3.0,
    "comment": "Rating 4 = To someone with a simliar taste like me: Play this game if you don't have anything else to do.\n\nSimilar to Zombicide.\nHigh downtime, not much happening. It might be more fun if all players would play quicker?",
    "timestamp": 1703545200
  },
  {
    "username": "Edward33",
    "rating": 3.0,
    "comment": "I have never played a more fiddly random game that I felt I had very little control in the outcome. People are rating this game based on art and components. BAD GAME.",
    "timestamp": 1700866800
  },
  {
    "username": "norberts",
    "rating": 3.0,
    "comment": "Mindless dice chucking with some progression. Not for me.",
    "timestamp": 1673478000
  },
  {
    "username": "Dmihawk",
    "rating": 3.0,
    "comment": "Decided to cancel my pledge, i backed in the first hour, rushing excited to get my spot in the limited statue expansion list, then i had time to think about it. Personally after Bloodrage and Rising Sun i was really looking forward to the next Eric Lang's game and as a huge fan of Mansions of Madness since edition 1 this was a must buy before the campaign launched. But then i had time to see how the campaign was driven, what was offered and to watch the gameplay video. I didn't like either of them, exclusivity is good, exploiting reputation of past games and a commonly loved theme to sell a 100$+ unpainted statue and make it looks like it is a \"board\" on where you play the game is just a non-sense to me, i get that the company is based on miniatures (50cm tall miniature????) but i back a boardgame for its content and not for the weight of the plastic in the box. As for the game itself, and this is the main reason why i canceled my pledge, it really just looks like a basic dungeon crawler with simplistic rules already seen and overused in this genre, you just move around rolling dice form start to end, they tried to add complexity with the insanities cards that gives you some sort of malus that you can also exploit in some situations and they tried to add variety with the scenario boxes (last time i checked there were 6 scenarios) that you combine with the great old one but both of this mechanisms fail to convince me, just not what i'm looking for 220$.",
    "timestamp": 1531519200
  },
  {
    "username": "Kannon7",
    "rating": 4.0,
    "comment": "Las miniaturas son lo más atractivo del juego, pero la modalidad no es para mí, el tablero está desproporcionado con las miniaturas, y en general para mí fue una decepción, pensé que me gustaría el juego e intente que así fuera, pero finalmente decidí venderlo...",
    "timestamp": 1754863200
  },
  {
    "username": "BggTroll",
    "rating": 4.0,
    "comment": "solo, sold",
    "timestamp": 1750888800
  },
  {
    "username": "sykano",
    "rating": 4.0,
    "comment": "scenario-based dudes-on-a-map game with rolling dice\n60% miniatures 40% game\nsimple dice chucking game, should have a bit more elements of dungeon crawlers or \"Eldritch Horror\" to it\nlimited replayability is a problem, despite the modularity\nPeople say a lot of the terrain tiles are way too small for the miniatures.\n\nSome of the miniatures are pretty cool though, but only some.\nThe insanties/afflictions of which every investigator gets one at the start of the game are fairly good game design.\n\nIt's basically \"Yahtzee\" with cool miniatures. (!)\n\nOnly 6 episodes in the box is abysmal.\n\n\nWhat DMD does do well:\n- random insanity for each investigator\n- very simple and short dice chucking gameplay\n- lovecraftian monster miniatures\n- FotU unknown monster rules help a bit to make use of monster miniatures and to improve replayability\n\nWhat DMD doesn't do well:\n- despite modular, different Elder Ones and investigators feel not that different, only few episodes per box\n- doesn't make it easy to design own custom episodes/scenarios (!)\n- delivering miniatures of Lovecraftian monsters is great, but commonly known ones shouldn't be locked behind exclusives that don't see reprints, not enough Shoggoths\n- gameplay is too simplified, no items/spells/... except for weird episode-specific cards without artworks (and relics added in FotU), no interaction with terrain, ...\n- ...",
    "timestamp": 1742425200
  },
  {
    "username": "marcopac74",
    "rating": 4.0,
    "comment": "game is ok, it starts well but it gets confusing later on with lots of miniatures and tokens on the map, the boss different stages and the characters abilities and upgrades. As many other mentioned, the small tiles are too small and you often have too many miniatures and tokens on them. Rerolls are not the best way to mitigate luck. In general it balances itself out, but the balance is really fine and can swing quickly for the better or worse. All in all enjoyable, considering I only played S1E1 chapter against cthulhu and using the same two characters. First impression is also that some characters can be extremely overpowered compared to others\nedit: I played it after a long time, and I like it less and less, the overall rules are easy to remember, but each ancient one and each episode have their own rules and everything overlaps, very fiddly and underwhelming, lowered my score from 6 to 4",
    "timestamp": 1737673200
  },
  {
    "username": "Masterblocker",
    "rating": 4.0,
    "comment": "Just a priorization number no actual rating",
    "timestamp": 1736550000
  },
  {
    "username": "alek2",
    "rating": 4.0,
    "comment": "This game is too fiddly for me. It starts ok but later on the number of effects that you need to manage on the board becomes very tedious. And the story is almost non existent. On the plus side, the game is pretty dynamic (at least in moments when you don't need to move around all the pieces) and plastic figures are very nice. I can only play it if someone else would do all the board management.",
    "timestamp": 1734735600
  },
  {
    "username": "PGames_DM",
    "rating": 4.0,
    "comment": "I'm giving this a low rating because of my own personal confusion trying to buy products for this. The descriptions on so many of the products are very similar and so it was easy for my to be sold the wrong product. I don't expect to do a return maybe a trade at some point but I think that's something that could have been better planned around by the designers and publishers that I the consumer am having to do extra work to resolve.",
    "timestamp": 1728684000
  },
  {
    "username": "bardia",
    "rating": 4.0,
    "comment": "Far too much dice chucking for a game that takes itself so seriously.",
    "timestamp": 1723932000
  },
  {
    "username": "chrisgledhill",
    "rating": 4.0,
    "comment": "[-] Un jeu \"améritrash\" qui mérite bien son nom ; mais je cherche une expérience ludique avec moins de plastique et plus d'imagination",
    "timestamp": 1723154400
  },
  {
    "username": "shmonkey",
    "rating": 4.0,
    "comment": "Much like pandemic, this is cooperative and you have many figurative and literal fires to put out. DIce chucker combat, and an insanity level up system are interesting. QB potential is strong with this one, and choices seem fairly obvious because of character specialization. Just fulfill your role and do what is obvious, or what your teammates order you to do. THe only real interesting decisions lie in your character skill ups. Multi-handed solo could be more interesting.",
    "timestamp": 1716674400
  },
  {
    "username": "HackFin",
    "rating": 4.0,
    "comment": "Fine game, but nothing I really enjoy. The same known stuff all over again. AP prone, easily overstaying its welcome. Among these dark adventure type games it does not stick out or provide something new and exciting.",
    "timestamp": 1708642800
  },
  {
    "username": "b4b8",
    "rating": 5.0,
    "comment": "Some terrible scaling with certain player counts low like 2 and 5. 3/4 is ideal",
    "timestamp": 1754085600
  },
  {
    "username": "XbertDeathman",
    "rating": 5.0,
    "comment": "sell",
    "timestamp": 1743890400
  },
  {
    "username": "gram_niebieskim",
    "rating": 5.0,
    "comment": "My BGG:\n10 - excellent game, always have a great time\n7 - enjoyable game, I'm willing to play again\n5 - not bad but it's not my cup of tea\n2 - won't play ever again",
    "timestamp": 1743717600
  },
  {
    "username": "krit1789",
    "rating": 5.1,
    "comment": "Streamlined version of Arkham Horror",
    "timestamp": 1739142000
  },
  {
    "username": "Mark0os",
    "rating": 5.0,
    "comment": "I do not understand the hyped with this game. I do not see it making anything innovative in mechanics or theme. The theme is much better implemented on games like Mansions of Madness or Arkham Horror LCG. In terms of mechanics it felt just one more dungeon crawler with a big boss.",
    "timestamp": 1730502000
  },
  {
    "username": "Mestail",
    "rating": 5.0,
    "comment": "just so so",
    "timestamp": 1725228000
  },
  {
    "username": "Sedd",
    "rating": 5.0,
    "comment": "Kurz: Die Erste Partie war viel zu einfach. Die Nachfolgende fast unschaffbar, obwohl man nichts falsch gemacht hatte. Das Spiel ist mir einfach zu Glückslastig. Es gibt wenig Möglichkeit zur Würfelmanipulation.\n\nLangform:\nDas Spiel ist ein typisches CMon-Spiel -> sehr \"ami-trash\"-ig. Also sehr opulent, mit einer super Tischpräsenz. (Was die Thematik gut) Auch gewisser Abwechslungsreichtum ist vorhanden, aber Kämpfe sind sehr Würfellastig. Ich kann mir gut vorstellen, dass das Grundspiel schnell ausgespielt ist und man mehr will. Und ich vermute, das die Preisgestaltung darauf ausgelegt ist und man sich die vielen Erweiterungen holen soll (um weitere große Alte für mehr Abwechslung zu haben). Und das fände ich schade.\nC.- D.M.D. ist relativ einsteigerfeundlich, weil es relativ einfache+ ausreichend Aktionsmöglichkeiten bietet. Die Verrücktheitsleiste ist interessant, da man dadurch stärker wird, aber auch sterben kann, wenn man übertreibt.\nIch mag die Kartenteile, weil sie stimmungsvoll gestaltet wurden und eine gewisse Modularität bieten. Aber so wie bei vielen andere Sachen in dem Spiel, kann man die schnell mal verschieben, wenn man unachtsam ist. Die Szenarien bieten grundsätzlich auch zusätzliche Ideen, wie Feuer bekämpfen, einen Mordfall lösen u.s.w. .\n\nNachtrag: An die 2. Partie kann ich mich kaum erinnern. (3/4Jahr später) Die 1. Partie war auch großteils in Vergessenheit geraten.ist aber schon 3Jahre her) (Spricht trotzdem ein bisschen fürs Spiel.)",
    "timestamp": 1723932000
  },
  {
    "username": "Nickeddy01",
    "rating": 5.0,
    "comment": "Similar to Zombicide but less relatable.",
    "timestamp": 1723932000
  },
  {
    "username": "benni_jolink",
    "rating": 5.0,
    "comment": "Very basic action game. Walk into room, shoot monsters, roll damage versus armor, check hitpoints. We've done it so many times in so many similar games. How many huge boxes full of plastic do you need???",
    "timestamp": 1715724000
  },
  {
    "username": "yiechow",
    "rating": 5.0,
    "comment": "Not a fan of Lord of Cthulhu.",
    "timestamp": 1715205600
  },
  {
    "username": "LiverpoolYNWA",
    "rating": 5.0,
    "comment": "'Should' go up with more plays. The 1st was unimpressive but, afterall, it was the 1st; a very small sample size. :-P Additionally, I was ill. :-/",
    "timestamp": 1710630000
  },
  {
    "username": "oobecks",
    "rating": 5.0,
    "comment": "Only played solo... A lot depends on luck. For me the character development is too weak for a campaign. The story is basically non-existent. Absolutely not my type of game. For a group that just wants an exciting dice game, this might be it...",
    "timestamp": 1709593200
  },
  {
    "username": "FruitPebble",
    "rating": 5.0,
    "comment": "It feels like the game is tuned to the point where you have to know the entire scenario and figure out how to cheese it the hardest to win",
    "timestamp": 1705100400
  },
  {
    "username": "stenole",
    "rating": 5.0,
    "comment": "(3-5P) Play as characters who have passed the brink of insanity. Disrupt the cultist ritual before it is too late. The game has an arc that always leads to a tense end, but at the same time is very predictable. The game is missing some lovecraftian charm.",
    "timestamp": 1703286000
  },
  {
    "username": "bishopxmxy",
    "rating": 5.0,
    "comment": "30 2023 4",
    "timestamp": 1702508400
  },
  {
    "username": "ultimoratio",
    "rating": 5.0,
    "comment": "One of the best Ameritrash I've played. Quickfire with nutty powers as your character descends to madness. Mechanisms are pretty simple. It's a rough and ready game. Although the storytelling could have been a bit better. This stands in contrast with Mansions of Madness where the theme permeates better, but the game takes pretty long to play that it doesn't really improving the storyline. Might increase this game's rating with more plays.",
    "timestamp": 1681509600
  },
  {
    "username": "Weird WWII",
    "rating": 5.0,
    "comment": "Love the minis!",
    "timestamp": 1679266800
  },
  {
    "username": "LotrScaper",
    "rating": 5.0,
    "comment": "Consistently wished I was playing Machina Arcana instead for a Lovecraftian tactical game, or Marvel United for a high-variability-deal-with-minions-until-you-can-unlock-the-boss style game. Very limited movement options, particularly given that monsters follow you regardless of your movement and presence of other investigators. Limited action options and ways of dealing with enemies.\n\nRelatively easy setup, good theme and power-up system (although Machina Arcana does the theme better in emphasizing how horrifying and powerful the creatures can be, and the power-up system better through its excellent loot-linking that provides real new options for dealing with threats).\n\nThis clearly thrives on variability, but diving into that variability makes the game much more onerous to store and setup (and it is harder to mitigate those challenges here than in Marvel United).",
    "timestamp": 1677970800
  },
  {
    "username": "Zengoeroe",
    "rating": 5.0,
    "comment": "If you are going to make a game with miniatures, then just make sure that your map pieces are big enough to fit the miniatures on, otherwise... it is just silly and especially messy.\n\nGamewise; just chucking dice, I expect much more from big box games nowadays.\n\nNo intention to play this one again.",
    "timestamp": 1667170800
  },
  {
    "username": "jormungandr",
    "rating": 5.0,
    "comment": "It was acceptable but didn't come together as more than the sum of its mechanics. Eldritch Horror felt like it gave me a similar pulp feel with cleaner mechanics and less downtime.",
    "timestamp": 1657317600
  },
  {
    "username": "Zondag",
    "rating": 5.0,
    "comment": "The outcome of a single game is heavily influenced by the combination of characters, mission and madness cards.",
    "timestamp": 1654552800
  },
  {
    "username": "brapsmagic",
    "rating": 5.0,
    "comment": "some really interesting stuff and great variability of scenarios but sadly, too often the game just becomes a meaningless frenzy by the end.",
    "timestamp": 1646089200
  },
  {
    "username": "zgabor",
    "rating": 6.0,
    "comment": "Hmm, kifejezetten jó ötletekkel tele a játék, még a sokat látott Arkham-fanok is elégedetten csettinthetnek. Mégis, engem vhol a közepénél elvesztett mindkét küldetés, egyértelműen esélyünk sem volt a szar dobásoknak köszönhetően - kár, h megint alapvetően egy ilyen dolgon csúszik el egy ameri játék.\n—-\nHárom évvel később… A második felvonás már kifejezetten jobban sikerült, nagyon nagy nehézségek és izgulások árán, de szó szerint az utolsó pillanatban sikerült legyőzni a szörnyet. Ugyan a másik két játékostársam hősies halált halt, én az utolsó kardcsapásommal bevittem a végső döfést, így végülis megnyertük a játékot.",
    "timestamp": 1762629120
  },
  {
    "username": "cenny",
    "rating": 6.0,
    "comment": "Not my cup of Tea, but much better than all the other co-op Lovecraft games I’ve played (I’m looking at you eldriths horror), except for mansion of madness which is a tiny bit better than this.",
    "timestamp": 1760220000
  },
  {
    "username": "GibberishTea",
    "rating": 6.0,
    "comment": "Too much between turns maintenance, and slightly too hard",
    "timestamp": 1759874400
  },
  {
    "username": "Adri_corr",
    "rating": 6.0,
    "comment": "(1, 5) #players\n\nJugado:\n\nS1E1 cthulhu (+) (KO)\nS1E2 cthulhu (KO)\nS1E3 cthulhu (KO)\nS1E4 cthulhu (KO)\nS1E5 cthulhu\n\n100 €",
    "timestamp": 1759010400
  },
  {
    "username": "Jux_",
    "rating": 6.0,
    "comment": "Dice fest which has it's moments. Was still hoping more out of it. More crazy stuff.",
    "timestamp": 1758578400
  },
  {
    "username": "Minh_Nguyen",
    "rating": 6.0,
    "comment": "First play was underwhelming (1st episode of season 3 I think) and ran very long, but I could see this definitely going up.",
    "timestamp": 1758492000
  },
  {
    "username": "hihimorton",
    "rating": 6.0,
    "comment": "Played the first mission.\nIt's ok to me.",
    "timestamp": 1751493600
  },
  {
    "username": "andy61",
    "rating": 6.0,
    "comment": "Not my type of game, but fun for a few plays.",
    "timestamp": 1750802400
  },
  {
    "username": "Tygrone",
    "rating": 6.0,
    "comment": "More fun then i thought it was gonna be; unfortunately Cthulhu as a theme doesn't allow to much variation between them - if it's elders signs, mansions, eldritch horror, etc, you're always doing the same thing, trying to prevent an old one coming into the world.",
    "timestamp": 1749160800
  },
  {
    "username": "dhable",
    "rating": 6.0,
    "comment": "I am a sucker for these Cthulhu themed games. DMD makes the smart decision of avoiding the \"investigate\" part of the formula, which can lead to fragile game play if the players can't figure out the story. Instead, DMD focuses on the action of battling and defeating the monsters, making the objective for the players straight forward. I would be willing to play it periodically but I don't think it's worth owning.\n\n\nRating History:\n15 May 2025 - 6 (1 play)",
    "timestamp": 1747260000
  },
  {
    "username": "spettromartello",
    "rating": 6.0,
    "comment": "discreto, ma non mi ha entusiasmato\ndue partite al momento.\ncooperativo a sfighe con \"eroi\" che si potenziano durante la partita\na parte una strategia di base, pianificazione soprattutto a breve termine.",
    "timestamp": 1747000800
  },
  {
    "username": "Destrio",
    "rating": 6.0,
    "comment": "Pros:\n+ Lots of scenarios given how you combine both Old One and scenario to create the session.\n+ Dice chucking is dramatic and the game ramps up really well.\n+ Sessions play relatively quickly compared to similar games.\n\nCons:\n- No player aids that summarize the game easier than the rulebook\n- The player characters don't really get me into the setting and overall the world they build here doesn't seem as rich as other Lovecraft-inspired horror games.",
    "timestamp": 1745704800
  },
  {
    "username": "Fevin",
    "rating": 5.8,
    "comment": "Ameritrash full coop.\n\nDu zombicide +, mieux foutu et plus thématique.",
    "timestamp": 1745013600
  },
  {
    "username": "DexGeek",
    "rating": 6.1,
    "comment": "Owner: Jake",
    "timestamp": 1744754400
  },
  {
    "username": "WonkoMT",
    "rating": 6.0,
    "comment": "Never really clicked. Being able to level up your character can be a lot of fun, and the variety of characters adds a lot to the game. But it ultimately comes down to dice rolls, so if you aren't rolling well, there's really no hope for anyone.\n\nThe final boss mechanic also drags the game on a ton and feel more like a grind than an actual gameplay experience. But when you're able to create fun stories out of seemlingly hopeless situations, it's a hoot.",
    "timestamp": 1741734000
  },
  {
    "username": "dunedragn",
    "rating": 6.0,
    "comment": "10",
    "timestamp": 1740697200
  },
  {
    "username": "Dirty30",
    "rating": 6.0,
    "comment": "Hmmm. Only played this once right around the new year. After any other game, I can usually tell if I would want to play the game again. But in this case, I'm a little staggered. I like the theme and look of the game but after that one play I don't think I feel like setting this up again and having to try to get to the boss and beat Cthulhu not once, not twice, but three times. Felt like a real slog to me. I rated it a 6 as BGG's rating says \"ok-will play in the mood\" but when I look at the box, I haven't been in the mood to play since. Was hoping for a better experience after I heard the hype for this series.\n\nUpdate: Sold",
    "timestamp": 1740351600
  },
  {
    "username": "rooninzen",
    "rating": 6.0,
    "comment": "Un juego sobrevalorado a mi ver. Poca rejugabilidad. La calidad de los componentes es muy buena....solo eso.",
    "timestamp": 1737414000
  },
  {
    "username": "shugiosha",
    "rating": 6.0,
    "comment": "Good, but really took the joy and mystery out of the mythos. Its a cthulian beat em up. Not what i like.",
    "timestamp": 1737154800
  },
  {
    "username": "saoirseclerks",
    "rating": 6.0,
    "comment": "适合喜欢克苏鲁题材的人",
    "timestamp": 1735945200
  },
  {
    "username": "KiwiWolf",
    "rating": 6.0,
    "comment": "I enjoyed this as a bit of a romp through some baddies but wanted a bit more depth. I can see this being great with a higher player count though (I play solo).",
    "timestamp": 1732921200
  },
  {
    "username": "d3athjest3r",
    "rating": 6.0,
    "comment": "I think it's an ok game if you love rolling A LOT of dice. Although I feel it's MEGA overrated in its current spot on BGG (!!rank overall 58!!). After having played around 20 matches for me it has just too many flaws:\n\n- It's hard to keep track of all the stuff that is going on. You might have several bonuses in terms of how many dice you have to roll and/or what item you can use. Also, depending on the phase of the boss there are additional things to consider, enemies to spawn, etc. which feels messy and hard to track\n- Some characters just feel mandatory to have (melee and ranged), the others that don't have one of these traits just feel weak.\n- On YT there people listing this game as a awesome solo game! In my opinion even when two-heading this game your options are very limited. You basically move with your 2 characters from room to room and roll dice. Only when playing with 3 or 4 characters there are some \"tactical\" decisions to make\n- But the MAIN concern I have with the game is its length. It's just too freakin long for what it delivers. Sometimes it's not even close, but then you have already spend 1-1.5h, and then you just lose because of some bad dice rolls. That left us really unsatisfied after such a long time investment. Also the length given on the box of 90 to 120 minutes seems wildly underestimated for some of the scenarios. We were sometimes playing for 2.5h+!\n\nThis game doesn't deserve to be in the top 100. I normally wouldn't take the time to write a review, but I feel like they were too many deceptive reviews and people saying this is an ammmaaazzzinnng game. It's not.",
    "timestamp": 1732057200
  },
  {
    "username": "beasttboi",
    "rating": 7.0,
    "comment": "fun to play, but kind of lacks replay-ability other than playing the same episodes with new groups. I don't think this is an issue specific to this game though, and they make up for it by regularly releasing new seasons. also it isn't advertised as the most replay-able thing ever.",
    "timestamp": 1762038000
  },
  {
    "username": "frasti",
    "rating": 7.0,
    "comment": "New core x2, unspeakable x2, season 2 x2, black goat x3, yog sothoth x2, r'yleh expansion w/o giant cthulhu, iron maiden eddies 3pk+promo, 22/11/14 gamefound dice tower 22 promo, comic vol 1, comic vol 2 x2, scarlett, ryleigh trait x2, extra dice, frost dice x2, fear of unknown x2, unknowable x2, season 4 x2, animal allies x2, ithaqua x2\n\n23/12/10 V backerkit dark providence\n\n22/11/28 backerkit all knowing pledge x2 + frost dice + unspeakable box\n\n24/12/04 V GF all seeing pledge, frost dice, free mini godzilla, scarlett promo\n\nSleeves MDG-7152, MDG-7028\n\nOptional house rules: 1. Add in rogue Investigator at furthest spot, moves 1 space or attack the space its in. Rolls 2 black 1 green, does not scale on leveling, but does skill up leveling to the highest player level. Repeat spawning upon death for n more times, where n is number of players. Upon player level up, immediately gain a free action",
    "timestamp": 1761084000
  },
  {
    "username": "netfilterz",
    "rating": 7.0,
    "comment": "Enjoyed both plays.",
    "timestamp": 1760997600
  },
  {
    "username": "Ajohnny101",
    "rating": 7.0,
    "comment": "Fun thematic coop romp",
    "timestamp": 1760738400
  },
  {
    "username": "enigma9119",
    "rating": 6.5,
    "comment": "Played Fear of the Unknown, but without the unknown monsters so its essentially the same rules as this box. Overall, its good fun to just roll some dice and beat big baddies. Really like this idea that insanity makes you stronger & stronger.. but too much and it kills you. But there's not as much thinking involved and as primarily a Euro player, I don't feel drawn to play this game.\n\nTowards the end, it starts feeling a little repetitive as you are just rolling dice to attack all the time, and makes you wish it was over already. Still, the theme is well implemented, the minis are majestic, and humor on the player character cards & discovery cards is on point, so I can see why many people recommend it. But for me, its just an ok game.",
    "timestamp": 1759615200
  },
  {
    "username": "LoKag",
    "rating": 7.0,
    "comment": "A surprisingly light cosmic horror co-op adventure. While I loved the varied missions with different objectives, discovery cards and monsters, the intriguing sanity-meter where you become stronger the closer you are to dead, and the quick turns, I still felt like something was \"missing\". It does not help that I've played, and loved, Arkham Horror LCG for years and in comparison to it, C:DMD felt at places overly simplistic.\n\nIt is, however, also its biggest draw: It's surprisingly quick to setup and once you get going, the turns flash by as you throw dice and hope for the best. Luck is major factor and might not be for all - while I seemed to fumble every other roll, my wife ended up soloing the last two phases of the boss on her own quite a few times, winning the scenario for \"us\". Yay, go team!\n\nIt can be exhilirating, but frustrating too, and while I can see many appreciate the fact that it isn't a long campaign game, I would have hoped for a bit more meat in it where you could develop your characters and sink deeper into the void. Were it cheaper, and had more missions, I still could see myself owning it if only for some late-night cultist slaughtering-",
    "timestamp": 1759096800
  },
  {
    "username": "Zozobaltazar",
    "rating": 7.0,
    "comment": "Sukhy 10",
    "timestamp": 1752530400
  },
  {
    "username": "blackpawl",
    "rating": 7.0,
    "comment": "2025 / 2024",
    "timestamp": 1751234400
  },
  {
    "username": "dtmoney75",
    "rating": 7.0,
    "comment": "1 Play\n\nPlayed at: 3",
    "timestamp": 1750629600
  },
  {
    "username": "bhudson1972",
    "rating": 6.5,
    "comment": "This did not live up to the hype. Just feels too bloated and the game play is a hot mess. The characters did have some interesting powers that can be increased with gaining insanity. I'm just not liking a game that is constantly rolling more and more dice.",
    "timestamp": 1750543200
  },
  {
    "username": "JamieMulligan",
    "rating": 6.5,
    "comment": "It's enjoyable with an amazing theme, but there's no puzzle, it's kind of you do a thing I may do a thing. Strategy is cooperative but suffers from quarter backing and also kind of meh battle and movement systems.",
    "timestamp": 1749938400
  },
  {
    "username": "Smottz",
    "rating": 8.0,
    "comment": "⌚ 9/2026 - (7/2026) - Gamefound; Project Status\n\n1 2 3 4 5 ☮️\n+ season 2; fear of the unknown (season 3); season 4; forbidden reaches (season 5); season 6; animal allies; atlach-nacha; exclusive insanities; extra campaigns; godzilla; ithaqua the wind-walker; scarlett; unspeakable box (stretch goals 1); unknowable box (stretch goals 2); unimaginable box (stretch goals 3)\n\n◈ esoteric\n◈ mix & match\n◈ resources\n\n5/2023",
    "timestamp": 1762470000
  },
  {
    "username": "EvolvingMonkey",
    "rating": 8.0,
    "comment": "1-5 players\n3 is a sweet spot apparently",
    "timestamp": 1762470000
  },
  {
    "username": "ER23",
    "rating": 7.8,
    "comment": "Very simple but fun game.\nThe price and low replayability in the base box are the main drawbacks.",
    "timestamp": 1762124400
  },
  {
    "username": "CerberusPidza",
    "rating": 7.5,
    "comment": "A fast-paced cooperative run and gun games.\n\nGameplay focuses on scenario-based missions where 1–5 investigators race against an escalating doom track. Each character grows stronger (and crazier) as sanity slips away, creating a thrilling balance between power and self-destruction. The modular episode system and multiple Great Old Ones add a lot of replayability, while the detailed miniatures and art design capture the over-the-top chaos of cosmic horror perfectly.\n\nA well-designed and immersive experience that captures the intensity of Lovecraftian horror through action and not only atmosphere.",
    "timestamp": 1761951600
  },
  {
    "username": "timelesseye",
    "rating": 8.0,
    "comment": "+ Yog Sothoth + Black Goat of the Woods + Season 2 + Ithaqua the Windwalker + Fear of the Unknown + Season 4 + Comic Book Extras Vol. 2 + Unspeakable Box + Unknowable Box + Extra Dice + Frost Dice + R'lyehian Seizures Promo + Animal Allies",
    "timestamp": 1761429600
  },
  {
    "username": "Holzmichel01",
    "rating": 7.5,
    "comment": "I like this game really a lot - it's such a nice mix of tactical, cooperative play and upgrading & killing monsters/dice chucking, and it is guaranteed to ramp up the tension & spectacle in the end - great!\n\nBut as much as I like it, I can't give it a higher score than 7.5 - it's at least 30 minutes too long (for us it's always ~3 hours in a 4-player session); it gets very messy and overwhelming in the end and it is so easy to miss a rule when more and more effects take place each turn/round; replayability is only acceptable when buying 1-2 expansions (elder or/and season box, or when you only play every few months); when doing that you'll reach the 160$ price tag quickly which is too much imo; the box component organisation and set up and esp. the reboxing experience after a game session is noticable bad.\n\nIt's a shame... I feel with some more development time or tweaking reg. the above downsides this game could've been a 9 for me.\n\nIf Eric M. Lang would find a balance between everything this game offers and his way more streamlined Marvel United, it would be perfect for me.",
    "timestamp": 1760824800
  },
  {
    "username": "bdavid0127",
    "rating": 8.0,
    "comment": "H",
    "timestamp": 1760738400
  },
  {
    "username": "StrongbowGold",
    "rating": 8.0,
    "comment": "D-5",
    "timestamp": 1760738400
  },
  {
    "username": "MoochyMania",
    "rating": 8.0,
    "comment": "* Solo Mode ✓\n* Sleeved - maybe",
    "timestamp": 1760652000
  },
  {
    "username": "WaldoJeffers",
    "rating": 8.0,
    "comment": "5 Players",
    "timestamp": 1760652000
  },
  {
    "username": "mrssallyintown",
    "rating": 8.0,
    "comment": "Similar to mansions of madness",
    "timestamp": 1760220000
  },
  {
    "username": "Nanferun",
    "rating": 9.0,
    "comment": "Great and simple coop game.\n\nIts some kind like zombicide, but overall better",
    "timestamp": 1762210800
  },
  {
    "username": "davidxiang",
    "rating": 9.0,
    "comment": "很爽，规则不复杂，对我刚刚好",
    "timestamp": 1762124400
  },
  {
    "username": "jagiell82",
    "rating": 9.0,
    "comment": "Fun dice chucker",
    "timestamp": 1761778800
  },
  {
    "username": "yoda844",
    "rating": 9.0,
    "comment": "H1",
    "timestamp": 1761519600
  },
  {
    "username": "Superunknown1257",
    "rating": 9.0,
    "comment": "Scenarios Complete\n\nExpansions",
    "timestamp": 1761519600
  },
  {
    "username": "Vormwald1",
    "rating": 9.0,
    "comment": "Very fun fast-paced game set in Cthulhu mythos. Love how the tenseness and tempo build to the end. Point docked for the rulebook which could definitely be better.",
    "timestamp": 1760911200
  },
  {
    "username": "PBandJellyfish",
    "rating": 8.5,
    "comment": "@TX",
    "timestamp": 1760824800
  },
  {
    "username": "paimon616",
    "rating": 9.5,
    "comment": "신나게 학살할 수 있는 미니어쳐게임.\n대부분의 친구들에게 실패없이 먹여볼 수 있다.\n들고다니기 부담스러운 것만 빼면 아컴호러 카드게임보다 성공률이 좋다.",
    "timestamp": 1760652000
  },
  {
    "username": "awpacuda",
    "rating": 9.0,
    "comment": "Includes Seasons 2, Yog Sothoth, Black Goat",
    "timestamp": 1760565600
  },
  {
    "username": "ChaosXblade",
    "rating": 9.0,
    "comment": "Goal: Complete a fun puzzle-like objective and than fight the big bad.\n\nAs you become more powerful, so does the boss. Highly customizable. Make sure players have agency (not tell them what to do).",
    "timestamp": 1760306400
  },
  {
    "username": "JHunter101",
    "rating": 8.5,
    "comment": "Rating Elaboration:\n\nBase Game System (x5): 9.0\n\nInvestigators (x3): 7.0\n\nElder Hastur (x3): 9.0\nElder Cthulu (x3): 9.0\n\nS01 E01: 8.0\nS01 E02: 9.5\nS01 E03: 7.0\nS01 E04: 9.0\nS01 E05: 8.5\nS01 E06: 8.0\n\nFinal Rating: 8.5",
    "timestamp": 1760133600
  },
  {
    "username": "CaskA1981",
    "rating": 9.5,
    "comment": "Sleeved",
    "timestamp": 1762646400
  },
  {
    "username": "ClintAchilles",
    "rating": 10.0,
    "comment": "It's such a fun experience, with a great game arch. The push your luck element mixed with powering up the crazier you get just gives such a bombastic time that makes you want to come back for more. There's really too much content at this point, and then it becomes an issue getting it to the table, but I always look forward to getting into this game.",
    "timestamp": 1762383600
  },
  {
    "username": "KRWoods1",
    "rating": 10.0,
    "comment": "I quite enjoy this. However, the fact that the base box has only two Elder Gods and the Season 2 box has none is kind of disappointing. The Kickstarter pledge included a few more, and those are kind of critical to add enough variety to the game. Regardless, the episodes each have a nice different feel, and the rules are pretty straightforward. I have been having a lot of fun with it. I am looking forward to more, but hopefully the new stuff focuses on new and different enemy types, rather than just adding to an already bloated roster of hero characters.",
    "timestamp": 1762383600
  },
  {
    "username": "Cabbage1012",
    "rating": 9.5,
    "comment": "Great game! Fun dice chucking with cool upgrades, interesting scenarios, and nice minis. But you're still at the mercy of dice rolls. Lots of times it comes down to an exciting last roll. However, it doesn't play well at 5. Best at 2-3 characters.\n\nWith the additional Seasons 3 & 4, the storage and setup are becoming an issue, downgrading to a 9.",
    "timestamp": 1762297200
  },
  {
    "username": "Rezznor",
    "rating": 10.0,
    "comment": "Sooooo good!",
    "timestamp": 1761951600
  },
  {
    "username": "zkaufman",
    "rating": 10.0,
    "comment": "Main cards sleeved. Extra dice pack. Non-human figures painted. Upgraded portals.\n7/22 - 8.5 after playing Scenario One 3 times.\n10/22 - Rating moved to a 9 after 11 plays.\n2/23 - 9.5\n12/24 - 10 (best in class Co-op, Dungeon Crawl)",
    "timestamp": 1760652000
  },
  {
    "username": "fazermozg",
    "rating": 10.0,
    "comment": "+",
    "timestamp": 1760652000
  },
  {
    "username": "Exod1n",
    "rating": 10.0,
    "comment": "Cthulhu: Death May Die is easily one of my all-time favorite games. It combines a rich, immersive theme with engaging and strategic gameplay that never gets old. The tension and chaos that unfold during every playthrough perfectly capture the Lovecraftian horror vibe.\n\nThe theme is absolutely dripping from every aspect—whether it's the gorgeous miniatures, the flavorful text, or the way the gameplay mechanics tie into the story. It keeps me on the edge of my seat every time, and I love the sense of desperate cooperation as we battle against impossible odds.\n\nFor me, this is a perma-game. It’s never leaving my collection, and I can’t wait to dive into more episodes and expansions. If you’re a fan of thematic games, cooperative challenges, or the Cthulhu Mythos, this is an absolute must-play.",
    "timestamp": 1760133600
  },
  {
    "username": "hans4rd",
    "rating": 9.7,
    "comment": "Quick and simple, easy to pick up, fun crawler.\nAlthough a lack of story and therefore theme, drags this down a little. But for a casual, run & gun experience, there are few better.",
    "timestamp": 1759960800
  },
  {
    "username": "bustilho",
    "rating": 10.0,
    "comment": "My TOP 1",
    "timestamp": 1759356000
  },
  {
    "username": "Ryalyn",
    "rating": 10.0,
    "comment": "Really enjoying this game. I like the press your luck aspect of the leveling and the dice roll mitigation options. I like the multitude of monster / scenario combos as well as the characters. The mix-and-match aspect allows individual elder gods, characters, and scenarios to remain fresh and worth multiple playthroughs. The component quality is good. The setup/tear-down seems to be faster than Aeon's End and Gloomhaven which both take FOREVER to setup.\n\nPerhaps my only complaint is that it's modular nature makes me not want to re-box the content to make it more space efficient. This CDMD is fast becoming a huge space hog as I collect all of the expansion content they offer.",
    "timestamp": 1758492000
  }
]