[
  {
    "username": "ultimoratio",
    "rating": 1.0,
    "comment": "Deck builder and co-op? What was I thinking when I traded this",
    "timestamp": 1757887200
  },
  {
    "username": "GhostImperium",
    "rating": 1.0,
    "comment": "Fantasy",
    "timestamp": 1740610800
  },
  {
    "username": "kratyloss",
    "rating": 1.0,
    "comment": "Monotonna schematyczna rozgrywka przypominająca wbijanie gwoździ w ścianę. Brak głębi taktycznej i strategicznej walisz obrywasz walisz obrywasz nic wiecej. Zdanych możliwości zmiany taktyk budowania kombosów z kart, rozbudowanej kooperacji itp W gre zagrałem raz i juz nie mam ochoty aby kiedykolwiek sięgnąć do niej wiecej.\nTypowa gra dla fanów prostej i mało wyrafinowanej rozrywki",
    "timestamp": 1646089200
  },
  {
    "username": "Boardgamehoser",
    "rating": 1.0,
    "comment": "Very much dislike.",
    "timestamp": 1632175200
  },
  {
    "username": "mallie_67",
    "rating": 2.0,
    "comment": "Je n'aime pas mais peut-être a réessayer",
    "timestamp": 1681682400
  },
  {
    "username": "Luke the Flaming",
    "rating": 2.0,
    "comment": "[Played more than 100 times]\n\nA deckbuilder with a few well implemented twists (cooperative, no reshuffling and you may keep cards between turns as in most traditional card games, allowing an overall finer impact on strategy, but giving up a whole category of effects. It also tends to limit replay value as you go for consolidated \"combos\" that become guaranteed).\n\nDecent variety (cards, characters, enemies, etc.), albeit not so accentuated as in other deckbuilders.\n\nSome odd design choices (e.g. you do not shuffle your decks, but constantly need to shuffle the Turn Order cards; or the option to win by surviving the whole enemy deck rather than killing the boss possibly leading to odd \"turtling\" strategie; the mage whose speacial ability is useless - in fact, detrimental - unless you are going for such strategy; the advanced version of one enemy is broken and probably has never been playtested; etc.).\n\nUPDATE: atrociuos customer support (nine months to change their answer into \"buy the game anew\"). No intention to support such people. Rating: 6 --> 2.",
    "timestamp": 1551049200
  },
  {
    "username": "High Elf Andrew",
    "rating": 1.5,
    "comment": "Why did I agree to play this knowing I would hate it? Urghhh",
    "timestamp": 1549321200
  },
  {
    "username": "hadz",
    "rating": 2.0,
    "comment": "With apologies to everyone involved with the game, I am going to give my honest thoughts:\nIf I wanted a soulless, joyless grind, inevitably followed by an early death, I'd move to the USA and become a wage-slave in capitalist-utopia.\nJokes aside, this is almost certainly the least interesting and rote deck-builder I've ever played. It seems to me that every (admirable) attempt at changing up the genre here has fallen terribly flat. Notwithstanding the designer's intentions, all mages play relatively the same and enemies, despite their differences in play, all feel almost exactly the same in progression.\nI cannot actually think of a redeeming feature, so I think I'll leave it here.\n(PS. My review is probably exacerbated by the fact that I've just recently played a few games of Automobiles, and that game leaves this in its dust...figuraliteralativally.)",
    "timestamp": 1481842800
  },
  {
    "username": "stepolk",
    "rating": 2.8,
    "comment": "Kraków",
    "timestamp": 1756936800
  },
  {
    "username": "Killi",
    "rating": 3.0,
    "comment": "Hated it.\n\nI get that it has a high skill ceiling, but there is nothing in this game that I like, I played it 3 times and did not enjoy any of the times I played.",
    "timestamp": 1756504800
  },
  {
    "username": "BoardGamingCouple",
    "rating": 3.0,
    "comment": "3/5\nThe Aeon's End series is a solid co-op deckbuilder like Star Realms Frontiers, but it isn't as good as other games (Marvel Champions). The random turn order is clunky (smoother & faster to just rotate players, then nemesis). The series has found tons of success. Best at 2P. Theme is generic and lacking. 300+ Plays\n\n4/5\nSome of the extra expansion cards, characters, & enemies are excellent. The legacy version was excellent. The game flowed very smoothly. The story was a bit lacking but the content was solid. We arent a fan of campaigns/expeditions nor the extra game length and fiddly bits.\n\nWith most big games it makes sense to minimize your content to what you love and what gets played; otherwise, there is just too much stuff that will not see play.",
    "timestamp": 1748383200
  },
  {
    "username": "lililililil",
    "rating": 3.0,
    "comment": "Limited player variance",
    "timestamp": 1747432800
  },
  {
    "username": "HughCross",
    "rating": 4.0,
    "comment": "co-op deck builder with loooots of set up and upkeep and tracking, also have to consider how to discard, that on paper makes it for a fun mechanic but in practice just brings the pace down and for extra layers strategy is not that interesting. I prefer deck builders more to the point .",
    "timestamp": 1756850400
  },
  {
    "username": "Sorreoc",
    "rating": 4.0,
    "comment": "Me'l van deixar i no em va agradar",
    "timestamp": 1755640800
  },
  {
    "username": "Valcurdra",
    "rating": 4.0,
    "comment": "Decent game with some cool attributes but some really annoying mechanisms and bland theme take the shine off.\n\nBest aspect of this game are the different nemesis monsters that are very asymmetric and really add an entirely new flavor to each game when you change them up. Paradoxically though the actual player characters are no so asymmetric and it kinda feels like the bad guys get to have all the fun!\n\nThe gameplay is pretty much standard co op deck builder stuff that overall is pretty well designed, but nothing outstanding\n\nThe art and theme are extremely vanilla fantasy which definitely detracts from the game, it feels very mechanical and abstract.\n\nMechanically there are some failed attempts at providing a point of difference that sounded good but absolutely don't work.\n\nYou customise your shop prior to the game but you can't just randomise as you will get crushed without a coherent strategy to what you pick. In this style of game I definitely prefer to be able to randomise setup but it's annoyingly not really possible here.\n\nBy far the most irritating thing is the way turn order is randomised. This can lead to horribly unlucky timing where your enemy gets 2-4 turns in a row, and triggers very powerful effects before you can even react. This means the game is extremely lucky and frustrating at times.\n\nLastly I feel the need to mention that this game is directly superseded by Big book of madness, which is also a co op deck builder with a similar theme but with way better production and gameplay and is actually far less expensive.",
    "timestamp": 1752616800
  },
  {
    "username": "Mcsc0501",
    "rating": 4.0,
    "comment": "Too hard, couldn’t beat a single game",
    "timestamp": 1741474800
  },
  {
    "username": "vitchy2",
    "rating": 5.1,
    "comment": "teamate sucks",
    "timestamp": 1759528800
  },
  {
    "username": "ppsacco",
    "rating": 5.0,
    "comment": "don't think I'll be playing this again. Overly complicated for what it is. Time hog.",
    "timestamp": 1757455200
  },
  {
    "username": "wkover",
    "rating": 5.0,
    "comment": "It's unpleasant when the nemesis randomly attacks twice in a row. Respectable fun otherwise, even if unshuffled cards are the precursor to the devil's apocalypse.\n\nWhen I try again, I will continue to play quickly and not care about winning - no offense to the owner or designer. I'd just rather have the game end sooner than later. Though a full game with a win wouldn't pain me excessively.",
    "timestamp": 1754776800
  },
  {
    "username": "Kubnu",
    "rating": 5.0,
    "comment": "I need to play it more often. Maybe then i will like it more. The mechanic is interesting.",
    "timestamp": 1752530400
  },
  {
    "username": "LordEricksson",
    "rating": 5.0,
    "comment": "Steam",
    "timestamp": 1752271200
  },
  {
    "username": "hertsjoatmon",
    "rating": 5.0,
    "comment": "Played on the app with high hopes based on the high rating on here, but came away pretty bored. Just didn’t really do anything interesting.\nI realise after more time to reflect that I prefer a variable card market to a static and like tactics rather than strategy in my deck building.\nHaving to think on my feet is more enjoyable than going to through a plan and just excecuting it over an hour or so.",
    "timestamp": 1749852000
  },
  {
    "username": "gram_niebieskim",
    "rating": 5.0,
    "comment": "My BGG:\n10 - excellent game, always have a great time\n7 - enjoyable game, I'm willing to play again\n5 - not bad but it's not my cup of tea\n2 - won't play ever again",
    "timestamp": 1745532000
  },
  {
    "username": "Elysian1196",
    "rating": 5.0,
    "comment": "It's Dominion, but co-op! Seriously though its a pretty apt comparison. Both have a similar gameplay loop, benefit from expansions, and have great, satisfying deckbuilding card play. It is however not the most difficult co-op game. I'm used to more heavier games, so I always roll over this game even on the highest difficulty, which is why I didn't rate this as high as I could have.\n\nOther points of comparison to Dominion: This game works great solo. It has definitely has a higher floor in terms of enjoyment and wackiness of stuff you can pull off, but also a lower ceiling thanks to the general consistency of what you can do. This game also has way more setup time.\n\nOverall, if you like co-op or strong solo play, like or want to try Dominion, and/or would find the deckbuilding gameplay challenging (like if you're new to this genre), this game will be for you.",
    "timestamp": 1740438000
  },
  {
    "username": "Chris Coyote",
    "rating": 6.0,
    "comment": "01/23\nLiking this one. Can be very hard (luck dependant). Locoking forward to Legacy or campaign version.\n\n10/25\nafter adding and playing the Legacy campaign last year summer, finally I decided to sell it. Coop games are not our most beloved type of games, and in case there are others - lately Bomb Busters - we prefer.",
    "timestamp": 1761429600
  },
  {
    "username": "ImZhe",
    "rating": 6.4,
    "comment": "Not that fond of deckbuilders + I'm bad at them, even though this is a great co-op one",
    "timestamp": 1759960800
  },
  {
    "username": "Arial_Narrow",
    "rating": 6.0,
    "comment": "Los juegos de construcción de mazo con mercado fijo me parecen más estáticos y repetitivos. Sí, son más estratégicos, pero siempre vas a las combinaciones óptimas. El jefe que más me convence es el más básico, el resto me parece que complican el asunto más de lo que aportan. Es un juego complicado de ganar, al menos en la cantidad de partidas que he jugado, pero no me resulta muy adictivo.",
    "timestamp": 1757109600
  },
  {
    "username": "Portwills",
    "rating": 6.0,
    "comment": "It's a bit generic and not something I usually reach for, even when I'm itching for a deck-builder.",
    "timestamp": 1756245600
  },
  {
    "username": "VincentDarlage",
    "rating": 6.0,
    "comment": "I enjoyed this. Looking forward to future plays.",
    "timestamp": 1755381600
  },
  {
    "username": "Eliya84",
    "rating": 6.0,
    "comment": "A Famous Deckbuilder, but for me to similar because all cards on the market are the same. You have the options between 5 or 6 different cards thats it for the whole game. Boring.",
    "timestamp": 1747864800
  },
  {
    "username": "Ghost CoD",
    "rating": 6.0,
    "comment": "I failed to see the apparent greatness of this.",
    "timestamp": 1744581600
  },
  {
    "username": "TForever",
    "rating": 6.0,
    "comment": "It's good for a 1 hour game. Because it is a deck building, it requires some set up, but it's fun for what it is.",
    "timestamp": 1744408800
  },
  {
    "username": "Lindemann08",
    "rating": 7.0,
    "comment": "En solo",
    "timestamp": 1762625700
  },
  {
    "username": "Infernotitan2",
    "rating": 7.0,
    "comment": "34",
    "timestamp": 1760738400
  },
  {
    "username": "kylpo",
    "rating": 7.0,
    "comment": "A good game, but I won't be adding it to my collection. Random turn order is swingy, and strategizing card stacks for the boss and heroes are fun, but I can get a more satisfying experience from deck construction games like Marvel Champions and Arkham Horror LCG.\n\nAlso, pure deck builders like this are just less interesting to me now. The repetitive cycle of wanting/needed to trash your starting cards is just not excititng anymore. I'll hold on Dominion for when I want to be nostalgic for a deck builder.",
    "timestamp": 1760479200
  },
  {
    "username": "StarStuff_29",
    "rating": 7.0,
    "comment": "What a wonderful way to play a deckbuilder. Really feel the ramp up in power as things start slow and obstacles get tougher and tougher and you feel the need to balance a ton of spinning plates and rush for the finish line of damage. What it suffers in set up time it more than makes up for in speedy play. I think it may keep its own niche in my collection from Slay the Spire (once I get it) cause it plays off of traditional deckbuilding mechanics of economy and market. It was very satisfying seeing my characters' powers, the cards in the market, and piecing together a killer synergy and that just took off. Really looking forward to getting this one out more. And it plays so well, solo with two characters.",
    "timestamp": 1760220000
  },
  {
    "username": "Ckoester1",
    "rating": 8.0,
    "comment": "Traded for Weirdwood Manor",
    "timestamp": 1762566960
  },
  {
    "username": "eltadziko",
    "rating": 8.0,
    "comment": "Promos:\n- zestaw kart Nemezis\n- Utonięcie w płomieniach\n- Wyrzutnia kryształów",
    "timestamp": 1762383600
  },
  {
    "username": "Cirosmar",
    "rating": 8.0,
    "comment": "1–4 Players\n60 Min Playing Time\nAge: 14+\nWeight: 2.80 / 5\n\nCategory:\nCard Game\nFantasy\nFighting\nScience Fiction\nCoop\nSolo",
    "timestamp": 1762038000
  },
  {
    "username": "Kaibaman209",
    "rating": 8.0,
    "comment": "Great game, need to play more, it's hard af",
    "timestamp": 1761084000
  },
  {
    "username": "hellvet",
    "rating": 9.0,
    "comment": "Don't belief what reviewers say, but do it in this case. Best deck builder ever, great variability.",
    "timestamp": 1762470000
  },
  {
    "username": "Loliiive",
    "rating": 9.0,
    "comment": "Excellent jeu de deck building, surement l'un des meilleurs. Grosse re jouabilité et en solo c'est aussi vraiment top",
    "timestamp": 1762297200
  },
  {
    "username": "josh2550",
    "rating": 9.0,
    "comment": "Probably my 2nd fave coop game behind Spirit Island. It brings a really great coop experience to the deck builder genre, far surpassing older games like Legendary in my opinion. Lots of cool expansions are available as well. Good thinking game without being too draining. Unlike a game like Spirit Island, I don't find that playing solo 3 or 4 handed slows things down much. Plays pretty fast and fluidly, with occasional spots requiring a deeper think. It is pretty easy to teach and get people playing quickly.\n\nMy only real gripe with the game, and the reason it is a 9 and jot a 10, is the difficulty level adjustability. In my limited experience (I've only played 30ish games), depending on the nemesis you're fighting, upping the difficulty by the smallest available increment can sometimes take the game from too easy to seemingly impossible if the card order lines up unfavorably.",
    "timestamp": 1762124400
  },
  {
    "username": "ditterio",
    "rating": 9.0,
    "comment": "AEON'S END (1-4 players)\n\nRulebook Aeon's End: https://boardgamegeek.com/filepage/141295/aeons-end-final-ru...\n\nStrategy Aeon's End: https://boardgamegeek.com/filepage/156596/aeons-end-beginner...\n\nCommon rule mistakes: https://boardgamegeek.com/thread/2130458/common-rule-mistake...\n\nAdelheim and Brama beat Crooked Mask\nAdelheim, Kadir and Gex beat Crooked Mask\nAdelheim beats Carapace Queen\nKadir and Mist beat Carapace Queen\nLash beats Carapace Queen\nAdelheim beats Prince of Gluttons\nAdelheim beats Rageborn\nMist beats Rageborn\n\nGreat deckbuilder",
    "timestamp": 1761778800
  },
  {
    "username": "MolceVita",
    "rating": 10.0,
    "comment": "Great cooperative adventure, very thematic, can be easily taught to newer players and rewards communication and smart strategic thinking within the group while keeping up the tension with a few necessary mechanics based on randomness.",
    "timestamp": 1762677660
  },
  {
    "username": "pappydag",
    "rating": 10.0,
    "comment": "Awesome co-op deck builder. After playing the boardgame with a friend 3 times, my wife and I were hooked, but we got the virtual version on Steam, which is really a lot easier to set up than the physical version.",
    "timestamp": 1762038000
  },
  {
    "username": "AsylumTKJ",
    "rating": 10.0,
    "comment": "One of our 2 favorite games at home.\nGreatly replayable",
    "timestamp": 1761343200
  },
  {
    "username": "Gunkus",
    "rating": 10.0,
    "comment": "One of the best in both the cooperative and deck building genre. Amazingly puzzling and keeps up the tension throughout the entire experience. With other coop deck builders it feels like you either sweep the boss or get instantly destroyed but Aeons end manages to be very well balanced. Tons of variety and leaves plenty of room for experimentation and little to no quarterbacking, so it soars as a coop and also delivers a very rewarding deck building experience especially in the explorer mode. A wonderful coop experience and can’t wait to buy more of the expansion content.",
    "timestamp": 1760997600
  }
]