[
  {
    "username": "lililililil",
    "rating": 1.0,
    "comment": "Deckbuilder / Videogame implementation",
    "timestamp": 1747432800
  },
  {
    "username": "ManEatingHippo",
    "rating": 1.0,
    "comment": "This is just bad. Why do you want a board game that is pretty much the same as the single player board game. This shouldn't exist.",
    "timestamp": 1742770800
  },
  {
    "username": "dakotamassie",
    "rating": 1.0,
    "comment": "I'm giving it a 1 because people are giving it a 10",
    "timestamp": 1737154800
  },
  {
    "username": "realjw",
    "rating": 1.0,
    "comment": "TL;DR:\n- I love the video game, have put ~400h in. This is a low effort cash grab.\n- Game plays like multiplayer solitaire despite of \"co-op\". Co-op itself is laughably bad and shallow. There goes your only reason to get this game.\n- No new content. Everything is either the same or dumbed down.\n- Simultaneous turns dont really work.\n- Plays at least 3x longer than the video game (4.5 hours)\n- Cost at least 14x more than the video game.\n\nAs per video review, It's WAY too close to the video game. If you've played the video game to the point where you revealed all the unlockables, there's almost zero new content in this game.\n\nThe cards are either exactly the same as the video game, dumbed down / simplified due to physical limitations or infused with a very shallow co-op aspect. If you like any unique mechanic in the video game, it's probably gone.\n\nCo-op is really pasted on and is laughable that it becomes the selling point of this game. There is basically no new co-op specific mechanic (there is actually one and it's absolutely useless). All you do is either shield someone else, apply weak to a monster to reduce damage and save someone, apply vulnerable to double someone else's attack or kill another enemy targeting an almost dead player. How is this even anywhere enough to counteract the ~14x more cost, ~3x more play duration and the dumbed down mechanics? Literally get any other co-op game and you would probably get the same co-op feeling or better, because the co-op in this game is sooooooo shallow and uninteresting. In all my sessions I have in this game, I always wished I had played an actual board game and not just a crappy copy of a video game.\n\nOne tiny little niche: If you have never played the video game, you'll probably like this way more than I did. I'd suggest you try it on Steam first (and refund if you dont like). But then argument becomes a full circle, where if you like the video game, the board game offers nothing new and is just a worse version in every single way. Definitely try the board game if you have the chance. But I would never recommend you to blindly but this game, ever.",
    "timestamp": 1733266800
  },
  {
    "username": "Silver Avocado",
    "rating": 1.0,
    "comment": "Not exactly a board game. Perhaps more a piece of post humanist performance art you have somehow signed up to act out for yourself.\n\nA completely accurate representation of the computer game rendered into cardboard. Not a second of thought has been put into adapting it into a board game or how it would actually play. As a result this is ridiculously bloated with fiddly faffing. Your play area will be surrounded by dozens of trinkets you have to check before doing any action, tracks you will run from start to finish in every fight, tokens toggled before and after you do anything, etc, etc. The scale of tasks required to complete one small fight, even one action, is just all wrong. Each fight is the equivalent of a whole game of Dominion, but results in the opportunity to make a single card change to your deck.\n\nSlay the Spire is an irreverent, independently designed computer game that was crafted with care to prioritise game play over graphics and other commercial bells and whistles, by creators who clearly love board games. It is innovative, elegant and minimalist. This game is nothing like it.\n\nIf you love Slay the Spire and want to play the board game that inspired it, play Dominion (easy to solo play online, too). If you want a sprawling fantasy adventure that feels like a computer games, is built around deck building and full of meaningful battles and thought out design, play Mage Knight.",
    "timestamp": 1717884000
  },
  {
    "username": "The Screaming Brain",
    "rating": 1.0,
    "comment": "Played through it once and realized I already owned this game and logged 40+ hours with it on my PC. What a waste of money.",
    "timestamp": 1713996000
  },
  {
    "username": "Razcar",
    "rating": 2.0,
    "comment": "Initial Rating: 2\nWas hopeful this could be a fun cooperative deck building game but it just fell flat. Not a big fan of cooperative games as it is but this one was just so repetitive and hardly any decision making. Here's my swords, I guess I'll use them on a monster. Which one? Who cares because they all have to be defeated. Wanted my HP to start at 0 in this game but we completed one act, which was too much for me.",
    "timestamp": 1760911200
  },
  {
    "username": "LaurenV",
    "rating": 2.0,
    "comment": "Just play the video game. Solo/co-op mode is unbalanced and janky.",
    "timestamp": 1748037600
  },
  {
    "username": "michalb7",
    "rating": 2.0,
    "comment": "Too long.",
    "timestamp": 1740783600
  },
  {
    "username": "matth6295",
    "rating": 2.0,
    "comment": "Company forgot to send me multiple pieces and then wouldn't send me them. Disappointing experience from a disappointing company. Was really looking forward to this and they turned it into an awful experience.",
    "timestamp": 1722549600
  },
  {
    "username": "kyoysc",
    "rating": 2.0,
    "comment": "why not play the PC version? What is the meaning of cloning a video card game to a physical card game.",
    "timestamp": 1720303200
  },
  {
    "username": "NormandyWept",
    "rating": 2.0,
    "comment": "This flawed experiment tries to keep too much (almost everything, save scaling down some numbers and making a few minor tweaks to some status conditions) from the excellent videogame, which had heavily leveraged having a computer available to manage status conditions, damage modifiers, and on-trigger abilities for you. Managing all of that yourself is tedious to say the least. Adding cooperative play is a fun idea, but by not removing enough complexity elsewhere, that just further contributes to game length, which already feels excessive - you're looking at over an hour per Act for a two-player game, at which point the game really outstays its welcome.\n\nI think a good game could have been made by designing a different combat system with a totally different level of abstraction, keeping the spirit, fun deck-building, and interesting random encounters of the original videogame, but with a new design to ensure a snappy and fun experience. Instead, this design has tried to keep too much of the original and feels like a mediocre remake in card and plastic, rather than an actual adaptation; in other words, it's pretty much exactly what you might fear \"Slay the Spire: The Board Game\" would be.",
    "timestamp": 1717884000
  },
  {
    "username": "KingMePlease",
    "rating": 3.0,
    "comment": "First impressions 10/18/25\n- not my style of game\n- deck building was weak and uninteresting\n- no real interesting decisions, just play the best cards from your hand and determine which monster to take down, rinse and repeat",
    "timestamp": 1760824800
  },
  {
    "username": "Vark",
    "rating": 3.0,
    "comment": "Very complicated.\nAwful setup",
    "timestamp": 1756677600
  },
  {
    "username": "The_Mana_Leek",
    "rating": 3.0,
    "comment": "Solo rating only.\n\nThe game difficulty is BRUTAL solo. It was clearly designed to be a multiplayer adaptation of the video game and solo was tacked on as an option, but the imbalance between player counts is off the charts. The mechanics are very fun (it's just Slay the Spire which is fun!) but prepare to lose non-stop in frustrating, un-fun ways if you're playing solo.\n\nThe game also has one of the worst rulebooks I've seen (and I have the most recent updated version). The sleeves also, which are mandatory, are poor quality and start peeling after a handful of runs. My game also had sleeves of different sizes so you can feel the difference between cards I sleeved earlier and cards I sleeved later.",
    "timestamp": 1749333600
  },
  {
    "username": "Chyy",
    "rating": 3.0,
    "comment": "I played 1-3p and only 2p was good. It's great, but it's so long I don't want to play it and it's been quite easy.\n\nIt's a great reminder to play more Slay the Spire and Spirit Island. Constant rewards also brought Mage Knight to my mind.",
    "timestamp": 1747519200
  },
  {
    "username": "Ranior",
    "rating": 3.0,
    "comment": "This is precisely what I feared a Slay the Spire Board Game would be--it's a far too faithful adaptation of the video game to a physical medium.\n\nBut why would I want an almost direct analog of the excellent video game? I would not--the computer is so critical to tracking so many effects, health, numbers, not to mention the sheer shuffling and drawing. The video game lets you play runs in a snappy and enjoyable timeframe, the board game by trying to keep almost everything makes the players do far too much tracking and bookkeeping themselves, making the game take way too long for the decisions and fun being had.\n\nThe one positive is that the board game does at least allow for cooperative play with up to four players--that is neat. It's fun to get to go on a run together through the acts, but mostly it makes me wish for that to be an option in the video game. It also has the issue many cooperative games do, in that there's almost certainly a best answer for what everyone should do on a given turn, but to talk it out and work through it is tedious and boring and unfun and prone to quarterbacking. Yet playing fast and loose by the seat of your pants might get you all killed, so the game rewards you for going slow and methodical and making the whole experience take way too long.\n\nI'm pretty unimpressed by the team that made this--they essentially figured a way to port everything in to a physical way and only made the game a bit smoother by adjusting all the numbers down a bit. A team actually willing to really adapt the core of Slay the Spire by actually design some ideas to make it shine in a board game format is something I'd be very interested in. Sadly this is not that at all, and I'll stick to playing the video game except on those very rare cases I'll get talked in to playing this again before remembering why this system is a video game in the first place.",
    "timestamp": 1743030000
  },
  {
    "username": "spaghettibolegdeh",
    "rating": 3.0,
    "comment": "Another extremely hyped kickstarter project in a huge box that BGG loves.\n\nI played this about 4 times and it's fairly OK.\n\nBut, people are claiming this is a masterpiece, so I feel I should rate it harsher as ranking it 77 overall is pure insanity.\n\nBGG top 100 is mostly over-rated, over-bloated kickstarter projects, and this is no different.\n\nThe only thing I like over video game version is the co-op functionality.\nBut this could easily be inserted into the video game, like with the workshop mod.\n\nI just was left wondering, why am I playing this? It's good, but I'd rather play a dozen other games that take a lot to unpack and pack up.",
    "timestamp": 1740783600
  },
  {
    "username": "btasam",
    "rating": 4.0,
    "comment": "After 3 plays and no video game experience...\n\nReminds me a lot of Spirit Island:\n- play your hand, upkeep, repeat\n- plays long for what it is\n- overly solitaire except for the vague cooperation\n- it teases the idea of getting stronger but ends too early to actually feel rewarding",
    "timestamp": 1760392800
  },
  {
    "username": "somuchlight",
    "rating": 4.0,
    "comment": "I mean the gameplay is ok. Not a fan of this art style also the price for this is absolutely outrageous. Compared to Rising sun, Bloodborne and other high quality miniature games which also includes the joy of painting and making it look super cool, this is not my thing I will certainly not pay that much for this. No offense but this is my personal opinion",
    "timestamp": 1758837600
  },
  {
    "username": "rharn",
    "rating": 4.0,
    "comment": "Fun time trying this at a convention, but I wouldn't play this again; way too much setup and rules overhead and fiddly components (and this is coming from someone who loves the StS videogame).",
    "timestamp": 1758405600
  },
  {
    "username": "exparrot",
    "rating": 4.0,
    "comment": "This was actually quite disappointing. Its not really a deckbuilder as you have very little control, and it isn't really co-operative - more multiplayer solitaire really and it isn't really a dungeon crawler. its just....... I don't know. I expected more, but I think I actually prefer the deckbuilding and combat system from XenoShyft: Onslaught",
    "timestamp": 1751493600
  },
  {
    "username": "RobinFox12",
    "rating": 4.0,
    "comment": "I think I'm just not a fan of games like this. I found it not fun enough to warrant how repetitive and mentally exhausting it was. The PvE wasn't particularly interesting; it just felt like a video game but I became the computer running all the calculations. I prefer competitive games with more player interaction and expressive play.",
    "timestamp": 1749592800
  },
  {
    "username": "Iron_Salamander",
    "rating": 4.0,
    "comment": "I have a ton of time in the video game, and it's excellent. This game was a mess with 4 people, and some of the relics don't play correctly compared to the video game, making it feel very off. With it being passable at best multiplayer, and the video game version being far superior for solo play, I can't see any reason to play this again, much less buy it.",
    "timestamp": 1742166000
  },
  {
    "username": "Kaibaman209",
    "rating": 5.0,
    "comment": "I'd rather just play the game",
    "timestamp": 1761519600
  },
  {
    "username": "Wentu",
    "rating": 5.0,
    "comment": "I adore the original videogame. I appreciate the attempt to make it a boars game. It seems many aspects have been preserved and the collaborative take is surely interesting.\nUnfortunately, doing the leg work usually done by a PC is nothing but an expensive\nchore.",
    "timestamp": 1761429600
  },
  {
    "username": "Forgeforgeforge",
    "rating": 4.5,
    "comment": "Still figuring out how I feel about this.\n\nreally easy to bump the cube counters when you're also adding and removing cardboard status. tokens constantly.\n\nIt's an impressive translation of the videogame, which I guess speaks to how economically designed the videogame was to begin with. But it's missing the most important tool in your kit for dealing with roguelikes; the ragequit. If you're have a bad luck run there's no new tools introduced in the boardgame to mitigate the bad draws, but you can't just quit and restart because you have 3 friends who are invested. The whole thing just moves too slowly to hit the dopamine-frenzy-of-acquisition from powerups that gives roguelikes their addictive quality.\n\nNot enough was changed to make this a multiplayer cooperative game. People's cardplay is just complicated enough to prevent too much quarterbacking, but actual gameplay is still either just bickering about which mob to tick down first or people playing out their hands in near silence. Once you sort of figure out your play and get decks that draw and play more cards each turn, everyone just goes heads down and starts talking over each other, mumbling damage number that might as well be random numbers between 1-6.\nThere's not real interaction between players. Even when people hit their card combos it's not really detectable or enjoyable for anyone else at the table.",
    "timestamp": 1761170400
  },
  {
    "username": "TomekF123",
    "rating": 5.0,
    "comment": "Boring. Only for solo players or fan of PC version.",
    "timestamp": 1760133600
  },
  {
    "username": "Galatolol",
    "rating": 5.0,
    "comment": "It's not bad, but too much of tedious upkeep for me. Simultaneous turns are the right choice, but they often feel messy. Basically every time I play it, I feel like I'd rather play another board game and later play Slay the Spire the video game.\n\nI like that you can easily add/remove players between acts of the same run.",
    "timestamp": 1754690400
  },
  {
    "username": "Ruggo",
    "rating": 5.0,
    "comment": "It's just a much slower version of the excellent video game",
    "timestamp": 1747087200
  },
  {
    "username": "Ludwig3366",
    "rating": 5.0,
    "comment": "Adapter les jeux vidéos en jeux de plateaux devient une mode. Je doute que ces derniers y gagnent.",
    "timestamp": 1746136800
  },
  {
    "username": "Destrio",
    "rating": 5.0,
    "comment": "A smart design but despite that, it just made me want to play the computer game which plays much faster and requires less waiting around for other players.",
    "timestamp": 1745964000
  },
  {
    "username": "boardtwodef",
    "rating": 5.0,
    "comment": "Where was this game when I was 12? I don't get the appeal.",
    "timestamp": 1743717600
  },
  {
    "username": "Dunnagh",
    "rating": 5.0,
    "comment": "Very slow Deckbuilding. The game tells you you will die \"often\" and then you start with your starting deck again. Whats the appeal? Other than that, Heroes of Tenefyr is a quite similar game with less setup (albeit with less game depth, too). And I get, the graphics are from the game, but we could only tolerate them by playing 8bit-Music as a background. Ugh.",
    "timestamp": 1740265200
  },
  {
    "username": "BigBiryani",
    "rating": 5.0,
    "comment": "very fiddly, don't know why you wouldn't just play the original game",
    "timestamp": 1737068400
  },
  {
    "username": "Taybanzz",
    "rating": 5.0,
    "comment": "Not overly complex once you learn it. The problem is I've never played a game with more poorly written instructions. It felt like every ten mins the first four hours, we had to grab instructions. And then 75% of the time the instructions were not clear. I know it was just us either because every question I had there was multiple threads on it here.\n\nEverytime I felt like we were falling into a rhythm, it stalled the game. Complete let down overall.\n\nIt's funny back last year I went to a board game even with 15 people all bring games for a weekend. And everyone kept eyeing slay the spire but the people that brought it had no urge to teach anyone and now I can see why.\n\nThere's good gameplay, but combat ends up a little chaotic depending on players personalities. Which leads to a problem alot of coop games have where one or two people end up dominating what the whole team does.\n\nOnly buy this if you absolutely love the brand, and have a consistent group of the same people every week to game, and none of those players \"take over\".",
    "timestamp": 1734822000
  },
  {
    "username": "Medikus81",
    "rating": 6.0,
    "comment": "Ha úgy alakul játszom vele, de nem az én játékom. Ezt két játékalkalom után írom. Igényes, szép játék fantasztikus komponensekkel, de a játékmenet nem fogott meg. Szeretem a miniket is, de ebben a játékban teljesen feleslegesek, csak ott díszelegnek az asztal közepén.",
    "timestamp": 1760479200
  },
  {
    "username": "wkover",
    "rating": 6.0,
    "comment": "Never played the video game, but was happy to try the tabletop version given the positive rumors. Not bad, but less appealing than expected as a multiplayer experience.\n\nI can see how a solo runthrough would be a satisfying puzzle. Especially for people preferring less randomness, since there isn't a combat roll or fate deck to be found. For me, the mostly deterministic approach leads to less tension and emotional engagement.\n\nIn our 4p session, battle rounds looked something like this:\n\n- 1-2 people would quickly throw down cards and assign damage.\n- The others would scratch their heads, wondering if preplanning would help. Invariably, this would cause the original gunjumpers to rewind their plays.\n- A new plan would develop and tentatively proceed, with a high probability for additional take-backs.\n- The cards would eventually settle, with all combatants mostly content.\n\nSince there is no hidden information, StS is a classic example of how nonrandom combat may as well be handled by the most experienced and/or least tired player. After all, there's a good chance that there's a single best way to assign damage, shields, and other effects.\n\nI can also see StS overstaying its welcome. We called it after a one-act victory, which was appreciated. Two acts might be OK with a speedy group, since you'd see cooler upgrades in that format. Three acts is right out.\n\nIronically, I can see people unfamiliar with the original sorta liking the physical implementation, but wondering whether it would be better for a computer to handle the setup, logistics, etc. Yeah, could be. :/",
    "timestamp": 1759010400
  },
  {
    "username": "gromolko",
    "rating": 6.0,
    "comment": "Somehow chaining combos doesn‘t trigger the reward-center of my brain the same way when I have to do all the upkeep. Act 1 and 2 are fun and have interesting decisions, Act 3 (and 4) are mainly a test if your deck works. The PC-game has that lizard brain reward effect in those acts, but in the board version it takes too long for my taste. I could just play the first 2 Acts, but that also feels less satisfying to me.\n4 player is boring, because every weakness of one's deck will be covered by another player. I suspect, 3 players will have the same problem.",
    "timestamp": 1758751200
  },
  {
    "username": "nvsg",
    "rating": 6.0,
    "comment": "A really solid game for newcomers and fans of the original alike.\n\nThe cardplay of StS is really, really good and I do appreciate the fact that in this iteration of the game rules have been streamlined and cards are balanced differently. Each card feels like their counterpart in the original, but due to changes in rules and values, you have to reassess a lot of cards which was a welcome surprise.\n\nHowever, I really dislike the amount of upkeep and fiddlyness. Setting up a new act doesn't take long, but it's painfull nonetheless. With the Silent in particular I feel like I'm spending most of my time moving poison markers around instead of playing the game.\n\nThe custom sleeves are horrible and a few already broke.\n\nAlso, the game is too easy for me. While you can up the Ascension level, at some point the game becomes frustrating and RNG takes over. While that is fine in a 10-30 minute run in the video game, it is beyond annoying in the boardgame where starting a new run is not just one loading screen away. Hence, the well balanced entry level game could have been a bit more challenging in my opinion.\n\nI'm not really interested in playing this ever again, as the upkeep is just too bad for me personally and I think the videogame is a better fit for me.\n\nI've beat the videogame on A20, so I might not be the target audience for this (as I found the board game is way too fiddly to be fun at higher levels).",
    "timestamp": 1758060000
  },
  {
    "username": "wojtolino",
    "rating": 6.0,
    "comment": "Looks like it has a big problem with player count - two player games were quite tough, while four player were way too easy. I like the way they trimmed mechanics to be digestible for a board game, but still it can fairly be called Slay the Spire. Giving it co-op possibilities was a very good choice and it works fine, but should be balanced better for bigger player counts.",
    "timestamp": 1757368800
  },
  {
    "username": "demiesta",
    "rating": 6.0,
    "comment": "A very good game but feels very repetative after a few plays.\nalso has very bad sleeves with are mandatory for the game.",
    "timestamp": 1757196000
  },
  {
    "username": "BatchofAmmo",
    "rating": 6.0,
    "comment": "Maybe if I had played the app version I would like this more. The gameplay is average, and lasts way to long for the simplicity of the actions on your turn. This game encourages alpha gaming on the same level of pandemic, something that I thought we were passed in coop games at this point.",
    "timestamp": 1756418400
  },
  {
    "username": "Naomania",
    "rating": 6.0,
    "comment": "fun coop game, a bit overhyped",
    "timestamp": 1756332000
  },
  {
    "username": "lokomoka",
    "rating": 6.0,
    "comment": "Honestly, it's just a more tedious version of the digital game.\n\nWhile it's a great adaptation of the digital game, the upkeep makes the game so much less fun, among other (necessary) design choices to make the game possible in physical form. Making turn-by-turn decisions is fun, but the constant manual upkeep kills a lot of the fun for me. It felt like I was really only playing the game 1/4 of the time.\n\nThe coop aspect is probably the best part of this adaptation, but I didn't find it compelling enough to keep the game.",
    "timestamp": 1753912800
  },
  {
    "username": "aresil",
    "rating": 6.0,
    "comment": "2p",
    "timestamp": 1753394400
  },
  {
    "username": "muakasan",
    "rating": 6.0,
    "comment": "Fun cooperative deckbuilder - Felt a little bit long, only finishing 2 bosses took about 4.5 hours. Relatively simple mechanics, but setup seemed complicated",
    "timestamp": 1750888800
  },
  {
    "username": "davidbrake",
    "rating": 6.0,
    "comment": "it's a reasonably effective translation of the computer game into a board game, and it does provide for some new wrinkles through the co-op mechanisms, but it doesn't do as good a job as I would've expected of easing the player through record-keeping or set up and teardown. The basic gameplay loop is as good as ever, but I'm not convinced there's a good reason to play it as a board game.",
    "timestamp": 1749938400
  },
  {
    "username": "vergilkilla",
    "rating": 7.0,
    "comment": "I played at 4. The \"getting stuff\" like getting relics and cards is an absolute joy, no doubt.\n\nThe player combat rounds are a mess. \"Everybody can do everything at any time\" means quarterbacking is a really persistent thing that can happen. You definitely need all players locked in on every encounter card as well as their own personal bookkeeping - you can't have just one person sort of guide/do all the bookkeeping - one player forgets to slide their energy indicator down and now we got a world of hurt. If the gameplay was instead \"players take their turn one after another\" instead of this free market approach I wonder would the game improve over how it is now (at least at 4… less is probably better).",
    "timestamp": 1762585080
  },
  {
    "username": "Katzengold",
    "rating": 7.0,
    "comment": "- interesting decisions\n- becomes repetitive after some runs\n- quite some luck involved",
    "timestamp": 1762383600
  },
  {
    "username": "Spineco",
    "rating": 7.0,
    "comment": "As a STS fan and board game fan, this game feels like a weird mix between the two.\n\nThe inspiration from the videogame is there but, to me, it's not too well translated into a board game: Feels sometimes too hard and sometimes too easy; that imbalance creates a weird feeling every time I play it.\n\nIf you are a bigger STS fan than you are a board game enjoyer, I would definitely recommend it.",
    "timestamp": 1762124400
  },
  {
    "username": "Aselan",
    "rating": 7.0,
    "comment": "Best with two player. 3 Player cause too much downtime. The app is better and more addictive.",
    "timestamp": 1762124400
  },
  {
    "username": "MissP1ggy",
    "rating": 7.0,
    "comment": "Very good game.",
    "timestamp": 1760911200
  },
  {
    "username": "Cone Defense",
    "rating": 6.5,
    "comment": "Interesting riff on the app game. It's a solid game, but it's super fiddly and I'm just not sure how much I want to play it. The only reason to play this over the app is multiplayer and I'm pretty sure I'd rather play other multiplayer games of this ilk.",
    "timestamp": 1760824800
  },
  {
    "username": "Marvin676",
    "rating": 7.5,
    "comment": "Own Digital Version",
    "timestamp": 1762297200
  },
  {
    "username": "Creativenothing",
    "rating": 8.0,
    "comment": "Somehow even better than the video game.",
    "timestamp": 1762210800
  },
  {
    "username": "DaviddesJ",
    "rating": 8.0,
    "comment": "2p coop",
    "timestamp": 1762038000
  },
  {
    "username": "punkin312",
    "rating": 8.0,
    "comment": "Epic. I haven't played the PC game, but I still know this is an Epic game with so much to do. I love how the game levels up in difficulty. I only played the first game, but I am so excited to play it further. So much fun to be had here. The cooperative aspect works so well. Kinda makes me want to play the PC game...",
    "timestamp": 1762038000
  },
  {
    "username": "NAKeaux",
    "rating": 8.0,
    "comment": "I have played the game solo (playing two characters). It does have a bit of overhead in keeping up with all the different statuses and mechanics going on, but I played it 3 times in one weekend because it was so good and I lost the first two games.\nI wish I had a playgroup to tackle this game with, I think it would only be better!",
    "timestamp": 1762038000
  },
  {
    "username": "Syr99",
    "rating": 8.0,
    "comment": "Le Deck building est une mécanique que j'affectionne beaucoup. Il partait donc avec un à priori positif. Et bien il m'a convaincu.\nMise en place relativement rapide, jouable en vrai solo et en multi (grosse plus value car on peut s'entraider) principe d'une mini- campagne (3 actes, avec sauvegarde facile entre ceux-ci), amélioration du deck au fur et à mesure de la partie et on débloque du contenu pour les prochaines parties.\nParticularité par rapport à un Deck building classique, c'est qu'on ne vomit pas notre main de cartes, on a des points d'énergie pour jouer nos cartes, il faudra souvent faire des choix.\nJuste il faut avoir à l'esprit que ce n'est pas un Die and Retry comme Dead Cell. Ici, il n'y a pas de contenu débloqué que l'on ajoute à notre début de partie. Corolaire : on peut très bien arrivé à la fin des 3 Actes dès la première fois (c'est d'ailleurs ce qui met arrivé avec La Silencieuse ).\n- Point Négatif : chaque héros possède 1/2 mécaniques spécifiques ( exemple les Dagues et le Poison pour la Silencieuse). Cependant les héros ne possèdent aucune carte dans leur deck de départ jouant avec leurs mécaniques spécifiques. Il faut attendre d'en avoir lorsque l'on gagne des cartes. Je trouve qu'ils auraient pu un peu plus personnalisé les decks de départ. Heureusement on en gagne rapidement et on a le choix entre 3 cartes.\n- Autre point négatif : si la présence des sleeves opaques est appréciable ( nécessaires car les cartes sont R/V pour s'améliorer), ceux-ci ont une tendance à s'abîmer très vite",
    "timestamp": 1761951600
  },
  {
    "username": "Golgonooza",
    "rating": 8.7,
    "comment": "Update 1 (11-4-25): Taising this score to 8.7. I'm obsessed with the game. The score may go up, but I need to spend more time in co-op with it.\n\nMy wife and I played this twice today. I am really impressed with how streamlined everything in the game is. At first, I thought it would be a chore to set up and run, but I was wrong. The insert helps to ease that by keeping everything coordinated and organized.\n\nThe play itself is quite rewarding--you get something new after each combat, and the choices on the path you follow give you a chance to decide on a shorter or longer game.\n\nThe use of the die is genuinely inspired. Everything that has a variety of outcomes triggers off the same die. And, for a change, I can actually always remember to roll it each time.\n\nThe only negative comment, so far, is that the art and monsters aren't that interesting to look at.I don't know what informs the art style, but I've seen a few things like this in the past (Neow typifies this), and it doesn't clisk with me.",
    "timestamp": 1762383600
  },
  {
    "username": "hwki",
    "rating": 9.4,
    "comment": "Mayener Fantasyland\n2024-06",
    "timestamp": 1762297200
  },
  {
    "username": "BloodWarlock",
    "rating": 9.2,
    "comment": "+ Slay the Spire: The Board Game",
    "timestamp": 1762124400
  },
  {
    "username": "DJSvenDee",
    "rating": 8.5,
    "comment": "love theming and playstyle, good deckbuilder.\nwill rating up when playing more",
    "timestamp": 1762124400
  },
  {
    "username": "BeyondTheLid",
    "rating": 8.5,
    "comment": "Bij Heije",
    "timestamp": 1761951600
  },
  {
    "username": "sageleader",
    "rating": 9.0,
    "comment": "As an enormous fan of the video game I was so hyped to play this with 3 other people. The game is almost identical to the video game with some things like relics and damage numbers simplified. But it was so much fun to play co-op and help each other kill enemies. I think going through an entire run co-op would be magical. For me the video game is just perfect and I don't think the board game could replace it, but for co-op primarily this seems like a must buy.\n\nEDIT: After finally buying this game and playing it solo it definitely has a place on my shelf even for solo-only purpose. It does some things better than the video game, despite taking longer to play than the video game. I highly enjoyed myself solo and will definitely be playing it a lot even with access to the video game.",
    "timestamp": 1761692400
  },
  {
    "username": "awpTilla",
    "rating": 10.0,
    "comment": "Played the digital versions on pc, Ps4, mobile for thousands of hours and almost started to get tired of it.. Now I fell in love again, this game is amazingly well translated to analog gaming. Only negative point are the sleeves. Everything else is top notch. Setup takes only 5 minutes, thanks to good inlays.\nThis is my favorite deckbuilder of all time!",
    "timestamp": 1762604040
  },
  {
    "username": "fopa",
    "rating": 10.0,
    "comment": "Amazing and addicting game with excellent character progression, deck building, variety and replayability. I tried the app which is also excellent, but prefer to play the board game to have less screen time.",
    "timestamp": 1762470000
  },
  {
    "username": "Samman13",
    "rating": 10.0,
    "comment": "Loaned to Justin Wright on 11/6/2025",
    "timestamp": 1762470000
  },
  {
    "username": "noasarc",
    "rating": 10.0,
    "comment": "Customer service was excellent! I was an original KS backer and ordered extra sleeves for the beta art cards, I like others had the issue where the backs of the sleeves started peeling off. Contention Games replaced all 1000 sleeves after a simple email, no issues or hassle!\n\nLove the game as well, it comes with me to every board game night just in case I can get the chance to play it again!",
    "timestamp": 1762383600
  },
  {
    "username": "twix_cz",
    "rating": 10.0,
    "comment": "very addicting gameplay loop",
    "timestamp": 1762383600
  },
  {
    "username": "Chemonix",
    "rating": 9.5,
    "comment": "Juego muy fácil de montar y super adictivo, no hay dos partidas iguales. Materiales muy buenos, en definitiva juego muy bien hecho que es obligatorio si te gustan los deckbuildin",
    "timestamp": 1762124400
  }
]