[
  {
    "username": "QueenOfBread",
    "rating": 1.0,
    "comment": "CGE supports transphobia.",
    "timestamp": 1761778800
  },
  {
    "username": "zmartianov",
    "rating": 1.0,
    "comment": "This game promotes colonialism",
    "timestamp": 1754604000
  },
  {
    "username": "Floating World",
    "rating": 1.0,
    "comment": "New editions should not be ranked.",
    "timestamp": 1754172000
  },
  {
    "username": "mikemcdasl",
    "rating": 1.1,
    "comment": "If you’ve ever thought, “What if we turned human history into an endless Excel spreadsheet, but made it more stressful and less fun?” then Through the Ages is your dream come true. This game isn’t just a civilization builder; it’s a time machine to the precise moment you regret choosing this for game night.\n\nLet’s start with the “new story of civilization” in the title. Spoiler alert: it’s not new, it’s not a story, and it’s barely a civilization. Instead, it’s a soulless exercise in shuffling cards, managing resources, and watching your empire crumble because you forgot to build enough farms. Nothing screams \"fun\" like a famine wiping out your citizens because you spent three turns chasing Beethoven.\n\nThe gameplay is a relentless grind of decisions, none of which feel satisfying. Want to build the Pyramids? Good luck. You’ll need to micromanage every rock and worker like you’re auditioning for the most tedious episode of Ancient Aliens. And just when you think you’re making progress, Napoleon rolls in with his military bonus and turns your peaceful society into ancient roadkill.\n\nLet’s not ignore the game’s pacing, which is best described as glacial. Each player takes forever to optimize their moves, leading to turns so long you’ll have time to contemplate the actual rise and fall of civilizations. By the time it’s your turn again, you’ll have forgotten what strategy you were pursuing—or why you even started playing.\n\nThe card system is another masterpiece of frustration. Need a specific card to keep your civilization afloat? Too bad—it’s been snatched by your rival, who’s now gleefully hoarding wonders and resources while you sit there with a crumbling economy and no science to fix it. “Fair” doesn’t exist in this game; it’s all about crushing your dreams one poorly timed card at a time.\n\nAnd don’t even get me started on the military aspect. Want to avoid being plundered? Well, you better enjoy spending half the game building up an army instead of focusing on, you know, actual progress. Because nothing says \"building a great civilization\" like turning it into an armed camp just to stop your buddy from stealing your last barrel of food.\n\nThe pièce de résistance is the game length. You’ll spend hours navigating this joyless spreadsheet, only to realize you’re losing because Gandhi doesn’t work well with your coal mines. And at the end of this marathon session, the winner will smugly explain how their 47-point cultural victory was clearly inevitable, while everyone else fantasizes about setting the cards on fire.\n\nSo, if you enjoy being simultaneously bored and stressed while pretending to relive history, Through the Ages is perfect for you. For the rest of us, there’s always 7 Wonders—a game that lets you build a civilization without needing a master’s degree in logistics and six hours of free time.",
    "timestamp": 1737154800
  },
  {
    "username": "cotomel",
    "rating": 1.0,
    "comment": "Only works as a video game. Even then too basic for video game medium.",
    "timestamp": 1732834800
  },
  {
    "username": "josephjoguts",
    "rating": 1.0,
    "comment": "Never again.\nFiddly, long, downtime is exhausting",
    "timestamp": 1727301600
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "Civilization for people who hate fighting each other. I guess that's most eurogamers.",
    "timestamp": 1725573600
  },
  {
    "username": "Darklord2160",
    "rating": 1.0,
    "comment": "Too long for what it is, essentially engine building with civ theme on top (weak theme anyway because they only exist for their icon and ability, not because they make sense). Random market, you may not get a better mine card on top of being attacked and stolen all resource. Super skewed toward military, good luck not focusing on miliary and get plummeted by 3 other players every turn. Rather play any engine build game than this, imperial settlers, terraform mar...",
    "timestamp": 1725400800
  },
  {
    "username": "Belentor",
    "rating": 1.0,
    "comment": "To long Playtime for the Fun",
    "timestamp": 1716156000
  },
  {
    "username": "Orion0224",
    "rating": 1.0,
    "comment": "One of the only games I've ever just bailed on by mutual agreement of all players. This game sucks.",
    "timestamp": 1711234800
  },
  {
    "username": "Andural69",
    "rating": 1.0,
    "comment": "I have never played a game where someone stomped on my Sand Castle more. I won this game once, I immediately went to church to confess my sins.",
    "timestamp": 1689285600
  },
  {
    "username": "Mystic_Mouse",
    "rating": 1.0,
    "comment": "This was fine for one long game, then it is boring. There are many design choices to nitpick, but the game just isn't engaging for me. The mixed-age military aspect is just silly. Naturally particular tastes vary, but I hope to never play again. To narrow down why, if you like any war games, the strategy probably won't be complex enough, so you'd better enjoy the theme and engine growth. Many love this game, but I'd recommend watching a playthrough a couple of times before buying.",
    "timestamp": 1681164000
  },
  {
    "username": "lynx1998",
    "rating": 1.0,
    "comment": "Playing solitaire for five hours. Urgh!!",
    "timestamp": 1646348400
  },
  {
    "username": "Holubchyk",
    "rating": 1.0,
    "comment": "SSSoooo much feedling! Player bullying game",
    "timestamp": 1624399200
  },
  {
    "username": "Womir",
    "rating": 1.0,
    "comment": "If you don't play military cards, you will lose the whole game. MILITARY=win. Other strategies don't make sense",
    "timestamp": 1607900400
  },
  {
    "username": "JustAQuestion",
    "rating": 1.0,
    "comment": "The game consists of 3 phases but you can simply ignore phase 1 and 2 to focus on those culture wars where you can easily hunt others down who were 150 points ahead of you. And this is not a jealous exaggeration.\nOf course it also depends on some luck that you get the right cards and can block those for others but it doesn't change a thing.\n\nTherefore you need 4 hours to play where you can save up at least 2 1/2 hours for the first two phases and you can make a pritty good guess who's making the run when it comes to phase 3 so you can skip those other 1 1/2 hour too. Even if two players get too strong they cannot stop each other because the mechanics prevent them from fighting each other. There is almost nothing you get from winning the fight because the other one gets even more points from fighting the weaker player then he lost to you.",
    "timestamp": 1605049200
  },
  {
    "username": "naghiamooli",
    "rating": 1.0,
    "comment": "THERE IS ABSOLUTELY NOTHING SPECIAL ABOUT THIS GAME\nit's not even a deep game it's just rule heavy with lots of cluncky and disturbing mechanics",
    "timestamp": 1603404000
  },
  {
    "username": "Patwick",
    "rating": 1.0,
    "comment": "Too much to wrap my mind on. Converting population into a building? Bleh, strange.",
    "timestamp": 1565388000
  },
  {
    "username": "Merlin8888",
    "rating": 1.0,
    "comment": "Long, repetitive, fiddly with pieces, boring. Sold my copy as I will never play it again. Total boredom and way too long. Vlaada has amazing games ... this one is not!",
    "timestamp": 1541718000
  },
  {
    "username": "plz777",
    "rating": 1.0,
    "comment": "I hated this game.",
    "timestamp": 1526594400
  },
  {
    "username": "Szmoli",
    "rating": 1.0,
    "comment": "Without doubts this is the worst game in the market. The whole concept is wrong and completely unbalanced. My main problem with the game is that it's way too long, and in the end your previous decisions may not matter at all. It also does not matter if you lead in culture (VP) and military during the whole game, because in 1 or 2 turns you can be destroyed and end the game in the very last place. The whole fighting system doesn't make any sense, it's almost impossible to win an agression if you don't have a crazy army and the others don't pay any attention to strengthening their military. Being able to take culture (VP) in the end through war is a very strange thing, and it can destroy the whole game (which is really super long) in 1 turn for the defeated. I feel like the fun factor is eliminated if you don't win because the engine you built during hours collapses in a few moments. I'm not sure if it was intentional from the designer (probably it was), but I wouldn't advise playing it even to my biggest enemies...",
    "timestamp": 1525125600
  },
  {
    "username": "kosterix",
    "rating": 1.0,
    "comment": "Never again.\n\nTakes forever. To summarize, beautiful shiny pretty pieces, nice mechanism (a bit like Civ or the new world), but falls flat on its face with the unbalanced play and inevitable trampling on the weak. The only hope for the weak is to find a treaty card. The game lasts about 7 hours.",
    "timestamp": 1521932400
  },
  {
    "username": "Justicex75",
    "rating": 1.0,
    "comment": "It is honestly beyond me how this game could ever end up being in the top 10, let alone number 2 overall. I've played this several times now and it is indeed one of the most terrible experiences I ever had and a huge waste of time for what this game tries to achieve. Seriously - I wouldn't recommend buying this.",
    "timestamp": 1490738400
  },
  {
    "username": "NovemberMlKE",
    "rating": 1.0,
    "comment": "no interaction between players that much Zzz",
    "timestamp": 1479942000
  },
  {
    "username": "ZShah81",
    "rating": 1.0,
    "comment": "Boring game, slow paced. Doesn't do any justice to actual history. It should be called a Story of Western Civilization as it mostly ignores contributions of the rest of the world.",
    "timestamp": 1472767200
  },
  {
    "username": "ravn1ca",
    "rating": 2.0,
    "comment": "Not worth it, waste of money",
    "timestamp": 1752357600
  },
  {
    "username": "TeganAndTheOneRing",
    "rating": 1.5,
    "comment": "I tried to like this. I really really tried!\nBut it's boring, clunky, hard to grasp, and thoroughly unsatisfying to play!",
    "timestamp": 1739574000
  },
  {
    "username": "LinkToDarkness",
    "rating": 2.0,
    "comment": "Played on BGA. The implementation was awful and I just couldn't understand what was going on and why I kept losing resources. Even after watching two videos on how to play, I just couldn't get it figured out.\n\nIt wasn't until the very end of the game that I figured out my problem but at that point, I had lost too much ground and failed to even make a dent in my opponent's score.\n\nIt's not really for me.",
    "timestamp": 1734562800
  },
  {
    "username": "mrVentures",
    "rating": 2.0,
    "comment": "Gave this game a shot for two hours with two of my friends. After watching some rules videos on YouTube we failed to grasp the game. I feel it was overly complicated and has a lot of opportunity for improvement.\n\nFirst, I'd like to say this game has horrible iconography. For each colossus step there is a number and you need to cover it with a cube. Certainly that number should have some sort of square (cube-shaped) background to indicate that you place a cube there. This is an issue in other parts of the board too. If it takes a cube to play, then they should indicate that with a cube hotspot. Without them, you're just constantly guessing what needs a cube and where they go. In absurdity, the military cards have red circles to indicate how many cubes they require to play, are you serious? It's so dumb.\n\nResource generation is also very unclear. For example, the philosophy labs generate one science per turn, whereas the religion temples generate one happiness, once! How would you know that the former is per-turn and the latter is once? The only clue is that some resources have a 1 besides them but really this should just be written as +1 or 1 where the former is ongoing and the letter is once. Or something like it, please!\n\nYou maybe have noted that I mentioned philosophy buildings are labs, religion buildings are temples, etc. But I didn't tell you these are all considered urban buildings, the board doesn't tell you either. This results in a big word soup where there are so just far too many nouns.\n\nAnother unspoken, super unintuitive rule is hand size. It's super annoying that you simply must know that military handsize is equal to the number of military actions, but you CAN exceed it. And non-military card limit is the number of non-military actions and you CANNOT exceed it. What a frustrating inconsistency.\n\nAs we began to learn the military rules we began to fade away into slumber. That section has a whole bunch of additional rules that seem unfair given the game is already a soupy mess all spilled all over my game table.\n\nI will say that I like how the ages cards slide down as they are taken from the tableau, that's really cool.\n\nOverall, I very much disliked this game. 7 Wonders simplifies so much and feels like the game this should have been.",
    "timestamp": 1728597600
  },
  {
    "username": "StarlordAKPeterQuill",
    "rating": 2.0,
    "comment": "Despite the fact of almost none player-interaction you have immense downtime. Furthermore it also doesnt feel like youre building an own civilication.\nCan't get the hype of this: you're better off with Clash of Cultures or the old Civilication games (with houserules)",
    "timestamp": 1714600800
  },
  {
    "username": "djsanborne",
    "rating": 2.0,
    "comment": "Like the idea but don’t like the way the systems incentivize the players in the lead beating up on the weakest players",
    "timestamp": 1709161200
  },
  {
    "username": "IamSalvation",
    "rating": 2.0,
    "comment": "This rating is for the boardgame version. I could see that its much better as digital version with the awfull upkeep and fiidly bits all done automaticly. Ich would even like to try a digital version - but i won´t ever play the Board Game version ever again. To long, to fidly, half the game is just upkeep. Took over 5h with 3 players. 120 minutes my a**",
    "timestamp": 1668034800
  },
  {
    "username": "schrifterz",
    "rating": 2.0,
    "comment": "Dont like. Takes too long and has a runaway leader problem",
    "timestamp": 1666389600
  },
  {
    "username": "Mayasty",
    "rating": 2.0,
    "comment": "Perfect simulation of civilization development with simple rules but … not for the boardgame. It’s loooooooong, boring and exhausting. The weight to randomness ratio is very bad. I was so tired in the middle of the second era that I could do anything to end up the game there. Of course I could use the magic action „Quit the game” but I didn’t want to spoil the game of the others. BTW: Thanks for the designer that he has mercifully forseen such a possibility. The idea to serve 10 cards on supply track and have the players read them all in their turn (not earlier because supply changes frequently) is crazy and is what makes this game so boring due to huge downtime and personally for me unplayable. +1 point for really perfect simulation of civilization development.",
    "timestamp": 1660514400
  },
  {
    "username": "Kellbot",
    "rating": 2.0,
    "comment": "This game is so tedious and the theming is incredibly cringe inducing for something that came out in 2015. The leaders are super eurocentric, the fundamentalism card has a picture of a mosque, etc. There are much better games with similar mechanics.",
    "timestamp": 1659304800
  },
  {
    "username": "Ravensburg24",
    "rating": 2.0,
    "comment": "Outcompeted by Sid Meier's Civilization: New Dawn. Also, incredibly dry.",
    "timestamp": 1656021600
  },
  {
    "username": "klebinaldo",
    "rating": 2.0,
    "comment": "Eu nem quero mais ver na minha frente. Os eventos são muito aleatórios e favorecem quem já está na frente e desfavorece quem está atrás na pontuação ou força. Não tenho vontade de pensar sobre como usar as cartas militares.",
    "timestamp": 1653170400
  },
  {
    "username": "VarietyLights",
    "rating": 2.0,
    "comment": "As has been mentioned by others, the app implementation of this is one of the best digital versions of a board game to date.",
    "timestamp": 1636326000
  },
  {
    "username": "MagicKevin",
    "rating": 2.0,
    "comment": "I really think it's a well designed and system. The first few times I played I had a good time. Now that I understand the paths of victory it seems extremely boring. I'm just pushing numbers, its tense with no sense of satisfaction. I either win or luck out on card flop. The worse part is the as you go through the ages the gameplay is exactly the same, only working with bigger numbers. Not fun.",
    "timestamp": 1624831200
  },
  {
    "username": "pulla",
    "rating": 2.0,
    "comment": "Feels more steamlined than the original but has many of the same balance problems. Dislike.\n\nRating down from 6.5 --> 2. Overpowered military ruins the game.\n\n(Original rating from 2/2016)",
    "timestamp": 1619474400
  },
  {
    "username": "t3dobber",
    "rating": 2.0,
    "comment": "Most painful experience gaming ever.",
    "timestamp": 1612652400
  },
  {
    "username": "Ryan Keane",
    "rating": 2.0,
    "comment": "Based on my rating of 1st edition and learning enough about 2nd edition that it doesn't make me want to ever try it.",
    "timestamp": 1604962800
  },
  {
    "username": "orange",
    "rating": 2.0,
    "comment": "really, another entry for this AP prone, overly long abomination.",
    "timestamp": 1569708000
  },
  {
    "username": "Gary Praxis",
    "rating": 2.0,
    "comment": "One of the most uninspired games I have ever had the disappointment to play, especially considering it's placement in the BGG rankings. The excuse I generally hear is.. 'It's better on the app'. OK fine, but this is a board game we are talking about. Thematically inconsistent from the get go (ages colliding and making zero sense) and the pill shuffling feels like the designer couldn't be bothered to come up with a central mechanic that ties it all together. Even back in it's day I'm amazed this ever got played.",
    "timestamp": 1564610400
  },
  {
    "username": "C_Figiel",
    "rating": 2.0,
    "comment": "This is one I wont get and never will get. It receives a few stars for having an interesting economic component to it, but that's really the only positive. It's a civilization building game without the most important core component of any civilization (no not a central board)- planning. This game, despite its lack of variable player powers and exact same setup every-time, is almost impossible to control and plan ahead for, especially at higher player counts. The cards you need just might never show up before other people take them, and there's nothing you can do about it. I have had not one, but SEVERAL games of this where I didn't get ANY science in the first age, and big surprise, I lost all of those games. Military is always \"pick on the weakest player\" so it's actually the opposite of a catch up mechanism- it's a beatdown. The colony/events deck has some catch up in it, but again, whether you get cards that help you or not to fit in there is still fairly random, and because its a deck that you seed, you might very well not benefit from the event you seeded in by the time it shows up. None of the mechanics in this game are intuitive, none of it makes sense, none of it coalesces into something greater than the sum of its parts, and in fact every element of the game hurts each other. It's not even a mediocre civ game, it's just bad. It's too long for how random and samey it is every time.\n\nLook, obviously I'm in the minority here- there's a reason this game has as high of a rating as it does. Just remember to try this before you buy it, especially since it's so expensive and, like most Vlaada games, it's got some severe polarizing elements. I'm a huge Civilization fan, I love card drafting, I love tableau building, I love economic games, so I figured this would be perfect for me. I was wrong. I will never play this ever again.",
    "timestamp": 1551135600
  },
  {
    "username": "janzgi",
    "rating": 2.0,
    "comment": "Based on my one 3-player gameplay against someone who already knew the game, I can only say the game is pretty broken in the way that it attempts to portray the real world. The game mechanics and cards (age III military) have to be known beforehand if you want to have any chance against someone who knows the primary winning strategy.\n\nThe game tries to mask the fact that military strength and aggression is essentially the only game-winning element (until players are near equal in military strength) by making \"culture points\" the effective victory points, but it's beyond me what real-world equivalent it represents when in the age of internet and all a military might with 3x the military power can simply raid 1/3 of your way more advanced \"culture\" and somehow gain possession of it, with no adverse consequences, in a single attack move (war) that you are powerless to avoid, stop or mitigate. (Global pressure? Negotiations? Guerrilla warfare? Not in this universe.) Defender doesn't even have any kind of home field advantage when invaded, as this type of thing is realistically only possible with a full scale invasion and that should end the game for the losing player and be made clear from the start that it's a possibility, and should require no cards to trigger, only superior military to have the option. Also that should leave the attacker's back open for someone else to take advantage of, but nooo, not in this game. What a letdown.\n\nSo while some 95% of the play time you do something entirely unrelated, the game is still made to be all about war, and it shouldn't try to pretend otherwise to fool a first-time player, but it's a crying shame that the war aspect is the most simplified and lackluster element of the game, close to the abstraction level of 7 Wonders. I haven't played the first edition and I'm sure it's even worse, but for me this game just doesn't work one bit. Perhaps the word \"civilization\" from the title should be replaced with \"war\" for more honesty. My first and last experience was far from civilized, and 10 times out of 10 I prefer Eclipse for this type of game.",
    "timestamp": 1550962800
  },
  {
    "username": "kakitamike",
    "rating": 2.0,
    "comment": "If you're teaching this game to someone for the first time, you should absolutely mention the fact that if they ignore military, there is a high chance that they cannot win the game. That would be the first thing I mention, before explaining anything else.\n\nI've played many games with multiple routes to victory, and there are usually pros and cons to each one, but none of them as debilitating as 'target player who focused on military takes the win from you'\n\nI don't even mind 'take that' mechanics, as I love Argent, and that game has a lot of 'take that' actions, but none of them are going to lose you the game in one action.\n\nI knew going in it would be a long game, but even by long standards for me, 4.5 hours was grueling. That and the fact that 3 of us conceding in what was maybe the third to the last turn, and it just felt like a waste.\n\nThis is the first time I've played a game that had a rule written in for what happens when a player concedes on their turn. The fact the designer wrote in a rule on how to withdraw if something so game-endingly bad happens to you that it makes you want to quit the game, should have been a red flag to me.",
    "timestamp": 1531692000
  },
  {
    "username": "imaginarypet",
    "rating": 2.0,
    "comment": "When I see this game at bgg's number 3 game of all time I really question my sanity and on the tastes of the people who rate games here. I'm not saying their tastes are bad but they skew towards a direction and a place not venture by many.\n\nTtA: ANSoC is by far one of the most unfun, tedious games I have ever played and I say that as someone who enjoys heavy euros. The issue is that this game is needlessly repetitive, highly finicky with lots of moving parts and lasts over 3 hours with 3 players. The amount of downtime per player is astronomical as you get past Age I and the turns aren't even interesting if it isn't your turn. 90% of what your opponents do just don't keep me interested.\n\nAn engine building cutthroat game shouldn't be decided early in the first half of the game with 2 hours left, nor should it take so long without giving anything back.\n\nIf you enjoy doing work and taxes and filling out information on forms this game is right for you.\n\nIf as a kid you enjoyed doing homework only to have it be deleted and need to start over again. If that pleases you by all means by this game.",
    "timestamp": 1531519200
  },
  {
    "username": "Gerhardxqwd",
    "rating": 2.0,
    "comment": "Draft makes this random, you play what the games gives you. Agression doesnt make any sense - you have to develop crazy army to succes, war for culture is nice tho. Tracking every player moves is almost impossible, people make mistakes very often. Game takes at least 1h per player +1h, Our last game for 3 took 6h. Waaay to long for this game. Concept is nice, rules arent hard but this game does not forgive mistakes. Also because it lasts soo long and of the random draft the decisions you have made before does not care at all. Probably will never play this again.",
    "timestamp": 1526767200
  },
  {
    "username": "ChaoticSeraph",
    "rating": 2.0,
    "comment": "Takes a really long time to learn and teach all the little nuances and rules. The playtime will be approximately an hour for each player plus 1. It'll be a lot longer if the players take awhile thinking of their next couple of moves. For a 2-player game, it would be about a 4-hour game. If you don't mind the time it takes to set up, teach, and play the game and you like civilization-type games, this is a buy for you. Otherwise, there are other games that will provide you with the civilization aspect but with a lot less time.",
    "timestamp": 1517353200
  },
  {
    "username": "InfestedJedi",
    "rating": 3.0,
    "comment": "Not terribly balance with punishing mechanics, encouraging those in last place to just concede rather than continue playing. Not fun.",
    "timestamp": 1758060000
  },
  {
    "username": "Stego71",
    "rating": 3.0,
    "comment": "Es un eurogame al que hay que echarle mucha imaginación para tener la sensación de que estás avanzando a través de la Historia con tu civilización. La temática tiende a cero. Tuve que probar dos o tres eurogames para darme cuenta de que todos son así. Coleccionas cubitos que valen igualmente para engrandecer un imperio o para cocinar una receta.",
    "timestamp": 1756504800
  },
  {
    "username": "ksd_d",
    "rating": 3.0,
    "comment": "学生時代なら楽しめたと思います。\n弱るとズルズル下がって以降お付き合いになるゲームは、\n私の今のプレイ環境には合いませんでした。",
    "timestamp": 1756418400
  },
  {
    "username": "Arnar146",
    "rating": 3.0,
    "comment": "bga",
    "timestamp": 1754431200
  },
  {
    "username": "Verenia",
    "rating": 3.0,
    "comment": "Digital edition",
    "timestamp": 1736895600
  },
  {
    "username": "D1dya",
    "rating": 3.0,
    "comment": "Digital game - its my favority game... But boardgame versus dead to me",
    "timestamp": 1732057200
  },
  {
    "username": "Hermilion",
    "rating": 3.0,
    "comment": "It's really badly balanced, new version is all about who will be stronger in war. Not worth trying, first edition was way better",
    "timestamp": 1728770400
  },
  {
    "username": "Merlija",
    "rating": 3.0,
    "comment": "Sat in my shelf for 10 years, never felt like playing it. It’s just too dry, not enough player interaction and long downtimes.",
    "timestamp": 1725400800
  },
  {
    "username": "Auphan",
    "rating": 3.0,
    "comment": "Rating reflects the physical version being made obsolete by the digital implementation",
    "timestamp": 1723500000
  },
  {
    "username": "johnhagop",
    "rating": 3.0,
    "comment": "Even though I am terrible at this game, I keep trying.",
    "timestamp": 1713391200
  },
  {
    "username": "hecuter",
    "rating": 3.0,
    "comment": "A game that leans heavily on dog piling the person in the worst position, making it very difficult to extract themselves. Pale imitation of a civ game. ~50 plays at all player counts to really give this a fair shake and I truly dislike this game.",
    "timestamp": 1706742000
  },
  {
    "username": "pkvaran",
    "rating": 3.0,
    "comment": "The play is fun but it's waaaaay too long for absolutely no reason. Regret buying it.",
    "timestamp": 1705964400
  },
  {
    "username": "Primalwolf",
    "rating": 3.0,
    "comment": "Bga. Didn’t grasp it",
    "timestamp": 1697493600
  },
  {
    "username": "williewhale",
    "rating": 3.0,
    "comment": "thrift store buy",
    "timestamp": 1693951200
  },
  {
    "username": "Mkyrmse",
    "rating": 3.0,
    "comment": "On BGA",
    "timestamp": 1692136800
  },
  {
    "username": "Rijks71",
    "rating": 3.0,
    "comment": "Complex, very replayable.\nBetter for those happy to sit out a very long game, especially when first learning.\nI want to play it again!",
    "timestamp": 1691532000
  },
  {
    "username": "JorgeMD",
    "rating": 3.0,
    "comment": "No creo que esté mal, pero los tableros me parecen poco atractivos. Hay otros juegos de similares características mucho más llamativos.",
    "timestamp": 1683237600
  },
  {
    "username": "Beedun",
    "rating": 3.0,
    "comment": "Ugly, boring, move along, move along.",
    "timestamp": 1682287200
  },
  {
    "username": "sten77380",
    "rating": 3.0,
    "comment": "Je n’ai plus beaucoup de souvenirs de ma partie, si ce n’est que j’avais été très déçu. La manipulation était en plus ultra pénible et j’avais davantage l’impression d’être face à un tableau Excel que dans un jeu de civilisation.",
    "timestamp": 1679785200
  },
  {
    "username": "Highgarden",
    "rating": 3.0,
    "comment": "What's the point?",
    "timestamp": 1676934000
  },
  {
    "username": "Kent",
    "rating": 3.0,
    "comment": "Good civilization building game except for two things which together mean this game will never be played again.\n\nOne, the combat, or directly aggressive elements of the game, are random and aren't readily or equitably available to all players. Therefore, one player might be targeted simply because he's the weakest nation and the attacker has the right attack cards. But the one being attached might not be able to defend himself because he doesn't have the correct defense cards which themselves are scarcely available and hard to obtain. Having lost to the attack, the loss can be significant and at a minimum cause a player to lose a turn or points that were earned over several turns. Furthermore, the defeated player can't necessarily retaliate later because the opportunities to attack are not readily available to all players in a fair manner. Thus a player in one round can be smacked down by one player, or two players even, with crippling effects yet he may never have an opportunity to retaliate against the attacking player(s) because the ability to do so is only randomly and scarcely available.\n\nSecond, the game is long. Very, very long. The length of the game means there is no tolerance for random, take-that elements that can severely cripple a player with little chance to either defend or retaliate.\n\nI will likely not play this game again as the time commitment does not provide enough game play satisfaction.\n\nNote: Second edition artwork is mostly very good and replaces the horrible artwork in the first edition.",
    "timestamp": 1676761200
  },
  {
    "username": "NsYooN",
    "rating": 3.0,
    "comment": "It's good, but it takes a long time to get good at. This is better as an App. Will never play the thing in cardboard format again",
    "timestamp": 1676415600
  },
  {
    "username": "alexandrehamelin",
    "rating": 3.0,
    "comment": "Convoluted. Nice try. And I like heavy strategy games but this is not fun.",
    "timestamp": 1675033200
  },
  {
    "username": "TinyTheGreat",
    "rating": 3.0,
    "comment": "Way to completed for what it is. I don’t have time for a game like this. Neither the time to learn it nor to play it.\n\nLiked the idea of the game way more than the execution.",
    "timestamp": 1674687600
  },
  {
    "username": "Dr3Putt",
    "rating": 3.0,
    "comment": "App",
    "timestamp": 1664748000
  },
  {
    "username": "whitecatplays",
    "rating": 4.0,
    "comment": "Like playing the tech tree in Civ. As wrought-in as.",
    "timestamp": 1760738400
  },
  {
    "username": "kendallgrubbs",
    "rating": 4.0,
    "comment": "Hate Draft, the game, otherwise known as Through the Ages, is definitely a strong game. The best aspect is the card market, but the downsides outweigh this in my opinion. There’s a lot of micromanaging of your player board, and the War aspect leaves a lot to be desired. I think it’s a well above average euro, and honestly a must own for euro enthusiasts, but I feel that the player interaction is too little for my taste - limited primarily to the market. For two players I think it’s pretty solid, but I agree with the masses that four seems as though it would overstay. I think Vlada achieved what he was going for here, I’m just not the target audience.",
    "timestamp": 1758751200
  },
  {
    "username": "Straddllw",
    "rating": 4.0,
    "comment": "Cooler pieces/artwork and more streamlined than the first version. However, it is still way too long of a game for me. Sure you have a decent game in there somewhere, but after 3 hours, you realize there's still 5 hours to go of complex micromanagement of every little bit of your resources. This felt more like work than something you'd play for fun. Overrated/10.",
    "timestamp": 1758664800
  },
  {
    "username": "latschediwes",
    "rating": 4.0,
    "comment": "I’ve tried to learn and play Through the Ages twice. I can see (or at least strongly suspect) that it’s a well-designed, cleverly interlocking system. The way it abstracts the idea of civilization-building onto cards is undeniably interesting. Advancing through the ages, developing technologies, and watching a civilization take shape has an appealing logic to it.\n\nThe problem is that beneath that thematic veneer lies a hardcore optimization engine. The game reduces civilization growth to a constant cycle of resource conversions, point calculations, and token management.\n\nIt’s an intricate puzzle that feels inaccessible to me with a dense, over-engineered ruleset. The thought of investing the time to internalize all that just to run a finely tuned engine holds no appeal for me.\n\nThis experience reminds me of other games that look thematic at first glance (Star Trek: Away Missions, Root, Lords of Waterdeep etc.) but turn out to be elaborate optimization exercises in disguise. For players who love that kind of dense, interconnected mechanism, Through the Ages is probably a feast. For me, it’s simply not where my interests lie.",
    "timestamp": 1755208800
  },
  {
    "username": "Forilla",
    "rating": 4.0,
    "comment": "Way too complex for no reason. Tons of rules for seemingly boring mechanics. Most of it plays in your head. There is no map to indicate your empire, cubes of different colours represent everything - from population, to resources to corruption. I never feel that I am ruling a civilization. Moving cubes around and buying cards.\nA lot of good games are like this too. But the overcomplicating rules are just not worth the tradeoff.",
    "timestamp": 1747864800
  },
  {
    "username": "eddieb",
    "rating": 4.0,
    "comment": "For it’s day. Amazing. But fiddly in retrospective after being out for so many years. Much better as a digital two player game against pc which can be played in 15 minutes. Will probably never play physical game.",
    "timestamp": 1746568800
  },
  {
    "username": "kareds",
    "rating": 4.0,
    "comment": "Overall disappointed by this. Lame as a civilization game, forgettable as a euro.",
    "timestamp": 1739919600
  },
  {
    "username": "Ginewra",
    "rating": 3.5,
    "comment": "bga",
    "timestamp": 1739833200
  },
  {
    "username": "KyzylHD",
    "rating": 4.0,
    "comment": "Only cause I got my booty slapped by Bill Gates.",
    "timestamp": 1739055600
  },
  {
    "username": "cmsatpun",
    "rating": 4.0,
    "comment": "App is a 6 or so, maybe",
    "timestamp": 1737846000
  },
  {
    "username": "diano",
    "rating": 3.5,
    "comment": "It's ugly asf",
    "timestamp": 1737759600
  },
  {
    "username": "muzrobertson",
    "rating": 3.5,
    "comment": "App version only. I'd have to be convinced to play the cardboard version; the bookkeeping seems atrocious. Still, a solid civ whose charm overcomes its laughable abstraction of history.\n\nUPDATE: After more plays, I'm cooling to the game. It's a lot more on rails than I initially realised. There's clearly better paths than others and you will be punished by competent players from deviating too far. You almost need *more* cards and a way to seed the deck to enable more valid strategies -- an appeal for Civ to move away from the Civ view of history.\n\nDowntime is horrible, even in the app's streamlined version. Never want to play this in the flesh.",
    "timestamp": 1736463600
  },
  {
    "username": "ubRtstcl",
    "rating": 4.0,
    "comment": "Possibly the ultimate balancing act in a board game. It doesn't feel worth the length and fiddlyness of tracking everything. Works better as an app. Might as well be a dexterity game by the amount of cubes and trackers you have to fiddle around with. Falls into the same pitfall as the video game: military trumps all, but much worse because your units don't need to travel across a map, and because there are no other forms of competition.",
    "timestamp": 1734908400
  },
  {
    "username": "jond",
    "rating": 4.0,
    "comment": "New Version",
    "timestamp": 1733785200
  },
  {
    "username": "JFed01",
    "rating": 4.0,
    "comment": "[digital]",
    "timestamp": 1731279600
  },
  {
    "username": "Zaungast",
    "rating": 4.0,
    "comment": "Most funny boardgame tutorial ever in an app, but the fiddly rules and arbitrary combinations of personalities and achievements of human history through different ages felt much less enjoyable.",
    "timestamp": 1729375200
  },
  {
    "username": "AndryWhite",
    "rating": 4.0,
    "comment": "For 2006 - outstanding, for 2015-2023 - outdated, sorry. Too long, too fiddly, too repetative. The cards is quite boring, the theme is not there at all. Probably App version is felt better.",
    "timestamp": 1728079200
  },
  {
    "username": "parpari",
    "rating": 4.0,
    "comment": "Civ game without map, card driven (randomness), painfully long (more than four hours for four players) and fiddly. However, at least it is very thematic similar to civilization video game which makes no point board game one over the video game.",
    "timestamp": 1724623200
  },
  {
    "username": "MissP1ggy",
    "rating": 4.0,
    "comment": "Brilliant game, just not for me. Too long and too many things to consider. Very strategic.",
    "timestamp": 1722722400
  },
  {
    "username": "quietcorn",
    "rating": 4.0,
    "comment": "This is a card driven civilization game where players use a limited supply of action tokens to take cards and add them to their tableaus or spend them on cards in their tableaus to activate those cards. What you are essentially doing is trying to move your markers up on various tracks in relationship to other players. Then event cards reward you or punish you for your relative position. The most crucial track is the raw points income track. I found cards that give significant improvements on this track to be somewhat rare, and hard to construct when you did get them. Most of these cards require a lot of stone, which is a resource another type of building produces.\n\nMy second play of this game took about 5.5 hours plus about an hour of rules with 2 players. In that play, I would up missing the 2 stone production building. I wasn’t worried, thinking I would grab the 3 stone building when it finally hit the conveyor belt of cards but due to the random element inherent in a card driven game, the 3 stone card didn’t come out until late into the pile, and despite having a ton of 1 stone production buildings, I fell impossibly behind my opponent in points income. To compensate, I pushed into Military, thinking that If I could hit my opponent with the negative effects of the events it would provide me a catch-up opportunity, but the game has a very odd mechanism for military. You get a separate, much smaller budget of action markers for recruiting military units, and spending to play military event cards. Additionally at the end of your turn, you draw new cards from the event deck equal to the number of unused military actions you have. This meant that I was spending my military actions to build up forces, and my opponent meanwhile was able to fill his hand with either high scoring non-military events he could seed into the events deck, or high value defense cards he could use to counter my aggression and war cards. The result was a lot of failed actions and frustration on my part, as I led on the military track through the entire game, but in 6 hours only got the benefits of hitting my opponent once. My opponent said that by not spending his military actions he also was drawing enough cards that he saw a lot of cards that would have been powerful for me go by and he was able to just discard them. Luck of the draw here also didn’t help me, as I often times would only draw peaceful events and I didn’t much to help my strategy.\n\nI enjoyed a lot of the process of this game. I liked the way the cubes moved around the board meaning different things in different places. I liked the card drafting mechanism. I enjoyed the theme. The game also reminded me of a lot of games I’ve really loved in the past, however the downtime between turns is extremely long, and for the overall length of the game I’m not thrilled with the luck driven elements.",
    "timestamp": 1721685600
  },
  {
    "username": "Tinger1996",
    "rating": 4.1,
    "comment": "How is this game rated so high.",
    "timestamp": 1721512800
  },
  {
    "username": "sup3rdan",
    "rating": 4.0,
    "comment": "It's incredibly clever I just don't find it fun",
    "timestamp": 1721340000
  },
  {
    "username": "btasam",
    "rating": 4.0,
    "comment": "I just don't get what all the fuss is about.",
    "timestamp": 1721080800
  },
  {
    "username": "thegnobo",
    "rating": 4.0,
    "comment": "No és per mi... el rollo de les cartes el fa molt abstracte per mi, massa coses a tenir en compte, em sembla més un puzzle/sudoku intentant que encaixin les peces que un joc. No em diverteix en definitiva.",
    "timestamp": 1718661600
  },
  {
    "username": "Fawkes",
    "rating": 4.0,
    "comment": "Simply too much work on the table, despite the interesting ideas. Makes way more sense in its app form. Purged.",
    "timestamp": 1717970400
  },
  {
    "username": "weishaupt",
    "rating": 5.0,
    "comment": "Built the way older American games were: player A goes through the entire sequence of play (which can take a while if you think about your moves), then player B does the same, and you just sit there waiting for your turn to come around. Meh.",
    "timestamp": 1759874400
  },
  {
    "username": "toorwell",
    "rating": 5.0,
    "comment": "This game is way too long for what it is. Moreover, getting good at the game boils down to learning which strategies work in a way that removes a lot of the decision-making.",
    "timestamp": 1758924000
  },
  {
    "username": "Raynman0013",
    "rating": 5.0,
    "comment": "I see the appeal and playing digitally helped. Hard bounced off the physical game, too fiddly for my taste.",
    "timestamp": 1749247200
  },
  {
    "username": "Ciniconoclasta",
    "rating": 5.0,
    "comment": "Still unplayed, and chances are it will not be played a lot after receiving Bios: Origins 2nd Edition...\nEdit, finally played at 2-count.\nVery \"Early PC Civilization\" feeling, but, waaaaay too long and fiddly.\nEdit, played it again at 2-count, too long, too fiddly, life's too short for a long board game you are not REALLY enjoying every minute.",
    "timestamp": 1740524400
  },
  {
    "username": "Diyan",
    "rating": 5.0,
    "comment": "Too long",
    "timestamp": 1740006000
  },
  {
    "username": "Momo80",
    "rating": 5.0,
    "comment": "Too long and too swingy. Also ripe for ganging up on a single player with no hope of bouncing back (they’ll just need to sit for 2 hours more until the game’s done).\n\nOverhyped...",
    "timestamp": 1736809200
  },
  {
    "username": "littlechandler",
    "rating": 5.0,
    "comment": "Initial Impressions of Short Game Only: I've never played the Civ video games, but from what I do know about them I can see how this was designed to be Civ the card game. It has a lot less abstraction of non-combat and non-growth aspects of civilization that a lot of other civ-themed games have, such as maintaining \"happiness\" and needing to feed your people. Through the Ages has a lot of good things going for it, but honestly I think I would rather play Clash of Cultures or Imperial Settlers most of the time.\n\nCompared to Clash of Cultures, they are of similar length, but Clash of Cultures has a map aspect, has a big plus of unique powers (at least with the expansion), and has tech \"fields\". Now, you will start differentiating pretty early in Through the Ages, but the problem is outside of your leader you mostly just get bonuses in certain stats, rather than having abilities that feel completely different from others. Such differentiating stat boosts are important, but I want to have turns where I feel like doing something cool, not turns where I feel like I am doing more of the same. I also would guess Through the Ages has more tactical depth since what you do each turn depends a lot of what cards become available for cheap while still having strategic depth depending on what resources you produce the most of making it easier to get certain things, but I just love the strategic tech fields of Clash of Cultures.\n\nCompared to Imperial Settlers I think Through the Ages is a much better designed game. After all, Through the Ages actually has a fairly decent level of interaction with the military level mechanic, whereas Imperial Settlers 80% of the time it feels like I am just playing multiplayer solitaire tableau building, with what feels like a tacked on raze mechanic to add interaction. This threat of my opponent suddenly boosting their military on a turn means I am actually paying attention to what my opponent is doing. The tableau building of Imperial Settlers also is too much and makes it feel like you aren't really playing a civi game. However, again, Imperial Settlers just has effects that feel more special, and it plays much, much quicker so when I do just want that tableau building feel I'd rather play it over Through the Ages.\n\nI think I understand why this game is considered best with 3. In the 2 player game I played, a lot of the cards were burned in the buy row. Now, cards would probably also cycle as quickly with more players despite less cards getting auto-burned each turn, but it would feel like cards are being removed because other people were considering denying you the benefit of those cards, rather than because of just where those cards ended up. However, there is quite a bit of downtime when it is not your turn, so I feel like 4 player games might drag.\n\nEDIT, full game, peaceful variant: Played this again, and now I feel like it's like It's a Wonderful World, but both 5x more complex and longer. However, while the level of abstraction and engine building is fine for It's a Wonderful World, it feels too long in Through the Ages, even if TTA is in fact a little bit more thematic and having more unique powers. Compared to Imperial Settlers, while TTA's powers are more abstract, there are also a lot of strong effects in the events deck that you have to watch out for, that therefore means you might need to metagame to play optimally. Most of them basically level the playing field a bit and punish whoever has least military/hurt whoever has most, so it isn't arbitrary, but there are others such as Rats that can catch you off guard. Also, maybe I was just soured by not figuring out how to develop an engine properly, but it felt like that I was out of the running 2/3 of the way of the game, yet still had to play another hour to finish it up, and the decisions and what I built at the end didn't give enough fun to make up for the downside of winning being a lost cause.\n\nEDIT 2: The tableau building in this game is fun, the management of enough resource cubes and population cubes and unhappiness and worrying about negative events and other military-related stuff is not.\n\nEDIT 3 after playing full game, non-peaceful: I dislike the aggressions/wars in this game (I'd rate it as a 4 or 5 in such mode), but this game is clearly designed to have combat on. The issue is the targeted attacks here isn't necessarily even bash the leader; it's bash the player(s) who has low military (which wasn't me), which since they are continually getting bashed they are less likely to be able to keep up militarily. If I were designing the game, I would (not necessarily saying these changes are better, just I would like the game more. These changes would make the game less unique):\n-Have no corruption mechanism. Instead, there would be a resource hold limit.\n-No happiness mechanism, instead the cost to increase population increases at a steeper rate.\n-No events/aggression/war that can make you lose tokens.\n-Aggressions and wars would have a weaker effect in 3 and 4 player games, but would target all other players.\n-Less standardized cards for more unique effects.",
    "timestamp": 1736031600
  },
  {
    "username": "MichielTummers",
    "rating": 5.0,
    "comment": "Played this recently one time. It is solid, not THAT hard to understand, although there are some confusing small rules, and ofcourse i sucked big time, because i was more busy remembering stuff and trying some things out instead of being really competitive. This game does MANY things good! I love the many tactics, mechanics which seem to work together effortly, and also really cool is the giant timeline in which you really have the feeling to go \" through the ages\" . Just like in Twilight Struggle, you are not playing a \" race\" or a \" player\" but you are some overlord watching down as the years go by, tactically influencing events and leaders by playing cards, something i really like.\n\nThe only pure negative for me is the timeframe. 3 hours is really long BUT... its 3 hours well spend(to be fair, Twilight Struggle mostly lasts just as long as does chess) and what it really does well is that feeling of progression to keep stuff interesting. Nothing feels more dragging as doing the same stuff in turn 1 as you do in turn 3939 (i am looking at you, Village..) .\n\nOveral, verdict: want to play again and some more after that! Well done",
    "timestamp": 1728165600
  },
  {
    "username": "Stingart",
    "rating": 5.0,
    "comment": "Good mechanically, but sooo long. The last era decides everything, the game could even start and be decided then. Often only the final decisions matter.",
    "timestamp": 1728079200
  },
  {
    "username": "JamieRufe",
    "rating": 5.0,
    "comment": "Rating: Interested\nI'm conflicted about Through the Ages (TtA). As a game design, it’s a solid 10, but as a gaming experience for me personally, it’s more of a 5. Despite giving it multiple chances, the strategy and gameplay just haven’t clicked for me. On a single-turn basis, the process of building your civilization and managing resources is addictive and satisfying. However, stretched over three ages, the game often feels like a relentless struggle to stay afloat. It's just too difficult and punishing for my liking. Much like Tigris & Euphrates, I find myself feeling uncomfortably tense before each turn, which makes it a game I can't play regularly. While I’ll enjoy it occasionally, it's clear that TtA hasn’t become an all-time favorite for me.",
    "timestamp": 1726437600
  },
  {
    "username": "Sevayth",
    "rating": 5.0,
    "comment": "Really good on the App-store version, but this does not work with other people.\nThe mechanics are so well done, but when it takes 5 minutes between your turns there is something that needs fixing. Also when the what the other players turn does not affect you much.\nIf you start falling behind it is a bonus for the others ahead to attack you, so you fall further behind. Again, what did they think?\nTry \"Nations\" instead, similar gameplay and better in my opinion.",
    "timestamp": 1721944800
  },
  {
    "username": "Almilcar",
    "rating": 5.0,
    "comment": "Sold. Game becomes a nightmare as soon as there are other players extremely aggressive. I do know it's part of the game and a key element of it. But getting Agressions from almost every opponent every other turn makes the game too harsh for my taste.",
    "timestamp": 1721167200
  },
  {
    "username": "Oezz",
    "rating": 5.0,
    "comment": "Slow, ponderous civilisation builder. I like the huge variety in cards, but consequence is it can be difficult to plan for when cards might appear. Honestly as a noob player it feels like a ship on the verge of capsizing, violently tilting one way then the other. The game is in trying to balance so many needs. Military feels difficult to do well, but that is likely a group meta issue. Also doesn't feel particularly thematic or that you're building a unique nation.",
    "timestamp": 1719180000
  },
  {
    "username": "LancelotSpirit",
    "rating": 5.0,
    "comment": "Played a few times, tried to get the PC version to see if I missed something (some ppl in my group love it and would want to play a lot more).\nI really get a terrible feeling when playing it, that I can't build the engine I would want to while still permanently getting attacked by the other players...",
    "timestamp": 1714946400
  },
  {
    "username": "Patesco",
    "rating": 5.0,
    "comment": "Way too fiddly, the system seems to be set up to confound most of your desired decisions.",
    "timestamp": 1713650400
  },
  {
    "username": "SecretSauce275",
    "rating": 5.0,
    "comment": "App only",
    "timestamp": 1711580400
  },
  {
    "username": "PSV_2021",
    "rating": 5.0,
    "comment": "Ооооочень долго. Оно не стоит того.",
    "timestamp": 1707606000
  },
  {
    "username": "blanket221",
    "rating": 5.0,
    "comment": "是一款資源建立、搶奪遊戲，每個玩家使用資源管理、發現新技術、選出合適的領導人、創造奇蹟和維持強大的軍隊來建立最好的文明。在這過程中別被敵人發現自己的弱點了，任何方面的弱點都可能被對手利用。遊戲發生在各個時代，從古代開始到現代結束。",
    "timestamp": 1704668400
  },
  {
    "username": "AucaCoyan",
    "rating": 5.0,
    "comment": "No me llevo bien con los civs, especialmente los que son muy muy pero muy largos. Trate varias veces de aprenderlo pero nunca llego a escuchar una explicacion completa, simplemente no me atrae lo suficiente como para jugarlo :shrug:",
    "timestamp": 1704150000
  },
  {
    "username": "Hdgami",
    "rating": 4.5,
    "comment": "* 0.5/2 : Art/Craft\n* 1/2 : Interactions\n* 2/2 : Mechanisms\n* 0.5/2 : Tempo/Fluidity\n* 0.5/2 : X-Factor\n*\n* Total: 4.5/10\n\nX-Factor :\nGreat \"All of Famer\". TTA is too long, the decision space is limited and i dont want to commit again with this one.",
    "timestamp": 1699052400
  },
  {
    "username": "mkain45",
    "rating": 5.0,
    "comment": "Digital version",
    "timestamp": 1698879600
  },
  {
    "username": "pablito29",
    "rating": 5.0,
    "comment": "The war and agresion mecanics made this game a waste of time if you dont play to it. So all end playing to armys in a squezy economy. Boring.",
    "timestamp": 1694124000
  },
  {
    "username": "Walex",
    "rating": 5.0,
    "comment": "Maciek / Jago / Paweł",
    "timestamp": 1692396000
  },
  {
    "username": "HowitzerBug",
    "rating": 5.0,
    "comment": "A very satisfying engine/civilization builder. Lots of cubes & cards. It's unfortunately very long (best part of a day) and outstays it's welcome in my opinion. Digital version much faster but slightly less enjoyable/satisfying IMO.",
    "timestamp": 1692309600
  },
  {
    "username": "ajpeart",
    "rating": 5.0,
    "comment": "Too long at 4 players, too potentially mean with take-that war cards.",
    "timestamp": 1688508000
  },
  {
    "username": "ILoseAtLife",
    "rating": 5.0,
    "comment": "TTA has a plethora of choices, but none of them are fun. You spend 4-6 hours slowly upgrading your buildings into better version of themselves. I have very little desire to play this game given the amount of times it requires and how repetitive the game play is.",
    "timestamp": 1687557600
  },
  {
    "username": "basadani",
    "rating": 5.0,
    "comment": "The randomness of military cards can make or break the game. Sometimes the draws go your way, and you feel awesome for building a prospering civilization. But not getting just one card you want in the early game can cause you to constantly be beaten in conflicts by your opponent(s), dooming you to lagging ever behind, and not having fun at all for hours.",
    "timestamp": 1683842400
  },
  {
    "username": "kitwick",
    "rating": 5.0,
    "comment": "Baffled by the design choice to make this game last as long as it does. My first and only game took us around ten hours, spread over three sessions. Lots of boring downtime while your opponents do things you don't care about, and you can't plan much for your turn because you don't know what's going to happen in the card market. The gameplay was OK but didn't massively excite me. It took me the first four hours to get an engine going, during which time I could do frustratingly little on my turns; then it picked up and I started enjoying myself, but it's still a poor fun:time ratio. On top of that, the eurocentric ‘march of progress’ story being told is for me equal parts boring, depressing, and objectionable. It's been interesting to check out, but I can't see myself picking this in future when so many other games provide a similar amount of interest and enjoyment in a third or a quarter of the time.",
    "timestamp": 1683669600
  },
  {
    "username": "Forgeforgeforge",
    "rating": 5.0,
    "comment": "enormous time investment for somewhat book opening moves and clusterfuck ending. Still I would almost never turn down an invitation, because the game just works?",
    "timestamp": 1679868000
  },
  {
    "username": "Entropology",
    "rating": 5.0,
    "comment": "Good game, but sadly not worth the effort of bits and trackers and setup. Staple on the tablet version. I like the improvements over the original.",
    "timestamp": 1679180400
  },
  {
    "username": "CharlieMnemonic",
    "rating": 5.0,
    "comment": "After the four-person introductory game I say, meh. The different cards are interesting, but I never felt I was actually building something. Had this same feeling with Nations, so maybe I just don't like civ games. Traded.",
    "timestamp": 1679180400
  },
  {
    "username": "Zinabi",
    "rating": 5.0,
    "comment": "Great game but physical version is rendered obsolete by the app",
    "timestamp": 1676674800
  },
  {
    "username": "Mechaniac",
    "rating": 5.0,
    "comment": "too long. Period. Terraforming Mars dethrones this one. which is in itself not my thing",
    "timestamp": 1673564400
  },
  {
    "username": "Slexlaw",
    "rating": 5.0,
    "comment": "Takes so long to play the analog version.",
    "timestamp": 1671404400
  },
  {
    "username": "alchemyocelot",
    "rating": 5.0,
    "comment": "Despite its big scope and multiple ways of building up your civilization this turned out to be a boring multiplayer solitaire.",
    "timestamp": 1669244400
  },
  {
    "username": "delli1977",
    "rating": 5.0,
    "comment": "Too long, with huge downtime, many small rules and poor manual.",
    "timestamp": 1667602800
  },
  {
    "username": "Sh0rtz",
    "rating": 5.0,
    "comment": "This game is not bad, but the design is very old school. I think other games offer similar level of strategic planing, while being more elegant. This gets rid of a lot of unnecessary complexity and makes games more fun.",
    "timestamp": 1665612000
  },
  {
    "username": "heathbarATL",
    "rating": 4.5,
    "comment": "It's a fine and interesting game. Some neat card play, but not really \"fun.\" Lots of punishing mechanisms and a runaway leader problem.",
    "timestamp": 1664316000
  },
  {
    "username": "Mikael Stockholm",
    "rating": 5.0,
    "comment": "The mechanics is not very exciting. Overrated game.",
    "timestamp": 1664056800
  },
  {
    "username": "mdrozdziok9595",
    "rating": 4.5,
    "comment": "Nie lubię gier cywilizacyjnych, aczkolwiek ta jest chyba jedyną, do której mógłbym zasiąść\n+ dość proste, logiczne i przejrzyste reguły jak na ten stopień komplikacji\n+ dobrze działająca mechanika\n+ ładnie odwzorowany postęp czasu, technologii, co nadaje klimatu\n+/- bardzo długa\n-losowe wydarzenia, której najczęściej mocno biją w gracza najsłabszego, co tylko dobija gracza najmniej rozwiniętego\n-koszmarny downtime przy 4 graczach\n- nie do końca przekonuje mnie system walk, w których nie ponosimy strat w jednostkach\n- losowo wychodzące karty na tor (komuś może trafić się coś fajniejszego, a komuś totalny crap)",
    "timestamp": 1661032800
  },
  {
    "username": "CascadeHush",
    "rating": 5.0,
    "comment": "4 All the boring parts of a civ game, without the interesting parts.",
    "timestamp": 1652306400
  },
  {
    "username": "stenole",
    "rating": 5.0,
    "comment": "(3-4P) Tableu builder game with a clever economical, corruption and happiness model. The game has an evil bite to it in the lategame if there is disparity in military power.",
    "timestamp": 1651356000
  },
  {
    "username": "SaphariGames",
    "rating": 5.0,
    "comment": "New Leaders and Wonders Expansion\n\nMechanically a 10\n-5 rank for trivialization of colonialism and western imperialism bias in theme",
    "timestamp": 1650405600
  },
  {
    "username": "DaGreenMachine",
    "rating": 5.0,
    "comment": "This is a clearly very well made game that is just not quite my style.\n\nEdit: Having played it a few times now, I like it less and less with each play. It feels too random. Didn't have upgraded resources come up for you? Too bad! You are screwed! Wonders are super OP early on and so just whoever has them come up has a huge advantage. On the other hand, the yellow action cards seem awful, and so whoever has mostly those come up is screwed. The political cards toward the end are complete chaos, with people getting either useless crap or huge points based on pure randomness.\n\nEdit 2: Played it more and it continues to diminish with every play. It is dipping slowly from tolerable into distasteful.",
    "timestamp": 1648504800
  },
  {
    "username": "wamsp",
    "rating": 5.0,
    "comment": "Civilization games appeal to me and this one must be so highly rated for a reason.",
    "timestamp": 1648418400
  },
  {
    "username": "jhaelen",
    "rating": 5.0,
    "comment": "placeholder rating assuming that nothing much changed from the previous version...",
    "timestamp": 1644966000
  },
  {
    "username": "PolarDad",
    "rating": 5.0,
    "comment": "Played on app. Tough. Seems like golf...have to play a ton to get really good at it but not fun enough to play a ton. Also seems like upkeep might be a bear without the help from the app.",
    "timestamp": 1644793200
  },
  {
    "username": "ShakaUVM",
    "rating": 5.0,
    "comment": "Not a very fun game, honestly. Better than Nations, I guess, but that's about all it has going for it. Very boring Euro engine development game.",
    "timestamp": 1640559600
  },
  {
    "username": "d_shh",
    "rating": 5.0,
    "comment": "iOS\nBest @ 3p",
    "timestamp": 1640473200
  },
  {
    "username": "Zete",
    "rating": 5.0,
    "comment": "We all disliked that you can get seriously borked if you don't get a decent draw of cards so you may not be able to upgrade your mines, etc. The notion that specific mines, etc. aren't just available in a common pool is silly.\n\nOverall it's an OK game but I'd never be willing to ask to play it as it just takes so long. There are vastly better games that play in a fraction of the time.\n\nPrefer to play online as it does all the fiddly crap.",
    "timestamp": 1639177200
  },
  {
    "username": "Dozwa2902",
    "rating": 6.0,
    "comment": "played",
    "timestamp": 1762297200
  },
  {
    "username": "jordashing",
    "rating": 6.0,
    "comment": "It’s ok. Wouldn’t mind playing occasionally. But would probably prefer the app. Too long for what it is in the physical form.",
    "timestamp": 1759615200
  },
  {
    "username": "muldor",
    "rating": 6.0,
    "comment": "After hundreds of games I realized i get tired of very tight gameplay",
    "timestamp": 1759442400
  },
  {
    "username": "Killi",
    "rating": 6.0,
    "comment": "Good game, just takes too long. Don't play this at more than 2p. Unless you play in the app!",
    "timestamp": 1756504800
  },
  {
    "username": "Lup_78",
    "rating": 6.0,
    "comment": "Largo. Lindo. Muy occidental.",
    "timestamp": 1756418400
  },
  {
    "username": "aresil",
    "rating": 6.0,
    "comment": "bga hard to set and calculations -1",
    "timestamp": 1752789600
  },
  {
    "username": "CotB",
    "rating": 6.0,
    "comment": "Awards\n-Best Heavy Weight Game 2017\n-3rd Best Long Game 2017\n\nRankings\n4th Best Game 2017\n10th Best Game 2018\n33rd Best Game 2019\n65th Best Game 2020\nUnranked 2021\n183rd Best Game 2022",
    "timestamp": 1750888800
  },
  {
    "username": "Mueckerling",
    "rating": 6.0,
    "comment": "Killed by the app.",
    "timestamp": 1750456800
  },
  {
    "username": "ozsoffy",
    "rating": 6.0,
    "comment": "Played it once, 6hr game, its a bit long, even for a first run.\n\nI liked the game. it has a good vibe to it.",
    "timestamp": 1749592800
  },
  {
    "username": "Onbase",
    "rating": 6.0,
    "comment": "I like what this is doing, but it felt a bit too long for what I wanted. I enjoyed the arms race in science, culture, and military, but there was just too much time between all of my interesting decisions and interactions with the other players. I feel like there are plenty of other games out there that offer a much higher ratio of gameplay decisions to game/turn length.",
    "timestamp": 1747778400
  },
  {
    "username": "Butlersox20",
    "rating": 6.0,
    "comment": "Includes expansion in base box.",
    "timestamp": 1744927200
  },
  {
    "username": "D3C6",
    "rating": 6.0,
    "comment": "Too long. That's the problem. And if you are playing it on the table there's lot's of fiddling also. Great civilization game though.",
    "timestamp": 1744322400
  },
  {
    "username": "kylpo",
    "rating": 6.0,
    "comment": "(after 6 plays against bots in 2p and 3p)\n\nRating: 6\n\nThis game is good, not great. I am happy to have played it (in digital form--would never play this on tabletop), but don't care to play any more. I'd rather play Ark Nova. I'd rather play Gaia Project.\n\nI *really* like the amount of interaction in this game (for a tableau builder): from combat, colonizing, pacts, and even drafting from the card river. I also think the limit of yellow and blue resources is very clever, but also leads to a problem I have with the game.\n\nI have 2 main issues with the game\n1. Each game largely plays the same. Because the decks have a specfic amount of specfic cards, you can plan out builds and somewhat go through a mental flow chart for what you should prioritize on your turn. You can go after different builds and strategies, but there aren't many different paths to victory (points or military). So there isn't as much to explore as Gaia Project's many factions or Ark Nova's many maps + many more viable paths to victory.\n2. Luck of the draw can make or break you. If you aren't able to snag farm or mine upgrades for multiple cycles, then I believe you're hosed. I can think of two potential solves for this: 1) introduce a global trade market where you can convert resources; or 2) get rid of the clever, but really limiting food supply demands. The game in its current state basically demands you to stay lean and only have 2-3 workers in a given column. If I missed out on 2 cycles of farm upgrades, then I need an out like adding more workers to my low level farm, but if I do, their production can not outpace their demand.\n\nOther nitpicks:\n- Agression attacks basically never work. They're so easily blocked.\n- Event deck is swingy. Sometimes game-breakingly swingy (e.g. lose something that gave you Happy, now you face revolting and don't have food to make a worker for a Happy production next round. You're completely locked up). For a game this long, it is quite a bummer.\n- Not being able to move workers to different columns means I can't play as reactively or dynamically as I'd like. Forces me to \"stick to my builds\" of 2 farmers, 4 miners, etc...\n\nI like aspects of this game, but ultimately, it has only made me appreciate Ark Nova and Gaia Project more. Also, if I'm only going to play its digital form, then I may as well just play Civilization for a far better experience.",
    "timestamp": 1744063200
  },
  {
    "username": "tectactoe",
    "rating": 6.0,
    "comment": "Not sure I could ever play the physical version again after having been enlightened by the digital implementation. It certainly has highlighted just how much of the gameplay is bookkeeping and/or cube management. (Answer: a lot.) But regardless of the somewhat painstaking means to arrive there, this is a phenomenal civilization builder. Perhaps the best. Huge variety of cards and several paths that lead to victory. Core tension of the game comes from the civilizations' military strengths - you don't have to necessarily be the strongest civ to win, but you also cannot completely ignore your military strength, otherwise you will become a punching bag for the other player(s). I'm often in awe of how the various elements here work so well together without completely losing balance.",
    "timestamp": 1740524400
  },
  {
    "username": "goethean",
    "rating": 6.0,
    "comment": "Very abstract.",
    "timestamp": 1740438000
  },
  {
    "username": "LucasG21",
    "rating": 6.0,
    "comment": "Own on Steam",
    "timestamp": 1738796400
  },
  {
    "username": "Ryokunn",
    "rating": 6.0,
    "comment": "Might be a bit too long. Length + randomness make this a game I'd play only if the stars align.",
    "timestamp": 1737932400
  },
  {
    "username": "SpaceYeti",
    "rating": 6.0,
    "comment": "Played app version.",
    "timestamp": 1737241200
  },
  {
    "username": "yoyomanhihi",
    "rating": 6.0,
    "comment": "Deep in strategy. However, I find it a bit overwhelming with cards and elements, mostly at ages 2 and 3 when your plateau becomes huge. It's absolutely not player friendly and is very difficult to teach, since things are not intuitive. I think the gameplay is interesting, but all the cards and texts to remember and take into account all the time makes in unsatisfying. Also, it's insanely long and I would never play it in person, in BGA why not.",
    "timestamp": 1736377200
  },
  {
    "username": "invervegas",
    "rating": 6.0,
    "comment": "Complexity √ - Set up time and complexity, as well as being available on the app, means I called to this game",
    "timestamp": 1736377200
  },
  {
    "username": "marriedcouple",
    "rating": 6.0,
    "comment": "It's a fun game but it can take a long time to play. Depending on who all is playing, you might have your turn and then wait 20 minutes to go again.",
    "timestamp": 1735772400
  },
  {
    "username": "Valcurdra",
    "rating": 6.0,
    "comment": "Brilliant game in many ways, pretty flawed in others.\n\nNot really accessible as a physical board game, the app is much better. Very fiddly and heavy, requires some experience to really shine.\n\nThematically rich and wonderful very asymmetric and each game plays so different.\n\nUnfortunately after many plays I have to cool significantly on it as a strategic experience.\n\nYou play for Soo long and often results come down to very swingy card draws from the military deck draw. Thematically that deck is amazing, but mechanically it really grates on you after a while.\n\nI'll still play occasionally, but I'll rarely plat without some level of annoyance at random events.",
    "timestamp": 1735254000
  },
  {
    "username": "Shinafein",
    "rating": 6.0,
    "comment": "App",
    "timestamp": 1734908400
  },
  {
    "username": "MrOrient",
    "rating": 6.0,
    "comment": "I played it a couple of times so far and at this point I liked the game mechanic and the theme but the game took quite long. I'm happy to play it again if I find the time and the possibility.",
    "timestamp": 1734130800
  },
  {
    "username": "Paccachu",
    "rating": 6.0,
    "comment": "1-4",
    "timestamp": 1729029600
  },
  {
    "username": "Crysthorn",
    "rating": 6.0,
    "comment": "Pretty good game in digital version, but nearly unplayable in paper due to horribly long and arduous accounting with cubes.",
    "timestamp": 1728770400
  },
  {
    "username": "behr77",
    "rating": 6.4,
    "comment": "Cube pushy like Terraforming Mars. Also card based, though obviously in a different way. Overall feel the app is just a better implementation of the game. Also would only really want to play 2 player",
    "timestamp": 1723672800
  },
  {
    "username": "burnstar",
    "rating": 6.0,
    "comment": "5x5 2017. The game is basically about managing and balancing a bunch of currencies- food, resources, science, happiness, military, and of course your population/workers. All these interact in various ways and a it's complicated enough that managing it all is pretty interesting. The theme comes through somewhat, although maybe not as much as I'd like, and it is fun building your civilization from antiquity through to modern times. Although I can't help but feel like you're really doing the same stuff throughout the whole game- the numbers on the cards just get bigger. And this is a really long game- with inexperienced players this is an all day epic. The military deck, and the military aspect in general, is nasty but makes the game much more interesting and tense, otherwise this is multiplayer solitare. A solid civ game and that's no small feat. But my search continues for one I really like.",
    "timestamp": 1722722400
  },
  {
    "username": "MonKeYK1nG",
    "rating": 6.0,
    "comment": "Unfortunately, the order of the cards in the store is based on luck. There is a lot of hate-picking of cards, so in my opinion the game doesn't have the depth it actually promises. The game is also too long for that.",
    "timestamp": 1719612000
  },
  {
    "username": "tedsternator",
    "rating": 6.3,
    "comment": "This game is incredibly hard to rate. It's good - it's very good! It's really long - I love long games! It's... kind of dull? Is that even a bad thing? It's definitely not exciting - and there is where it gets a little fuzzy for me. I don't know if I'm ever excited to play this game, even though I'd for sure sit down and join some friends for a game of it. I don't see it on my shelf and feel warmly about it, I don't get a thrill showing it to my friends. I don't think I've suggested a game of it in at least 4 years.\n\nThere's nothing wrong with this. It's a very well-made game that can really hum when everyone gets it. It just doesn't do anything to really hook me, either, and that takes what is probably an 8.5 design down to a just-under-8 score for me.",
    "timestamp": 1717106400
  },
  {
    "username": "ImZhe",
    "rating": 6.0,
    "comment": "Can't imagine playing this physically, but digital was decent",
    "timestamp": 1715810400
  },
  {
    "username": "svengineer99",
    "rating": 6.0,
    "comment": "Tried both physical and digital, same problem: always lose interest before if not well before Age III. Specific advancements, wonders, leaders vs countless others of equal (or more) significance just feels weirder and weirder as the game progresses. Much prefer Bios Origins, although it has problems of its own, those are more easily addressable with house rules.",
    "timestamp": 1713477600
  },
  {
    "username": "immersedreality",
    "rating": 6.0,
    "comment": "Purgatory (3)",
    "timestamp": 1712700000
  },
  {
    "username": "Acama",
    "rating": 6.0,
    "comment": "Very thematic civilization game. Quite fiddly mechanisms and overly long gameplay take a lot of the fun out of this game.",
    "timestamp": 1712008800
  },
  {
    "username": "cbazler",
    "rating": 6.0,
    "comment": "Better than the original: the art upgrade, though superficial, enhances the game experience, and I like the changes that have been made: corruption is evaluated before production, so it's much easier to calculate, and I like how you can now copy other players' tactics. I'm unsure about no longer being able to sacrifice units, though, which was an important way to win aggressions (especially if you were behind in military).\n\nUPDATE: This used to be a \"9\" for me, but after 10 or so plays, it's just too long and too dickish to be fun for me anymore. It's a great app when you're being horrible to an AI, but amongst friends it doesn't feel good.",
    "timestamp": 1711580400
  },
  {
    "username": "magoivan",
    "rating": 6.0,
    "comment": "Un supor de juego. Mejor jugar con la aplicación. Es horrible jugarlo en mesa. Jamás jugarlo en físico.\n\n20/03/2024\nRevisión de nota:\n-Reglamento: 6\n-Diseño: 6\n-Componentes: 8\n-Adicción: 4\n-Escalabilidad: 4\n-Originalidad: 8\n-Tema: 6",
    "timestamp": 1710889200
  },
  {
    "username": "JR66",
    "rating": 6.0,
    "comment": "I wanted to love it more, but just didn't. Not sure why",
    "timestamp": 1709938800
  },
  {
    "username": "Yuri",
    "rating": 6.0,
    "comment": "Will play only as app (which gets +1).",
    "timestamp": 1709679600
  },
  {
    "username": "otysk",
    "rating": 6.0,
    "comment": "I prefer my games quick and snappy. This one feels a bit sluggish. It's too much bookkeeping and not enough player interaction (for me) combined with fairly long play time. I can appreciate it's design, but for me the experience is simply \"ok\".",
    "timestamp": 1709074800
  },
  {
    "username": "johnclark",
    "rating": 6.0,
    "comment": "Meh its ok. Too much admin overhead especially when you know the cards well. Online playing is much better because the computer does all the admin.",
    "timestamp": 1708988400
  },
  {
    "username": "Arah",
    "rating": 6.0,
    "comment": "Didn't enjoy the digital playthroughs, but should give it another try.",
    "timestamp": 1708988400
  },
  {
    "username": "Hoerdler89",
    "rating": 6.0,
    "comment": "Ein gutes Spiel, aber arg lang.",
    "timestamp": 1707433200
  },
  {
    "username": "drok012",
    "rating": 6.0,
    "comment": "Toooo loooong!!!!!\nNever ending!",
    "timestamp": 1705705200
  },
  {
    "username": "SkaVen6",
    "rating": 6.0,
    "comment": "Fajna gra, ale... strasznie czasochłonna, a ostatnia era źle zbalansowana, zbyt losowa :/",
    "timestamp": 1705618800
  },
  {
    "username": "Alyssa Oolacile",
    "rating": 6.0,
    "comment": "Too long.",
    "timestamp": 1705359600
  },
  {
    "username": "claudio212",
    "rating": 6.0,
    "comment": "Perfectly enjoyable card civ game, but not really my jam. I'll play it if people really want to.",
    "timestamp": 1704582000
  },
  {
    "username": "mOCHU035",
    "rating": 5.5,
    "comment": "5 Plays\n\n-3 because of the bookkeeping. So much better online. I would play it more online if there was a good web implementation. Android app is okay to play against AI, but against human opponents, makes the game feel a lot more like multiplayer solitaire which it honestly isnt. I also wish that there was some bloat cut out of the game and that all the cube moving was made more elegant somehow. Definitely better than the older edition in terms of production quality.\n\n5/24/19 - Available online on BGA now. Expecting to get a few plays in and rate this again properly now for the gameplay while not being distracted by all the insane book-keeping. I fully expect this to go up a little bit. Let's see..\n\n= (5/24/19) ok..not moving up.. too long for what it is... card draw randomness is a bit annoying too\n\n-1 (7/9/19) cause i played eclipse recently and as a civ building game, that is just so much better.",
    "timestamp": 1703372400
  },
  {
    "username": "ngidding",
    "rating": 6.0,
    "comment": "Vermont",
    "timestamp": 1702594800
  },
  {
    "username": "malawiing",
    "rating": 6.0,
    "comment": "5",
    "timestamp": 1701471600
  },
  {
    "username": "rancidmike",
    "rating": 6.0,
    "comment": "A bit obscure; it's difficult for me to understand the strategy in this game. I'm glad to play it, but it's definitely not my go-to.",
    "timestamp": 1700089200
  },
  {
    "username": "walkincarpet",
    "rating": 7.0,
    "comment": "NIS. Low trade interest.",
    "timestamp": 1759356000
  },
  {
    "username": "kensiebensie",
    "rating": 7.0,
    "comment": "Upgrade from Tom",
    "timestamp": 1759356000
  },
  {
    "username": "Aurion254",
    "rating": 6.5,
    "comment": "Played this 4-player at a friend's house and it was good but very long. My experience wasn't the best as I'd pursued military might when we were playing the introductory rules and nobody explained to me that you couldn't win militarily! That aside, my main annoyance with this game was the amount of downtime between turns. I feel like it would benefit from a synchronized card drafting mechanism instead of having to wait for over half an hour to do anything (longer when you are playing with someone who suffers from analysis paralysis). Still, it's a good game and I'd play it again.",
    "timestamp": 1759183200
  },
  {
    "username": "Avid_Equinox",
    "rating": 7.0,
    "comment": "A decent civ-themed tableau builder; I would play again, but it's not too thrilling overall.\n+ Fairly good representation of the Civ video game\n+ Good player interaction via politics/military\n\n+/-: Lots of depth of strategy, but casuals are unlikely to play it often enough to see the most of out the game. You can get gapped, hard.\n\n- Not exciting in terms of combos: incremental income building and small bonuses\n- It can feel a little \"baked in\" with lane style drafting without much room to pivot strategy if you start to go down a scoring route",
    "timestamp": 1758492000
  },
  {
    "username": "Mentatgamer",
    "rating": 7.0,
    "comment": "Would be an 8 or 9 if in digital form",
    "timestamp": 1758319200
  },
  {
    "username": "peterlevi",
    "rating": 7.0,
    "comment": "(open)\n\nAfter two games, not a great fan.\nPlays very slow, both games took forever without people doing super slow turns, and both times we played the short game, i.e. no age III cards.\nThere seems to be a massive runaway leader issue. Both times a player who, by luck, got a chance to build an early military lead, ended up winning easily. Military advantage snowballs into economic advantage. There is no mechanism for weaker players to stop a runaway leader, even if they collaborate actively.\nIt's a civ game, but there is no sense of real progression - turns go slower and slower with more action points, numbers increase in absolute value, but the core of what players do stays the same. The fact is the whole game you are pushing roughly the same - give or take - blue/yellow cubes up and down.\nFor such a long game, luck of the draw definitely plays a huge role.\nInteraction is kinda there, to an extent, but extremely negative.\n\nFor an actually good civilization game that evokes a sense of change over time, and feels more epic while being 4 times shorter, play Innovation instead, it's infinitely better.\n\nFor a tableau/engine builder with more diverse and interesting cards, Terraforming Mars is way better.\n\nEdit: After several days, I do still have an urge to give it another go, upping the rating from 6 to 7.",
    "timestamp": 1758060000
  },
  {
    "username": "Scifi66",
    "rating": 7.0,
    "comment": "After trying many other wannabes this is the best of the medium+ engine builder civilisation games. It's fiddly and full of Vlaada procedure but it deserves respect. Prefer 2p but would play 3p.\n+ Excellent decision making space\n+ Punishes mistakes\n+ Seeding of the event deck\n± Weird ahistorical combinations Joan of Arc leading tanks\n- Fiddly refresh during and after turns\n- Weakest military is a piñata and everyone targets them which can lead to unfunny experiences (ok in 2p)\n- Runs long with 3 don't play with 4",
    "timestamp": 1757109600
  },
  {
    "username": "hiimjosh",
    "rating": 7.0,
    "comment": "This game taught me something about Vlaada: Vlaada is the anti-Knizia; lots of mechanics, dense complicated rules with swingy outcomes. Vlaada focuses on the theme first then builds the rules to support them theme. As a result, you get games that feel thematic and varied but have loads of exceptions and rules, and in some ways Through the Ages feels like the perfect example of one of these games. It is a game that you learn and feel like \"okay, and that's it right?\" and then there are three more sub-systems to learn about. I joke that Through the Ages makes Terra Mystica look elegant\n\nIt doesn't quite remind me of games like Vinhos where you have games within games and need to go over each one before you can even really understand what your doing. It avoids this pitfall by having more direct phases, but it's still a pain to go through and will take many plays before you feel like you're doing everything right\n\nAt the end of the day Through the Ages is a cube durdling engine-building game with minimal interaction and is very mechanical. You will spend most of your time trying to figure out how to fit the card line into your current situation and how to convert X cubes into Y cubes to play Z cards to get points. There's a little interaction with military cards (and you do need to pay attention to military or get screwed) and events but the majority of the game is staring at your board pushing cubes around.\n\nAs I get older and wiser I tend to not like these types of games, and after a few hours with the rulebook running through a sample game I was pretty bummed out that the game was so overwrought. Thankfully I was able to play the app afterwards though and really get my head around it. It doesn't change my opinion that TtA simply has too much crap, but it did help me see the appeal of the game which is the variety in the cards.\n\nThe cards are what make TtA an interesting game, and in those cards is a number of strategies and timings. It reminds me a lot of what I enjoy about Innovation - discovering the various interlocking strategies and learning to perfect each. I agree that this is a very cool part of the game\n\nHowever it doesn't make the game less fiddly, and if you're anal like I am then checking up every little exception drags the game out severely. I feel TtA needs one more revision - something to speed it up to get it under (or even to) 2 hours consistently. Some sort of simultaneous play or streamlining of the durdle board would be very nice\n\nHow do I feel at the end of the day? I'm undecided right now but will keep it and try to get it to the table a few times before passing judgement. I do like the app and think it plays very well there for some engine building fun. I'm just not sure this is a game I want to break out very often, and if that's the case then why have it at all?\n\nEDIT: The game can be a bit durdly but overall I really like Through the Ages. I sold my physical copy as it was too cumbersome to teach/play, but the app version is A++. The game has loads of replayability and is very satisfying. The expansion is also excellent.\n\nI love this game, but it's simply better digitally",
    "timestamp": 1756850400
  },
  {
    "username": "rongbeo93",
    "rating": 7.0,
    "comment": "The physical game's tedious setup and long play time make it hard for me to enjoy anymore, though I'll still play the digital version for its convenience. While I appreciate the deep strategy, solid gameplay, and moderate player interaction, the experience is too dry for my group to truly enjoy.",
    "timestamp": 1756677600
  },
  {
    "username": "khaine1969",
    "rating": 7.0,
    "comment": "4",
    "timestamp": 1756245600
  },
  {
    "username": "Rhythm_and_Blues",
    "rating": 7.0,
    "comment": "Only played once and was badly taught. Did not know how military worked, and still don't. I'd be keen to go back for a retry with the game taught fully. From what I did play (we didn't finish the play), the game was pretty fun, but the experience was not great due to the problems. Even with this bias, I felt like I could get more crunchy and satisfying experiences with other similar games.",
    "timestamp": 1756245600
  },
  {
    "username": "StefanieB",
    "rating": 7.0,
    "comment": "Schrank",
    "timestamp": 1755295200
  },
  {
    "username": "Qwasert",
    "rating": 7.0,
    "comment": "This game would be a 10 if it was just a bit more balanced. It could just be our group, but some strategies (like being military focused) consistently lose every game.",
    "timestamp": 1754604000
  },
  {
    "username": "Doctor_Cowboy",
    "rating": 7.0,
    "comment": "Fun game with interesting interactions. Kind of a worker placement vibe in how you're claiming certain cards vs your neighbors. Good payoffs for going deeper into military, science, economy, etc. Not as good of payoffs for balancing all 3, though. Great 2p game and scales fairly well into 3p, but 4p makes it drag a bit for me.",
    "timestamp": 1754344800
  },
  {
    "username": "Popoak",
    "rating": 7.0,
    "comment": "Digital Version",
    "timestamp": 1754258400
  },
  {
    "username": "Jestertrek",
    "rating": 6.5,
    "comment": "It's not as complex as the weight rating would suggest, but I must be missing something fundamental about why people like it. For me, the juice is not worth the squeeze, and it's a LONG, dreary squeeze. Lots and lots of dead time while other players take their turns is the order of the day, and Heaven help you if one of those players has AP or locks up their game (which can happen). -0.5 for open use of slavery and colonization.",
    "timestamp": 1753740000
  },
  {
    "username": "Bryle",
    "rating": 6.5,
    "comment": "GROUP AVERAG: 7.51 / 10\nBryle: 6.75\nDewey: 8.5\nFung: 8\nSixtus: 6.8\n\nThrough the Ages wonderfully marries oppressive engine building with open ended goals and strategy. Overwrought player turns and excessive game state upkeep, result in Through the Ages feeling like a dated design despite it's revisions however. The game's unreasonable length and amount of rules will likely doom Through the Ages to the shelf for long stretches of time.",
    "timestamp": 1753480800
  },
  {
    "username": "Nearus7",
    "rating": 7.0,
    "comment": "//",
    "timestamp": 1753480800
  },
  {
    "username": "RoundTableGames",
    "rating": 7.0,
    "comment": "not on Alliance list",
    "timestamp": 1753308000
  },
  {
    "username": "willbeplayin",
    "rating": 7.0,
    "comment": "It's really no wonder why this is so high up in the rankings. Solid game but I've yet to play it live so a lot of the score comes from the BGA version.\n\nStill really liking it. So much going on and so many ways to win the game. Yet I don't go really searching for it in and still prefer to play many other games of the same length/weight so there's something about it that's quite taxing in a sense.\n\nOnly played online.",
    "timestamp": 1753308000
  },
  {
    "username": "Blayzerg",
    "rating": 7.0,
    "comment": "I want to like this game more than I do. The more I play it the less I enjoy it as I find it just all boils down to military and luck with military. And if that's your bag great, but just not mine.",
    "timestamp": 1753048800
  },
  {
    "username": "HunDundee",
    "rating": 7.0,
    "comment": "BGA",
    "timestamp": 1752789600
  },
  {
    "username": "Oliver_D",
    "rating": 7.0,
    "comment": "I should try this again, we played it 2017/18.",
    "timestamp": 1752012000
  },
  {
    "username": "MichaelaPat",
    "rating": 7.0,
    "comment": "2025",
    "timestamp": 1750888800
  },
  {
    "username": "toaster83",
    "rating": 7.0,
    "comment": "Through the Ages distills civ building down to a card market and a few resources while adding the pressure of military action to keep players in check. Getting all the parts of your engine running is tough, and you have to work with what the card market presents to you. This creates an engaging pressure that means you have to make every move with intent and keep looking over your shoulders. The expressiveness of the design without any map is impreesive.\n\nI’ve only played this digitally though I am keen to try it on the table at least once. I can see the fiddly nature of the physical game just by playing the digital version, but I think with enough experience already gained that it’s likely fairly manageable.",
    "timestamp": 1750716000
  },
  {
    "username": "rws2029",
    "rating": 7.5,
    "comment": "• complexity done right\n• civilization rendered in a card tableau",
    "timestamp": 1762660620
  },
  {
    "username": "GigaOne",
    "rating": 7.5,
    "comment": "Good game but it lacks some interaction between players and is a bit long to play for me to love it. But if you are looking for a civilization-type game it is one of the best out there !",
    "timestamp": 1762383600
  },
  {
    "username": "rainbowflight",
    "rating": 7.5,
    "comment": "Described as resource engine building game about progressing your civilization across the ages. (It even has happiness level that is tracked by smiley faces.) More city builder than beat up your opponent via military.",
    "timestamp": 1761084000
  },
  {
    "username": "Yvan13",
    "rating": 8.0,
    "comment": "Gros jeu de civilisation à base de cartes\nComplexe mais intéressant",
    "timestamp": 1760824800
  },
  {
    "username": "mac_s_1",
    "rating": 8.0,
    "comment": "It's definitely an improvement over the - already excellent - original.",
    "timestamp": 1760565600
  },
  {
    "username": "badassbr",
    "rating": 7.5,
    "comment": "É um dos melhores jogos de civilização já feitos\nEle já é meio que \"scriptado\" no sentido de que quem já joga muito sabe muito as cartas que tem que pegar, ou qual carta pegar se o adversário escolheu a carta \"x\"\n\nSe vc e ninguém dos seus amigos jogou, pegue com certeza!",
    "timestamp": 1760306400
  },
  {
    "username": "edubvidal",
    "rating": 8.0,
    "comment": "Jugado online más de cien veces. Lo compré pero no me atreví a sacarlo a mesa y terminé cambiándolo. La primera partida se puede hacer muy pesado a cuatro jugadores.\nNunca descuides lo militar porque es clave. Centrate en lo militar y gasta el resto de tus recursos en algo que te de cultura pero sin llamar mucho la atención.",
    "timestamp": 1759960800
  },
  {
    "username": "Raftprisos",
    "rating": 8.0,
    "comment": "20, new, 24 patrnj 16",
    "timestamp": 1759701600
  },
  {
    "username": "logopolys",
    "rating": 8.0,
    "comment": "There's some really nice changes in the new edition. All of the changes to conflict (aggressions and war) are strict improvements. Sacrificing troops for bonus strength was always a fiddly and potentially confusing situation, with either too much benefit or too little benefit. Additionally, being able to use face-down military cards as generic +1 defense against aggressions is a great design choice. Other minor improvements include changing the order of the upkeep process, which minimizes logistical confusion, and creating a common tactics area, which minimizes the randomness of blind non-draftable card draws.\n\nOn the other hand, having played through the new art, I still don't like it. The player and general board layouts are less intuitive, and significantly less compact than the original. I also dislike any reprint that moves from wooden bits to plastic bits (like the FFG printing of T&E).",
    "timestamp": 1759356000
  },
  {
    "username": "garyjgeoaccess",
    "rating": 8.0,
    "comment": "A pretty amazing game. Complicated, yes. But it's all manageable. I could even teach it to my wife, who doesn't normally play complicated games (granted my wife and I play a variant in which you can't wage war). Some aspects of the game do in fact trouble me. I felt I needed an action board, somewhere to place the civil action cubes and military action cubes when choosing an action. So I designed one for each player, in each of the four colors. Problem solved. There is a real tension when playing this game, as you're trying to keep your workers happy, as you're trying to maintain a path for increasing your population while balancing your food and resource needs, as you're trying to forge a path for science increases, and most importantly as you're building a path to culture points. This is the best civilization game I've ever played. By far.",
    "timestamp": 1759096800
  },
  {
    "username": "Drake51",
    "rating": 8.0,
    "comment": "Based on app version",
    "timestamp": 1759010400
  },
  {
    "username": "asianpsycho",
    "rating": 8.0,
    "comment": "Replaced by app.",
    "timestamp": 1758319200
  },
  {
    "username": "Jarek_Zat",
    "rating": 8.0,
    "comment": "Physical board games is good, but digital version is much better...",
    "timestamp": 1757973600
  },
  {
    "username": "fordisdrinking",
    "rating": 8.0,
    "comment": "Un des meilleurs jeux de civilisation mais une ergonomie de jeux affreuse. L'app est tellement mieux, et c'est dommage car ses mécaniques sont uniques et brillantes !",
    "timestamp": 1757887200
  },
  {
    "username": "ninqt",
    "rating": 8.0,
    "comment": "Looooong game but I like it, it can be incredibly punishing but it does offer an interesting long drawn out race/battle. I would never play this at more than 2 players though. I actually think if it was a bit shorter it would be better.",
    "timestamp": 1757800800
  },
  {
    "username": "marinexx",
    "rating": 8.0,
    "comment": "Best engine builder ever! Downtime in the endgame is very bad, though. Awesome game though but never play it with a player count other than 3.",
    "timestamp": 1756677600
  },
  {
    "username": "robbyjey",
    "rating": 8.1,
    "comment": "My favorite civ game.",
    "timestamp": 1755986400
  },
  {
    "username": "Auroric",
    "rating": 8.0,
    "comment": "Extremely satisfying, deep, and variable choices. Surprisingly high level of interaction. Huge skill ceiling is apparent, and it's a theme I enjoy.\n\nHowever, I seriously miss having a spatial element to a civ game. Of course the game is fiddly, long, etc, but that doesn't bother me too much. If anything I find the pacing to be a little strange, like I don't get to enjoy the fruits of my strategy as long as I would like to. Having classical buildings mixed with modern buildings still in use is also a little off putting. It's glaring flaw is the pummelling that the trailing player receives from military, although experienced players would mitigate this.\n\nOverall a great game, not quite the perfect civilization game I'm looking for, but the closest I've found.",
    "timestamp": 1755900000
  },
  {
    "username": "demuellae",
    "rating": 8.0,
    "comment": "SB",
    "timestamp": 1755468000
  },
  {
    "username": "SenseiZen",
    "rating": 8.0,
    "comment": "Good rulebook, strategic, civilisation type game, for some people \"too complex\", long games (around 2 hours), i allmänhet väldigt hög rating och väldigt bra kritik, top 15 overall, top 13 strategi",
    "timestamp": 1755295200
  },
  {
    "username": "mingrkli",
    "rating": 8.0,
    "comment": "You like civilization building? You like watching your tiny tribe grow into a mighty nation through centuries of history? You like outsmarting your rivals with brilliant leaders, jaw-dropping wonders, and just enough military might to keep them from stealing your lunch? Me give youThrough the Ages: A New Story of Civilization! A 2-4 player game.\n\nHow do you win? Build the most glorious civilization by the end of the modern age, measured in culture points. Every turn, you’ll draft cards that shape your civilization with new techs to research, wonders to construct, leaders to inspire your people. But there’s a catch, the longer a card sits in the lineup, the cheaper it is to draft… but wait too long, and your opponent might snatch it right before your eyes. To use new technologies, you’ll need the science to discover them, the food to grow your population, and the resources (ore) to actually build the things you’ve dreamed up.\n\nAnd then there’s the military. You can’t win just by being strong, but you can absolutely lose by being weak. Other players can raid your resources, cripple your leaders, steal your science, or even snatch your population if your defenses crumble. There’s no map here, but the battlefield is in the numbers, and the danger is very, very real. In the end, the player with the most culture stands victorious, their civilization remembered for the ages. Will it be you or will you be a footnote in someone else’s history book? ?",
    "timestamp": 1755295200
  },
  {
    "username": "onceplayed",
    "rating": 7.5,
    "comment": "learning the game on steam right now, currently unsure how the decision space opens up through the mid game. it has a very tight dramaturgy and youre supposed to do certain things in certain phases. it also has quite a bit of moving parts but im unsure if the card pool supports evolving strategies or if youre nailed down to a couple of lanes. want to try this game with other beginners.",
    "timestamp": 1754085600
  },
  {
    "username": "opks22",
    "rating": 8.0,
    "comment": "iOS version",
    "timestamp": 1753999200
  },
  {
    "username": "benni_jolink",
    "rating": 8.0,
    "comment": "Every choice you make has an impact on how your empire evolves. Managing your food and resources well is essential. End game scoring is a huge chore. Wars and agression can be crippling in the beginning. Just leave them out if you play with new players. The game is sadly a bit too long.",
    "timestamp": 1753912800
  },
  {
    "username": "cathyrichard",
    "rating": 8.0,
    "comment": "3",
    "timestamp": 1753394400
  },
  {
    "username": "Su9ar",
    "rating": 8.9,
    "comment": "good civ game",
    "timestamp": 1762611480
  },
  {
    "username": "DeKerstman",
    "rating": 8.5,
    "comment": "2-4 players, civ building, 120-180 minutes.\n\nI'm a big fan of civilization games, have always played civ games on the PC (mainly Sid Meier's Civilization), so I'm always curious/excited when a board game implementation comes by.\n\nThis one is a revised version of TTA and has been very well received given the very high rating and ranking on BGG. Once I had played it, decided to add it to the collection, although it will probably not get much playtime (it's a bit fiddly and very dry and it is a very long game).\n\nFortunately, I also have the app, so can play it solo (i.e. against the AI).",
    "timestamp": 1762297200
  },
  {
    "username": "Imsevimse",
    "rating": 9.0,
    "comment": "Best civ game I’ve played. The card market elegantly reflects the passage of time. There’s no map; conflicts and other interactions are abstracted into clever card play. Military is central, but you don’t have to be the strongest to win. Expertly crafted yet brutally unforgiving. Plays best with two or three, but becomes overly long and taxing with four.",
    "timestamp": 1761692400
  },
  {
    "username": "Prince_LEE",
    "rating": 9.0,
    "comment": "Lovely game. Quite fiddly though - I prefer the digital version. One of my most played games of all time.",
    "timestamp": 1761606000
  },
  {
    "username": "apax",
    "rating": 9.0,
    "comment": "H",
    "timestamp": 1761519600
  },
  {
    "username": "utexgrad",
    "rating": 8.5,
    "comment": "Our rating based on our first play. I think this score will go up as we play it more and really explore what this game has to offer.",
    "timestamp": 1761170400
  },
  {
    "username": "ExcellentRaven",
    "rating": 9.0,
    "comment": "addictive. FInally a euro where I can grind people down beneath the boot of my civilization. definitely allow for giving up, thematically joining the victorious civ in success. it's not fun if you play out foregone conclusions. Start a second game of it instead!",
    "timestamp": 1760911200
  },
  {
    "username": "xCNapo",
    "rating": 8.6,
    "comment": "Still one of the most thematic games and way ahead of it's time. The only downside are the long turns.",
    "timestamp": 1760738400
  },
  {
    "username": "SJS1971",
    "rating": 9.0,
    "comment": "Great game. Fiddly to keep track of everything, although the player aids and player boards are very intelligently designed.",
    "timestamp": 1760306400
  },
  {
    "username": "milanche",
    "rating": 8.5,
    "comment": "Sleeved",
    "timestamp": 1759960800
  },
  {
    "username": "tuttutZOOM",
    "rating": 9.0,
    "comment": "Very good solo mode\nAcquired in BGG US Math Trade (Jan2025)",
    "timestamp": 1759442400
  },
  {
    "username": "DoctorPhil",
    "rating": 8.8,
    "comment": "Criteria (out of 5)\nRules complexity 3\nPlaytime/complexity ratio 4\nStrategic avenues 5\nMechanism strength 5\nThematic integration 5\nVariability 4\nReplayability 4\nFun factor 4\nSolo mode\nPlayer interaction 5\nElement of mastery 5\n\nOverall 8.8 out of 10",
    "timestamp": 1759356000
  },
  {
    "username": "Fevin",
    "rating": 8.7,
    "comment": "Un bon jeu certes. Mais jouer 4h pour un jeu de cartes c'est assez long et frustrant. Après c'est terraforming mars en nettement mieux. Mais et ce un si grand compliment ?\n\nLa partie courte est potentiellement mieux car elle réduit l'imapct de la partie la plus aléatoire le miliaire) ou l'on draw face dawn des cartes très différentes. Et au final il faut faire comme à Magic piocher un peu de tout.\n\nUne rejouabilité et un équilibrage assez impressionant. Il y'a plein de sortie de secours / plan B pour s'en sortir quand le flux de cartes est défavorable.\n\nLa version digitale accelère le tout. La rejouabilité est très forte.\n\nAprès pas mal de partie suplementaire, en fait la plupart de mes réserves sont fausses. Il y'a tellement de solutions qu'on peut toujours rebondir, ça demande de l'opportunisme et de l'imagination.",
    "timestamp": 1759356000
  },
  {
    "username": "Irish574",
    "rating": 9.0,
    "comment": "Reminds me so much of Civ on the PC. Love all the card options and civ building mechanics here. Teaching hasn't been an issue but the time to play it all in one evening is tough\n\nWill gladly play this game but the turn upkeep is time consuming and a drain. Much rather play by the app these days",
    "timestamp": 1759183200
  },
  {
    "username": "Marius n Milan",
    "rating": 9.0,
    "comment": "2017 Prague Haz\n650\nN",
    "timestamp": 1758924000
  },
  {
    "username": "Slozor",
    "rating": 9.0,
    "comment": "Amazing game, steep learning curve but very rewarding",
    "timestamp": 1758146400
  },
  {
    "username": "AlPacino11",
    "rating": 8.5,
    "comment": "Excellent game! If only it was shorter!",
    "timestamp": 1757887200
  },
  {
    "username": "Jalanaga",
    "rating": 9.0,
    "comment": "2-4x",
    "timestamp": 1757628000
  },
  {
    "username": "Strewth78",
    "rating": 9.3,
    "comment": "4.2",
    "timestamp": 1757628000
  },
  {
    "username": "dalembertian",
    "rating": 8.5,
    "comment": "I love this game, in spite of being long, taking a lot of time to setup and tear down, having a steep learning curve, etc., etc. All true, but still amazing. I don't know how Vlaada Chvátil can make such different games, all good. TtA really gives the feeling of a civilization being built from scratch, in a card-driven way, and with lots of elements that force us to pay attention to what the others are doing - otherwise we can easily get scratched from the map by the military forces, for instance, or a cleverly chosen leader. I don't get to play it much, but each time I do, I want to play it more.",
    "timestamp": 1756418400
  },
  {
    "username": "Ryanelrichie",
    "rating": 8.5,
    "comment": "A truly epic trip through time. The engine building is consistent, rewarding, and always alluring. The various paths you can take to improve your civilization are vast, but you always need to make sure you're not leaving any aspect behind. Does it run long? It does. The Act 2 and 3 decks could be a third smaller, but it doesn't feel like the game needs to end. It can be pretty mean if someone is behind in military, but going in you need to know you have to stay close or you'll be picked at. But this is a truly great game and worthy of it's praise.",
    "timestamp": 1756418400
  },
  {
    "username": "Traquan",
    "rating": 8.5,
    "comment": "App / Two",
    "timestamp": 1756332000
  },
  {
    "username": "saoneal",
    "rating": 9.0,
    "comment": "The struggle of figuring out when to pivot from infrastructure to points-scoring is endlessly captivating for me, as is adapting to the uncertainties of the ever-changing card row. War was a bit of a problem in the first edition, where punching down on the weakest player was almost always the right decision (and incredibly easy), but it's been smoothed out really well in 2E.\n\nMuch as I hate to admit it, grouchy Luddite that I am, my only knock against this is how fiddly it is on the table, and how streamlined and effective the digital versions are.",
    "timestamp": 1756245600
  },
  {
    "username": "Sky Knight X",
    "rating": 9.0,
    "comment": "Brilliantly designed civilization game. Incredibly immersive gaming experience.\n\nCompared to other civilization games:\n\nMore fun than:\nTempus\nSid Meier's Civilization: The Boardgame\nCivilization/Advanced Civilization\n\nAbout the same as:\n7 Ages - but Through the Ages is more accessible\n\nLess fun than:\nNothing. This is the best of the best.\n\nWhy I think this is one of the best games ever made:\nBrilliant game design. After my first game I remember thinking that they couldn't have designed a game like this. They had to have lucked into much of it. That's how impressed I was.\n\nSo many fun elements. Playing the game is fun to do. It's really engrossing to plan and develop your civilization.\n\nThe military aspect, just like every aspect in this game, is integrated perfectly.\n\nWhy some may not like this one:\nToo long. But it doesn't seem like it.\nThe end accelerates out of control. It's impossible for new players to prepare for it.",
    "timestamp": 1756159200
  },
  {
    "username": "OldNews",
    "rating": 9.0,
    "comment": "BID\n\nfolded space insert BID",
    "timestamp": 1756159200
  },
  {
    "username": "Drift Dragon",
    "rating": 10.0,
    "comment": "I've only played in person once, but I've played the app many, many times. It's such an interesting civ builder without a map. I wish it was easier to teach and play physically.",
    "timestamp": 1761865200
  },
  {
    "username": "fmestevez2804",
    "rating": 10.0,
    "comment": "x",
    "timestamp": 1761778800
  },
  {
    "username": "srfdevotee",
    "rating": 9.9,
    "comment": "This rating is based on the STELLAR mobile/desktop app from CGE, which streamlines the game by managing the accounting and taking away all the fiddliness (as well as the setup/teardown). The app is so attractive and well-implemented that I would actually give the physical copy (which I will never play again) one full point less rating.\n\nAlthough the game can be a bit of a numbers-crunching efficiency puzzle as each side seeks to optimize their engine and maximize points, there is a lot of variety in strategy, especially with the expansion, and the theme is rich. Player interaction is also excellent via card draft blocking, occasional military attacks, end of game Impacts, plus you'll need to keep a constant eye on your opponent's progress on military strength and technology in general. Replayability is extremely high. With the app's asynchronous turns, there is no downtime.\n\nOverall, lots of fun, as you take a trip through time and build your empire.",
    "timestamp": 1761778800
  },
  {
    "username": "Abizaas",
    "rating": 10.0,
    "comment": "Brilliant and unforgiving, with a ton of depth. Through the Ages strikes a unique balance between uncertainty and strategy. The introduction of random situations adds complexity to decision-making, requiring players to navigate fuzzy outcomes and react accordingly. Interaction is key in, players can actively disrupt opponents and achieve success at the expense of others, creating a dynamic and engaging gameplay experience.",
    "timestamp": 1760565600
  },
  {
    "username": "Nakira",
    "rating": 10.0,
    "comment": "Through the Ages: A New Story of Civilization – The granddaddy of all civilization board games — no plastic minis, no dice, just pure, distilled strategy. You guide your people from the ancient world to the modern age, making every critical decision along the way: which form of government to adopt, which leaders to follow, and whether to build a temple… or a tank. The game is a masterclass in long-term planning and resource management, where food, science, and culture all compete for your attention (and often, your sanity). Each playthrough tells a sweeping story — Caesar may lead your early empire to glory, only for Bill Gates to take over centuries later with a Silicon-fueled cultural renaissance. It’s intense, brain-burning, and endlessly satisfying — a true epic for those who love to build, optimize, and occasionally crush a rival civilization just to remind them who’s writing history.",
    "timestamp": 1759874400
  },
  {
    "username": "DrFord92",
    "rating": 10.0,
    "comment": "“It’s a game that depends on your decisions, its mechanics are very well designed, and I personally love the theme.”",
    "timestamp": 1759183200
  },
  {
    "username": "Eisblume23",
    "rating": 10.0,
    "comment": "All Cards Sleeved\nGerman Edition",
    "timestamp": 1758578400
  },
  {
    "username": "TheWheel",
    "rating": 9.5,
    "comment": "If you count Board Game Arena, this is my most played game by two orders of magnitude. On the table, probably too high a bar to be a perfect ten",
    "timestamp": 1758405600
  },
  {
    "username": "Stathis_14",
    "rating": 9.5,
    "comment": "Played the app on laptop and phone with the expansion 40 times by now and my urge to play it again and try out things differently had never been reduced. Brilliant game. If it will continue to be as interesting after many many plays, it's going up to 10 as my only 10 rated strategy game and therefore, my favourite game!\n\nThe app essentially reduces the time by a lot and makes all the hard catch up-calculations for you, and that's why it's a lot better than the physical form.",
    "timestamp": 1757973600
  },
  {
    "username": "blaklyte",
    "rating": 10.0,
    "comment": "Expansion:\n- New Leaders and Wonders",
    "timestamp": 1757887200
  },
  {
    "username": "babicmiro",
    "rating": 10.0,
    "comment": "Excellent, meaty Euro-game. What can deter some people is its length - one can get easily lost in time and 6 hours went by....immersive experience really and the theme is really strong and enjoyable",
    "timestamp": 1757800800
  },
  {
    "username": "eminency",
    "rating": 10.0,
    "comment": "most of features are unique in my experience. Additionally, they are organized well.",
    "timestamp": 1757541600
  },
  {
    "username": "arhan",
    "rating": 9.9,
    "comment": "T",
    "timestamp": 1757196000
  },
  {
    "username": "Udruga Kockica",
    "rating": 10.0,
    "comment": "BID\n\nfolded space insert BID",
    "timestamp": 1756936800
  },
  {
    "username": "jauntys",
    "rating": 9.5,
    "comment": "An abstracted, card-based civilization game without a map. Suprisingly it works really well without a map, did not even miss it!\n\nAs a player you build your economy by producing food, resources, science and the most important one culture. During your turn you have a political phase, where event cards or even aggression/war cards can be played, and a civil phase where civil and military actions can be taken by buying/playing cards. For buying cards, there is a card row with cards that represents all of the technologies, leaders, landmarks and wonders of our human history. These cards can be taken for civil actions and also played with civil actions in order to (eventually) gain culture. The player who has the most culture after the third age wins!\n\nIncredible in-depth gameplay with lots of emerging strategies. For me, the digital adaptation get a 10/10. Nonetheless we're talking here about the physical boardgame and that one has two problems. The game takes too long with more than two players and the rulebook is not the best that I have seen.\n\nThis is why the physical boardgame of Through the Ages gets a 9 from me, go play it!",
    "timestamp": 1756936800
  },
  {
    "username": "Sinashakiba",
    "rating": 10.0,
    "comment": "Masterpiece",
    "timestamp": 1756677600
  },
  {
    "username": "alpaya",
    "rating": 10.0,
    "comment": "The best game for me. Maybe Europa Universales close to it.",
    "timestamp": 1755813600
  },
  {
    "username": "Gurkvatten",
    "rating": 10.0,
    "comment": "While I love this game digital has completely taken over. Suffers some in 3+ player due to optimal strategy often being about who can beat up the least experienced player most.",
    "timestamp": 1754776800
  },
  {
    "username": "thirtybrowns",
    "rating": 10.0,
    "comment": "I have played this over 2000 times, mainly online, so I have to rate it a 10. Although now I only play the peaceful variant",
    "timestamp": 1754172000
  },
  {
    "username": "FORTRAN77",
    "rating": 9.9,
    "comment": "Both (Digital and Physical)\nDigital: CGE Digital (Steam)",
    "timestamp": 1752789600
  },
  {
    "username": "CharlieNZ",
    "rating": 10.0,
    "comment": "Played",
    "timestamp": 1752357600
  },
  {
    "username": "20171005",
    "rating": 10.0,
    "comment": "One of the best games I ever played. Building economy, arms racing, planning how to get ahead of opponent victory point and everything what strategy games needed are included. It also has game-ish entertainment, a solid strategy can be beaten by opportunistic flexibility differ from Chess or Go.\nOnly problem is it is too heavy to recommend to my friends and even for me.",
    "timestamp": 1752184800
  },
  {
    "username": "Gia187",
    "rating": 9.5,
    "comment": "1-3p:\nGoede balans in de base game en veel tactieken zijn uit te proberen in deze kaartgame.\nMet twee is dit vrij vlot te spelen in 2.5 uur max.\nMet 4 lijkt dit net iets teveel en is ook heel moeilijk uit te leggen aan medespelers.\nHet spel heeft veel zaken verbeterd sinds de vorige versie. Zo is combat toegankelijk en niet volledig straffend. Het kost wel een beetje tijd en inzet om dit spel deftig te leren en ook wij merkten na 10 keer spelen dat we nog enkele fouten gemaakt hadden.",
    "timestamp": 1752098400
  },
  {
    "username": "Earthshaker93",
    "rating": 10.0,
    "comment": "Steam",
    "timestamp": 1752098400
  },
  {
    "username": "hockeyjones",
    "rating": 9.7,
    "comment": "15\n\nPlayed in 2025\n\nSC: 681 (236, 198, 182, 65 resigned)",
    "timestamp": 1749506400
  }
]