[
  {
    "username": "Burgerchief",
    "rating": 1.0,
    "comment": "Strong mechanics but the setting (plantation in Puerto Rico using slave labor) alone makes this unplayable to me and my group.\nHowever, the first time I played this in a 5p game, before I took my first turn (I was the last to go) the person next to me said: based on what has happened, it’s basically impossible that you win. They were right. So that made me want to never play it again.",
    "timestamp": 1753048800
  },
  {
    "username": "Brybimbap",
    "rating": 1.0,
    "comment": "We should demand more from designers and publishers than the production of this kind of uncritical, colonialist, racist trash.",
    "timestamp": 1750543200
  },
  {
    "username": "Bhipsher07",
    "rating": 1.0,
    "comment": "Gifted\n\nQuintessential Euro engine builder that definitely doesn't feature laborers as brown cubes. Nope. Not this game. Definitely not racist.",
    "timestamp": 1748815200
  },
  {
    "username": "maratha",
    "rating": 1.0,
    "comment": "Not my number 1 game but then I need to play it a few more times to get more out of it I think. Learnt a lot from playing virtual opponents but my group seem to prefer San Juan.\nIt dawned on me that I was playing as a slave owner sometime after playing this, so I sold it. The new editions seem to also be problematic so I am steering clear.",
    "timestamp": 1726610400
  },
  {
    "username": "KAR42",
    "rating": 1.0,
    "comment": "Only have App, not clear how to play on app",
    "timestamp": 1726437600
  },
  {
    "username": "Scifi66",
    "rating": 1.0,
    "comment": "Hated my play of this.\n–Theme is horrible and it doesn't say anything unlike a Wehrle\n–Left-right binding\n–Pre-programmed best moves like openings in chess",
    "timestamp": 1724796000
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "Player A does this, which means B has to counter with this, and then C counters with that. So much euro fun.",
    "timestamp": 1722463200
  },
  {
    "username": "mrappbrain",
    "rating": 1.0,
    "comment": "More racist than Uncle Tom",
    "timestamp": 1712354400
  },
  {
    "username": "Irondell",
    "rating": 1.0,
    "comment": "There will always be a better game to play than this.",
    "timestamp": 1707346800
  },
  {
    "username": "uduhno",
    "rating": 1.0,
    "comment": "The components are super generic, box is ugly, and gameplay is tedious. Rarely do I say that games need to be longer, but the late game resources like coffee barely seem like they are usable. However, a longer game with these mechanics also doesn't appeal to me.",
    "timestamp": 1683237600
  },
  {
    "username": "xbluejayx",
    "rating": 1.0,
    "comment": "Horrible game. Overall theme is not acceptable. Plantations and workers. Game should be banned.",
    "timestamp": 1677884400
  },
  {
    "username": "jrsquee",
    "rating": 1.0,
    "comment": "2021/01: prefer New Frontiers - less problematic theme, more variation, less static openings. slightly less tight, but more varied strategies.\n\n2022/05: been a while since I played this, and it hasn't really drawn me in as compared to roll or race...",
    "timestamp": 1653343200
  },
  {
    "username": "Herstory",
    "rating": 1.0,
    "comment": "The papering over of slavery in this game is simply unacceptable.",
    "timestamp": 1644793200
  },
  {
    "username": "RodimusPrime",
    "rating": 1.0,
    "comment": "I bounced off of this game because of too much boring worker management.",
    "timestamp": 1626386400
  },
  {
    "username": "KvdBergh",
    "rating": 1.0,
    "comment": "A fantastically designed game with tight resources and a lot of player interactions. I enjoy playing it, however the meta-game turns me of on it since I don't have the time to get good at the game.\n\nThis game gets a 1 for me for sticking to its colonialist theme throughout its reprints. We should demand better from designers and publishers.",
    "timestamp": 1623448800
  },
  {
    "username": "KenToad",
    "rating": 1.0,
    "comment": "Unfortunate racist colonization theme spoils otherwise excellent game.",
    "timestamp": 1620511200
  },
  {
    "username": "kissgg",
    "rating": 1.0,
    "comment": "Despite I've always had this opinion, I have refrained from rating this game for years. But recently, I got pissed off by the hypocrisy of this game's \"woke\" fans. Some people go to unbelievable lengths trying to explain away this ignorant, racist, colonialist piece of crap. Only because they are in love with its euro mechanisms. I think if you like PR, you should take a long look at the mirror, asking yourself: \"am I actually not a person with fascist views deep inside?\"",
    "timestamp": 1619820000
  },
  {
    "username": "CleosPack",
    "rating": 1.0,
    "comment": "The mechanics of the game are alright, but the theme. The theme of this game is pretty gross. Puerto Rico is a U.S. territory, it is 2020, and the place has no rights, the islands are subject to U.S. law. Vieques has a museum dedicated to the bombing of the island by the U.S. military, just practicing bombing. There are live mines on the islands and instead of taking care of them, there are just signs warning people to not enter that half of the island of Vieques. This game is clearly made by White Americans with a colonial imperialism theme, no regard for human life. Disappointing.",
    "timestamp": 1593986400
  },
  {
    "username": "MrCrunchwrap",
    "rating": 1.0,
    "comment": "This theme is so problematic and there’s plenty of better games. Get rid of it if you own it.",
    "timestamp": 1593727200
  },
  {
    "username": "toothygrim",
    "rating": 1.0,
    "comment": "",
    "timestamp": 1591048800
  },
  {
    "username": "egg_timer",
    "rating": 1.0,
    "comment": "Terrible, boring game. Anyone who likes this type of game should be ashamed.",
    "timestamp": 1590098400
  },
  {
    "username": "photoben",
    "rating": 1.0,
    "comment": "Just played for the first (and only time). Whilst the gameplay & mechanics are great, there’s no excuse for the abhorrent use of slaves - laughably named ‘colonists’ - represented by dark brown discs which arrive on ships. This needs a retheme sharp. Until then, best left alone.",
    "timestamp": 1579129200
  },
  {
    "username": "yanawhy",
    "rating": 1.0,
    "comment": "Incredibly racist",
    "timestamp": 1578697200
  },
  {
    "username": "Lampone",
    "rating": 1.0,
    "comment": "One of the most overrated games ever.",
    "timestamp": 1526162400
  },
  {
    "username": "orgor",
    "rating": 1.0,
    "comment": "little strategy, poor end game rules.",
    "timestamp": 1463522400
  },
  {
    "username": "danamark",
    "rating": 1.0,
    "comment": "Sold both copies. Just feels aged.",
    "timestamp": 1461362400
  },
  {
    "username": "clloyd09",
    "rating": 1.0,
    "comment": "Only played this once thus far. Actually hated the game until close to the end. Part of that may have been the quality of instruction (or lack thereof) by the game's owner. Has lots of neat features & mechanics, so I'd definitely give it another try. Not at the top of my must-play list though.",
    "timestamp": 1458428400
  },
  {
    "username": "TheBosZ",
    "rating": 1.0,
    "comment": "Dry. Dull. Not exciting at all. If the first move is *always* the same one, where's the fun? Pales in comparison to other role selection games, especially Race for the Galaxy.",
    "timestamp": 1450134000
  },
  {
    "username": "BlueSapphire",
    "rating": 1.0,
    "comment": "Doesn't work with 2p.",
    "timestamp": 1445637600
  },
  {
    "username": "kaneAAA",
    "rating": 1.0,
    "comment": "This game is more boring than watching paint watch paint dry...... it's dull.....dull.....DULL!!!!!",
    "timestamp": 1402005600
  },
  {
    "username": "matthiske",
    "rating": 1.0,
    "comment": "Ten minutes into this I wanted out to play something else. Racing anyone! When I first came aboard BGG I thought I needed to play this because it was #1 and it should be fun, Not. This really doesn't have a fun factor and is dry as hell.",
    "timestamp": 1400104800
  },
  {
    "username": "Erik T.A.",
    "rating": 1.0,
    "comment": "This game not only defines the term \"tacked on theme,\" the theme it superficially adopts is racist. As a reward for surviving the Middle Passage, the slaves, I mean \"colonists\" get to toil in this gutless, boring eurogame.\n\nTo be clear, I don't object to games covering difficult subject matter, and as a wargamer I have no problem playing as \"the baddies.\" However, Puerto Rico's disingenuously whitewashed depiction of exploitative economic practices is cowardly and embarrassing.\n\nThis game is also unforgivably dull.",
    "timestamp": 1387580400
  },
  {
    "username": "Pro_player",
    "rating": 1.0,
    "comment": "A serious, nerdish game. Naturally, some combos are clearly a lot better than others, so the luck of the draw can be a big factor. Sadly it's another typical euro-trash game with a boring & soulless mechanic. BArey any player interractions which is quite sad for a boardgame when your suppose to interract with the other players, otherwise why are you into boardgame ? lol\n\nThe only interaction is in choosing roles, and if someone picks the one you wanted you'll have to completely re-think your selection. The whole thing is clunky, with a zero excitement level, and after your turn you can go read a book for a few minutes. Oh, yeah -- the game drags on far too long, and I pondered quitting after the first two hours.\n\nMy second and third plays found me constantly thinking \"When will it end, already!?\" It was a complete pain to endure. I hope I never have to play again.",
    "timestamp": 1383346800
  },
  {
    "username": "magicalgamer",
    "rating": 1.0,
    "comment": "Blah. You might be able to tell that I am not a Puerto Rico fanboy.",
    "timestamp": 1349992800
  },
  {
    "username": "davedanger",
    "rating": 1.0,
    "comment": "Horrible learning curve. Incredibly anti-intuitive and badly flowing. UPDATE: played more & won. The most wrongly played game in the world. Suffers from \"who is playing on my right\" syndrome. Stupid 'less choices per turn\" mechanic. Lot's of fiddly bits help make it too long for set-up/teardown. Smoke and mirrors. 15 PAGES of geek rules questions. And these are just the OBJECTIVE criticisms. Just ask for more. It ain't number 1- Haven't seen it played anywhere in several years.",
    "timestamp": 1345500000
  },
  {
    "username": "betatester",
    "rating": 1.0,
    "comment": "So overrated!!!",
    "timestamp": 1328137200
  },
  {
    "username": "boing123",
    "rating": 1.0,
    "comment": "dry and uninteresting game. theme absolutely pasted.",
    "timestamp": 1292194800
  },
  {
    "username": "AnalogGamer",
    "rating": 1.0,
    "comment": "0 player interaction ~ you might as well play Solitaire at your work computer.",
    "timestamp": 1289257200
  },
  {
    "username": "akstevens",
    "rating": 1.0,
    "comment": "Though this is obviously a popular game, I found it tedious to read all the small print on each available building and keep track of the availability of turn actions. While it is a very workable game, it just seemed like that: WORK, counting and evaluating all the commodities and all was just too much for me.",
    "timestamp": 1266793200
  },
  {
    "username": "JoeSteadman",
    "rating": 1.0,
    "comment": "Kinda boring.... Not much action.... What is the big deal with this game? Is it the cool little wood pieces!? I think everyone in our group, even the owner, went through a little anti-climax once we had played it. Sorry, simply over-rated.",
    "timestamp": 1259103600
  },
  {
    "username": "MaxSteiner",
    "rating": 1.0,
    "comment": "I dont like this game, played it a million times, and it was all depressingly similar, now I freaking hate it!  fun while it lasted though",
    "timestamp": 1252706400
  },
  {
    "username": "Patroclus",
    "rating": 1.0,
    "comment": "I've played a few rounds of this game and i did find hte gameplay interesting. I doubt that I will ever play this game again.",
    "timestamp": 1231023600
  },
  {
    "username": "Champion Eternal",
    "rating": 1.1,
    "comment": "Much overrated.",
    "timestamp": 1218924000
  },
  {
    "username": "delgard",
    "rating": 1.0,
    "comment": "A Dull Group Solitaire.",
    "timestamp": 1204066800
  },
  {
    "username": "SYGF",
    "rating": 2.0,
    "comment": "racism",
    "timestamp": 1747173600
  },
  {
    "username": "Entropology",
    "rating": 2.0,
    "comment": "Was fun until we played enough to see optimal play.\nAlso, theme is fairly problematic. Who can work their slaves better, the board game!",
    "timestamp": 1700434800
  },
  {
    "username": "JSMA",
    "rating": 2.0,
    "comment": "Hat uns nicht gefallen",
    "timestamp": 1680991200
  },
  {
    "username": "oldskoolgeek999",
    "rating": 2.0,
    "comment": "Overrated. I have only had bad experiences of playing this. One for the hardcore nerds who out there who seem to play it on auto pilot with pre-programmed moves. I just don't get the hype!",
    "timestamp": 1680904800
  },
  {
    "username": "johnnytruant",
    "rating": 2.0,
    "comment": "The definition of \"Overrate.\"\nThe worst thing about this game is that seating order determines the winner. All the designer had to do was add turn order mechanism (like Power Grid, and countless others...)and this issue would've been solved. As it stands, this game is unplayable, unless you like the winner being decided by who sits next to the worst player.",
    "timestamp": 1669849200
  },
  {
    "username": "agent8261",
    "rating": 2.0,
    "comment": "The theme is problematic.",
    "timestamp": 1625522400
  },
  {
    "username": "W33k5",
    "rating": 2.0,
    "comment": "for a while this game was the go to. There are so many better games that does what it does now without the overt racism.",
    "timestamp": 1611702000
  },
  {
    "username": "sgosaric",
    "rating": 1.5,
    "comment": "2 solo plays. Not sure if I ever want to play it for real. Maybe once. Will see.\n\nIt's a game in logical sequence of murdering fun in eurogames including Goa and Princess of Florence. It's the optimisation masterwork and invented leeching as \"interaction\". More interesting than Goa because there are more options - building one can build, paths one can pursue and there's actually a narrative to this. Actually in this regard it's similar to RFTG, a game I enjoy a lot.\n\nThe minus side (and why I think I'll like PoF better) is that its ultimately calculable. Too much open information, too many clear limitations. Problem with optimisation games is that they give you clear confines and the only space open is to do more within that space and doing more means optimisation, mathiness and general banging of head against the wall. Actually PoF seems to mo a bit more charming and at least offers auctions.\n\nIn short: card games with this system manage to eliminate it's problems (calculability, changing optimisation one can learn for managing risks and dealing with odds) while retaining it's strengths.\n\nEDIT: finally played (and this after quite some time, so I forgot the \"script\"). Impression was pretty tedious and pedestrian. Yay, I need some plays to learn the machine and then I need t optimise it, depending on what others are doing. Can I go watch the grass grow, now, please?",
    "timestamp": 1597615200
  },
  {
    "username": "polm23",
    "rating": 2.0,
    "comment": "Played this once years ago with some people who were used to it, I don't remember much except being confused.\n\nPlayed again on BGA just now. Why would anyone play this? Joyless engine thing.",
    "timestamp": 1588197600
  },
  {
    "username": "chrboesen",
    "rating": 2.0,
    "comment": "Better than some multi-player solitaire. Not as good as Agricola. Played 10 times.",
    "timestamp": 1582758000
  },
  {
    "username": "jp06",
    "rating": 2.0,
    "comment": "boring enough",
    "timestamp": 1578092400
  },
  {
    "username": "YvetteCotton",
    "rating": 2.0,
    "comment": "Dreadful long game, it’s been 7 years and the memory is still vivid",
    "timestamp": 1570831200
  },
  {
    "username": "piotr project",
    "rating": 2.0,
    "comment": "I hate this game. And I mean I hate it.",
    "timestamp": 1555192800
  },
  {
    "username": "Clwe",
    "rating": 2.0,
    "comment": "Changed my mind on this after a few more plays. I loathe games where you're typically forced into picking the one slightly-less awful action than the rest, and this has it in spades. Immensely frustrating. Oh, and the theme sucks and it looks ugly as f**k too, so nyeh!",
    "timestamp": 1540504800
  },
  {
    "username": "gujane",
    "rating": 2.0,
    "comment": "1. open box\n2. punch tiles\n3. read rule\n4. sold\n\n- bad components\n- dull\n- too many small pieces\n- too many small building text tiles\n- hard to set up ( you have to count out victory points for set up ..... why not make the scoring on board or something ....)\n- overrated",
    "timestamp": 1538690400
  },
  {
    "username": "jfrands",
    "rating": 2.0,
    "comment": "Used to Love this game, lost its shine, and the little brown people are problematic",
    "timestamp": 1531864800
  },
  {
    "username": "DeadFrog",
    "rating": 2.0,
    "comment": "Awful, locked in optimized actions, known to everyone",
    "timestamp": 1525471200
  },
  {
    "username": "kenh1967",
    "rating": 2.0,
    "comment": "Have the iOS app.\n\nNot my type of game. Kind of boring.",
    "timestamp": 1510182000
  },
  {
    "username": "Goodsound",
    "rating": 2.0,
    "comment": "Who needs San Juan when there is Puerto Rico? The only downfall is that the building tiles consist of text only (unlike some homemade sets or San Juan which got beautiful graphics). I don't like the \"game ends\" rules which end the game very abruptely when it gets going. Furthermore I consider variable turn order as an important balancing feature (see Caylus, Age of Steam, Agricola), PR is static to the turn order which makes it prone to be abused by experienced players. Sorry that I had to downrate this game continuarly (it started with an 8) and also because it seems that there are two dominant victory strategies (shipping and building). Even more, there are too many unthematic restrictions by the rules. It's hard to understand for me why this average game was for years on top of BGG.",
    "timestamp": 1459634400
  },
  {
    "username": "TheyCallMeZip",
    "rating": 2.0,
    "comment": "One of the worst games I've ever played",
    "timestamp": 1440367200
  },
  {
    "username": "wolfman69",
    "rating": 2.0,
    "comment": "omline play.Den to polu katalaba k oute prokeitai na katsw na to kanw to paixnidi mou fanhke apaisio k hthela na to pabrathsw sth mesh",
    "timestamp": 1389049200
  },
  {
    "username": "wjvite",
    "rating": 2.0,
    "comment": "Meh game with brown pieces representing \"colonists\" (slaves) you assign to plantations.",
    "timestamp": 1360710000
  },
  {
    "username": "Abhoth_",
    "rating": 2.0,
    "comment": "I find this dry, asocial and downright dull. One of few games I'd rather sit out on than play. I know many hold this game in high regard, and I've played it eight times to give it a fair change. But it is clearly not for me. This just doesn't have any of the ingredients I enjoy in a game and I honestly don't see what others like about it.",
    "timestamp": 1358809200
  },
  {
    "username": "DaveD",
    "rating": 2.0,
    "comment": "Although I think I understand why some people should like this,I am a bit nonplussed as to all the lavish praise that seems to be given by others. I played it a few times when it first appeared, but while others could not seemingly get enough of it, it leaves me cold being a chore rather than fun. The only time it gets interesting is seemingly at about the time the game ends, but maybe that's just the anticipation of the imminent end of the torment.\n\nɅV",
    "timestamp": 1345759200
  },
  {
    "username": "cardshark28800",
    "rating": 2.0,
    "comment": "I recognize that this is a great game. I also recognize that I'm no good at it and after every game I feel drain and wiped out, and I don't play games to be wiped out, I play games to refresh myself.",
    "timestamp": 1343772000
  },
  {
    "username": "Chrisrob",
    "rating": 2.0,
    "comment": "I have negative feelings with Puerto Rico. Too many players play it so much that they know all the buildings and then get an advantage over those who play less often. The same knock against CDGs.",
    "timestamp": 1339624800
  },
  {
    "username": "hiub",
    "rating": 2.2,
    "comment": "How well you play is determined by how well you remember all the buildings and their influences. Not a bit of pure thinking.",
    "timestamp": 1328828400
  },
  {
    "username": "Krishna",
    "rating": 2.0,
    "comment": "I confess. I absolutely cannot stand playing this bloody thing, and so I've continued dropping my rating following repeated plays. It is not the theme (I enjoy Goa, Cuba, and other such colonizing/spice trading games). It is not the role selection mechanic (I enjoy Citadels, San Juan, Cuba, and Race for the Galaxy, which also have role selection). It is not the fact that it is a resource management game (most, or at least, many Euros have an RM component). It basically boils down to two things -- do I ever want to play again? No. Could I be talked into it? Maybe *once* more, before declaring that it is a 2, once and for all. (EDIT: I have done so).\n\nThe main thing for me is that you *have* to play with other newbies your first game, or it breaks -- playing with a mixed group in this game, because of the left-right binding issues and how much (over)analysis has been done on it ensures that veterans will argue the whole game over who is being benefited by the newbie, and trying to coerce the newbie into taking moves favorable to them. Also, a game in which you must know what all the buildings do in advance to *enjoy* the game is irritating...",
    "timestamp": 1307224800
  },
  {
    "username": "heya",
    "rating": 2.0,
    "comment": "I've rarely been so bored while playing a game.",
    "timestamp": 1299020400
  },
  {
    "username": "ironvulture",
    "rating": 2.0,
    "comment": "I wasn't that impressed with the game. The strategy seemed really abstract and last time I played someone who didn't even know what they ere doing won. Also, theme is lame. It doesn't even make sense that all players control a parallel universe puerto rico?",
    "timestamp": 1293836400
  },
  {
    "username": "Asmoridin",
    "rating": 2.0,
    "comment": "It's okay. It's probably more enjoyable with people that don't game as much, just so people don't always 'optimal' moves. More interesting.",
    "timestamp": 1291849200
  },
  {
    "username": "mikeywalsh",
    "rating": 2.0,
    "comment": "Without a player-order mechanic, this game is broken with any group that has unevenly-skilled players. Bleh. I have no idea how this game is so highly rated, none.",
    "timestamp": 1279404000
  },
  {
    "username": "yendi57",
    "rating": 2.0,
    "comment": "played 4 times........annoying is the nicest thing I can come up with. Only way I play this again is if a table of swimsuit models asks me to join them.",
    "timestamp": 1273874400
  },
  {
    "username": "joedogboy",
    "rating": 2.0,
    "comment": "While this was one of the first \"Euros\" that I played when I started seriously boardgaming a few years ago, I hadn't played it in some time.\nI had to lower my rating, as I was not quite as impressed by some of the aspects of the game that had been new and intriguing when I had not played many modern boardgames.\nAfter playing Thurn & Taxis, I saw a much better use of roles (and one that didn't allow for the same crippling of people who went later in a turn), and had to lower PR's score. After playing Endeavor, I can honestly say that I have no desire to play PR again, so PR's score went down again.\n\nWe need a \"Hall of Fame\" for landmark games like this whose time has passed.",
    "timestamp": 1262646000
  },
  {
    "username": "jollyrogergames",
    "rating": 2.0,
    "comment": "I see why many like it, but it is too fiddly for my preferences--in ways that drive me nuts. I tried it a second time (in case it was who I played with) and disliked it even more. I much prefer San Juan--which got rid of most of the wonky things I didn't like.",
    "timestamp": 1261177200
  },
  {
    "username": "miggor",
    "rating": 2.0,
    "comment": "I guess it deserves respect in the same way your Gran does. But then, you still wouldn't pick your Gran for your basketball team would you?\n\nI'd rather play Galactic Emperor.",
    "timestamp": 1260658800
  },
  {
    "username": "K-Swift",
    "rating": 2.0,
    "comment": "Oh what fun, a spreadsheet in board game format. What's even better is that it's a board game the totally exploits plantations and slave labor, you just gotta love that! It's amazing all the 10s this game has received. Those raters must have such dull lives that this boring mess excites them and that they find it acceptable to turn a blind eye to such acts as slavery, or maybe they just find it acceptable...\n\nWORST. GAME. EVER.",
    "timestamp": 1237590000
  },
  {
    "username": "dkearns",
    "rating": 2.0,
    "comment": "Odd game where your options narrow as the game proceeds. As your board develops it becomes completely unreasonable to choose certain roles, sometimes to the point where you're only ever choosing one of two. Is the shipping aspect of the game a red herring? Should have been called: \"Just Buy Buildings\". UPDATE: third play still do not enjoy. BAD MEMORIES DOWNGRADE. Why would I ever play this again when I could be playing RfTG? No idea. DOWNGRADE.",
    "timestamp": 1235862000
  },
  {
    "username": "ldflan",
    "rating": 2.0,
    "comment": "Tedious, stupid game that amounts to a simple algorithm. Once you get that, the game is completely predictable from the first few turns, maybe the first one. And why can't these designers acknowledge the awful reality that was Puerto Rico by naming the playing pieces for what they really represent? \"Colonists,\" my butt. The dark counters represent slaves.",
    "timestamp": 1231196400
  },
  {
    "username": "clearclaw",
    "rating": 2.0,
    "comment": "No thanks. Not interested. I won't make the mistake of playing it again. I do not like economic snowball games. This is not to say it is a bad game, just that it is a game which specialises in things I don't like and am not interested in. This is a game that is clearly a member of the \"I'd rather go home alone in the dark than play this game again\" set. The very strong right/left binding does nothing but ensure this game is strenuously avoided.\n\nThe economic snowball aspects are accompanied by so little non-mechanical player interaction that any chance of being interesting are forever lost. The fact that the game tends to break when played by players of unequal skill and relies heavily on the right/left mechanics (keep the player on your left down/from winning) pretty much seals its fate for me.",
    "timestamp": 1220565600
  },
  {
    "username": "Gearhead",
    "rating": 2.0,
    "comment": "Based on 3 plays. Found it dry and limiting. Bits were nice but nothing special. Not much tension or excitement. I don't know how bad things need to be in order for me to try this one again.\n\nHaving played this again, I've revised my rating. You'd have to have a gun to my head or the head of a loved one to get me to play this again.",
    "timestamp": 1219615200
  },
  {
    "username": "wiart",
    "rating": 2.0,
    "comment": "After Settlers of Catan, I've been very much disappointed by Puerto Rico.\nNo trading between players, no common terrain on which to build settlements.\nIt is just a collection of tiles and the strategical aspect is much less interesting than for Settlers of Catan...",
    "timestamp": 1185314400
  },
  {
    "username": "Cardinal Fang",
    "rating": 2.0,
    "comment": "Played it a few times and never care to again. Just plain boring. The game just doesn't engage me at all. I couldn't have cared less about what was happening, I just wanted the game to end.",
    "timestamp": 1148335200
  },
  {
    "username": "daimyo",
    "rating": 2.0,
    "comment": "The game that I hated. Yea, yea, people claim that its pure genius because of the multi-tiered victory conditions etc etc etc. But I think is more likely multi-tiered manipulation of the experience players over the newer ones.",
    "timestamp": 1140994800
  },
  {
    "username": "Nodens",
    "rating": 3.0,
    "comment": "Back in 2002 everyone in our group saw what this was going to do for boardgaming. I wasn't on board.",
    "timestamp": 1756764000
  },
  {
    "username": "Vinceno32",
    "rating": 3.0,
    "comment": "Its just not fun. I don't understand how it got to it's level of popularity. We played a three player game and the winner got a To large tobacco, Corn, harbor, warf combo early and ran away with the game - it was impossible to stop and led to a 30 point difference in victory points because they prevented others from scoring points with shipment placement while having a a way out with their warf.\n\nBroken strategies and toxic. I'm only keeping my copy for the sentimental value of it belonging to my mentor.",
    "timestamp": 1755122400
  },
  {
    "username": "jlingwal",
    "rating": 3.0,
    "comment": "Not for me.",
    "timestamp": 1748037600
  },
  {
    "username": "Bagherra",
    "rating": 3.0,
    "comment": "Set up is tedious as is clean up.\nThe game is very delightful to play with people of the same skill level but if you are not evenly matched with the other players the game starts to feel too scripted and feels like you are a puppet in a game.\n\nThis \"puppet\" aspect of the game soured it for me pretty badly.",
    "timestamp": 1742857200
  },
  {
    "username": "joseph777",
    "rating": 3.0,
    "comment": "Great game. Have played this since it first came out. Newcomers need to play a couple of times before they understand what's going on. The expansion is great too.\n\nNov 23 - Oh dear. I'm over it. Too much watching other players race to get Harbour or Wharf every time. Too much someone going Captain before you and watching your hard-earned get dumped without scoring. Became boring all of a sudden. Good in its day but other games do it better now.",
    "timestamp": 1736031600
  },
  {
    "username": "BoardGamingCouple",
    "rating": 3.0,
    "comment": "3/5\n\nPuerto Rico is a great game. The theme and artwork are not great. the components are generally not great either. This game does have constant player interaction though. It is a really enjoyable game, but does suffer from a winning memorized strategy without the expansions.\n\nthe expansion really sets this game apart because it breaks the memorized pattern of winning. The newer versions include the expansion.",
    "timestamp": 1735254000
  },
  {
    "username": "MachineEpsilon",
    "rating": 3.0,
    "comment": "Town building, shared worker placement",
    "timestamp": 1718316000
  },
  {
    "username": "Desigual",
    "rating": 3.0,
    "comment": "Scripted",
    "timestamp": 1712700000
  },
  {
    "username": "Tree11",
    "rating": 3.0,
    "comment": "Typical euro with some interesting mechanics. Small text and small pieces so its difficult to read the board. If you do enjoy euros you'll probably enjoy this game. The theme isn't too strong as some things that happen make no sense at all.\n\nI dislike these types of games because unless you're able to study and fully understand the entire game you have no chance at competing with others. While learning the game you'll ruin it for everyone else by setting up players with advantages because you didn't take the appropriate move. Might as well play it solo as there is really no player interaction.",
    "timestamp": 1703113200
  },
  {
    "username": "PopeBear",
    "rating": 3.0,
    "comment": "Although the game itself is good, I cannot rate it well since I will never play it again. The theme and setting are problematic and not addressed with any kind of tact or sensitivity. Playing as colonizers can be done well, as evidenced by John Company, but this game in particular essentially glorifies one of the worst evils in history. Board games need to do better.",
    "timestamp": 1701385200
  },
  {
    "username": "kora",
    "rating": 3.0,
    "comment": "This game is (unwittingly? deliberately?) normalising & endorsing colonialism and slave labour on plantations. (Look up the history of growing indigo, for instance.) Once you see it, you can't unsee it, and it destroyed the game for me.",
    "timestamp": 1697925600
  },
  {
    "username": "dixatron",
    "rating": 3.0,
    "comment": "Highly problematic; colonist theme is offensive and not-so-veiled slavery as primary mechanism in game mechanics",
    "timestamp": 1683064800
  },
  {
    "username": "HackFin",
    "rating": 3.0,
    "comment": "The grandfather of dry euros. A beige calculator dream with a very good action selection mechanism. Quite a revolution for board game mechanisms from what I can tell in my limited knowledge. And now rest in peace old colonial romanticist.",
    "timestamp": 1681509600
  },
  {
    "username": "The Deliberate",
    "rating": 3.0,
    "comment": "Action system creates a quick and unique flow that keeps everyone busy and engaged. The colonizer theme has kept any of us from wanting to actually play it though. It also has atrocious graphic design. Excited for the new version that has been re-themed to a more accurate and uplifting historical period of the island.",
    "timestamp": 1678143600
  },
  {
    "username": "sashiuma",
    "rating": 3.3,
    "comment": "3.27",
    "timestamp": 1669762800
  },
  {
    "username": "harnas1207",
    "rating": 3.0,
    "comment": "2020-ben már rendkívül béna és csúnya klasszikus euro.",
    "timestamp": 1665784800
  },
  {
    "username": "hiimeroro",
    "rating": 3.0,
    "comment": "号称十分十分竞技性的桌游，感觉就像是在玩浩瀚的文明一样。可是我觉得由于变数太多，累加到一起，反倒变得结局是定数了。由于竞技性太强了，缺乏了桌游应有的乐趣和赌博赢了的心理快感。上手也比较难，适合骨灰玩家吧。娱乐性：1 难度：10",
    "timestamp": 1656540000
  },
  {
    "username": "thebogdan",
    "rating": 3.0,
    "comment": "I'm very meh on this game. OK if I never play it again.",
    "timestamp": 1656194400
  },
  {
    "username": "LunaWolvesMan",
    "rating": 3.0,
    "comment": "It's a classic, and I've enjoyed a few games of it, but anymore it's feeling very tiring to pull this down and play it. There are just more engaging games, whether you're looking for more fun, or more economy, this just doesn't seem to generate interest anymore.",
    "timestamp": 1655330400
  },
  {
    "username": "klebinaldo",
    "rating": 3.0,
    "comment": "corra. A sua primeira experiencia será horrivel. depois quando vc achar que aprendeu, na verdade torna-se menos interessante.",
    "timestamp": 1650751200
  },
  {
    "username": "z25648911",
    "rating": 3.0,
    "comment": "太老舊",
    "timestamp": 1644188400
  },
  {
    "username": "Fizberry",
    "rating": 3.0,
    "comment": "iOS",
    "timestamp": 1644015600
  },
  {
    "username": "raged_norm",
    "rating": 3.0,
    "comment": "Would rather play games with a little more randomness",
    "timestamp": 1643238000
  },
  {
    "username": "Greenflash21",
    "rating": 3.0,
    "comment": "Opened the box, saw way to many pieces and sold the game",
    "timestamp": 1640559600
  },
  {
    "username": "ShakaUVM",
    "rating": 3.0,
    "comment": "Genre defining Euro game, but very boring due to how samey it is",
    "timestamp": 1640559600
  },
  {
    "username": "DisasterAiR",
    "rating": 3.0,
    "comment": "Bland art and graphic design. Dry (and questionable) theme. Seat position advantage (playing this game with uneven skill players makes it more apparent). If you're in later position, you don't have much choice of choosing your own action and kind of follow along with earlier player.",
    "timestamp": 1635544800
  },
  {
    "username": "andrebr",
    "rating": 3.0,
    "comment": "-WEG\n90–150 Min 3-5 Players p3 p4 p5 Weight: 3.28 / 5",
    "timestamp": 1632002400
  },
  {
    "username": "Fleecer",
    "rating": 3.0,
    "comment": "This one shows its age. I didn't find it enjoyable at all. Too many damned if I do damned if I don't decisions. Some folks might like that, but I think games need a balance of plan making/execution and agonizing analysis, and this doesn't fit the bill.\n\nThere were no real \"oh that's neat\" moments for me either, which often come up as I explore a new game's system, and are necessary for me to rate a game well. Back in its heyday I'm sure it was novel and unique, but now it strikes me as more of a trasitional fossil. Most importantly, I'm afraid that the answer to \"do I want to play Puerto Rico again?\" is a resounding \"No\".",
    "timestamp": 1631484000
  },
  {
    "username": "ferakiii",
    "rating": 3.0,
    "comment": "I love engine builders but this game is just so frustrating, when you are finally about to be able to use the awesome late game buildings, the game ends. The pacing on this game is so bad, but took me a few plays to figure that out.",
    "timestamp": 1628892000
  },
  {
    "username": "MightMatt15",
    "rating": 3.0,
    "comment": "Mediocre game but the colonialist theme really makes this game outdated and not worth playing or buying. It also uses little brown discs as people and uses them as resources. It completely dehumanizes the people those discs represent.",
    "timestamp": 1626991200
  },
  {
    "username": "vegasstar",
    "rating": 3.0,
    "comment": "Overhyped.",
    "timestamp": 1615417200
  },
  {
    "username": "thptr",
    "rating": 3.0,
    "comment": "ok euro game, maybe too long?\ndisliked the theme.",
    "timestamp": 1612047600
  },
  {
    "username": "calvinballl",
    "rating": 3.0,
    "comment": "Everybody starts somewhere, this was the beginning for me. (Excluding Axis and Allies)",
    "timestamp": 1600466400
  },
  {
    "username": "FlinkesAlien",
    "rating": 3.0,
    "comment": "# You can loose the game in the 1st round, that's a no-go for me!",
    "timestamp": 1599343200
  },
  {
    "username": "korossyl",
    "rating": 3.0,
    "comment": "Almost unbelievably dry, lacking in any thematic interest at all. Gameplay is formulaic -- almost a parody of the \"boring Euro.\"",
    "timestamp": 1592776800
  },
  {
    "username": "zwalex",
    "rating": 3.0,
    "comment": "this is overrated, imho.",
    "timestamp": 1591480800
  },
  {
    "username": "rubiks777",
    "rating": 3.0,
    "comment": "Played on TTS. Maybe better with physical copy or after a few plays to have a better strategy.",
    "timestamp": 1591135200
  },
  {
    "username": "peakhope",
    "rating": 3.0,
    "comment": "What I like:\n- Interesting without being too heavy\n- Multiple strategies, apparently\n- Reasonable length (75-90 minutes with 4p)\n\nWhat I don't like:\n- Feels like a needlessly-bloated San Juan\n- Too many ways to get unintentionally screwed\n- Can feel like a game of \"chicken\" because your best move can set someone else up for better\n- If you really think about it, it's really clear that the colonists are slaves\n\nWhere SJ is all about leaching, PR almost feels like it is all about preventing successful leaching. I don't like either approach, but dislike the SJ way less. SJ feels like a far more refined design. PR 2p variant sounds awkward.\n\nIt's a classic, and I can see why it was popular when it came out. Like Settlers (but less so), it no longer stands out as a top-notch game. The 3.3 weight seems reasonable--probably 3.0 rules complexity and 3.5 depth.\n\nRating dropped from 6 to 5 after a second play. Could drop further.",
    "timestamp": 1588456800
  },
  {
    "username": "chrisjwmartin",
    "rating": 3.0,
    "comment": "One of the most boring games I've ever played. After an hour or so of sitting watching your slaves work your indigo plants, you may be tempted to free them all just so you can stop playing.",
    "timestamp": 1588024800
  },
  {
    "username": "MrSomeGuy",
    "rating": 3.0,
    "comment": "It's only okay. If you play games so that way you can get good at them to be competitive, then you will enjoy this game, but you may like chess better.\n\nHowever, if you want to play games to have fun, then try its card game version San Juan.",
    "timestamp": 1583449200
  },
  {
    "username": "rizzou",
    "rating": 3.0,
    "comment": "Im going to lower the rating again. After playing with a couple people that were more experienced, I realized how restrictive the game ends up being towards the later half. That makes it kind of annoying and more of a chore to play than actually enjoyable.",
    "timestamp": 1583103600
  },
  {
    "username": "jkgrence",
    "rating": 3.0,
    "comment": "One of the great games of the new millennium. The theming of the game is a shame in multiple senses of the word, to the point I'm not comfortable playing it anymore. A game about playing Antebellum Southern plantation owners would be tacky and culturally insensitive; there's no reason to see the Spanish Colonial theme of Puerto Rico any other way.",
    "timestamp": 1571954400
  },
  {
    "username": "xvatat",
    "rating": 3.0,
    "comment": "Ugly production and ugly feel of play. The action sharing mechanic thankfully was transferred to other games and used much, much better",
    "timestamp": 1560895200
  },
  {
    "username": "blindside14",
    "rating": 3.0,
    "comment": "This game can be very brutal to newer players. I played this twice and I didn't feel I lost to the other players yet to the game itself. There are some very wonderful mechanisms that had been put into other games such as following an action. The last game I played I just felt like every option after a few turns werent great for me and after dealing with that happening for 90 minutes or so I just never want to play the game again. This game was probably a fantastic 10+ years ago but not compared with newer stuff. Rated 3 stars instead of 2 because of the following mechanism which was probably the only thing I loved about the game.",
    "timestamp": 1556229600
  },
  {
    "username": "wiim",
    "rating": 4.0,
    "comment": "Very basic worker placement. Might have been great for it's time but would much rather play ANY of the modern worker placement games.",
    "timestamp": 1749592800
  },
  {
    "username": "Rudger",
    "rating": 4.0,
    "comment": "Feels boring and misses some excitement, for me.",
    "timestamp": 1740956400
  },
  {
    "username": "Mehhfln",
    "rating": 4.0,
    "comment": "Your position pretty much entirely depends on the actions of other players, often you can just be softlocked by the actions they do and having a miserable experience, players 1 and 4 in a 5 player game have a massive advantage",
    "timestamp": 1733958000
  },
  {
    "username": "to_mars",
    "rating": 4.0,
    "comment": "Lowering to a 5 from a 7. Kind of lost its luster after several plays as there's only so many strategies. It's a perfect game for getting someone off of Catan or Ticket to Ride and is still pretty interesting, but it begins to feel like playing the same game after a dozen or so plays.\n\nAt some point I started feeling like I solved the game, which became a huge deterrent for wanting to play.\n\nAlso, you own literal slaves in this game, and owning the best plantation just makes me feel a bit uncomfortable. The game tells you their colonists, but without much more context or justification, it feels more like an admission than clarification.",
    "timestamp": 1731625200
  },
  {
    "username": "TrevorJr26",
    "rating": 4.0,
    "comment": "See my review for 1897, the game is good but I would not play this version.",
    "timestamp": 1731452400
  },
  {
    "username": "levimote",
    "rating": 4.0,
    "comment": "Looking for the 10th anniversary edition or a newer collected edition.",
    "timestamp": 1723586400
  },
  {
    "username": "armed-medic",
    "rating": 4.0,
    "comment": "The first Euro games I bought were PR and TTR. Didn't get into PR and then played it at the WBC and had a jerk at the table. I have not touched it since.",
    "timestamp": 1720216800
  },
  {
    "username": "buderix80",
    "rating": 4.0,
    "comment": "Enjoyed the flow and the atmosphere playing this one.",
    "timestamp": 1716156000
  },
  {
    "username": "braisgg3",
    "rating": 4.0,
    "comment": "I prefer boonlake or carnegie. Very similar.",
    "timestamp": 1714168800
  },
  {
    "username": "Kodeir",
    "rating": 4.0,
    "comment": "Has severe turn order issues, which give away games when playing with newbies, and dictate an obvious course of action when playing with veterans. Plus, snowball economies. Somehow, I still manage to find the whole thing tolerable, so it must be doing something right. I just don't care enough to figure out what exactly that is. Can be persuaded to play if asked.\n\nRating: \nOptimal number of players:\n4~5\n2~3\n\nFor more information on how I rate games, go to my profile",
    "timestamp": 1709334000
  },
  {
    "username": "patty3123",
    "rating": 4.0,
    "comment": "Punishing, scripted and with a very uncomfortable theme. Zero randomness, zero excitement.",
    "timestamp": 1706569200
  },
  {
    "username": "Nickeddy01",
    "rating": 4.0,
    "comment": "Not sure how this stayed No.1 for so long. Its good. But there are so many better alternatives. Le Havre, Agricola, Caverna, etc.",
    "timestamp": 1705791600
  },
  {
    "username": "HiveGod",
    "rating": 4.0,
    "comment": "My favorite part is the end of the game when the pirates show up and burn everything down.\n\n \n\nPS. They're colonists, dammit, colonists! Quit looking at Wikipedia! History ruins everything!\n\nPURGED when I realized \"Plantation Simulator\" isn't good clean fun for everyone.",
    "timestamp": 1705186800
  },
  {
    "username": "sarahrob",
    "rating": 4.0,
    "comment": "plays well - distasteful theme",
    "timestamp": 1702076400
  },
  {
    "username": "duodora",
    "rating": 3.5,
    "comment": "This is a game that I really enjoyed \"back in the day,\" but I've learned in the interim that I really prefer a balance between strategy and tactics. Some of these older games - where you can plan out most of your turns in advance - are no longer games that I particularly enjoy. I am glad they are making a re-make with a better/less problematic theme though.",
    "timestamp": 1694556000
  },
  {
    "username": "casualcasual",
    "rating": 4.0,
    "comment": "Look. When I play it I don't mind it. The selection stuff is good, really; everyone gets something; is that good or bad; etc. But.... when I'm not playing it I have no desire too, and that's without the issues that go along with it. For me this was some early exposure to the resource to VP conversion euro chain thing, and that is far from interesting to me.\n\nFurther ruminations\nhttps://boardgamegeek.com/geeklist/256225/item/6927268#item6...\n\n\nAlso, can't help be reminded of the slavery thing. And it's not so much the slavery thing - which I can almost understand how it was missed, if I'm being charitable; it's kind of representative of the whole issue. No. It's the knots I've seen people twist themselves into to try and make it okay. Urgh. Not interested any more.",
    "timestamp": 1677452400
  },
  {
    "username": "hwr131819",
    "rating": 4.0,
    "comment": "Good game, but I would choose to play other Euro before this one.",
    "timestamp": 1677193200
  },
  {
    "username": "george_carlin",
    "rating": 4.0,
    "comment": "3-4 joueurs",
    "timestamp": 1669762800
  },
  {
    "username": "Kenfeldman",
    "rating": 4.0,
    "comment": "Update April 2014. I haven't played this in a while and I think it would be tough to play again due to having to relearn how to play well. Good game, but too difficult to play well with people who don't play it frequently.\n\nUpdated September 2008 after a few more plays. This game is great once you get over the learning curve. Each action is important, and you must develop the ability to see how your actions will impact the other players. Once you do that, the game opens up and you can see why it's one of the top board games.\n\nEasy rules, tough strategy. Great multi-player game. It can be frustrating though if you're the least experienced player in a game where everyone else is very experienced. There's a tough learning curve for the strategies and in determining how you're moves will impact the other players.",
    "timestamp": 1668985200
  },
  {
    "username": "djsanborne",
    "rating": 4.0,
    "comment": "It's a great game, but it's like checkers to me. The right move in any given situation is usually readily apparent and if you're playing with people who aren't seasoned board gamers then it's way too easy to win.",
    "timestamp": 1667775600
  },
  {
    "username": "malloc",
    "rating": 4.0,
    "comment": "I once considered this a good game, but as time progressed and I played this more and more it started to wear thin. I can understand the uniqueness of this game when it was new and as long as everyone playing is at about the same level it can be pretty good, if a little scripted. However, It is so much the same each time and so predictable I have little desire to play it. The game is usually won by the player who gains the biggest advantage either through seating advantage or through poor play of another player. There is little control other than you running the engine as best as possible. For me the fun in this was gone once I understood the game enough to know how that engine ran. Now it is a boring game of over analysis that in my group turn into hours of needless bickering of how someone could have played better.\nNever does this game come down to masterful play by the winner.\n\nTo play this with a person who is new or not at your level is a complete waste of time. (I would rate it a 2 in that situation)\n\nPlayed again for the first time in about 18 months (June 08) and man I can say that little desire has turned into no desire to play. Do not believe the hype on this game folks, it really is an exercise in understanding the scoring engine and making tactical moves to maximize your point and minimize others points each turn. If you like to figure out your score and then do some light math to figure out what other will score when taking each card then you probably will like this game. I for one find that rather boring. Never does this game create a memorable experience, in fact it is more fun to play this thing via the PR evolver spreadsheet than it is in a face to face game. I have play tons of this game and I can't remember the details of any of them. Compare that to something like Ti3 where I can tell you who won each game and how they did it. This game being ranked no 1 here is a classic example of groupthink combined with people not updating their ratings. PR is stale, its old and it really isn't as good as you remember it. There are a few set strategies that win all the time, the programmed machine nature of this game make it so that the game engine just runs itself and there is little you can do to stop anyone not directly to your left. Once the fun of learning the engine fades then this thing is a boring exercise in score keeping.",
    "timestamp": 1667430000
  },
  {
    "username": "Rockpaper",
    "rating": 4.0,
    "comment": "Lack of (strong) 2-player support hurts the game, which otherwise has some quite clever mechanisms.",
    "timestamp": 1664229600
  },
  {
    "username": "Razcar",
    "rating": 4.0,
    "comment": "08/02/2022: So glad games have evolved since 2002. I'd rather play San Juan over this game.",
    "timestamp": 1659391200
  },
  {
    "username": "Forgeforgeforge",
    "rating": 4.0,
    "comment": "This was a fun learning game as a child but as soon as the wider community learned the game well enough to have the corn vs indigo debate it really fell apart as being worth the effort.",
    "timestamp": 1655935200
  },
  {
    "username": "koalaguy4566",
    "rating": 4.0,
    "comment": "Brilliant game with a horribly offensive and dated theme. Played it once and then sold it.",
    "timestamp": 1649282400
  },
  {
    "username": "Kreha6",
    "rating": 4.0,
    "comment": "Rating based only on 2-player games. Gameplay just wasn't engaging enough to even finish the game. Sold",
    "timestamp": 1648504800
  },
  {
    "username": "Olafslomp",
    "rating": 4.0,
    "comment": "Owned by Jeroen, I have it only on iPad",
    "timestamp": 1645657200
  },
  {
    "username": "Pippishortstocking",
    "rating": 4.0,
    "comment": "I know its popular, but none of us really liked it. The layout, artwork etc had limited appeal & other resource games play better",
    "timestamp": 1641510000
  },
  {
    "username": "WithLove",
    "rating": 4.0,
    "comment": "It's a good game, but the LR binding is so strong that you only want to play with a table of nearly equally skilled players. My old Puerto Rico group now lives in four states, and I have no interest in ever playing this game again, to be honest.\n\nAlso the brown \"colonists\" still bother me.",
    "timestamp": 1631138400
  },
  {
    "username": "rddks",
    "rating": 4.0,
    "comment": "What could have been an amazing game but with two fatal flaws:\n\n1. Your performance is too dependent on who's sitting next to you in player order instead of your own decisions\n\n2. The theme--I normally think it's crazy to let theme detract from enjoyment of an otherwise fine game, but having to roleplay as a slaveowner (and not just any slaveowner, but a Caribbean plantation owner!) is pushing things way too far.\n\nRace for the Galaxy is a great fixed version if you want an engine builder with this type of role-selection.",
    "timestamp": 1629151200
  },
  {
    "username": "PolarDad",
    "rating": 4.0,
    "comment": "OkieCon 2021, The game itself is much better. I'd probably rate it around a 7.5 or so. I really struggled internally with the slave boats and placing slaves to work on my plantations. Made me uncomfortable. Probably wouldn't play it again. Too bad.",
    "timestamp": 1625522400
  },
  {
    "username": "dingo154",
    "rating": 4.0,
    "comment": "Obviously need more plays to fully understand but the community playing it doesn't exactly have me wanting to rush back to play it more",
    "timestamp": 1624572000
  },
  {
    "username": "TheLimestoneCowboy",
    "rating": 4.0,
    "comment": "*D",
    "timestamp": 1620252000
  },
  {
    "username": "Jamesmcm84",
    "rating": 4.0,
    "comment": "Replaced by other games. Didn't like the graphics. Not much variety.",
    "timestamp": 1618437600
  },
  {
    "username": "ryansmum2008",
    "rating": 4.0,
    "comment": "Not for Me",
    "timestamp": 1618351200
  },
  {
    "username": "Tigerherz",
    "rating": 4.0,
    "comment": "heavy Euro, not my cup of tea\n2x dt",
    "timestamp": 1616281200
  },
  {
    "username": "John Rogers",
    "rating": 4.0,
    "comment": "This, not Settlers or Ticket to Ride, was my first foray into modern gaming. I played it a ton early on before finally getting burned out sometime late in 2006. While I have fond memories of my time with Puerto Rico I have no real desire to play it again.\n\nWIFE RATING/Comments - 7\nMy very first euro.\n\nUPDATE:\n\nIn recent years I have grown tired of economic snowball games, of the mechanical interaction and resource maximization that are hallmarks of them. Puerto Rico is the progenitor of these Euros and while I'd never call into question its design, I am no longer interested in it.\n\nUPDATE: 11.7.10\n\nMy wife finally won a game of PR beating me in a 2 player session 80-56.\n\nTraded for Die Macher and Primordial Soup.",
    "timestamp": 1614639600
  },
  {
    "username": "heartpiece013",
    "rating": 4.0,
    "comment": "It's a classic, but it also feels like it was made in 2002. YMMV.",
    "timestamp": 1606604400
  },
  {
    "username": "iquito",
    "rating": 4.0,
    "comment": "The game is definitely elegant and interesting, but especially when you know the game well you feel like it is playing you, not really you playing the game, as there is usually one optimal action to take. You can of course do something else, but you will just fall behind, and if everybody plays optimally you can basically predict what everybody will be doing.\n\nThat takes a lot of tension out of the game and makes it much less exciting for me. It can also be frustrating, because you feel like you couldn't even have done anything any better, even if you lose - I at least want it to be my fault if I lose ;-)\n\nI much prefer a game of Brass for a game about economy, or a game like Great Western Trail for just having many possibilities. Puerto Rico doesn't even feel very interactive.",
    "timestamp": 1606258800
  },
  {
    "username": "djsolie",
    "rating": 4.0,
    "comment": "I've played this only once a few months after it came out in English. I unfortunately played with people who had played multiple times, and I just got trampled while I was just attempting to understand the game.",
    "timestamp": 1605740400
  },
  {
    "username": "Pasozyt44",
    "rating": 4.0,
    "comment": "na 2 osoby - 4",
    "timestamp": 1603753200
  },
  {
    "username": "HairyPotter",
    "rating": 4.0,
    "comment": "game with many paths to victory, but just too boring and unappealing, and the theme seems pasted on. A game that was loathed shortly after commencing the first game.",
    "timestamp": 1602885600
  },
  {
    "username": "rabbito84",
    "rating": 4.0,
    "comment": "My definition of no fun! I know it's old, but no visual appeal and just feels like I'm 'doing this to do that'",
    "timestamp": 1602021600
  },
  {
    "username": "SrFinn",
    "rating": 4.0,
    "comment": "played twice (early times)",
    "timestamp": 1595541600
  },
  {
    "username": "Sarrel",
    "rating": 5.0,
    "comment": "Repetetive game. Playable but hard to enjoy",
    "timestamp": 1761084000
  },
  {
    "username": "markus_ecliptic",
    "rating": 5.0,
    "comment": "Have played a few games so far, enjoyed it. There seem to be quite a few paths to victory",
    "timestamp": 1749592800
  },
  {
    "username": "xoflram",
    "rating": 5.0,
    "comment": "It felt like several of the the building tiles were higher power than the others. In 2 players it felt like a race for the one tile every single game.",
    "timestamp": 1745359200
  },
  {
    "username": "opks22",
    "rating": 5.0,
    "comment": "iOS version",
    "timestamp": 1744063200
  },
  {
    "username": "gram_niebieskim",
    "rating": 5.0,
    "comment": "My BGG:\n10 - excellent game, always have a great time\n7 - enjoyable game, I'm willing to play again\n5 - not bad but it's not my cup of tea\n2 - won't play ever again",
    "timestamp": 1743717600
  },
  {
    "username": "DanKill",
    "rating": 5.0,
    "comment": "Hasn't hit the table in a long time, would love to play again.",
    "timestamp": 1742770800
  },
  {
    "username": "rauschpotato",
    "rating": 5.0,
    "comment": "Several plays, 4-5p:\nThis is a well-designed game that I can't grasp how to play well, and I don't enjoy the journey. If you know what you're doing, you will destroy inexperienced players. If you're new to the game, you will feel like you're drowning for two hours. I've played a bunch, and I still don't know what I should be doing. The game is very tight, so you don't have much room to explore the space.\n\nI call this game a Kabuki, where there is often a 'correct move' and you will be punished if you don't execute it. Sometimes that move is taking $1, because all the interesting actions will help other players more. Thrilling!\n\nOverall, this game has been replaced by Race for the Galaxy, one of my absolute favorites for distilling Puerto Rico to a faster and crunchier version, which still allows for big comebacks. Otherwise, I would rather play Brass for a large, meaty economic board game.",
    "timestamp": 1741215600
  },
  {
    "username": "Bal_505",
    "rating": 5.0,
    "comment": "what is there to say. It's classic for a reason, and they've also tried updating the troubling setting several times for a reason",
    "timestamp": 1741042800
  },
  {
    "username": "mycael",
    "rating": 5.0,
    "comment": "I definitely don't understand the excitement around this game. The mechanics have no physical or economic reality and therefore no immersion. The game seems to me more chaotic unless you know precisely what is going on in the minds of the opponents. Our only chance of winning is to derail the strategy of others and therefore, we cannot have a strategy. And finally, it's ugly, even the reissues! In short, a 2002 game that should have stayed in 2002!",
    "timestamp": 1740438000
  },
  {
    "username": "tectactoe",
    "rating": 5.0,
    "comment": "This game does have a massive problem with skill disparity, more so than others, mainly in the sense that if you have one new(er) player going against a table of veterans, the player sitting to the immediate left of the newbie will have a distinct and oftentimes insurmountable advantage over the other players. Why? Well, one of the main mechanics of PUERTO RICO is not merely choosing actions that benefit you the most, but choosing actions that benefit your opponents the \\least\\, often specifically the person sitting to your left since they will be acting directly after you (thus you, as a player, have the most agency and control over their next action than anyone else's). In other words, it's as much a game about \"blocking\" as it is about \"acting,\" an important distinction that newer players don't always grasp right away. Having said that, if you ARE able to get a table of 4 or 5 players with a good (or at least relatively similar) understanding of the game, it's an absolute worm-burner, a bloodbath, and a remarkably tense/enjoyable time. I do recommend drafting your buildings when playing. It takes a little longer, of course, but it gives players even more control over how they want this specific game to play out.",
    "timestamp": 1734649200
  },
  {
    "username": "R106",
    "rating": 5.0,
    "comment": "Just a worse game than New Frontiers to me.",
    "timestamp": 1734390000
  },
  {
    "username": "misskitten",
    "rating": 5.0,
    "comment": "Early in the hobby I considered getting this game, but after playing it some more at my gaming group, I'm glad I didn't do it. It gets pretty scripted, and I kinda prefer playing a game than being played by a game.",
    "timestamp": 1734044400
  },
  {
    "username": "Third_Era",
    "rating": 5.0,
    "comment": "",
    "timestamp": 1733094000
  },
  {
    "username": "PCasafont",
    "rating": 5.2,
    "comment": "A good classic. The beginning is a bit dragging, but there is a lot of tension in the mid-late game. The total lack of randomness hints me that once you master it, each game will tend to feel the same.",
    "timestamp": 1732921200
  },
  {
    "username": "ciggie",
    "rating": 5.0,
    "comment": "Solid game that uses the follow mechanism that I enjoy in a number of other games. Problem is I played this after all of those and for the most part those games are shorter and more interesting to me. Puerto Rico dragged for me and I was wanting it to be over, which is never a good sign. The fact that I need a plantation, building, and colonists simply to produce goods is a lot of fiddly extra steps that other games have now streamlined. Puerto Rico certainly deserves its place in the history of modern board games for the innovative turn structure it brought to the table, but it's not as elegant a game as I was hoping for and that means I'd never suggest this over other mechanically similar games.",
    "timestamp": 1732402800
  },
  {
    "username": "willbeplayin",
    "rating": 5.0,
    "comment": "I really should give this one a play or two more to really say anything about it. This was one of my first eurogames a long, long time ago and I haven't played it in years.",
    "timestamp": 1731106800
  },
  {
    "username": "sykano",
    "rating": 5.0,
    "comment": "said to be problematic when new players play with experienced players ?\nI like the theme somehow",
    "timestamp": 1728684000
  },
  {
    "username": "Citan7",
    "rating": 5.0,
    "comment": "I missed this train. I think just so many games do what this game does better now that not having played it 20 years ago I'll never be fond of it.",
    "timestamp": 1725573600
  },
  {
    "username": "invervegas",
    "rating": 5.0,
    "comment": "Complexity √ - Not for me",
    "timestamp": 1725141600
  },
  {
    "username": "nicjyc",
    "rating": 5.0,
    "comment": "The game is fine, but I rank it a 5 in comparison to the version which I like better, San Juan.",
    "timestamp": 1722981600
  },
  {
    "username": "Cats_on_a_Map",
    "rating": 5.0,
    "comment": "A modern classic, but there are other games that now do the mechanics this game innovated, but better. The theme never clicked with me, and now the sense of exploration in discovering the game seems all but mapped out.",
    "timestamp": 1722636000
  },
  {
    "username": "gamerpete67",
    "rating": 5.0,
    "comment": "Great strategic euro",
    "timestamp": 1719871200
  },
  {
    "username": "KingD7W",
    "rating": 5.0,
    "comment": "Coolest thing is whatever action you pick to do, everyone does but you get a bonus, but there is such a disadvantage of others hogging the roles you want if they go before you nearly every turn.",
    "timestamp": 1718316000
  },
  {
    "username": "DarkJjay",
    "rating": 5.0,
    "comment": "Fine to good game, horrible theme.",
    "timestamp": 1715637600
  },
  {
    "username": "rjones53",
    "rating": 5.0,
    "comment": "A dated game that needs an update",
    "timestamp": 1710284400
  },
  {
    "username": "dvieu",
    "rating": 5.0,
    "comment": "Like new, played once",
    "timestamp": 1709593200
  },
  {
    "username": "junior_gracz",
    "rating": 5.0,
    "comment": "its time has passed and too many games do similar things with great components\n\nWhy play something ugly?",
    "timestamp": 1707778800
  },
  {
    "username": "D_of_Endless",
    "rating": 5.0,
    "comment": "Played three times in 4 players:\nI scored first, second and second at few points from the first; so not bad.\nBut here my main concerns come on the field: I have absolutely no idea how I achieved those results.\nWhich was my strategy? Unknown\nWhat I was pursuing? Unknown\nIs it really possible that taking that big building made the difference?\nUknown\nAnd I had plenty of time to think about all of these in the game since it is not so short...\n\nAt the end: Take it or leave it",
    "timestamp": 1706828400
  },
  {
    "username": "B_Moores",
    "rating": 5.0,
    "comment": "Definitely worth owning. But how much interaction is there really?",
    "timestamp": 1706482800
  },
  {
    "username": "VultR",
    "rating": 5.0,
    "comment": "Price: $134.59",
    "timestamp": 1706137200
  },
  {
    "username": "makarren",
    "rating": 5.0,
    "comment": "Another game without a real relation with other players, like a multisolitaire.\n\nSold.",
    "timestamp": 1705359600
  },
  {
    "username": "Wolf_47",
    "rating": 5.0,
    "comment": "the game mechanics and point system doesnt make any sense",
    "timestamp": 1705014000
  },
  {
    "username": "stenole",
    "rating": 5.0,
    "comment": "(4-5P) Maximize your exploitation of \"colonists\" by selecting roles and performing their actions.",
    "timestamp": 1703286000
  },
  {
    "username": "GamechangerWithHoney",
    "rating": 5.3,
    "comment": "I really can't understand the hype. Apart from the simultaneous gameplay I find nothing good in this\nTheme: tasteless\nSetup: 15 minutes...\nGameplay: frustrating and non-rewarding\n\nIt is an ok game that I personally would never ask to play.",
    "timestamp": 1701558000
  },
  {
    "username": "dedindahed",
    "rating": 5.0,
    "comment": "Really enjoyed to start with but gets old fast, If you enjoy repeatedly playing minor variations on a relatively static strategy, this could be your game.",
    "timestamp": 1700434800
  },
  {
    "username": "MikeKoro",
    "rating": 5.0,
    "comment": "1st Play Thoughts   5   (Aug 2022):\n\nPlayed on BGA. Game didn't blow me away, it was fine, somewhat mechanical. I could play it again, but I don't think I would ask for it. The game feels a little dated, gameplay was not very exciting, not really a looker and there are others that are similar that I would rather play. Don't get me wrong, this was a good game, and I am sure 20 years ago it was revolutionary, but it has been superseded by many talented designers taking the formula and making it better in my honest opinion.",
    "timestamp": 1695938400
  },
  {
    "username": "Citery",
    "rating": 5.0,
    "comment": "Happy to finally get the grandaddy to the table! It's very clear to me why this was so hugely influential on the medium, but it's also very clear to me why this gained such a reputation for creating a nasty sort of play environment: it has near perfect information, no luck, and is very tightly constrained by seating order in nearly all of its phases. All this means that even small missteps or attempts at creative play can end up handing points over to your neighbors with little recourse from the table, resulting in an overbearing \"don't step in the bear traps\" atmosphere that I usually associate with Chess-like abstracts or some 18xx games.\n\nWhile I recognize the potential for nuanced, tense play with skill-matched players, that type of stressed pressure isn't something I'm usually looking for in these types of euros, at least not to this extent. With so many other games putting their spin on PR's role selection mechanic in the decades since its release, is it worth going back to the highly fragile progenitor? With such a transparently tone-deaf thematic distortion of historical atrocities to boot? For me, no.",
    "timestamp": 1690927200
  },
  {
    "username": "AthenaDog",
    "rating": 5.0,
    "comment": "No Longer Own",
    "timestamp": 1687730400
  },
  {
    "username": "BenRon",
    "rating": 5.0,
    "comment": "1",
    "timestamp": 1683928800
  },
  {
    "username": "rcyo88",
    "rating": 5.0,
    "comment": "BGG #1 when I first started the hobby. A quintessential euro-style game.\n\nI was in Puerto Rico when I was 23 years old on my birthday on the 23rd. I thought of this board game and asked my older sister to get it for me; after trying it, my older sister hates this game. lol\n\nI think the mechanics are really elegant and streamlined. The game's narrative is not exactly PC with the \"brown\" colonist. Nevertheless, it's appropriate for this game. The theme is boring and the fun is as good as dry humor. Overall, it's a solid designer game.\n\n.:Best 4:.\n\n--\nExpansion\n// New Buildings- made my own P&P",
    "timestamp": 1680213600
  },
  {
    "username": "Beloch",
    "rating": 5.0,
    "comment": "Not played enough, but like it. One that might grow on me. Never did. Sold.",
    "timestamp": 1679785200
  },
  {
    "username": "lausdower",
    "rating": 5.0,
    "comment": "Learning about the actual colonialization of Puerto Rico forever ruined this game for me. I know colonialism happens in a lot of games, but this one in particular stung. Especially after moving to the Puerto Rican part of town. I really wish it would be re-themed, but I just can't play it anymore.\n\nEdit: Very much looking forward to the new edition that will eliminate my quarrel with the original game.",
    "timestamp": 1673218800
  },
  {
    "username": "DetroitJohnny",
    "rating": 5.0,
    "comment": "Not bad but thought it would be better.",
    "timestamp": 1672873200
  },
  {
    "username": "SCOBYBryant",
    "rating": 5.0,
    "comment": "{ P - 2 [3] 4 5 }\n\nSmall Warehouse. Hospice. Large Market. Office. Large Warehouse. University. These buildings. Why do they exist.",
    "timestamp": 1666303200
  },
  {
    "username": "bronwenwatts",
    "rating": 5.0,
    "comment": "This was a fine game, but I didn't love it (and that is largely thematic). Played it at a game night where someone else brought it. I had originally had it on my wishlist, and I am glad I got a chance to test it out because it is no longer on my wishlist. I do like the mechanisms in the game, but thematically it's pretty terrible (colonists and slavery).",
    "timestamp": 1659909600
  },
  {
    "username": "Destrio",
    "rating": 5.0,
    "comment": "Tactical game of role selection. A classic that, despite its disconnected and dry theme, the strategic gameplay shines through.",
    "timestamp": 1657922400
  },
  {
    "username": "Maartendp",
    "rating": 5.0,
    "comment": "digitale versie op ipad",
    "timestamp": 1655157600
  },
  {
    "username": "JoshuaStarr",
    "rating": 5.0,
    "comment": "A great game that didn't age as well as other classics from a similar time. It still amazes me how drastically different scores could be despite players taking the same actions. However, I have not played this game or felt the desire to play this game in years.",
    "timestamp": 1654984800
  },
  {
    "username": "rickek",
    "rating": 5.0,
    "comment": "Great game where everyone feels like they have a chance at winning the whole game. Clever rules and job picking each round give this a lot of replay and keep me coming back for more. Well done indeed!",
    "timestamp": 1654984800
  },
  {
    "username": "UsuriusARP",
    "rating": 5.0,
    "comment": "with fome the game progresses the game is very stable and everything is kept in order, it does have certain moments of tension like any other game, also with fome the game progresses if you have the ability to learn, you feed yourself and it makes you be best player, has clear and concise objectives to what you are going and to finish if there are chances of victory",
    "timestamp": 1653948000
  },
  {
    "username": "t0dd0",
    "rating": 5.0,
    "comment": "I’m not sure if I like this one yet, only played it once, I was struck by the casual ruthlessness of the turn order and this how easy it was to screw someone over, it felt kinda random how someone might have a very fortuitous turn of events while another just has to naturally struggle. I also felt that the options available were limited and I wonder about the replay value. It looks like the sort of game where you’d find an optimal strategy and stick to that. But I could easily be wrong. Need to play it again I guess.",
    "timestamp": 1650578400
  },
  {
    "username": "rosewild",
    "rating": 5.0,
    "comment": "Played in 2019",
    "timestamp": 1650060000
  },
  {
    "username": "h0mbre",
    "rating": 5.0,
    "comment": "Absolutely no dice at all!",
    "timestamp": 1649196000
  },
  {
    "username": "pikkdogs",
    "rating": 5.0,
    "comment": "Library owns it.\n\nColonizing is a heavy theme man. It’s hard to have fun when one action is to take an African slave from a slave ship and bring it to a field to work. And another action is to take resources and ship them to Spain.\n\nBesides that, the mechanics are old and are good for the time, but desperately need to be streamlined for the modern player. This is a 20 year old game that seems like it’s 40 years old.\n\nBut, it is a decent game. Nothing special, but it does work. I wouldn’t recommend it, but it’s one of those games that our hobby was built on, and it’s nice to know where some of our favorite mechanics came from.",
    "timestamp": 1648591200
  },
  {
    "username": "Mystic_Mouse",
    "rating": 4.5,
    "comment": "There are superior game mechanics across the board here (though 4P is almost essential). The components are trash ... just cheap and thin, and that will impact many experienced board gamers. The turn order through role selection is both awarding and annoying. It would take paragraphs to describe the mechanisms, but this game is simply brilliant with experienced players and with the right player count (3 to 4). Otherwise, this game easily flops quite sadly with inexperienced players and low player counts. With such a wide scale of enjoyment, this is hard to rate. I'd highly suggest a rent or borrow to see how this gaming experience affects you. Very few games have this level of adaptation and deep complexity as the game grows. If you enjoy that, you'll love this game. With such beautiful mechanics I want to love this, but it quite commonly fails to impress if you choose the wrong players. With this layer of filtering, I can't recommend this.\n\nDingo",
    "timestamp": 1647644400
  },
  {
    "username": "dgstone",
    "rating": 5.0,
    "comment": "works well enough, but I don't like that it's more important to not help others than it is to try to help yourself.",
    "timestamp": 1646175600
  },
  {
    "username": "thinkingamer",
    "rating": 5.0,
    "comment": "I can see that this can be a great game, but it is extremely unwelcoming for beginners. Literally, the “take that” here is massive: to give an analogy, unless Puerto Rico players can fully take Magic: the Gathering’s “take that” as a new starting player -he/she will very likely to hopelessly lose badly- (I know that they are totally different games, but for now let’s just focus on the “take that” part), then continue to learn and by accruing experience, collection, etc. then Puerto Rico players don’t deserve to say much against new players who gives up playing PR after few couple games (btw, I HATE MtG more than I love it). My point is, both games can be pretty mean to newcomers in their own way, and if you see anyone who ends up having a bad experience -and even quit in the long run-, it's provably how the game (and their respective veteran players) treats its new players.\n\nIf you want a new player to stay in this game, then AT VERY LEAST you’ll have to spend a great deal of time and energy to impart the most optimized first 10 turn plays (“secret moves”) in a nuanced detailed explanation of how those moves work; I mean, the new player will still likely going to lose anyways, but at least she/he will leave knowing he had a fighting change for victory -he just played a very decent fun game worthy of revisiting more in the future-. The above characteristic of a Euro game specially applies to PR. Also, while I’ve grown to adore Euro games, one of its worst flaws is the snowball effect and/or the lack of a good solid catch-up mechanic (while more than acknowledging that MtG is a far more flawed game, at least in this area MtG is far more superior to Puerto Rico), and in PR this flaw seems to be more pronounced than most Euros; you have to know the game in and out from the very beginning AND to play optimally with minimal mistakes in correct order in order to have a winning chance.\n\nNonetheless, I can still see that PR can an amazing game if all players skills are similar.",
    "timestamp": 1645311600
  },
  {
    "username": "CthulhuDreams",
    "rating": 5.0,
    "comment": "Eh and the theme is problematic.",
    "timestamp": 1643410800
  },
  {
    "username": "Nostromone",
    "rating": 5.0,
    "comment": "The mechanics are excellent but my god the theme is tremendously off-putting. So off-putting that I haven't felt that comfortable bringing it out since the first couple of games. The conceit of settlers and virgin islands is so poor that it made me uncomfortable to have put it in front of friends. The gameplay was really good and whipped along once we got it, but it's in desperate need of a re-theme as well as a re-design to make it look a bit less beige.",
    "timestamp": 1641769200
  },
  {
    "username": "GameplayerOfTitan",
    "rating": 5.0,
    "comment": "Good game, pretty fugly.",
    "timestamp": 1640214000
  },
  {
    "username": "oiroso",
    "rating": 5.0,
    "comment": "I loved this game at first. But as I've played more board games I've come to realize PR has some disadvantages. In particular, the rules are pretty arbitrary (e.g. only one type of good in a boat?) and do not fit the theme. As a result, it's full of newbie traps.",
    "timestamp": 1639609200
  },
  {
    "username": "jodehi",
    "rating": 5.0,
    "comment": "Only play this with 5 people as it doesn't take that long, even with that many people.\nPuerto Rico: Expansion I – New Buildings",
    "timestamp": 1639263600
  },
  {
    "username": "jeffi4u",
    "rating": 5.0,
    "comment": "Very good and deep game but dry at the same time. No one really cared for it much except me. May be it is theme, story or colors, but it comes across like boring and family does not want to play more.",
    "timestamp": 1638918000
  },
  {
    "username": "ApeChild",
    "rating": 5.0,
    "comment": "I enjoy it, but never really crave playing it. So... its a bit of an average for me",
    "timestamp": 1637017200
  },
  {
    "username": "Raskzac",
    "rating": 5.0,
    "comment": "Need to play it more, it is considered a classic, the predecessor of RFG.",
    "timestamp": 1634421600
  },
  {
    "username": "TBagels",
    "rating": 5.0,
    "comment": "I know it's a classic, but I never liked it. It set the stage for a new kind of board gaming when it came out, but it hasn't aged well. Kind of boring.",
    "timestamp": 1630360800
  },
  {
    "username": "FranklynStreet",
    "rating": 5.0,
    "comment": "Not a big fan of this one. Certainly not for the theme, but also not a fan of the mechanics, either. In terms of \"well-known\" classics, this is definitely in my Bottom 5.",
    "timestamp": 1627855200
  },
  {
    "username": "zinniye",
    "rating": 5.0,
    "comment": "Would not purchase due to colonial theme. This is just not something I'd want to bring out at parties. Would be interested in an updated thematic.\n\n\"And last year, after Ravensburger acquired the English rights to 'Puerto Rico' from Rio Grande, the game was released with slight tweaks—those brown discs are now purple, and the rule book now includes a disclaimer encouraging players to educate themselves on colonialism and the 'harm that it caused around the world.' When I reached the publisher for comment, a representative told me that in 2022, it will release a 're-imagined version of the game globally, created in partnership with a culturally diverse and representative team.' This time, they said, it’ll be 'set in post-independence Puerto Rico, and it won’t include themes of colonialism.'\"\n\n\"'The crimes committed during colonialism were known in the 2000s. However, those who considered the topic important were not represented in the board game community at that time.' ... The glorification of colonialism in these games, then, appears to be superficial, born of convenience and ignorance—not a reflection of deeply held philosophy—which makes their problems too easy to ignore.\"\n\n- Luke Winkie at the Atlantic\n\n(Played on Board Game Arena)",
    "timestamp": 1627596000
  },
  {
    "username": "Meltzy",
    "rating": 5.0,
    "comment": "Good game, but theme is really light and better more recent games available with similar mechanisms",
    "timestamp": 1626127200
  },
  {
    "username": "fair_j",
    "rating": 5.0,
    "comment": "iPad digital version",
    "timestamp": 1617832800
  },
  {
    "username": "cdefrisco",
    "rating": 5.0,
    "comment": "This game is fun, but too much flotsam for its own good. I'll play this, and enjoy the game, but rarely will I suggest it. I'm still not sure how this can be number one for so long. There are SO many games that are more fun to play than this thing. I will certainly play this and have a good time. But come on... number one??",
    "timestamp": 1615590000
  },
  {
    "username": "jdmofo",
    "rating": 5.0,
    "comment": "Interesting game mechanisms, it is a good game. A classic, even.\n\nBut that theme, oof. I wouldn't judge anyone for loving this game, but I think I'm done with it.",
    "timestamp": 1614726000
  },
  {
    "username": "handsomestephen",
    "rating": 5.0,
    "comment": "Only played on Boardgamearena.com",
    "timestamp": 1614207600
  },
  {
    "username": "DukeofChutney",
    "rating": 5.0,
    "comment": "I can see why its popular. I dont connect the mechanics with the theme at all. Which is ashame because economic themes intrigue me. This is just about maximising your efficiency, whilst damaging your opponents.\n\n.. the game calls them colonists and sweeps the issue under the carpet.",
    "timestamp": 1612998000
  },
  {
    "username": "tReason",
    "rating": 5.0,
    "comment": "Ah, don't you just love the smell of colonialism in the afternoon.",
    "timestamp": 1609714800
  },
  {
    "username": "zb1035",
    "rating": 5.0,
    "comment": "I get why this was so popular. You're always engaged and the game moves at a nice pace. There seems like a lot of interesting combinations to be had here.\nBut that doesn't make the theme and art any more interesting. I'd rather just play San Juan, and, furthermore, I'd rather just avoid games that are primarily biege about colonialism altogether.",
    "timestamp": 1608591600
  },
  {
    "username": "PlusOrMinus",
    "rating": 5.0,
    "comment": "Modern classic. Good mechanics. Just does not compete for table space.",
    "timestamp": 1607986800
  },
  {
    "username": "Aegis_777",
    "rating": 5.0,
    "comment": "A fun game but once the meta code is cracked, becomes a game of musical chairs, with the winner often being determined simply by being the last to draw and perform actions.",
    "timestamp": 1605826800
  },
  {
    "username": "musicalanarchy",
    "rating": 5.0,
    "comment": "It's an okay game mechanics wise, but just bland gameplay and aesthetic, so I'm not really into it.",
    "timestamp": 1605567600
  },
  {
    "username": "Riinaaja",
    "rating": 5.0,
    "comment": "Played twice.",
    "timestamp": 1605308400
  },
  {
    "username": "kchowland",
    "rating": 5.0,
    "comment": "This would be a great game except for the casual racism.",
    "timestamp": 1604962800
  },
  {
    "username": "thrasymedes",
    "rating": 5.0,
    "comment": "A deserving classic, a good design, but if I'm honest, I'll almost never choose to play this in preference to any of the other games I like.",
    "timestamp": 1603576800
  },
  {
    "username": "jgoyes",
    "rating": 5.0,
    "comment": "2011-08-21\n\nInitial Rating: 7.0 (May 2010)\n\nPuerto Rico is a good economic game, no doubt about that. Still I think it is overrated (at the time of writing this, it is number 2 in the ratings) as there are many games I would choose over this one.\n\nI love the tactics (role selection) and strategies (buildings) the game offers, also it has little luck which makes it very attractive for me.\n\nOn the bad side it isn´t fun to play with people of different skill level which lead to unintentional kingmaking and the theme is awful (I would have never played this for the theme, I´m glad I was introduced to it by a friend)\n\nCurrent Rating: 7.0\n\n\n2012-09-10\n\nNowadays, I almost always resist my game group peers when they propose to play Puerto Rico. The game fails to excite me and I really don’t want to play it anymore. I´m sure I will play it again but, for now, I’m adjusting the rating so it matches my new feeling toward the game. In all truth, the game NEVER really catch my attention and almost never I had fun playing it. I cannot explain why, but it's the honest truth.\n\nCurrent rating: 5.0\n\nJgoyes´ Awards:",
    "timestamp": 1602885600
  },
  {
    "username": "Born-of-Ashes",
    "rating": 5.0,
    "comment": "This game works so well when playing because the systems fold back into each other so smoothly. The innovative action selection mechanism is so elegant that it hasn't been improved on since. Unfortunately I find the game becomes to repetitive because of this lack of surprise. Skilled players often become annoyed if you don't do the \"right\" move that conforms to their planning.",
    "timestamp": 1601416800
  },
  {
    "username": "ArturB",
    "rating": 5.0,
    "comment": "A game that opens slowly and takes some study to understand what you should be trying to do. If the theme whas more interesting I might have the motivation to make the effort.",
    "timestamp": 1600380000
  },
  {
    "username": "Vroenis",
    "rating": 5.0,
    "comment": "I've definitely played more than twice, also I've never lost.\n\nBut also naaaah, can't do slaves, mate.",
    "timestamp": 1600207200
  },
  {
    "username": "cheshirekatz",
    "rating": 5.0,
    "comment": "3-5P",
    "timestamp": 1600207200
  },
  {
    "username": "maktmissbrukare",
    "rating": 5.0,
    "comment": "Was best when it was modified for two player play, to be honest. This was an entry game for me when I got into gaming a while back. I have sold it since I have worker placement games that I prefer playing. Besides, none of those games have colonialist overtones.",
    "timestamp": 1594936800
  },
  {
    "username": "Xyt4n",
    "rating": 6.3,
    "comment": "PLAYED AND NOT INTERESTED ENOUGH\n\n+ upgrading is satisfying\n+ theme is fun\n- interactivity is indirect and so not satisfying\n- game is not memorable",
    "timestamp": 1762682400
  },
  {
    "username": "bingham",
    "rating": 6.0,
    "comment": "I enjoyed the concepts. I especially enjoyed the role selection. The theme is different. I feel the game was overrated.",
    "timestamp": 1762626540
  },
  {
    "username": "Moonpie13",
    "rating": 6.0,
    "comment": "The game felt dated to me, but my rating may have been impacted with having no idea what I was doing in the game.",
    "timestamp": 1761951600
  },
  {
    "username": "edubvidal",
    "rating": 6.0,
    "comment": "El clásico Puerto Rico. Estoy pensando en volver a comprarlo. Podría gustar en este nuevo grupo de cuatro.\nSelección de roles (con ventaja para el primero que lo elige) y ganar colonos, construir edificios, generar recursos en tus plantaciones y venderlos cargándolos en los barcos con sus bodegas limitadas. Es un juego amable donde todo fluye y nadie queda descolgado.",
    "timestamp": 1759960800
  },
  {
    "username": "Togii",
    "rating": 6.1,
    "comment": "Strategic Depth: 9/10\nRNG Mitigation: 10/10\nGoofiness Potential: 3/10\nSimplicity: 6/10\nArtistic Direction: 0/10",
    "timestamp": 1759960800
  },
  {
    "username": "hyde_70s",
    "rating": 6.0,
    "comment": "Still fun, but would rather just play Race for the galaxy instead.",
    "timestamp": 1759010400
  },
  {
    "username": "Arseny_Vasily",
    "rating": 5.7,
    "comment": "The base game has a pretty repetitive and low-variation gameplay, in which the most successful strategies are exploited, although the unpredictability of the role choice of opponents and limited resources partly compensate for this shortcoming. In general, the game is well done and the game mechanics are perfectly woven into the setting, the expansions are great to expand the base",
    "timestamp": 1758837600
  },
  {
    "username": "Wolcik",
    "rating": 6.0,
    "comment": "Digital version available (BGA)\nNot repayable enough",
    "timestamp": 1758751200
  },
  {
    "username": "alialkabah",
    "rating": 6.0,
    "comment": "based on very few plays on BGA, not interested",
    "timestamp": 1757973600
  },
  {
    "username": "namdh0809",
    "rating": 6.0,
    "comment": "old system.",
    "timestamp": 1755640800
  },
  {
    "username": "pingus",
    "rating": 6.0,
    "comment": "To this day one od the best eurogames with great player interaction (without any obvious take that), good scaling and lots of strategic and tactical choices. A little too hard to get to the table, because like in chess, you need a Group of people on the same level.",
    "timestamp": 1754949600
  },
  {
    "username": "Koert",
    "rating": 6.0,
    "comment": "Good economic strategy game, although it doesn't really click for me. At its best with 4-players (3 and 5 are unbalanced).",
    "timestamp": 1753740000
  },
  {
    "username": "Auroric",
    "rating": 6.0,
    "comment": "Really enjoyed this at the time, but I've gotten bored with it. Theme isn't great, and there's things I'd rather play. Also solved by competitive players, which sucks. Good game, but I've grown a little weary.",
    "timestamp": 1751925600
  },
  {
    "username": "MrBigos",
    "rating": 6.0,
    "comment": "I just don't get the flow of that game. There are games, that even when new, after few turns I get it and I start develop long term tactic. In Puerto Rico, after couple plays, I still don't see any tactics. Some things are happening, I am trying to adjust and pick the best, but I feel that I am not in control of the situation.\nThere are also no combos and whole game feels like +1 here or there.",
    "timestamp": 1750197600
  },
  {
    "username": "bannanister",
    "rating": 6.0,
    "comment": "BGA. Would like to try this one in person. First time playing it in 2025. Suspect would have really enjoyed this game back in the 2000s, but now it is just fine",
    "timestamp": 1749333600
  },
  {
    "username": "emily84",
    "rating": 6.0,
    "comment": "A nice game. The game itself is good but the visual details and components isn't the best.\nWould be great if it could get a remake.",
    "timestamp": 1748901600
  },
  {
    "username": "Marius n Milan",
    "rating": 6.0,
    "comment": "2015\nS",
    "timestamp": 1747951200
  },
  {
    "username": "Eliya84",
    "rating": 6.0,
    "comment": "This game is ok but not very good. In the late game you do only thr action which you can block the other players.",
    "timestamp": 1747778400
  },
  {
    "username": "Jackieh9",
    "rating": 6.0,
    "comment": "Learned at Euro Quest. Didn't like it for awhile, but I'm liking it more as I play it more on BGA. No luck mechanic so all bad outcomes were my fault",
    "timestamp": 1747000800
  },
  {
    "username": "shawnmackay1593",
    "rating": 6.0,
    "comment": "2 things really hold this back for me. First, I don't love games where 1 person takes an action and everyone else follows (not a fan of Race for the Galaxy or Earth either). But the main issue for me is replayability. By game 3, it started to feel very samey and I stated losing interest.",
    "timestamp": 1746482400
  },
  {
    "username": "EvilCheesypoof",
    "rating": 6.0,
    "comment": "BGA only, would like to try it in person to understand it a bit better, but I see the shared DNA Race for the Galaxy has and I love that game.",
    "timestamp": 1746396000
  },
  {
    "username": "farsidehobbes",
    "rating": 6.0,
    "comment": "Finally played this after many years. I can see the underpinnings of other games that came after it.\n\nDidn't have much of a strategy other than try and get a bit more money and that you really needed an endgame scoring tile to have a chance. I was the only one that went in to tobacco so I was able to close off a boat.\n\nThe end can come fast.",
    "timestamp": 1746396000
  },
  {
    "username": "Ihavenofrends8",
    "rating": 6.0,
    "comment": "The game feels old school to me. I don't care to put in the time to know it.",
    "timestamp": 1746136800
  },
  {
    "username": "zelmf",
    "rating": 6.0,
    "comment": "having a hard time figuring out how to even win at this game",
    "timestamp": 1745618400
  },
  {
    "username": "supercooldave",
    "rating": 6.0,
    "comment": "Cannot find the energy to learn this one. Played once and it was fun but complex.",
    "timestamp": 1745272800
  },
  {
    "username": "Yokiboy",
    "rating": 6.0,
    "comment": "After my first play I was in love! We played it twice in a row to boot. I actually woke up in the morning with a new strategy that I wanted to try next time. After my 3rd play I was even more thrilled with Puerto Rico!\n\nNow I find the colonization theme more than a little problematic, and I like the follow mechanism better in games such as Glory to Rome, Mottainai, Innovation, Race for the Galaxy, and even Eminent Domain.",
    "timestamp": 1745186400
  },
  {
    "username": "StupidRatCreature",
    "rating": 6.0,
    "comment": "",
    "timestamp": 1744754400
  },
  {
    "username": "Sedd",
    "rating": 6.0,
    "comment": "Noch mal spielen. (11/2021)\n1. Partie ist fast in Vergessenheit geraten.\n2. Partie war ok. Fühlte sich etwas mechanisch an. Man muss immer schauen, was der andere wohl für eine Rolle wählen werden. Das macht es Taktisch, aber auch etwas Grübelig.\n\n04/2025:\ninteraktiv, da jeder ne Rolle hat. konfrontativ, weil man dem anderen nix gönnt (zumindest zu 2.). relativ schnell gespielt (zumindest BGA), Engine-Aufbau. Rollenauswahl wird geringer, weil gewählte Rollen erst ab refresh wieder zur Verfügung stehen.\n-> imernoch wiederholen, weil die Partie ohne Regeln einfach gestartet wurde, just for fun.",
    "timestamp": 1744149600
  },
  {
    "username": "wolvendancer",
    "rating": 6.0,
    "comment": "It's a fun, well-designed game, there's no doubt about it. Once my highest-rated game. But setting aside mechanics quirks (the importance of who is sitting to your right, for instance), I just cannot accept the offhand way in which the game uses slavery as just another part of its pasted-on theme. Imagine a eurogame that used building a concentration camp as it's theme, then had you train-in victims every turn... yeah. Sold my copy.",
    "timestamp": 1743976800
  },
  {
    "username": "Avid_Equinox",
    "rating": 6.0,
    "comment": "+ Interesting interactive game with simple rules and high complexity\n+ \"Follow\" mechanic where everyone copies a weaker version of your action you picked for your turn\n+ Depth comes from finding the edge cases where you can deny others benefiting from following your action\n+ tight on resources the whole game\n\n- This theme is horrendous... The designer could have picked ANYTHING ELSE for a generic resource conversion design, yet they chose to make a game about being a slave master, obtaining slaves and putting them to work to make the most money... that's apparently what they wanted to put out into the world with their name on it...",
    "timestamp": 1743544800
  },
  {
    "username": "zeotter",
    "rating": 6.0,
    "comment": "Traded to Noble Knight",
    "timestamp": 1741042800
  },
  {
    "username": "RikHavok",
    "rating": 6.0,
    "comment": "2/25",
    "timestamp": 1740351600
  },
  {
    "username": "igroteka",
    "rating": 6.0,
    "comment": "I'm not sure whether I like this one or not.",
    "timestamp": 1740178800
  },
  {
    "username": "Burge",
    "rating": 6.0,
    "comment": "just hasn't grabbed me yet",
    "timestamp": 1739574000
  },
  {
    "username": "HelloLion",
    "rating": 6.0,
    "comment": "It's hard to overlook the themes of this game even though I do genuinely try.",
    "timestamp": 1738537200
  },
  {
    "username": "7inchsplit",
    "rating": 6.0,
    "comment": "Ah, yes.",
    "timestamp": 1737932400
  },
  {
    "username": "bryanldoughty",
    "rating": 5.6,
    "comment": "I used to enjoy this game. It gave me the impression that many options were available for strategic play. I now believe that is an illusion. I found eventually that my opponents that had greater opportunity to play had a far greater probability of winning. This rewards the experienced player too much for my taste. Such heavily scripted openings are not interesting to me. I'm better now at identifying games like this, and knowing that in the long run they aren't my kind.",
    "timestamp": 1736809200
  },
  {
    "username": "floh3",
    "rating": 6.0,
    "comment": "E",
    "timestamp": 1736031600
  },
  {
    "username": "LostChord_Mark",
    "rating": 6.0,
    "comment": "2024-06-16 FBM $5+$3=$8 beat up box\nRob 12-3024",
    "timestamp": 1735513200
  },
  {
    "username": "GrimBrownie",
    "rating": 5.9,
    "comment": "Highly rated game with lots of strategy. Complex in its strategies, but very replay able as well.",
    "timestamp": 1735167600
  },
  {
    "username": "VuduJoie",
    "rating": 6.0,
    "comment": "10/25/2007: Revised rating to a 4. It will definitely take some talking to get me to play this game again. As I noted in my earlier comments... with additional plays it loses it's luster. It's a dull and dirty gray now. But also for me I'm stuck in a Puerto Rico playing world of insanity. One of the common definitions of insanity is \"repeating the same actions but expecting different results.\" And in my group that definition is very fitting. More damaging to our game play is that we seem to always have a new player, which Puerto Rico cannot well handle. It is a game where everyone should be of the same level of understanding. Sure, most games are like this, but Puerto Rico suffers catastrophically from the problem of uneven playing levels. This is mainly because it is such a procedureal game and someone making the \"wrong\" selection can cause havoc (or great reward) to others game-plan. To me this is a shortcoming and a fatal flaw in this game. Thus I rate it a 4: I do not enjoy playing it, I don't think it is very good, but every now and then allow myself to be talked into it. I predict that if I do not wait and play this with \"capable and compatable PR players\" it will certainly fall to a 3 or a 2 rating.\n\nEarlier comments:\nI like this game a lot, but with each play it gets more and more scripted. Fun, quick, exciting - requiring people to remain constantly focused, plan ahead, and make tough decision. However, there are many many games better than this.\n\n1/20: Played the 2-player official varient vs. the wife. I was very pleasantly surprised at how good this works. I'm sure we'll be playing this far more often now. Playing this way, I should think, will be a great way for someone to learn the nuances of the game and grow comfortable with making decisions.\n\n10/3 - Lowered my rating from 8.5 to a 7.5 and here's why: firstly, the three-player game, while quick, is terribly rote. There is ALWAYS someone or often more than one person attempting and getting the harbor/wharf combo. Oh boy that's fun. I've done it myself many times and while it can be stopped, it must be done early and with very concentrated precise play by the other two players. Conversely, the person hooking up with both can practically blunder along and just flat-out win. Perhaps a change in the number of buildings available, like is done in the 2-player varient, would create a much more tense and thought-filled game. The second reason I dropped my rating is because I'm finding this game to be more and more scripted with each play. If (insert action) is selected, then do (insert response). It has become more and more rare during my playings that this isn't the case. And that leads me to my third reason for dropping my rating - I've simply played this game too often in the past year and I'm kind of getting burned out on it.",
    "timestamp": 1734994800
  },
  {
    "username": "JosYule",
    "rating": 6.0,
    "comment": "Finally got a chance to play this. Really enjoyed it, looking forward to playing it more!",
    "timestamp": 1734908400
  },
  {
    "username": "camidon",
    "rating": 6.0,
    "comment": "Though this gets high reviews, and I do appreciate the game, it started to feel very predictable and very similar play after play. There were so many other games I'd rather play, that I traded this away. I understand why many receive it well, but not for me.\n\nMy wife expressed interested, so I reacquired, but then she decided, not really. okay.\n\nTRADED\nSOLD KC BONKERS",
    "timestamp": 1734908400
  },
  {
    "username": "semblablables",
    "rating": 5.5,
    "comment": "Like doing algebra for fun, but algebra at least is satisfying.\n\nI saw that a newer edition has buildings painted on the building tiles, which I think is actually critical for the feel/theme of the game. Not having that on my copy is a major drawback actually -- the very thin layer of theme is what would make the game feel minimally embodied, and having building tiles which just words on them makes it feel like I'm playing a rulebook.\n\nThe honest curious question I have for enjoyers of this game is what it offers that chess or go don't, beyond multiplayer.",
    "timestamp": 1734130800
  },
  {
    "username": "AndyVZ",
    "rating": 6.0,
    "comment": "Left-right binding and optimal play issues mar how strong the core mechanic is. Effectively everyone needs to already understand the core game of chicken or have it explained to them. Otherwise the game breaks heavily in favor of the player after them in turn order. Also some theme issues...",
    "timestamp": 1733698800
  },
  {
    "username": "Daggerclaw",
    "rating": 6.0,
    "comment": "MC",
    "timestamp": 1733353200
  },
  {
    "username": "Jmartinezd",
    "rating": 6.0,
    "comment": "Esta bien",
    "timestamp": 1733180400
  },
  {
    "username": "Zeusman",
    "rating": 6.0,
    "comment": "Non-Library Copy",
    "timestamp": 1732230000
  },
  {
    "username": "fredderoncq",
    "rating": 6.0,
    "comment": "15\nKaren",
    "timestamp": 1731279600
  },
  {
    "username": "ScotchYeti",
    "rating": 6.0,
    "comment": "Played it a lot on the iPad. Loved that it took some time to master the strategic part of it. After some years it lost its appeal. 7 is a fair rating.",
    "timestamp": 1727301600
  },
  {
    "username": "Parliament",
    "rating": 6.0,
    "comment": "I would have liked it better before I played Race and San Juan, which I enjoy more.",
    "timestamp": 1726264800
  },
  {
    "username": "BankofDracula",
    "rating": 6.0,
    "comment": "I can get the same clever action selection mechanisms in San Juan, Race for the Galaxy, or even Jump Drive but play those games in a fraction of the time. Puerto Rico also doesn’t light up that combo-rific enjoyment centre of my brain much like its successors do. And tell me the workers held on a card depicting a ship don’t represent what I know they represent, go ahead.",
    "timestamp": 1724536800
  },
  {
    "username": "jond",
    "rating": 6.0,
    "comment": "Really like this game - easy to teach and deep to bear repeat plays.\n\nOnly problem is finding players who aren't sick of it (playing with family) Fairly steep learning curve, but I really enjoy the game.",
    "timestamp": 1724191200
  },
  {
    "username": "MissP1ggy",
    "rating": 6.0,
    "comment": "Very nice interactive euro. A classic for a reason.",
    "timestamp": 1724191200
  },
  {
    "username": "kiwipaul",
    "rating": 6.0,
    "comment": "was fun in its day, now aged",
    "timestamp": 1722463200
  },
  {
    "username": "mawilson4",
    "rating": 6.0,
    "comment": "Paved the way for a lot of innovations in Euro-gaming, and still works as a reasonably interactive and streamlined game despite featuring individual player areas and the special-case buildings, which I generally don't like. The fact that I am not a fan of some of the innovations it helped to popularize is a point against it, though, even though it's better than many that took inspiration from PR.\n\nI'd prefer a less problematic and more engaging theme, but don't believe there was any malice in its creation and applaud more recent attempts to update the theme while retaining the core gameplay.",
    "timestamp": 1721944800
  },
  {
    "username": "Outshined_One",
    "rating": 6.0,
    "comment": "We never got this played with 3+. The rating might go up if we ever do, but it's out of our collection for the time being.",
    "timestamp": 1721772000
  },
  {
    "username": "peter haslehurst",
    "rating": 6.0,
    "comment": "OK I know it's good, but it's always a slightly painful experience for me. Guess I am just not very good at analytical games.",
    "timestamp": 1721340000
  },
  {
    "username": "pers0n",
    "rating": 6.0,
    "comment": "3-5p, 90-150min",
    "timestamp": 1720130400
  },
  {
    "username": "jakedecock",
    "rating": 6.0,
    "comment": "MT",
    "timestamp": 1720044000
  },
  {
    "username": "Harroguk",
    "rating": 6.0,
    "comment": "Great but why would I play this when Agricola exists.",
    "timestamp": 1719525600
  },
  {
    "username": "bbolch",
    "rating": 6.0,
    "comment": "One of the first successful euro games that has stood the test of time. Puerto Rico is a game that will always be considered classic.",
    "timestamp": 1718575200
  },
  {
    "username": "vlado_work",
    "rating": 6.0,
    "comment": "I start to be tired of this game",
    "timestamp": 1717538400
  },
  {
    "username": "thestoryguy",
    "rating": 6.0,
    "comment": "Very nice game! Played it for the first time recently and although the components are starting to look a bit dated, it is definitely a keeper! The play is fast and there is almost no down time. The strategy is deep where the game would be difficult to master. I love the theme. Note to Christians: there is tobacco as one of the resources in the game.",
    "timestamp": 1715205600
  },
  {
    "username": "monkeyhandz",
    "rating": 6.0,
    "comment": "Gone\nThe big baby donate",
    "timestamp": 1711753200
  },
  {
    "username": "mcmgm_bgg",
    "rating": 6.0,
    "comment": "SdJ almost",
    "timestamp": 1710802800
  },
  {
    "username": "wispur1244",
    "rating": 6.0,
    "comment": "Resource management.\n\nThe lack of artistic assets for this game is really hurting my will to ever play it again. Solid gameplay though.",
    "timestamp": 1709506800
  },
  {
    "username": "Tufturk",
    "rating": 6.0,
    "comment": "Includes the new buildings and nobles expansions from the Alea Treasure Chest.\n\nWhen I look at Puerto Rico, I see the ruins of what was once considered a great game. The ruins might tempt nostalgic re-exploration, at extremely rare occasions.\n\nIn 2024, a game with very unbalanced buildings (even with the price adjustments recommended by the designer), only 2 real strategies, play that feels like being held in a straightjacket with a knife to your throat, and components that are total crap, doesn't make a great game.",
    "timestamp": 1708210800
  },
  {
    "username": "GodfatherPTS",
    "rating": 6.0,
    "comment": "If your face turns red with anger over failed dice rolls, a game like PR is the way to go. I find, however, that a complete elimination of luck has also killed an element of surprise that adds to the fun of boardgames. Don't get me wrong, dice scare me just as much as the next gamer, but this game seems to be missing something and that is what I can come up with.\n\nStill...7 is a fantastic score. Great game. The roles are fabulous, the number of choices is very exciting. This game is actually rather new to me, however, and as I play it more, I expect my opinion of it to grow rather than wane.\n\n12/2009: I think I was wrong. My opinion is staying the same. I just don't know how I feel about a game where you are sometimes trying to decide which actions you need to avoid because it will give the players after you a distinct advantage. Big problem when playing with people that concentrate solely on what they are trying to accomplish. It is just too frustrating to watch people choose 'Craftsman' when the player to their left will score so many points if they do.",
    "timestamp": 1708124400
  },
  {
    "username": "Stehmansmith5",
    "rating": 6.0,
    "comment": "Gave away",
    "timestamp": 1706482800
  },
  {
    "username": "Thip",
    "rating": 6.0,
    "comment": "What I like:\n\n-Classic eurogame and it's quite fun to build your distinct part of the island\n\nWhat I do not like:\n\n-I really really dislike the action selection mechanic where everyone has to do each others' stupid action. I know folks say that means you have to look at the opponents situation and evalute what their next move is, but that is exactly what I hate. This means that to play optimally I should actually spent more time looking at your board than my own. Not to mention the fact that sometimes you are stuck with the strategy you chose early game (for instance builder) and some idiot at the table hasn't realised that he is spoon feeding my other opponent the victory by constantly picking the craftman. This could also be the other way around. Generally the problem is just the result of my strategy is based primarily on what my opponents decide to do (and who is more experienced and where they sit on the table versus the newer players).\n-It's definitely not a pretty game.",
    "timestamp": 1706223600
  },
  {
    "username": "Chris Barnard",
    "rating": 6.0,
    "comment": "A clever and highly original design but the choices often feel rather obvious. THE most obvious being to invite the new player to sit on your right! I prefer Cuba to this one because there is so much more going on though Puerto Rico is a excellent introduction to role selection and eurogames in general.",
    "timestamp": 1706223600
  },
  {
    "username": "Xasky",
    "rating": 6.0,
    "comment": "Was good. Is now outdated",
    "timestamp": 1703890800
  },
  {
    "username": "Captain Smollett",
    "rating": 6.0,
    "comment": "Sehr elegante Mechanismen. Die Spielabbruchbedingungen sind wunderbar ausbalanciert. Spielt sich flüssig.",
    "timestamp": 1703458800
  },
  {
    "username": "CMagex",
    "rating": 6.0,
    "comment": "1, not sure where this is\n\nRemove-not as good anymore as it once was, can play online if so desired\n\nCoins - Pirate/old world\n\nHad 2 for some reason, now have 1 copy for trade\n\n#53",
    "timestamp": 1703026800
  },
  {
    "username": "TriColoredTiger",
    "rating": 6.0,
    "comment": "A true classic. An amazing euro.",
    "timestamp": 1702076400
  },
  {
    "username": "tracylin",
    "rating": 6.0,
    "comment": "既可合作，又可競爭的經典遊戲。遊戲過程中有許多決策的機會，使得遊戲的結果變化多端。玩家扮演經商的角色，需要想辦法讓自己得以生產且販賣貨物以賺取收入。但最終的遊戲評分是以分數計算，因此如何讓自己的分數提高也十分重要。",
    "timestamp": 1700348400
  },
  {
    "username": "TheWhisperOne",
    "rating": 6.0,
    "comment": "This game is fun, but the theme leaves alot to be desired.",
    "timestamp": 1699138800
  },
  {
    "username": "techstocklava",
    "rating": 6.0,
    "comment": "Loved this game back in its time but there's pretty much no day I wouldn't choose Agricola over this now. I like the tight competition over roles and buildings but eventually wins and losses get to be too predictable.\n\nMy rating is based on my feelings about it now, though, and isn't really fair to how monumentally important this game was in its time, for the influence it had on game designs to come and for my own journey in this hobby.",
    "timestamp": 1698357600
  },
  {
    "username": "dudero78",
    "rating": 6.0,
    "comment": "I owe Puerto rico a new go with a new perspective. It got overwhelmed by the sizeable amount of games I bought and played shortly after his arrival. I don't have very fond memories of it, but it's a classic, it's much appreciated by players everywhere, and we owe him credit for the \"Renaissance\" of Board Games we are living in the 2010s. I'll come back to you someday and maybe I'll reevaluate! Anyway, if you loved Catan, I think this is a must try, could become one of your favorites.",
    "timestamp": 1697925600
  },
  {
    "username": "iNano78",
    "rating": 6.0,
    "comment": "Amazing game. Took nearly a year to get it to the table, but I can't wait to play again. Now if only I could find someone to play it with me.\n\nPurchased from BGGer \"Howitzer_120mm\" with beautifully illustrated custom building tiles + custom stylized (streamlined) version, June 2012. Also includes two expansions: \"New Buildings\" and \"Nobles\" (from the Alea Treasure Chest).",
    "timestamp": 1697580000
  },
  {
    "username": "CRyanReed",
    "rating": 6.0,
    "comment": "Traded through Reddit for Fog of Love",
    "timestamp": 1696975200
  },
  {
    "username": "TwoAMArts",
    "rating": 6.0,
    "comment": "A really crisp, simple-but-deep strategy game/action selection. At higher levels, there's apparently a science to this game, but it's fine and accessible for casual play too.\n\nAs much as I respect and do enjoy the game, this is a game that I'm often just not in the mood for... And I'm not sure what causes that. I like playing it, but I don't know that I'd call it fun. Maybe due to the precision of the game, one poor turn can be a disaster and unrecoverable. Not sure. I recommend playing it, certainly, and it is a classic, but... yeah. Not my favorite.",
    "timestamp": 1696629600
  },
  {
    "username": "nlgn",
    "rating": 6.0,
    "comment": "Aware it's supposed to be great, but felt very dry.",
    "timestamp": 1695074400
  },
  {
    "username": "naclsweet",
    "rating": 6.0,
    "comment": "The different rolls are good but I feel like it always ends before I can get a good engine going",
    "timestamp": 1694296800
  },
  {
    "username": "Vantastic",
    "rating": 6.0,
    "comment": "Pretty fun action selection engine builder that depends heavily on turn order and the experience at the table. Multiple paths to victory and opportunities for sticking it to your opponents right in the eye but otherwise pretty typical fare—especially when compared to the titles that have come out in the decades since its release.",
    "timestamp": 1693519200
  },
  {
    "username": "virulentwound",
    "rating": 6.0,
    "comment": "This game is close to perfect for me. I don't own it because my game group owns multiple copies, but this is one of my favorite games and I'm always happy to play.",
    "timestamp": 1689804000
  },
  {
    "username": "_The_Inquiry_",
    "rating": 6.0,
    "comment": "Prior to 2020: 3 plays\n\nPuerto Rico is the classic Euro game that is recognizable by most everyone who's been in the hobby for some time. The merit it receives is certainly warranted, as the game remains one of the tightest action-selection and efficiency games out there, creating tons of gameplay space with reasonably simple and streamlined rules. Strategy, timing, and careful planning are absolutely necessary for success here, and considering how one's actions affect the players acting after you is beyond important. Multiple viable strategies exist, and there's plenty of room for players to learn how to navigate these various paths efficiently. It's a game that remains engaging and tense up until the very end and manages to be a game that knows exactly what it wants to accomplish, doing so wonderfully. Not everything about the game is perfect, however, with the graphic design and overall theming being reasonably lacking, but it still holds up even despite these features. Additionally, because of the importance of timing, the game relies heavily on equally-skilled players to make a satisfying experience, which can be challenging to find. Overall, Puerto Rice is an exceptional design that really did a lot of work to pioneer the modern game industry, and while I think there are some games that build on the back of it in more interesting ways, I'd still happily revisit this one and hope to do so much more in the future.",
    "timestamp": 1688680800
  },
  {
    "username": "Bartolomeus",
    "rating": 7.0,
    "comment": "Anniversary Edition (German)\nUnplayed",
    "timestamp": 1761256800
  },
  {
    "username": "lorex888",
    "rating": 6.5,
    "comment": "Traded for Take the Gold\nOct. 2019 Glass Die Sell/Swap",
    "timestamp": 1761084000
  },
  {
    "username": "badassbr",
    "rating": 7.0,
    "comment": "Clássico heavy game com role selection\n\nEle é tão jogado que já existe estratégias de qual o melhor recurso a se pegar dependendo da sua posição e papel escolhido nas primeiras rodadas.\n\nÉ um Age of Empires no recolhimento de recurso e construção de prédios que te ajudam a evoluir sua cidade. Vale a pena jogar!\n\nA versão brasileira é MUITO boa, sinceramente é a melhor versão que se tem deste jogo que eu tenha ciência.",
    "timestamp": 1760306400
  },
  {
    "username": "gwsharkerik",
    "rating": 7.0,
    "comment": "Don't like the colonial theme. But strategy-wise it's a lot of fun.",
    "timestamp": 1759788000
  },
  {
    "username": "Ddyraw",
    "rating": 7.0,
    "comment": "Never played IRL, would like to so I could properly evaluate it",
    "timestamp": 1759442400
  },
  {
    "username": "SharnLea_a",
    "rating": 7.0,
    "comment": "At BGG 2019 played like English 2019 edition then was gifted a copy of the 2019 Expansions 1&2 (New Buildings & The Nobles).",
    "timestamp": 1759356000
  },
  {
    "username": "blake33",
    "rating": 7.4,
    "comment": "5 player game is actually better than Agricola 5 player",
    "timestamp": 1759269600
  },
  {
    "username": "charmed_0215",
    "rating": 7.0,
    "comment": "Legacy",
    "timestamp": 1759010400
  },
  {
    "username": "Pamponiros",
    "rating": 7.0,
    "comment": "Definition of \"7\" for me. Would generally play it with people who know the rules. Quite challenging and thinky with little luck involved. 3rd player provenly has a slight advantage but it's not that bad.",
    "timestamp": 1758664800
  },
  {
    "username": "Beefcake",
    "rating": 7.0,
    "comment": "Mechanics are splendid, only missing player interaction and I wish it was a bit more fun. I really start disliking the fact that the player on the left of the 'worst'player wins most of the time...",
    "timestamp": 1757368800
  },
  {
    "username": "Fierezza",
    "rating": 7.0,
    "comment": "Ersteindruck",
    "timestamp": 1757023200
  },
  {
    "username": "mekane",
    "rating": 7.0,
    "comment": "My rating for this game definitely suffers because I came to it too late. I had already learned and appreciated many games that derived from it. I still enjoyed the learning and playing of Puerto Rico, but I think I actually liked reading about the strategy more than I enjoyed playing the game to discover it myself. I do like the theme and production.",
    "timestamp": 1756850400
  },
  {
    "username": "Nicocolithophoride",
    "rating": 7.0,
    "comment": "Quick game play, lots of interactions !",
    "timestamp": 1756764000
  },
  {
    "username": "parzi42",
    "rating": 7.0,
    "comment": "timeless classic",
    "timestamp": 1756159200
  },
  {
    "username": "rexkow",
    "rating": 7.0,
    "comment": "Such a clasic. Very good game, I played it over and over again for a long time before i got a little bit tired of it. Now i still come back to it from time to time and i have fun every time.\n\nFor some reason our group didn't like the expantions. Specially the one with red \"colonists\". In this one they removed the game end condition about slaves supply running out. It literaly broke the 5-player version. Red colonists make everything cheaper and everyone got a lot of buildings, but nobody got all places covered when we run out of buildings, add this to the fact that picking craftsman is usually very bad and we ended up waiting for the victory points to run out for another 3 hours. What a pain. How could somebody miss it.",
    "timestamp": 1756072800
  },
  {
    "username": "thededalus",
    "rating": 7.0,
    "comment": "I appreciate the mechanics, the player dynamics, and it's influence on the hobby, but the theme doesn't nothing for me at all.",
    "timestamp": 1755727200
  },
  {
    "username": "Dusty27",
    "rating": 6.7,
    "comment": "Fun game",
    "timestamp": 1755036000
  },
  {
    "username": "Arnar146",
    "rating": 7.0,
    "comment": "bga",
    "timestamp": 1754517600
  },
  {
    "username": "Bryle",
    "rating": 6.5,
    "comment": "Group Average: 7.53 / 10\nBryle: 6.75\nDewey: 6.7\nFung: 8.25\nMario: 8\nSixtus: 8\nTom: 7.5",
    "timestamp": 1753740000
  },
  {
    "username": "marpaj123",
    "rating": 6.6,
    "comment": "price 26.98 amazon ordered 9-22-18, first played 9-29-18, last 6-16-19 last played 1-15-22, first time with expansion, and with expansion from now on.",
    "timestamp": 1753394400
  },
  {
    "username": "frotes",
    "rating": 7.0,
    "comment": "was great during it's time, a classic\n\ni feel it has lost a bit of it's charm these days as it is a bit dry and the mechanics aren't as standout anymore",
    "timestamp": 1753221600
  },
  {
    "username": "Alan Chow",
    "rating": 7.0,
    "comment": "It is a classic. The gameplay is simple but the strategy is deep. Still like to play it nowadays although it was released 16 years ago.",
    "timestamp": 1753135200
  },
  {
    "username": "selvalabelva",
    "rating": 7.0,
    "comment": "Brainburn         Longevity    \nLuck impact       Rules/Setup  \nInteraction       Involvement  \n\nAftertaste           Enthusiasm   \n\n Best at 4/5 player count\n Rated base game with additional modules\n Expansions are a plus, not a necessity\n Replayability improved with expansions\n Confrontation: indirect",
    "timestamp": 1751320800
  },
  {
    "username": "JohnGrimes",
    "rating": 7.0,
    "comment": "Viel zu lange nicht gespielt!",
    "timestamp": 1750802400
  },
  {
    "username": "EllenCaroline",
    "rating": 7.0,
    "comment": "used to own",
    "timestamp": 1750802400
  },
  {
    "username": "bsabik",
    "rating": 7.0,
    "comment": "Brilliant but after sixth play in row I was finally bored",
    "timestamp": 1750456800
  },
  {
    "username": "Daniel109",
    "rating": 7.0,
    "comment": "Such a great game bogged down by a questionable (at best) theme. Am looking forward to checking out the 2023 reprint.",
    "timestamp": 1750111200
  },
  {
    "username": "Napattack",
    "rating": 7.3,
    "comment": "3.27\n2-5\nBest at 4\n150 (450)",
    "timestamp": 1749938400
  },
  {
    "username": "radynski",
    "rating": 7.0,
    "comment": "Very accessible but a lot of strategy to be found. I love the different roles that you choose each round and how you have to try to maximize each choice based on what your opponent does or is going to do.",
    "timestamp": 1749160800
  },
  {
    "username": "TheRealDC",
    "rating": 7.0,
    "comment": "Very interesting game and a god father to many games that have come after. It still holds up as a great strategy game and will for many years i expect.",
    "timestamp": 1748901600
  },
  {
    "username": "Redwolf84",
    "rating": 7.0,
    "comment": "Great game, a real milestone in Euro-style board games, though it might be showing its age a bit.",
    "timestamp": 1748901600
  },
  {
    "username": "Zephyr_Falcon",
    "rating": 7.0,
    "comment": "7",
    "timestamp": 1748901600
  },
  {
    "username": "UncleDRW",
    "rating": 7.0,
    "comment": "Puerto Rico has a fascinating and unique game mechanic that draws you in and doesn't let go. Of course, you'll have to overlook the inherent racism of imperialism and colonization that the game projects onto its players--something that many Euro-style games fail to address, sadly. Still, it delivers you into a bygone era and the romance of the time. Captivating fun.",
    "timestamp": 1748556000
  },
  {
    "username": "Jaayse",
    "rating": 7.0,
    "comment": "(used free)",
    "timestamp": 1747951200
  },
  {
    "username": "rainwaffles",
    "rating": 7.0,
    "comment": "Haven't played in like a decade",
    "timestamp": 1747087200
  },
  {
    "username": "Scossa",
    "rating": 7.0,
    "comment": "Owned the deluxe version, too much time setting the game.",
    "timestamp": 1747000800
  },
  {
    "username": "eddieb",
    "rating": 7.0,
    "comment": "total euro, all you are doing is thinking......\nThat was 2 years ago. I could play this over and over now. So much planning. It's amazing.",
    "timestamp": 1746568800
  },
  {
    "username": "betancor",
    "rating": 6.5,
    "comment": "it used to be the best for me many years ago, but nowadays there are much better games in the market",
    "timestamp": 1746309600
  },
  {
    "username": "garbagefan",
    "rating": 7.0,
    "comment": "Android (Isla Rica)",
    "timestamp": 1745704800
  },
  {
    "username": "runnaman",
    "rating": 6.5,
    "comment": "The action selection and progression of this game is really satisfying. It's been replaced by the 1897 version.",
    "timestamp": 1745445600
  },
  {
    "username": "SquarePegIX",
    "rating": 7.0,
    "comment": "Like Agricola, but simpler.",
    "timestamp": 1745359200
  },
  {
    "username": "saar",
    "rating": 7.0,
    "comment": "Fast moving and deep game. Virtually no downtime. Different paths to victory. Excellent game mechanics. A very good game.",
    "timestamp": 1745186400
  },
  {
    "username": "quori82",
    "rating": 7.0,
    "comment": "그냥 테마만 즐기고 제대로 즐겨본 적은 없는 게임. 지금 하면 더 재밌을 것 같긴한데 다른 할 게 많아서…",
    "timestamp": 1745186400
  },
  {
    "username": "lisapc",
    "rating": 7.0,
    "comment": "Need to confirm ovnership",
    "timestamp": 1745100000
  },
  {
    "username": "Fraidei",
    "rating": 8.0,
    "comment": "Great strategic game. Little to no RNG, high amount of strategy. Very complex for newbies tho.",
    "timestamp": 1762124400
  },
  {
    "username": "Derianhorgen",
    "rating": 8.0,
    "comment": "SpielboxRating 9-10. av. 9,73\nThomas",
    "timestamp": 1762038000
  },
  {
    "username": "Joerie",
    "rating": 7.6,
    "comment": "CatBee",
    "timestamp": 1761519600
  },
  {
    "username": "logopolys",
    "rating": 8.0,
    "comment": "alea number 7\n\nOne of my favorite Euros. The constant action combined with tactically subtle screwing is addictive. I love the idea of running my own island with such control.",
    "timestamp": 1761084000
  },
  {
    "username": "mwscarponi",
    "rating": 7.9,
    "comment": "Only negatives are the length of play and the lack of aesthetic quality.",
    "timestamp": 1760911200
  },
  {
    "username": "rozmiarek",
    "rating": 7.5,
    "comment": "An OK game with some clever mechanics and hard choices. Interesting but a bit dry and not too appealing in terms of artwork and components. I do respect its design but because it's a real eye-sore I do not expect it to hit table too often. 7/10",
    "timestamp": 1760738400
  },
  {
    "username": "Cookie316",
    "rating": 7.5,
    "comment": "Good game with tight strategic decisions.",
    "timestamp": 1759874400
  },
  {
    "username": "rhamsterren",
    "rating": 8.0,
    "comment": "Great game. Artwork and theme are so-so, but mechanics are wonderful.\nLots of choices and tactis to win, semi-simultaneous play and bonusses to lure you in.",
    "timestamp": 1759701600
  },
  {
    "username": "hiimjosh",
    "rating": 8.0,
    "comment": "Puerto Rico has fallen for me over time. I will happily play it (and even request it) online however it is a slow, grindy game. It can also go on too long for what it is - a game stops being fun when you realize you've lost and you have an hour to go. It is a nice interactive game, but I don't feel that satisfied at the end of it all. Yet I want to play again and again sometimes...\n\nEDIT: I'm still back and forth on PR even years later. It's a little long and grindy for what it is, but I usually am interested to play again afterwards. It can be difficult to sway the game state significantly in this though, and it feels like you're on a rollercoaster ride (or maybe a merry-go-round)",
    "timestamp": 1759528800
  },
  {
    "username": "bwridge",
    "rating": 8.0,
    "comment": "Definitely a classic...\n\nUPDATE (12-2009): I'm lowering PR from a 10 to a 9. Whilte it is an excellent game, it just doesn't have the same sort of impact on me that the other 10's do. I just don't play it all that much.",
    "timestamp": 1759442400
  },
  {
    "username": "JackHook91",
    "rating": 8.0,
    "comment": "Grande classico. Sempre bello!",
    "timestamp": 1759442400
  },
  {
    "username": "Rogon",
    "rating": 8.0,
    "comment": "h",
    "timestamp": 1758492000
  },
  {
    "username": "stofke",
    "rating": 8.0,
    "comment": "R015",
    "timestamp": 1758492000
  },
  {
    "username": "dominustrick",
    "rating": 8.3,
    "comment": "I feel this game deserves a high rating due to it's interesting use of the roles and it's various implementation of scoring. While the interaction between players seems almost limited to the role choices it's theme simulates additional interaction among players and I feel that it themes itself very well. I really like that out of the box without any customization this game has a lot going on.",
    "timestamp": 1758060000
  },
  {
    "username": "r56ygf",
    "rating": 8.0,
    "comment": "Highest score:\n71 (2p)\n57 Geesje (3p)\n48 (4p)\n54 (5p)",
    "timestamp": 1758060000
  },
  {
    "username": "de Gustibus",
    "rating": 8.0,
    "comment": "The perfect game for folks, like me, who think Agricola is (1) too brain-burning and (2) too dependent on cards.\n\nThe only reason it's not a 10 is because of the tedious setup.\n\nEDIT: Donated away because it doesn't play well with varied experience levels. If you're taking a turn after the new person, you're likely winning.",
    "timestamp": 1757800800
  },
  {
    "username": "rongbeo93",
    "rating": 8.0,
    "comment": "Puerto Rico is one of the purest and most influential action-selection games ever made, setting the standard for countless designs that followed. The mechanics are brilliant—simple to learn yet incredibly deep, where the timing of each action matters not only for your own benefit but also for how it helps or hinders your opponents. This creates a constant layer of tension, interaction, and tough decisions that I really enjoy. The strategy is rich, with many different paths to victory, and every game feels like a mental duel. That said, the theme and art are bland, and the game has shown the need for some common house rules to balance it out. Still, despite its age and flaws, Puerto Rico remains a timeless gem in my collection—an elegant design that proves why it’s considered one of the all-time greats.",
    "timestamp": 1757714400
  },
  {
    "username": "DSmitty",
    "rating": 8.0,
    "comment": "Tough to play with inexperienced players, because they can easily make mistakes that impact everyone else, but it's still one of my favorite worker placement games.",
    "timestamp": 1757628000
  },
  {
    "username": "jerevinan",
    "rating": 8.1,
    "comment": "룰이 너무 어렵지는 않아서 좋다.\n수 싸움을 잘해야한다.\n상대의 이득과 내 이득의 저울질이 중요하다.",
    "timestamp": 1757455200
  },
  {
    "username": "johnjihoonchang",
    "rating": 8.0,
    "comment": "It's a classic and I still really like the action selection and follow the leader gameplay but the presentation is a bit rusty and visually unappealing. I also don't love the theme, but the game is so much fun I'm willing to look past all of this to play.",
    "timestamp": 1757368800
  },
  {
    "username": "Michiel Bertens",
    "rating": 8.3,
    "comment": "X",
    "timestamp": 1757368800
  },
  {
    "username": "Indy500sr",
    "rating": 8.0,
    "comment": ".compleet\nEAN 4005556269402\nIJL5",
    "timestamp": 1757196000
  },
  {
    "username": "Jesse Terrell",
    "rating": 7.9,
    "comment": "8.0/ (bga.)",
    "timestamp": 1757196000
  },
  {
    "username": "Filca",
    "rating": 7.8,
    "comment": "Puerto Rico, I rate it a 7, even though it deserves a solid 8, but I consider it a little below Castles of Burgundy or Trajan, to which I gave a solid 8. Puerto Rico is passion, the first Eurogame I ever played, the one that made me fall in love with this niche.",
    "timestamp": 1757109600
  },
  {
    "username": "Corwin007",
    "rating": 7.5,
    "comment": "3, 4 and 5 player games are all quite different due to how often your turn comes. The nearly total information makes this quite calculable, which for me is pretty awesome. The big problem though is that if there's a bad player they might gift the win to the player to their left.\n\nAfter some recent plays I've started to think that it loses some replayability with age, it could have used some variety in its setup. The expansions playable on BGA are good for this, but they're not available anywhere IRL. And I prefer New Frontiers to it due to some of its mechanisms, and also because it plays really well at two.",
    "timestamp": 1756936800
  },
  {
    "username": "Bozok",
    "rating": 8.0,
    "comment": "Great game, though games do tend to play out similarly. Maybe I've just played this too much. There's also the theme issue...",
    "timestamp": 1756159200
  },
  {
    "username": "Hollafoallah",
    "rating": 7.5,
    "comment": "\"I'll take 'games that could use a re-theme for 200' Ken\"\n\nEnjoying this game does make you weirdly complicit in an abstract yet historically accurate depiction of colonial exploitation and white supremacy. Which is kinda ironic when you realize that this style of low-conflict euro games evolved out of the postwar Germany that was struggling to distance itself from it's genocidey past. Somehow they got back around to atrocities? cmon man",
    "timestamp": 1755900000
  },
  {
    "username": "espoon82",
    "rating": 7.5,
    "comment": "This classic Euro-game has a great reputation for a great reason. It is just about the perfect design and it has a relatively unique theme--though it has since been copied by other games. I highly recommend getting the new buildings to bump up the replayability. All that said--the brown \"colonists\" are a problem. Is this an alternate universe history timeline? Did they seriously have to make the chips brown? This arguably racist thematic choice would make this a game-killer for me, except that it gives us such a great opportunity to talk about the issue.",
    "timestamp": 1755813600
  },
  {
    "username": "Bankler",
    "rating": 8.0,
    "comment": "A classic. Definitely the best new game since Settlers (better, IMO). The role selection mechanic, while not new, really shines. 50 FTF (and 100 BSW) games.\n\nRating -- Suggest",
    "timestamp": 1755554400
  },
  {
    "username": "Song_of_Shield_Lady",
    "rating": 8.0,
    "comment": "波多黎各好玩捏，没有人会拒绝同步行动机制",
    "timestamp": 1755554400
  },
  {
    "username": "CortexBomb",
    "rating": 8.0,
    "comment": "Puerto Rico is a very good game that deservedly has had not just a day in the sun, but rather, several years. The basic concept of this game, action selection is, in one sense, shades of everything that happened in the German game industry for the 5 years that followed its publication, as the tile selection that drives the game here is not far removed from the individual action selection that the workers represent in games like Caylus and Agricola.\n\nPR is a heavily tactical game where 2 mainline strategies exist, one, scoring points by shipping goods, the other, scoring points by buying buildings, preferably the large, end game bonus buildings. Despite the fact that these are relatively known quantities, and have been for years, the game is still compelling.\n\nRating this game is difficult to do now. I haven't played it regularly in years. It was one of the earlier titles that I latched onto, and when I had less than 10 games, it got a hell of a lot of table-time, often 5+ games in a single session, all in a row. My group moved on to the first expansion and crafted a building group that we thought was more interesting using many of those buildings though, and the base game settled at an 8 for me then, though it is a 10 when I can add in the buildings I like from the expansion.\n\nComing back to this many, many years later; I still really like it and don't know when I'll get enough experience to even get that expansion out or the second one (as it is included in the newer edition I have) again. It's the precursor to a lot of later things that I think still plays well and is just fast and interesting once people know how it works.\n\nReally though, if you haven't played this yet, and if you like Euros at all, then you should just go out and buy it. Seriously, buy it. The game is addictive in the early going, and as long as you avoid the plethora of strategy guides that were published over the years you should get double digit plays out of the base game before it starts to seem scripted, easily. A lot of the burnout talk that you see circulating here is fueled by the option of online play, which meant that some people were playing it literally in excess of 1000 times. Other than traditional games like Go and Chess, and perhaps card games like Tichu and Spades I don't know of any games that can stand up to that sort of rigour, so don't shy away from the title because of that. It is one of the most significant imports from Germany, period, and is justifiably recognized as a modern classic.",
    "timestamp": 1755468000
  },
  {
    "username": "Hembba",
    "rating": 7.5,
    "comment": "A really good game. That central action choosing mechanic, in which the active player chooses the stronger version of said action and then all the other players have the option of following suit with weaker version of said action, it works so well. Yeah, it's ALEA game so it doesn't look that good. But everything is functional. With the expansion, setup might become a bit annoying and time consuming, but it also adds replayability enough to justify its place. A classic game.",
    "timestamp": 1755295200
  },
  {
    "username": "Erikk78",
    "rating": 8.1,
    "comment": "This is still a very good game and stands the test of time. The theme feels fitting (although is questionable in our timeframe), it connects with the mechanics. Artwork and aestetics are nice.\nIt is not a gateway game... Tried this some times with 'beginning' board gamers and it was just a bit to difficult to grasp what you can do and how the mechanics work.",
    "timestamp": 1755208800
  },
  {
    "username": "thepinch",
    "rating": 7.8,
    "comment": "Excellent euro game\nVariable Phase Order\nOwn the AE (deluxe)",
    "timestamp": 1754690400
  },
  {
    "username": "ConnerCP",
    "rating": 8.0,
    "comment": "sell",
    "timestamp": 1754431200
  },
  {
    "username": "Doctor_Cowboy",
    "rating": 8.0,
    "comment": "Great intro game to \"real\" board games. Easy to teach and mostly intuitive interactions. Slightly deeper end-game with purple buildings, but more fighting over certain strategies than finding your own path to victory.",
    "timestamp": 1754344800
  },
  {
    "username": "dcomartin",
    "rating": 7.8,
    "comment": "Dan",
    "timestamp": 1754344800
  },
  {
    "username": "Lisa_a_random_nerd",
    "rating": 7.5,
    "comment": "best 4, SOLD",
    "timestamp": 1754344800
  },
  {
    "username": "surrutia",
    "rating": 8.3,
    "comment": "2",
    "timestamp": 1754172000
  },
  {
    "username": "tompen",
    "rating": 8.0,
    "comment": "On the plus side, there are things I admire about this game. I like the theme. I like how the roles and their special priviledges are defined with such a brilliant simplicity. On the other hand, the turn order binding can be very aggravating sometimes. It can be especially frustrating being next to an inexperienced player.",
    "timestamp": 1753740000
  },
  {
    "username": "tai21491",
    "rating": 8.0,
    "comment": "Upgrade?",
    "timestamp": 1753308000
  },
  {
    "username": "Kocmoc",
    "rating": 7.5,
    "comment": "My second \"real\" board game in collection, which everyone seems to like. It is cruel and comforting game at the same time. You can bluff to alter role selecting \n\nMy biggest complain - where is the art?!?!\n\nUpdate - I've printed out and glued new art on the buildings. They are looking way nicer now.\n\n#3-5 #time150min #2008 #tier1\n\n#5p",
    "timestamp": 1753308000
  },
  {
    "username": "holysmoke",
    "rating": 7.5,
    "comment": "Cux",
    "timestamp": 1753221600
  },
  {
    "username": "Flatirons",
    "rating": 8.0,
    "comment": "On BGA.\n\nSetup (0-Slow | 4-Quick): 2/4\nEasy to teach (0-Hard | 4-Easy): 2/4\nPlayer Interaction (0-Solitaire | 4-Plenty): 4/4\nDowntime (0-Long | 4-Short): 3/4\nLuck Influence (0-Swingy | 4-None/Counterable): 4/4\nReplayability (0-Barely any | 4-Almost infinite): 3/4\nFun (0-Boring | 4-Heck Yeah): 3/4",
    "timestamp": 1753135200
  },
  {
    "username": "CotB",
    "rating": 9.0,
    "comment": "Rankings\n18th Best Game 2020\n30th Best Game 2021\n21st Best Game 2022\n24th Best Game 2023\n9th Best Game 2024\n4th Best Game 2025",
    "timestamp": 1762606740
  },
  {
    "username": "ditterio",
    "rating": 9.0,
    "comment": "PUERTO RICO (3-5 players)\n\nSolo: https://boardgamegeek.com/filepage/39937/soloplay-puertorico...\n\nSolo: https://boardgamegeek.com/filepage/268065/botless-solo-varia...\n\nSolo: https://boardgamegeek.com/thread/2993830/puerto-rico-solitai...\n\nA classic!",
    "timestamp": 1762297200
  },
  {
    "username": "teriyakiprince",
    "rating": 9.0,
    "comment": "played a lot",
    "timestamp": 1762210800
  },
  {
    "username": "Ruthless33",
    "rating": 9.0,
    "comment": "Fantastic engine building with role selection. Select action and others follow.",
    "timestamp": 1762038000
  },
  {
    "username": "HerbertML",
    "rating": 9.2,
    "comment": "Great game since nearly ten years. Wonderful mechanics.\n/*#P6*//*stay*/",
    "timestamp": 1761865200
  },
  {
    "username": "Nuvium",
    "rating": 9.0,
    "comment": "A very innovative game at its release, which remains a very good classic.",
    "timestamp": 1761692400
  },
  {
    "username": "Jakub01",
    "rating": 9.0,
    "comment": "Great design with old school (solid) player interaction and minimal downtime.\nSmart.",
    "timestamp": 1761692400
  },
  {
    "username": "GoldenOlaf",
    "rating": 9.0,
    "comment": "Solo",
    "timestamp": 1761606000
  },
  {
    "username": "adamphipps11",
    "rating": 9.0,
    "comment": "2-5 Players\nBest: 4",
    "timestamp": 1761519600
  },
  {
    "username": "ayukene",
    "rating": 9.0,
    "comment": "Original, 2-5 players, 90-120 min, SPA\nContains San Juan",
    "timestamp": 1761429600
  },
  {
    "username": "joanmoreno",
    "rating": 9.0,
    "comment": "Uno de mis juegos favoritos de siempre. Me sigue encantando que todos los jugadores participen en el turno de los demás y realizando la misma accion, con todo lo que ello conlleva.",
    "timestamp": 1761429600
  },
  {
    "username": "Jyerlin",
    "rating": 9.0,
    "comment": "相較於其他款同類型桌遊而言，這款比較好入手，好玩~",
    "timestamp": 1761343200
  },
  {
    "username": "Mykola_Ku",
    "rating": 9.0,
    "comment": "На продаж",
    "timestamp": 1760911200
  },
  {
    "username": "wangwei726",
    "rating": 9.0,
    "comment": "最佳4人 不想玩",
    "timestamp": 1758751200
  },
  {
    "username": "peterlevi",
    "rating": 9.0,
    "comment": "(open)\n\nFinally played this classic, and I see it's a classic for reason. Very positive impressions after first game at 4p:\n- Short turns, quick play\n- A lot of player interaction - with the role choices, \"specializing\" the ships, race for trading, race for some buildings\n- Focused scoring - not a point salad with a gazillion unrelated point sources\n- Good balance between tactical and strategic aspects\n- Functional components\n- Well-written rulebook\n\nI like but don't love RFTG, which is a derivative game, but the amount of player interaction makes Puerto Rico much more interesting to me.",
    "timestamp": 1758232800
  },
  {
    "username": "kwhite1",
    "rating": 9.0,
    "comment": "P",
    "timestamp": 1758060000
  },
  {
    "username": "dvhill",
    "rating": 9.0,
    "comment": "Finally got to play this, and it meets your expectations. So great.",
    "timestamp": 1757887200
  },
  {
    "username": "AlPacino11",
    "rating": 9.2,
    "comment": "Best balance between simplicity and complexity.",
    "timestamp": 1757800800
  },
  {
    "username": "apostolaras1971",
    "rating": 9.0,
    "comment": "",
    "timestamp": 1757541600
  },
  {
    "username": "geordienp",
    "rating": 8.5,
    "comment": "Most plays on-line during lockdown.\nI was addicted to this on BoardGameArena thanks to the first Covid Lockdown, a far deeper game than I had realised. But the game is fundamentally flawed in that it is heavily dependent on turn order if the players have differing experience. Going before a strong player and/or following a weaker player or someone less familiar with the game is a huge and likely game-winning advantage particularly at lower player counts. Shame too about those so-called 'colonists'. A game about the slave trade is most definitely not PC.",
    "timestamp": 1757023200
  },
  {
    "username": "timetrip",
    "rating": 8.5,
    "comment": "Early role selection type game. Interesting to play because it's kind of hard to wrap your head around the strategies to winning the game. Just the experience of making it through the game is fun for early plays.",
    "timestamp": 1757023200
  },
  {
    "username": "NairHotel",
    "rating": 9.0,
    "comment": "This is just a very good game. It actually takes a long time to fully comprehend WHY you want to do anything in this game. Every action has a purpose, and figuring out how to benefit from everything that other players want to do is the key to victory. Finding niches that benefit you more than others is something that takes a while to learn. Colonization bad, game good. Also Race for the Galaxy is the same as this game, but shorter and more random. I learned a LOT about the strategy of this game from playing Race for the Galaxy",
    "timestamp": 1756764000
  },
  {
    "username": "SVan",
    "rating": 9.0,
    "comment": "The cleanest designed game I've played. Looks intimidating, but pretty easy to play and many strategies to use. It's an instant classic.",
    "timestamp": 1756677600
  },
  {
    "username": "sorcretic",
    "rating": 9.0,
    "comment": "Feb. 2025 #14: Lately I've really been enjoying games that do a lot with only a few different actions. These aren't \"search\" games where a huge decision space must be navigated to find a great combo. Rather, small actions are strung together in a way that is hopefully more than the sum of its parts. Sequencing and timing actions is often the key to these games. They often use rondels or the under-utilized role selection to throw wrenches into that timing. In my opinion, Puerto Rico is still the best of the bunch.\n\nWith only 6-7 actions, PR is still able to achieve layers of tactics and strategy. Because everyone else will do the same action as you, each turn feels like an agonizing I-split-you-choose game. Each action must be considered carefully so that other players do not benefit too much--you are always asking what does it net me vs. everyone else? PR was one of the first engine builders, but this is highly interactive engine building, where predicting, countering, and piggybacking other players' actions is one of the keys to success.\n\nJul. 2024 #10\n\nJan. 2024 #7: Puerto Rico is the highest-ranked game on this list that I've played exclusively on BGA, but I expect to love it in person as well. While it's not quite as interactive as the preceding six games--a lot happens on player boards--the juice in this game comes from evaluating everyone else's position in order to pick the action that most benefits you without significantly helping anyone else. It's the ultimate I-cut-you-choose game, in other words, and that's a tension I absolutely love in board games.",
    "timestamp": 1756504800
  },
  {
    "username": "BuzziBilly",
    "rating": 8.5,
    "comment": "That's a solid 8.5. Many years ago would have been a 10. Suffers from the time passed... but still is a super game that changed the history of boardgaming!",
    "timestamp": 1756072800
  },
  {
    "username": "Takhyon",
    "rating": 8.5,
    "comment": "Took me ten years in the hobby before playing this, and yeah it’s really good and still holds up, who would’ve thought? I wouldn’t necessarily call it OG style due to the fact that it’s a bit heavy on personal player boards and resource management, plus there’s definitely some unintuitive rules cruft, mostly regarding the captain role and all the minutiae regarding the different buildings. Thankfully though the star of the show is still the phase selection and how that influences the interaction, game tempo, and many dynamics between players.\n\nIt plays very smooth and snappy throughout with barely any upkeep, the only minor annoyance being that counting up empty building slots for filling up the available workers is mildly annoying. With regards to some of the most common complaints, I can definitely understand the critique about how skill disparities between the players would lead to some lopsided sessions, and yeah the production quality is definitely typical Alea garbage. The Awaken Realms version will likely be 80% overproduced nonsense, but likely useful for salvaging some components with thicker cardboard and better art.",
    "timestamp": 1755813600
  },
  {
    "username": "Hadgoth",
    "rating": 8.5,
    "comment": "Brilliant game! If only I could find people to play it with regularly :-(",
    "timestamp": 1754863200
  },
  {
    "username": "Lauron The Dark Lady",
    "rating": 9.0,
    "comment": "De Fernando.",
    "timestamp": 1754344800
  },
  {
    "username": "ThirdStringHero",
    "rating": 8.8,
    "comment": "4",
    "timestamp": 1754172000
  },
  {
    "username": "cjeffery55081",
    "rating": 8.5,
    "comment": "Heavily impacted by upper hand player. If each player knows what they are doing, it is a fun strategy game with 4-5 players. (Did not have a chance to play with 3 yet.)",
    "timestamp": 1753826400
  },
  {
    "username": "amin91",
    "rating": 9.0,
    "comment": "Perhaps the most entertaining board game of all time, with nothing to do with luck whatsoever. Different strategies can be leveraged throughout the games with a simple learning curve. I liked the original version than the newer version of Puerto Rico, but I guessthe newer ones fall into the same category with slight graphics and perhaps gameplay improvement.",
    "timestamp": 1753740000
  },
  {
    "username": "chadgibbons",
    "rating": 9.0,
    "comment": "Walls Storage",
    "timestamp": 1753394400
  },
  {
    "username": "Vic Thiessen",
    "rating": 9.0,
    "comment": "11",
    "timestamp": 1752703200
  },
  {
    "username": "bfrizb",
    "rating": 8.5,
    "comment": "I respect the high game variety despite being purely deterministic",
    "timestamp": 1752184800
  },
  {
    "username": "fromeea",
    "rating": 9.0,
    "comment": "Justin Heimer: 8 (Justin owns)\nRosalie Phillips: 8\nAmy Peschong: 9\nJohn Jansma: 6\nEirik Ackerman: 8\nCharlie McCarron: 7.5;\nJeff Lueth: 7;8;",
    "timestamp": 1752012000
  },
  {
    "username": "Happymrdave",
    "rating": 9.0,
    "comment": "Used to be a 9 but reduced over time. Still a solid game but some of the shine has worn off over time due to a limited number of strategies. It's still excellent when played with a group of experienced players but it does suffer from a large amount of buildings that just plain aren't good.",
    "timestamp": 1751839200
  },
  {
    "username": "NVerter",
    "rating": 8.5,
    "comment": "Elección rol 4J / 5J\n\nJUEGO MC PRIM-VER '21\nJUEGO MC OTOÑO '21\nJUEGO MC PRIMAVERA '25",
    "timestamp": 1750802400
  },
  {
    "username": "artman_russian",
    "rating": 9.0,
    "comment": "1 партия. Оценка предварительная.",
    "timestamp": 1750284000
  },
  {
    "username": "postkarma",
    "rating": 9.0,
    "comment": "(Will) Two player only. Well, maybe.",
    "timestamp": 1750024800
  },
  {
    "username": "jakoozzi",
    "rating": 8.5,
    "comment": "Overall a great game, doesn't get to the table much.\nWould like to upgrade to newer version",
    "timestamp": 1749938400
  },
  {
    "username": "Geroid",
    "rating": 9.3,
    "comment": "Rating based on 2 player games with the official 2 player rules, link below, and a modified version of that. So many games have taken inspiration from PR. It also feels like a modern game.\nhttps://boardgamegeek.com/article/31846338",
    "timestamp": 1748296800
  },
  {
    "username": "Karl_",
    "rating": 9.2,
    "comment": "No Words.",
    "timestamp": 1748296800
  },
  {
    "username": "kobrien29",
    "rating": 8.6,
    "comment": "An engine building classic. A bit more variety on winning strategies would be nice -- probably on me to learn the expansions. Too chess-y with 2p, best with 3p of equal rank.",
    "timestamp": 1748210400
  },
  {
    "username": "SphericalMusic",
    "rating": 9.0,
    "comment": "+ New Buildings & Nobles expansion",
    "timestamp": 1747692000
  },
  {
    "username": "Darigaaz",
    "rating": 10.0,
    "comment": "Should I keep only three worker placement game, Puerto Rico would be one of them. Especially because I own the Deluxe edition which greatly improves on the main issue of the standard edition : its aesthetics.\nIt is an all-time classic and its gameplay never aged.",
    "timestamp": 1762630800
  },
  {
    "username": "YUANCYL",
    "rating": 10.0,
    "comment": "雖然很燒腦，但會讓人想一玩再玩的遊戲，每一次都會有新的體悟，不斷地轉換思考策略。",
    "timestamp": 1761343200
  },
  {
    "username": "ginkhoma",
    "rating": 10.0,
    "comment": "Don ludothèque",
    "timestamp": 1760824800
  },
  {
    "username": "FireManBearPig",
    "rating": 10.0,
    "comment": "The New Buildings, and The Nobles stored in base box - this copy is set up for 4-player game.\n\n[DUPLICATE]\n[CONSIGNMENT]\n\nDuplicate (base game only) set up for 2-players for trade; duplicate on consignment.",
    "timestamp": 1760047200
  },
  {
    "username": "asfhgwt",
    "rating": 10.0,
    "comment": "A superb, solid and serious game (albeit over-analyzed and over-played). What others do almost matters more than what you do. Much of the time your role selection is practically forced and involves no real choice; for example, if you take Craftsman you'll probably get screwed when the next player takes Captain. (The whole game seems to be funneled through the Craftsman, by the way.) Having said all this, I do admit that the better players seem to win most of the time.... PR is certainly a masterpiece -- and the best game of 2022.",
    "timestamp": 1758578400
  },
  {
    "username": "OGRussHood",
    "rating": 9.6,
    "comment": "My 2025 Top 250: #180\nMy 2024 Top 250: #196\nMy 2023 Top 250: #166\nMy 2022 Top 250: #74\nMy 2021 Top 250: #39\nMy 2020 Top 250: #24\nMy 2019 Top 200: #28\nMy 2018 Top 100: #34",
    "timestamp": 1758492000
  },
  {
    "username": "Minh_Nguyen",
    "rating": 9.5,
    "comment": "I love the almost deterministic FSM feel of this game, and its capacity for analysis. Some buildings seem mispriced and thus see less play than others, and seat position might have too large an impact. Highly textured, especially for a game that has such a strong reputation for being scripted and a game that has \"only\" two ways to win. Perfect example of a game with simple rules that immediately gets out of the way and lets the players play against each other rather than against the game, and its hard to come up with any more recent games that accomplish that so cleanly. I own everything for this game, but my copy actually doesn't see the table that much, and I really don't have any desire to play the expansion content that I own. I'm actually fine with that as I'm perfectly happy playing as much as I want of the base game against competent opponents online. In terms of how much I enjoy playing this, it's an easy 10. It gets dinged slightly because of the mispricing of certain buildings.",
    "timestamp": 1756764000
  },
  {
    "username": "marinexx",
    "rating": 10.0,
    "comment": "The the third most strategic game I've played after chess and GP/TM... But you can't play chess with 5. REALY want the 10th anniversary edition. Hope they reprint a 20th anniversary or something.\n\nEdit: they did but it was trash. Currently waiting for the AR special edition, that would be the best game ever!",
    "timestamp": 1756677600
  },
  {
    "username": "Muppetus Galacticus",
    "rating": 10.0,
    "comment": "Archived",
    "timestamp": 1755900000
  },
  {
    "username": "larryonov",
    "rating": 10.0,
    "comment": "Best: 4, 3, 5",
    "timestamp": 1755208800
  },
  {
    "username": "smit2174",
    "rating": 10.0,
    "comment": "One of the best of all time.",
    "timestamp": 1753740000
  },
  {
    "username": "Dangief",
    "rating": 10.0,
    "comment": "Although this one has not been played in forever, I still hold it up as one of the greatest game designs of all time.\n\nIt's only real flaw is that you really need to have players of equal skill, but if you do, this is one of the greats, and with no downtime!",
    "timestamp": 1753394400
  },
  {
    "username": "dbc65",
    "rating": 10.0,
    "comment": "When people hear about my large board game collection, they often ask me what my favorite game is. I have a hard time answering, but sometimes I say the game whose design I admire most is Puerto Rico. The game feels dated somewhat today, but I always found it surprisingly thematic -- I find that I feel like I'm doing what the game says I'm doing.\n\nThe interaction amongst the roles is really well done -- this was the first game I remember thinking that every move I make impacts everyone else's game and my own turns down the road.",
    "timestamp": 1753221600
  },
  {
    "username": "bandit_boy7",
    "rating": 10.0,
    "comment": "NOTE: Swapped-out player boards & role placards, with my PR Anniversary game.",
    "timestamp": 1751839200
  },
  {
    "username": "jojondro",
    "rating": 10.0,
    "comment": "Revisado",
    "timestamp": 1751234400
  },
  {
    "username": "Bluejay355",
    "rating": 10.0,
    "comment": "Borrowed from library; has Forest Dweller expansion (did not try). Played 2 player varient where we took turns choosing 2 roles--not getting the perk in the second choice, unless choosing prospector. Played with 50 colonists, and 50 VP avalible, but ended game by building 12th building without initally realizing it. Whoops haha",
    "timestamp": 1751061600
  },
  {
    "username": "SiddGames",
    "rating": 10.0,
    "comment": "g3 b4 g5\n60-90m\nrtp\n\nLove it. Very little randomness yet each game plays out so differently. I really like the tactical nature of this game, how each player's every move adjusts the position of the board. A classic Euro that I'll always admire.\n\n_store_GR_BS_1-6",
    "timestamp": 1750284000
  },
  {
    "username": "saxy1425",
    "rating": 9.5,
    "comment": "This is such an amazing game and controversy be damned! This game is so tightly designed and deceptively conplex that it makes such a juicy experience. My wife and I will pull this out every other week for a battle of governors.\n\nThis game is fantastic and a must have for anyone wanting to play board games. I would argue that this game is a great game to use as a gateway boardgame for anyone aspiring to graduate from Catan. You will learn board game mechanics that have been replicated throughout many over the past 20 years. I will always be up for a game of this!",
    "timestamp": 1749506400
  },
  {
    "username": "caoc120603",
    "rating": 9.5,
    "comment": "I love this game. It is simple yet wonderfully tactical. The only issue is the newbie effect in that a newbie will never win against an experienced player as there are certain routes to victory. That said that's a good reason to play it more so everybody becomes experienced!",
    "timestamp": 1749247200
  },
  {
    "username": "PoirotsMustach",
    "rating": 9.5,
    "comment": "I discovered this gem in 2025 on (board game arena).\nThe gameplay is so elegant and enjoyable that I now understand why this was so lauded and praised for years and years.\nIt truly is a masterpiece of a game.\n\nAfter experiencing this game I also imediately ordered a used copy of San Juan (as I think it should play better at 2 players and in shorter amount of time). These thing (along with the physical quality of the components of which I've read a lot of criticism) are the only downside of this game and why I score the the game as 9.5/10.",
    "timestamp": 1748728800
  },
  {
    "username": "shannyn_north",
    "rating": 10.0,
    "comment": "Chris Wray 8.5\nI have the iOS version. Good game, although I prefer San Juan. For a more similar gameplay, I prefer Agricola.",
    "timestamp": 1748642400
  },
  {
    "username": "Dvs08",
    "rating": 10.0,
    "comment": "All-time classic and the pillar of modern board games. Unsurpassed in many ways. A simple must have for everyone. Expansions add a lot of replayability to an already amazing game. Refreshing artwork.",
    "timestamp": 1748124000
  },
  {
    "username": "newtonnitro",
    "rating": 10.0,
    "comment": "Lançado em 2002 por Andreas Seyfarth, *Puerto Rico* é um marco dos jogos de tabuleiro modernos. Combinando mecânicas elegantes e decisões estratégicas, o jogo se destaca como um dos melhores eurogames já criados.\n\nAmbientado na era colonial, cada jogador assume o papel de um governador na ilha de Porto Rico. O objetivo é acumular pontos de vitória por meio da produção e exportação de mercadorias, além da construção de edifícios. A mecânica central gira em torno da escolha de papéis, como \"Construtor\", \"Prefeito\" ou \"Capitão\". Cada papel oferece uma ação específica, e todos os jogadores participam dela, mas quem escolhe ganha um benefício extra. Isso exige planejamento e antecipação das jogadas dos adversários.\n\nA interação entre os jogadores é sutil, mas constante. As escolhas de papéis e ações afetam diretamente as opções disponíveis para os outros, promovendo uma competição estratégica sem confronto direto. A ausência de elementos aleatórios, como dados ou cartas, reforça a ênfase na habilidade e no planejamento.\n\nA rejogabilidade é outro ponto forte. Com diversas estratégias possíveis e a necessidade de se adaptar às ações dos adversários, cada partida oferece uma experiência única. O equilíbrio entre diferentes caminhos para a vitória mantém o jogo desafiador e envolvente.\n\n*Puerto Rico* recebeu inúmeros prêmios e reconhecimentos, incluindo o Deutscher Spiele Preis e o International Gamers Award. Por anos, liderou o ranking do BoardGameGeek, consolidando sua posição como um clássico.\n\nEm resumo, *Puerto Rico* é um jogo que combina profundidade estratégica, mecânicas bem elaboradas e alta rejogabilidade. É uma escolha excelente para jogadores que apreciam desafios intelectuais e decisões significativas a cada turno.",
    "timestamp": 1747173600
  },
  {
    "username": "shaveandahaircut",
    "rating": 10.0,
    "comment": "[27 plays] I sometimes catch myself thinking about this game for days afterward. I enjoy everything about it. Our wives enjoy the game and play it fairly competitively - so that is a big plus. PR is highly ranked because a wide variety of individuals have found it to be a fun and interesting game of strategy, it is as simple as that. It is a solid game with minimized luck and plenty of fast turns that keep all players involved. I enjoy the mechanics and theme - I really get the feeling I'm building a colonial enterprise.\n\nHave played the 2 player variant 6 times {as of July '24) and I'm highly impressed that the game remains such a tight and tense contest.\n\nThe Alea expansion with the nobles is a nice addition to the game.\n\nMost recent plays May 2025",
    "timestamp": 1746223200
  },
  {
    "username": "Negarville",
    "rating": 10.0,
    "comment": "Puerto Rico is one of the few games I’ve ever truly studied. I still remember a weekend where my friend and I played 20 games back to back, trying to figure out the best strategies to score the most points, and just as importantly, how to disrupt those strategies.\n\nI love Puerto Rico as a 1v1 game, but it also shines with more players, where you have to constantly adapt and outmaneuver your opponents. Even today, it remains my favorite implementation of the “choose an action and everyone does it, but you get a bonus” mechanic. The decisions feel meaningful, and the bonus really matters. Sometimes you’ll pick an action to give yourself the edge, and other times you’ll choose something that isn’t ideal for you just to leave another player stuck with nothing to do.\nPuerto Rico deserves all the praise it gets.",
    "timestamp": 1745532000
  },
  {
    "username": "thespaniardsteve",
    "rating": 10.0,
    "comment": "2-5, 4",
    "timestamp": 1745445600
  },
  {
    "username": "Tom_Civic",
    "rating": 10.0,
    "comment": "Competitive",
    "timestamp": 1745445600
  },
  {
    "username": "gilles355",
    "rating": 10.0,
    "comment": "Je considère ce jeu comme le point de bascule entre les vieux jeux et les jeux de société moderne.",
    "timestamp": 1744581600
  },
  {
    "username": "AfarOca",
    "rating": 10.0,
    "comment": "JUGADORES: 4\nTIEMPO: 90-150\n\nPARTIDAS GANADAS/PERDIDAS\nOca 5/6\nVirgy 2/8\nConchi 1/0\nAlex 1/0\nFénix 1/1\nNarom 1/2\nPepon 0/2\nJaviJavi 0/2\nManolo 0/1\nRiDeRWiND 0/1\nDavid 0/1\nCondor 0/1\nDaniel (Condor) 0/1\nFina 0/2",
    "timestamp": 1744581600
  },
  {
    "username": "cubntin",
    "rating": 10.0,
    "comment": "3-5 players",
    "timestamp": 1743372000
  },
  {
    "username": "Argoxz",
    "rating": 9.5,
    "comment": "The old man, the classic, the mothership... twenty years and still shining with is simplicity and infinite ways of concluding a game. It's not about pirates, but... aarhhhhhh!",
    "timestamp": 1743116400
  },
  {
    "username": "Zouzou825",
    "rating": 10.0,
    "comment": "I own 2020 version of this game. It's simply classic and a must have.",
    "timestamp": 1742943600
  },
  {
    "username": "Card",
    "rating": 10.0,
    "comment": "Best with 4 (2-5) 90-150 mins, Age:12, 3.27 [$40]",
    "timestamp": 1742338800
  },
  {
    "username": "bnordeng",
    "rating": 10.0,
    "comment": "Still my favorite game thus far. I've since played some fantastic games like Caylus and Brass and Twilight Struggle. But, Puerto Rico remains the best due to its depth and accessibility in one package. There are so many impacts from every decision and so many different strategies to win. Using some buildings from the expansion gives the game a nice little twist.",
    "timestamp": 1741993200
  },
  {
    "username": "ChipChuck",
    "rating": 9.5,
    "comment": "The game that introduced us to euros and hobby gaming. Great game worthy of all praise.",
    "timestamp": 1741561200
  },
  {
    "username": "ryder",
    "rating": 9.5,
    "comment": "",
    "timestamp": 1741388400
  },
  {
    "username": "john95",
    "rating": 10.0,
    "comment": "Fantastic game! Very strategic, but intuitive as the game goes on.",
    "timestamp": 1739574000
  },
  {
    "username": "rubendario5",
    "rating": 9.5,
    "comment": "4P",
    "timestamp": 1737846000
  },
  {
    "username": "alki",
    "rating": 10.0,
    "comment": "Expansion\nPuerto Rico: Expansion I – New Buildings\nPuerto Rico: Expansion II – The Nobles",
    "timestamp": 1737759600
  },
  {
    "username": "meeple_kmilo",
    "rating": 10.0,
    "comment": "Está chévere, pero siento que le falta algo, un \"yo no sé qué, que no sé dónde\"",
    "timestamp": 1737241200
  },
  {
    "username": "beardandglasses",
    "rating": 9.5,
    "comment": "Wow. Great fun. This game is a masterpiece. Thrift/yard sale find (2 different copies)",
    "timestamp": 1736290800
  },
  {
    "username": "ShiannLin",
    "rating": 10.0,
    "comment": "2002 Spiel des Jahres Nominee",
    "timestamp": 1736204400
  },
  {
    "username": "rafaelpaz",
    "rating": 10.0,
    "comment": "Elegance, fluidity, strategy, interaction and fun... everything a game needs to be a 10, Puerto Rico has it to the max.\nThis is from the time when Euros were really good - that is, they had a lot of interaction and excitement!\nA timeless game!",
    "timestamp": 1735858800
  },
  {
    "username": "Chrysologus",
    "rating": 10.0,
    "comment": "This was the best Eurogame until Agricola. Still great, just watch out for craftsman angst.",
    "timestamp": 1735772400
  }
]