[
  {
    "username": "Floating World",
    "rating": 1.0,
    "comment": "New editions should not be ranked",
    "timestamp": 1754172000
  },
  {
    "username": "ZacBobisKing",
    "rating": 1.0,
    "comment": "Why was the app delisted",
    "timestamp": 1723586400
  },
  {
    "username": "MichalSzymankiewicz",
    "rating": 1.0,
    "comment": "Ugly and boring",
    "timestamp": 1720821600
  },
  {
    "username": "emperor123",
    "rating": 1.0,
    "comment": "Bad one comparing to original from 2007.",
    "timestamp": 1718920800
  },
  {
    "username": "hanguoren",
    "rating": 1.0,
    "comment": "Revised for what? Just seems worse for people that bought/supported the original game.",
    "timestamp": 1712354400
  },
  {
    "username": "Thrift Thopter",
    "rating": 1.0,
    "comment": "Unlike something like the Dominion 2nd Editions, which I also like less than their originals, this offers nothing that I'd want to combine with the original version. It only removes content and replaces it with with a lesser amount of worse content.",
    "timestamp": 1701730800
  },
  {
    "username": "BoardGamingCouple",
    "rating": 2.0,
    "comment": "2/5\n\noutdated classic that doesnt have much variety in player choice.",
    "timestamp": 1735254000
  },
  {
    "username": "Desigual",
    "rating": 2.0,
    "comment": "Too many things to do in such a short time. I didn't feel happy playing it and hate to feed the workers. The components of this version it's better than the old version.",
    "timestamp": 1712700000
  },
  {
    "username": "GarfieldKlon",
    "rating": 2.0,
    "comment": "I don't like this kind of games.",
    "timestamp": 1712613600
  },
  {
    "username": "ergoqed",
    "rating": 2.0,
    "comment": "Take a reed. Grab a wood. Make a baby—except don’t, because someone else did the deed first and now you can’t shag. Oops, now you don’t have enough actions. Starve.\n\nHistory will judge this game.",
    "timestamp": 1688335200
  },
  {
    "username": "Medvick",
    "rating": 2.0,
    "comment": "loved the game the first time; but so many damn rules and takes forever to teach that I just gave up half-way through and said I will never teach this game again. Way too many cards, way too many options, always feeling like I missing a turn and losing.. Just so AP and frustrating",
    "timestamp": 1577746800
  },
  {
    "username": "gardi",
    "rating": 2.0,
    "comment": "I am seldom fan of fixed number of round games. Couple this with \"one strategy beats all\" problem and my rating plummets. I prefer Caverna over this any day.",
    "timestamp": 1559772000
  },
  {
    "username": "emoprzemoc",
    "rating": 3.0,
    "comment": "SORRY everyone, but it's just like in the descrition of 3/10 rating here on BGG: most likely I won't play it anymore (BUT maybe someone will convince me to it). I base my rating on a few (3? 4?) solo plays only. There's a lot of great ideas here, lots of cards and stuff, but i feel punished for just anything i do here. I couldn't even suggest others to play it together afterwards. I know there are people who got into the hobby by starting with 'Agricola', but they just seem like complete weirdos to me. If this was my first ever modern board game, I'd quit tabletop gaming in a second. I want to have FUN.\n\nThere is a chance that it's a better game when played with other players. Solo variants are usually challenging and meant for people who know the game and how to win, so if 'Agricola' is already tough because of feeding phase in a multiplayer game (like I heard many times before), then it's probably even worse in a solo game, and that's the only gameplay variant I know... and there's a few mid-heavy Euro games that I first learnt in their solo variants and they were hard, especially in the first solo match, but it felt more fair - and the next time it was already much easier to play.\n\n+ animeeples, a lot of wooden components\n+ theme\n+ lots of unique cards\n+ falls somewhere in between of game and simulation, so the theme isn't absurd in context of gameplay\n\n- ...but i don't want the simulation part...\n- ...because it means it's always so hard to do anything here and i feel like any step forward is a step on a rake and you take two jumps back because of it\n- i just wanted fun, and what i got feels more like work or a tiresome assignment. there are games where resources are scarce, economy is tight, and your choices limited that are still fun despite all of this; in such games thinking about your move is rewarding in the end, here - it's punishing.",
    "timestamp": 1747260000
  },
  {
    "username": "lefthandedsquat",
    "rating": 3.0,
    "comment": "This game suffers from a distinct lack of fun. Not my thing.",
    "timestamp": 1741129200
  },
  {
    "username": "JustAModestMan",
    "rating": 3.0,
    "comment": "While still a solid game in its own right, it remains a puzzle why they decided to revise most of the actual fun out of Agricola's experience.",
    "timestamp": 1686780000
  },
  {
    "username": "ggruetze",
    "rating": 3.0,
    "comment": "Feels like work not fun",
    "timestamp": 1668466800
  },
  {
    "username": "jonny ringo",
    "rating": 3.0,
    "comment": "One of the most overrated games ever. It boils down to a fight over wood, cuz you need wood to build 80% of your farm. By the time everyone is done fighting for wood in the first rounds, you wasted the opportunity to get food for your family, and you starve. By the time you actually get a decent working engine, the game is over. Plus, if you play this with the same people, it just turns into the same game every time. Everyone just keeps doing the same things in every game. If you play with new people, if becomes lopsided cuz the new people don’t know any of the strategies. Then they don’t want to play again. If this sounds like fun to you, then give it a try. Not for me, though.",
    "timestamp": 1665093600
  },
  {
    "username": "cfarrell",
    "rating": 3.0,
    "comment": "I revisited this in 2021 after a long break, when it went online at BoardGameArena. This was a game I never loved back in the day, but liked enough. So I was a little surprised how much I *hated* it, playing it again now. There are a lot of reasons that are hard to catalog in a short BGG comment block, but I think the big one is just how totally screwed you can be by the turn order. Taking the start player space is very expensive unless you have good, usable minor improvements in hand so getting dealt a few of these vs none is a huge deal both in terms of your chances of victory as well as your ability avoid grinding frustration. I’m also reminded of playing with a friend who consistently highly overvalued the importance of going first, so would frequently take the start player even if he was going second; if he was sitting on your right you were just utterly and completely screwed. And this is just one thing about the game.\n\nAnyway. I never need to play this again.",
    "timestamp": 1656540000
  },
  {
    "username": "latschediwes",
    "rating": 4.0,
    "comment": "You assign workers to spaces on the board to gain ressources, then spend ressources to gain victory points. This is done in a dry, repetitive and heads-down fashion, where players tinker with their individual boards and merely interfere with each other. If you have played 'hobby' board games over the past few years, this probably sounds like something you have seen countless times.\n\nAnd Agricola is no different. The main activity consists of counting with restricted pieces and further restricting each others' actions with blocking the ones already taken. The overall impression is that it feels like a problem to solve and the task is closed, i.e. the optimal path is always calculable.\n\nEmotional and creative involvement is low - All I can remember out of a dozen plays is the nice physicality of a developed tableau and the simple enjoyment of placing sheep on pastures. This is actually one nice apect of the game. When it's finished, the fully equipped game board tells a story. It's just not a particularly entertaining or memorable story.\n\nIn the context of later releases it appears comparatively tense and more focussed, but it's still a non-interactive and mentally demanding excercise about learning a scoring system.",
    "timestamp": 1748296800
  },
  {
    "username": "Sidekicken",
    "rating": 4.0,
    "comment": "Playing this gives me anxiety and that isn't why I play board games.",
    "timestamp": 1745445600
  },
  {
    "username": "MinisterNarwhal",
    "rating": 4.0,
    "comment": "In my opinion, the best thing that Agricola had going for it was its capacity for interesting storytelling. The actual gameplay part was unfortunately pretty annoying.",
    "timestamp": 1734562800
  },
  {
    "username": "neiglib",
    "rating": 4.0,
    "comment": "+ 목가적인 분위기의 아트웍, 게임디자인\n+ 일꾼놓기 메커니즘과 잘 어우러지는 테마\n- 골고루 잘해야하는 득점 체계로 인한 자유도 부족\n- 자유도와 연계되는 문제로 나만의 농장 만들기 불가능\n- 꾸준히 파지 않는 이상 진입장벽으로 느껴지는 14장의 카드 콤보 플레이",
    "timestamp": 1733094000
  },
  {
    "username": "secondofthenew",
    "rating": 4.0,
    "comment": "I respect the game but I don't like the difficulty of putting card combos together. It's possible I might like it more solo, but I don't think I'd prefer it over Nusfjord or even Glass Road at that count.",
    "timestamp": 1713304800
  },
  {
    "username": "Epochend",
    "rating": 4.0,
    "comment": "Somewhat overwhelming to trudge through, and punishes you harshly if you don't cover all your bases; probably a bit like running a real farm. Occasionally satisfying when your plans come together, but for the most part it's a game that beats you over the head with reasons why you can't do things, instead of giving you fun things that you can do.",
    "timestamp": 1712527200
  },
  {
    "username": "Ephorus",
    "rating": 5.0,
    "comment": "What I like:\n- Lots of variability through training and small improvements.\n- There is always so much more you want to do, but cannot. So you have to prioritise hard and think a few turns ahead.\n- The family support mechanism adds a real element of tension to the game. You might want to do something else, but getting some sheep or fish instead for a quick food boost can give you some freedom of choice in the next few rounds.\n- Quite interactive in the sense that you have to watch out for other players and sometimes block certain action spaces.\n\nWhat I dislike:\n- Sometimes I wish the game was a bit shorter.\n- It's quite fiddly to place new resources on the action board each turn.\n- Still, not the most interactive. I think solely about my actions instead of keeping track of the special abilities of other players. Usually a no go for me and probably one of the reasons I'm currently not eager to play the game.\n- New players will be absolutely destroyed by more experienced players.\n\nWhy I culled it:\nI played it quite often with a friend, but the steep learning curve and long-ish playing time led to a state, in which I never seriously thought about proposing to play it with others.",
    "timestamp": 1762038000
  },
  {
    "username": "Urbanwatts",
    "rating": 5.0,
    "comment": "This has not aged well. I'd rather play any other Uwe game.\n\nIn his most recent title, the economy still feels right but you actually get to do stuff.\n\nTo me, Agricola was a good first draft and Uwe Rosenberg clearly improved the idea with his other releases.",
    "timestamp": 1756764000
  },
  {
    "username": "Dasoogle",
    "rating": 5.0,
    "comment": "2-4 players only.\n\nSuper challenging but very fun and immersive. Hard to get to the table",
    "timestamp": 1755813600
  },
  {
    "username": "purplecow55",
    "rating": 5.0,
    "comment": "Players player multiple rounds placing workers in this engine building game. On a players turn, players will place a worker and execute the action(s) on that space. Players will need to gain resources to build buildings, food to feed workers, housing to gain more workers, and playing card powers. This game can be pretty brutal for new players managing food to feed their workers.",
    "timestamp": 1753480800
  },
  {
    "username": "iplaybgnaked",
    "rating": 5.0,
    "comment": "Classic worker placement game that's still unsurpassed by the bulk of disposable euros that have been released since it came out. Fun card combos in addition to the excellent scoring system keep the game cutthroat and interesting on repeated plays.",
    "timestamp": 1752530400
  },
  {
    "username": "kirasira",
    "rating": 5.0,
    "comment": "EN VENTA",
    "timestamp": 1752444000
  },
  {
    "username": "shawnmackay1593",
    "rating": 4.5,
    "comment": "Nicer looking with better pieces than the first edition but still the same game and not for me.",
    "timestamp": 1748556000
  },
  {
    "username": "Eliya84",
    "rating": 5.0,
    "comment": "Not my typ of game.",
    "timestamp": 1747864800
  },
  {
    "username": "mdiep",
    "rating": 5.0,
    "comment": "Agricola is a classic and a top 100 game on BGG. I respect it, but I don't enjoy it.\n\nIt's a tight game with a thin margin for survival. There's variety, provided by the occupation cards, the order in which spots are revealed, and the actions taken by the players. But those aren't impactful enough for me to feel like the game is meaningfully different between plays. The differences are too small.\n\nThose differences are still impactful. They'll make the game play out differently, especially for experienced players. But I don't find them interesting.\n\nSee my thoughts about other Uwe Rosenberg games in my Uwe Rosenberg Games I've Played geeklist.",
    "timestamp": 1746914400
  },
  {
    "username": "andrewsgame12",
    "rating": 4.5,
    "comment": "Didn't care for this. I don't hold the opinion that the more boring and punishing a game is the more\"smart\" it is. To me every turn feels lacking. You can't hardly handle the basic needs of feeding your workers, let alone trying to build anything. It's also not easy to see how things work together, such as how to effectively use cards to be more efficient. The investment is massive to really learn how to overcome that feeling of being super under powered and bored. I'm simply not in love with the bland theme of this game to commit that much time to learn it on a deeper level. I can respect that there is greater depth here and I'm sure it feels very rewarding when it finally begins to click, but this one is just not for me.",
    "timestamp": 1745445600
  },
  {
    "username": "Shanataha",
    "rating": 5.0,
    "comment": "Stolen . Had all expansions and organizer",
    "timestamp": 1739142000
  },
  {
    "username": "goinup",
    "rating": 5.0,
    "comment": "Well ...",
    "timestamp": 1737327600
  },
  {
    "username": "FredrikEspedal",
    "rating": 6.0,
    "comment": "Such a painful game to play. I think having resource accumulation on actions is a kind of lazy game design to cover balancing issues. I think the cards in hand is the sole redemption of this game, which would otherwise be very mechanical and samey. I think it's a bit strange that you start with all cards in hand and then it's very random if there are any synergy between them or not.",
    "timestamp": 1759701600
  },
  {
    "username": "Wendyjo73",
    "rating": 6.0,
    "comment": "I feel the same about this game as I do Caverna. I just don't think I'm that into the farming mechanic and I'm definitely not into the feeding your people stranglehold over the game.\nI get it, it's thematic, it's just not fun.",
    "timestamp": 1756332000
  },
  {
    "username": "destro",
    "rating": 6.0,
    "comment": "Ph",
    "timestamp": 1756245600
  },
  {
    "username": "nerdycanuck",
    "rating": 6.0,
    "comment": "Potentially sell.",
    "timestamp": 1753912800
  },
  {
    "username": "MightyGeekPants",
    "rating": 6.0,
    "comment": "Incredibly similar to Caverna. Interesting that you must make what you can from the initial card deal, and no more cards are available to you.\nDoes show its age. Really needs multiple plays to understand what to go for.",
    "timestamp": 1750284000
  },
  {
    "username": "adel9591",
    "rating": 6.0,
    "comment": "More manageable than Feast for Odin, at least for me. This was easy to learn, easy to play, but still gave me all the satisfaction I had when I played FFO. The trickled worker sites were unique and enjoyable.",
    "timestamp": 1744754400
  },
  {
    "username": "Warlauch",
    "rating": 6.0,
    "comment": "Edition 2016\nCondition - excellent\n\n\nSweeteners:\nMain decks sleeved\nIncludes Artifex deck expansion (unsleeved)",
    "timestamp": 1744408800
  },
  {
    "username": "qtzlboardgamer",
    "rating": 6.4,
    "comment": "Was not what I was expecting. Definitely prefer Hallertau or Caverna",
    "timestamp": 1744149600
  },
  {
    "username": "godgremos",
    "rating": 6.0,
    "comment": "Dorkának adva",
    "timestamp": 1741734000
  },
  {
    "username": "jecabreradc",
    "rating": 6.0,
    "comment": "Dont see why this would be more than a 6 other than people being nostalgic about it. It is mechanically sound. It is a good game. I respect that it was probably great when it came out. But I would recommend other games in 2025.",
    "timestamp": 1740697200
  },
  {
    "username": "PotatoKing_",
    "rating": 6.0,
    "comment": "빡빡함은 호, 너무 많은 텍스트는 불호",
    "timestamp": 1739746800
  },
  {
    "username": "UnfitStone",
    "rating": 6.0,
    "comment": "This game is clearly very well designed. I appreciate it for what it is, I just don't have any interest in playing it. The theme is boring for me and the feeding your workers is just a bit boring. A great puzzle though.",
    "timestamp": 1739142000
  },
  {
    "username": "goethean",
    "rating": 6.5,
    "comment": "Caverna is better. Here everything is a struggle. I didn't find the cards very useful very often.",
    "timestamp": 1761692400
  },
  {
    "username": "Rasdel",
    "rating": 7.0,
    "comment": "It is still one of my favorite \"farming\" euros. Most people blame the feeding mechanic but for me it is something that makes it interesting, tense and it gives me a clear purpose. Other games just give too much freedom and they end up feeling like anything is valid for points and sometimes less is more.",
    "timestamp": 1761429600
  },
  {
    "username": "Qhorin",
    "rating": 7.0,
    "comment": "Played the revised edition on BGA. Differences are very subtle",
    "timestamp": 1761429600
  },
  {
    "username": "thorbot",
    "rating": 7.0,
    "comment": "Rating improved after playing with the draft variant. Still not one I want to own, though.",
    "timestamp": 1760911200
  },
  {
    "username": "riklamme",
    "rating": 7.0,
    "comment": "Mikki",
    "timestamp": 1760652000
  },
  {
    "username": "badassbr",
    "rating": 7.0,
    "comment": "Para mim é a mesma coisa que o Agricola original, difícil de ver mesa, super punitivo, gosto, mas no fim não adiantava ter na estante e não jogar.",
    "timestamp": 1758319200
  },
  {
    "username": "Jinxie73",
    "rating": 7.9,
    "comment": "Very frustrating game to play. Always worried about feeding my peeps but I can't stop playing.",
    "timestamp": 1762470000
  },
  {
    "username": "Valcurdra",
    "rating": 8.0,
    "comment": "Classic game that introduced me to worker placement and is still the go to for a highly competitive, pure and rich experience in that genre.\n\nLove how tight the board is and how every action counts, both your own and your opponents. Has a fairly unique cadence, tough to do what you want, tight on resources. As you get better at the game you start to handle this better, but it never goes away. Honestly love this feeling, the game genuinely feels challenging and rewarding, but you kind of have to be in to mood for it. You need to really be prepared to dial in and focus and try to win or you can really get wrecked. Overall I will generally prefer more permissive and casual designs, but when I want a fight for survival feel, none does it better.\n\nVariable setup and cards add a lot of variety to each play. Combining those card powers together is as interesting and satisfying as any game I have ever played. Probably the only flaw though is that this is compromised by the intense focus you need to put into getting your 3rd worker ASAP, this makes part of the early game the same the vast majority of the time, which is a shame. There is a module to fix this, but people then get so many workers so easy that the accumulation spaces never get very full and overall the game is less interesting by far.\n\nDespite everything it does soo well, Agricola is absolutely a sometimes food for me but a game I will always want to pull out from time to time.",
    "timestamp": 1762124400
  },
  {
    "username": "Edlomax",
    "rating": 8.1,
    "comment": "Sobre o manual eu entendi a ideia de tentar mesclar o ensinamento das regras com comentários descontraídos do próprio Uwe, mas na prática achei que acabou ficando um pouco prolixo, atrapalhando mais do que ajudando quando se trata de localizar regras rapidamente no meio da partida. A indicação das cartas de Ofício que se deve usar na preparação, de acordo com a quantidade de jogadores, ficou levemente confusa para a coisa simples que é;\n\nA produção deixou a desejar, pois jogando de mesa cheia (quatro jogadores), constantemente faltaram recursos de Madeira e Barro durante a partida. E nem mesmo as fichas multiplicadoras davam conta (só tem uma de cada tipo), o que foi extremamente inconveniente, e senti que a depender das cartas de Ofício e Pequenas Melhorias que os jogadores usarem, isso pode se agravar e também ocorrer com os outros recursos. Fiquei perplexo quando percebi que o manual, além de não citar nada sobre a raridade dessa ocorrência, ainda por cima me diz simplesmente para improvisar. Ou seja, contente-se com essa mesquinharia de componentes e se vire com o que faltar. Na minha visão algo bastante preocupante, pois se o jogo se propõe a ser até quatro jogadores, então ele deveria sim ter componentes suficientes para jogar tranquilamente nesta contagem, de forma a tornar a falta de componentes algo muito raro de acontecer ou no mínimo disponibilizar uma quantidade bem maior de multiplicadores. Vi outras pessoas reclamando disso também aqui no fórum, e infelizmente vi também pessoas normalizando essa bizarrice, colocando inclusive a culpa nos próprios jogadores por supostamente serem menos experientes. Loucura!\n\nO tempo de partida informado na caixa \"aproximadamente 90 min\" não é lá tão honesto, pois de mesa cheia (4 jogadores) ele facilmente atinge 2 horas (é possível constatar isso também observando os tempos das partidas em quatro jogadores registrados aqui e na Ludopedia). Não é dos piores casos, mas seria mais assertivo se fosse por exemplo \"aproximadamente 120 min\";\n\nÉ um jogo relativamente simples, mas que também possui bastante detalhes de regras, que podem ser facilmente esquecidas se não tiver pelo menos uma pessoa experiente na mesa. O que condiz com seu peso atual de cerca de 3,5 na escala BGG;\n\nO jogo é muito fluído, com downtime baixo, pois as jogadas são curtas e não desencadeiam jogadas subsequentes, como ocorre em jogos como SETI, por exemplo. Característica essa que me ganha facilmente. Ponto para o Agrícola;\n\nInteração entre os jogadores agradável, com sensação de cobertor curto.\n\nApesar de ter deixado a desejar na questão da produção que citei antes, sua imersão e coesão temática são boas, com componentes em formatos específicos dos animais e alimentos; cartas de Ofício e Melhoria, cada uma com sua ilustração própria; peças de cômodo para aumentar a casa do fazendeiro; peças de terra arada que são usadas para simular o processo de cultivo que passa pela preparação do solo, semeadura, produção e colheita, que inclusive param de dar frutos se você não fizer a manutenção plantando novas sementes; a família crescendo e se perpetuando; os animais procriando; e até a possibilidade de ter um pet etc. Elementos que remetem bastante a uma vida bucólica no campo. Dá para sentir mesmo a atmosfera de uma fazendinha sendo gerida para fins de subsistência;\n\n• Rejogabilidade/Minimização de Scripts: 10\n• Qualidade do Desafio/Catch Up: 10\n• Qualidade Interação Jogadores: 9\n• Qualidade da Suspensão da Vitória: 10\n• Minimização de AP/Downtime: 10\n• Mitigação da Sorte: 10\n• Fidelidade Tempo Caixa: 5\n• Minimização Dependência de Honestidade: 9\n• Elegância de Regras/Intuitividade: 7\n• Estética: 7\n• Coerência Temática: 9\n• Produção e Imersão: 7\n• Praticidade Preparação/Manutenção: 7\n• Armazenamento (com sleeve): 5\n• Manual: 7\nNota Resultante: 8,1\n\n(detalhamento dos quesitos no tópico da Ludopedia: https://ludopedia.com.br/topico/83397)",
    "timestamp": 1761865200
  },
  {
    "username": "Cocoabine",
    "rating": 8.0,
    "comment": "8/10: First the bad then the good. This game is packed full of redundancy and irrelevancy. The bottom half of the major improvements board is almost never used. The bake bread action is horribly inefficient since it can only be done with a single bread, as opposed to cooking animals which can be done with an infinite supply (as long as you have them). The game is extremely samey, as every game will feel like 95% similar to each other, with only mild changes from game to game, with the tiny alterations of the cards that you begin with. Those cards - of which even though you start with 14 - you will be lucky to play a tiny fraction of them. With all that said, this game is simply charming, building out a little farm and watching it grow, and when it comes to taking actions I can think of no tighter game. The first player token has never felt as important in a game as it does in this one, with every move tense and every decision calculated. A choice in one location can lead to a sacrificed position in another. A really interesting efficiency puzzle!",
    "timestamp": 1760306400
  },
  {
    "username": "Napattack",
    "rating": 8.3,
    "comment": "3.44\n1-4\nBest at 3-4\n120 (600)\n#91",
    "timestamp": 1760306400
  },
  {
    "username": "ImZhe",
    "rating": 7.8,
    "comment": "Lot of variety in strategies based on occupation and minor improvement draft at the start of the game, very nice for replayability. Great player interaction where blocking spaces causes big shifts in what people can do",
    "timestamp": 1759960800
  },
  {
    "username": "Imsevimse",
    "rating": 9.0,
    "comment": "Competitive and punishing—and I love it. The worker placement and resource economy are exceptionally tight and tense, and the game’s arc is so satisfying. Card play is excellent—I cannot praise it enough. Every play is engaging from start to finish. It’s a phenomenal design.",
    "timestamp": 1761951600
  },
  {
    "username": "eltmanypieces",
    "rating": 9.4,
    "comment": "will be replaced with new edition",
    "timestamp": 1761778800
  },
  {
    "username": "My_BoardGames",
    "rating": 8.5,
    "comment": "Even after all these years it still feels fresh. The 14‑round limit keeps the game tight and forces tough choices every turn. I love the tension between long‑term planning and short‑term survival — especially the constant pressure of feeding your family.\nThat said, the rulebook could be clearer (some key details are buried in the appendix), and the card design feels dated. But once you get past the learning curve, the depth and replayability are outstanding.\nFor me, Agricola remains a must‑play classic that deserves its spot in the BGG Top 100.\n\nFull Review: https://www.myboardgames.net/post/agricola-revised-edition",
    "timestamp": 1761606000
  },
  {
    "username": "quetzal513",
    "rating": 8.8,
    "comment": "P: 1-4, T: 30 min/player\nIt belongs in the Pantheon of modern board games. Mechanics reinforce the theme. The occupation and minor improvements take this game to another step above other comparable worker placement engine builders for us.\nDefinitely recommend the revised edition for the tricked-out components and refined decks.",
    "timestamp": 1761519600
  },
  {
    "username": "jonesy792",
    "rating": 9.0,
    "comment": "An excellent farming simulation game that expertly implements theme and mechanics in board game form. In contrast to Fields of Arle (the only other Uwe game I’ve played), Agricola is tightly focused with tension and crunchiness in its decision space between expansion and sustainability. The cards ensure good variability and replayability. For the genre of game it is, there’s good indirect interaction around the scarcity of resources and contested worker placement spots. This feels solid at 2 players which is great.\n\nWhile I think the cards make for good variability, I could still envisage this becoming a bit rote and procedural after a number of plays. There’s a fairly repetitive arc around worker placement decisions which restricts varied and creative play to some extent. But perhaps that’s the nature of the beast, which is executed very well. Turns and rounds are delightfully fast, and the central worker placement mechanic is very elegant. The thematic immersion of expanding and sustaining a medieval farm is strong.\n\nA big frustration is the rulebook(s), which I think are poor and an unfortunate barrier to learning the game. It’s a confusing organisation of the rules and some decent player aids would help a lot.\n\nJust clinches a 9/10 for me.",
    "timestamp": 1761519600
  },
  {
    "username": "DragonShiq",
    "rating": 9.0,
    "comment": "included in \"Agricola: Special Edition (2025)\"",
    "timestamp": 1761170400
  },
  {
    "username": "gabtrat",
    "rating": 10.0,
    "comment": "This is a thematic gamer's chess. Great balance of strategy and tactics with infinite replayability using additional decks.\n\nIt is streamlined through the improved graphic design & easy interlocking boards for different player counts. The cards have been tested and balanced thousands of times thanks to digital versions. There are so many great variations that can grow with you in complexity (family version, side job tile, card draft, etc, etc). I enjoy Caverna too, but if both versions of Agricola were combined it would easily be ranked higher.\n\nShould you get it? It depends what you and your group want to play. For me, Agricola All Creatures Big and Small gets played more due to it's speed and Caverna's sandbox feeling is more my style.",
    "timestamp": 1762470000
  },
  {
    "username": "Jbroots",
    "rating": 10.0,
    "comment": "Combined into one box\n- Agricola: Artifex Deck (2017)\n- Agricola: Bubulcus Deck (2018)\n- Agricola: Consul Dirigens Deck (2022)\n- Agricola: Corbarius Deck (2019)\n- Agricola: Dulcinaria Deck (2020)\n- Agricola: Expansion for 5 and 6 Players (2016)\n- Agricola: Farmers of the Moor (2018)",
    "timestamp": 1759788000
  },
  {
    "username": "chateauzou",
    "rating": 10.0,
    "comment": "Easy set of rules, high replayability, good at all player count.",
    "timestamp": 1759788000
  },
  {
    "username": "Marlharr",
    "rating": 9.5,
    "comment": "Favorite worker placement game due to elegance of design and strong theme.",
    "timestamp": 1759701600
  },
  {
    "username": "Brutus1988",
    "rating": 10.0,
    "comment": "New edition coming",
    "timestamp": 1759615200
  },
  {
    "username": "Ddyraw",
    "rating": 10.0,
    "comment": "Peak Uwe, if you only have one of his games, this is the one. Usually play at two, but have played online with gamers at higher counts and it works great.",
    "timestamp": 1759356000
  }
]