[
  {
    "username": "tuai",
    "rating": 1.0,
    "comment": "Ingles",
    "timestamp": 1755900000
  },
  {
    "username": "cetx",
    "rating": 1.0,
    "comment": "An over-engineered choose-your-own-adventure book with so many physical components to help track stats and items that they become overwhelming.\n\nThe \"encounter\" mode of the game, used for boss battles at the end of each chapter, is a woefully complex battle system that makes 3rd edition D&D or Warhammer look blissfully simple. Once again, there are so many components (item cards, ability cards, animus tokens, a variety of different battle tokens, enemy abilities, battle stages, and more) that most of the \"game\" is just moving physical trackers around your play area. I sincerely believe the game designers expect you to feel accomplished after the battle not from the success of defeating the enemy, but for getting the rules right. There's so much to track in encounter mode that I don't think there's any way to keep it all in mind, and frankly the game requires so much physical space that not even my dedicated 6 foot by 4 foot gaming table can contain everything for the requisite 4 players.\n\nAs a pick-your-path story book, this game is enjoyable, but has far too many components. A pen-and-paper character sheet is demonstrably simpler to manage. As a wargame or combat system, this game is an abomination. You'd do better to ignore the encounter mode entirely, and just use whatever combat system you know best, because my gaming group dreaded encounter mode to the point that we eventually refused to play it, and instead just used the [bloated] card draw system with an arbitrary target number to determine whether we would have won the encounter or not.\n\nAlso, the miniatures are supremely underwhelming. Do not purchase the full set. They're simplistic, leaving lots of detail off, and they're oversized for any other miniature game.",
    "timestamp": 1753048800
  },
  {
    "username": "tasskaff",
    "rating": 1.0,
    "comment": "Oh, russian and chinese versions. fckff",
    "timestamp": 1751752800
  },
  {
    "username": "lililililil",
    "rating": 1.0,
    "comment": "Legacy",
    "timestamp": 1747432800
  },
  {
    "username": "remimi",
    "rating": 2.0,
    "comment": "\"Excellent\" after scenario 1, \"Little bit boring\" after scenario 3, \"Will never play it again\" after scenario 6. Overall, it's a 3/10 game, showcasing some promising concepts but suffering from poor execution. The underlying logic of the game is poorly executed, with noticeable signs of patchwork throughout. Plus the excessive repetition, and a lack of meaningful choices in the story. Personally, I'll be skipping any future projects from the same designers.",
    "timestamp": 1732662000
  },
  {
    "username": "nicolaennio",
    "rating": 2.0,
    "comment": "Huge disappointment. The story part is ok but there aren't real consequences to your choices. The battle part is clunky and some parts are not even designed. A lot of setup and parts for not much going on.\n\nWe played the first battle and we couldn't move forward as it was too boring.",
    "timestamp": 1708038000
  },
  {
    "username": "RipperHAX",
    "rating": 2.0,
    "comment": "This game is a one shot repetitive monster fight disguised as a campaign. The more you play the worse it gets. Should have been half as long. Story doesn’t go anywhere and ends with enormous cliffhangers.",
    "timestamp": 1702076400
  },
  {
    "username": "turbotix",
    "rating": 2.0,
    "comment": "Shadowborne is scamming money with bad quality white premium dice.",
    "timestamp": 1697320800
  },
  {
    "username": "krivichzm",
    "rating": 3.0,
    "comment": "The story lacks choice and the combat, while fun, becomes easily exploitable after first half.",
    "timestamp": 1755727200
  },
  {
    "username": "Chaps2k2",
    "rating": 3.0,
    "comment": "Lots of rules ambiguity, story parts are imo too long and decisions don't really matter, boss AI nothing compared to KDM (did not like boss reactions to broken body parts which can't be avoided or dodged and gave boss one extra turn).\n\nLoot/rewards at end of fight are not exciting, no crafting, no real character progression, dozens of companions that you'll never use, etc.\n\nSold 1/2 way through the game.",
    "timestamp": 1755036000
  },
  {
    "username": "kial2089",
    "rating": 3.0,
    "comment": "my group had 4 players and we just finished the game took about a year playing once a week most weeks breaking up the story and the boss fight into separate weeks for time at the table. we used the online story book app.\n\nThis game started out great the boss battles and story meshed very well if felt like the story had an impact on the why and how the boss fight would go. The boss fight were changing on the strategy on the best way to beat the fight with wile suffering minim losses was great. ...\n\nThen the middle of the game loses the focus on the lore they set up about the Oathsworn, adding in the corrupted government elements . the boss battles became more repetitive and the story would offer options in complete contrast to the Oathsworn oath or would not make sense for the situation just to bleed off the resources for the upcoming boss fight.\n\nThe late game completely ignores the lore and story of the game just to add a spike of difficulty and more contrivance. Here a lot of the action no matter what you do just bleed off resources to railroad you into the boss fight wile needing to make very specific game rule actions to get information.\n\nThe ending was disappointing. Overall the game had some highlights and great moments but they forgot about the the lore and story built up for what and Oathsworn is.\nThe items are to repetitive with abilities and effects and the scaling just drops off.\nThe boss fights just turn in to smash the big thing.\nThe story get lost in forcing you into the boss fight rendering some or all of the choices void during the story.\nI did have the mini version the switching weapons was neat but that got old real quick having to pain all the weapons for each hero.\nI wish the scaling for the small bases minis were closer to the D&D mini size so I could use them in other game now what we are done playing. the bosses look great painted and the mini did add a better fill to the fight than the cardboard standees.",
    "timestamp": 1754431200
  },
  {
    "username": "B3nge",
    "rating": 3.0,
    "comment": "The hype around this game isn´t justified.\n\nWe actually enjoyed the storyphase a lot. The choices you make doesn´t influence the outcome, but it is very well written. On the other hand the encounters felt like a chore - it´s repetitive and not very engaging. There is a severe lack of tactical opportunities and the rules are fiddly.\n\nAfter 10 chapters we decided to finish the game by only going through the story-phases and skipping the encounters.\n\nI understand the games pricetag giving the content in the box, but regret buying it.",
    "timestamp": 1752789600
  },
  {
    "username": "eellisd",
    "rating": 4.0,
    "comment": "Rulebook and rules are ambiguous and poorly thought out.\nThe story post is more fun than the battles, which in boss battler is an issue.\n\nI absolutely hate the flow of the game and how the bosses have such wild unpredictable swingy turns, entire additional turns after defeating parts of the bosses' health which then have the knock on of causing their normal turns to be unplanned for.... no this one isn't for me.",
    "timestamp": 1754604000
  },
  {
    "username": "darthdoctor347",
    "rating": 4.0,
    "comment": "All in from 1st kickstarter plus all of the new stuff from the second. This includes everything, INCLUDING the replaced cards from kickstarter 1 (some people preferred older variations of characters). I have played only the first scenario, not for me. The minis are all unpainted and in good shape. Everything looks great, pictures available.",
    "timestamp": 1752703200
  },
  {
    "username": "Marzipan24",
    "rating": 4.0,
    "comment": "My solo game ground to a halt after 17 chapters. It just feels like work at this point. It’s brutal. The text on the cards torture the English language.",
    "timestamp": 1748988000
  },
  {
    "username": "enzo622",
    "rating": 4.0,
    "comment": "One 3P play that was OK but not nearly as compelling as Gloomhaven. There were long periods of downtime between turns, but two of us were new, so that could be ameliorated. Still, I find it a better story than a compelling card-play/combat experience. And I prefer a game to be tilted to the end of the spectrum where the combat is very sophisticated, and I'll sacrifice a bit of story for that.\n\nThat's why GH works so well for me. The story there is quite lame, but the card mechanics are wonderful and keep me on my toes each game. This seems like more of a balance of reasonably good combat plus very rich story. It's good at what it sets out to do, but it's not my particular sweet spot. I would play it again, but I don't think I need to chase acquiring it.\n\nUpdate: I played again and am taking it down a rating. It's too story-forward for me. The combat mechanics are mildly interesting at best. The battle flow mechanism should be exciting but it's just not; more like battle traffic than flow. Combat decisions dried up once cards languished in their flow spaces. Even Arena: The Contest has better tactical combat decisions than here.\n\nAnd I'm not writing this to slag off on the game, but rather to caution others who might share my tastes before they spend their money. I came close to plunking down a chunk of money on this, and I'm so lucky I got to try my friend's copy after he got bored of it.",
    "timestamp": 1745013600
  },
  {
    "username": "Mack1993",
    "rating": 5.0,
    "comment": "The dice system is soooooooo good. Pair it with terrifying unique boss battles and an awesome story! The story can take a long time and it drags at times. There are some fiddly mechanisms that get in the way of the smooth experience.",
    "timestamp": 1756764000
  },
  {
    "username": "morteigan",
    "rating": 5.0,
    "comment": "Vraiment un jeu très bien fait, j'adore le mélange d'histoire et de combat.\n\nLe système de combat est vraiment immersif et la production est magnifique.\n\nUn jeu que si on m'invite je vais jouer c'est certain.\n\nEdit: Après 10 scénarios, je commence tranquillement a perdre un peu d'intérêt. Le jeu est bon, mais j'ai l'impression qu'il est abitrairement difficile juste pour représenter un monde noir et ténébreux, ce qui me tanne un peu. On a que très peu de chance de mitiger nos jets et les bout d'histoire dure de plus en plus longtemps. On a pris presque 2h juste à lire en attendant le boss.\n\nReste bien fait et bon, mais il perd tranquillement ses plumes.\n\nEdit: après 15 game je peux confirmer que faire chier parce que Dark Fantasy ça gâche mon fun. Le jeu a un bon fond, une bonne histoire, mais une balance douteuse...\n\nEdit: Après 21 game, je confirme. L'histoire est hot, la méchanique de personnage est fun, la produciton est A1. Le reste c'est juste de la marde, car chaque fois que je regarde quelqu'un qui aime le jeu, il dit comment il fait pour gagner, et c'est précisé dans les règles que tu ne peux pas faire ça. Donc, pour aimer le jeu, il faut house-ruler, ce qui est vraiment poche.\n\nDésolé pour les designers, mais le jeu est pas balancé, il est frustrant et pas playtesté à mon avis. Un beau KS plein de bling mais avec un jeu stratégique douteux. Je n'y rejouerai pas.",
    "timestamp": 1754344800
  },
  {
    "username": "downsideleft",
    "rating": 5.0,
    "comment": "Choose you own adventure games rely on trust, but this game loses it late in the story. You can feel it jerking you back onto the track it wants you to take, unwinding your decisions. Moreover, results often have no relation to the decision made or, even, seem completely opposite of the logical result. A lack of hints and foreshadowing combine with inconsistent worldbuilding to make late game decisions feel completely random, rewards feel unearned, and punishments are just annoying rather than dramatic.\n\nThe city and deepwood event cards suffer a similar problem but offer an overall worse experience. It's a system that seems tacked on simply because gloomhaven did something similar.\n\nBy the end of chapter 18, I can't help but think they just wanted to write a novel. Your choices didn't matter, and you're faced with walls of text telling you how little what you wanted or intended matter. The adventure doesn't give you any way of having educated guesses about how to prepare.\n\nOverall, this game takes an incredible amount of time to play each session. The randomness of the adventure detracts from that long experience because it doesn't feel like an accumulation of your decisions resulting in a good or bad starting situation, but rather a long string of contrived events, with subsystems being piled on for no reason. For example, there's a ration mechanic that is later replaced by a supply mechanic. You can win a battle and lose moral, where moral is another tacked on system. It feels like they wanted to pile as much as they could into the game with no regard for flow, rule consistency, rewarding decisions and planning.\n\nI'm glad I played but I would never play again and wouldn't suggest anyone else play it with the plethora of more refined campaign games out there.",
    "timestamp": 1753826400
  },
  {
    "username": "Derik811",
    "rating": 5.0,
    "comment": "BGG rating and complexity score were very misleading for me on this game. I enjoyed Gloomhaven a lot more than this. My main issues:\n- Set-up and tear down take forever. So many components and it takes up a lot of table space.\n- Story is fine, but just kind of boring huddled up around a table listening to a narration for 45min that essentially amounts to a decision tree of whether or not you start the battle with any handicaps/boons. Would rather just some flavour text before battles, and have the gameplay tell the story (e.g. Nemesis, GH, Zombicide)\n- Core combat mechanics are good but it’s fiddly with too much tracking and upkeep both in and out of combat. Feels like work while playing\n- We never got comfortable with the rules and kept revisiting them. Not to mention each chapter has a new encounter with new rules to learn. Maybe had we kept playing they would have become more intuitive. Disclaimer: The complexity score on this is much higher than what's currently on the BGG page (e.g. the tutorial video is 1h30min).\nIf you can get past the above you may find enjoyment in this game because I do appreciate the ambition and production. Might come down to personal preference that these kind of campaign / narrative games don't resonate with me as much as I thought they would.",
    "timestamp": 1753135200
  },
  {
    "username": "kilianbognar",
    "rating": 5.0,
    "comment": "The size of the miniatures is overkill, but I didn’t pay for them, so I don’t care. They look detailed and cool, and all that. The map itself is strangely ugly, though.\n\nThe timing in the card play isn’t as interesting as it is in Gloomhaven, and in the first few scenarios we played, there weren’t really any interesting tactical considerations. It was mostly just making sure you get to the place where you can deal the most damage at the time you can deal the most damage, and that wasn’t hard to do at all. I’m pretty sure we played inefficiently because there wasn’t much meaningful coordination between the players, and we still won.\n\nSo, spinning your cards doesn’t require a considerable amount of brainpower, and attacking doesn’t require much brainpower either. But take this criticism with a grain of salt: I always felt disengaged when a game is about slowly chipping away the life points of an enemy while it also chips your life points away slowly, and all you do is make sure you chip theirs away faster than they do it to you.\n\nI personally think that's dull, but if you like that kind of experience, you might like Oathsworn.",
    "timestamp": 1748556000
  },
  {
    "username": "Henriks",
    "rating": 5.0,
    "comment": "Story line 5/5\nGreat story and audio\n\nCharacter progression 1/5\nYou fight through deepwood, battling monsters aaaaand you get a token or a sword, because you non-thematically must discard a weapon/armor after a fight. And that’s it?!\n\nBoss battles 2/5\nHorrible balancing, one scenario is done one-handed and with closed eyes, the other is a full party wipe.. The diversity and mechanics sometimes seems great, but often fail.\n\nRules 0/5\nDuring each and every play-session we encountered unclear rules, badly written text and phrases and had to google lots of stuff. And we always ended up house-ruling something. Major headache discussing rules constantly.\n\nHow do it get rated so high?",
    "timestamp": 1748124000
  },
  {
    "username": "Nykalis",
    "rating": 5.0,
    "comment": "Horrible rules, sorry publisher and authors.",
    "timestamp": 1748124000
  },
  {
    "username": "UndutifulCarrot",
    "rating": 5.0,
    "comment": "This gave the impression of a D&D on the rails one shot campaign where you don't have a DM. I could see how it would be good, but we just wanted to play actual D&D by the time we reached the encounter",
    "timestamp": 1746828000
  },
  {
    "username": "kopn9k",
    "rating": 6.0,
    "comment": "Standee version, after 5 plays. Not really optimal experience for solo player",
    "timestamp": 1762297200
  },
  {
    "username": "Mageknight12",
    "rating": 6.0,
    "comment": "Campaign game, never replay. Extremely shallow and repetitive gameplay.Better u should read the book, not play this game. A lot people dont play enough to rate this game.",
    "timestamp": 1756332000
  },
  {
    "username": "Fishpeddler",
    "rating": 6.0,
    "comment": "Just a comment about the BGG weight at this point. Seems significantly underweighted. I write rules summaries for every game I teach, and that includes many with a much higher weight here: Brass Birmingham, Ark Nova, Great Western Trail, etc. This ruleset is WAY more extensive than any of those, and that doesn't even tap into the complexity that will come from the cards and special rules boards.\n----\nUpdate: Starting Chapter 4, and I can safely say this is the most exhausted I've ever been leading plays of a game. Sooooo fiddly.",
    "timestamp": 1752789600
  },
  {
    "username": "TerraformingJosh",
    "rating": 6.0,
    "comment": "Revising my score from 8.5 to 6. We're almost done with the campaign, and we are big fans of campaign games of similar types. The issue with this game is the story is just too long. You spend half the night listening to a story before you get to the boss battle. The battles are great, and there are some interesting moments in the story, but it's just too long to get to the good part.",
    "timestamp": 1752184800
  },
  {
    "username": "Euro_Toast",
    "rating": 6.0,
    "comment": "Wanted to love this one, but the combat mechanics left me wanting more. Exploration and story was solid, but fiddly and ambiguous battle rules kept our group from keeping it.",
    "timestamp": 1750975200
  },
  {
    "username": "HeroSlam",
    "rating": 6.0,
    "comment": "Starting out, I was excited. The world is neat and the writing is great. However, I soured on the game as we read and played many hours. The combat is very mediocre IMO, and so is the character progression, our Free Company barely has changed over our ~40 hours of play. The gameplay design is very questionable, the first battles have gimmicks and encourage certain playstyles that are not repeated later, and other battles have mechanics that stop you from playing the game (getting possessed, having fields of doom with anti-melee). The reaction system sucks bad compared to Kingdom Death Monster.\n\nI do like the story. There was one chapter where there was a noticable drop in quality (7 or 8ish?).\n\nWe stopped playing around chapter 10 though, in particular I did not enjoy the combat compared to superior boss battling board games.",
    "timestamp": 1745618400
  },
  {
    "username": "jormungandr",
    "rating": 6.0,
    "comment": "Probably the best writing in any board game I have purchased, married to an interesting setting. Narration on the app is excellent. Still making my mind up on some of the game mechanics - especially since the design is only revealing some of them as it goes along.\n\nUpdate: dropped it to an 8 when I opened the upgrade kit and watched the game nerf the hell out of my favorite character (Blade). And it is clear this happened to other characters as well. Not a great feeling and frankly am tempted to ignore the supposed \"upgrade\" as a result and just stick with the first edition. Don't do this sort of thing again, Shadowborne.\n\nFurther update: Dropped to a 6 after chapter 11. Game keeps getting worse. That chapter was so unpleasant that it killed all of our progress with the game and we have had little interest in returning. It's not even the artificial difficulty, it's that there was nothing interesting to do. Grimdark does not have to mean boring. And the constantly more and more bloated narratives for each chapter resulted in a game where we couldn't do both a narrative session and a fight in the same evening as the chapter narratives were taking up 2.5-3 hours to play through by that point. It simply isn't worth shifting multiple boxes and all these components to go through several hours of a choose your own adventure narrative.",
    "timestamp": 1745186400
  },
  {
    "username": "neural_net",
    "rating": 6.0,
    "comment": "Combat is too repetitive for my taste. Story is great. Lots of minor rules requires constant referencing of the rulebook.\nOtherwise a good game.",
    "timestamp": 1744149600
  },
  {
    "username": "Yves1981",
    "rating": 7.0,
    "comment": "32",
    "timestamp": 1762631160
  },
  {
    "username": "Jeff_the_Zebra",
    "rating": 7.0,
    "comment": "Ok I had a bad experience with this second monster in.\n\nYou know when you play a game once then again a couple of months later and just balls it up completely? I had one of those.\n\nit's a 7 and temped to ditch it. Will maybe give it another go soon first and see if we can swing it around.\n\n\nPS the story in this is dark and great. I actually enjoy the town parts more than the boss battles",
    "timestamp": 1762124400
  },
  {
    "username": "fishboba",
    "rating": 7.0,
    "comment": "The combat system is well-designed and engaging, offering a very ARPG-esque, action-oriented feel. The boss battles are clearly painstakingly crafted, though some reused bosses and ones with unbalanced stats do exist. The downside is that the adventure aspects overly rely on frequent dice checks and tedious side quests to propel it forward, compounded by too many pointless cutscenes. The main storyline itself is mostly mediocre, and worst of all, the ending feels incredibly abrupt, leading to a profound sense of disappointment at the finale.\n\n战斗系统设计很有趣，非常有ARPG的操作感。BOSS战还是精心设计的，只是有部分重复BOSS和数值失衡的BOSS存在。缺点是冒险部分依靠大量的骰子鉴定和无聊的支线支撑，且无效剧情太多。主线剧情更是过于平庸，最糟糕的是结局非常仓促，导致最后有着非常强烈的失望感。",
    "timestamp": 1760133600
  },
  {
    "username": "Ideology",
    "rating": 7.0,
    "comment": "Played with Eric and Mac",
    "timestamp": 1759269600
  },
  {
    "username": "wstevens",
    "rating": 8.0,
    "comment": "Pre-play rating based on art, mechanics known for now",
    "timestamp": 1762470000
  },
  {
    "username": "Micpi",
    "rating": 8.0,
    "comment": "sell?",
    "timestamp": 1761170400
  },
  {
    "username": "duboiskk",
    "rating": 8.0,
    "comment": "A true effort at an adult cooperative campaign, hampered by uninspired combat variations and a story that builds up to a coherent world that never really delivers on its potential, leaving interesting places and characters behind.",
    "timestamp": 1760738400
  },
  {
    "username": "ImZhe",
    "rating": 7.7,
    "comment": "This is probably the best value boss battler. For about $150 you get 22 boss fights with a lot of variety. Replayability probably isn't great but you get your money's worth even on a single playthrough. Streamlines the out of combat portion and has solid writing/storytelling. Mechanics are not overly bloated like most boss battlers are",
    "timestamp": 1759960800
  },
  {
    "username": "Weltende",
    "rating": 9.0,
    "comment": "Oathsworn is definitely one of the best games I've ever played. It's a really good mix of good story and interesting battles. All characters are very well done. The story itself is the best I've had in a game like this, even if the choices are nothing more than an illusion.\nAbsolutely a masterpiece.",
    "timestamp": 1761865200
  },
  {
    "username": "Felwin",
    "rating": 9.0,
    "comment": "MITT -- 1:45 Stunden -- Komplexität 3-\nOkay @ 2-4 -- Good @ 2-4 -- Best @ 2,4\nLetztes Spiel 08/2025",
    "timestamp": 1761084000
  },
  {
    "username": "merkulo",
    "rating": 9.0,
    "comment": "У Славы",
    "timestamp": 1760479200
  },
  {
    "username": "Turrible4",
    "rating": 9.0,
    "comment": "Missing a ton of stuff. Had started playing and realized that I was missing a ton of envelopes. Very disappointing. Took all my momentum out of playing the game. Won’t be buying another game from these guys, no matter how good. Have too many games that are good that HAVE all the components.",
    "timestamp": 1757714400
  },
  {
    "username": "Ultra_Sama",
    "rating": 10.0,
    "comment": "Best game I own",
    "timestamp": 1761865200
  },
  {
    "username": "Han_Heinrich",
    "rating": 9.6,
    "comment": "This is great!!! Is everything I want a narrative \"dungeon crawler\" boss battler to be! Near perfection.",
    "timestamp": 1761519600
  },
  {
    "username": "Boboddy1",
    "rating": 10.0,
    "comment": "Love this game, as a painter and a gamer.",
    "timestamp": 1761429600
  },
  {
    "username": "JohnnyUtah89",
    "rating": 10.0,
    "comment": "Amazing game",
    "timestamp": 1760738400
  }
]