[
  {
    "username": "jqh928",
    "rating": 1.0,
    "comment": "Back on 2011 when this game was first published, I can understand why it may have shone. Many years on, there are far better, thematic, engaging and dynamic solo experiences. This game is tired, feels the same every time played, lacks dynamic enemy behaviour - ie: it's the same static experience each time with heroes that are all broadly the same reinforced by the generic application of additional cards to the players hand, irrespective of the hero used. By todays' standards, this game is dull and overrated.",
    "timestamp": 1759269600
  },
  {
    "username": "Beedun",
    "rating": 1.1,
    "comment": "Traded for Glory to Rome 1.5",
    "timestamp": 1712354400
  },
  {
    "username": "ironmkj",
    "rating": 1.0,
    "comment": "Just not fun for how complicated this is and how long it takes to build cards. Then your done. There are way too many different items with different characteristics.",
    "timestamp": 1691877600
  },
  {
    "username": "Hirocon",
    "rating": 1.0,
    "comment": "Not color-blind friendly.",
    "timestamp": 1653948000
  },
  {
    "username": "mdrozdziok9595",
    "rating": 1.0,
    "comment": "Terrible. Act Like adventure game but its dry, mathematic, random",
    "timestamp": 1649109600
  },
  {
    "username": "fenadoruk",
    "rating": 1.0,
    "comment": "This game is only complexity for complexity sake. Full of counterintuitive rules that serve zero purpose. Cognitive load for no extra fun. So many nice ideas wasted by all the terrible complexity and poor choice of iconography. You feel like you're in control but the factor of luck is all around. Total waste of time and money...",
    "timestamp": 1648936800
  },
  {
    "username": "kartoffelopa",
    "rating": 1.0,
    "comment": "Most game elements are very well done, But there is one aspect that just kills the game in multiplayer.\n\nThere is no come back mechanic. If you are behind, you are doomed. You know it takes another 3 hours and you have 0 chance to get on your feet again. The players ahead will grow their power exponentially.\n\nThis game has many awesome aspects and really nice art. Sadly the core game is broken by the aforementioned aspect. Also having dice as a huge random element is a minus point as well.\n\nIf you like to play cooperative or solo this game can be fun for you!\n\nI bought it to be played with others and it can not serve this purpose.",
    "timestamp": 1648504800
  },
  {
    "username": "Mayasty",
    "rating": 1.0,
    "comment": "The worst deck building I've ever played. Already reading the rulebook I knew the author doesn't care about my time and wants to pack up my head with lots of tiny details, exclusions and abstract rules. The heavy texted 24 pages (font likely 6pt) of one of 3 rulebooks (sic!) is a nightmare. Impossible to remember all that stuff. So the game is all about browsing the rulebook at every step which causes huge downtime even for two. I can't imagine that game with 4. Go for \"Tainted Grail\", which is about the same: moving, exploring, fighting and developing your character, but it's a hell simpler, easier and better, giving the same fun and experience.",
    "timestamp": 1648335600
  },
  {
    "username": "ingedico",
    "rating": 1.0,
    "comment": "Solo",
    "timestamp": 1637362800
  },
  {
    "username": "LPG17",
    "rating": 1.0,
    "comment": "Extremely complex for a very basic feeling game",
    "timestamp": 1629064800
  },
  {
    "username": "DawnSC",
    "rating": 1.0,
    "comment": "The gamebook is so convoluted, I feel people must be making it up on how to play. So disappointing.",
    "timestamp": 1607727600
  },
  {
    "username": "MiB_Agent1213",
    "rating": 1.0,
    "comment": "Awful. Worst game I have ever played.",
    "timestamp": 1593900000
  },
  {
    "username": "shobas",
    "rating": 1.0,
    "comment": "Most boring game ever played",
    "timestamp": 1583190000
  },
  {
    "username": "harkoning",
    "rating": 1.0,
    "comment": "By all accounts I should like this. I don't. And every scenario is the same - defeat 12 cities. I don't care that it takes forever, but a little more variety wouldn't hurt.",
    "timestamp": 1582239600
  },
  {
    "username": "Valcurdra",
    "rating": 1.0,
    "comment": "Played this 3 player and it was a horrific experience. Way too long with too much downtime, fairly random in certain parts combined with snowballing power levels, fiddly and over complicated rules, pretty much unteachable to new players.\n\nLong, boring and frustrating to boot.\n\nThis should be considered a solo only game, I could see it being good then because the card play is nice and solo eliminates downtime.",
    "timestamp": 1520031600
  },
  {
    "username": "stationtracks",
    "rating": 1.0,
    "comment": "-zb1035",
    "timestamp": 1512514800
  },
  {
    "username": "ionas",
    "rating": 1.0,
    "comment": "Lets see if they ever release Mage Knight 2:\n\nLess rules, better rules, better quests, less randomness, better ability and spell card balance and it might work out. Currently crappy. Only worth playing alone, theoretically.\n\nIt is actually a 3/10 game. Not a 1/10... but then again some games are just heavily overrated due to marketing and hype; so some underrating won't hurt.",
    "timestamp": 1492812000
  },
  {
    "username": "ZoeyWP",
    "rating": 1.0,
    "comment": "A slow motion Movie where you have to move every actor individually and make up the lines yourself. Its not even a good movie at that.",
    "timestamp": 1492552800
  },
  {
    "username": "Biscotti",
    "rating": 1.0,
    "comment": "Nothing wrong with game. I'm sure its a splendid affair. However after watching run through and or reading reviews, absolutely no desire to play.",
    "timestamp": 1481238000
  },
  {
    "username": "bielie",
    "rating": 1.0,
    "comment": "What a load of... extemely complicated unfun gameplay",
    "timestamp": 1481151600
  },
  {
    "username": "zemekis",
    "rating": 1.0,
    "comment": "Horrible, don't understand why it is well rated.",
    "timestamp": 1456786800
  },
  {
    "username": "marcopac74",
    "rating": 1.0,
    "comment": "only 4 characters in the base game and all starting with the same exact deck. deck buildning is slow and by the end of a game there isn't much variety to be had between players. Ugly miniatures made of toy plastic. monsters are represented on a minuscule token. no dice rolling. bought it because was the top ranked game for solo play but simply hated it. total waste of money for me",
    "timestamp": 1453244400
  },
  {
    "username": "BlueSapphire",
    "rating": 1.0,
    "comment": "Too hard to wrap my head around, felt too much like work than fun.",
    "timestamp": 1439848800
  },
  {
    "username": "dprijadi",
    "rating": 1.0,
    "comment": "great game but the fanboys in the forum left me with bad feeling.. still buying it to try the solitaire mode though..",
    "timestamp": 1370815200
  },
  {
    "username": "Talismania",
    "rating": 1.0,
    "comment": "Shocking that anyone finds this well designed. Basically take a bunch of incompatible mechanics and shove them into a game and then shove some more in. So much down time you could play a couple of other games between turns. The combat system is so uninteresting: there is no calculated risk, just look at the enemy and decide how much damage you are willing to take, of course that is after you've consulted the charts to figure out what the damn symbols mean. Not that it's interesting once you find out. And are we even playing with each other? All interaction is collateral. Like a bunch of people playing solitaire together. The WORST part is the movement. As if it isn't annoying enough as it is not having a lot of movement options, when it is \"night\" it gets even worse. Note to adventure game designer: There is nothing interesting about moving. There is so much pain and effort put into moving that you want to cry. Just let me move!!! \"Sure, I am a great sorcerer warrior but somehow I can't walk through the forest at night because I don't have the right movement cards.\" I have the power to assault the Wizard's Tower, but fear not, minions of the dark, this stretch of all-powerful hills in front of me prevents my getting there.\"\nOuch.",
    "timestamp": 1351465200
  },
  {
    "username": "skipsizemore",
    "rating": 1.0,
    "comment": "Wow -- I just don't get what all the fuss is about. Reading the reviews, you would think \"you make the most of what you have\" was a revolutionary new game idea, not the stuff of dusty, luck-driven children's games. Dry, repetitive gameplay, arbitrary theme, frustrating mechanics, and a whole lot more luck than the fanboys like to admit. Definitely not an adventure game, as I understand the term, and not a very good deck-builder, either. Copious downtime extinguishes any sparks of pleasure this tedious stinker might otherwise provide.\n\nA soulless and pointless game that would have been ignored from any other designer.",
    "timestamp": 1336428000
  },
  {
    "username": "cs4b4",
    "rating": 2.0,
    "comment": "1-4 player",
    "timestamp": 1746050400
  },
  {
    "username": "Israeldor",
    "rating": 2.0,
    "comment": "Long and fiddly. The rules are fairly complex, and since I so rarely playes it the problem was worsened.",
    "timestamp": 1743890400
  },
  {
    "username": "Bye_on",
    "rating": 2.0,
    "comment": "most overrated game",
    "timestamp": 1742943600
  },
  {
    "username": "JasonSaastad",
    "rating": 2.0,
    "comment": "compettive mode \n\n cooperative mode \n prolonged playtime \n dramatic dice",
    "timestamp": 1710630000
  },
  {
    "username": "GhostInside",
    "rating": 2.0,
    "comment": "Wow, I was SOOO looking forward to playing this one. I heard so many good things I almost bought it without ever sampling it.\nI'm so glad I didn't.\nI played 1 game with 2players and it felt so incredibly DULL!\nWay to euro for the theme it is going for.\nEverything being deterministic just feels like making little stacks of \"+1\" cards until it is higher than some arbitrary threshold and then you dump the stack, take some little chit that indicates some boring upgrade and then do it all over again.\nThe main thing for me was movement... the way that movement is just arbitrarily hobbled for reason other than \"make it harder/more fiddly\"\n\nI think we were at that game for more than 3 hours, and by 90 minutes in I honestly didn't care one whit about anything that was happening. It was just a grueling slog to get to the end so the other guy could feel good about his victory.",
    "timestamp": 1703026800
  },
  {
    "username": "Halcyonblu",
    "rating": 2.0,
    "comment": "Poorly laid out rules. I just couldn’t get into it.",
    "timestamp": 1697407200
  },
  {
    "username": "cosluke",
    "rating": 2.0,
    "comment": "If I had one work to describe Mage Night it would be dry. It feels like your slugging along in molasses as you play this game.\nDon't believe the hype.",
    "timestamp": 1686002400
  },
  {
    "username": "Morinfen",
    "rating": 2.0,
    "comment": "extremely slow and heavy game. I've played a few games both cooperative and competitive and haven't had any positive or engaging experiences. certainly not a game for my tastes.",
    "timestamp": 1681164000
  },
  {
    "username": "sbannier",
    "rating": 2.0,
    "comment": "The rule book is a mess, the rules are very complex and information is scattered across two rule books. Icons on cards are never shown in the rules.\nI don't mind if a game takes a long time to complete, but if I have to look up every event in the rules, because there is no logical way to remember what happens, it gets pretty annoying.\nAlso the difficulty is very high. At the start of the game I was seldomly able to defeat a single enemy. It is pretty frustrating to start over and over again and still always fail at the first combat.",
    "timestamp": 1660168800
  },
  {
    "username": "SleepyMeeples",
    "rating": 2.0,
    "comment": "its ideology is best left in the past with Gygax and the like. There's too many better games in the same genre with healthier outlooks on the world. kind of cringy and reductive.",
    "timestamp": 1643670000
  },
  {
    "username": "shawn_low",
    "rating": 2.0,
    "comment": "Played a game and did not find it memorable at all. Too many fiddly rules and rather long. By the end of the afternoon, we looked back and went, wait, we only managed 2 turns?!\n\nIn this day and age of 'Oh, look at me! I'm the flavour of the week' games, MK will find it hard to hit the gaming table with friends. It takes too long to explain, takes too long to play and one reviewer suggested it takes 8-10 games to 'get' it.\n\nWho has time? Even FFG dumbed down Descent.\n\nWith games hitting us left-right-centre every OTHER week, it's no wonder that I sold my copy. My main beef is that friends don't want to invest time to play this game.",
    "timestamp": 1637881200
  },
  {
    "username": "bagrar",
    "rating": 2.0,
    "comment": "I really did not like this game, thought i would, but no!",
    "timestamp": 1635285600
  },
  {
    "username": "Ravensburg24",
    "rating": 2.0,
    "comment": "Dry as dust.",
    "timestamp": 1628460000
  },
  {
    "username": "zosocoheed",
    "rating": 2.0,
    "comment": "I don't see what all the fuss is about. Its not quite a deckbuilder, its not quite an rpg, not quite a dungeon delver. It tried to be these things, and I feel fell rather short of the mark.\n\nI know its toted as a good single player game, for I'm not really into tabletop single players - I'll just boot up my PC.",
    "timestamp": 1616367600
  },
  {
    "username": "Yokiboy",
    "rating": 2.0,
    "comment": "Too many rules and slow gameplay for such an abstract game. It's a serious time commitment and I would certainly never play it with more than three players, given the lengthy turns. Sure, we might get marginally faster with regular play (if that's even possible), but I don't see us getting that much faster. The fact that each card has two uses, and can also be played sideways for basic actions, just leads to a whole ton of permutations to consider. This can be enjoyable to me, and is in other games, but here it just feels slow and horribly frustrating.\n\nWould I play it again? No, I don't think so.",
    "timestamp": 1612998000
  },
  {
    "username": "Cepro",
    "rating": 2.0,
    "comment": "played it twice, regretted it both times. One player walks into one direction, the other\nplayer into another. If by chance you walked into the wrong direction, you are going to have to play this slow solo game for three more hours with no way to catch up.\nThis could potentially be better in coop. But I do think it is way too random for it's length.",
    "timestamp": 1581548400
  },
  {
    "username": "LycanBlood",
    "rating": 2.0,
    "comment": "Didn't get much enjoyment out of this game. It took three days to read and slightly understand the rules. 30 minutes in to our first game my gf and I got so irritated that we couldn't go on. It wasn't a game it was a chore. Would rather be digging a ditch with a garden shovel. Gave it to a friend to see if he could figure it out and help me like it. I'm betting on no. My 2 rating is based solely on component quality. Otherwise, it would be a 1.",
    "timestamp": 1564610400
  },
  {
    "username": "vikings40",
    "rating": 2.0,
    "comment": "Attractive garbage is still garbage. Highly recommend avoiding unless you're the masochistic sort.",
    "timestamp": 1564351200
  },
  {
    "username": "Ouragan",
    "rating": 2.0,
    "comment": "Very poor game with really old school mechanic. Dawntime is terrible. Game with many calculating mixing with randomness. Random card, random skills, random monsteres, random card draw in deck, random winner. Zero plots. Heroes are - borring picture, with almost the same cards in starting geck, without any fable. Terrible game.",
    "timestamp": 1563487200
  },
  {
    "username": "Vase",
    "rating": 2.0,
    "comment": "I did not enjoy this game. However, there are a couple caveats:\n\n1) I bought this game specifically for solo play. I have not played it multiplayer.\n\n2) After trying other solo play games and not enjoying them too much, I thought I'd try Make Knight because it's the consensus #1 solo game out there. After not enjoying Mage Knight, I'm sure it's partially because I don't personally enjoy solo gaming. I will play a game solitaire on occasion, but I much prefer Lord of the Rings LCG, or even games not designed for solo play but which have theme and mechanics that I really enjoy.\n\nI like the fantasy theme, but I am really not a fan of the mechanics in this game.\n\nI would never play this game multiplayer. It's just too complex and....how do it put this....not fun.\n\nSo if you like solo gaming, I do think this game is worth a try. For me personally though, I just don't find a solitaire solve-the-puzzle type experience very fun.\n\nI don't plan to ever play this game again.\n\nEdit: Since writing the above several years ago, I have become well versed in the differences between Ameritrash and Euro(trash). I'm a proud Ameritrash gamer, through and through. Euro-style game play coupled with the boringness of solo game play is what makes this unbearable for me. But I can see why Euro gamers would LOVE it.",
    "timestamp": 1552345200
  },
  {
    "username": "ozsoffy",
    "rating": 2.0,
    "comment": "This game is way too long, way too complicated and way too boring to be payed again.\nI played it only once, and it was more than 4 hours for nothing.\nNot recommended.",
    "timestamp": 1547420400
  },
  {
    "username": "stoneart69",
    "rating": 2.0,
    "comment": "meh",
    "timestamp": 1544828400
  },
  {
    "username": "iiaen",
    "rating": 2.0,
    "comment": "\"Keep it complicated you moron,\" they say.\nI don't like the KICYM policy as I seem to spend more time calculated if I won a battle or not than I don't actually enjoying the events of the journey. The game's complication doesn't pay out in an equal amount of fun.",
    "timestamp": 1541631600
  },
  {
    "username": "Rogue1483",
    "rating": 2.0,
    "comment": "Dungeon crawl at its worst. Movement is laborious and frustrating, payoff is not enough to make it worth it. Game play becomes a slog.",
    "timestamp": 1541372400
  },
  {
    "username": "kontalari",
    "rating": 2.0,
    "comment": "An Euro-style optimization puzzle of disconnected mechanics disguised as some kind of adventure game in the formerly glorious Mage Knight universe.\n\nHand management is the main mechanic, and it makes it an ordeal to move. This game is supposedly better in solitary, but I play games to enjoy myself, be it alone or with others, and this just seems like a horrible statistics 101 class at 8am with a teacher who barely knows what the hell he's talking about.\n\nWould use as fuel for a fire.",
    "timestamp": 1523829600
  },
  {
    "username": "rapcx1981",
    "rating": 2.0,
    "comment": "-Over complexity.\n-Too much set up time.\n-Unclear Rulebook.",
    "timestamp": 1521586800
  },
  {
    "username": "Straddllw",
    "rating": 3.0,
    "comment": "The most overrated game ever. It is a terribly restrictive puzzle that forces you to think for 10 minutes about how to move your character one hex forward and another 10 minutes on how to beat the enemy. Then you find out you can't even do what you planned to do while everyone else suffers downtime because of it. It outstays its welcome by about 5 hours, during which, you just want to blow your brains out.",
    "timestamp": 1757800800
  },
  {
    "username": "jackfs4",
    "rating": 3.0,
    "comment": "A little too complicated to be fun. We spent more time reading and re-reading rules than playing and with four people it took forever to get through the game. We all felt tired afterwards.",
    "timestamp": 1751320800
  },
  {
    "username": "Dlearn",
    "rating": 3.0,
    "comment": "It's a really fun single player optimization puzzle. But I really don't know why it should be a board game. Or why I should ever play it multiplayer",
    "timestamp": 1749506400
  },
  {
    "username": "smurfodeth",
    "rating": 3.0,
    "comment": "Marvelous game, lousy publisher. If I had more time for solo gaming, this would see a lot more play.",
    "timestamp": 1745964000
  },
  {
    "username": "Alb1979",
    "rating": 3.0,
    "comment": "Pese a que me parece un buen diseño, no es uno que encaje conmigo. No me importa que en el fondo sea un puzzle vacío de aventura, y hay muchas cosas que me gustan como idea: ir descubriendo las losetas a medida que avanzas, el jugar las cartas de varias formas posibles, el adaptarse a los dados de maná... Pero hay cosas que no me hacen click, como por ejemplo los combates parecen más un ejercicio matemático que una pelea, desmasiado tedioso y anticlimático para mi gusto. Además ocupa mogollón de mesa, tiene muchas fichas que hay que preparar, estar pendiente de efectos, los personajes son ligerísimamente asimétricos (aunque según adquieran fichas de habilidad, se creará una asimetría).\n\nAdemás personalmente la mecánica deckbuilding no es mi favorita, la puedo aceptar para algo más casual y dinámica, pero no para algo que requiere algo más de estrategia.\n\nEn definitiva, buen juego al que no volveré a jugar (como viene siendo habitual con el 90% de juegos de Vlaada).",
    "timestamp": 1742770800
  },
  {
    "username": "Oninohugo",
    "rating": 3.0,
    "comment": "Great take on fantasy themed demolition derbies to level-up as efficiently as possible with a hand management engine and goût du jour deckbuilding seasoning. Cards basically have different colors to represent attacking/blocking, moving/shooting, healing/boosting and interacting/money or can be laid sideways to give +1 modifiers to whatever.\n\nSince there's no odds when performing deterministic actions with open information, risk vs reward decision making is replaced by binary \"yes/automatic\" or \"no/impossible\" processing. Mostly, you'll be searching for a bunch of arbitrary rules that may apply to your situation, get your head around as many exceptions for sake of convolution as possible and so, ponder for ages before doing anything any given turn. Adding more friends to the table accordingly adds hours of downtime and proportional chances of walking through a cleaned-up map. To speed this bloated game up, the author suggests planning ahead (really?) and playing at the same time... even though you do buy cards from the same offer, pick mana dice from the same pool and a couple nasty skills directly alter your opponent's movement or deck, not mentioning it isn't calculating but searching for the right freakin' double sided reference card and ruling out what you can and can't do that takes time, not resolving your risk free action! And there's even a backtrack rule that allows the real active player to redo his whole turn from the start, yay!\n\nBesides dispensable day & night cards, the wound mechanic was a neat idea to hinder possibilities before experiencing how limited your possibilities are at any given time. With only a single different card per deck, knights are obviously empty shells so they surely are balanced? Try winning against Greendick or battle thonged Arythea. At least, you'll have the pleasure of leading armies of powerful golems, arcane mages and the likes that will serve once then as meat shields. Mostly though, you'll try to desperately move your lazy ass a couple hexes a turn, go on adventures without narrative wishing to discover easy preys on accessible terrain, draw the right cards at the right time and enter villages and monasteries that will offer the same companions and upgrades as any other on the map.\n\nHint: fire blocks ice, ice blocks fire, coldfire blocks coldfire but hotice is impregnable!",
    "timestamp": 1737500400
  },
  {
    "username": "GladiatorGr",
    "rating": 3.0,
    "comment": "One of the worst experiences i ever had with a board game. Very slow pace and bad deck building mechanism. Very heavy for no reason and no fun at all.",
    "timestamp": 1722117600
  },
  {
    "username": "JamesT",
    "rating": 3.0,
    "comment": "It was fun to play one time and see how much has been packed into the game and how it all works together, but the game has way too much rules overhead and too little player interaction for my taste. I can see that it would make a good solitaire game.",
    "timestamp": 1714082400
  },
  {
    "username": "mccasey",
    "rating": 3.0,
    "comment": "This is up there with my worst game experience ever...",
    "timestamp": 1706569200
  },
  {
    "username": "Meoso",
    "rating": 3.0,
    "comment": "Previously owned. I never could learn the rules which made this game impossible to play. Maybe it's as good as they say... I'll never know!",
    "timestamp": 1705618800
  },
  {
    "username": "Arnaud3013",
    "rating": 3.0,
    "comment": "Too much complex. Not really fun. I prefer play on a computer for games like this, very clunky, slow... But lot of replayability and diversity. Nice deterministic fight, but lack fun in it. Lot of brain freeze (analysis paralysis)",
    "timestamp": 1699743600
  },
  {
    "username": "tiagoVIP",
    "rating": 3.0,
    "comment": "This game can be more fun with less players, or so I was told, but the truth is that I played it with other 3, and the game with four players has a HUGE downtime. Oh, dear God, in some turns I did nothing besides walk or rest, and that was all that I did in about 30 minutes.\n\nThis isn't what I call and adventure. There are monsters, and keeps, and mage towers and whatnot, and nothing of this gave me the feel of real theme - probably because I was too much absorbed trying to make the best use of the cards in hand, thinking only about \"blue mana, move 4, 3 damage, gain red crystal, then attack 5 plus attack 2\" and so forth.\n\nThe game do have mechanics that work, all nicely knitted together. I didn't notice imbalance nor any rough edges. But, even so, I just wanted it to end. Too much time for too little enjoyment.\n\nAs a solo option, it maybe a great game, but I won't be fiding out.",
    "timestamp": 1698706800
  },
  {
    "username": "FSTiletto",
    "rating": 3.0,
    "comment": "Bought it, played it, sold it (2013).\n\nGot curious again.\nBought it, played it, sold it (2016).\n\nThis might not be my kind of game.\nMight be because I dont like playing solo.",
    "timestamp": 1695160800
  },
  {
    "username": "brownsound",
    "rating": 3.0,
    "comment": "Porażająca liczba małych zasad uniemożliwia czerpanie przyjemności z tej gry. Ilość różnych ikon przyprawia o ból głowy. Nie. Nigdy więcej.",
    "timestamp": 1690063200
  },
  {
    "username": "theaaron",
    "rating": 3.0,
    "comment": "Everything has so many rules that I didn't find anything fun about this. I laughed out lout at some of the reference cards that have literal paragraphs explaining one mechanism.",
    "timestamp": 1689026400
  },
  {
    "username": "tamsynulthara",
    "rating": 3.0,
    "comment": "Slow, plodding, and then it just suddenly ends before you get anything accomplished.",
    "timestamp": 1679612400
  },
  {
    "username": "shmonkey",
    "rating": 3.0,
    "comment": "Partially through one play. This play is dragging. Not having a ton of fun. Its interesting with the card draw combat mechanic and mana providing extra powers. The map exploration, dice, and monster spawning appear to be the only RNG. Looks to be well designed. Lots of rules and little things to remember. Doesnt feel particularly deep for the complexity of the rulesset.",
    "timestamp": 1670886000
  },
  {
    "username": "emptyset",
    "rating": 3.0,
    "comment": "Takes a lot of time to get into. Two dense 20-page rule books in tiny print, one of which is a lengthy tutorial. The entry hurdle is very steep and you will likely have to spend a couple of hours to learn the game before you can teach it. If you only play it sporadically, you will have to spend time to re-familiarize yourself with the rules.\n\nI can see its appeal for certain players. It is very satisfying and most of the rules make sense thematically. So if you play it often enough, there is a lot to like about this game.",
    "timestamp": 1665266400
  },
  {
    "username": "SlaskaKsiezniczka",
    "rating": 3.0,
    "comment": "There's not a single thing I like in this game",
    "timestamp": 1658700000
  },
  {
    "username": "ManNamedPi",
    "rating": 3.0,
    "comment": "Seemingly a fun game, but so many fiddly rules that I struggled to get a single playthrough. I'm sure this is an amazing game for some, just really not my cup of tea, as much as I really wanted to like it",
    "timestamp": 1651442400
  },
  {
    "username": "KORdarked",
    "rating": 3.0,
    "comment": "Perhaps for soloists with much much time",
    "timestamp": 1641337200
  },
  {
    "username": "Muskratio",
    "rating": 3.0,
    "comment": "Traded away in the August 2017 math trade.",
    "timestamp": 1626127200
  },
  {
    "username": "Rag136",
    "rating": 3.0,
    "comment": "Fun only played once",
    "timestamp": 1624744800
  },
  {
    "username": "Brom Ironfist",
    "rating": 3.0,
    "comment": "I can see what folks like about it. Not for me thoigh. Rules were too cumbersome and would be unrealistic that I'd go through that again to play it again later. I sild my copy.",
    "timestamp": 1621720800
  },
  {
    "username": "to_mars",
    "rating": 3.0,
    "comment": "There isn't a game I want to like more and don't. Mage Knight is simply too complex. I've played 3 or 4 games, and still nobody can take a turn without a rules consult. After a few months I decided to give it one more go, and had to put it back in the box before even starting.",
    "timestamp": 1618610400
  },
  {
    "username": "kimochi",
    "rating": 3.0,
    "comment": "Before I bought this game I thought this will be an adventurous + deck building game. But after a few plays, it kind of fell off for me as my moves on the tile were very limited by the cards that I have, and I hardly can get some advanced, spell , advance units and treasure cards and use them under the maximum of 6 rounds (3 days and 3 nights).\n\nAfter reading some reviews and comments in the forum, I finally realize that this game is basically a puzzle game. It is highly depend on how you choose your actions and maximize the effect and usage of the cards in your hand. You probably need to spend 5-10 minutes to decide how you gonna play the 5 cards in your hand, which I don't like it at all.\n\n\nPeople that like puzzle solving might love this game. But I would prefer an adventurous game that is not tightly restricted by the the way to play the cards on my hand, and this game is no where near any deck building game like dominion, ascension, etc. Also, it take a long time to learn and setup this game.\n\nMaybe I need to play it more in order to grab the essence or fun of this game, but after less than 10 solo play, I don't even feel like touching it at all. As a result, I've sold the game and I'm glad I did it. I think this game is overrated.",
    "timestamp": 1615503600
  },
  {
    "username": "logopolys",
    "rating": 4.0,
    "comment": "Mage Knight Board Game is a problem. There are a few reasons. One of those is a matter of expectations. People were comparing it to Magic Realm right off the bat, as a large scale sandbox fantasy adventure game. Some even called it a streamlined MR. This is not the case. MR is sandbox-y because you actually have the freedom to do what you want. MK un-streamlines the process by introducing deck-building which restricts your actions each turn. No longer can you do what you want (and possibly fail, but at least you can try). Now, you need to draw the right cards at the right time (more on that later).\n\nAnother touted expectation for the game is that it is the ideal solo experience. Again, not really the case. The reason that it works well solo is that there is no downtime with no other players, and each additional player slows the game down immensely. Yet without interaction, the game is reduced to an excessive puzzle that plays you as much as you play it, rather than a game with meaningful decisions.\n\nI guess I could note some good things. The locations are (in the abstract) thematic and logical. In fact, a lot of the individual isolated mechanics are thematic and logical. It's the combination that seems like a problem. The game requires a commitment to learn deck manipulation for each of the numerous situations you get yourself into, and those commitments are full of losses until you find your footing. This is not to say that games should be easy, but games should be scaled. MKBG has lots of scale: the plethora of scenarios is impressive and worthy of praise on its own. The scale of the game requires tweaking, else the commitment the game requires may never be completed.\n\nIt's kinda terrible that movement is completely random but combat is not.\n\nI feel like I need to repeat this one more time for emphasis: Movement is randomized. Combat is predetermined. When has this ever made sense in an adventure/RPG game?",
    "timestamp": 1759356000
  },
  {
    "username": "stepolk",
    "rating": 4.4,
    "comment": "Czechowice",
    "timestamp": 1756936800
  },
  {
    "username": "cinnzel",
    "rating": 4.0,
    "comment": "Me gustan los juegos largos y complejos, me encanta la construcción de mazos, el mazmorreo y jugar en solitario. Mage Knight tiene todos estos elementos y aún así no lo acabo de disfrutar. Se me atraganta el inicio de la partida y no consigo buenas sensaciones. Dificultad endiablada.",
    "timestamp": 1756245600
  },
  {
    "username": "MichaelaPat",
    "rating": 4.0,
    "comment": "2025",
    "timestamp": 1750888800
  },
  {
    "username": "Geektron",
    "rating": 4.0,
    "comment": "Players: 1, 2",
    "timestamp": 1748037600
  },
  {
    "username": "lililililil",
    "rating": 4.0,
    "comment": "Eurojank",
    "timestamp": 1747432800
  },
  {
    "username": "TrevorJr26",
    "rating": 4.0,
    "comment": "This was the final nail in the coffin for me with solo games. I've tried a few other ones but could never get into it. Thought let's just go big and get the one that solo players rave about. I just think I'd enjoy it way more with at least one other player, but I don't need another long game to play with others. It's not the game's fault that I don't like solo gaming, in fact I'm happy that I can finally stop trying. Mage Knight itself is big and tricky, I almost got into my normal boardgame flow state when playing on my own a few times. That speaks a lot to the thematic richness and game depth.",
    "timestamp": 1741561200
  },
  {
    "username": "localghost8080",
    "rating": 4.0,
    "comment": "Too fiddly for a solo game. Too much setup, teardown, shuffling, messing with various components.",
    "timestamp": 1738364400
  },
  {
    "username": "MatroidX",
    "rating": 4.0,
    "comment": "This game violates my desire for sane rule book size/complexity, and as a result it's a bit difficult to play without accidentally breaking a rule once in a while. Also, the size and length means it cannot come out often.\n\nDespite that inelegance/overhead, I had fun my first game. So... I wouldn't buy it, but I'd consider playing another round next time I'm at my friend's house with many spare hours.",
    "timestamp": 1735686000
  },
  {
    "username": "camidon",
    "rating": 4.0,
    "comment": "This is a good game. The components are fantastic. I find the exploration of the world and fighting of monsters fun. I enjoy the reputation track. However, I cannot stand the deckbuilding aspect of the game. Every game felt the same. Each character felt the same. Yes you get a few different cards and skills over the course of the game, but all the characters basically felt the same. Plus, I despise the movement in the game. What? I didn't draw any movement cards? I can't move unless I discard most of my cards which I will need in order to find or recruit? Incredibly frustrating. Not for me.\n\nTRADED",
    "timestamp": 1734908400
  },
  {
    "username": "rytwin",
    "rating": 4.0,
    "comment": "I tried to play this once and we (3 of us) made it through very little of the game in about 5 hours. None of us had played so we were trying to learn the rules and it went very poorly. I spent basically the entirety of the next day reading the VERY long rulebook and learned that what little we had done was completely wrong.\nIn theory I would like to try it again, but practically the rules are just way too involved and unless you're playing this all the time there's no way you'll remember them, and you'll spend a huge amount of time re-learning them and referencing the rulebook constantly. To each their own, I know people love this game, but I just don't see how it's fun to play something with this much overhead to even understand what you're allowed to do.\nI'm not a solo gamer so I'm just never going to care enough about this game to put that time in or ever play it again.",
    "timestamp": 1727301600
  },
  {
    "username": "kiwipaul",
    "rating": 4.0,
    "comment": "encyclopedia the boardgame",
    "timestamp": 1722463200
  },
  {
    "username": "quietcorn",
    "rating": 4.0,
    "comment": "This game has a strong mix of mechanisms. You and your fellow players explore a hex map with your character mini, equipped with asymmetric decks of character abilities. As you explore, kill monsters and gain experience points, you get opportunities to do a little bit of deck-building.\n\nDowntime between turns in this game is massive because turns are long and procedural, particularly once battles with monsters start and you have absolutely nothing to think about during that time. Additionally, the maps generally extend in a cone-shape, which puts players later in turn order at a large disadvantage. I think the game works best with 1 or 2 players at most. Monsters are also represented by little circular pog-like tokens, with many tiny icons. Each icon indicates a monster ability, so expect to be re-checking them a lot in the rulebook during play.",
    "timestamp": 1721685600
  },
  {
    "username": "mawilson4",
    "rating": 4.0,
    "comment": "Way too much fiddle for an adventure game, one that also struggles to deliver compelling narratives that reward your investment of time and energy. I don't care how deep or modular the system is. There are better puzzle box optimization exercises, and better adventure games that feel, ya know, adventuresome and thematic.\n\nOnly positive comments I've heard in-person for this one are from solo gamers, where I assume it has more appeal. But even the more sane of those will admit it's monstrously clunky for a game night with more players.",
    "timestamp": 1720562400
  },
  {
    "username": "JavierPC",
    "rating": 3.8,
    "comment": "At first when I looked for information on this game I thought it was a great game, almost like the definitive game. I bought it with great desire. A short time later the inconvenience began. First of all, the game was quite an ordeal to learn to play it, the rules manual is very dense, complex to understand, there are many details sometimes explained in a complex and unclear way, many details, many exceptions, even the placement and orientation of the letters have to be learned.\nAt the moment of playing it is when the big surprise came, what promised to be a tense, adventurous, fun, original game, became a complete disappointment. The mechanics were very simple for me, picking up a tile and trying to make combinations with the cards to get to the number on the tile, is this really the great game everyone was talking about? I am not saying that it is a bad game but the mechanics are the opposite of what it promised to be, there is no adventure, no tension, no emotion, it is totally antithematic, it is not a strategy game either. It is a game with several mechanics that are not bad but it is only a normal and acceptable game. I don't give it a 5 just because of the expectations it created for me.\nI'm sad to say, I wanted to like this game but it was a very disappointing and somewhat mediocre game: difficult to learn but very simple. It's just an \"acceptable\" game.",
    "timestamp": 1709161200
  },
  {
    "username": "Flow25",
    "rating": 4.0,
    "comment": "Overrated and unnecessarily complicated game, that is only good as a 1player. The rules per se are not hard, but feel just not connected to the theme and do not add to the mechanics either. Vlaada just kept on adding and adding and now players praise him for his calculating puzzle. Also basically no player interaction.\nCan only recommend, during pandemics if you have no family.",
    "timestamp": 1704236400
  },
  {
    "username": "Boltana",
    "rating": 4.0,
    "comment": "I think this game has potential, but unless it hits the table often the rule set will cause issues with missed rules.",
    "timestamp": 1702594800
  },
  {
    "username": "PJWagner",
    "rating": 4.0,
    "comment": "I see why people like it, but it just doesn’t work smoothly enough for me.",
    "timestamp": 1673823600
  },
  {
    "username": "spobo77",
    "rating": 3.9,
    "comment": "story",
    "timestamp": 1667689200
  },
  {
    "username": "wittyar",
    "rating": 4.0,
    "comment": "Quería que me guste, pero las 4 partidas que jugué tuve que volver a aprenderlo de 0.\nMe propone todas cosas que me interesan, pero me parecen extrañas en la forma que fueron conjugadas en el juego.",
    "timestamp": 1650319200
  },
  {
    "username": "DTWolf",
    "rating": 4.0,
    "comment": "While I understand that this may be a great game, I found the 2 player co-op experience to be just awful, and as I have not played the other modes yet, my rating for now represents only the 2 player co-op.",
    "timestamp": 1643497200
  },
  {
    "username": "Penguinised",
    "rating": 4.0,
    "comment": "Don't get me wrong, I love you Vlaada. But someone should have come in at some point and told you to stop designing Mage Night. Maybe once about half of the current game was finished? Way too much going on for what it is",
    "timestamp": 1641164400
  },
  {
    "username": "SirLoin027",
    "rating": 4.0,
    "comment": "I'd love a video game adaptation that handles all the heavy lifting and lets me just relax and enjoy the game.",
    "timestamp": 1630447200
  },
  {
    "username": "dingo154",
    "rating": 4.0,
    "comment": "Too long and heavy for me",
    "timestamp": 1624917600
  },
  {
    "username": "ryansmum2008",
    "rating": 4.0,
    "comment": "Not for Me",
    "timestamp": 1618351200
  },
  {
    "username": "ProximityDamage",
    "rating": 4.0,
    "comment": "This game is great with a lot of interesting components but make sure you are in the mood for a super complicated pile of rules. After a handful of plays we resold it. There are so many good games out there inspired by this game, that it seemed reductive to come back to this archaic design attempt. Still, kudos for inspiring a whole genre!",
    "timestamp": 1612566000
  },
  {
    "username": "Iraperkins82",
    "rating": 4.9,
    "comment": "6/10: Enjoyable if I'm in the right mood. Probably has to be suggested to me. Likely it will have left my collection - unless it's important to someone in my life.\n\nTook me 7 hours to play my one and only game. Even then I probably got a few rules wrong. I sometimes wonder if I should get it back and really try and play it regularly. Also suffers from my dislike of the dungeon crawler genre. I really wanted to like it.",
    "timestamp": 1758578400
  },
  {
    "username": "aresil",
    "rating": 5.0,
    "comment": "tts solo hard to set -1",
    "timestamp": 1752789600
  },
  {
    "username": "Brother Abe",
    "rating": 5.0,
    "comment": "I can see that the game is actually pretty good, but I never got through the training mission. I just felt like the enjoyment was not near the effort. I was constantly worried that I broke a rule. And so spent half the time trying looking at the rules after I did anything. I suppose I needed someone to teach me and guide me through a game.\n\nJuly 2020\nTraded to BoardGameCo for 66 points\nSeptember 2019\n$30.09",
    "timestamp": 1752444000
  },
  {
    "username": "Jackieh9",
    "rating": 5.0,
    "comment": "It was a tough learning session but even still it's not for me. We played cooperatively at Gerald's. A lot like Gloomhaven but not nearly as exciting to me",
    "timestamp": 1751234400
  },
  {
    "username": "Bmaglicic",
    "rating": 5.0,
    "comment": "5",
    "timestamp": 1749592800
  },
  {
    "username": "Deltonbrack",
    "rating": 5.0,
    "comment": "Update: After playing more games, this doesn't hold up.\n\nSuper complex game. I really enjoyed it, but will have to play it again to really gauge.",
    "timestamp": 1748988000
  },
  {
    "username": "Andrewey",
    "rating": 5.0,
    "comment": "I just really don’t like deck building.",
    "timestamp": 1747173600
  },
  {
    "username": "Vernalis",
    "rating": 5.0,
    "comment": "once the digital version of it is ready, then I might play it\nas of now, the fiddling of this game is unsurpassable",
    "timestamp": 1741474800
  },
  {
    "username": "Tygrone",
    "rating": 5.0,
    "comment": "It was pitched as \"the boardgame where Gloomhaven got it's mustard...\"\n\nPlayed the tutorial & the 1st scenario but it's not the best adventure game out there.\n\nThe mechanics are ok, but the first scenario took 6h (and we werent close to the finish) and we kinda gave up. Very rarely happens in my gamegroup.\nAlso, playing the game in 2024 for the first time, you do feel it's a bit outdated.\n\nFirst thought was that Vindication does all of this better & in an acceptable time-frame.",
    "timestamp": 1740351600
  },
  {
    "username": "wkover",
    "rating": 5.0,
    "comment": "Too long and deterministic for my tastes.",
    "timestamp": 1738105200
  },
  {
    "username": "colin1952",
    "rating": 5.0,
    "comment": "Terribly overrated",
    "timestamp": 1733439600
  },
  {
    "username": "parpari",
    "rating": 4.9,
    "comment": "Another fail attempted to make Baldur's Gate of board game but it is better than others. Fiddly, too many useless rules, prolong gameplay, random, no story and long down time are killing me. I always would rather play video game like Baldur's Gate, Divinity: Original Sin and etc. over this mess because we are not living in 1980s or 1970s.",
    "timestamp": 1729634400
  },
  {
    "username": "invervegas",
    "rating": 5.0,
    "comment": "Complexity √ - Bought second hand - too confusing with everything mixed in together so sold it on",
    "timestamp": 1725314400
  },
  {
    "username": "Walex",
    "rating": 5.0,
    "comment": "Czarek",
    "timestamp": 1723845600
  },
  {
    "username": "IvorDotsk",
    "rating": 5.0,
    "comment": "I find it too much boring, maybe this game is just not for me",
    "timestamp": 1722463200
  },
  {
    "username": "Harroguk",
    "rating": 5.0,
    "comment": "Too Complex to learn from the rulebook.",
    "timestamp": 1719525600
  },
  {
    "username": "evileyemcfungus",
    "rating": 5.0,
    "comment": "I can see its good points. But the length of time per player and amount of downtime plus the lack of decent player interaction means I didn't get into this game near the amount others have sadly.",
    "timestamp": 1710716400
  },
  {
    "username": "CMagex",
    "rating": 5.0,
    "comment": "1\n\nRemove-good game, I can't keep up with it though",
    "timestamp": 1703890800
  },
  {
    "username": "jaffawahha",
    "rating": 5.0,
    "comment": "Finns hos MBF",
    "timestamp": 1703718000
  },
  {
    "username": "junior_gracz",
    "rating": 5.0,
    "comment": "This shouls be a 10 just as Twilight Imperium should\n\nBut you know you will never have the time to play it. Specially to set it up\n\nSpecial note to consider.. this game is from 2011 but the production REALLY feels like 2020. Also, by that time nothing even compared.. I was lucky to play it while new and man those are good memories\n\nOther than that - its time has passed. I'd play Destinies over this, knowing to sacrifice a bit of mechanics to gain more story - but a plus in everything else",
    "timestamp": 1698966000
  },
  {
    "username": "Jarl_Djevel",
    "rating": 5.0,
    "comment": "A journey into a world of fantasy where planning each steps counts. Mage Knight design is quite an achievement (positive reviews are countless). Think of a puzzle you have to solve considering your situation on the board and the goal you have to achieve. With a few cards in your hand there's a lot to do and a lot to take into account. The downside is the steep learning curve in the beginning - especially combat because the mechanics here are unique (I particularly think of applying damage). A game that takes a little time to master but that is very rewarding at the end. I would love more background/stories though and a legacy aspect through the game sessions. This is in fact a pure puzzle board-game with a fantasy theme and not an adventure game as I first thought. All in all a very good game but not for me.",
    "timestamp": 1696024800
  },
  {
    "username": "B_Jensen",
    "rating": 5.0,
    "comment": "Enjoyable but quite complex.",
    "timestamp": 1694383200
  },
  {
    "username": "Grundhest",
    "rating": 5.0,
    "comment": "Co-op",
    "timestamp": 1691359200
  },
  {
    "username": "manaelf",
    "rating": 5.0,
    "comment": "Great. Loving that math. This is the one game that gives me AP but its just so clever. Update. Feels tired now and quite repetitive.",
    "timestamp": 1688940000
  },
  {
    "username": "jagastrumpet",
    "rating": 5.0,
    "comment": "Gameplay = 9\nReplay ability = 8\nLength = 5\nComponents = 8\nFun Factor = 7",
    "timestamp": 1683064800
  },
  {
    "username": "sully5927",
    "rating": 5.0,
    "comment": "The game is extremely complicated considering the lack of rewards and strategic gameplay. I cleared an entire castle and just didn't feel excited.",
    "timestamp": 1682460000
  },
  {
    "username": "elitegamingsociety",
    "rating": 5.0,
    "comment": "Nick",
    "timestamp": 1677798000
  },
  {
    "username": "Sikko",
    "rating": 5.0,
    "comment": "It had its time in my life, but this time is over.",
    "timestamp": 1671490800
  },
  {
    "username": "xoflram",
    "rating": 4.5,
    "comment": "Overly complex, not truly Co-op. Co-op felt like an after thought.",
    "timestamp": 1670886000
  },
  {
    "username": "sdruelinger",
    "rating": 5.0,
    "comment": "When I first started playing I was hoping for a fun exploration and monster hunting game. What I got was a long cumbersome mechanism to do something as simple as moving. I found it boring and if you play this enough you can calculate every outcome of every move with out any risk. the game is very static.\nThe quality is not what I would expect. The cards absolutely need to be sleeved. they are very thin and since everything is done with them they will wear out quickly.\n\nIf you are into Euro gaming and are tired of processing German Mail or trading for sheep, this game may be for you.",
    "timestamp": 1669417200
  },
  {
    "username": "heavymetalboardgamer",
    "rating": 5.0,
    "comment": "Exploration game that has way too much going on and is way too random. You can explore a tile that has nothing, while an opponent explores one and finds a perfect scoring opportunity. It also takes way too long for what it offers I was not a fan.",
    "timestamp": 1666303200
  },
  {
    "username": "Winterjace",
    "rating": 5.0,
    "comment": "Trop de cas particuliers",
    "timestamp": 1664229600
  },
  {
    "username": "IRushPeople",
    "rating": 5.0,
    "comment": "This is a solitaire game. Buy this if you don't play boardgames with other people. It's beautiful though, the art is 10/10 and the gameplay is 4/10. Setup and teardown is 1/10",
    "timestamp": 1663020000
  },
  {
    "username": "rubiks75",
    "rating": 5.0,
    "comment": "I was desperate to try this and love complex games but for some reason failed to hit the mark with me and found it somewhat tedious. Disappointing",
    "timestamp": 1653775200
  },
  {
    "username": "SebastianK",
    "rating": 5.0,
    "comment": "Really wish I could get this one to the table more often because there are parts of it that I really like... but I simply cannot find people who are willing to get past the learning curve.",
    "timestamp": 1652392800
  },
  {
    "username": "kaepone",
    "rating": 5.0,
    "comment": "There's a lot going on. The main flow of the game is fine but I had a hard time remembering all the little fiddly rules and spent a lot of time trying to find them or look up interactions. The game is a table hog and the map growing as players explore makes it worse. I liked the ideas of wound cards and dice-less combat, but it made fighting boring.\nI know this is very different than Gloomhaven or Jaws of the Lion, but I find that kind of game more appealing.",
    "timestamp": 1645311600
  },
  {
    "username": "Zukkou",
    "rating": 4.5,
    "comment": "I have a hard time tabling this game. It has gotten even harder after I tried Cloudspire. Might have to sell / trade this in the future.",
    "timestamp": 1642287600
  },
  {
    "username": "ervandarnell",
    "rating": 5.0,
    "comment": "Complex rules for potions, weapons, etc., but more like DnD, explore the landscape, slay the dragons, limited player interaction, lots of randomness.",
    "timestamp": 1641250800
  },
  {
    "username": "omnitheus",
    "rating": 5.0,
    "comment": "10+ plays",
    "timestamp": 1640818800
  },
  {
    "username": "Kremik",
    "rating": 5.0,
    "comment": "Long game is loooooooooooooong.\nSome things are implemented well. Sadly, player interaction and PvP are not among them, which is kinda bad for all the modes, whether coop, semi-coop, or versus modes.\nMight be better as a solitaire game, actually.",
    "timestamp": 1637535600
  },
  {
    "username": "OmegaDestroyer",
    "rating": 5.0,
    "comment": "Updated score. After years of playing games, I find Mage Knight just to be OK at this point. I like the game but it is difficult to bring to the table and a bear to teach to new players. There are just so many other games I would rather play at this point.",
    "timestamp": 1631484000
  },
  {
    "username": "DrWildcat",
    "rating": 5.0,
    "comment": "That's a lot of rules...but probably worth it.",
    "timestamp": 1630533600
  },
  {
    "username": "Hantis",
    "rating": 5.0,
    "comment": "I think it's more complicated than it should be for what it is. I'll play all missions 1-2x and then I'll try to resell it. For a solo game it's not enough satisfaction for effort. The game is cool and I love the card drafting part of it but also quite exhausting.",
    "timestamp": 1630015200
  },
  {
    "username": "tizgart",
    "rating": 5.2,
    "comment": "Way too hard for me as a noob board gamer and bad at tactical games.\nThe game is really fiddly. Setup, maintenance, etc.",
    "timestamp": 1628287200
  },
  {
    "username": "zatch37",
    "rating": 5.0,
    "comment": "40.00 MUGU",
    "timestamp": 1618869600
  },
  {
    "username": "matenason",
    "rating": 5.0,
    "comment": "I really need more plays of this, the one I had left me thinking the game was needlessly complex for what it was, but it deserves another play.",
    "timestamp": 1612998000
  },
  {
    "username": "Ryan Keane",
    "rating": 4.5,
    "comment": "Disappointed again by Vlaada! In theory, this game sounds great, but it is just a lot of fiddliness, with a very poor implementation of the deck-building mechanic. Like Through the Ages, this is another example of a board game that should be a videogame. We just kept wanting to go play Final Fantasy or Ultima instead of this.",
    "timestamp": 1605049200
  },
  {
    "username": "Goldron",
    "rating": 5.0,
    "comment": "solitary game with a thin multiplayer layer.\nmechanism are finde, but the game itself\nis rather boring since there are no threats.",
    "timestamp": 1604962800
  },
  {
    "username": "LordBalder",
    "rating": 5.0,
    "comment": "Too much luck involved for such a heavy, complex and tight game... Too much calculations for a game that looks thematic at the first glance... Too many rules and components, fiddly and a chore... I know people really love this game, but I have no idea for whom was this designed.",
    "timestamp": 1598911200
  },
  {
    "username": "Entropology",
    "rating": 5.0,
    "comment": "Good game, but not so good that the sheer amount of setup and rules grist makes it worth the time to actually play.",
    "timestamp": 1596060000
  },
  {
    "username": "mikegraham77",
    "rating": 5.0,
    "comment": "Oh so disappointed...",
    "timestamp": 1592690400
  },
  {
    "username": "Shoes",
    "rating": 5.0,
    "comment": "Incomprehensible?\n\nAnd even if you could figure it out... the components are ? Just looks too ‘unthematic’ to bother trying to get through the barrier",
    "timestamp": 1591999200
  },
  {
    "username": "SilentSniperx88",
    "rating": 6.0,
    "comment": "I want to like this game given it's rated so highly but I just can't. The art is ugly, game is too complicated and just takes way too long. Some good decisions but too many barriers. Could use an updated version with better art and streamlined rules.",
    "timestamp": 1761429600
  },
  {
    "username": "Crumputer",
    "rating": 6.0,
    "comment": "Pure math, no theme. Not for me.",
    "timestamp": 1760652000
  },
  {
    "username": "destro",
    "rating": 6.0,
    "comment": "s",
    "timestamp": 1756245600
  },
  {
    "username": "JesusChristIsKing97",
    "rating": 6.0,
    "comment": "Elsőre nagyon sok lehetőség volt, amire figyelni kellett, ráadásul én nagyon rossz helyzetbe kerültem már a játék elején. De szívesen kipróbálnám még egyszer.",
    "timestamp": 1753912800
  },
  {
    "username": "Kelsoli",
    "rating": 6.0,
    "comment": "Bought a used copy that was arranged in a very complicated way for a first time solo player. Also, the game is more aggressive than I like - for some reason, I thought it would be more about exploration and character development and less about conquest. Finally, not a \"pretty\" game that makes it fun for me to pull out and grapple with rules in the limited amounts of time I have.",
    "timestamp": 1753653600
  },
  {
    "username": "b0laroid",
    "rating": 6.0,
    "comment": "a clunky and slow disaster",
    "timestamp": 1753308000
  },
  {
    "username": "paulastoria",
    "rating": 6.0,
    "comment": "ok",
    "timestamp": 1748469600
  },
  {
    "username": "xoopams",
    "rating": 6.0,
    "comment": "Not worth the effort for me. Well, didn't manage to arrive and the \"I can play it from my head\" stage.\nFrom the start, it took me a while to learn it. Reading and re-reading the rules, watching videos. But playing it, I was basically always checking things in the rule book. There's so many exceptions on those rules that I could never keep them in my head. It never flowed. Don't get it.",
    "timestamp": 1746741600
  },
  {
    "username": "jnharr",
    "rating": 6.0,
    "comment": "Mage Knight offers a dense, crunchy experience with a lot going for it, but it ends up overplaying its hand. There's a LOT here, and that's part of the problem. I'm all for a heavy ruleset (Pursuit of Glory, Europa Universalis, etc.), but MK's complexity lies not is its ruleset per se as much as the respective features of each type of terrain, monster, spell, ally, etc. Internalizing how to move, explore, and fight is fairly simple and intuitive (and actually fun!). It's having to look up what each particular terrain does/means, what each symbol on each monster does/means, etc. that pushes MK into the \"more work than the fun is worth\" category for me. I'm sure with repeat plays, some of this granularity becomes second nature, but I just can't summon the energy to play it enough to get there. And that's part of the problem with the game: if you step away from it for a few months, you'll be relearning much of these little details so it feels like you're constantly starting over. While I can respect most of what's here, it just isn't worth the effort to me.",
    "timestamp": 1746396000
  },
  {
    "username": "Vinnichi",
    "rating": 6.0,
    "comment": "A miało być tak pięknie",
    "timestamp": 1745532000
  },
  {
    "username": "Breven",
    "rating": 6.0,
    "comment": "$40 Played twice",
    "timestamp": 1743976800
  },
  {
    "username": "spieleben",
    "rating": 6.0,
    "comment": "Very repetetive. Most turns feel like \"move X attack X\".",
    "timestamp": 1743544800
  },
  {
    "username": "Steezish",
    "rating": 6.3,
    "comment": "3/16/25: Have only played once but this game felt too heavy for its own good in my opinion. I can see the greatness, I just don't think it is a game for me.",
    "timestamp": 1742166000
  },
  {
    "username": "Vladi4ka24",
    "rating": 6.0,
    "comment": "Пипец какая она долгая.",
    "timestamp": 1740697200
  },
  {
    "username": "orangecat17",
    "rating": 6.0,
    "comment": "This game was too convoluted and felt overly and unnecessarily complicated.",
    "timestamp": 1740265200
  },
  {
    "username": "SchmidtsKatze",
    "rating": 6.0,
    "comment": "Rules are too deep for me to enjoy. Challenge was ok, but I guess I never got to the point where it clicked. After 2 games never found the motivation to try again and eventually sold it. Always found something better to play.",
    "timestamp": 1738969200
  },
  {
    "username": "avatar8481",
    "rating": 6.0,
    "comment": "Solo ONLY",
    "timestamp": 1738364400
  },
  {
    "username": "Hyvll",
    "rating": 6.0,
    "comment": "Probably the game I wanted to like the most, but couldn't wrap my head around any meaningful strategies.\nIn the end, it was sleeping money in my shelf and I just parted way with it.",
    "timestamp": 1736118000
  },
  {
    "username": "KlaztheBoardgamer",
    "rating": 6.0,
    "comment": "Probably best game ever made and will be.\nEnough said.",
    "timestamp": 1735254000
  },
  {
    "username": "martybjsg",
    "rating": 6.0,
    "comment": "After 7 plays, very addictive, interesting, and challenging. Takes a while to get into the 'groove' of what it takes to be score points, kill stuff, etc. Don't give up after one or two plays as it is simply a hard game to get your mind around quickly.\n\nThe rulebook situation is a negative - give me one all-encompassing rulebook. There are two rulebooks plus little cards describing sites. There is small wonder that there are many rules questions given there is no way to look up rules effectively and even when I find something I worry that this is not the 'answer' I am looking for.\n\nAfter more plays the rating moves from a 9 to an 8. The four player balance is crazy random. Sometimes it isn't much fun. The three-player is outstanding, so we will work on something to tweak the 4P until we find something that works for us. This game is too original and interesting to give up on. Did I say this game is original? The most original game I've played in years.\n\nAvoid the 4P game. After more plays, it very often leaves one person far behind and not having fun anymore. Seems there are no good ideas on how to balance the 4P game better. Stick to 3P or less.",
    "timestamp": 1733612400
  },
  {
    "username": "stude",
    "rating": 6.0,
    "comment": "Pretty similar to Gloomhaven but with easier setup and perhaps less variety at the end. Just another fighting game with not much else.",
    "timestamp": 1733526000
  },
  {
    "username": "PcToby",
    "rating": 6.0,
    "comment": "It’s quite fun as a 1vs1, but it’s so looong. Each play is 3-4 hours.",
    "timestamp": 1731625200
  },
  {
    "username": "bjsully6",
    "rating": 6.0,
    "comment": "I have played this game. There is a good tactical game in there. It just ends up being a bit too complex to play it. I generally don't have an issue with complex but they made everything in this game complex even moving. Your going to be constantly in the book on this one. It is super long play and incredibly difficult. I would play it but I would generally pick a tactical game less complex to play than this one.",
    "timestamp": 1730156400
  },
  {
    "username": "BennyWu",
    "rating": 6.0,
    "comment": "Too heavy, takes too much space to setup.\nBut a nice game definitely",
    "timestamp": 1728770400
  },
  {
    "username": "jc19019",
    "rating": 6.0,
    "comment": "I see this is widely regarded as one of the best solo games of all time in this genre. I found the game to be very complex, and without some of the benefits of some of my other favorite hex-based overland exploration and combat games. I did like my first three playthroughs but will probably hold off on putting this in my top 10 list rotation.",
    "timestamp": 1724709600
  },
  {
    "username": "ahock7886",
    "rating": 6.0,
    "comment": "Fun to play if you aren't the one who has to set it up lol.",
    "timestamp": 1722636000
  },
  {
    "username": "LabRat002a",
    "rating": 6.0,
    "comment": "I had heard great things about this game, but it's not for me. It reminds me of aspects of Spirit Island, Gloomhaven, and the video game Heroes of Might & Magic, but I like all of those so much more. The tokens & maps look like they come from decades before. The symbology isn't great. The rules are fiddly and dense in this game. I prefer my complicated games to be cooperative. The game gives you open world choices on how to improve your character by exploring, choosing to fight enemies, hiring recruits, leveling up, gaining spells, etc, but it feels like too much work and not enough variety. The adventuring theme feels shallow; there's very little narrative to it. Maybe the only unique thing about the theme is that you are a mage who can take on whole cities by yourself. You definitely feel your power increase over the course of the game, but there's not that much variety in the cards. You can use each card in 3 ways typically. Every card can be turned sideways for a point of move, influence (I.E. currency), attack, or block. It's base ability will be better than that, but more focused. And you can power it with the right color mana to get the better ability on the bottom of the card instead. Mana come in 3 forms. Each turn there are 3 shared mana dice and you are allowed to use one on your turn. Some abilities will give you a mana token, which only sticks around for the turn. Some give you a mana crystal, which can be saved. Movement costs vary depending on the terrain type. And some enemies will attack you if you move adjacent to them. You can spend some movement points on exploring the map when you are on the edge of some sides. You have no choice in how to orient them. They have symbols on the edges that you have to line up. And often you will add tokens face down when a map tile is revealed, and must get adjacent to the token to see what it is. You can do multiple actions with a location usually. You could get quick rewards that lower your reputation making it so recruits won't deal with you. The game wants you to do a balance of good & bad things. Each turn you play cards from your hand until you decide you are done. You must do all your moves first and then can take one action. Unused cards may be carried over to the next turn or discarded. Once you or the NPC timer have gone through your deck, day turns to night and you do it all again. And that repeats for a length specified by the scenario. Forests cost much more movement at night, but deserts cost much less. The sun mana is a wild mana during the day, but useless at night. The dark mana is useless during the day, but can be used for some spells at night. The game gets complex for combat. And not necessarily in an interesting way. There is at least no dice rolling. Though you may go into some fights without knowing what stats you need. The game has many scenarios and ways to tweak the rules, but it just doesn't attract me enough to learn it more. Spirit Island scratches the same itch with more variety in the synergetic choices in less time. Normally if I'm playing solo, I'd prefer a video game anyway.",
    "timestamp": 1720130400
  },
  {
    "username": "Kvothe1981",
    "rating": 6.0,
    "comment": "El juego es bueno, pero muy difícil de sacar a mesa, ocupa mucho espacio y es difícil de explicar a otros.\nLo demás genial (componentes, rejugabilidad, etc.).\nLo acabe vendiendo, pese a que me gustaba...\n(Quizás le de una oportunidad en un lejano futuro).",
    "timestamp": 1717452000
  },
  {
    "username": "andymanpants",
    "rating": 6.0,
    "comment": "There's a lot of great things to say about Mage Knight... and a lot of not-so-great things to say. After a few games, here's my big takeaways:\n\n1) There's a lot you can do in Mage Knight. The game wants to give you the maximum amount of adventure it can with the materials it has. It gives me a similar sense of adventure and scale that comes from a vast role-playing video game like Skyrim. This is what makes the game seriously awesome imo.\n\n2) It's extremely complex, to the point of being bloated. The game introduces mechanic after mechanic, and they all interact in weird, gritty ways that could've been streamlined out. Another point I want to make about the complexity is that there are about a billion different ways of making even the most basic move, which in turn makes sequencing your actions an absolute nightmare.\n\n3) Excellent player progression. There's a number of ways in which you can get more powerful over the course of the game, and they all feel good. With some cleverness and a bit of luck, you can pull off some absolutely insane feats that make your friends green with envy.\n\n4) I know I'm not saying anything new here, but the rulebook is exceptionally terrible. I think whoever wrote it (presumably Vlaada Chvatil) probably realized that Mage Knight is a complicated game, and opted to make the rulebook as \"fluffy\" as possible by chocking it full of unnecessary clarifications and pointless descriptions. Both rulebooks together are about 30 incredibly-dense pages; succinct writing and a smart use of keywords could've cut them down to 15 or so.\n\nAll in all, a flawed masterpiece. Worth diving into, but I wouldn't recommend it to everyone.",
    "timestamp": 1716242400
  },
  {
    "username": "tmoiynmwg",
    "rating": 6.0,
    "comment": "An intricate puzzle through and through. Would like to try the expansion material. Unfortunately it feels way too burly to get to the table in most situations.",
    "timestamp": 1713132000
  },
  {
    "username": "roood",
    "rating": 6.0,
    "comment": "I wanted to like it so bad after enjoying Gloomhaven's top and bottom card system. But I found the rules too fidly (night and day stuff) as well as just never having the cards in my hand that I want to use to do what I want. Example - I need to move here so I can do X next turn. Well, I have no move cards, but I can spend my other cards for generic 1 move point or whatever. But then next round I need to fight. Well, now I have no fight cards because I used them last round inefficiently to get here in the first place.\n\nThis gripe happened enough times in the first few playthroughs, that it felt way too luck based and out of my control that I could never do what I actually wanted to do, and thus never using the cards for their actual abilities. Mixed with fiddly upkeep, this came to a screeching halt for me.",
    "timestamp": 1711494000
  },
  {
    "username": "Kibald",
    "rating": 6.0,
    "comment": "1–4 Players\n60–240 Min\nCoop or comp depending on the scenarii",
    "timestamp": 1710975600
  },
  {
    "username": "GypoNolan",
    "rating": 6.0,
    "comment": "Crunchy game with some interesting gameplay but one that all in all fails to deliver a truly compelling and emersive experience. It feels too cold, lacking for narrative and thematic flair, the word static and lifeless. Perhaps a problem of my own expectations and not so much the game....might try it again eventually after my initial burst of plays on tts.",
    "timestamp": 1709506800
  },
  {
    "username": "TerraNigma",
    "rating": 6.0,
    "comment": "Overburdened with fiddly rules, this game is way too demanding for what it offers in return. Add balancing flaws and a invulnerability glitch.",
    "timestamp": 1708470000
  },
  {
    "username": "RobyaVP",
    "rating": 6.0,
    "comment": "Solo",
    "timestamp": 1707951600
  },
  {
    "username": "Westerlund",
    "rating": 6.0,
    "comment": "M\n\nTo complicated by half. A fun game but the rules are way to meaty.",
    "timestamp": 1707087600
  },
  {
    "username": "Scre3zeR",
    "rating": 6.0,
    "comment": "Bought it because I really liked the theme. Found out that it's too difficult for me to play: I can't find a group that is willing to invest in learning the rules and spending the time. And playing solo takes me so much time (reading and searching rules) that I usually quit midway's, and don't pick it up again for many months.\n\nI'm sure it is awesome once you get good at it, or have the patience/ friends to regularly play. It's not for me. Thinking about selling it.",
    "timestamp": 1706310000
  },
  {
    "username": "cosmolsmith",
    "rating": 6.0,
    "comment": "Unpleasantly surprised here, since I generally love Vlaada Chvatil games. But my first play of this fell flat and I'm not sure why. Played with a friend and neither of us were enjoying it much towards the end.",
    "timestamp": 1706050800
  },
  {
    "username": "leffe dubbel",
    "rating": 6.0,
    "comment": "Mage Knight is the game I was waiting for. Beautiful, smart, varies with possibilities of scenarios diversifying the parties and our approach to the goal. The material is great and the mechanics of deck builder and combat without are for me who hates chance, a treat. Be careful though. To appreciate it, it is best to discover it with an experienced gambler or be ready to pay the investment time he asks. In addition, playing more than two players is very long and the player battles are devastating and can be frustrating. So if he still tempts you, go for it, you will not be disappointed.",
    "timestamp": 1705359600
  },
  {
    "username": "rendesm",
    "rating": 6.0,
    "comment": "boring, static, there's just no point to replay it",
    "timestamp": 1701903600
  },
  {
    "username": "rbran123",
    "rating": 5.8,
    "comment": "Could never get into it. Wasn't particularly difficult, but if I want a deck builder I would have kept aeons end, and regarding hand management I'll play gloomhaven.",
    "timestamp": 1698098400
  },
  {
    "username": "Strakatus",
    "rating": 6.0,
    "comment": "Very cool but long and can be convoluted. The depth of the game is staggering but if you don't have someone on top of the rules and managing the game, you are gonna have a bad experience. That wasn't the case for me, had a great time every time I played this.",
    "timestamp": 1697580000
  },
  {
    "username": "DT76",
    "rating": 6.1,
    "comment": "I've only played the introductory game of this, so I may warm to it more when I go back for another try, but my initial thoughts aren't so kind. I really want to like the game, as it has so many things going for it, but I found it too obtuse.\n\nBeing able to explore this world filled with fantastical locations is great. You have all sorts of options: buying new cards, hiring followers, collecting crystals, sieging castles, sacking monasteries, exploring dungeons, etc. You can decide to be a renowned hero or reviled villain, and both give you advantages. The chrome factor is huge, with bits & chits of all kinds. The day and night phases with different rules are a neat addition.\n\nMy first complaint is that combat is really odd and unintuitive. There are the expected ranged and melee phases. Instead of just dealing damage and subtracting armor, you have to go through this arcane procedure to block and see how much damage each participant takes. Then, you can assign some, but not all of it to your followers?\nThe rules are so generally massive and fiddly that you'll be referring back to the book for lots of questions. They do a good job of putting many things on player-aid cards, but it just isn't enough.\n\nThe big problem overshadowing all others, though, is the deckbuilding style. It's a neat idea, but it it doesn't entirely work, esp. not in a game of this length. Remember when I said you had all those cool options during your turn? Well, it turns out you actually don't. Oh, you can gaze at the map and imagine all the stuff you'd like to do, but then you have to look at your hand and discover how little of it you can feasibly attempt. It's great that you can exchange any card for a 1-point action of any type, but this doesn't really solve the problem. You can easily be staring at a bunch of move cards when you're sitting next to the fortress you want to attack. If you move away, you can do something else, but then next turn you'll likely be in the opposite state: with a handful of attack cards and no move to get you adjacent to something to attack. The game is very tactical this way, asking you to decide what the best thing is that you can accomplish this turn. Of course, you can save over cards from turn to turn, so you can plan ahead and spend only some of your cards, saving the rest for a more potent turn next time.\nAll of this would be entirely fine, if not for one more rule. The day ends when one player exhausts their deck. This means that instead of having the option to take your time, mitigate bad draws, and advance slowly doing incremental things, you're forced to keep pace with the fastest player. Someone is going to get all his/her cards in the perfect order, be able to make best use of all of them, and burn through his/her deck like lightning. If you get your cards in the wrong order or all clumped together, you'll be forced to discard many of them for the generic low-power option, and will fall further and further behind. If you try to mitigate this by playing cautiously and doing small turns, you'll end the day with half your deck left and be no better off. Again, this sort of luck-of-the-draw is entirely expected from deckbuilders, but the problem is that those games generally A. play quickly, not as multi-hour affairs and B. see you cycling through your deck many times (hopefully evening out the luck aspect), not just 3. This even means that adding cool, powerful new cards to your deck isn't that good, since you're still slaved to the pace of the person with the smallest deck and you won't see them more than a couple times max.\n\nWe also turned off PvP, and I'm damn glad we did, since continually having to watch your back would make the experience even more painful. It seems like turn order would become king, as it'd be really easy to ambush someone who had depleted their cards and couldn't fight back.\n\nAgain, I'm going to have to try this a second time, as there was enough there to intrigue me. But this stuff really stuck out and hurt my enjoyment of it the first time through.\n\ned. We've done a couple more teaching runs of late. The problems haven't gone away, but have been less evident and glaring, so I'm bumping it up in response.\nAlso did a solo play to get a better grip on the rules. It’s starting to make sense, but honestly, still not having that much fun. Whether dealing with crappy draws, or watching the dummy/timer deck randomly hit its colors and spill an extra turn’s worth of cards (for the second time!!), or the mana source all getting locked to the same color, it’s just a fight with RNG. It really seems like I’m just struggling with these systems and wasting time, rather than carrying out a coherent plan. I had that realization, then thought “why am I bothering with this mess?? Why don’t I just choose the cards I draw from my deck?” May have to try that next time, if there’s a next time.\n\nPlays: 3 or so",
    "timestamp": 1690322400
  },
  {
    "username": "Duke_Muell",
    "rating": 6.0,
    "comment": "Good game but in my opinion they want to pack to much into this game.",
    "timestamp": 1688767200
  },
  {
    "username": "beaniebee",
    "rating": 6.0,
    "comment": "Fun fact, this was my first play-to-win game I ever won! Not my favorite game genre but not a bad game.",
    "timestamp": 1685570400
  },
  {
    "username": "HackFin",
    "rating": 6.0,
    "comment": "Much better than anticipated. Totally not my favourite kind of game, but I enjoyed my time and would play again.",
    "timestamp": 1681077600
  },
  {
    "username": "Gorgoneion",
    "rating": 6.0,
    "comment": "Tentative rating after one play.\n\nI believe that the downtime of this game is significant and quite frustrating after a while. I also believe that that may be because we had to check a lot of rules now and again.\n\nThis looks like a computer game in boardgame form. It has some deck-building mechanics and there is little you can do each turn. If you get all the movement cards or the attack cards together, which can sometimes occur, you're screwed. The problem is that the discarding is penalizing in this game, so the types of cards you get are going to make a big difference. You just cannot spend cards the \"any cards\" just to have 1 move, 1 attack or 1 influence, because that is going to impact a lot on your overall game.\n\nThis starts as a quite simple game, and becomes very difficult as it goes on. I would compare it to Le Havre: you have so many things that you need to do, and only little that you can actually do. The other players' actions are very relevant since they can make and brake the game for you.\n\nDO NOT play with known AP people.\n\nUPDATE\nI played again. The first impressions stand.\n\nThis game is insufferably long. With just 2 players the game went 4 hours and a half long.\n\nUPDATE\nThe impressions I had are all pretty true, yet I gave the game another go and still it is very long. Should you have a table to keep the game upon you can finish it in a couple of sittings. This time the overall impression was different, time flew by and ended in a contested but satisfying way. Happy to have played it and wanting to come back for seconds!",
    "timestamp": 1679439600
  },
  {
    "username": "jonesy792",
    "rating": 6.0,
    "comment": "Can't argue with the component quality, artwork or gameplay mechanics. All excellent. But despite being a fan of heavier games with lots of rules and intricacies, this feels like it’s not worth the effort to (re)learn and teach. Easily gets beaten off the shelf. I put this down to the fact that a long and laborious “RPG” style game is not scratching an itch for me when it comes to bringing a board game to the table.",
    "timestamp": 1678316400
  },
  {
    "username": "laexpls",
    "rating": 6.0,
    "comment": "First of all. It's a superb game. It looks stunning, the miniatures are neat and I like a lot of the gameplay itself. But boy.. does it take long with 3+ players. And it's more or less a pure solitaire game (if you're not playing the mean variant). I just wanted it to end after 4 hours and had to stand up and leave because it would have been another 2 hours and I had to catch my train. For singleplayer it must be a blast. If I would be into solitaire.. this would have been a lot higher.. maybe 8/10.",
    "timestamp": 1678143600
  },
  {
    "username": "acolyte",
    "rating": 6.0,
    "comment": "This hasn't clicked for me like it has for others. Too many things irritate me. It is needlessly complex and too text heavy. AP is heavy and turns are slow because you feel like you have to plan each one optimally, which seriously decreases FPM (Fun Per Minute). And for goodness sake why do I have to waste all my cool actions just to move somewhere - why can't I just move?! I like leveling up and exploring, but the rest of the game feels tedious. Hoping it improves on repeat play.",
    "timestamp": 1678143600
  },
  {
    "username": "verandi",
    "rating": 6.0,
    "comment": "Despite my aversion to fantasy adventure games, Mage Knight is so well designed that I can't help but admire it. After being taught the game and playing a few times at the WBC, I was intrigued and thought I'd be teaching it to my friends back home. Yet when I tried to tackle the rule book I just got overwhelmed and never came back. I would gladly play if someone else were around to teach it, but in the end it just didn't excite me enough to muster the herculean effort required to be the guy who teaches it. It's too non-interactive for me to really love it, I feel.",
    "timestamp": 1677538800
  },
  {
    "username": "bmben",
    "rating": 6.0,
    "comment": "Holy cow. This thing is deeper than expected.",
    "timestamp": 1677193200
  },
  {
    "username": "Masterofmayhem",
    "rating": 6.8,
    "comment": "A thematic game which tells its story well. Each adventure is different to some extent and the mechanisms aren't too complex after a few plays. Lots of analysis paralysis involved though, so beware if you're prone to it.\n\n25.10.2025 Review: 7.5 -> 6.75 After quite a few attempts, I just couldn't find the fun. I respect the attempt to make such a game, but it had too many flaws for me to keep it.",
    "timestamp": 1761343200
  },
  {
    "username": "jellyfishjoe",
    "rating": 7.3,
    "comment": "The flow of the hand management problem is simply beautiful. It's the ultimate efficiency problem, and that's exactly what I would look for in a solo experience.",
    "timestamp": 1759183200
  },
  {
    "username": "hiimjosh",
    "rating": 7.0,
    "comment": "Excellent solo adventure/euro crossover. A bit big for its britches, but it's always fun to pull out every now and then. Deeply interesting on the same level as Through the Ages",
    "timestamp": 1758232800
  },
  {
    "username": "pedrowski",
    "rating": 7.0,
    "comment": "To be Painted",
    "timestamp": 1757541600
  },
  {
    "username": "fahr",
    "rating": 7.0,
    "comment": "The game is great, but not so great the cost/benefit in fun/hours of play!",
    "timestamp": 1757196000
  },
  {
    "username": "FrancoisX",
    "rating": 7.0,
    "comment": "Excited to have this a solo/couples game. This is a pretty unique game",
    "timestamp": 1756504800
  },
  {
    "username": "Killi",
    "rating": 7.0,
    "comment": "Best solo player game out there, but don't play solo at all, so I sold my copy after a few plays when I realized it takes too long at 2p/3p.\nEven at 1p can drag for many hours, I can't even imagine how bad this would be at 4p, so please never do that!",
    "timestamp": 1756504800
  },
  {
    "username": "Kubidi",
    "rating": 7.0,
    "comment": "Players: 01 - 04\nBest: 01 - 02",
    "timestamp": 1756072800
  },
  {
    "username": "lovelace",
    "rating": 7.0,
    "comment": "2020:\nThis is the first game I bought again after selling it. Back in 2018 when I was new to the hobby I did not like heavy and long games. I still prefer short games, but long games are now fine for me in solo experiences.\nAfter playing it again I bumped up my rating again. It may even rise more because my main criticism is fiddly rules and its length and both these things will get better with repeated plays.\n\n2018:\nGreat feel of acomplishment.\nVery good hand management.\n\nToo long, too fiddly, horrible rules.",
    "timestamp": 1756072800
  },
  {
    "username": "Termino476",
    "rating": 7.0,
    "comment": "Vendido a Bruss",
    "timestamp": 1756072800
  },
  {
    "username": "Minion1981",
    "rating": 7.0,
    "comment": "perfect",
    "timestamp": 1754776800
  },
  {
    "username": "chrisnd",
    "rating": 7.0,
    "comment": "I would probably rate this higher, except for the fact that it can be a very, very long game. I really like the ideas, concepts, mechanics, artwork, and everything else about this game, other than the time that one must dedicate to playing it. That keeps it from being an \"I always want to play\" type of game to a \"yeah, it's a great game and I will occasionally want to play it, if I am in the right mood\" kind of game.\n\nNot that it is overly long for the enjoyment, but it does stretch the limit of \"how much effort do I really want to put into such a long game?\" Other games that are just as long are better, in my opinion.",
    "timestamp": 1750888800
  },
  {
    "username": "criss_mcs3",
    "rating": 7.0,
    "comment": "Good mix between an adventure game and a puzzle game. A lot of card management, long set-up, many rules and fiddly but it's a great solitaire game.\nI hate the scoring system, so I play without it.\nMayday sleeved.",
    "timestamp": 1749938400
  },
  {
    "username": "gwainoj",
    "rating": 7.0,
    "comment": "For all of the years I have had this game, I have only played this game a handful of times. Mostly I play by myself. It is a heavy game that takes a lot of time.",
    "timestamp": 1749160800
  },
  {
    "username": "Doublelift",
    "rating": 7.0,
    "comment": "I like the different scenarios and variable map tiles for a high replayability. The game offers soft deck building It works well as a solo game with different experiences everytime you play. The dummy opponent is very easy to handle.\nThe rule book could be optimized I think. In the ultimate edition it is 50 pages to read which is quite a lot. There are 7 characters to choose from but all feel the same because the starting decks are almost completely identical. The whole fighting is needlessly complicated with numerous icons that are very similar in effect and elemental effects that work differently for attack and defense. The box of the ultimate edition is too large. It easily fits in a box half the size.",
    "timestamp": 1748988000
  },
  {
    "username": "norsedog",
    "rating": 7.0,
    "comment": "Probably need more and non-solo games, but the complexity of hidden state is uncomfortable and gets a bit in the way of planning out moves.",
    "timestamp": 1746396000
  },
  {
    "username": "Tyakraman",
    "rating": 7.0,
    "comment": "+ very thematic\n+ highly brainburning puzzle solving\n- very long setup time\n- overall very time consuming\n- takes up a great amount of space\n- quite complex ruleset",
    "timestamp": 1745532000
  },
  {
    "username": "Aroquesada",
    "rating": 6.5,
    "comment": "Buen juego pese a que los mundos de fantasía no van conmigo\nMecánicas muy pulidas con exploración, combate y todo mediante gestión de la mano de cartas. En cierto modo es un CDG de fantasía.\nEstá bien pensado pero no es en absoluto sencillo, ni para cualquier público. Tiende a hacerse farragoso.\nEl manual me parece un poco lioso tal y como está organizado (2 libretos). La consulta de reglas se hace un poco tediosa por ese motivo.\nPuede hacerse muy pesado jugar con varios jugadores porque es bastante propenso al AP. El combate exige una cantidad de cálculos insano, ya que no se lanzan dados y todo tiene que ser precalculado antes de comenzar. O juegas con él habitualmente o puede dar mucha pereza volver a él después de un tiempo.",
    "timestamp": 1745186400
  },
  {
    "username": "DaddyLudo",
    "rating": 7.0,
    "comment": "It was interesting, but there was too many other games at the moment i wanted more. And it gave me a strange vibe. Got rid of it, but has regretted since.",
    "timestamp": 1744668000
  },
  {
    "username": "larryjrice",
    "rating": 7.0,
    "comment": "Very interesting card driven game in which you just slightly build your deck which is used each day and night. Level up your character, hire sidekicks, learn magic spells, use mana, etc and take down castles, monsters, and towers. Lots of exploring to do and you can always use your card as a wild 1 of most action selections so to speak.",
    "timestamp": 1743976800
  },
  {
    "username": "whimsicaltyrant",
    "rating": 7.0,
    "comment": "Definitely some potential for fun here. Too much work for the payoff though.",
    "timestamp": 1743372000
  },
  {
    "username": "haydenwilkens",
    "rating": 7.0,
    "comment": "huge awesome solo, keep even if i dont play much",
    "timestamp": 1742598000
  },
  {
    "username": "Croquet",
    "rating": 7.0,
    "comment": "[Expansions]\n- Lost Legion\n- Krank Exp.\n\nReview:\none of the best (2-player) game I have played. A very tactical and complex game with deck-building elements and cooperative gameplay.",
    "timestamp": 1742338800
  },
  {
    "username": "MichaelDDarling",
    "rating": 7.0,
    "comment": "Gifted my copy to Tony.",
    "timestamp": 1742166000
  },
  {
    "username": "queerchameleon",
    "rating": 7.0,
    "comment": "gray 340",
    "timestamp": 1742079600
  },
  {
    "username": "keytolife",
    "rating": 7.0,
    "comment": "2",
    "timestamp": 1739919600
  },
  {
    "username": "TheAvalonKnight",
    "rating": 8.0,
    "comment": "A really good exploration game with a LOT of mechanics: deckbuilding, resource management, character development...\nMost of my enjoyment comes from its difficulty, especially in solo play: balancing the efficiency of slow play with the given time to complete the scenario is the key of mastering the game. Can be a long game to play in multiplayer.",
    "timestamp": 1762210800
  },
  {
    "username": "GiantStompyRobots",
    "rating": 8.0,
    "comment": "Cull - give to Nate",
    "timestamp": 1761519600
  },
  {
    "username": "Benncory",
    "rating": 8.0,
    "comment": "Solo",
    "timestamp": 1761429600
  },
  {
    "username": "yabluz",
    "rating": 8.0,
    "comment": "Ho provato tante volte a farmelo piacere ma non riesco. Non posso mettere un brutto voto, non è un brutto gioco, solo che non piace a me",
    "timestamp": 1761084000
  },
  {
    "username": "rws2029",
    "rating": 8.3,
    "comment": "I fully appreciate why this game is loved by so many, and I recognize the excellence of the design; however, when I play MK it feels like an intricate, abstract puzzle, and I don’t find myself fully engaging with the game world. In other words, when I feel like having fun in a classic fantasy adventure, this is not the game I pull out. MK is interesting for the puzzle but not for any story it tells.",
    "timestamp": 1760997600
  },
  {
    "username": "billiv15",
    "rating": 7.5,
    "comment": "With Custom Made Insert/Organizer",
    "timestamp": 1759528800
  },
  {
    "username": "Josearte2001",
    "rating": 8.0,
    "comment": "Juegazo para solitario. Tiene unas mecánicas increibles. Cuesta cogerle el truco pero inmersivo y te atrapa",
    "timestamp": 1758837600
  },
  {
    "username": "Indy500sr",
    "rating": 8.0,
    "comment": ".compleet\nEAN 634482704950\nGL7",
    "timestamp": 1757973600
  },
  {
    "username": "b4retina",
    "rating": 8.0,
    "comment": "Added Broken Token Organizer\n\nSolo Conquest 9/19/24 - W, 125pts,Tovak\nSolo Conquest 9/13/25 - W, 149pts,Norowas",
    "timestamp": 1757800800
  },
  {
    "username": "groovychainsaw",
    "rating": 8.0,
    "comment": "Very complex! Not played for a while but very good.",
    "timestamp": 1756418400
  },
  {
    "username": "BJOSEPHLYON",
    "rating": 8.0,
    "comment": "No PICS\nLBC 40E",
    "timestamp": 1756245600
  },
  {
    "username": "onesones",
    "rating": 8.0,
    "comment": "开不动",
    "timestamp": 1755727200
  },
  {
    "username": "marinexx",
    "rating": 8.0,
    "comment": "This is THE best game in the world! I play with myself, i play with my gf. It has it all - dice, cards, deckbuilding, tokens, fighting bad guys, exploring, cooperating, fighting other players (so interactive), it feels as an RPG! I have not played a game that does it better... and this game does everything AT ONCE better!",
    "timestamp": 1755727200
  },
  {
    "username": "DeadDomino",
    "rating": 8.0,
    "comment": "I did love it years ago, but really it's mostly a solo game and I just don't really have/make time for that nowadays.",
    "timestamp": 1755554400
  },
  {
    "username": "surrutia",
    "rating": 8.4,
    "comment": "2",
    "timestamp": 1755295200
  },
  {
    "username": "ScotchYeti",
    "rating": 8.0,
    "comment": "Still learning the game but I can already say: wow! I love strategic RPGs and to see it squeezed into a boardgame is quite a feat. Rating will very likely go up.\n\n=====\nUpdate July 2025:\n\nAnother game that requires dedication. I have played it previously and lost quickly. Long setup, relearning the rules and finding the right strategies make it impossible to quickly pick it up and just play.",
    "timestamp": 1754431200
  },
  {
    "username": "Pedrothegreat11",
    "rating": 8.0,
    "comment": "This would be the best game if there were some simplifications, it takes so long for a simple scenario to prepare and go through ...",
    "timestamp": 1754172000
  },
  {
    "username": "darionnova",
    "rating": 8.0,
    "comment": "I played through once. Didn't know what the hell I was doing. I but I have a much better handle on the flow of the game. Some people say you get an RPG feel out of it. You do, kinda. But there is a lot of problem solving going on. That part is actually epic.\n\nUpdate: It's not that type of game. And despite the theme, I certainly do not get an adventuring feel from this game. The adventure you take feels very abstract. That's why I bought Runebound 3rd edition and all of its expansions except for the competitive one. And Runebound delivers that epic adventuring feeling very well.\n\n\nAlso, I do not find the game as difficult as some make it out to be in terms of learning the mechanics of the game.\n\nI don't know. I know this game is popular, but I get an abstract mechanical feel out of it. And I do like abstracts. All games are abstracted to a point. I get that. But as of right now. I'm just not feeling Mage Knight. I do think my score will improve as I get better and more familiar with game play, but that day is not here yet. And it has nothing to do with me not liking heavy Euro influenced games. My COIN games are much heavier and they are Euro based. They are among my very favorite games.\n\nA side note: War games are typically a lot more complicated than regular games. Even though the weight on Mage Knight is the highest of any game I own, the three COIN games I have and the Lock n Load Tactical games are faaaaaar more difficult to play than Mage Knight. And both sets of wargames are of medium complexity for wargames. That should tell you a lot about the wargame hobby. And that is why I'm hardly a genuine grognard, through and through.\n\nFurthermore, COIN has been described as several steps up in complexity over a medium Euro, making the hardest COIN games (the ones that I have) much more difficult than most, if not all, heavy Euros. I've seen players of COIN compare the difficulty to the heaviest Euros out there. And they all say that COIN is heavier.\n\nI play a lot of solitaire so I need a game that is very deep and engaging to make that experience worthwhile. So being super heavy helps.",
    "timestamp": 1750888800
  },
  {
    "username": "Beer4Dad",
    "rating": 8.0,
    "comment": "My favorite BIG solo experience game. The juice is definitely worth the squeeze for this bad boy.",
    "timestamp": 1750888800
  },
  {
    "username": "mmychal",
    "rating": 8.0,
    "comment": "Rated for its play as a solo game. I don't think I could ever play this one with more than 1 player. It's a great puzzle with fun mechanics. If I played with more, they would really have to be into it.",
    "timestamp": 1749592800
  },
  {
    "username": "onceplayed",
    "rating": 7.5,
    "comment": "need to play more but my problem with mk is that all there seemed to be very little decision space in your turn by turn play as it mostly seemed that there is one favorable way to play your cards. so that means the juice is only in the shopping, which is kinda meh. its gonna be 7-9 for me depending how later plays will go.",
    "timestamp": 1749333600
  },
  {
    "username": "mudekk",
    "rating": 8.0,
    "comment": "I probably should rate it higher.",
    "timestamp": 1748210400
  },
  {
    "username": "Han_Heinrich",
    "rating": 7.5,
    "comment": "Sold whole bundle (incl. Krang and Lost Legion, both unplayed) in early 2025.",
    "timestamp": 1748124000
  },
  {
    "username": "Eternalsun",
    "rating": 8.0,
    "comment": "One of the best solo game ever",
    "timestamp": 1747346400
  },
  {
    "username": "SageClock",
    "rating": 8.0,
    "comment": "EDIT: Bumped the rating from 3.5 to 8. Played through it once alongside the Beyond Solitaire First Reconnaissance playthrough, and that helped me get enough of a handle on it that I was able to play a game pretty without looking too much up afterwards. I also now know that you should probably almost entirely avoid wound cards if you can help it, and (mostly) only engage in battles you know you have the resources to win ahead of time. I'm starting to get why this is so beloved as a solo game now, although I'm not quite to the point where I'm putting it above my other solo favorites yet.\n\nAlso I still wish the Ultimate Edition box were a lot smaller.\n\nOriginal: Initial impression after finally trying to get a handle on the game. Feels a little too much to keep track of when playing solo for me. I couldn't get past the first round before wanting to put it away and retackle it later. Maybe. I know this is supposed to be like the best solo game ever, but at the moment I'm just no feeling it.\n\nI play a ton of solo games, and for the most part the games consistently rated at the top every year I've very much enjoyed when I played them. Spirit Island, Arkham Horror TCG, Marvel Champions, Gloomhaven, Gaia Project, Nusfjord, all great games, and even those that I'm a little less enamored with I still mostly enjoyed (i.e. Too Many Bones).\n\nSo far I haven't found a single thing I've enjoyed about Mage Knight when playing it. Movement is annoying, combat is annoying, wound cards are super annoying. Not sure how long I'll hang on to this.",
    "timestamp": 1747260000
  },
  {
    "username": "ToBakai",
    "rating": 8.0,
    "comment": "Ich erkenne das epische Spielgefühl und auch den Ruf dieses Spiels an, allerdings ist es etwas zu glücklastig.",
    "timestamp": 1747087200
  },
  {
    "username": "Ravenholmwacht",
    "rating": 9.0,
    "comment": "X",
    "timestamp": 1762600080
  },
  {
    "username": "ditterio",
    "rating": 9.0,
    "comment": "Complete rules reference: https://boardgamegeek.com/filepage/75296/complete-rules-refe...\n\nSolo scenario book: https://boardgamegeek.com/filepage/244981/mage-knight-solo-s...\n\nLost Relic scenario, only 2 rounds (approximately 90 minutes), can be played with components of only the base game: https://boardgamegeek.com/filepage/166920/mage-knight-shades...\n\nPlayer aid: https://boardgamegeek.com/filepage/74377/mage-knight-player-...\n\nThe rulebook is a nightmare and the rules are complex but apart from that, it's one of the greatest games ever made.",
    "timestamp": 1761692400
  },
  {
    "username": "yodadood",
    "rating": 8.6,
    "comment": "Expansions & Upgrades:\n- The Lost Legion\n- Dual Color Cards",
    "timestamp": 1760911200
  },
  {
    "username": "mingrkli",
    "rating": 9.0,
    "comment": "You like RPGs? You like deck-building? You like exploring dungeons, raising armies, and conquering mighty cities with unstoppable magic and steel? Here it is one of my favorites Mage Knight! One of my top 5! A 1–4 player epic adventure where you become one of four powerful Mage Knights carving your legend into the lands once ruled by the Atlantean Empire.\n\nHow do you win? That depends because Mage Knight can be played solo, co-op, or competitive! Team up to conquer cities together, or go free for all where only one Mage Knight will rule it all. Either way, your journey is about building the strongest deck, gathering spells and skills, exploring caves and dungeons, and crushing anyone who stands in your way.\n\nEvery turn, you’ll use cards from your deck to move, fight, recruit followers, or unleash devastating magic. As your deck grows, so does your power transforming you from a wandering knight into a city-conquering force of nature.\n\nMage Knight is the ultimate mix of RPG storytelling, deck-building strategy, and tactical board game play. Will you rise as a legendary hero… or will your empire crumble before it even begins? ⚔️✨",
    "timestamp": 1760479200
  },
  {
    "username": "StupidRatCreature",
    "rating": 9.0,
    "comment": "See Mage Knight Ultimate Ed.",
    "timestamp": 1760392800
  },
  {
    "username": "MorelliBuendia",
    "rating": 9.0,
    "comment": "I own the Ultimate Edition.\n\nSo much going on here. I have only played with the base game for now, which is good for many games.\n\nThe heroes are completely different. The special cards and the abilities that you get when leveling up are crucial, and they radically change the way you need to play with each character. It might look like just a few things, but they make a huge difference.\n\nI have tried this as a 2p game and also solo, both are excellent. I would never play with more than 2p, I have other games for that. I had never played solo games before, and I usually don't like it, but this one is great.\n\nI love the videogame feeling of leveling up and improving your character, getting new cards and becoming more powerful.\nLots of scenarios, enemies, tiles... no two games are alike.\nGreat variability with the different heroes, which garantees even more replayability.\nA brain-burner, about optimizing, taking risks and wounds, and doing your best with the cards you have. Finally figuring out the combo to kill a dragon or conquer a city feels great.\n\nMogul Scale: 4/D. Could be a 5, since I'm probably making some mistakes every time I play, but since it's solitaire... who cares. It could also be an E, since it's very hard to master and I never manage to conquer the second city.",
    "timestamp": 1759442400
  },
  {
    "username": "Gabranth",
    "rating": 8.8,
    "comment": "Me",
    "timestamp": 1759356000
  },
  {
    "username": "Salvatore_81",
    "rating": 9.0,
    "comment": "Interesting mix of game mechanics working together almost flawlessly. Vlaada Chvatil is definitely one of my favorite designers. Lost legion expansion completes the gaming experience and is a must buy for the fans of the base game. Well I actually think the base game should be Mage Knight + Lost Legion.\n\nRating based on the base game and the lost legion expansion combo.",
    "timestamp": 1759183200
  },
  {
    "username": "doktor avalanche",
    "rating": 9.0,
    "comment": "& Krang\n& The Lost Legion\n& Shades of Tezla",
    "timestamp": 1759010400
  },
  {
    "username": "Desiderata",
    "rating": 8.5,
    "comment": "It seems to be the best game as an adventure-type slay monsters and level up type of game. Magic Realm is just too outdated and overly-complex. Dragons Down is a much improved MR, it just isn't as fun as MK. MK, while not perfect, is a reasonable alternative. An Ameritrash game that takes a lot of unnecessary randomness out--a hybrid then? What's more is that it is a good game to play solo, although I much prefer it two player. My gripes with it (admittedly minor) are the ugly card art and miniature figurines. The art is good quality, in fact, but the depiction of human(oid) creatures is where it fails. The art on the cards is very colorful and effective, and certainly is an improvement over cards with no art at all. I don't use the city minis (you really only need to know what color enemy tokens to put out, which could have easily just been depicted on one of the many reference cards), and the mage knight minis would be better as a wooden disc with a sticker depicting the Mage Knight. It could even be double sided, and you flip it over when you pass. But, at least they're prepainted which is a nice improvement over gray monotone.\n\nI'm not a huge fan of deck-building, but there's enough of the game outside of this mechanic to make it fun. It's more hand management than deckbuilding, since you aren't required to discard your hand at the end of your turn, and aside from Wounds, there aren't any completely useless cards (I'm looking at you, Dominion). The icons work well, and I have to mention that the art and site locations on the terrain tiles are of excellent quality and make for very clear gameplay. This game is certainly heavy and fiddly with a few rules exceptions, but it's worth every bit of the struggle to get there. Everything is thematically intuitive as well as important for game balance.\n\nOh, and in case it matters, I know nothing of the original Mage Knight minis game or the MK setting.\n\nHappy to play this 2 player only. I've played it solo, and it works fine if solo games are you thing. But I don't think any players beyond the second really add to the game. And the downtime with that 3rd (or 4th!) would be excessive.",
    "timestamp": 1757628000
  },
  {
    "username": "javitowildchild",
    "rating": 8.5,
    "comment": "****2019****\nUna vez superadas las primeras partidas y entendidas las reglas completamente, un juegazo que siempre da lugar a tardes memorables.\nPROS:\n+El puzzle definitivo\n+Muy bien integradas todas las mecánicas\n+Las reglas, aunque son muchas son muy intuitivas\n+Héroes muy variados pese a solo tener 2 cartas propias (con la expansión)\nCONTRAS:\n-Injugable a más de 3 jugadores\n-Para mi es un cooperativo, no tiene sentido el PvP\n-Escenarios muy similares, aunque esto se arregla con la expansión\n-Efecto bola de nieve, si empiezas bien vas a más si empiezas mal... te va a costar\n****2025****\nUn juego que ha envejecido genial, las mecánicas siguen funcionando y siendo interesantes y frescas. Pese a que hacía bastante que no lo jugaba, rápidamente se recuerdan unas reglas que son muchas pero (casi siempre) bastante intuitivas y que hacen que la partida fluya. Además, tengo que reconocer que,sin ser yo ese tipo de jugador, el solitario va de lujo. Me quedo con ganas de más. Un juego sin lugar a dudas sobresaliente siendo su mayor problema la duración de las partidas provocado principalmente por el AP al abrumar las opciones.",
    "timestamp": 1757368800
  },
  {
    "username": "xCNapo",
    "rating": 8.6,
    "comment": "Best solo game out there.",
    "timestamp": 1756677600
  },
  {
    "username": "aadepizol",
    "rating": 9.0,
    "comment": "Very interesting war game.",
    "timestamp": 1755986400
  },
  {
    "username": "zubor",
    "rating": 9.0,
    "comment": "Excellent game but should not be played with people prone to AP. Excellent for solo play!\nThis is my 3rd pure 10.\nEdit: after handful of solo games played I think that I'll never get bored with this game!\nSOLD it twice! Just purchased for third time",
    "timestamp": 1755813600
  },
  {
    "username": "Spelspelare",
    "rating": 9.0,
    "comment": "Such a great game. I really love the deck building and the choise of playing co-op or comp. The game takes some time to finish, wich is both good and bad.",
    "timestamp": 1755208800
  },
  {
    "username": "Finite",
    "rating": 9.0,
    "comment": "One of the few games actually fun as solitaire",
    "timestamp": 1754949600
  },
  {
    "username": "SlickUK",
    "rating": 9.0,
    "comment": "Physical Copy",
    "timestamp": 1754776800
  },
  {
    "username": "amirnazemi",
    "rating": 9.0,
    "comment": "I own the Ultimate Edition of Mage Knight, and it IS one of the best SOLO adventure experiences ever made. The co-op and competitive modes are enjoyable (provided you do not mind the long playtime), but the game truly shines when played solo.",
    "timestamp": 1754776800
  },
  {
    "username": "laneug",
    "rating": 9.0,
    "comment": "Weighty strategy game.",
    "timestamp": 1754517600
  },
  {
    "username": "Justin_Oke",
    "rating": 9.0,
    "comment": "I love this game but holy hell there are so many rules. The setup takes some time too but I don't even mind setting it up. The complexity of solving a puzzle which each hand I find fun and finding a way to beat an enemy and slowly get stronger is rewarding. I have only every played solo and have tried many of the different scenarios.\n\nUpdate: this rarely sees play due to the complexity and time it takes to relearn but it is very fun when I do give it a go so only a minor reduction in score.",
    "timestamp": 1753567200
  },
  {
    "username": "Sportsam26",
    "rating": 8.5,
    "comment": "A wonderful roleplay-esque game for when you want a character to control and roam a map with your friends. Explore, fight, gain skills to fight big boss at the end. Some co-op, some competition",
    "timestamp": 1753394400
  },
  {
    "username": "horarp",
    "rating": 9.0,
    "comment": "Ez egy nagyon király hero RPG",
    "timestamp": 1753048800
  },
  {
    "username": "Goatcabin",
    "rating": 9.0,
    "comment": "This is a very thinky but satisfying puzzle that involves consistently getting better and doing cooler things. The fantasy theme is meh for me in general, but it fits here, and I don't mind it.\n\nAfter first (failed) solo conquest, I see what the hubbub is about. The game requires long-term planning (you're planning sieges on heavily fortified cities!) and tactical prowess (how do you wisely use the cards you've been dealt?). Not really interested in playing this with a full table, but wow, is it a compelling solo experience.\n\n--Won first conquest (5/31/2020). EPIC.\n\n--After eight months away, I sat down to play, and...hoo boy, that game was rough. Not sure if I want to reinvest the effort to learn it if I have to play every month or two to keep it fresh.\n\n--After nearly four years, I had a hankering to play again, and this still slaps (and slaps my brain around).",
    "timestamp": 1752444000
  },
  {
    "username": "mighty_scoop",
    "rating": 9.0,
    "comment": "u",
    "timestamp": 1752357600
  },
  {
    "username": "BggTroll",
    "rating": 9.0,
    "comment": "solo\nrated for Ultimate Ed.",
    "timestamp": 1750975200
  },
  {
    "username": "Lilster82",
    "rating": 9.0,
    "comment": "Great for solo play and the game that got me hooked on boardgames. set up and take down takes less time each time you play the game. Read rule book at least once and watch any instructional videos during your first playthrough",
    "timestamp": 1750802400
  },
  {
    "username": "pintman",
    "rating": 10.0,
    "comment": "Das Spiel macht vieles, vielleicht sogar alles richtig. Deck Building kombiniert mit Exploration und Kämpfen gegen Monster Städte oder andere Spieler. Dabei ist es sehr taktisch und strategisch.\nLeider funktioniert es nicht mit vielen Spielern.",
    "timestamp": 1762470000
  },
  {
    "username": "djfuts",
    "rating": 9.5,
    "comment": "You know when you experience a piece of art that just makes you feel like you played something ahead of it's time and outstanding. This is it. Kind of reminds me of the way I felt playing Ocarina of Time for the first time.\n\nLooking forward to the new expansion in 2026 the unboxing was awesome!",
    "timestamp": 1762038000
  },
  {
    "username": "Scifi66",
    "rating": 10.0,
    "comment": "Another commenter said it best, this game is better with fewer players! I'd only play solo or with one other player. One of the best games for disappearing into a time warp ever invented. I've played sessions where I've started with a hot coffee and finished with a full cup of cold coffee. Whether solo or co-op, this is a heavy game with plenty to think about every turn and an iconic title in the hobby. If you like the base then rush out and buy the Lost Legion expansion, better all around. Or pony up and get the Ultimate Edition which has it all.\n+ Hard game = brain burner\n+ Mammoth amounts of depth, breadth\n+ Adjustable difficulty settings\n+ Each turn is a mini puzzle\n+ Incredibly satisfying\n+ Pre-painted miniatures\n+ Board variety through hex tiles\n+ Gratifying build up to end game\n- There are a lot of rules to remember\n- Considerable setup time\n\nIncludes Lost Legion.",
    "timestamp": 1761951600
  },
  {
    "username": "goschel",
    "rating": 10.0,
    "comment": "A bit too long and complex, but fun!",
    "timestamp": 1761692400
  },
  {
    "username": "Mino516",
    "rating": 10.0,
    "comment": "It's one of our favourite game of all time - it's epic, highly strategic, very immersive and incredibely satisfying and has infinite replayability. Masterpiece (the only reason I don't own it that I grabbed Ultimate edition instead)",
    "timestamp": 1761519600
  },
  {
    "username": "taloskhaos",
    "rating": 10.0,
    "comment": "Update: rating of 10 is for solo play which I still LOVE, I am unwilling to play this with others in almost all cases due to its complexity and length. If it was not solo this would mean it would have to be a 6.5 as it is a game I love but would be unwilling to play, but I will keep it at a 10 since I still play it solo.\n\n---------------\n\nFavorite game: Q4 2021 - 2023 (although it has been in my top 10 since 2014)\n\nA very fun hex-grid game of exploration and combat with a nice fantasy theme. Puzzle enthusiasts will also like the interesting decisions to make in combat. The game is extremely long and complicated but the artwork and pieces are fantastic. I really feel like I am playing a great RPG-esque fantasy game when I explore the lands of Mage Knight.\n\nThis game takes me back to my youth playing RPG games on commodore amigas and perhaps it is that sentimental value that drives this over-the-top with its adventure feel to be one of my favorite games of all time.\n\nFor a long time I had this as an 8 or 9 on my list because it is insanely complex & long, but if you want a fantasy adventure game with all the trimmings, look no further.",
    "timestamp": 1760911200
  },
  {
    "username": "magic_erwt",
    "rating": 9.5,
    "comment": "Version\n● Ultimate edition",
    "timestamp": 1760911200
  },
  {
    "username": "diamondinblue",
    "rating": 10.0,
    "comment": "2025 Oct: 10",
    "timestamp": 1760220000
  },
  {
    "username": "chebinche",
    "rating": 9.9,
    "comment": "Part of the Ultimate Edition.",
    "timestamp": 1760047200
  },
  {
    "username": "AwemanTheFirst",
    "rating": 10.0,
    "comment": "An awesome solo puzzle with rules for multiple players. No, it's actually very thematic.",
    "timestamp": 1759269600
  },
  {
    "username": "phunter",
    "rating": 10.0,
    "comment": "+Krang\n+Lost legion\n+Event decks",
    "timestamp": 1759183200
  },
  {
    "username": "alber23",
    "rating": 10.0,
    "comment": "One of my favorite board games, and certainly my favorite heavy one. Mage Knight achieves elegantly and smoothly what other RPG exploration games try to grasp at.\n\nFull of crunchy thinking, with consequences for poor play yet not irreparable in face of disaster. Actions have consequences and yet you must constantly throw yourself into situations where you are unsure about the immediate outcome in order to suggest.\n\nCon: not particularly conducive to 2p and downright hostile to more. It feels very much like 2p solitaire in co-op (and in fact it's a bit more restrictive to try to not get in each other's way).",
    "timestamp": 1758319200
  },
  {
    "username": "svengineer99",
    "rating": 9.5,
    "comment": "House ruled variant",
    "timestamp": 1758232800
  },
  {
    "username": "gregor1863",
    "rating": 10.0,
    "comment": "Fantastic fantasy game that is surprisingly easy to learn, but difficult to master. Although it looks intimidating, the programmed instruction rule book introduces the game in bite sized chunks. Each turn you're faced with many options that grows your hero's power and influence. Finally, there is so much re-playbility in the box that I can see nearly limitless possibilities.",
    "timestamp": 1756591200
  },
  {
    "username": "rhcorvin",
    "rating": 10.0,
    "comment": "138pkt",
    "timestamp": 1756418400
  },
  {
    "username": "PhiloKyle",
    "rating": 10.0,
    "comment": "Hard to table, but if you have the time and patience, it’s one of the best out there.",
    "timestamp": 1756418400
  },
  {
    "username": "gabagaba",
    "rating": 10.0,
    "comment": "Very thinky and rules heavy. Every turn is a puzzle and your actions create a great narrative story. It's basically a puzzle game with theme!",
    "timestamp": 1756332000
  },
  {
    "username": "VultR",
    "rating": 10.0,
    "comment": "Solo Mode: Unforgiving, Demanding, efficiancy puzzle, figures, ultimate puzzle.\n\nNot recommended to play multiplayer.\n\n3-4hrs, Cards, high replayability\n\nLowest Price: $61.59\n8/26: $101",
    "timestamp": 1756159200
  },
  {
    "username": "KalialDagar",
    "rating": 10.0,
    "comment": "The best game of all.",
    "timestamp": 1754776800
  },
  {
    "username": "Ignaticas",
    "rating": 10.0,
    "comment": "Best solo game I've played so far",
    "timestamp": 1754776800
  },
  {
    "username": "djselatan",
    "rating": 10.0,
    "comment": "Mage Knight is the king!",
    "timestamp": 1754431200
  },
  {
    "username": "Shpamo",
    "rating": 10.0,
    "comment": "The best board game ever made.",
    "timestamp": 1753999200
  },
  {
    "username": "norbideejay",
    "rating": 10.0,
    "comment": "[solo]",
    "timestamp": 1753653600
  },
  {
    "username": "archi206",
    "rating": 9.7,
    "comment": "Solo Conquest :111\nNeed to practice more to get artifact and spells\n\nsecond: 176\n\nthe best game ever including solo and multi experience\ngettimg advanced action and artifact card is extremely fun and satisfying. Getting more unit feels like composing an army. Leveling-up and choosing skills also well executed as an rpg game. City combat feels a bit too long",
    "timestamp": 1753394400
  },
  {
    "username": "demonyang",
    "rating": 10.0,
    "comment": "Good game.",
    "timestamp": 1752703200
  },
  {
    "username": "apkendrick",
    "rating": 10.0,
    "comment": "This is likely destined to become one of my favorite games of all time. Incredible. Though I enjoy having another player present for the adventure, I think it is ideally a solo game and will be played that way most.",
    "timestamp": 1752271200
  }
]