[
  {
    "username": "FriendlyBeeGameCo",
    "rating": 1.0,
    "comment": "Terrible, barely playable. Hours longer than you’d expect feels like you’re literally trapped in a dungeon while playing. Torturous. Would not wish this on my worst enemy. Absolute slog, not fun or creative, boring. Can’t say enough bad about this.",
    "timestamp": 1755381600
  },
  {
    "username": "Floating World",
    "rating": 1.0,
    "comment": "Expansions should not be ranked.",
    "timestamp": 1754172000
  },
  {
    "username": "taragalinas",
    "rating": 2.0,
    "comment": "Combines the worst parts of deck building with the worst parts of dungeon crawling and turns it into one of the most pointless and painfully drawn out experiences you're likely to have at a gaming table.\n\nAvoid!",
    "timestamp": 1740351600
  },
  {
    "username": "Gregol",
    "rating": 2.0,
    "comment": "Wow, not seeing the appeal of this game. Maybe I would like the version without the tiles. I don't find any of the decisions interesting in the least bit. The game is utterly and completely ramdom and too long for a game of this type. With 5 players, planning ahead seemed not existent. Draw random cards, to move to a random tile, to see what what random stuff you find. Wait 10mins for the other players then take your 30second turn. Repeat for two hours.",
    "timestamp": 1726351200
  },
  {
    "username": "tscox87",
    "rating": 3.0,
    "comment": "I prefer the simplicity (and speed) of the original. This was too convoluted and slow for my taste.",
    "timestamp": 1746741600
  },
  {
    "username": "myyysha",
    "rating": 3.0,
    "comment": "This exercise in boredom came out recently?????\nI thought the deckbuilders did some progress since Dominion and the designers KNOW there must be some options to remove cards. Really, after 2 hours of gameplay, to have the deck full of starter shite, no.\n\nIt's also sorta ugly on the table, but that's not really a problem.",
    "timestamp": 1735772400
  },
  {
    "username": "Hinmatt",
    "rating": 4.0,
    "comment": "I enjoy deck-building. Unfortunately, this game has a few weaknesses:\n- It's too long for what it is especially with four players. Players' turns can take quite a while and this game can lead to analysis paralysis.\n- The push-your-luck factor of the game is a bit too punishing for such a long game. Pure luck can decide if you make it out of the catacombs or find treasures which are worth many points.\n- This is a player elimination game. If it were a shorter game, I'd be OK with that. But players can die with still a few rounds to go. All they can do in that time period is rolling a few dice to check if others get damage.\n\nAdditionally, the dungeon crawl theme is not appealing to me. I haven't played the original Clank! and am willing to try. This version I cannot recommend though.",
    "timestamp": 1751580000
  },
  {
    "username": "leisenstein",
    "rating": 4.0,
    "comment": "I know a lot of people like this version of Clank, but In Space is my favorite. I know there is Randomness in all deck builders but adding this exploration mechanism just piles on top of the existing random draws. I did not care for that.\n\nI would love to see a version of Clank that is more of a Dominion style deck builder with a fixed card market.",
    "timestamp": 1750024800
  },
  {
    "username": "Creativenothing",
    "rating": 5.0,
    "comment": "Catacombs fixes the main issue with I had with the original clank. The map of the original meant there was a binary choice, the optimal path, or the suboptimal path. The options have been completely opened up in this variant of the game.\n\nI would actually consider this more of a light deck builder / exploration game than a true push your luck game. Ultimately, everyone is taking a decent amount of risk against the dragon, and will leave the catacombs at fairly similar times. Dying early is very unlikely, and would spoil the fun anyway.\n\nWhich leads into my criticism of the game, player elimination. While catacombs has done better than some games, there is still far too much time between a player being eliminated and the game ending.",
    "timestamp": 1762605300
  },
  {
    "username": "rayzg",
    "rating": 5.0,
    "comment": "2025-10-17: I loved the tile laying. But I don't like deck building at all, and the deck building in this game is really, really bland. The deck building also really slowed the game down.\n\nThe game itself is really fiddly as well.",
    "timestamp": 1760824800
  },
  {
    "username": "Otacon003",
    "rating": 5.0,
    "comment": "At its core it’s a good game but I feel like it overstays its welcome and is weighed down by one too many game mechanics.",
    "timestamp": 1756591200
  },
  {
    "username": "GuySamstag",
    "rating": 5.0,
    "comment": "You've got it with the space one already. Just stop.\nSeriously though, adding \"exploration\" to this system -- what exactly are they trying to achieve here? This kind of artificial \"design for replayability\" is a plague.",
    "timestamp": 1753135200
  },
  {
    "username": "teejam2",
    "rating": 6.0,
    "comment": "If the deck building was tighter it would probably be a 10/10.\n\nAs it is, you never really feel like you built your deck or pull off anything really notable with it. You just buy the best card available to you.\n\nThe exploration and collecting treasure is still really fun though.",
    "timestamp": 1761692400
  },
  {
    "username": "pocoloco",
    "rating": 6.0,
    "comment": "While the build-the-dungeon-as-you-go mechanic feels fresh at first, it’s surprising how samey the game feels despite the random dungeon generation by player choice. I’ve played it countless times now and it isn’t really that interesting. I generally prefer team games with a shares deck or a draft variant for faster play and potentially more assymetry. Some characters are broken in this one so you can’t really play with them. I prefer to go back to Mummy’s Curse or Clank! in Space if I want variability instead of multiple games of C!C - the map generation alone doesn’t make the game better when cards are unbalanced - luck of the draw is a way bigger factor here - point inflation make scores laughably high, the teleportation portals make map generation and tile placement often feel redundant considerations, and the endgame isn’t really a thing because leaving earliest usually will lose you the game due to lost turns and less danger from Dragon attacks for your opponents with only 4 cubes drawn instead potentially 6 or more on your turn in place of an actual timer and escalation in danger as in the other variants (which thematically makes way more sense).",
    "timestamp": 1759096800
  },
  {
    "username": "badeschwamm",
    "rating": 5.8,
    "comment": "I was disappointed. There are far better exploration games like Revive. And the draw luck can screw you up easily.",
    "timestamp": 1754949600
  },
  {
    "username": "Arnar146",
    "rating": 6.0,
    "comment": "Gulli",
    "timestamp": 1754517600
  },
  {
    "username": "Joel_L",
    "rating": 7.0,
    "comment": "It's Dominion plus dungeon exploration, treasure hunting, monster fighting, and a race against the clock. Lighthearted fun.",
    "timestamp": 1762569240
  },
  {
    "username": "BrzdekPL",
    "rating": 7.0,
    "comment": "First board game",
    "timestamp": 1762297200
  },
  {
    "username": "BradJacobs",
    "rating": 8.0,
    "comment": "Clank! Catacombs is my only entry into Clank, and I really enjoy it. I think this is a random silly family game that hits all the spots. It's fun, it's not overly serious, it's not completely random either, and it's thematically funny. I think it's best at 3 or 4. and even then it doesn't overstay its welcome. I think we will definitely own someday to play it with the kids.",
    "timestamp": 1762656720
  },
  {
    "username": "xcaptnmorgan",
    "rating": 8.0,
    "comment": "Clank Catacombs (4) w Expansion Lairs and Lost Chambers, Adventuring Party, metal cubes and coins, beautiful 3d printed insert and card holders.",
    "timestamp": 1762623240
  },
  {
    "username": "Aition",
    "rating": 9.0,
    "comment": "Avontuurlijke ‘deck builder’ in een ‘dungeon’-setting met een ‘push your luck’-mechanisme dat voor de nodige spanning zorgt.",
    "timestamp": 1762625160
  },
  {
    "username": "nodnarber1",
    "rating": 8.5,
    "comment": "2nd play thoughts (4p): Ok, I take back what I said before. I don't know what I was thinking, the dungeon paths are fine. I think I can finally let go of my old Clank! because this is just objectively better. We added in the Lairs and whatever expansion and it was an easy add, except the special rooms were a little hard to learn. I don't see me ever playing the OG Clank! anymore.\n\n----------\n\nI was expecting this to the be the perfect Clank! but after 1 play I'm undecided about the modular dungeon. It was honestly very confusing, like one of those squiggly follow-the-line puzzles you did in a book as a kid. Everyone died except one person after realizing we were farther away from safety than it seemed. on the other hand, it was kind of fun flipping tiles not knowing what's around the next corner.\nI thought I was going to never go back to original Clank! but now I think it may depend on my mood. I do really enjoy the new lockpick mechanism. The prisoners are fine, the ghosts are fine (taken from legacy). What else is new? Overall good. (3-31-23)\n\n\nModular dungeon? Why didn't they think of this before? This may replace Clank! for me.\n\nTGG 42.99 + shipping 1-16-23",
    "timestamp": 1762470000
  },
  {
    "username": "OregSamm",
    "rating": 10.0,
    "comment": "10.0 / 14.0",
    "timestamp": 1761865200
  },
  {
    "username": "Drb89_",
    "rating": 9.5,
    "comment": "Deck building\nVariable setup\nPush your luck\nPlayer elimination\n++ Fantasy\n++ Components\n++ Replayability\n- Long play time",
    "timestamp": 1760911200
  }
]