[
  {
    "username": "tectactoe",
    "rating": 1.0,
    "comment": "Really love the idea and can admire Lacerda's design chops but like many of his games, I found everything too opaque, taking actions and hoping for the best only to learn three-turns-later that I should done X-action instead of Y-action and I could've had a super monster ultra-chain-reaction turn this round. I suppose you start to see those possibilities develop the more you play the game and become familiar with its intricacies, but the problem is that for me to want to devote that much time to exploring a game's nooks and crannies, the game must first be \\superficially\\ enjoyable, and this often felt more like studious work than fun. Very fiddly, long setup and teardown time, long play time, and yet again loaded with a lot of random endgame scoring tiles that reward players for doing things they would otherwise be doing anyway.",
    "timestamp": 1733785200
  },
  {
    "username": "cotomel",
    "rating": 1.0,
    "comment": "Overrated, overproduced lacerda mps.",
    "timestamp": 1732748400
  },
  {
    "username": "bernstein82",
    "rating": 1.0,
    "comment": "No interaction / Multiplayer Solitaire",
    "timestamp": 1729720800
  },
  {
    "username": "Mastergame82",
    "rating": 1.0,
    "comment": "VARY BAD!!!",
    "timestamp": 1679954400
  },
  {
    "username": "Nomorepiratedgame",
    "rating": 1.0,
    "comment": "For working with Yoka, a company known for its plagiarism of Bang!",
    "timestamp": 1640991600
  },
  {
    "username": "jihoon9303",
    "rating": 1.0,
    "comment": "Unnecessarily complicated and unattractive enough to play again.",
    "timestamp": 1631570400
  },
  {
    "username": "GaiaHero",
    "rating": 1.0,
    "comment": "Makes my eyes bleed.",
    "timestamp": 1624744800
  },
  {
    "username": "Frozen Flesh",
    "rating": 1.0,
    "comment": "I came here, because of all the people rating games like KD:M or Hate with a 1, just because of their mature theme.\nI’m offended by how boring the theme of this game is!",
    "timestamp": 1547074800
  },
  {
    "username": "Peepser",
    "rating": 1.0,
    "comment": "Until this company starts producing games, or \"normal quality\" versions of games, that us plebes can afford, this game gets a 1. I gave a '1' to the gallerist for the same reason and that was only $100. Oh, the good old days when Lacerda's games were cheap! Now, we are getting to $180. Does this come with a free kick in the nuts, or is that an extra on kick starter?\n\nAs someone who is not a slobbering fanboy, and still lives in a world where pricing does matter, who cares about tiles that are a half inch thick? Who cares that the box weighs 2lbs more than the last game he released? Is this the new Lacerda metric of game evolution? Some idiot actually showed pictures of this in the forum, comparing \"large boxes, large tiles\" to normal boxes, like it was a good reason to pay $130 more. Is this the new measure of game quality? These are detriments to me. I don't need boxes that are twice the size of a normal box, that don't fit on the shelf. I don't need boxes that weigh twice as much as a normal box, that have tiles three times as thick as normal tiles. Excess cardboard...such a valuable commodity. I read his next kickstarter game, 'The kitchenist', includes a 1.5 inch thick game board made out of alderwood and maple that can also be used for chopping brocolli. Only $250 if you pledge now.\n\nThe fact that Lacerda is okay with this price gouging is disturbing. Is the game three times as good as Trajan, Keyflower, Vinhos, which cost $50? If so, sign me up, because it's the second coming of Christ. Hallelujah! All hail the new God.\n\nWhat is even more sad is that the game might be good, but Lacerda is going to not only lose many potential NEW customers because of the pricing, he's going to lose old customers, who already know his games, but are sick of the price gouging. This company makes Splotter look bargain bin. Hey, EGG, whatever rocks your boat. If you want to pimp out games to the top 0.01% of the population who are happy to pay this amount of money, and find solace in your elitist prestige of \"limited run of 500\" to justify this cost, fine. Maybe put a big sticker on the box: \"Your $180 helps Vital design games full-time.\" With this company, and with this pricing, it appears Vital no longer cares about his games getting into as many hands as possible. Strange modus operandi from a game designer. Sure, I'll kickstart this...with my foot right up EGG's ass.",
    "timestamp": 1481756400
  },
  {
    "username": "b4b8",
    "rating": 2.0,
    "comment": "Atrocious overall. Would not recommend playing this game. Play The Gallerist instead. Much better overall. Cards are strange with moving up or down in the tableau. Feels very confusing.",
    "timestamp": 1747519200
  },
  {
    "username": "klebinaldo",
    "rating": 2.0,
    "comment": "Tema bom mas o jogo é cheio de \"não sei pra que tanta regra e tanto set up\"",
    "timestamp": 1729461600
  },
  {
    "username": "sloehand",
    "rating": 2.0,
    "comment": "After four plays, I think I am done with Lisboa. I shouldn't have to play a game four times and learn it all over again each and every time. The systems upon systems is cumbersome and gets in the way of a smart design that is in there somewhere. Don't get me wrong, I love complexity. But a Splotter game takes all of 10 minutes to teach while Lacerda games take an hour. Sometimes a great steak only needs to be seasoned with salt and pepper.",
    "timestamp": 1704927600
  },
  {
    "username": "Ekibyo",
    "rating": 2.0,
    "comment": "Ich hasse es einfach",
    "timestamp": 1699225200
  },
  {
    "username": "czuprynn7",
    "rating": 2.0,
    "comment": "Well long story short, having an 8 page player aid for the game to just describe what each , token / card does just because it has poor icononography just kills any gameplay.",
    "timestamp": 1674255600
  },
  {
    "username": "Murraculous",
    "rating": 2.0,
    "comment": "A cluster-cuss of mechanisms.",
    "timestamp": 1636239600
  },
  {
    "username": "jasmineirv",
    "rating": 2.2,
    "comment": "Lisboring lol",
    "timestamp": 1628805600
  },
  {
    "username": "Niakaitan",
    "rating": 2.0,
    "comment": "Waste. Just a truly pungent design",
    "timestamp": 1620079200
  },
  {
    "username": "fives",
    "rating": 2.0,
    "comment": "While the game has some satisfying elements they're buried beneath an obtuse visual design, over-complicated action sequencing, and long stretches of downtime between turns.",
    "timestamp": 1604876400
  },
  {
    "username": "ultimoratio",
    "rating": 3.0,
    "comment": "UPDATE OCT 2025 - \n\nThe game got worse after 20+ plays, even with the Queen Variant fix\n\n===================\nThis game is finally turning into an average game after 10+ plays, even with the Queen's Variant fix. Biggest offender are the swingy Bishop tiles.\n\nSeriously, why don't I just play a Splotter game instead?\n\n=====================\nNote to self: Need more plays with the Queen variant to see if I can increase this to 5 stars\n\nThis game offers amazing opaque decisions! The building aspect is the star of the show and leads to tense and frustration as no decision is obvious. The other bits feels like a bit of a sideshow.\n\nStill, a great game.\n\nWhat's stopping me from loving this is that I dislike the late-game decrees rush, which is utterly degenerate. The Queen variant should fix this.",
    "timestamp": 1760220000
  },
  {
    "username": "parpari",
    "rating": 2.5,
    "comment": "I glad that tried this before buy it!!! Overcomplicated rules and fiddly as hell. This game is more like soulless and bland version of Notre Dame to me. Horrible",
    "timestamp": 1731452400
  },
  {
    "username": "iplaybgnaked",
    "rating": 3.0,
    "comment": "A much simpler multi use card engine builder than the chore of a teach would lead you to believe, unfortunately all those rules don't lead to a compelling gameplay as it is just a point salad area control game just with multiple action stops as you progress from point A to point B in order to ultimately score points. The big issue the game suffers from is the randomness in both the decrees and clergy tiles: once you become competent at the game's puzzle, the winner becomes decided too much by whomever gets gifted action efficient synergies via clergy tiles and scoring synergies via the decree cards purely from the luck of the draw for me to enjoy it.",
    "timestamp": 1714428000
  },
  {
    "username": "Desigual",
    "rating": 3.0,
    "comment": "Feels most like just another euro, definitivaly not the best Lacerda's game, the others Lacerda's games have something unique.\n\nAnd beyond that I really didn't like the random decrees!\n\nThe game has a very strong theme on the background, but I haven't felt connected with the mechanics, unlike Kanban or On Mars.",
    "timestamp": 1712700000
  },
  {
    "username": "ianne",
    "rating": 2.5,
    "comment": "Opaque actions that don't suggest the theme. Some similarities to Gallerist, more predictable and less chaotic.",
    "timestamp": 1664056800
  },
  {
    "username": "Baagism",
    "rating": 2.5,
    "comment": "Golden Elephant Finalist\nLR",
    "timestamp": 1659996000
  },
  {
    "username": "Mayasty",
    "rating": 3.0,
    "comment": "Overwhelming and weird.\n\nExplanation of the rules takes around 60 minutes and is stuffed with plenty of tiny, abstract and counterintuitive rules hard to remember. This is what I call “not elegant game”. The recipe for such a game is always the same. Invent as much as possible bizarre elements (e.g. clockwise walking bishop collecting modifiers to the rules), intertwine them artificially with each other to create a maze of interdependent abstract factors and variables, lastly let count the victory points on almost everything and don’t bother with the length of the rulebook. Geeks will swallow any. The player aid is the 8 pages tiny printed booklet full of icons. Don’t even try to play the game without it.\n\nThe only elegant element here is the idea of de-rubbling the damaged city. In the beginning it’s very expensive as there’s plenty of rubble to remove. But gradually as the rubble is being removed by the players it gets easier and cheaper. Cool.\n\nRefer to “Troyes” to see how abstract, heavy, equally challenging, time-reasonable and elegant euro game of similar vibe and theme can look like.",
    "timestamp": 1631484000
  },
  {
    "username": "Naeddyr",
    "rating": 3.0,
    "comment": "I had a really, really, really bad time the last thirty minutes of the game, waiting for my turns to appear like a cat thought lost in a cataclysmic disaster. Oh, is it my turn? No... Oh, is it my turn?? No... Oh, my turn is fin-- NO.",
    "timestamp": 1600639200
  },
  {
    "username": "SwissQueso",
    "rating": 3.0,
    "comment": "Complicated. I knew what things i needed, but not exactly how the order of operations worked. I liked what seemed like anti engine rules. Would be willing to play it again, but not in a rush to play it.",
    "timestamp": 1599343200
  },
  {
    "username": "Arnar146",
    "rating": 4.0,
    "comment": "Gisli",
    "timestamp": 1754517600
  },
  {
    "username": "ChiefPoobah",
    "rating": 4.0,
    "comment": "It was a puzzle with no joy",
    "timestamp": 1744754400
  },
  {
    "username": "hiimjosh",
    "rating": 4.0,
    "comment": "Lacerda likes taking a bunch of mini-games and stapling them together. Sadly this doesn't work very well if the mini-games themselves feel unfinished and lack intrigue. Lacerda's design philosophy seems to be: \"throw a bunch of random setup into each of the modules and let the players figure out what is worth their time\". About as interesting as Istanbul for this reason, but unfortunately 2-3 times as long, a lot more complicated, and a lot more solitaire",
    "timestamp": 1732489200
  },
  {
    "username": "ashkai",
    "rating": 4.0,
    "comment": "Something about the layout or the colors used in both the rulebook and gameboard made this difficult to play.",
    "timestamp": 1730934000
  },
  {
    "username": "Wrecktangled",
    "rating": 4.0,
    "comment": "The amount of work and time it takes to get so very little done in the game baffles me. I spent 3+ hours building 4 buildings and a ship. The systems upon systems is more work than it is fun. There are a couple neat ideas in here like the cathedral track giving you powers, but then you can turn them in for points. I also like how you choose your own end game scoring with the deed cards.",
    "timestamp": 1710889200
  },
  {
    "username": "LeBao",
    "rating": 4.0,
    "comment": "I just dislike the design in this game, just felt bland, the card-play just not work for me. I prefer other Vital designs than this game.",
    "timestamp": 1707346800
  },
  {
    "username": "stowed4sea",
    "rating": 4.0,
    "comment": "What a disappointment this was for us. I don't understand the weight rating, it was easy to learn. I triple checked we weren't missing any rules, but this game wasn't deep enough.\n\nThe theme was awesome the first game, my wife and I both loved the history, and the theme really comes across.\n\nBut I think even despite having variable setup, this game just felt too stale. It was not fun. Both times at the end, my wife (who even won both games) was like \"wow, that's it?\" Despite playing for 2 hours, it feels like weren't that many turns, and it just feels like you didn't do enough in the game, even when doing all kinds of neat combos.\n\nI think our biggest problem came in that the actions were very simple. You have only 4 to choose from, and some of those let you choose another 6 possible actions. It's not very deep, all actions are extremely simple and straightforward, it is not a brain burner. It's very easy to plan ahead in this game, the setup is variable, but being able to draw from four individual decks, and having 5 cards, well, it's a lot different than say Brass where you draw from a common deck. Most games that we like, we master easy enough, so it's wonderful to have some mechanic that adds a little bit of randomness you have to adjust to as an added challenge. This game doesn't have that mechanic, or enough of it, so in a 2 player game at least, it feels like you can pretty much accomplish everything, planning far enough ahead and not have to sweat much. The only exception is when other person takes public architect plan you wanted, but you can have several contingencies built in because 3 other are visible.\n\nOverall, it results in a boring game for my wife and I. I don't mind games with less random in them if they are deeper and make us think harder, but this one felt way too easy. It's not junk, and I'd play it rather than play nothing at all, but there are so many other games both my wife and myself would rather play.",
    "timestamp": 1707087600
  },
  {
    "username": "Fawkes",
    "rating": 4.0,
    "comment": "Gift from VT 2023\nI like the graphic design, it's a pretty game, but that's probably the best thing that can be said about this game. Even at 3P and everyone having played before, it's not a good experience. Pretty much your standard Lacierda overwrought design.",
    "timestamp": 1702767600
  },
  {
    "username": "JoshuaStarr",
    "rating": 4.0,
    "comment": "My main issue with this Lacerda game is the issue that I have with all Lacerda games: the amount of systems and complexity and rules overhead do not justify the decision space they provide.\n\nAs an example, in Puerto Rico when I take the build action, each player has an opportunity to buy a building. With one player's action the entire table gets to build. In Lisboa, to build a public building, you must first get a plan, then get State Officials, and then take the build action. Most actions have 2 or 3 step workflows each with their own mechanisms to track and each turn you chip away at them. It feels more like project management than decision making.",
    "timestamp": 1700262000
  },
  {
    "username": "tronx",
    "rating": 5.0,
    "comment": "Maybe i will give to this game a second chance. Currently i dont like it.",
    "timestamp": 1759615200
  },
  {
    "username": "Termino476",
    "rating": 5.0,
    "comment": "Vendido a Flavio",
    "timestamp": 1756072800
  },
  {
    "username": "Scifi66",
    "rating": 5.0,
    "comment": "Great Euro for 3p if you are comfortable with low interaction. I've given it a dozen plays and feel comfortable I've explored the gamespace.\nFeb23–>Played this after a break, 3p and it was like a perfect sherry. Better with Queen's variant.\nThis is my favourite of Vital's work and IMHO his magnum opus. Terrific and beautiful design.\n++ Artwork is truly superb\n+ Theme is excellent, reinforced by the mechanics of what you are doing\n+ Gameplay is smooth\n+ Works for 2p\n+ Good solo mode\n- Decree rush in base late game which is absolutely fixed by using the Queen's Variant (recommended)\n- After 10+ plays I feel I've largely cracked the code",
    "timestamp": 1755381600
  },
  {
    "username": "ZoRDoK",
    "rating": 5.0,
    "comment": "Too long, lack of negotiation between players. Need several plays before mindful decisions",
    "timestamp": 1749765600
  },
  {
    "username": "Yvan13",
    "rating": 5.0,
    "comment": "Gros jeu de Lacerda\nTrès beau\nMais non clair et peu fun",
    "timestamp": 1746914400
  },
  {
    "username": "honk3d",
    "rating": 5.0,
    "comment": "",
    "timestamp": 1727474400
  },
  {
    "username": "Duke_Rufus",
    "rating": 5.0,
    "comment": "Why would they make this?",
    "timestamp": 1724968800
  },
  {
    "username": "DonWalker",
    "rating": 5.0,
    "comment": "soulless point slammer. Castles of burgundy, which is an overrated boring game, has even more theme than this. nice mechanics, but fails to deliver an immersive feeling.",
    "timestamp": 1720303200
  },
  {
    "username": "data00",
    "rating": 5.0,
    "comment": "────────────────────────────────────────────────────\n잘 준비된 설명이 있으면 게임 진행은 그렇게 어렵진 않습니다.\n도움말 리뷰 https://boardlife.co.kr/bbs_detail.php?bbs_num=11361&id=&tb=...=",
    "timestamp": 1706914800
  },
  {
    "username": "looch",
    "rating": 5.0,
    "comment": "Played 5 times and I'm tired of re-learning the overcomplicated rules. Too many fiddly rules ruin the game.",
    "timestamp": 1706137200
  },
  {
    "username": "Tigrillo",
    "rating": 5.0,
    "comment": "Promo: Heavy Cardboard Promo.",
    "timestamp": 1699398000
  },
  {
    "username": "weidox",
    "rating": 5.0,
    "comment": "Mechanically very complex for the sake of complexity with very little payoff. If you dare to learn it, it's pretty ok to play - not counting very unbalanced church tiles which can decide winner at the game start.",
    "timestamp": 1698444000
  },
  {
    "username": "Jhearns88",
    "rating": 5.0,
    "comment": "Very beautiful board, cool theme, rather complicated to learn. I don't mind heavy games, but it was pretty frustrating at times. I honestly checked out about halfway through the first play, and it was close to being the second game I just quit before the end (the only game in recent memory I quit playing on a first play was Cloudspire). At the end of the day it's a heavy Euro, but nothing that sets it apart for me like it seems to for others. There was nothing about it that makes me want to play it again. Ultimately none of us playing it had much fun.",
    "timestamp": 1688162400
  },
  {
    "username": "Partisan189",
    "rating": 5.0,
    "comment": "Complexity for complexity's sake and you are not saved by the rules being intuitive so you are going to forget the rules often.\n\nWhen you boil it down it doesn't do anything different than other euro games. All this complexity just feels like chrome to obfuscate that fact that you are just getting resources and money to build resource buildings just like any other euro. Would try again just to see if I was missing something, but I can safely say this game is not worth the hour+ teach/setup.\n\nThe art and components are nice, but the symbology and size of the tokens you need to read are inexcusable. There are small clergy tiles that sit in the middle of the board that just have a symbol and a reference # and both are way too small. The symbology is not clear and you will need to reference the tiny number.",
    "timestamp": 1675810800
  },
  {
    "username": "alexs34",
    "rating": 5.0,
    "comment": "It’s an ok game. However, it seems only playable if one of the players is experienced. This game is insanely complicated.",
    "timestamp": 1673564400
  },
  {
    "username": "Kamaitatchi",
    "rating": 5.0,
    "comment": "Annoying to teach but once you get going it does play very smooth.\n\nLovely graphic design.\n\nLisboa is just a bit more tactical than I'd usually prefer.",
    "timestamp": 1672009200
  },
  {
    "username": "kentrisk",
    "rating": 5.0,
    "comment": "Pros: Amazing production, lots of variability, thematic, multiple paths to victory, has a nice solo mode, decent player interaction.\nCons: Over 20 pages of rules!! It will take a least an hour to read the rules and you probably should also watch a video on the rules which is another 30 minutes so this game is really only for those who really want an in depth game. I love these types of games, but I can't find anyone to play this type of game with me. The solo mode is great, but I have other solo games which have fewer rules and are just as cerebral.",
    "timestamp": 1666216800
  },
  {
    "username": "grasa_total",
    "rating": 5.0,
    "comment": "It is becoming so relaxing and comfortable to play the beginning of a Lacerda game, knowing that as intertwined as everything is and as scarce as some resources are, I won't shoot myself in the foot as much as I fear if I just kinda do some stuff and see where it goes.\n\nBut the endgame that comes with those dynamics is less charming for me. There's somehow a few less plot twists than I want, or something. Even though there can be very dramatic late-game swings from specific moves (in this case, I got 15 points from a single building-- the maximum possible, I think).",
    "timestamp": 1658786400
  },
  {
    "username": "rws2029",
    "rating": 6.0,
    "comment": "• In Lisboa you are navigating an extensive array of intricate, interrelated mechanisms with the goal of accumulating points in the most efficient way.\n• If you find complexity engaging, you’ll like Lisboa for this aspect.\n• The game’s mechanisms support the historical theme quite well.\n• The rulebook does not give a sense for how to approach play. There are interrelationships between several of the procedural subroutines that are not initially apparent, and these connections aren’t highlighted by the organization of the rules. This is all to say there’s a steep learning curve. Fortunately, there are third party references available here in the BGG files section that do a better job of conveying these procedural dependencies.\n• Is Lisboa fun? The answer is very subjective.",
    "timestamp": 1760738400
  },
  {
    "username": "Benoitl33",
    "rating": 6.0,
    "comment": "Quite long, takes many games to understand the point, rules editing passable. Overly complicated. Nice artwork though.",
    "timestamp": 1760306400
  },
  {
    "username": "EllikTheren",
    "rating": 6.0,
    "comment": "I believe there should be more flexibility when building a public building. Since only one public building of each (2) architect is available at any given time, it becomes an opportunists type of game where a big, or not so big, swing in points is determined by luck of what's available (especially at higher player counts) and if it matches your existing efforts. Yes, you can still cash in on future efforts but other players will all have the opportunity to do it first which will likely leave you with only rubble cubes and helping your opponents score more points at a discount... And this part of the game is so important. So it does bring my rating down significantly from what is otherwise a wonderfully thinky and thematic game.",
    "timestamp": 1757109600
  },
  {
    "username": "Burndoc",
    "rating": 6.0,
    "comment": "Traded.\nI found it stale after a few plays. It had the same game arc each time. Not as interactive as I like. Not as complex as I was expecting.",
    "timestamp": 1751752800
  },
  {
    "username": "selvalabelva",
    "rating": 6.0,
    "comment": "Brainburn         Longevity    \nLuck impact       Rules/Setup  \nInteraction       Involvement  \n\nAftertaste           Enthusiasm   \n\n Played at 4 player count only\n Rated base game w/o additional modules\n Queen Variant for best experience\n Confrontation: indirect\n\n Efficiency puzzle-like design\n Excessive different iconography\n\n Exceptional production quality",
    "timestamp": 1751320800
  },
  {
    "username": "EllenCaroline",
    "rating": 6.0,
    "comment": "used to own",
    "timestamp": 1750802400
  },
  {
    "username": "Hfufj748",
    "rating": 6.0,
    "comment": "03/01, 02/04?\nreco-byp, no-bw, reco-bsolit",
    "timestamp": 1748469600
  },
  {
    "username": "adamgrey",
    "rating": 6.0,
    "comment": "This was a huge miss for me and my group. I get the graphic design was to make it beautiful and showcase Lisboan art, but it really got in the way of teaching and learning the game. Rare miss by Ian O'Toole who is usually has stellar iconography. This was a stark contrast to Galactic Cruise which we also played this weekend.\n\nThis is my least favorite Lacerda design that I've played so far.",
    "timestamp": 1747519200
  },
  {
    "username": "enavico",
    "rating": 6.0,
    "comment": "+ Wonderful materials, good artwork (as always...)\n+ Really really meaty\n\n= There may be some AP and downtime due to the Gallerist-like mechanics\n\n- When the complication overcomes the complexity...\n- Bad point salad feeling during the final scoring",
    "timestamp": 1742943600
  },
  {
    "username": "totero",
    "rating": 6.0,
    "comment": "Heavy - (Sleeved and Stored)",
    "timestamp": 1742770800
  },
  {
    "username": "qrak_q",
    "rating": 6.0,
    "comment": "What can you say, Lacerda master of over complication. More like work than game.",
    "timestamp": 1742252400
  },
  {
    "username": "Beastly_Venturer",
    "rating": 6.0,
    "comment": "3 plays. Alright. Not as good as Kanban nor Vinhos though. Probably his 3rd best for me.\n\nPerhaps it deserves more than a 6. However, OK - will play if in the right mood is about right for me.",
    "timestamp": 1740783600
  },
  {
    "username": "invervegas",
    "rating": 6.0,
    "comment": "Complexity √",
    "timestamp": 1736377200
  },
  {
    "username": "Joel_L",
    "rating": 6.0,
    "comment": "Overly complex but runs relatively smoothly once the rules have been digested. Still, there are a lot of tiles and icons to look up in the excellent player aid.\n\nWhy does a game of this length have random end-game scoring cards? It's inexcusable.",
    "timestamp": 1735858800
  },
  {
    "username": "Dodb66",
    "rating": 6.0,
    "comment": "another good game from Vital, don’t like it at 2p, at 3 and 4 it’s fine.",
    "timestamp": 1733266800
  },
  {
    "username": "Buchas",
    "rating": 5.5,
    "comment": "(2024-11-22) Decreased from 8->5.5 because I didn't like the mechanics where one player can sell to all ships and the next player can sell only to his own ship. Income should not depend on other player actions.",
    "timestamp": 1732230000
  },
  {
    "username": "Raskzac",
    "rating": 6.0,
    "comment": "Solid game, with very intricate mechanisms. Do want to try it again.",
    "timestamp": 1719612000
  },
  {
    "username": "SvenUilhoorn",
    "rating": 6.0,
    "comment": "Way too many rules to look up, rulebook isn't really layed out well and has plenty of confusing wordings and inconsistencies with the player aid.",
    "timestamp": 1718488800
  },
  {
    "username": "fromby",
    "rating": 6.5,
    "comment": "Just purchased",
    "timestamp": 1762038000
  },
  {
    "username": "OurMrMajestyk",
    "rating": 7.0,
    "comment": "My favorite Lacerda and for me his most focused game. While there are a lot of currencies to manage, the gameplay is surprisingly straight forward and smooth. Once you get a handle on things it’s also one of his quickest games.",
    "timestamp": 1761170400
  },
  {
    "username": "robertoabr",
    "rating": 7.0,
    "comment": "Rating really tbd only played twice, as its super hard to get to the table. Enjoyed my play , but didn't love it. Moved it along. I want to like this designers games , but many times end up bouncing off of them.",
    "timestamp": 1760911200
  },
  {
    "username": "Astrotron",
    "rating": 7.0,
    "comment": "I like this game quite a lot. The theme isn't something that specifically grabs me, but the implementation is still really well done. The gameplay mechanics are fun; you can get a lot more done in one turn than I was expecting. Some things I found difficult to remember though, there's a lot to track. I'd like to play again just to try some different routes.",
    "timestamp": 1760911200
  },
  {
    "username": "mr_minning",
    "rating": 7.0,
    "comment": "Very good, but very long.",
    "timestamp": 1758924000
  },
  {
    "username": "El_Vis",
    "rating": 7.0,
    "comment": "Naprawdę dobre euro. Przekombinowane, czasem mało czytelne, ale naprawdę dobre. Nic więcej. Przyjemnie się gra, ale gdyby jej nie było moje planszówkowe serduszko by nie bolało. Zagram, ale nie będę specjalnie proponował.\n\n+ Wariant Królowej",
    "timestamp": 1756677600
  },
  {
    "username": "Song_of_Shield_Lady",
    "rating": 7.0,
    "comment": "很多平常的元素，唯一的小巧妙在于要移除公共废墟建个人建筑，而公共建筑会影响得分，这部分的互动挺有趣的。",
    "timestamp": 1755554400
  },
  {
    "username": "cinnzel",
    "rating": 7.0,
    "comment": "Lacerda tiene un don a la hora de diseccionar acciones, lo que otros diseñadores consideran una única acción, para Lacerda pueden ser tres acciones súper atómicas para disgusto de los más impacientes. No es mi caso, me parece uno de los mejores diseños de este autor.",
    "timestamp": 1755036000
  },
  {
    "username": "Bryle",
    "rating": 6.5,
    "comment": "GROUP AVERAGE: 6.48\nBryle: 6.75\nDewey: 6.2\nMario: 6.5\n\nLisboa offers a more interesting and impressive design than delivering on fun factor. The complexity of the ruleset leads to turns that feel a little overly procedural and convoluted. There are a couple elements, like shipping, which feel like they're less well integrated with the rest of the game. While the puzzle is crunchy, Lisboa doesn't stand out in terms of what emotions it can evoke and any unique feelings this game can offer in comparison to everything else.",
    "timestamp": 1753480800
  },
  {
    "username": "leightwing",
    "rating": 7.9,
    "comment": "Stunning design and thematically brilliant, which make the rules much easier to absorb. I've only played twice now (with three players) and both times we didn't seem to have a decree rush at the end, but maybe that's because we're still pulling levers.\n\nLots to love, but a few nits/concerns.\n\nPlayer aids are well thought out, but there's lots of iconography to absorb.\n\nClergy: conceptually wonderful, but I feel that this mechanism is awkward at best, adding what I consider too high a complexity/crunch ratio. Its tiles are small - Reference numbers on tiles are near impossible to read without aid if you use even the mildest of prescription glasses/readers, and keeping track of (remembering) the bonuses associated with them (along with others) during the course of play can be annoying. They just slow gameplay down quite a bit.",
    "timestamp": 1762692540
  },
  {
    "username": "happyjosiah",
    "rating": 8.0,
    "comment": "In 1755, the city of Lisbon, Portugal (called Lisboa by its residents) suffered a devastating earthquake, which created a devastating tsunami, and then devastating fires which burned for days. It's time to rebuild, and you're in charge. You'll need to clear the rubble, fires, and floodwaters in order to build new shops and public buildings. You'll also want to restart the economy by producing goods, building trade ships and shipping goods, and, most importantly, collecting wigs. What? That's right. Apparently wigs were a real sign of wealth in this time and place and so that is how the victory points are represented.\n\nIn a sense, the turn structure is quite simple: you play a card from your hand of five, do what it says, then draw a replacement card. But describing the game this way is almost comically reductionist. Each card has two different ways it can be played in two different locations, for a total of four possibilities. A card played to the first location will grant you the bonus of the card, then allow you to take up to two of seven possible actions, each requiring resource payments of various kinds. A card played to the second location requires a totally different payment type and then will grant one of four completely different actions than the aforementioned seven or else perform yet another action as dictated by the card itself. And each individual action can require carrying out as many as seven sequential steps. Oh, and in some cases, other players can also piggyback onto the action you've chosen.\n\nFortunately, the player aids are extremely helpful in this regard. Each player receives their own, fully eight-pages, color-printed and stapled into a booklet. They even include a section that is a real boon to new players, including answers to questions like \"How can I get more money?\" and \"When do I have to spend influence?\" So many games of this type have clearly defined goals, but leave players baffled on how to accomplish them. That's not the case here, to its credit. But let's be clear, as useful and necessary as these player aids are, they exceed the length of the complete rules for many other board games.\n\nGames like Lisboa should probably come with a warning label. This is a triple-black-diamond in terms of rules complexity, mandating at least an hour of teaching. If you dropped your jaw or burst out in incredulous laughter at that statement, you'll get no judgment from me; this game is clearly not for everyone. And yet, the various sections of the game are so seamlessly-integrated and elegantly-designed that there is no way to remove even a small portion without lessening the experience. This integration is also what makes the teaching process so challenging: every mechanic is so interconnected that there is no good place to start. Lisboa is a game that you should play regularly, or not at all. With the time invested into learning it, it's quite rewarding with lots of paths to explore and a ton of strategic depth. But your gaming life won't be any less rich if you decide to skip this one.",
    "timestamp": 1760911200
  },
  {
    "username": "Napattack",
    "rating": 8.3,
    "comment": "4.57\n1-4\nBest at 3\n120 (600)\n#89",
    "timestamp": 1760392800
  },
  {
    "username": "MoMahili",
    "rating": 8.0,
    "comment": "Keep",
    "timestamp": 1759874400
  },
  {
    "username": "mondauge",
    "rating": 8.0,
    "comment": "Overwhelming at first. I need full focus to play this, others may find it easier. If I do, it is quite nice to play.",
    "timestamp": 1759442400
  },
  {
    "username": "djali2015",
    "rating": 8.0,
    "comment": "https://www.printables.com/model/45664-lisboa-organizer",
    "timestamp": 1758492000
  },
  {
    "username": "Afrochiapet",
    "rating": 8.0,
    "comment": "The premise of Lisboa is intriguing: players make their mark after the 1755 earthquake that nearly destroyed present-day Lisbon. Help rebuild the city by working with key cultural figures to clear rubble, establish manufacturers, and develop commerce. This is done by choosing a card to either improve one’s portfolio (which provides some passive benefit) or interact with the influential powers (to take one of the game’s primary actions). The mechanics intersect well, with each played card sending a ripple effect on the game state. Building a ship improves the the city’s wealth and opens up the opportunity for any player to make fast money. Erecting a public building opens up a victory point condition at the cost of committing one’s political sway.\n\nThe multi-step actions (and iconography) do increase the game’s inherent complexity, so expect a front-loaded learning curve. Expectations are important to manage for any heavy Euro and Lisboa is no different. Within its inviting azulejo blue-and-white color palette lies an efficiency puzzle with incidental interactions from other players. Such a premise might cause a general feeling of ambivalence for me, but I was drawn in. As is the ilk with Lacerda’s stronger offerings, Lisboa’s thematic appeal helps translate its Euro abstractions. An initial impression of a point generation sandbox evolved into something more intricate and interesting with continued plays. This was a passion project and it shows.",
    "timestamp": 1757800800
  },
  {
    "username": "Takhyon",
    "rating": 8.0,
    "comment": "This took me forever to click and internalize, mostly because the game is most definitely not as clean or as elegant of a design as Lacerda fans would have you believe. I know the whole “play a card, draw a card” -explanation is kind of a meme to begin with, but that whole multi-use card thing with playing into different areas and those decisions branching into multiple different actions themselves is actually really unintuitive, unthematic, and confusing. Especially when each action comes with a lot of fiddly minutiae and easily forgettable procedural steps.\n\nAlso I really don’t like the follow-mechanism. Yes, it makes you more efficient and yes, figuring out how to leech off extra actions from other players makes the game extra crunchy. However ultimately it’s equally as intrusive as with The Gallerist - the game flow becomes clunky and awkward when people keep taking full actions out of turn order, and the downtime can also get pretty bonkers. Finally the end-game decree card rush feels kind of wonky and weird, makes sense that this was since “patched” with the Queen variant.\n\nExcuse the ranting as I’m kind of tired of overly complex euro games of this ilk, but even still once you get past the initial unintuitiveness and learn to accept the unavoidable amount of fiddle that comes with a Lacerda game, the game becomes really enjoyable. The interconnectivity of the different actions and areas of the game makes the action sequencing puzzle fascinating. The central area with re-building the city is also more interactive than initially seems, good opportunities of making use of other people’s work and there’s even an interesting minor element of shared incentives there. I would potentially even rate this higher if played with a lower player count as you’d have more actions and less downtime, but for now a cautious eight feels about right.",
    "timestamp": 1756591200
  },
  {
    "username": "Killi",
    "rating": 8.0,
    "comment": "My fav Lacerda game, and the only one I currently own.",
    "timestamp": 1756504800
  },
  {
    "username": "Nerdvik",
    "rating": 9.0,
    "comment": "WOW. Such a Crunchy Game - so much going on.\nSo well Done!\nLacerda is a whole nother level.",
    "timestamp": 1761606000
  },
  {
    "username": "verandi",
    "rating": 9.0,
    "comment": "I'm not a fan of sand-boxy, self-absorbed games overstuffed with mechanics, but Lisboa (similarly to Madeira) belies that stereotype by actually being quite interactive and tense. The game doesn't overstay its welcome, and in fact a lot of the tension arises from not having enough turns to accomplish what you want. I've only played with 3 and don't see any benefit to playing with 4.\n\nUPDATE: my appreciation for Lisboa has increased with repeat plays- always the sign of a great game. This so beautifully melds puzzle with interaction and is just so fun to play. Not every Lacerda is a hit for me, but this and Kanban are quite excellent.",
    "timestamp": 1761170400
  },
  {
    "username": "Thomassabourin",
    "rating": 8.5,
    "comment": "$120",
    "timestamp": 1761170400
  },
  {
    "username": "Ari88",
    "rating": 8.5,
    "comment": "Initial rating",
    "timestamp": 1760306400
  },
  {
    "username": "igor_f",
    "rating": 9.0,
    "comment": "1-4",
    "timestamp": 1760220000
  },
  {
    "username": "Rymit",
    "rating": 9.0,
    "comment": "Flawless game. This is the ideal state of interwoven mechanics all synergizing with each other while also being supported by the theme. The action mechanism is clever and fresh. On most turns, you’ll agonize over your past choices and limited resources. However, some turns are simply amazing, when your planning pays off.\n\nThe game flowing almost as fast in 4 players as it does in 2 is a pleasant surprise and a proof of the designer’s skill. The game also offers multiple points of interaction. After all, you're rebuilding the same city and visiting the same nobility. You really care and are influenced by the actions of people around the table.\n\nAlthough mechanics are prioritized to theme, the theme is greatly utilized. From the different colored cubes to the flow of the game represented by passing years, everything reinforces the sense of rebuilding after a great catastrophe.",
    "timestamp": 1759442400
  },
  {
    "username": "srfdevotee",
    "rating": 8.8,
    "comment": "For me, Lisboa has three primary strengths: (1) it's gratifyingly juicy and thinky (with lots of options to consider and plan for), (2) the city-building theme is cohesively integrated and interesting (though slightly dry), and (3) there is strong replayability due to the randomization of the various setup elements and the different paths you can take in the game. So it gets a solid score from me, based on 4P. Yes, there is a big learning curve and a huge number of symbols to absorb, but I see this being merely a temporary hump. Total play time is reasonable.\n\nWith 4P, it's a bit chaotic, with a constant changing board state, and as a result player interaction is not as relevant as I would like. I can see player interaction becoming much more meaningful at 2P. 3P may very well be sweet spot and the best overall player count. Will update my rating (likely higher) once I have played 2P and 3P.",
    "timestamp": 1758578400
  },
  {
    "username": "eecArk",
    "rating": 9.0,
    "comment": "Maybe",
    "timestamp": 1758405600
  },
  {
    "username": "tobimx",
    "rating": 9.0,
    "comment": "Lisboa casts you into the heart of a city rising from ashes. After the devastating earthquake of 1755, you take on the role of a noble, shaping streets, erecting buildings, and guiding the city toward a new future.\n\nThe game flows along a winding path of card draws and plays, each choice opening doors to negotiate with the king, marshal resources, or expand your influence. Every decision feels consequential, every move a step in the intricate dance of rebuilding.\n\nAmid the shadow of tragedy, the game sparkles with strategy: a competitive race for the most coveted plots, clever placement of shops, and meticulous resource management. The city grows under your hand, a living puzzle of streets, squares, and ambition.\n\nWith each play, the mechanisms reveal their depth: careful planning, subtle interaction, and the constant tension of opportunity versus risk. Lisboa is both a simulation of reconstruction and a poetic journey through history, where time slips away as the city takes shape under your guidance.",
    "timestamp": 1757368800
  },
  {
    "username": "masterlelik",
    "rating": 10.0,
    "comment": "boardgames\nO",
    "timestamp": 1760997600
  },
  {
    "username": "jaffawahha",
    "rating": 10.0,
    "comment": "Excellent",
    "timestamp": 1759960800
  },
  {
    "username": "Kocumon",
    "rating": 9.5,
    "comment": "It’s not that hard to learn as people exaggerated! I think the theme is solid enough to make sense of the mechanics. Pretty satisfying with all the things you can do within very neat game flows. It’s less about interaction more about public information when playing with 4 players.\n\nThe art is prettier in real eyes than on the photo",
    "timestamp": 1759528800
  },
  {
    "username": "Michael_Ho",
    "rating": 9.5,
    "comment": "Incl Queen variant and metal coins",
    "timestamp": 1758924000
  },
  {
    "username": "mxblasters",
    "rating": 10.0,
    "comment": "very good game with many strategy to wins, board game absolutely beautifull and thematic",
    "timestamp": 1758664800
  },
  {
    "username": "Rabo",
    "rating": 10.0,
    "comment": "T",
    "timestamp": 1758492000
  },
  {
    "username": "johnnytruant",
    "rating": 10.0,
    "comment": "AMAZING!",
    "timestamp": 1757282400
  },
  {
    "username": "SirCadillac89",
    "rating": 9.5,
    "comment": "Intertwined mechanics paradise.\nAnd a super awesome theme and artwork if one is familiar with portuguese/lisbon culture. Just a wonderful beautiful game design.",
    "timestamp": 1756591200
  },
  {
    "username": "turzin",
    "rating": 10.0,
    "comment": "SOUS JOUÉ",
    "timestamp": 1755813600
  }
]