[
  {
    "username": "ultimoratio",
    "rating": 1.0,
    "comment": "UPDATE: Feb 2021\n\nBleh. Way too bloody tactical for my taste. The contracts are drip-feed every round and it is the game's main scorer. Due to this, it's hard to predict the market and have a long term strategy.\n\nIm officially done with this game. Play Terra Mystica/Gaia Project instead.\n\n======================\n\nMay 2020:\nBizarre. The more I play both TM and Clans of Caledonia, the more I end up preferring TM. I'm liking the contracts, which is one of the pillars of the game, less and less the more I play it. TM's blunt way of scoring strategically is just more satisfying and so straight forward.\n\nTM is proving to be more strategic than its younger cousin.\n\n----------\nFantastic Euro in which it made itself better than Terra Mystica. The short term contracts vs long term spatial spread is more interesting than Terra's \"per round\" bonuses. Neighbour bonus is more interesting. And the Clan special powers doesn't shackle you to a specific strategy, unlike Terra Mystica's faction abilities.\n\nHowever, Terra Mystica is still alluring with its chrome, tactile pieces, wild asymmetry, and its sheer bluntness on how you play strategically. Clans' petite footprint is nice, but lacks the table presence of Terra.",
    "timestamp": 1734649200
  },
  {
    "username": "FutureSpec",
    "rating": 1.0,
    "comment": "farm crap",
    "timestamp": 1672268400
  },
  {
    "username": "murphzone",
    "rating": 1.0,
    "comment": "#12) Need to play",
    "timestamp": 1573254000
  },
  {
    "username": "Frozen Flesh",
    "rating": 1.0,
    "comment": "I came here, because of all the people rating games like KD:M or Hate with a 1, just because of their mature theme.\nI’m offended by how boring the theme of this game is1",
    "timestamp": 1547074800
  },
  {
    "username": "Minkypool",
    "rating": 1.0,
    "comment": "Nothing more than a weak soulless Terra Mystica re-skin that adds nothing new or interesting to the format. Also terribly unbalanced clan abilities to the point of broken.",
    "timestamp": 1539295200
  },
  {
    "username": "Yokiboy",
    "rating": 2.0,
    "comment": "A standard euro that feels like Terra Mystica light. It's a straight up optimization engine: money to resources to contracts to points. I'm not sure that the clan powers are on equal footing.",
    "timestamp": 1753308000
  },
  {
    "username": "maqister",
    "rating": 2.0,
    "comment": "Very fiddly rules, designer could do better.",
    "timestamp": 1752098400
  },
  {
    "username": "Bumbusia",
    "rating": 2.0,
    "comment": "totalnie jej nie pamiętam, jakieś owce - coś tam. Nie ma polotu, poszła na sprzedaż",
    "timestamp": 1690063200
  },
  {
    "username": "Starcadian",
    "rating": 2.0,
    "comment": "Boring and tedious. Fans of Rosenberg will probably like it.",
    "timestamp": 1678662000
  },
  {
    "username": "SeerMagic",
    "rating": 2.0,
    "comment": "Two minutes into the rule explanation, I knew this was not a game for me. I did keep hearing it's better than Terra Mystica, but I didn't even find that to be true. Theme is yuck, gameplay is yuck. Just not a game for me, and one I won't play again.\n\n Theme\n Gameplay",
    "timestamp": 1646002800
  },
  {
    "username": "trainings_pl",
    "rating": 3.0,
    "comment": "Terra Mystica and Marco Polo mix (and ripoff) with very little original input. Playable, but much inferior to both precursors.",
    "timestamp": 1743890400
  },
  {
    "username": "hiimjosh",
    "rating": 3.0,
    "comment": "I was very excited for Clans of Caledonia hoping it would be a simpler Terra Mystica. It definitely is simpler than Terra Mystica, but unfortunately it also is toothless.\n\nThis game is only superficially similar to Terra Mystica. You have asymmetric factions (the ones here are much simpler). You have a sense of expanding across a map (although terrain types are basically gone and there is little urgency to expand in particular ways e.g. to get town tiles like in TM). You have round scoring (which actually works as well as it does in TM, so that's a plus). You have a player board which you play buildings from to get benefits (but the benefits are much more simplistic and only involve production).\n\nThe game feels more like a sandboxy euro - almost like Fields of Arle but with engine building instead of worker placement. The core scoring mechanism is delivering orders, and yeah... that's pretty much it. There are a few more nuances, but it's a really simple game: buy buildings, produce goods, fulfill orders, rinse repeat for 5 rounds total, see who was most efficient. It's not that Clans is a bad game, it's just I don't see any reason to choose it over Terra Mystica (which does area expansion better), Le Havre (which does sandboxing better), or At the Gates of Loyang (which does order fulfillment better). It's sadly just not great at anything",
    "timestamp": 1691013600
  },
  {
    "username": "Engoduun",
    "rating": 3.0,
    "comment": "Okay game. Mechanics are a mix between Voyages of Marco Polo, Terra Mystica, and Planet Steam, imho. So you always want to do way more than you actually can, and have to make hard decisions.\n\nWhat I don't like: the game is played over 5 rounds only, and in the first round you're mostly just setting up some kind of engine for rounds 2-4, and in round 5 you are expected to have a running engine for your contracts and whatnot. If you're missing anything, there is almost no way to correct any mistakes or missing parts.",
    "timestamp": 1645657200
  },
  {
    "username": "pitonowie",
    "rating": 3.0,
    "comment": "After 10 plays it's dull and repetitive. Nothing exciting innit. Poor clone of Terra Mystica",
    "timestamp": 1642806000
  },
  {
    "username": "gamerdoge",
    "rating": 3.0,
    "comment": "Feels like Terraystoca with an economics element. Takes too much planning, play for too long, multiplayer solitaire like typical Euro.",
    "timestamp": 1614553200
  },
  {
    "username": "Oloovi",
    "rating": 4.0,
    "comment": "I thought I would like this but didn't enjoy at all.",
    "timestamp": 1759788000
  },
  {
    "username": "Legomancer",
    "rating": 4.0,
    "comment": "I admit, I didn't really understand this for most of the time I was playing. I'd read but not absorbed the rules, was not clear on what I was supposed to be doing, or what everything did. It's an economic game of production, contracts, a volatile market, and so forth, and it was all a blur to me until around the final round. I may give it another shot, but honestly, I've played plenty of this kind of thing, have a few I like, and am not really in the market for another one.",
    "timestamp": 1758578400
  },
  {
    "username": "ubRtstcl",
    "rating": 4.0,
    "comment": "Most of the actions aren't that interesting. Interaction is minimal and at the end I don't feel like I've accomplished anything. A decent amount of luck involved with the contracts, which doesn't fit well. Not a fan of the round specific scoring objective, it's like the opposite of unique player powers.",
    "timestamp": 1733180400
  },
  {
    "username": "yendi57",
    "rating": 4.0,
    "comment": "Disappointed. Unbalanced.",
    "timestamp": 1723845600
  },
  {
    "username": "brownsound",
    "rating": 4.4,
    "comment": "Działa, było przyjemne, ale nie zapada w pamięć.",
    "timestamp": 1690495200
  },
  {
    "username": "SteoanK",
    "rating": 5.0,
    "comment": "First playthrough was fun! Loved the theme most of all. Don't think I'll ever played Terra Mystica since this shares many elements. Box size is perfect and the components are sturdy.",
    "timestamp": 1760392800
  },
  {
    "username": "gram_niebieskim",
    "rating": 5.0,
    "comment": "My BGG:\n10 - excellent game, always have a great time\n7 - enjoyable game, I'm willing to play again\n5 - not bad but it's not my cup of tea\n2 - won't play ever again",
    "timestamp": 1758924000
  },
  {
    "username": "pingus",
    "rating": 5.0,
    "comment": "Just play Terra Nova instead",
    "timestamp": 1758319200
  },
  {
    "username": "Avid_Equinox",
    "rating": 5.0,
    "comment": "Economic engine buildy game with variable stock prices\n+ A clean design, rules wise\n- Not that exciting to play",
    "timestamp": 1757887200
  },
  {
    "username": "Scifi66",
    "rating": 5.0,
    "comment": "I've passed Peak Euro but this is better than most of its cohort. A shorter version of Terra Mystica with some sandbox elements. The market, tightness of money and struggle for connected territory are its best features.\n+ Small box size and modular board\n+ Active Market for goods\n–Asymmetric clan factions dictate your strategy quite a bit\n–End game area scoring is hard to explain",
    "timestamp": 1750716000
  },
  {
    "username": "NordRunner",
    "rating": 5.0,
    "comment": "Haven’t got into it yet",
    "timestamp": 1748296800
  },
  {
    "username": "Zeusman",
    "rating": 5.0,
    "comment": "Non-Library Copy",
    "timestamp": 1747173600
  },
  {
    "username": "Ginewra",
    "rating": 5.1,
    "comment": "bga",
    "timestamp": 1739228400
  },
  {
    "username": "tolhs",
    "rating": 5.2,
    "comment": "2024:+1",
    "timestamp": 1733958000
  },
  {
    "username": "Joel_L",
    "rating": 5.0,
    "comment": "I like the market with fluctuating goods prices but the spatial element of placing buildings is dull.",
    "timestamp": 1732230000
  },
  {
    "username": "Euroman",
    "rating": 6.0,
    "comment": "Are the clans equal? It seems not. Not enough conflict and/or interaction with other players in a 2-player game. Basically an efficiency puzzle that you play as solitaire.\nNeed to try at a higher player count.",
    "timestamp": 1762658280
  },
  {
    "username": "LannisterCrimson",
    "rating": 6.0,
    "comment": "Bling Status ✓\n\nExpansions: -\nPromos: -\nSpecial Edition: ✓\nUpgraded Components: -",
    "timestamp": 1761429600
  },
  {
    "username": "ramukaka",
    "rating": 6.0,
    "comment": "Again brilliant game but the whole contracts, small print stuff makes it generally too Euro-y, that I severely dislike most times.",
    "timestamp": 1757887200
  },
  {
    "username": "FrankRyan",
    "rating": 6.0,
    "comment": "Point optimization in the vein of Puerto Rico. Poorly balanced.",
    "timestamp": 1757887200
  },
  {
    "username": "Antch007",
    "rating": 6.0,
    "comment": "This one is hard to rate. On paper it has everything needed in order to be a blast.\n\nBut in reality, gameplay is so boring and repetative",
    "timestamp": 1756159200
  },
  {
    "username": "chersiphron",
    "rating": 6.0,
    "comment": "+ wooden insert",
    "timestamp": 1754431200
  },
  {
    "username": "TharsisRoverPets",
    "rating": 6.0,
    "comment": "It's fun. It's much easier to plan ahead and read other players than Terra Mystica. But, I'm not sure it's anything special.",
    "timestamp": 1753480800
  },
  {
    "username": "willbeplayin",
    "rating": 6.0,
    "comment": "The game might be just tad too tight to my liking, maybe. I love games with plenty of resources and having lots of stuff but it looks like Clans of Caledonia is going to find it's place next to games like Lorenzo Il Magnifico, Terra Mystica and Voyages of Marco Polo in which you don't ever have enough money, turns or time to do everything (or even half!) you want.\n\nAnd yet I really, really like the game, The components are great albeit a bit too small, although the use of white and black player colors threw me off slightly, I'd preferred yellow and green instead. I'm also hoping that the clans are balanced, only time will tell.\n\nThe KS deluxe metal coins look and feel awesome! Great addition! Suffers from AP. A lot, depending on your group. :/\n\nEventually sold it forward for a great price.",
    "timestamp": 1751839200
  },
  {
    "username": "Maxplanck12",
    "rating": 6.0,
    "comment": "The gameplay of Terra mystica/gaia project with the market mechanics of Glen More. I was intrigued Ager reading the rules, but actually playing was underwhelming. Just doesn't feel like any of the ingredients are as interesting as their inspiration.",
    "timestamp": 1745445600
  },
  {
    "username": "andrewsgame12",
    "rating": 6.0,
    "comment": "Good game that's just missing one ingredient for me to make it great. And I can't quite identify what it is. This game does resources very well, but that's kind of where it ends. You don't get to then build something with it. So maybe that's why it just doesn't click all the way for me. Not sure.",
    "timestamp": 1745359200
  },
  {
    "username": "marshallglanzer",
    "rating": 7.0,
    "comment": "Played as the clan that breeds sheep and cattle",
    "timestamp": 1762663320
  },
  {
    "username": "dragos_br",
    "rating": 6.5,
    "comment": "4",
    "timestamp": 1761778800
  },
  {
    "username": "Ddyraw",
    "rating": 7.0,
    "comment": "Good game, has some greatvideas and plays well, but did not blow me out of the water",
    "timestamp": 1759615200
  },
  {
    "username": "FlurkyTurkey",
    "rating": 7.0,
    "comment": "I'm bad at this game but it's still fun, I played only three times on bga but I'd probably enjoy it more in physical form. It probably deserves an 8, I just need to first understand the strategies here. The theme is so dry and I just am a sucker for good theme. When it's dry it just doesn't capture my attention. The market though is fun.",
    "timestamp": 1759010400
  },
  {
    "username": "jbrent531",
    "rating": 6.5,
    "comment": "KS - Jan 2026",
    "timestamp": 1757541600
  },
  {
    "username": "lopazzmesec",
    "rating": 8.0,
    "comment": "(25-11-05) 8 - Prima partita. Forse meno profondo di quanto pensavo, ma è da verificare nelle prossime partite. Ho colto comunque qualche sfaccettatura che non mi aspettavo. Inoltre credo renda meglio in più di 2 giocatori.",
    "timestamp": 1762470000
  },
  {
    "username": "jacobPL",
    "rating": 7.5,
    "comment": "Very good euro game. I'll review it after more plays and testing Industria.",
    "timestamp": 1762470000
  },
  {
    "username": "Sedd",
    "rating": 7.5,
    "comment": "Kurz: Clans of Caledonia entführt den Spieler ins Shottland des 19. Jh. Dort übernimmt man die Kontrolle über einen Clan mit einzigartigen Fähigkeiten und baut seine Wirtschaftsmacht auf, indem man Ressourcen produziert, handelt und exportiert. ABER: Die Spielzeit ist viel zu lang.\n\nLangform:\nEs ist anspruchsvoll und setzt einen starken Fokus auf Ressourcenmanagement, strategische Planung, Interaktion unter den Spielern und geschickter Platzierung auf der modularen Karte (Nachbarschaft sorgt für vergünstigten Einkauf, kann aber zu Platzmangel beim weiteren Ausbau führen; ähnlich Terra Mystica und dessen Nachfolger). Besonders gelungen ist die Verzahnung vom Bau von Gebäuden, deren Produktion, Handelsmechanismen und Auftragserfüllung. Die asymmetrischen Clans bringen Abwechslung und regen an, unterschiedliche Strategien auszuprobieren, was den Wiederspielwert erhöht. Nachtrag: Dabei ist die Strategie, Aufträge zu erfüllen am wichtigsten.\n\nAllerdings kann die Einstiegshürde recht hoch sein (Expertenniveau), und die Downtime macht das Spiel ziemlich lang (trotz Begrenzung auf 5 Runden). Die Gestaltung ist funktional, wenn auch etwas nüchtern. Und das wir in Schottland sind, merkt man nur bedingt.\nAußerdem hat man gefühlt, immer zu wenig Ressourcen um voran zu kommen.\n\nInsgesamt: Hat es mir gut gefallen. Es bietet einige strategische Möglichkeiten. Alles zusammen sorgt für interessante Entscheidungen. Es ist eines der Spiele, die man öfter spielen sollte. Die unterschiedlichen strategischen Herangehensweisen der Clans laden dazu ein. Aber die Spielzeit ist mir zu lang, selbst mit Kennern des Spiels.",
    "timestamp": 1762383600
  },
  {
    "username": "jasonxerri",
    "rating": 8.3,
    "comment": "2-4 Players",
    "timestamp": 1762383600
  },
  {
    "username": "rainydaysteve",
    "rating": 8.0,
    "comment": "Very well designed. My group loves it after a few playes and it has the feel of a classic for us. The clan powers are thematic and fun to abuse in a very cleanly implemented Eurogame way. Significantly more interactive with four players than with less.\nPlays quite smoothly even after a single game.",
    "timestamp": 1762383600
  },
  {
    "username": "Medic Jesus",
    "rating": 8.8,
    "comment": "Ordered the reissue on kickstarter campaign in July. Arrived today with my metal coins (Nov. ‘25). (Gamefound)",
    "timestamp": 1762470000
  },
  {
    "username": "Pelle0809",
    "rating": 8.5,
    "comment": "One play so far, really enjoyed it. Fun economic puzzle. Looking forward to the next play.",
    "timestamp": 1762297200
  },
  {
    "username": "Beer4Dad",
    "rating": 8.5,
    "comment": "IF it weren't for Gaia Project, this would be the greatest \"Heavy Euro engine-builders with personal board development mechanics games\" ever designed. Very excited to see what Juma does with Industria",
    "timestamp": 1762210800
  },
  {
    "username": "Don_Allegre",
    "rating": 9.0,
    "comment": "Great experience",
    "timestamp": 1762210800
  },
  {
    "username": "jann1",
    "rating": 9.0,
    "comment": "This game has everything I want from a game: Variable market, absolute open information for all players, asimmetric factions, replayability and a wonderful theme. The only con for me is componentes, too small and too easy to knock off players' board and main board",
    "timestamp": 1762210800
  },
  {
    "username": "furrygoose",
    "rating": 10.0,
    "comment": "Absolutely class, hits the sweet spot between decision space and AP inducing options. Love it",
    "timestamp": 1762297200
  },
  {
    "username": "tphon",
    "rating": 10.0,
    "comment": "3D Supplied Insert",
    "timestamp": 1762210800
  },
  {
    "username": "Bateyes",
    "rating": 9.6,
    "comment": "Deluxe-Version aus der Kickstarter-Förderung.\n\nIch habe:\n- Basisspiel (Deluxe), welches unter anderem in der Box enthält:\n--- Metall-Münzen (Addon).\n--- Spezieller Umschlag (Addon).\n- Industria (Erweiterung).\n- Spielmünzen \"Industria\" (12x 20er Münze mit Zugmotiv) (Addon).\n- 1x Sprachpaket Deutsch fürs Basisspiel (um mehr doppelseitige Übersichtskarten zu haben).\n- 2x Sprachpaket Deutsch für Industria (2x um mehr doppelseitige Übersichtskarten zu haben).",
    "timestamp": 1761606000
  },
  {
    "username": "Fabiotorres",
    "rating": 10.0,
    "comment": "Número de Jogadores: 1 a 4\nDificuldade: 3,6/5,0\nIndicado para Iniciante: Não\nContras: Não possui.\nPrós: Ótima rejogabilidade; muito gostoso de jogar.\n\nComentário: Simplesmente o melhor jogo que já joguei até hoje!\nJogo com mercado flutuante, domínio de área, construção, cumprir contrato...\nNo jogo controlamos clãs querendo desenvolver os nossos mercados através de produção de recursos. Nisso devemos expandir o nosso território fazendo novas construções ou colocando novos trabalhadores, do qual nos ajuda a adquirir mais dinheiro. Toda vez que libera novas construções, você vai adquirindo mais recursos. Além disso, você pode fazer upgrade no seu clã para ele alcançar mais lugares, ter maior rendimento econômico...\nO mercado flutuante é sensacional, onde você deve procurar vender quando estiver em alta e comprar quando estiver na baixa.\nCada rodada uma coisa diferente estará pontuado, e os jogadores devem se atentar para isso.\nO jogo é apertado no sentido de você nunca conseguir fazer tudo que gostaria, ou falta dinheiro, ou falta recurso...\nO jogo é bem gostoso de jogar, você mal vê o tempo passar.\nA rejogabilidade do jogo é bem grande; tem um visual ok, nada muito extraordinário; a assimetria do jogo é bem bacana, nada muito desproporcional entre os clãs.\nO que mais curti, é que o jogo todo é bem amarradinho, ele todo se comunica, nada no jogo você vai achar quebrado.\nSe você gosta de jogo que a principal mecânica é a gestão de recursos, pode pegar esse sem medo!\nClãs da Caledônia vs Projeto Gaia: Muita gente compara esses dois jogos por terem algumas coisas em comum, como: tabuleiro modular; facções assimétricas; pontuação por rodada de acordo com o setup; \"política de boa vizinhança\"; disputa por território; liberação de construções do tabuleiro individual com bonificação...\nEnfim, ambos são jogos ótimos, sendo o Projeto Gaia um jogo mais complexo e mais demorado, onde você precisa terraformar o terreno de acordo com o seu clã para poder construir. Já o Clãs da Caledônia não é tão complexo e o mercado flutuante dita bastante o jogo. Recomendo os dois, mas prefiro Clãs da Caledônia.\n\nModo Solo: O jogo já vem com modo solo, e que delícia de solo. Ótimo para conhecer como funciona o jogo, pois muda poucas coisas nas regras. Muito bom, recomendo!",
    "timestamp": 1761606000
  },
  {
    "username": "Dlearn",
    "rating": 10.0,
    "comment": "Highly optimizable and high interactions",
    "timestamp": 1761519600
  }
]