[
  {
    "username": "le_asmo",
    "rating": 1.0,
    "comment": "Does not work as a game, maybe as an experiment",
    "timestamp": 1740092400
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "Another asymmetric game where everybody's too tired to look at the other boards, too exhausted to talk. So nothing interesting happens.",
    "timestamp": 1722204000
  },
  {
    "username": "peyo40",
    "rating": 1.0,
    "comment": "Idem pour tous les français : Erreurs sur la VF qui rendent le jeu injouable. L'éditeur a décidé de proposer un pack de correction payant normalement en septembre (déjà annoncé pour Mars) ! Honteux. Aucune communication. DGP, l'éditeur Français aux Abonnées Absents. CECI N'EST VRAIMENT CORRECT",
    "timestamp": 1717624800
  },
  {
    "username": "Hgozilla",
    "rating": 1.0,
    "comment": "Erreurs sur la VF qui rendent le jeu injouable. L'éditeur a décidé de proposer un pack de correction payant en septembre ! Honteux.",
    "timestamp": 1717538400
  },
  {
    "username": "Stram",
    "rating": 1.0,
    "comment": "French edition....",
    "timestamp": 1717020000
  },
  {
    "username": "Irondell",
    "rating": 1.0,
    "comment": "A sense of humour, maybe. But no sense of anything else.",
    "timestamp": 1714773600
  },
  {
    "username": "PJBreton",
    "rating": 1.0,
    "comment": "Note due au travail de localisationde Don't Panic Games... ou plutôt l'absence de travail, le nombres d'erreurs qui impactent le jeu est assez colossale... Ce que je peux tolérer, projet trop ambitieux pour l'éditeur -à la limite- mais l'absence de communication alors que présents sur un fil dédié à ces erratas... non.\n\n\nSinon pour le jeu c'est un solide 9/10:\nDe ces jeux qu'on éspère pouvoir sortir régulièrment, malgré la lourdeur du monstre.\n\nTrès didactique et globalement cohérent, avec Twillight Struggle ou Gigawatt des jeux superbes même en temps qu'outils de connaissances et compréhension.",
    "timestamp": 1713996000
  },
  {
    "username": "Alyssa Oolacile",
    "rating": 2.0,
    "comment": "If you like politics, economics and negotiation, this could be a great game for you; theme and mechanisms are geniously mixed together. Unfortunately, this is not the case for me as I dislike all those three.\n\nIts cons are: it can be tough to learn and teach, it's lengthy and you need to play it at four, with the same people if possible, to get the most out of it.",
    "timestamp": 1723586400
  },
  {
    "username": "properplay",
    "rating": 2.0,
    "comment": "May give this another chance with 3 or 4P although the game was incredibly long with 2P already. Clearly unbalanced factions, working class is way easier to pilot than the capitalists. There didn't seem to be a lot of meaningful decisions to take, autopilot kind of game. Seems you're outcome will be largely determined by mistakes other players make. Capitalists was just about building some businesses and micro optimizing cash flow in an endless cycle of production, sales and taxation. Pretty dull.",
    "timestamp": 1721685600
  },
  {
    "username": "jgoyes",
    "rating": 2.0,
    "comment": "2024-06-29\n\nInitial Rating: 8.0 (June 2024)\n\n• I acquired Hegemony: Lead Your Class to Victory in the KS, but as is usual with me, I didn’t know anything about the game. Still, I couldn’t help but notice its meteoric rise in BGG’s ratings and some friends raved about it, so my desire to play it was very high. After I did, I can only say Hegemony: Lead Your Class to Victory is a crushing disappointment to me.\n\n• I like the theme; Hegemony throws you into the heart of a class struggle. You play as one of four factions – Working Class, Middle Class, Capitalist Class, or the State. Each class has its own unique goals and challenges, which is an interesting concept and a novel one.\n\n• Hegemony: Lead Your Class to Victory has a long playtime, easily surpassing the 4-hour mark. I’m almost embarrassed to write it took us 8 hours to finish it (including the game explanation). I have never had a Twilight Imperium game go for this long, but I play with a (somewhat) slow player and the game explanation was also very long. Still, I don’t think 5-6 hours is outside of the realm of the probable which is TOO MUCH for what the game offers.\n\n• The player aids don’t work as intended. They contain a lot of information that is hard to quickly parse, adding significantly to the downtime and playtime. A better design could have saved a lot of time and frustration.\n\n• I was also expecting a heavier game as its weight is (as of today) 4.20 on BGG. It’s a complex game, don’t get me wrong, but I feel I have played games with harder/deeper decisions that have a lower weight rating. I think its complexity arises from the asymmetry of the factions and the plethora of small rules, which makes the game hard and long to teach. But once the rules are clear, the decisions needed to play the game aren’t that hard to process. The game is very complex, but not that deep.\n\n• Gameplay is very interesting and at first, I was liking the game. The game goes for 5 rounds in which players must navigate through various economic and political decisions depending on their faction. The Worker and Middle Class want education, healthcare, and food, the Capitalist Class and Middle Class generate goods for sale and employ Worker and Middle class workers, and the State tries to help all factions homogeneously. However, the decisions aren’t as deep as I initially thought. You have to play to your faction’s strengths, and the best option is shown in a very blatant, scripted way. That is, the game presents itself as having lots of options to analyze, but I feel there are few real choices to be made. The best option is readily apparent, which is why I disagree with the current game weight. The plethora of rules makes the game slow and complex, but I feel the game isn’t as deep as promised.\n\n• The luck factor is very high and uncontrollable. When my friend was explaining the rules, I saw how this could be a good game, but not a game for me. There is luck of the draw with the cards, and you cannot do much to impact it. You need to play with the cards you drew and that’s it. You can play a card to make a basic action or to execute the text of the card. I dislike that as many times, the text of the card is just a basic action but with a stronger effect. Sometimes the effect is very distinct, which would have been my preference. Some of the cards are OP without any doubt, which I heavily dislike as it’s pure luck if you draw them or not. There are Immigration cards that, at random, seed the available employees. The luck here heavily impacts the game’s outcome BUT you can manage it a bit with the game’s mechanisms. There are event cards that affect the State player, but those can also be mitigated. So far, I was liking the game, but what I really can’t stand is the following.\n\n• You cannot impact laws directly; you must generate votes and place them in a bag and later you draw them to see if the law passed or was repealed. This is very similar to how Clank! noise system works. I hate it in Clank! (a much shorter game) and I hate it here. Having more votes and influence doesn’t mean you can pass a law, even if you work hard for it, you still need to have luck on your side to do so. I know that having more cubes in the bag means odds are in your favor, but it can happen that luck decrees that the player with the least number of cubes in the bag wins (which happened in our game) and I hate this. I can understand this mechanism in a short game, but not in a very long one. This means you can play perfectly, make all the correct decisions, and still lose just by luck. I cannot stand this.\n\n• Hegemony: Lead Your Class to Victory has asymmetric factions, which I love, BUT they are very unbalanced. I mean, it’s much MUCH easier to play and win with the Working Class faction than the Middle Class faction and I hate this. The game is inherently unfair and it doesn’t disclose this; you have to find out by yourself (other games assign a difficulty rating to the faction, not here). I know people are going to say winning with the Middle Class is possible and it is, but it requires much more skill and finesse and this shouldn’t happen in my book. I play games to match wits with my friends, but games like this introduce an unfair and undisclosed, and thus, random handicap. After thinking about it, I think this is the order of difficulty of the factions, with the hardest at the top: Middle Class, Capitalist Class, State, and Worker Class. The game leaves players to balance it themselves and I hate this in games. This means players are going to attack the perceived leader often but the real leader could be hidden.\n\n• Up to this point, I was sure I was going to get rid of the game, but I felt I could play it again as there is a lot to like in Hegemony: Lead Your Class to Victory. But what REALLY killed the game for me is the reset that happens when the State goes broke. When this happens, all the laws are reset immediately and the worst part is that this will affect the current turn. Each turn you check each law by itself, but the one that can make the state go bankrupt is checked first and if this happens, the rest of the laws are skipped. This can be thematic BUT this should not happen in a strategy game. This means that your multi-hour effort can be just undone by a single effect in the game and what I cannot stand is that it affects the current turn. I would be more forgiving if the effect would affect the next turn, meaning that all players worked for in this turn could still be executed, but as this happens immediately, this can destroy you and help other players just because. This is awful as it can destroy all your plans, it resets the game so many of the previous decisions become meaningless by a single event and you may not be able to stop this by yourself. I understand that if you know this can happen (it was a surprise for us) you can try to manage it or use it to your advantage, but in the end, I HATE that a SINGLE event can have such a big impact on the game, this single event simply steals agency from players and I refuse to play the game ever again due to this. This may be thematic, but I don’t play games to simulate real life. Real life is very unfair and I cannot stand unfairness in my games.\n\n• Best with 4 players. The downtime is horrendous on this one and that makes the game no fun for me. I can easily stand long games, but long downtime is a cardinal sin in my book. There is a lot of negotiating among players and, while I like this on paper, it makes the game very slow.\n\nBottom line, Hegemony: Lead Your Class to Victory is a huge disappointment for me and I already sold it. I won’t ever play it again. I cannot stand the randomness, unfairness, and chaos in a game that easily can surpass the 4-hour mark. I don’t understand (but I respect) how players can like a long game with this level of luck, unfairness, and randomness in it. Hegemony: Lead Your Class to Victory is a very unbalanced game and it leaves the balancing to players themselves. The final nail in the coffin for me was the state bankruptcy mechanism. When the state goes broke, all laws are reset immediately, potentially undoing hours of work on your part. This can happen mid-turn, meaning all your planning and effort can be wiped out in an instant. Thematic? Maybe. Fun gameplay? Absolutely not. My friends were amused by the game’s outcome but when the State went broke I couldn’t enjoy it any longer (still I’m happy I got to see that part of the game, so I can never play it again). Downtime is horrendously high. On the other hand, there is a lot to like in Hegemony: Lead Your Class to Victory. It is a novel game with a novel theme, its mechanisms are very thematic and it offers (somewhat) interesting decisions. If you're looking for a long, complex game with a heavy dose of luck and potential unfairness, Hegemony: Lead Your Class to Victory might be your thing. However, for me, the frustration outweighed the fun. I feel this is more of a simulation than a strategy game, and I don’t play board games to simulate unfair life. If a game takes more than 90 minutes, luck should be much more controlled, and Hegemony: Lead Your Class to Victory is a very long game. The game’s outcome will not be decided by players' skill and I hate this. You can make all the correct decisions and still lose which I absolutely hate. As the game is so well ranked, I encourage you to try it, it's very likely you will like it, but I won’t ever touch it again as I heavily dislike the unfairness of the game. Ultimately, Hegemony: Lead Your Class to Victory is a clever and novel design, but it’s no fun to play for me. HUGE dissapointment.\n\nCurrent Rating: 2.0",
    "timestamp": 1719612000
  },
  {
    "username": "Schroederek",
    "rating": 2.0,
    "comment": "The rating on this game is way too high. This is more of a simulation than a game.",
    "timestamp": 1716328800
  },
  {
    "username": "Fawkes",
    "rating": 2.0,
    "comment": "How was this even published? It's barely a coherent game. Next time get a game developer that knows what they're doing. It's a neat concept but the execution is simply terrible. Games are supposed to be fun. There is nothing fun about this... activity. Can't even call it a game.",
    "timestamp": 1713045600
  },
  {
    "username": "Arcantor",
    "rating": 2.0,
    "comment": "Super asymmetrical and not well balanced either. You urgently need a well-rehearsed players (!) Newcomers are otherwise completely lost. Otherwise you waste 3 hours, have no chance .... Nice game nights look different. Only makes sense with 4 people and then it takes very, very long. Any other constellation shows the weaknesses of this game extremely!\nIn terms of game duration, required number of players and their familiarity, there are far better and more entertaining 4-person games.",
    "timestamp": 1678575600
  },
  {
    "username": "igeorgiev42",
    "rating": 2.0,
    "comment": "just meh",
    "timestamp": 1640991600
  },
  {
    "username": "ImASquid",
    "rating": 2.5,
    "comment": "A game with such complexity but so little depth.",
    "timestamp": 1759269600
  },
  {
    "username": "Rlyslow",
    "rating": 3.0,
    "comment": "One of the worst and overhyped games at all. Nothing work even on average lvl.",
    "timestamp": 1758751200
  },
  {
    "username": "neohun",
    "rating": 3.0,
    "comment": "Где-то в середине игры начинаешь делать одинаковое действие каждый ход, замечу, что самое выгодное, и в конце занимаешь второе место после государства. Все остальные механики и взаимодействия занимают мизерное время при игре на победу.",
    "timestamp": 1753480800
  },
  {
    "username": "rsolmes",
    "rating": 3.0,
    "comment": "I was genuinely looking forward to this game...but it is a yawn-inducing simulation more than it is a board game. So, I'll concede that the disparity between my expectations and my experience account for some of my disappointment. But for long stretches, I felt the \"game\" was playing me. The action selection (cards or basic actions) was banal. And although the game promises \"many ways to achieve hegemony\", there were few real choices presented (as the capitalist, your path to victory is pretty obvious-reduce expenses and maximize profit). And at 2 players the game is even more on rails as the outcomes of actions are predictable and not interesting (incidentally, the game recommends the 2 player variant as an introduction to gameplay-YIKES!). I also felt the game was didactic in tone as it attempted to demonstrate the obvious consequences of the antithetical aims of each class: surprise...it creates disfunction and exploitation in contemporary democracies. I get it, I live this reality, I don't need it played out in front of me on my table. I felt like I was back in social studies class being lectured to. I wanted to play a game and I got an macro economics lesson (and not an engaging one at that). Yucky! I very rarely slam the door on a game and declare \"NEVER AGAIN!\", but this is one of the rare occasions.",
    "timestamp": 1749592800
  },
  {
    "username": "Bortolazzi",
    "rating": 3.0,
    "comment": "Totally don't get the hype. Repetitive turns and scoring = boring. Overrated.",
    "timestamp": 1749333600
  },
  {
    "username": "hillsidecouncil",
    "rating": 3.0,
    "comment": "If working class jobs don't pay enough, workers can strike, disrupting production and incentivizing higher wages. Despite some nice moments like this, Hegemony fell short for me as both a game and a simulation.\n\nAs a game, it's an efficiency puzzle about balancing direct profit against influencing the law (to indirectly increase future profit). Some of this is fun—particularly the clever voting system. But the game's various procedures take way too long. I don't mind games that take a long time, but I want that time to have a density and richness that I didn't feel here. For me, the juice wasn't worth the squeeze.\n\nAs a simulation, I felt that although Hegemony can capture what happens in the world, it rarely captures why. For example, the working class directly scores points for establishing unions. But in real life a union isn't an end it itself. Rather, unions emerge from workers' shared needs. In Hegemony, direct scoring too often stands in for the complexity of real life. I don't think the designers are naive, and I can see why they'd put their hands on the scale: The game system is slow, and making room for true emergence could slow it down even further.\n\nThe complex, emergent dynamics of class conflict might just not be a natural fit for a procedural efficiency puzzle!",
    "timestamp": 1748037600
  },
  {
    "username": "Valcurdra",
    "rating": 3.0,
    "comment": "Hegemony is a very ambitious game and unfortunately leaned more into its theme than its gameplay.\n\nHegemony is absolutely dripping in theme, there is an obnoxious amount of rules and moving parts and its definitely one that needs a learning play before you understand what is going on. At least on your actual turn, your options are pretty digestible, its just a head trip to work out, what all the moving parts will do at first.\n\nIronically once you do begin to grasp all the moving parts, you will find a shocking lack of depth to gameplay. There are tones of rules and options, but frequently many are futile or attack others with little benefit to yourself. The basic gameplay loop of all factions is actually very simple and pretty boring, buy stuff, sell stuff or spend it, the state is the most different, but also very limited.\n\nThe game is also very frustrating and annoying, certain factions are pre ordained to attack each other all game and honestly, it gets tiresome. The hand management creates an unwelcome level of randomness, where having the right move in hand at the right time is pure luck and only gives the illusion of agency.\n\nWorst of all is that the game is wildly interactive, other people's play could help you or completely shut you down and it's difficult to predict due to not knowing anybody's cards. In a long and heavy game, you have such a poor decision space. I literally never get angry during a game but I found this game really got under my skin.\n\nThe theme of politics comes through beautifully and it was clearly designed by or with an expert in economics and politics, I really like how the tone of the game is generally neutral and academic and it doesn't take sides at all. This is a better educational simulation that it is an actual game.\n\nThe art is nice, but the components otherwise are just pretty basic, but completely fine.\n\nA fascinating and unique euro experience in some ways, but ultimately a failed design. I rated it a 9 initially, but after a few plays the flaws really showed.\n\nI personally think the high ratings are due to people playing 1-2 times and getting sucked in by the theme and not noticing the shallow gameplay, can't criticize them, it worked on me too initially.",
    "timestamp": 1743458400
  },
  {
    "username": "bneffer",
    "rating": 4.0,
    "comment": "One of THOSE heavy euros, mixed with social interaction. I think to get the most out of this game you'd have to LOVE it. And that's not happening in my game group.",
    "timestamp": 1759960800
  },
  {
    "username": "storied",
    "rating": 4.0,
    "comment": "First play, on the fence about this.\nThere are times when a series of actions feels very thematic and exciting, and there are other times when it becomes a sprawling euro with mechanic-based decisions. The setting dissipates quickly. I played as the state and the experience felt a little hollow. I'm interested in how the capitalist works. I don't like how loans are only taken when they're necessary. I wish it implemented a system more like brass where the capitalist or state could quickly online their economic engine.\nThe voting is exciting and it's great to see how the policies affect the state of the board.\nThe teach is incredibly difficult. Being the teacher for this game is probably the most challenging experience I've had and I've taught John Company, Lacerda games, and plenty other 4 weight rated games. The asymmetry is just enough where there's no framework to teach across every player. If you're interested in this game, I highly recommend everyone teach themselves before playing.",
    "timestamp": 1755122400
  },
  {
    "username": "sykano",
    "rating": 3.6,
    "comment": "economy and politics simulation strategy game\nsomewhat asymmetric\n\nNot sure about the theme. It's different and a bit interesting, but it reminds too much of daily problems and work. I also don't fully believe in the Class Conflict, especially not as a fixed inescapable truth.\n\nI like the card-driven play (play a card for effect or discard for basic action) and that the cards have a slight 'epic event feel'.\n\nAsymmetry is there but not completely, especially Middle Class and State seems a bit lackluster in that respect. A problem can be that everyone wants to play the Capitalist Class.\n\nThe rules are complicated but the game is basically just about manipulating the market to get resources for cheaper or sell for more.",
    "timestamp": 1754344800
  },
  {
    "username": "spencyrrh",
    "rating": 4.0,
    "comment": "2023-06-12 (1 play at 4 at Cardboard Emperors): Not at all an asymmetrical, political bombshell, so much as a run-of-the-mill, mid/heavy, modern, four-player-only Euro with slightly different engines for each seat.\n\nMost of the game lives in standard resource conversion, with cards played for ops and events. You have a faffy player board. It's Terraforming Mars with extra bits from here and there. The theme is almost irrelevant. The game models nothing in particular, and has nothing political to say. Nothing you do feels like politics. I thought the name indicated an ambition to follow Gramscian dynamics of power, or at least cultural dominance. Not a bit of it. You get victory points for doing this or that.\n\nSome have said the game is 'high interaction'. This baffles me. I guess those saying such things are comparing it to other complex Euros currently on the market. Some of the things you need are sometimes mediated by others, who may lean on mechanisms which affect you sometimes. Mostly, you follow a solo optimisation puzzle nobody else cares about, and sometimes, someone else's turn gives you a treat, or robs you of a choice. So far, so Euro.\n\nThat said, I kinda had fun! I especially liked the voting section, with the surprise revelation of bids. I had some funny take that cards. And I was losing pretty badly, so maybe I missed most of the experience.\n\nIf you are looking for a game which teases out class relations, forget it. If you want dramatic asymmetry, look elsewhere. But if you like optimisation worker placement doodling, you could do worse.\n\nThe game is pretty long, and probably needs to be to give you room to build and then score. But it's too long for my preference. It's a little hard to grok at first. Even though the rules aren't too complex, I (playing the middle class) found good play very opaque in the first hour. Perhaps further plays would reveal more strategy, but I'm not in a hurry to return.\n\nThe production is fine. The cards can stick together, and some of the colour and text choices require squinting at, across a huge board. The different sizes of workers are tough to read at a glance. The rules were mostly okay. A couple of fiddly ambiguities could have been clearer. I could not for the life of me, despite being prompted several times by patient co-players, remember the difference between my resources 'for sale' and my resources in my 'goods and services' box, nor how to move tokens between them.",
    "timestamp": 1744236000
  },
  {
    "username": "Beastly_Venturer",
    "rating": 4.0,
    "comment": "2 plays. Found the concept interesting but just lacked enough game fun for me and it is too long for what I get out of it. The levers seem to head back to the middle too much.",
    "timestamp": 1742511600
  },
  {
    "username": "SkyGlad",
    "rating": 3.5,
    "comment": "Might be willing to give this another shot, since I’ve only played it once. But far too long, with not enough difference in my actions at the beginning vs end of the game to make the length even feel somewhat acceptable.",
    "timestamp": 1734908400
  },
  {
    "username": "shanev316",
    "rating": 4.0,
    "comment": "I decided on a 6 because I respect what this game *tried* to do, but it would go down in rating before it would go up.\n\nFirst, I had high expectations for Hegemony and am therefore probably over-reacting in my negative review. I anticipated a mostly player-driven design that provided plenty of room for clever plays and negotiation and yet Hegemony feels on rails, with slight variation injected by a huge deck of cards (that's the popular thing to do right now, of course). There's no way I'll play this enough to see the different strategies that each faction could take, but my guess is there aren't many. The \"fun\" is in the discovery of each faction and to me, that's not even fun.\n\nMaybe the biggest problem is that I have a version of this game in mind that is much better, albeit much harder to design, that actually plays like an sociopolitical economic sandbox (see Food Chain Magnate). Hegemony reduces each faction to a couple of resources to keep track of and then holds a vote determined by a random draw (nothing better in an optimization game than randomness). No, I get what it's trying to simulate.. I don't care.\n\nMy goodness is this game long. It's a hefty teach and it requires constant rulebook referencing. My tastes are changing no doubt. I'm a dad of 2 young kids, my gaming time is decreasing, I'm moving and will be looking for a new group of gamers, and therefore my tastes are getting lighter and lighter. But I'll dig into a heavy game if it warrants it, if it justifies its play time, if it keeps a high density of good decisions. Hegemony is none of those things in my opinion.\n\nAnd there's my unorganized first thoughts.. I may return to this and clean up this review at some point. I probably won't. I hesitate to call Hegemony a bad game, but it is undoubtedly one I personally do not wish to return to. I don't think I will be in a mood to play this again and 5 seems like a cop out for a game I feel pretty passionate about. I guess 4 it is.",
    "timestamp": 1734303600
  },
  {
    "username": "ab4523",
    "rating": 5.0,
    "comment": "Impressively creates economic dynamics with excellent interaction between well balanced factions. I’m less keen on the political aspects, which feel like a tug of war, or an impassive stalemate, on the policy tracks. Undoubtedly, the game comes to life with ‘table talk’ aligned with faction interests. What I dislike most are the action cards – it makes each turn feel like I’m following a script. The free actions are usually obvious, so they don’t improve my feeling of agency. Willing to play again but decisions aren’t interesting enough for me to enjoy this more.",
    "timestamp": 1760824800
  },
  {
    "username": "rseater",
    "rating": 5.0,
    "comment": "An interesting simulation. I feel like it is possibly low on real agency. There are neat interacting incentives, but actual strategy appears to be heavily dictated by the cards you draw.\n\nAlso, the theme is odd.\n- Capitalist seems to really mean Monopolist, since they play as a single unified player across all industries.\n- Working Class seems to really mean Socialist Union, since they also play as a single unified player.\n- Middle Class seems to really be an abstract role that produces a little bit of competition with the capitalist and a little bit of competition with the working class. The presences of the MC role makes the other two roles make more sense.\n- Government is an interest reactive role who has to deal with being pushed into various policies by the other players. However, that role might actually have the least real strategic control and agency, although it is interestingly asymmetric.\n\nIt's a neat simulation even if it is a pretty flawed model of real societies.\n\nMy biggest issue is that it has a very long playtime. The box claims 3 hours for 4p, but my first game took 5 hours after 1+ hours of rules explanation. It has a lot of rules to learn before you can predict others' actions, with not many shared mechanics between players. There is lot of potential to need to replan your turn just as the round comes back to you, slowing things down a lot even with players who are trying to be brisk. Some of the rules really do feel like you are doing your taxes. and you need to do a bunch of arithmetic on a regular basis to make competent choices. It really does not lend itself to quick-and-sloppy play.",
    "timestamp": 1760392800
  },
  {
    "username": "Ybrichev",
    "rating": 5.0,
    "comment": "This felt like going to work.",
    "timestamp": 1757282400
  },
  {
    "username": "Scifi66",
    "rating": 5.0,
    "comment": "A solid economic COIN style game - in fact better than my COIN games to date. Asymmetric factions come together in interesting ways. I'm a fan of political economy so right in my wheelhouse and with plenty of agency.\n+Theme and asymmetry\n+Excellent production\n–Tough teach\n–Bit long for a weeknight game. We had 4 hours of playing time plus a 50 minute teach plus setup/tear down. Also a table hog.",
    "timestamp": 1756677600
  },
  {
    "username": "1ocean",
    "rating": 5.0,
    "comment": "to long in playtime for that what it provides",
    "timestamp": 1754949600
  },
  {
    "username": "TertiaVigilia",
    "rating": 5.0,
    "comment": "Nice simulation. You are not fully immersed, but a little, which is still remarkable for a VP game of this magnitude.",
    "timestamp": 1747432800
  },
  {
    "username": "willbeplayin",
    "rating": 5.0,
    "comment": "This game promises a lot indeed, but falls a bit short. It's quite thematic to some extend, I'll give it that, but there seems to be less game in here than you would think, especially given all the hype.\n\nThere's very little leeway in how you play your class - no matter who the player is in any given class, they're essentially following the same formula from start to finish with little to no deviation. I'm not sure how the game will hold after the four plays, after you've played each and every class. I've now played CC and State and while I kinda look forward playing MC and WC, at the same time I already know how those classes will play.\n\nThe rulebook is absolutely horrendous and it was such a huge mistake separating the rulebook into four sections like they did. Not only are rules hard to find, but learning about the overall flow of the game is made extremely hard by the decision of slitting it into that many sections. There are also some fiddly rules here and there and the iconography is not the best in some cases.\n\nThe game is also too long for what it is. I don't mind long games, but this goes on for 1-2hrs too long.",
    "timestamp": 1741993200
  },
  {
    "username": "klaypoll",
    "rating": 4.5,
    "comment": "Too heavy a game for my tastes. Couldn't see the theme shine through as I was expecting.",
    "timestamp": 1739487600
  },
  {
    "username": "Ludwig3366",
    "rating": 5.0,
    "comment": "A jouer absolument à 4. Quant aux concepts économiques qui sous-tendent le jeu, ils sont assez grossiers voir caricaturaux. Dommage car l'édition est réussie.",
    "timestamp": 1736982000
  },
  {
    "username": "jelsepa",
    "rating": 5.0,
    "comment": "This is a euro disguised as an economic game. In the end, there isn't any subtleties: the best option is always to score points.\n\nThere is no meaningful interaction. It's like playing on the same washing machine on each of our turn. You simply change the features so that it fits with your personal agenda (which is scoring most points). Then the next player does the same. So you interact basically with a machine that will interact with the other players.\n\nThe more I played it, the more I was disappointed. I thought it was a great game at first, but then the game slowly unraveled itself as being just another modern euro.\n\nIf you enjoy Barrage, you'll certainly love it. But for me, it's not worth it. I'd rather play Weimar instead.",
    "timestamp": 1735340400
  },
  {
    "username": "Joe Miner",
    "rating": 5.0,
    "comment": "OK, it's one game, but not seeing how I would ever want to play this enough to get good at it or to figure out how to take advantage of the various classes.",
    "timestamp": 1734562800
  },
  {
    "username": "neural_net",
    "rating": 5.0,
    "comment": "Initial rating: a clear 10.\n\nAfter 3 plays, dropping to an 8. Breadth seems bigger than depth. Sometimes convoluted and requires a lot of bookkeeping, too long for what it is.\n\nI still consider this an amazing achievement, definitely my most unique game. The theme implementation is off the charts, love every detail of it.",
    "timestamp": 1732489200
  },
  {
    "username": "Big Bad Lex",
    "rating": 5.0,
    "comment": "First Play: Played Capitalists. There is a mountain to climb with the first play as the rule book is a beast and the asymmetry means that each player needs to properly grasp the needs of their class. Unfortunately this means that you might not understand the needs and objectives of the other classes so whist they talked through their cards and moves, I had no idea what they were doing or why. They could have been saying anything.\n\nThere was constant checking of the rulebook and general discussion so the game ran very long. Over four hours and we only managed to play four rounds. The scores were very tight but I don't understand/ appreciate 75% of the game so don't feel I can give a rating. Needs a second play (at least) but it would be sensible to stick with original classes to speed this up.\n\nPlay #2: Same players at the table and we kept the same classes. Although I was more confident with my class, it seems that the Capitalists are less involved than the Workers and Middle Class. Whilst I had worked out my move before it got back to me it seemed that the others had a lot more to consider and options so they needed constant clarification and to wind back frequent misinterpretations. AP was at times massive. This time we played for 3 hours and managed only 3 rounds. I can't see how this game could be played in three hours with 4 players even if they were fully conversant with the rules.\n\nThis is certainly a clever game but I believe the player asymmetry also reflects a significant disparity in the potential for interaction and action options and I question the fun associated with substantial amounts of solitaire play and such a long playing time. I don't feel the urge to ever play this again.",
    "timestamp": 1731106800
  },
  {
    "username": "Malakizedek",
    "rating": 5.0,
    "comment": "I don’t get the hype. I majored in political science and had hoped this would be the perfect game for me. But it had the most annoyingly fiddly and long set up and it overstayed its welcome, taking far too long to finish. And it just… wasn’t very fun.",
    "timestamp": 1730761200
  },
  {
    "username": "Sinizar",
    "rating": 6.0,
    "comment": "Kickstarter with expansion.\n\nBiggest complaint, warping player boards. Really cheap board game stock, the art works is also boring, the rulebook is also vague and doesn't explain the rules well so you spend time on forums when learning the game. This one needs a reboot to fix all the issues. I can't recommend this in the current form.\n\nThis game is heavy, rated as lighter than Food Chain Magnate but much heavier when you play it. The rules can be difficult to understand and can slowdown the first and second time playing this game significantly. Easy to forget rules requires you to have a FAQ on hand. If you plan to play this the first time, start early in the day.",
    "timestamp": 1760047200
  },
  {
    "username": "Kamaitatchi",
    "rating": 6.0,
    "comment": "Interesting. Suffers from relying on all players to be sufficiently capable/ informed of every factions capability. I don't have the luck to have a playgroup that would play this sufficient times to get past the \"learning stage\". And I do think this game would be more fun past said phase.",
    "timestamp": 1759701600
  },
  {
    "username": "logopolys",
    "rating": 6.0,
    "comment": "This game was fine. It did a really good job at having a lot of moving parts click together, especially since so many of those moving parts were highly asymmetrical. I found the theme of the game to be somewhat lacking. By distilling class distinctions into four interacting buckets fueled entirely by wage and access to basic quality of life luxuries, the game misses some of the critical interactions that these classes generally have. There was no consideration of social or culture conflicts. No consideration of the role of race or gender in the economic world. No consideration of foreign affairs, wars, or disasters. Granted, these critiques are vastly outside of the scope of the game and would be nigh impossible to include. However, the talk around the game hyped up its definitive status as a simulation of class conflict, and that's hard to take seriously as presented. It's a fine engine building game. It's not a strong representation. I think a compelling argument can be made that there's actually no such thing as a middle class, and they're a quarter of the game. There are some odd choices here.",
    "timestamp": 1759356000
  },
  {
    "username": "jellyfishjoe",
    "rating": 5.7,
    "comment": "Perhaps a better model than a game. I enjoyed my play, but I'm not sure there's sufficient strategic depth to warrant the runtime.",
    "timestamp": 1759096800
  },
  {
    "username": "Philipp Klarmann",
    "rating": 6.0,
    "comment": "Not for me, too dry",
    "timestamp": 1757455200
  },
  {
    "username": "FlightOfGreen",
    "rating": 6.0,
    "comment": "Not quite sure how to rate this game. I definitely like the political part of the game the most, bluffing, negotiating and ultimately voting for new policies. There's room for brief alliances as priorities align, and some meaningful interaction between players.\n\nI think they may have simplified the economic model too much though. I probably haven't played it enough, but I struggle to see how you can reach truly socialist board state, for instance. And I'd like to see a central bank of sort, which feels like a missing piece.\n\nIt is unique enough both in its shape and message, and so I do appreciate that this game exists.",
    "timestamp": 1756764000
  },
  {
    "username": "TheMiddleAgedGamer",
    "rating": 6.0,
    "comment": "i enjoyed my time kinda, but i dont think id ever want to play again. there were parts i lkiked, but i think if you dont get excited about the theme, it's probably no worth it.",
    "timestamp": 1755122400
  },
  {
    "username": "laytox",
    "rating": 6.0,
    "comment": "Initial play as The State.\n\nSecond play as Working Class, brutal final round\n\nPlays like an economic COIN game. Lots of crunchy decision making. Interested to get some more plays in as other factions\n\nNot convinced on the long-term replayability of this one, also despite being 4p, playing as the State just isn't fun.",
    "timestamp": 1754949600
  },
  {
    "username": "kyk10pes",
    "rating": 6.0,
    "comment": "1 play at 3P. Nicely asymmetric, and a very cool & detailed economic sim. Could go up.\nIm not sure anyone should play with fewer than 4, I can see the push-pull areas where the 4th player would've provided an important counterbalance.\nBut my biggest complaint is the disconnect between the well- designed economic system & the scoring. Rather than having asymmetric victory conditions integrated into the engine, points are arbitrarily gained by specific actions. This broke my engagement with the sim, eg in the last turn as the capitalist I supported a socialist law change bc the middle class was my competition for 1st place & the laws no longer affected the game except for scoring.\nIt's still a very good game & I'm looking forward to playing it again.\n\n4 plays later: really enjoy playing but I still feel like the scoring is somewhat divorced from the simulation itself. And so far, there's been less exploration of the game space that Id hoped for, which makes me worry that there's just less to explore than Id originally thought.\n\n7 plays later: this really fell off of the cliff for me. It's a great simulation but there just isn't that much game under the hood- things tend to play out in the same general patterns. It's just not worth it esp with the long play time.",
    "timestamp": 1752703200
  },
  {
    "username": "stenole",
    "rating": 6.0,
    "comment": "(4P) Play as different societal classes in this nation simulator game. This includes voting on policies, starting businesses, selling goods and services, finding employment, striking for more pay etc. Mechanically it is not very complicated, but understanding the path to victory points is not at all trivial.",
    "timestamp": 1752444000
  },
  {
    "username": "DeadDomino",
    "rating": 6.0,
    "comment": "I found thinking about the system and its implications the next day quite interesting, but I’m not desperate to play it again especially considering the length",
    "timestamp": 1751839200
  },
  {
    "username": "norsedog",
    "rating": 6.0,
    "comment": "Still learning, so up for revision. The learning curve is *rough* though, because the rules are written with details spread out and occasionally hard to find.\n\nOverall, the game leaves the (eqarly) impression that it suffer from being hard to understand and too long, so that quick iteration to grow isn't really an option. In addition, there's a serious runaway winner problem. I also suspect that it's a bit too random (with industry card draws and policy changes) for the subject matter.",
    "timestamp": 1748642400
  },
  {
    "username": "punyalebah",
    "rating": 6.0,
    "comment": "Too much rule overhead, willing to try again.",
    "timestamp": 1746914400
  },
  {
    "username": "ToBakai",
    "rating": 6.0,
    "comment": "Sehr heftig mit nicht ganz so schöner Ikonographie. Hardcore Wirtschafts Nerds werden es lieben, ansonsten gibt es für einen Komplexitätsgrad von 4X deutlich schönere Titel.",
    "timestamp": 1746655200
  },
  {
    "username": "Koert",
    "rating": 7.0,
    "comment": "Atypical asymmetric strategy game. Only a partial first game, but interested to explore this further.",
    "timestamp": 1761951600
  },
  {
    "username": "d3stinyman",
    "rating": 7.0,
    "comment": "This game needs someone that knows the rules. It is very complex and you will need at least 6-7 hours for your first play. you have to read a 20 page rulebook per person, all of those being different from each other and you need four players.\n\nAfter that big, massive initial cost, it is a great game. However, the cost to play it is too high and this is a game you can table maybe once per year.",
    "timestamp": 1761865200
  },
  {
    "username": "Mr Mjeh",
    "rating": 7.0,
    "comment": "Very interesting game simulating the politics of society",
    "timestamp": 1760220000
  },
  {
    "username": "Bankler",
    "rating": 7.0,
    "comment": "Trade includes Crisis and Control expansion",
    "timestamp": 1759356000
  },
  {
    "username": "BuzziBilly",
    "rating": 7.3,
    "comment": "Brilliant idea, plenty of flaws in the implementation. In the very end falls flat and repetitive...",
    "timestamp": 1756072800
  },
  {
    "username": "visard",
    "rating": 7.0,
    "comment": "Asymmetric country simulator. Play as working or middle class, capitalist or state.",
    "timestamp": 1755727200
  },
  {
    "username": "paulastoria",
    "rating": 7.0,
    "comment": "Ok",
    "timestamp": 1754949600
  },
  {
    "username": "skytostar",
    "rating": 8.0,
    "comment": "Great game !!! Play the game now !!!",
    "timestamp": 1762297200
  },
  {
    "username": "redy12345",
    "rating": 8.0,
    "comment": "Very interesting concept, I have never seen a game where every decision has so many unforseen consequences for all the other players. It is fully asymetric, which means it is hard to balance and it may not be balanced very well. I am at just one game right now and it is hard to say yet, might change my rating in the future.\n\nThe state seems like the least interesting class to play, they lack agency and choice, which means in a 4 player games one player might have to choose the least interesting side",
    "timestamp": 1762038000
  },
  {
    "username": "hazegiant",
    "rating": 8.0,
    "comment": "For me this game is close to a 10/10 but I don't like 2 elements:\n- assigning workers rules for me are not figured out well and in clean way. Most of the questions and doubts came from this part and we have found out that element strange/unbalanced in some situations. For us it's stupid to take your workers as middle class or working class from three different companies and just destroy other player income despite a lot of jobless workers are available...\n\n- last round IMF intervetntion is too swingy I don't think it should happen at this point of the game especialy when influence cubes do nothing during end game scoring and when IMF intervention happens you \"lost\" your voting actions which sucks even more.",
    "timestamp": 1761429600
  },
  {
    "username": "yickwah_2012",
    "rating": 8.0,
    "comment": "It is really a interesting game with an amazing mechanism. All players rely with each other, but fight for their own benefit on the same board, and it's still an art to persuade others to agree your policy proposal.\n\nThe only weakness is...it takes over 2 hours for a game",
    "timestamp": 1761343200
  },
  {
    "username": "Sobczak",
    "rating": 8.0,
    "comment": "4 osoby, każdy musi ogarniać swoją klasę",
    "timestamp": 1760997600
  },
  {
    "username": "mishbish7708",
    "rating": 8.0,
    "comment": "A very well designed game - it's a little too close to reality for my liking though, I prefer a bit of escapism in my hobbies!",
    "timestamp": 1760824800
  },
  {
    "username": "Aratar",
    "rating": 7.5,
    "comment": "What an achievement to design this great simulation of parts of society. For the amount of time it takes to play I do prefer other heavy euros though.",
    "timestamp": 1760565600
  },
  {
    "username": "Kamil2310",
    "rating": 8.5,
    "comment": "+ Hegemony: Lead Your Class to Victory – Crisis & Control\n+ Hegemony: Lead Your Class to Victory – Historical Events\n+ Sleeves\n+ 3D Printed Insert",
    "timestamp": 1762470000
  },
  {
    "username": "Kayne02",
    "rating": 8.5,
    "comment": "Rating including Metal Coins.",
    "timestamp": 1762297200
  },
  {
    "username": "rolfie",
    "rating": 9.0,
    "comment": "Best game of all time. Everything I look for in a board game:\n\nplayer interaction 10/10\ncomplexity 10/10\ntheme 10/10\nart 10/10\nreplayability 10/10",
    "timestamp": 1761951600
  },
  {
    "username": "Dusty27",
    "rating": 9.1,
    "comment": "Super thematic interesting game. Heavy but largely intuitive for a meathead like me.\n\nPlaying the full Four player complement with any new people can long afair. Easy to miss some rules when learning it from scratch as it by and large asymmetric as all get out.\n\nI think I slighlty prefer this at 3 players.",
    "timestamp": 1761778800
  },
  {
    "username": "GameNapsandChaos",
    "rating": 9.0,
    "comment": "With Crisis&Control + Historical Events + official sleeves",
    "timestamp": 1761692400
  },
  {
    "username": "Trelog99",
    "rating": 9.0,
    "comment": "Excellent",
    "timestamp": 1760997600
  },
  {
    "username": "stormthegates",
    "rating": 8.5,
    "comment": "sleeved",
    "timestamp": 1760306400
  },
  {
    "username": "cotomel",
    "rating": 10.0,
    "comment": "Alright entry to CDG's in euro game space. Decent thematic integration, state seems a bit shoehorned in to fill in as the 4th player option. End of round phase is fiddly and a bit annoying. Real score would be around 7.",
    "timestamp": 1762124400
  },
  {
    "username": "clawp1995",
    "rating": 10.0,
    "comment": "3D Insert\n3D Printed:\n- Gear\n\nSleeve Kings Standard 63.5 x 88 (110) SKS-8810\nSleeve Kings Mini USA 41 x 63 (110) SKS-8801",
    "timestamp": 1761951600
  },
  {
    "username": "klutzyk",
    "rating": 10.0,
    "comment": "Played it once but boy was it fun! Played 2p as working class and truly felt like i was being played by the system. Would love to play with the full 4 classes soon",
    "timestamp": 1761692400
  },
  {
    "username": "ulysses11",
    "rating": 10.0,
    "comment": "my favorite game ever!",
    "timestamp": 1761519600
  },
  {
    "username": "Iter69",
    "rating": 10.0,
    "comment": "Reseña Hegemony.\n\nHegemony es un simulador político / social en el cual los jugadores encarnan cuatro facciones (el Estado, los Capitalistas, la Clase Media y los Trabajadores) en disputa por dirigir la economía de un país.\n\nPara simular esta confrontación contamos con un tablero muy bien optimizado en donde se representan:\n-las tendencias políticas: que pueden ir desde el neoliberalismo al socialismo, y desde el nacionalismo a la globalización.\n-las empresas privadas propiedad del Capitalismo y de la Clase Media,\n-la balanza comercial (importaciones y exportaciones),\n-los recursos del Estado: que van desde el medidor de la presión fiscal, las empresas públicas, así como la Sanidad, Educación, etc.\n\nSe trata de un juego que cae fuera de las clasificaciones habituales como “eurogame” o “ameritrash”, ya que en este caso las mecánicas y la ambientación están tan bien ligadas que no se podrían entender las una sin las otras. Pero puedo avanzar que no es un “juego de colocación de cubitos”.\n\nEs un juego asimétrico en el que cada jugador puntúa de distinta manera, tiene un mazo de cartas distinto, y en el que los intereses son tan variables que puedes encontrar a los Capitalistas y los Trabajadores votando juntos una moción de ley, o al Estado intervenido por el FMI si no puede pagar los salarios de sus empleados públicos.\n\nA pesar de plantearse en clave de \"conflicto de clases\" no es un juego de fastidiar a los otros jugadores, sino que tú vas haciendo tu juego y puntualmente podrás usar alguna mecánica que en un momento dado puede molestar un poco a un oponente. La clave para el oponente es no ponerse en situación de que le puedan fastidiar, p.ej. no quedarte sin dinero por si alguien juega una carta que te obliga a pagar, y al no tener dinero te obliga a pedir un préstamo.\n\nIgualmente las votaciones van a dar lugar a que los jugadores se apliquen en convencer a los demás, para que voten en el sentido que ellos desean. Pero aún así no tiene porque ser un juego de discusiones, ni de mal rollo ya que cada clase tiene unos objetivos definidos, que no tienen porqué ser los mismos que tenga el jugador. A lo que voy, es que no tiene porqué ser un juego que por tratar temas políticos, tenga que derivar en discusiones políticas fuera del juego.\n\nEl hecho de ser asimétrico para mí es una genialidad, ya que conseguir que tantas mecánicas funcionen a la vez sin desequilibrarse, implica que el diseño del juego ha tenido mucho testeo y muchas horas de darle al coco para que todo fluya.\n\nAunque sí es cierto que esto provoca que la explicación del juego se vaya a una hora / hora y media ya que realmente estás explicando 4 juegos, porque cada jugador se aplicará en unas tareas completamente distintas.\n\nPero una vez pagado este peaje de acceso al juego, tus compañeros y tú podéis disponeros a competir por ser el Hegemon!\n\nLas partidas son largas (6 o 7 horas + explicación y setup), pero de una intensidad que te tienen pegado a la silla tomando continuamente decisiones. Aunque pueda parecer largo, la magia del juego es tal ¡que se hace corto!\n\nEmpezamos a las 19.00 la partida y cuando ví que era la 1.00 de la mañana no me lo podía creer, porque no tenía sensación de que hubiera pasado tanto tiempo.\n\nSólo lo he jugado una vez, pero en ningún momento estuve aburrido en el turno de los demás, ni tampoco crea un gran stress mental de esos juegos tan intensos que casi terminas la partida con dolor de cabeza. Eso sí, conviene avisar la duración antes de sacarlo a mesa para no dejar una partida a medias.\n\nLos componentes son de buena calidad, con troqueles de buen grosor para los tableros, tokens de madera pero con distintos serigrafiados para darles variedad, y el arte de las cartas sin ser nada especial encaja muy bien con la temática. Además en el inserto encaja todo enfundado y con unas bolsas se puede hacer un setup y recoger bastante rápido.\n\nY bueno, podría intentar hacer una breve explicación de las reglas, pero ni que sea un resumen me llevaría varias páginas. Sólo puedo recomendarte que lo pruebes si eres alguien a quien le llama la atención los engranajes de la política, la economía y la sociedad moderna, ya que el juego ha capturado muy bien la esencia del funcionamiento de una nación. Y verlo todo en movimiento mientras participas de ello, y bromeas con tus amigos sobre si son unos rojos o unos fachas no tiene precio.",
    "timestamp": 1761343200
  },
  {
    "username": "govnarsmrti",
    "rating": 10.0,
    "comment": "Sota i ja",
    "timestamp": 1760997600
  },
  {
    "username": "FireFoxITA",
    "rating": 10.0,
    "comment": "No other game is an experience like that. I've played for more than 6h straight without losing interest and everything was exciting as hell...",
    "timestamp": 1760652000
  }
]