[
  {
    "username": "SFRR",
    "rating": 1.4,
    "comment": "Played it twice, what a waste of time. This has got to be one of lamest, worst, \"bizzaro euro\" games I have ever seen/owned/played. Good riddance, will not ever play it again.",
    "timestamp": 1746568800
  },
  {
    "username": "scps14",
    "rating": 1.0,
    "comment": "The rules of this game are too complicated.",
    "timestamp": 1745532000
  },
  {
    "username": "cotomel",
    "rating": 1.0,
    "comment": "Contrived garbage, scripted 20-30% of the game. Fake forced \"interaction\" that's just trading points to make the game playable. Kudos to the players actually balancing the game, and keeping it alive.",
    "timestamp": 1732748400
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "There's some cool ideas here, but it's obvious that most of the attention was on that dumb magic wheel.",
    "timestamp": 1725573600
  },
  {
    "username": "MarshallStaxx",
    "rating": 1.0,
    "comment": "Basically... this game is Small World for hardcore Excel spreadsheet nerds. Far and away the most impenetrable, complex, and convoluted game I've ever attempted to play. Feels like the kind of game that you must study for months and take a proficiency exam before playing, otherwise you are in for a difficult, confusing, very unfun time. I've only played it once but that was Easily the worst boardgame experience I've ever had at a table.",
    "timestamp": 1710630000
  },
  {
    "username": "DanFred",
    "rating": 1.0,
    "comment": "Probably an okay game, but I find it incredibly boring. No doubt there is a lot of strategy when playing this game, but the game is completely abstracted, goes on way too long, and I find it boring and wanted to quit in the middle.",
    "timestamp": 1690840800
  },
  {
    "username": "Jizzard",
    "rating": 1.0,
    "comment": "unsatisfying? race guides your decisions",
    "timestamp": 1663797600
  },
  {
    "username": "Beedun",
    "rating": 1.0,
    "comment": "Quite boring after you have played every faction. Not sure why so many people like this one. Next please.",
    "timestamp": 1659909600
  },
  {
    "username": "GaiaHero",
    "rating": 1.0,
    "comment": "Boring complicated mess, everything that gives board games a bad name, no thank you.",
    "timestamp": 1623794400
  },
  {
    "username": "firemage85",
    "rating": 1.0,
    "comment": "Terrible",
    "timestamp": 1581116400
  },
  {
    "username": "Epidemius",
    "rating": 1.0,
    "comment": "Multiplayer solitaire",
    "timestamp": 1573426800
  },
  {
    "username": "aircastle",
    "rating": 1.0,
    "comment": "Beware of BGG's incorrect data on this game.",
    "timestamp": 1567720800
  },
  {
    "username": "skeil",
    "rating": 1.0,
    "comment": "Reviewed on Mounted Cloud",
    "timestamp": 1565820000
  },
  {
    "username": "sillywilly4",
    "rating": 1.0,
    "comment": "I don’t get why this is ranked so high. I didn’t enjoy this in the slightest, and was actually frustrated for wasting the time when it was over.\n\nI think this game’s rating is due to people spending $80+ on a bag of wood that feels like doing your taxes, but no one wants to admit the mistake.",
    "timestamp": 1553986800
  },
  {
    "username": "Frozen Flesh",
    "rating": 1.0,
    "comment": "I came here, because of all the people rating mature themed games like KD:M or Hate with a 1, just because of their mature them.\nThis games theme is boring!",
    "timestamp": 1547074800
  },
  {
    "username": "sgosaric",
    "rating": 1.0,
    "comment": "And you may find yourself living inside a spread sheet\nAnd you may find yourself behind a panel with many levers\nAnd you may find yourself in the cogs of a large resource engine\nAnd you may find yourself with beautiful plans making beautiful points.\nAnd you may ask yourself\nWell...How did I get here?\n\nIt's amazing in how smoothly everything works and avoids the usual euro clunkiness. Very good at what it does. What it does however is being a humongous resource engine. Period. So you're living inside this huge machine, catering to its demands and needs. Interaction, while there is some, isn't as tight as you always have plans B, C, D when plan A fails. While the game ticks many boxes kinda along the way (a little theme, little blocking, little leeching, little narrative) it's just you and the spread sheet machine. And you have to keep it running.\n\nOther first impressions: races felt pretty samey, even if they probably play differently, I found art to be a bit dreadful, the building aspect is neat, but not where the gameplay is (huh?).\n\nThere's too many cubes\nToo many meeples\nMaking too many options\nAnd not much talk to go round\nCan't you see\nThis is a land of confusion.\n\nAfter a few days I've finally came to a conclusion: it's the new breed of perfect euro clockwork machines that all purr and hum happily and give a crap about players. The trick these games pull is throwing sand in player's eyes with so much complexity, giving you so much stuff to do, handle, explore that it totally overwhelms a player and give them an impression there's a lot of going on, when it's mostly just racing your own engine (or rather the engine races you, yay). If you check the game's forums you'll also notice the crazy level of optimisation execution this game brings out of people. Sigh. When did our hobby become playing optimisation puzzles? When did somewhat enjoyable become good enough? It works. So what?. As always: the system works because you work.",
    "timestamp": 1541545200
  },
  {
    "username": "The Professor",
    "rating": 1.0,
    "comment": "Far too frustrating for my taste...everything from the beginning to the end, proved to be a struggle.",
    "timestamp": 1523052000
  },
  {
    "username": "kosterix",
    "rating": 1.0,
    "comment": "Never again.\n\nplayed a few times. Everything feels like a struggle, like work. Getting a citadel getting money, getting anywhere on the board, it takes too long, and i don't like the art work except the character cards. The only interaction is on the board and at getting the bonus cards.\nIf I were forced to play it for a week straight I would perhaps like it in the end. So no.",
    "timestamp": 1521932400
  },
  {
    "username": "caric",
    "rating": 1.0,
    "comment": "It was like doing my taxes.",
    "timestamp": 1494280800
  },
  {
    "username": "Pebble1",
    "rating": 1.0,
    "comment": "einmal gespielt - nie wieder! Dieses Spiel war der Beginn meiner zunehmenden Abneigung gegen überkomplizierte victory-point-salad-Eurogames.\nManche bezeichnen dieses Spiel als episch- das einzig epische an diesem Spiel ist die Spieldauer und das Regelwerk.\nUnter episch stelle ich mir etwas mit Thema vor. Dieses Spiel ist aber völlig abstrakt, da helfen auch auf die einzelnen Spielpläne aufgedruckte \"Rassen\" nichts. Unterm Strich schiebe ich nur Holzwürfel hin und her.\n\nHabe noch nie ein solches Spiel erlebt, bei dem es NICHTS gab, was mir Spass gemacht hätte...mehr Arbeit als Spiel\nnur für Grübler geeignet - oder solche, die anderen gerne beim Grübeln zuschauen",
    "timestamp": 1493244000
  },
  {
    "username": "hengel",
    "rating": 1.0,
    "comment": "Jogo deprimente. Não faz nada além de chupinhar dezenas de coisas de outros jogos.",
    "timestamp": 1488495600
  },
  {
    "username": "Biscotti",
    "rating": 1.0,
    "comment": "Nothing wrong with game. I'm sure its a splendid affair. However after watching run through and or reading reviews, absolutely no desire to play.",
    "timestamp": 1481238000
  },
  {
    "username": "Pro_player",
    "rating": 1.0,
    "comment": "This game is boring and long as hell.\n\nChanged my opinion after 3 plays.\n\nSold !",
    "timestamp": 1452726000
  },
  {
    "username": "gradman2k3",
    "rating": 1.0,
    "comment": "It's called Terra Spreadsheetica for a reason.",
    "timestamp": 1450911600
  },
  {
    "username": "BoardGameNerds",
    "rating": 1.0,
    "comment": "My only criticism of this game is that the theme is non-existent and unlike Descent or Rune bound there is really no story after the game is finished. This game is just about getting VPs. This is pure strategy without a good theme and basically nothing to talk about after the game. Because it lacks theme this is a 3 for me and I'm being generous. Chess has more theme with knights bishops kings queens towers and pawns.\nLess theme than expected and more a optimizing game.\nVery over rated\n\nConclusion: The fantasy stuff is really skin deep. I played this game a few times and appreciate how interesting it might be mechanically and then never want to look at it again.",
    "timestamp": 1449270000
  },
  {
    "username": "BlueSapphire",
    "rating": 1.0,
    "comment": "Feels too much like work to be fun.",
    "timestamp": 1441749600
  },
  {
    "username": "justletmedownload22",
    "rating": 1.0,
    "comment": "Catan has more theme, and makes more sense. This is a bag of unrelated mechanisms. People look at the roles and claim this game has a strong theme. But nothing else in the game makes sense in relation to them. Kingdom builder is this game without all the nonsense. Wear a wizard hat while playing it and you'll get all the fantasy \"theme\" contained here, while placing your houses on hexes.",
    "timestamp": 1441663200
  },
  {
    "username": "yalight",
    "rating": 1.0,
    "comment": "太過複雜：不同種族有不同能力、機制繁雜有太多小細節、回合動作種類繁多等。\n\n不同的種族能力有可能造成遊戲不平衡，地圖的設計對不同的種族間是否公平也有很大的存疑。沒什麼互動感和策略，每場遊戲，每個種族就照固定步驟進行就好，無聊。\n\n玩起來就像是其他外國玩家的評論：像一張試算表(spreadsheet)。\n就是一個多元一次方程式的線性規劃問題，用電腦跑就好，有點枯燥。\n\n看起來很複雜，其實沒什麼變化性，每場遊戲都照重複步驟進行即可得到不錯的分數！無腦的遊戲，不知道排名為何衝這麼高？頗瞎。\n\n主題也無法融入遊戲中，完全感受不出魔法迷幻氛圍，比較像\"房屋連連看\"的遊戲。和魔幻有關的只是種族的人物和法力，但是這兩項也可輕易的抽換成一般的人和能力屬性，看不出獨特性和專一性。\n\n米寶和美術設計也不吸引我，不喜歡這款遊戲。",
    "timestamp": 1434405600
  },
  {
    "username": "mxke",
    "rating": 1.0,
    "comment": "For an exhaustingly long game with far too many unrelated options that only exist to produce analysis paralysis while instilling absolutely NO theme, I couldn't hate this game more.",
    "timestamp": 1414188000
  },
  {
    "username": "Belleke",
    "rating": 1.0,
    "comment": "Probably a very good game, but just not my type of game.",
    "timestamp": 1409263200
  },
  {
    "username": "Hoss Cartwright",
    "rating": 1.0,
    "comment": "Only good for holding doors open or fire wood.",
    "timestamp": 1407276000
  },
  {
    "username": "CorneliusTacitus",
    "rating": 1.0,
    "comment": "what boring garbage",
    "timestamp": 1389999600
  },
  {
    "username": "dreamer1789",
    "rating": 2.0,
    "comment": "Never want to play again. Just not fun, imo.",
    "timestamp": 1756072800
  },
  {
    "username": "GarfieldKlon",
    "rating": 2.0,
    "comment": "Too euro for my taste. Zero theme.",
    "timestamp": 1733698800
  },
  {
    "username": "ManEatingHippo",
    "rating": 2.0,
    "comment": "This is just a puzzle game.. Learn the puzzle. Win the game. Boring.",
    "timestamp": 1733266800
  },
  {
    "username": "Iron_Salamander",
    "rating": 2.0,
    "comment": "I gave this a 2 instead of a 1 because its a gorgeous game and has some interesting ideas but why this is so highly rated is beyond me. The theme is pasted on to put it mildly, the player interaction is virtually nil, and the point salad aspect makes it a dull experience that is best avoided.\n\nThe funniest part of all this is that I wasn't even the one who disliked this monstrosity the most! One player was so bored with this thing that he was playing Ascension on his phone during one of our games of this snoozefest.",
    "timestamp": 1701990000
  },
  {
    "username": "Peter Loftus",
    "rating": 2.0,
    "comment": "Not a bad game - some fairly simple mechanics to grasp but so many different strategic choices to make.\n\nOn the down side - it is possible to make mistakes early on that can completely remove you from the running even thought you have another hour's gameplay left. It is very easy to run low on power/priests/workers and find your options severely limited.\n\nSome of the races are very hard to get the best out of too. Not as balanced as they first appear no matter what all those 'experts' who have played 100 games claim.\n\nI also think I'd prefer less ways to score but more complex interaction between the various elements.\n\nIt isn't very combative either - there isn't a whole lot you can really do to mess with other players if they know what they are about.\n\nHousekeeping and adding of scores is messy too.",
    "timestamp": 1665957600
  },
  {
    "username": "WilcoxDave",
    "rating": 2.0,
    "comment": "This game is a bit boring for me. It has too much feel of a solo game. It takes too long to play for a busy game. Every time I play I like it less.",
    "timestamp": 1659391200
  },
  {
    "username": "Volodymyr_Bilodid",
    "rating": 2.0,
    "comment": "Too complicated.",
    "timestamp": 1657576800
  },
  {
    "username": "cardbored",
    "rating": 2.0,
    "comment": "Hate the theme.",
    "timestamp": 1650837600
  },
  {
    "username": "ThroughTheDeckGlass",
    "rating": 2.0,
    "comment": "Worker placement & engine builder. Not beginner friendly. Long downtime between turns. Did not like.",
    "timestamp": 1631916000
  },
  {
    "username": "Jarikv9",
    "rating": 2.0,
    "comment": "unowned",
    "timestamp": 1620079200
  },
  {
    "username": "tasskaff",
    "rating": 2.0,
    "comment": "Just nope",
    "timestamp": 1618178400
  },
  {
    "username": "Colour wolf",
    "rating": 2.0,
    "comment": "The unnatural product of an elf and a spreadsheet. Extra horrible at two.",
    "timestamp": 1590357600
  },
  {
    "username": "Jdcnl",
    "rating": 2.0,
    "comment": "I remember playing this game for the first time. It was the first real game I hated after starting to play board games more frequent. Terra Mystica had great pieces and the board looked so pretty.\n\nAfter a long explanation we finally started the game. Then the game quickly devolved into something so horrible that I still have nightmares about that experience. It felt like I was stuck on a deserted island solving a puzzle that I just couldn't comprehend. Then I realized it wasn't a nightmare, I was just playing Terra Mystica.\n\nMore interaction between players would have helped I guess...",
    "timestamp": 1573945200
  },
  {
    "username": "dogzard",
    "rating": 2.0,
    "comment": "I had heard a lot of hype on BGG about how great this was. At least for me, I learned a lesson about ignoring the hype. It's not a really bad game, but there's just too much going on for me. Too \"fiddley\", to many decisions to make, too \"busy\" - I don't know how to put it. Plus, none of the decisions made sense in a game way - not intuitive at all. I just couldn't follow what was going on very well. It overwhelmed me, and not in a good way. My best friend feels the same way. He came in 2nd place the one time we played, and he didn't understand how he did it. I don't think I'll ever play it again. OK, maybe if I was on a desert island and the game washed up on shore... Nah, I'd use it to start a fire! Not a lot of fun.\n\nI recently tried an online version of this game. It still sucks.",
    "timestamp": 1573858800
  },
  {
    "username": "Staver",
    "rating": 2.0,
    "comment": "I was really looking forward to this game, but it was surprisingly bleh. This is such a mediocre game and the art work is so bad, I just have zero interest in playing it again.",
    "timestamp": 1565301600
  },
  {
    "username": "Wyckyd",
    "rating": 2.0,
    "comment": "Some very nice ideas, but the felt too disjointed. More plays might prove me wrong, but right now, I am not very inclined to play this again.",
    "timestamp": 1545001200
  },
  {
    "username": "pozz70",
    "rating": 2.0,
    "comment": "I've had more fun at the dentist, really I have, boring puzzle game.",
    "timestamp": 1523916000
  },
  {
    "username": "daironne",
    "rating": 2.0,
    "comment": "Set of dry gears, a game without soul. I prefer to solve mathematical expressions",
    "timestamp": 1523829600
  },
  {
    "username": "ruppt",
    "rating": 2.0,
    "comment": "Just not my type of game. Hate this game. Can't even imagine how this game is rated so high. I can see some liking it but not this many.",
    "timestamp": 1514502000
  },
  {
    "username": "iiaen",
    "rating": 2.0,
    "comment": "If you love terraforming land in the most complicating way possible, then this games for you.",
    "timestamp": 1504562400
  },
  {
    "username": "neuroblaster500",
    "rating": 2.0,
    "comment": "Really hate this game. Fiddly, convoluted, low player interaction. Boring.",
    "timestamp": 1503957600
  },
  {
    "username": "Peepser",
    "rating": 2.0,
    "comment": "After years of hype, what a disappointment. Feels like something developed in 1998, that has long since been superceded by better designs. Found nothing here that was exciting. Races were not easy to follow or learn, nor were they balanced. Tedious choices. Many aspects of this game done much better in other games. Reminded me of a much more convoluted, and much less fun, 'Kingdom builder'. Luckily, I only wasted $15 on the app, and not the actual game.",
    "timestamp": 1495317600
  },
  {
    "username": "rules_heretic",
    "rating": 2.0,
    "comment": "Kind of draggy.",
    "timestamp": 1494021600
  },
  {
    "username": "Alyiz",
    "rating": 2.0,
    "comment": "It took me a long time to come up with what I wanted to say for this game because it seems like a lot of effort went into the game and I want to get this review right.\n\nThe problem is, there's a lot of work going into the exact wrong places in this game. For example:\n• The theme is the biggest lie ever. \"But who cares?\" you say. The designers. They care. Look how much effort they put into writing fictional stories set in this clearly bogus world so you'd think there's theme in the game. That's clearly a case of trying really hard and failing.\n• The currency. This game has like 4 currencies and the entire gameplay consists of trying to efficiently convert them. That's it.\n• The terraforming. Which ultimately, while it does have impact in the game, is something you actively want to avoid if possible because it costs too much. But TERRA mystica is the name of the goddamn game! You're clearly intended to terraform as one of the major aspects of this game and yet it's so cost-prohibitive that you will only ever do it as a last resort.\n• Which leads into the upgrades system. Again, this system just fucks you as you upgrade your buildings. Why? Because they wanted you to have an interesting system where things slow down a bit as you move up. Unfortunately, this just chokes your resources and actions so hard that it removes all fun from the game.\n• The scoring. This game is straight up point salad in the worst ways possible. The priest track is the most egregious offender but I've found that new players (including myself) get the most screwed by aiming for those early bonus VP. If you do, they almost invariably stop you from having actions for 3 rounds. THAT'S HALF THE FUCKING GAME.\n• Trying to hard to be chess. It's not. It never will be. Stop trying. Chess has symmetry. I personally think chess sucks but even I can tell that Terra Mystica needs to get off its arrogant high-horse with a lot of the stuffy mechanics they jammed into here.\n• The awful mana pool system. It's actually BETTER to remove as many as possible, despite the game directly warning you against this. It's disgusting and if you're new and see someone win because they can spam their magic super fast, you're going to flip the fucking table.\n\nThings they didn't work hard enough on:\n• The art. This game is droll and boring. Nothing is interesting to look at and the insane number of abstract symbols breeds confusion like bacteria.\n• The fucking DOWNTIME. This game is only downtime. I had an idiot fanboy try to sell me on the idea that the literal 20 minutes of downtime pre-game SETUP is just \"front-loaded strategy\". It's not. It's 20 minutes of downtime where you painstakingly calculate. Which leads to...\n• The most important 80% of decision-making is done BEFORE the game starts. I'm not shitting you. The single most important decision by a landslide is where you place your opening towns. If you want proof, just google Terra Mystica strategies. And the second part of 80% of your entire decision making for the whole game is...\n• What clan you choose determines if you'll win or not. There's an entire ranking list of the clans with one that's a clear top winner, basically guaranteeing you win since the game is DETERMINISTIC after setup. Which leads to an even bigger problem...\n• The game is deterministic after setup. Look, I don't like randomness either but when I can sit there and look at everyone's board and just literally calculate like a fucking computer the best possible moves for the entire game, FUCK YOU for designing it. And by \"I\" I really mean the actual real Terra Mystica AI that you can google right now that will always win because it can out-compute you. I guess I was wrong, this really is like chess in that regard.\n\nIn summary:\nBoring, with no life. Stagnant. Doesn't make you want to play ever again. Counter-intuitive gameplay that directly contradicts the rules suggestions. Criminally unbalanced factions. 80% of the game is downtime and setup decisions. Any human ingenuity will always be overcome by pure memory and calculator power. Literally inhuman experience to play. Choked decision-making. A single misplay renders the entire game fucked for you forever, with no ability to recover in any capacity. Fake theme. Fake game. Fuck you.",
    "timestamp": 1492639200
  },
  {
    "username": "Zalco",
    "rating": 2.0,
    "comment": "Yet, another step on the mission to efficiently turn Actions Points into a vast amount of Victory Points in increasly complex ways.",
    "timestamp": 1488841200
  },
  {
    "username": "CowStriker",
    "rating": 2.0,
    "comment": "This game was boring and so terribly euro and was just plain not fun to play. I won't go near this one again and I rate it down there with Agricola and 7 wonders. I should have gone with my gut feeling not to play based on the back of the box alone.",
    "timestamp": 1477346400
  },
  {
    "username": "byll",
    "rating": 2.0,
    "comment": "22 mechanics in search of a theme",
    "timestamp": 1458255600
  },
  {
    "username": "143245",
    "rating": 2.0,
    "comment": "I understand and appreciate that a lot of time and energy went into the design, there are just some aspects of the game that are crippling *to me*. I find that the critical nature of my decisions are decreasing as the game wears on to the point that after the first round is over, I'm already past the half-way point on that decline. What faction you pick, and where you start your settlements will have a bigger effect on your success rate than any other factor in our experience (related to how likely it is that someone can effectively steal a spot from you, how effectively you can expand and exploit your faction's specialty, etc). This goes hand in hand with the static setup of the board, so the variable powers have favored setup locations and strategy already defined for them during that critical decision making period. As such, there are only a few spots that are of particular value for each faction, and outside of that, it's not worth it. So the net effect here is that all of my super important choices occur before the first turn, and as the game progresses, each choice I make is less likely to create any serious swing or effect on the end game, to the point where the final 2 rounds are largely auto-pilot in terms of game play.\n\nSecond, I find that I have 8 or 10 choices each turn, but really only 1 or 2 of those will do anything other than cause a backslide (similar to the opening setup choices), so I don't spend my time debating choices so much as taking the obvious choice and planning multiple turns of obvious choices in advance. It's a very tight game in that regard where the potential to \"catch up\" or make breakthroughs to put pressure on opponents in the second half of the game just doesn't exist. I like wide choices where no one choice sinks you and they are largely opportunistic in their timing and accordance with your strategy. Terra Mystica seems to favor a \"deep\" approach where you don't have as many choices, but you plan for multiple turns in concert.\n\nLast, it takes about four times as long to play a 4p game as I'm realistically interested in investing in said design. A large reason for this is that the late game decisions are all sort of meh. I actually enjoy the game when I can bang out a session online on lodev in 30 minutes.\n\nIt's not a bad game, it's just not a game for me. My 7 plays in person (3-4p) and 10+ on lodev have helped me learn my preferences in games, so it's not time wasted, but I won't play it again.",
    "timestamp": 1454022000
  },
  {
    "username": "Soya Kyou",
    "rating": 2.0,
    "comment": "Complex, long, dull & boring piece of crap...",
    "timestamp": 1452380400
  },
  {
    "username": "crustierpie",
    "rating": 2.0,
    "comment": "Low interaction, almost no theme, overwrought with every mechanic and no overall coherence of design. Races aren't balanced and the game feels like multi variable algebra problem rather than a game.",
    "timestamp": 1444946400
  },
  {
    "username": "ratpfink",
    "rating": 2.0,
    "comment": "Probably the most annoying game ever.",
    "timestamp": 1444860000
  },
  {
    "username": "passionisdead",
    "rating": 2.0,
    "comment": "i hate deees",
    "timestamp": 1420930800
  },
  {
    "username": "Gwain",
    "rating": 3.0,
    "comment": "I Absolutely despise Terra Mystica, it's just not a game for me, it is forgiven for being an old design with years on its shoulders and while better implementations have come forward this is categorically the only game I'll straight up refuse to play with anyone for any reason.",
    "timestamp": 1761343200
  },
  {
    "username": "dakotamassie",
    "rating": 3.0,
    "comment": "And yet another overrated game in the bgg top 100\nI honestly don't get why people like bad games",
    "timestamp": 1761343200
  },
  {
    "username": "bobhope1999",
    "rating": 3.0,
    "comment": "I like the concept of it more than I like it. Too complex for its own good. Often end frustrated.",
    "timestamp": 1745704800
  },
  {
    "username": "Betote",
    "rating": 3.0,
    "comment": "Not as bad as I thought it would be. Still an Excel spreadsheet, but an enjoyable one nevertheless. Just don't expect to find any way of player interaction or theme.",
    "timestamp": 1740006000
  },
  {
    "username": "Oninohugo",
    "rating": 3.0,
    "comment": "Disconnected mechanics, adventitious player interaction, serious turn-order and balance issues.",
    "timestamp": 1737414000
  },
  {
    "username": "tectactoe",
    "rating": 3.0,
    "comment": "Truly a brilliant game and brilliant design that, over the years, has fallen victim to over-analyzation. What this means is that people have discovered that when X-faction is in a game with Y-faction and Z-faction, then the best and most optimal opening move(s) are A, B, and C. This can be affected by which end-of-round bonuses are available and which passing tiles are in the game, but all that does is introduce another large set of calculated openings. And, as such, it can feel awkwardly procedural during the first round (or two), unless you don't know what the optimal set of moves are for your particular match-up, in which case you'll get piledriven by more seasoned opponents. Having said all that, however, the fundamental system is a phenomenal one. These days, though, I prefer AGE OF INNOVATION (or even GAIA PROJECT).",
    "timestamp": 1735081200
  },
  {
    "username": "KevinNoBacon",
    "rating": 3.0,
    "comment": "way too complicated",
    "timestamp": 1713650400
  },
  {
    "username": "nishikawa-collector",
    "rating": 3.0,
    "comment": "Ok after 7 plays and wanting to like the game, I am bringing my initial 7 rating down to a 3 as I really do not enjoy this game….just boring…..the parts don’t meld together i to a cohesive whole.",
    "timestamp": 1706050800
  },
  {
    "username": "Laurentiu",
    "rating": 3.0,
    "comment": "A good example of an artificial VP earning optimization game.",
    "timestamp": 1699830000
  },
  {
    "username": "More10",
    "rating": 3.0,
    "comment": "2/6",
    "timestamp": 1699311600
  },
  {
    "username": "HalloSchwester",
    "rating": 2.5,
    "comment": "The game is not necessarily bad, but it's not unlikely that one player gets cutoff fairly quickly and then watches how the other players fight for victory for a few hours. I'd recommend Gaia Project instead.",
    "timestamp": 1676674800
  },
  {
    "username": "sunyushen",
    "rating": 3.0,
    "comment": "无随机性是一种美感，但是也会给人很大压力。高手看了特权片和回合加分片就知道抢哪个种族，我根本做不到。稀里糊涂的玩，稀里糊涂的输，有什么意思？",
    "timestamp": 1662242400
  },
  {
    "username": "ubRtstcl",
    "rating": 3.0,
    "comment": "Not the most interesting euro. Quite a dry point grab.. Many games feel quite similar with the only differences being which building you build in later rounds, and which tiles you expand to, the later difference being mostly irrelevant.",
    "timestamp": 1660687200
  },
  {
    "username": "Mayasty",
    "rating": 3.0,
    "comment": "My comment for \"Gaia Project\", which is a sibling game to that one can be literally applied here. But my rate here is a bit better mainly due to this game resemblance in many elements and mechanisms to my beloved euro \"Clans of Caledonia\". Many, many elements are organized in the same or very similar way (settlements, sailing, production on player board game etc.) But the \"Clans of Caledonia\" is far more elegant, intuitive, easy explained and compact with the brain challange on the same level. So why to bother with \"Terra Mystica\" with much higher entry barrier and longer playtime with no additional value and fun?",
    "timestamp": 1659650400
  },
  {
    "username": "hiimeroro",
    "rating": 3.0,
    "comment": "大地秘境，一看地图就能发现了，是一个强化版的卡坦岛。区别是不用扔骰子拿资源，而是用房子占土地，比谁建成的房子集群多。这个游戏集合了很多功能，右上那个就是整合了波多黎各里面拿身份的功能，然后还可以通过在另一个版图修建神庙得分。最后好多项一起算总和。",
    "timestamp": 1656540000
  },
  {
    "username": "marcuslind1",
    "rating": 3.0,
    "comment": "If you think that Scythe is too nice, too random and has silly combat elements and not enough assymetric factions, then give Terra Mystica a try. If you want a cleaner and quicker game than TM, less puzzly and without the need to memorize and optimize how different factions play, then get Hansa Teutonica instead. Like Scythe, TM can suffer from scripted faction plays and faction balance issues due to massive online play optimization.",
    "timestamp": 1654120800
  },
  {
    "username": "Rhimens",
    "rating": 3.0,
    "comment": "I really do not like the dependency chain of resources this game requires. It is far too easy to get locked out of the game on simple mistakes.",
    "timestamp": 1648249200
  },
  {
    "username": "z25648911",
    "rating": 3.0,
    "comment": "其實沒什麼大缺點，但跟蓋亞比起來就是相形見絀",
    "timestamp": 1644188400
  },
  {
    "username": "icheyne",
    "rating": 3.0,
    "comment": "8 games at boardgamearena.com\nHighly complicated abstract game. Almost no luck. Little player interaction. Like chess, you have to look ahead several moves and there are standard openings.\nGood for what it is, but not my thing at all.",
    "timestamp": 1642978800
  },
  {
    "username": "fenpaints",
    "rating": 3.0,
    "comment": "The only thing Terra Mystica did for me was make me feel Mystical Terror.",
    "timestamp": 1642546800
  },
  {
    "username": "omnitheus",
    "rating": 3.0,
    "comment": "I do not enjoy games that forces players to play only one way through optimisation to win. I enjoy creative freedom. This certainly determines how a player must play. No creative freedom... 7 plays as I thought I was the one with the problem.",
    "timestamp": 1639263600
  },
  {
    "username": "Bobekistan",
    "rating": 3.0,
    "comment": "I think at this point I can safely say this game is not for me. Let's get to some details:\n\n1) I find the board state dysfunctional to say the least, both the player board and the main board look like skittles vomit and I find it both annoying in terms of tracking information and reading how well/badly I'm doing.\n2) 3 bowls feel like a huge waste of time in an attempt to create an extra layer of complexity for minimum payoff. I get that good players know how to use these and they formulate a specific strategy. However, it feels like there should be a way to make that mechanism work in a less annoying way.\n3) Near the end of the game players kind of just AP calculate themselves and their last needed points, propelling me into boredom.\n4) Player power choices seem kind of obvious half the time\n5) Theme isn't so much missing as lost in the minutia. Game can't make up its mind if it actually wants me there or not.\n6) Very much dislike the cult tracks because they feel like someone just bolted on a piece of plywood to the side of a space shuttle.",
    "timestamp": 1635807600
  },
  {
    "username": "FrederickKim",
    "rating": 3.0,
    "comment": "Poor faction balance, resource balance, low strategy diversity, and low replayability(fixed map and religion track). Gaia Project(Sequal of this game) is far better than this game.",
    "timestamp": 1635285600
  },
  {
    "username": "sbsimp1",
    "rating": 3.0,
    "comment": "NK2",
    "timestamp": 1618956000
  },
  {
    "username": "Rontuaru",
    "rating": 3.0,
    "comment": "Analyzing the game-state to gain a decisive understanding of the impact of my actions is \"more cumbersome than exciting,\" and \"the effort to reward ratio is too large.\"\n\nThank you, BGG user 'imaginarypet', who coined the above phrasing which perfectly encapsulates my feelings about this game, saving me some writing time (though my comments on its progeny, Gaia Project, largely apply here too).\n\nI'm not interested in ever revisiting this. Two plays across two sister games (and seeing the evolution of the design) is more than enough to know it's not for me.",
    "timestamp": 1618869600
  },
  {
    "username": "jwarrend",
    "rating": 3.0,
    "comment": "Update: Downgraded after more plays. I just don't like this game. It does indeed get easier with more plays, but it's not really more fun once you understand it. It has the same problem as Scythe, you can basically calculate all your remaining turns for the round, but maybe once or twice per game, someone will do something that messes your plan up. You can't tell when it might happen, you can't entirely guard against it, but it causes a real setback when it does.\n\nBut on the opposite end, you have very little ability to interfere directly with your opponents. If your opponent is contending with you for biggest connected area, and you're three spaces away on the landscape wheel, well, you aren't really going to pay 9 workers to terraform one of his/her territories out from under him. There's little intentional blocking or disruption.\n\nI just think that for all its complexity, which is considerable, the game isn't any fun to play. Most of the time playing with friends, we talk about politics or the weather or our kids, almost never about the game, because there just isn't anything in-game that's worth talking about.\n\n_______________________________\n\n\nI'm early into explorations of this one, but I must say this is an excellent example of how needlessly complicated Euro games have become. This is a weird hybrid of an option-salad and a straitjacket. With only six rounds and an engine that turns on rather slowly, there's not very much that actually happens over the course of the game. The game appears to give you a zillion different ways to make your points, but nearly every one requires some combination of workers and coins, and maybe a priest, and maybe you have to burn some power, so really it's not as flexible as it seems. There's really no such thing as a “worker engine” or “coin engine”, one without the other isn't too useful. And that being the case, it's really questionable whether the game strictly needs the variety of bonus cards, power actions, favor tiles, town effects, round end bonuses...there are so many different things that you /can/ do that it's hard to even begin to think about what you /want/ to do, hard to figure out which of the 10 (or whatever) town bonuses is just the right one, and so on. The idea of power that builds up slowly is cute but it's really out of place in a game of this complexity. As the core mechanic of a game where timing your actions requires striking the right balance between patience and decisiveness, ok, it would work well, but here it's just one more thing to think about and not an interesting thing.\n\nUltimately, the actual stuff that happens in the game – flipping tiles, placing buildings on them – really just doesn't fire the imagination. It's not clear what the theme of the game is, but the central action of the game isn't really expressive of any particular idea, it's just a whole lot of ways-and-means to do the stuff on the board that the game is telling you you need to do.\n\nI think a couple of the systems of the game could have been cobbled together into a very nice little game of the classic German school. With the whimsical setting, you could see how the power mechanic and the terraforming mechanic, and /nothing else/, could have given us a game like Elfenland or Goldland in scope: simple, tense, a turf war with some timing problems. What we actually got is a bloated jumble of mechanisms, icons, rules, ideas, none of which hang together, none of which are intuitive, and none of which are especially purposive.\n\nI think the game will get easier with repeat plays but I just can't help feeling that skill will mean a better ability to solve the puzzle, and much less so an ability to use the platform the game provides to contend with my opponents for the victory.",
    "timestamp": 1618696800
  },
  {
    "username": "musicalanarchy",
    "rating": 3.0,
    "comment": "The game is a pretty typical dry euro, which generally aren't for me. Concepts are easy to grasp, but there are a lot of options which can lead to AP or just make it so you aren't sure which route to take for the best points. You can also have some players pass really early and have nothing to do for quite a while... which isn't great.",
    "timestamp": 1612825200
  },
  {
    "username": "imaginarypet",
    "rating": 3.0,
    "comment": "A game that is largely about strategically efficiency, with many tactical choices but one that I'm not so sure I'm interested in anymore.\n\nFor a long time I couldn't figure out why I don't care for this game anymore. It's a game that would require me to be really good at this game and doing the basic math to make sure I have the resources to hit my goal. But I'm not interested in getting better at this game. The effort to reward ratio is too large.\n\nThe way my actions affect my opponents (and vice-versa) needs to go through a large function before I'm able to see it's results which makes analyzing my choices and theirs cumbersome rather than exciting.",
    "timestamp": 1612393200
  },
  {
    "username": "gamerdoge",
    "rating": 3.0,
    "comment": "Typical Euro game. Nothing special.",
    "timestamp": 1608937200
  },
  {
    "username": "Zernazul",
    "rating": 3.0,
    "comment": "M",
    "timestamp": 1606172400
  },
  {
    "username": "cfarrell",
    "rating": 3.0,
    "comment": "There is fun to be had Terra Mystica, certainly. But to me, it's a classic overdesigned, mechanics-centric euro - not a good thing. For all the ridiculous and unwarranted flak he takes, Knizia's games are both mechanically elegant and are (usually) thematically coherent and have both intellectual and emotional hooks. Terra Mystica is a pretty dry, incoherent mess of interlocking mechanics that gives you little to get invested in. It also lacks anything in ongoing player interaction; there are usually just a couple points of entirely predictable high-stakes conflicts early but it in the main is much more of a multiplayer solitaire tableau-builder than the positioning/placement game it superficially resembles. I think solitaire-y tabeleau-builders can work (Terraforming Mars is decent) but it's a really hard problem; without the energy of at least a little competition (whether it's the inter-player competition of Power Grid, cooperative competition with a game system like Lord of the Rings or Pandemic, or a mix of the two like Greenland), games have to work really hard to maintain engagement. Terra Mystica doesn't manage it.\n\nThe lack of any kind of ingame randomization is also a huge problem. With everything about the game state known before turn 1, it really does inflict a brutal level of look-ahead type analysis - to the point of requiring you to plot out your first 3 turns, half the game, before you even claim a faction if you want to be competitive.\n\nOn the flip side, I did find all the different factions entertaining to explore, in a solitaire-y kind of way (which faction you pick is a big deal for you personally, but they don't seem to produce interesting interactions which is kind of surprising). This is definitely not nothing, and it was enough for me to enjoy the game for about half-a-dozen plays. But for me, once I got through the exploratory phase, there wasn't enough left to keep me going.\n\nThere are a number of games that for me are sort of in this design space and which I find much superior: 504, Taj Mahal, Ginkopolks, Through the Desert, El Capitain (all 10-rated games for me). They're all fairly different from Terra Mystica mechanically, but they capture some key element or elements in a far more elegant, higher-octane package. 504 has the truly almost infinite diversity and sense of designing a strategy before turn 0 based on a unique landscape; Taj Mahal has the combination of long-term planning based on a known series of events and a placement game; Ginkopolis and Through the Desert have the interesting space competition that involves tight maneuvering against your neighbors, with Ginkopolis throwing in tableau-building; and El Capitain really captures an interesting sense of coopitition as two players competing to exploit a market make it worth more for both in the short term, until the market gets played out. Terra Mystica doesn't really manage to do any of these things all that well, so I'd much rather play a game that does one or a couple things extremely well than a game that tries to do too much and doesn't really manage it.",
    "timestamp": 1604530800
  },
  {
    "username": "the bilge rat",
    "rating": 3.0,
    "comment": "faction selection: the game",
    "timestamp": 1602367200
  },
  {
    "username": "logopolys",
    "rating": 4.0,
    "comment": "Sometimes a game requires some work to play that game. Other times the game is entirely work. Terra Mystica is work. It's gone full-throttle into the scarce resource, need-to-do-more-than-have-actions genre, mixed it with fourteen distinct factions, and then tacked on a 2-3 hour play-time. Now there are many games that do a few of these things. Many of them are good old German-designed Euros, but those games tend to be in the 45-75 minute range, not the 2-3 hour range. If I'm playing a game for 2+ hours, I want it to be an epic, chaotic, deep AT title. I don't want to play a puzzle for 2+ hours. Terra Mystica is elegant, but not for me.",
    "timestamp": 1759356000
  },
  {
    "username": "Beefy79",
    "rating": 4.0,
    "comment": "Played Mike's Copy",
    "timestamp": 1758146400
  },
  {
    "username": "Wolcik",
    "rating": 4.0,
    "comment": "Digital version available (PC, Android and BGA Premium)",
    "timestamp": 1757973600
  },
  {
    "username": "Weirdsalmon",
    "rating": 4.0,
    "comment": "4/10: Terra mystica is simply too boring and too tight for me.I don’t find that I make any moves in this game that are fun or clever. My choices never seem fun but feel mean at best, in a way I didn’t expect from this game.\n\nThe theming is really nonexistent here and It’s very chess like. I can see why people like it, it’s Not a bad game just not for me.",
    "timestamp": 1751925600
  },
  {
    "username": "selvalabelva",
    "rating": 4.0,
    "comment": "Brainburn         Longevity    \nLuck impact       Rules/Setup  \nInteraction       Involvement  \n\nAftertaste           Enthusiasm   \n\n Played at 4 player count only\n Rated base game w/o additional modules\n\n Dry experience given the length",
    "timestamp": 1751320800
  },
  {
    "username": "The_Philosophers_Die",
    "rating": 4.0,
    "comment": "Multiplayer solitaire - and quite a long one for that...",
    "timestamp": 1751234400
  },
  {
    "username": "Magneton",
    "rating": 4.0,
    "comment": "pomysł jest dobry, ale sama gra w ogóle mnie nie zachwyciła, a tor many to jest bardziej, żeby gracza wkurwić niż cokolwiek innego",
    "timestamp": 1741734000
  },
  {
    "username": "LilRed",
    "rating": 4.0,
    "comment": "Horrible game, jamming boring mechanics together with a theme as thin as wallpaper.",
    "timestamp": 1740351600
  },
  {
    "username": "Beastly_Venturer",
    "rating": 4.0,
    "comment": "8 plays. Clans is my go to if I want this kind of experience. Much better implementation. Bit clunky too.",
    "timestamp": 1740265200
  },
  {
    "username": "themikeman",
    "rating": 4.0,
    "comment": "BGA: I felt slightly annoyed that it took so much effort to learn this game, and in the end it essentially boiled down to placement denial. Yes, I know there's huge amounts of depth to this game and with experienced players it can be a chess-like experience. But for me, I'd rather play chess.",
    "timestamp": 1736550000
  },
  {
    "username": "Joel_L",
    "rating": 4.0,
    "comment": "2024-12-19: Reduced to 4. There's a good game in there for those with the patience to master it, but I don't want to play this ever again.\n\n2020-04-19: Reduced from 8 to 6. I find the interactions tedious and the pace slow. I also don't enjoy the spatial gameplay of the hex grid.",
    "timestamp": 1734562800
  },
  {
    "username": "Jedita",
    "rating": 4.0,
    "comment": "BGA",
    "timestamp": 1734044400
  },
  {
    "username": "Lowengrin",
    "rating": 4.0,
    "comment": "Meh. While on paper, Terra Mystica appears to be my style of Euro, it's far too abstract for me. I did appreciate how building/upgrading next to an opponent could give bonuses to both. And I liked how each race had different abilities. But not enough to seek out more plays. Superseded by Clans of Caledonia.",
    "timestamp": 1728770400
  },
  {
    "username": "smurfodeth",
    "rating": 4.0,
    "comment": "All the rules: the game. System mastery doesn’t interest me as a design goal, but there are interesting ideas under all the moving parts.",
    "timestamp": 1718920800
  },
  {
    "username": "yangtze2000",
    "rating": 4.0,
    "comment": "A great game, but more stress than Agricola! Rated 7 initially.\n\nEdit: fell out of love with this. Not sure why. Words like bland and boring come to mind. Just wouldn't seek to play again. Now rated 4.",
    "timestamp": 1717624800
  },
  {
    "username": "Golden Aegis",
    "rating": 4.0,
    "comment": "I do respect this game for what it can do, just isn't one for me or my group.",
    "timestamp": 1717279200
  },
  {
    "username": "Animepops",
    "rating": 4.0,
    "comment": "There are some games I just don't understand the hype. Well, to be fair, there are some games I just plain don't understand. I plan to try it a time or two more, but this game just feels like you only have one valid choice each turn to make and the game just takes you for a ride, which I find kind of boring. (rating based on digital play only)",
    "timestamp": 1712181600
  },
  {
    "username": "TheBiggestCheeseBall",
    "rating": 4.0,
    "comment": "I personally think this game is overhyped... played several rounds and I found it to be a bit of a slog, it's trying to do too many things at once but none of it was notable.",
    "timestamp": 1706742000
  },
  {
    "username": "stowfords",
    "rating": 4.0,
    "comment": "Play a second time before coming to a conclussion.\nFantastically clever and interesting game",
    "timestamp": 1704668400
  },
  {
    "username": "Cazzmataz",
    "rating": 4.0,
    "comment": "",
    "timestamp": 1695679200
  },
  {
    "username": "astomps",
    "rating": 4.0,
    "comment": "soul sucking",
    "timestamp": 1676502000
  },
  {
    "username": "Timaoh",
    "rating": 4.0,
    "comment": "Game is sloooow takes to long to accomplish anything and is not balanced for casual play.",
    "timestamp": 1674169200
  },
  {
    "username": "johnclark",
    "rating": 4.0,
    "comment": "Very solid Euro. Not exciting but interesting enough to happily come back to again. If you like your euro games then you should like this. No great complaints except that the whole 'priest' tracks are really lame - its as if the developer decided that the game did not have enough 'agonising decisions' or 'multiple paths to victory' and so added these tracks which serve no real purpose. Not too heavy but it is a little long. Its a good design, well developed. In fact, perhaps too well developed? That's a weird thing to say, but sometimes little quirky things in games really make the difference. This one really has had all the wrinkles ironed out. Some would say its had its soul ironed out, but that is too strong. It reminds me a lot of a combination of Eclipse and Kingdom Builder, but that may just be the graphic design.\nUpdate: downtime is horrific. Just boredom for three hours. The priest tracks are really lame design. This is much more puzzle than game.",
    "timestamp": 1673478000
  },
  {
    "username": "Vroenis",
    "rating": 4.0,
    "comment": "As much as I enjoy and admire everything going on in Terra Mystica, once on the top of my top 10, for me now it's way too long and not interesting enough for its play-length. Too much happens in small steps which stay small for too much of the game. I prefer swift games with greatly increased pressure and dramatically reduced time.\n\nI feel that once I've seen the mechanisms of TM play out, it's fairly boring to cycle it again and again and nothing surprises me, neither a single move nor an endgame result.",
    "timestamp": 1670022000
  },
  {
    "username": "Guntower_Mike",
    "rating": 4.0,
    "comment": "Too Euro for me",
    "timestamp": 1660255200
  },
  {
    "username": "Lawrence Hung",
    "rating": 4.0,
    "comment": "Z-man edition available in April 2013. It must be good after two years from its release, the game still goes strong and stays at second of both strategy and board game overall. 2016: It stays at overall and strategy game rank 4th. Too much of a hype of this game brings too much of an expectation. The letdown was quite significant after play. You collect the income, taking an action (out of the possible eight), calculating cult bonuses and cleaning up the turn by returning the tokens, adding one coin to the bonus cards (sweetening them for players to pick them up), and mark the turn by turning the current scoring tile on the turn track. The \"special\" actions available to each different tribe (or faction as the game calls it) don't color them up enough. Unlike the unique capabilities of the tribes in Small World which bring much of the tidbits I still recalled today, the special actions in Terra Mystica are related to how the tribe can manipulate the \"terra\", the lands in the game. And that, while very much sticking to the theme of the title, was perhaps the weakest design link in my opinion. Overall: C",
    "timestamp": 1660255200
  },
  {
    "username": "Eldard",
    "rating": 4.0,
    "comment": "Haven't played my copy. Played it once before getting it and found it rather difficult to absorb. Fellow gamers seemed to think similarly. I haven't seen it played since about 2014.",
    "timestamp": 1659909600
  },
  {
    "username": "Fd12",
    "rating": 4.0,
    "comment": "own digitally",
    "timestamp": 1659650400
  },
  {
    "username": "Megitt",
    "rating": 4.0,
    "comment": "High hopes for terraforming, but the game is over before you have time to utilise the mecahanic enough to feel you have made an impact.",
    "timestamp": 1659564000
  },
  {
    "username": "JasonSaastad",
    "rating": 4.0,
    "comment": "prolonged playtime\n incidentally interactive\n Rube Goldberg game\n\nThe power-bowls are just tediously gamey, and the factions are too unbalanced for how subtle and indirect the interaction is. I like games where I can destroy AND build.\n\nThis is just a boring 4X game, but it's missing three of the X's.",
    "timestamp": 1652565600
  },
  {
    "username": "SeerMagic",
    "rating": 3.5,
    "comment": "I hate this game. And that's after multiple chances.\n\n Ugly\n Mathy\n Pasted on theme\n Boring gameplay decisions\n Euro tracks to move up on for no rhythm or reason is one of my most hated mechanics",
    "timestamp": 1646262000
  },
  {
    "username": "NormandyWept",
    "rating": 4.0,
    "comment": "Even after over ten plays, I still feel I'm learning this game, given the complexity and the amount of races you need to learn to play well consistently. I don't really feel the rewards of the game have so far justified that considerable effort that had to be invested to try and learn it.\n\nIn a way this unfortunately inspired the complexity and interlocking system madness of more contemporary Euros which is a shame as this at least seems to show some signs of the old German games.",
    "timestamp": 1642978800
  },
  {
    "username": "Dreamdealer",
    "rating": 5.0,
    "comment": "Santa Mc AWESOME 2013",
    "timestamp": 1762470000
  },
  {
    "username": "dj_koen",
    "rating": 5.0,
    "comment": "I dont particularly like or hate this game",
    "timestamp": 1759528800
  },
  {
    "username": "Nodens",
    "rating": 5.0,
    "comment": "Modern Euro at its euroest. Speculate with three different currencies while forced to adhere to the path your faction demands lest you get left behind.",
    "timestamp": 1753048800
  },
  {
    "username": "renato_cec",
    "rating": 4.5,
    "comment": "It is not for me. Obviously, it has much value, but still not for me.",
    "timestamp": 1752530400
  },
  {
    "username": "joanmoreno",
    "rating": 5.0,
    "comment": "Enrevesado y muy abstracto (pretenden darle tema al juego pero es un pegote increible) demasiados mecanismos que te llevan a hacer lo mismo una y otra vez. Las diferentes facciones son la gracia del juego.",
    "timestamp": 1752357600
  },
  {
    "username": "JohnWaffles",
    "rating": 5.0,
    "comment": "Played this after all of its siblings and I'd just rather play any of the other versions at this point. Feels way too long.",
    "timestamp": 1750543200
  },
  {
    "username": "Francones",
    "rating": 5.0,
    "comment": "can see the appeal, i need more interaction in my games, especially for a game this heavy.",
    "timestamp": 1750197600
  },
  {
    "username": "Markuson",
    "rating": 5.0,
    "comment": "You need to remove the theme, which is not there. It is a heavy euro with no luck and for many people is a good thing.\nIt is tight and sometimes punishing. Although, if you follow the direction of the game gives you (end-round points and end-game scoring) you will feel too much on rails.\nI like the nature of the puzzle, but after many plays it becomes repetitive. I do not think will pass the test of time.",
    "timestamp": 1744581600
  },
  {
    "username": "Maik4000",
    "rating": 5.0,
    "comment": "Verkauft 40€",
    "timestamp": 1743631200
  },
  {
    "username": "yoyomanhihi",
    "rating": 4.8,
    "comment": "Big euro game, where you optimize turns and resources for victory points. It's good mechanically, but I find it unsatisfying and punishing because it's impossible to win as a beginner, and you will feel it. Also, as someone who player Gaia Project before (which is a kind of v2.0 of Terra Mystica), Gaia project is strictly better in every aspect and much more replayable. It's still 90% the same game however, so if Terra Mystica is not your thing (like me), you won't like Gaia project neither.",
    "timestamp": 1742338800
  },
  {
    "username": "aggieamy",
    "rating": 5.0,
    "comment": "I don't give games a one rating unless they've done something personally to offend me… But I considered it for Terra Mystica.\n\nI played this with my husband and by round three where I had passed after two actions and he still had things to go I was daydreaming about doing something fun like folding my laundry.\n\nI like spreadsheets and, Sir, you are no spreadsheet!",
    "timestamp": 1739746800
  },
  {
    "username": "Ginewra",
    "rating": 4.8,
    "comment": "bga",
    "timestamp": 1739660400
  },
  {
    "username": "Generalkhun",
    "rating": 5.0,
    "comment": "0 theme. Bloating rules that not that making much sense. Basically moving stuffs from A to B. Still very cut throat to the level that a move can make one player not able to do anything. How to find a fun when playing this game? I must familiarized with the rule before attempt a match of this game again in the future",
    "timestamp": 1736377200
  },
  {
    "username": "repear",
    "rating": 5.0,
    "comment": "5 - Take it or leave it",
    "timestamp": 1736031600
  },
  {
    "username": "aaj94",
    "rating": 5.0,
    "comment": "Update: TM has been totally fired by Gaia Project: more strategy without much more complexity. Rating has been adjusted accordingly: go play Gaia!\n\nTerra Mystica was one of the first games that really opened me up to the broader horizons of Eurogaming. I have it to thank for my love of Lancaster, Russian Railroads, and Tigris and Euphrates. And still, two years later, few games are as epic in scope nor as fulfilling in strategy as Terra Mystica.\n\nI love civilization/engine-building games, and Terra Mystica is one of the best. Through two hours, you'll be building up your civilization, expanding through buildings that make you wealthier and more powerful, and manipulating the four religious tracks to gain points. Yes, this is more of an abstract puzzle than an immersive, thematic experience -- more Eclipse than Civilization -- but it's worth it, because the puzzle of the game is just so, so good.\n\nI haven't found a 'dudes on a map' game that really satisfies all my desires, and Terra Mystica does without even really being a dudes on the map sort of game. The map forces you together with your opponents -- and yet the power leaching mechanic rewards you for cozying up to them and building your empire right next to theirs.",
    "timestamp": 1734562800
  },
  {
    "username": "Gamer_Dog",
    "rating": 5.0,
    "comment": "Beautifully produced by Zman. Dry optimization euro with low interaction and some imbalanced factions. Lots of different mechanisms that IMHO don't come together in any meaningful way. Has a great rating, so I may defer to my fellow geeks and give it more plays.\n\nUpdate: I played the subsequent games in the series, and have thought they were all excellent improvements. While I haven't gone back to this title, I suspect I would like it more, or at least appreciate it more given the elements in the follow-on games.",
    "timestamp": 1732057200
  },
  {
    "username": "purplecow55",
    "rating": 5.0,
    "comment": "Players are trying to manage their factions power to build buildings which yields more resources to build more things. This is a high end of medium weight game.",
    "timestamp": 1731106800
  },
  {
    "username": "rjolly",
    "rating": 5.0,
    "comment": "Played it only once, but was disappointed. Thought I'd like the map control aspect, but was underwhelmed. Seems like elements bolted on to add complexity aren't cohesive. Don't get the hype.",
    "timestamp": 1730934000
  },
  {
    "username": "ObzidiaN",
    "rating": 5.0,
    "comment": "Not my type of game (heavy longer solo cube pushers on a track).\n\nI can understand why people love this game.",
    "timestamp": 1729288800
  },
  {
    "username": "alexdesouza",
    "rating": 5.0,
    "comment": "Terra Mystica is a challenging multi-player optimization puzzle of perfect information. But the game can be extremely punishing if there is even a small imbalance in skill or experience between players at the table, and victory in this game can be obvious several turns before the inevitable end. Playing out the rest of the game can feel tedious after that point. There are also ways to completely ruin others' game by hemming them in on the board. Several mechanism, the cult track in particular, feel tacked-on and unnecessary mechanically, but for another thing that needs to be considered to score points.\n\nTerra Mystica was an exceptional game when it was initially released. But in the modern landscape of design, it feels dated and cumbersome. Gaia Project significantly improves upon all of the game's mechanical issues, but remains dated in its design as well.",
    "timestamp": 1726696800
  },
  {
    "username": "SirMarmight",
    "rating": 5.0,
    "comment": "The studious veteran who lubricates their engine most efficiently wins, zero surprises, zero frills. Granted, I am grateful for finally chewing on this 2012 classic twice, the airtight design is commendable, but with feeble player friction & no hidden information amidst uneventful art, the buzzy vibes swiftly waltz out the window.\n\nThere are a few whirls left in me, maaaybeee, although I can guarentee even now that my hippocampus & amygdala will be skipping gleefully in their own coping pastures full of wishful RNG, mind games & meaningful interaction.",
    "timestamp": 1722376800
  },
  {
    "username": "Zete",
    "rating": 5.0,
    "comment": "Probably was in the wrong mindset for this. Sold this off as another player in our group has Gaia Project. We will give that another go.",
    "timestamp": 1720476000
  },
  {
    "username": "MachineEpsilon",
    "rating": 5.0,
    "comment": "First play rating: 7.0",
    "timestamp": 1718316000
  },
  {
    "username": "tmoiynmwg",
    "rating": 5.0,
    "comment": "I feel it's a bit too abstract to be worth the effort of so much planning.",
    "timestamp": 1716156000
  },
  {
    "username": "yiechow",
    "rating": 5.0,
    "comment": "Only played once and turn to age of innovation for ever.",
    "timestamp": 1715205600
  },
  {
    "username": "Kodeir",
    "rating": 5.0,
    "comment": "A game about managing multiple currencies. There's some interaction thanks to the board, but it's mostly an economic game, with some snowballing issues. Not a huge fan of those, but I must admit this one is well designed.\n\nI am finding replayability to be a concern. The different races play too similar to each other. Don't get me wrong, the game is clearly assymetrical, it's just that the game doesn't feel significantly different if you pick another race. This, joined with the extremely limited interaction, means there is very little room for creative moves.\n\nWould be more forgiving with its flaws if its playtime was closer to an hour.\n\nRating: \nOptimal number of players:\n 4\n\nFor more information on how I rate games, go to my profile",
    "timestamp": 1709334000
  },
  {
    "username": "TVDinner",
    "rating": 5.0,
    "comment": "The board play is neat but it's still just a bunch of paths to get points with variable player powers. Maybe I've played enough of those. We'll try this again.\n\nAnd it still felt like point salad. Not something that snags our interest.",
    "timestamp": 1707692400
  },
  {
    "username": "Kaelle",
    "rating": 5.0,
    "comment": "Too many points to count and too many rules to control completely this game. Very hard to explain to other person and more hard to understand. But there is nevertheless some good rules.",
    "timestamp": 1706828400
  },
  {
    "username": "jkach91",
    "rating": 5.0,
    "comment": "Never could get enough people together to play a bigger game. The games I did play, I felt like I was doing my own thing and doing a mish-mash of different actions to get points and go up different tracks. I didn't feel like it was as cohesive as I would want it to be.",
    "timestamp": 1705791600
  },
  {
    "username": "gizmobj",
    "rating": 5.0,
    "comment": "Mostly played online. A fairly heavy game. As is the danger with asymmetrical factions - some can be much more powerful than others.\n\nNot a game for newbies.",
    "timestamp": 1704927600
  },
  {
    "username": "neatbender",
    "rating": 5.0,
    "comment": "Overall a very-very dry euro. Not sure if the all Civs are Balanced. Only trick is when to do what on the maps, while looking at the missions for each round. Very simple, probably deep. Wrong decisions will costs you the game.",
    "timestamp": 1704927600
  },
  {
    "username": "blanket221",
    "rating": 5.0,
    "comment": "一款需要耗腦的遊戲，好玩，但需要養足精神！玩家必須憑藉技巧和技巧嘗試統治盡可能大的區域並發展該團隊的技能。還有四種宗教邪教可供你進步。為了做到這一切，每個小組都有特殊的技能和能力。\n\n玩家輪流利用他們擁有的資源來執行他們的行動。不同的建築可以讓玩家開發不同的資源。住宅可以容納更多工人。貿易公司可以讓玩家賺錢。要塞可以解鎖團隊的特殊能力，而寺廟則可以讓你發展宗教信仰以及地形改造和航海技能。是一款算是還滿好玩的桌遊！",
    "timestamp": 1704668400
  },
  {
    "username": "MonkeyThief86",
    "rating": 5.0,
    "comment": "Willing to try at higher player counter, as 2 was very bland.",
    "timestamp": 1702249200
  },
  {
    "username": "heavymetalboardgamer",
    "rating": 5.0,
    "comment": "I like Euros, this one is way too dry and nothing feels fun when I play.",
    "timestamp": 1699916400
  },
  {
    "username": "LucasGentry",
    "rating": 5.0,
    "comment": "Highly-regarded game, but I'm not interested in the theme.",
    "timestamp": 1699311600
  },
  {
    "username": "Merlija",
    "rating": 5.0,
    "comment": "Terra Mystica is a very dry, chess-like game where you can predict the perfect sequence of moves right from the beginning of the game. Sure there are opponents, that can interfere with you, but if they also run their „perfect program“, it is completely deterministic and predictable.\nAnd it’s freaking BRUTAL if you don’t make the perfect choices.\nI love strategy games but this is just boring.",
    "timestamp": 1697752800
  },
  {
    "username": "Sh0rtz",
    "rating": 5.0,
    "comment": "I like the core mechanic, but the game is way too repetitive for me. It lacks variability. Gaia Project is clearly superior.",
    "timestamp": 1696629600
  },
  {
    "username": "AKHawkster",
    "rating": 5.0,
    "comment": "Very deep strategy game with a lot to like. Some of the races are clearly unbalanced, but the variety is great for gameplay.\n\nWas a 9/10, now obsoleted by Age of Innovation.",
    "timestamp": 1696024800
  },
  {
    "username": "jcarvin",
    "rating": 4.5,
    "comment": "This is an interesting game of terra-forming and playing to the strengths of your individual race. However it's not a grade-A game in my opinion. People I've played with aren't coming back for more, neither am I really. Good game, just not a great one.",
    "timestamp": 1695938400
  },
  {
    "username": "jmsmith2434",
    "rating": 5.0,
    "comment": "I'd rather play Gaia Project though",
    "timestamp": 1695852000
  },
  {
    "username": "mkchu243",
    "rating": 5.0,
    "comment": "you can plan all your turns but there's vying for the middle spaces. With so many options it's hard to know what to do, as you basically should plan out most of the round.",
    "timestamp": 1691359200
  },
  {
    "username": "realityfoible",
    "rating": 5.4,
    "comment": "I grouch a lot about randomness in games, but I can't help but feel that Terra Mystica is an example of determinism done wrong.\nOnce starting pieces are placed, the entire rest of the game is calculable. To prove the point, someone even built an AI that can easily \"solve\" the game.\nFor this and other reasons, I found playing just dull. I wasn't bored, but felt no spark.",
    "timestamp": 1690236000
  },
  {
    "username": "Brandizzle",
    "rating": 5.0,
    "comment": "Played once and dominated... but the bowls thing was a bit too abstract AP-inducing than what I think can bring me joy.",
    "timestamp": 1689976800
  },
  {
    "username": "Mattias",
    "rating": 5.0,
    "comment": "Much too abstract for my tastes.",
    "timestamp": 1684533600
  },
  {
    "username": "kitwick",
    "rating": 5.0,
    "comment": "Not really my kind of thing. Most of the actions felt quite random and meaningless to me. Just swapping this for that with not much sense of story and nothing about the gameplay that felt particularly interesting. The temple tracks are particuarly mystifying to me - just advancing up a track? How is that fun?? Why bother including such a boring action?",
    "timestamp": 1684447200
  },
  {
    "username": "viovas",
    "rating": 5.0,
    "comment": "Thinky game. Allot of down time.",
    "timestamp": 1681423200
  },
  {
    "username": "SrFinn",
    "rating": 5.0,
    "comment": "Extremely overrated game.\nI get that it is brilliantly designed. But the feeling of it is like Homework, brilliantly designed.\n\nTerra mystica is as ugly (both components and art are horrible) as it is boring. It's a fiddly affair where you spend most of your effort getting one thing - of which you need 3 of, until you do the thing you wanted to do with those things.. 3 times over\n\nThe strategy is notsuperior to games like Le Havre, Caverna, much less something like Brass. I have the feeling that players confuse over-convolution with strategy level. In fact, I can see that when you get to know the game, it has too many do's and don'ts which in fact limit the strategy. It gets worse as you play it..\n\nSo, TM is an OK game but it's boring. The best thing I can say is that is much better than Project Gaia.. a game that could have taken ideas of Terra mystica and turn it into something good... but instead all they did was add more fiddly-ness and iconography, all the while not changing AT ALL the strategy level.\n\nTM is actually TRASH today (2020) given all the alternatives but out of respect for designers and people who love it, no less than a 5 is due.\n\nBrass is a killer for this game, it has too many similarities with only pluses. Play that instead",
    "timestamp": 1681250400
  },
  {
    "username": "junior_gracz",
    "rating": 5.0,
    "comment": "Extremely overrated game.\nI get that it is brilliantly designed. But the feeling of it is like Homework, brilliantly designed.\n\nTerra mystica is as ugly (both components and art are horrible) as it is boring. It's a fiddly affair where you spend most of your effort getting one thing - of which you need 3 of, until you do the thing you wanted to do with those things, 3 times after.\n\nThe strategy is no superior to games like Le Havre, Caverna, much less something like Brass. I have the feeling that players confuse over-convolution with strategy level. In fact, I can see that when you get to know the game, it has too many do's and don'ts which in fact limit the strategy. It gets worse as you play it..\n\nSo, TM is an OK game but it's boring. The best thing I can say is that is much better than Project Gaia.. a game that could have taken ideas of Terra mystica and turn it into something good... but instead all they did was add more fiddly-ness and iconography, all the while not changing AT ALL the strategy level.\n\nTM is actually TRASH today (2020) given all the alternatives but out of respect for designers and people who love it, no less than a 5 is due.\n\nBrass is a killer for this game, it has too many similarities with only pluses. Play that instead",
    "timestamp": 1677970800
  },
  {
    "username": "Levydrogo",
    "rating": 5.0,
    "comment": "Good game if played with the right people. This is for ‘serious’ gamers and not one to try and introduce to inexperienced players.",
    "timestamp": 1677538800
  },
  {
    "username": "iamspamus",
    "rating": 5.0,
    "comment": "This is a great game, that gets better after each playing.",
    "timestamp": 1677538800
  },
  {
    "username": "thrasymedes",
    "rating": 5.0,
    "comment": "Found it to be very heavy and not interactive enough for my tastes.",
    "timestamp": 1677366000
  },
  {
    "username": "Mr Mjeh",
    "rating": 5.0,
    "comment": "Clunky,abstract area control game with efficiency optimalization thrown in. This game really isn't as good as it has been hyped up to be. Esp. the points for magic system doesn't work well at all and needs some rethinking. The final scoring isn't interesting either.",
    "timestamp": 1676761200
  },
  {
    "username": "elitegamingsociety",
    "rating": 5.0,
    "comment": "C&K",
    "timestamp": 1676329200
  },
  {
    "username": "LivDanger",
    "rating": 5.0,
    "comment": "Gaia Project improves all of the elements that make this game good and leaves behind the mechanisms and iconography that are counterintuitive.\n\nThis game is fine but I'll never play it again now that I own Gaia Project",
    "timestamp": 1675292400
  },
  {
    "username": "Epochend",
    "rating": 5.0,
    "comment": "I can admire its intricacy and interconnectedness, but I can't quite fully enjoy it; it's just so utterly themeless and brain-burning that it feels more like a demonstration of Euro mechanics than something designed to be 'fun'. It's perhaps a bit of a distant leap, but I find that Scythe takes my favourite bits from this and folds them into a more thematic, engaging experience.",
    "timestamp": 1673305200
  },
  {
    "username": "sdiberar",
    "rating": 5.0,
    "comment": "It's good, just not the sort of thing I'll play much.",
    "timestamp": 1672959600
  },
  {
    "username": "freemanfly",
    "rating": 5.0,
    "comment": "not my cup of tea, even though there are several good mechnisms, they are not well-blended.\nToo long and too many downtime.\nThemeless and not feeling engaged. Religion tracks are boring.",
    "timestamp": 1661378400
  },
  {
    "username": "chogaenim",
    "rating": 5.0,
    "comment": "좋은 전략 게임이지만, 숙련도가 필요한 플레이어가 요구되며\n상위호환 게임이 존재하여 점차 우선순위에서 밀릴것으로 보임",
    "timestamp": 1659218400
  },
  {
    "username": "Joey94",
    "rating": 5.0,
    "comment": "Verkar kul, men svårt att komma in i och inte värt det",
    "timestamp": 1658959200
  },
  {
    "username": "boardgeekagain",
    "rating": 5.0,
    "comment": "Average game. Slightly boring. Take it or leave it.\n\nI like the idea of TM more than I do playing it. It has well crafted mechanisms but I don't enjoy playing it. It’s extremely dependent on the order that you decide to do things in and I don't enjoy having to work that out. It's a bit dull. I turn things into other things. Build a small city. Meanwhile, somewhere, priests race each other.\n\nDon't enjoy:\nLow player interaction\nHaving to min-max each turn\nHaving to sometimes pass early and wait for others",
    "timestamp": 1658959200
  },
  {
    "username": "Jensenmann",
    "rating": 5.0,
    "comment": "The game works well, but for some reason it does not grab me at all.",
    "timestamp": 1657231200
  },
  {
    "username": "rwj_defcon1",
    "rating": 5.0,
    "comment": "Ok, but not terrible much interaction",
    "timestamp": 1653516000
  },
  {
    "username": "nwhyman",
    "rating": 5.0,
    "comment": "The game appears to have one major flaw. That is that you can lose the game during the set-up. To me this indicates a poor design. It could have been fixed either during design or during development but wasn't.\n\nOther points to ponder are the bizarre power system: an essential design element, but way, way, way more complicated than it needs to be. And the extra layer of complexity introduced by the cult board, which adds nothing but playing time to the gaming experience, and thus I view it as a flaw.",
    "timestamp": 1651183200
  },
  {
    "username": "jond",
    "rating": 5.0,
    "comment": "Stony faced silence descends on the table as everyone shuffles pieces on their own boards with thousand yard stares. The silence is broken by the occasional, 'is it\nMy turn' and 'trade power for points?'\n\nThe game takes a lot of focus for me and I find that it just isn't fun enough to justify the investment.\nI like a lot of heavier games, but this one is just a by the numbers JASE.",
    "timestamp": 1643238000
  },
  {
    "username": "whitecatplays",
    "rating": 6.0,
    "comment": "Back in terra.snellman the UI didn't have icons, just letters and codes. It made it look awesome.",
    "timestamp": 1760738400
  },
  {
    "username": "Technarius",
    "rating": 6.0,
    "comment": "Review based on three 2 Player Games and a couple of games on BGA:\n\nPros:\n\n+ Time proven classic game with very tight space on map and a good 2 Player Fan variant\n+ Less complicated rules in the whole Terra Mystica/Gaia Project series of games\n+ I like the Fantasy Theme\n+ No luck involved\n\nCons:\n- Majority of your performance is based on choosing your starting race/starting location/bonus tile. So the outcome of a game might be already predestinated.\n- Outdated Artwork / Design.\n- Climbing up cult tracks is kind of meaningless besides getting Victory Points... very weak thematically. You will find better tracks in Teotihuacan or Gaia project.\n- 2 Player game is not very tight. You need some home rules for better experience.\n- The \"Might token\" Mechanism is not that good as i thought. It's a gimmick to make the game more complicated and less immersive.\n- In the end it looks like evey other ressource exchange game with some tile placement.\n- Upgrading buildings and covering up production you already had feels unsatisdying.\n- Pretty bad balance between the assymetrical races.\n- The Game pushes you towards a certain direction with the assymetrical race abilities and variable victory point requirements. So at the end of the day your decisions are pretty boring.\n- Too high complexity without added value.\n- Very dry.\n\nVerdict:\nIMHO this game is not fun and very dry, at least with 2 Players.\nYou have a lot of possibilities, but after you choose these possibilities the turns are too short and unsatisfying.",
    "timestamp": 1760565600
  },
  {
    "username": "manman1",
    "rating": 6.0,
    "comment": "a complex asymmetric city building game with unique adjacency rules. All the factions play quite differently, but some are far better than other or easier to play well. It takes a long time to play despite only having 6 rounds with limited turns; this makes it feel like you are always running out of time / on the time crunch and must play very efficiently to do well.",
    "timestamp": 1760220000
  },
  {
    "username": "Astronomos",
    "rating": 6.0,
    "comment": "More economy focused game than area control. Dry, soulless euro where faction differences are neat but don’t really contribute to gameplay that is very different.",
    "timestamp": 1759960800
  },
  {
    "username": "Fruktstund",
    "rating": 6.0,
    "comment": "First play I didn't really grasp the strategy. My head was burnt when first got it explained over BGA. Most complicated so far. Maybe next time I get it better and rate it higher!",
    "timestamp": 1759183200
  },
  {
    "username": "Neala",
    "rating": 6.0,
    "comment": "Played once with 4 players. Setup for the game felt lengthy, and I felt it took the full playthrough to actually learn and understand what I was doing. Having played once, I predict a second playthrough would feel better as would be able to make better decisions about starting locations and faction selected.\nThe game feels quite outdated in design, but the game itself its solid.",
    "timestamp": 1757282400
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 6.0,
    "comment": "Solid game. But, just one play, and it took me years to get around to trying this one. I'd play again. But the owner seems indifferent to further plays, so I guess not.",
    "timestamp": 1755640800
  },
  {
    "username": "redmage2",
    "rating": 6.0,
    "comment": "When behind, no catchup",
    "timestamp": 1755381600
  },
  {
    "username": "Invisiblesupermonkey",
    "rating": 6.0,
    "comment": "Sold",
    "timestamp": 1755381600
  },
  {
    "username": "R3D4CT3D",
    "rating": 6.0,
    "comment": "Decent game. Gaia project is better.",
    "timestamp": 1753826400
  },
  {
    "username": "Jackieh9",
    "rating": 6.0,
    "comment": "Well-made but not thrilling. You can upgrade your board to build stuff better / cheaper that grant you points. Big area control on hex map with Catan pieces and more. Conrad taught at library and played with Kevin James and Russell",
    "timestamp": 1752876000
  },
  {
    "username": "grimmymail",
    "rating": 6.0,
    "comment": "Eurogame with a high area control factor. A little to much of point salad for me",
    "timestamp": 1751580000
  },
  {
    "username": "SenorBivins",
    "rating": 6.0,
    "comment": "Big Box\nFolded Space Insert",
    "timestamp": 1750975200
  },
  {
    "username": "Freshcactus",
    "rating": 6.0,
    "comment": "4",
    "timestamp": 1749506400
  },
  {
    "username": "Klaudiapyc96",
    "rating": 6.0,
    "comment": "Good game, played a lot of it at the beginning, but after a while it feels like you always end up doing the same thing and we play only like 3-4 nations",
    "timestamp": 1748210400
  },
  {
    "username": "TrevorJr26",
    "rating": 6.0,
    "comment": "I think possibly I never played this at higher player counts enough to fully appreciate it. If you want a modern eurogame with tracks and a map and wooden buildings and objectives and 6 different resources to manage then you can do much worse than Terra Mystica. The presentation is just fantastic and it's a box I loved to look at, but just not to take off the shelf...\n\nToo much here for my current taste. Maybe I'd like Terra Nova more. But that's just it isn't it? There's now Gaia Project, Age of Innovation and the aforementioned Terra Nova (and more coming I think). Does this speak to a lack of faith in the original design?\n\nI don't know. It's a good game, and it's a rare complex modern euro that has quite a bit of player interaction in a shared space. But you're still gonna spend more time worrying about monk bonuses and spades than about what your friends are doing.",
    "timestamp": 1747864800
  },
  {
    "username": "hacklan07",
    "rating": 6.0,
    "comment": "static map kinda kills it for me, and giants being underpowered is just a downer. otherwise fantastic game",
    "timestamp": 1746136800
  },
  {
    "username": "rendesm",
    "rating": 6.0,
    "comment": "Lots of stuff to do, the only thing that bothered me was the total absence of player interactions (beside blocking, which I don't consider interacion).",
    "timestamp": 1744840800
  },
  {
    "username": "sion111",
    "rating": 6.0,
    "comment": "Lacks negative interaction.",
    "timestamp": 1743976800
  },
  {
    "username": "thorbot",
    "rating": 6.0,
    "comment": "Gaia project is just better in every way. This is a game where one wrong move will destroy you for the rest of the game, and that just isn't how we play. It feels like an ancient game in a sea of better, more modern designs. Up for sale.",
    "timestamp": 1743631200
  },
  {
    "username": "totero",
    "rating": 6.0,
    "comment": "Heavy - 8.5 -",
    "timestamp": 1742770800
  },
  {
    "username": "Tygrone",
    "rating": 6.0,
    "comment": "Very good game in it's day, doesn't cut it against modern games.",
    "timestamp": 1740351600
  },
  {
    "username": "PepsiFizz",
    "rating": 6.0,
    "comment": "I like this game, but played it enough to realize I wasn't catching on enough to play competitively. Understanding both the variable powers and the clunky mechanic presented a barrier to my enjoyment of the game play, and so I do not seek opportunities to play this game.",
    "timestamp": 1736636400
  },
  {
    "username": "aprilbolin",
    "rating": 6.0,
    "comment": "A game everyone else seems to love that I don’t.",
    "timestamp": 1736550000
  },
  {
    "username": "Desiderata",
    "rating": 6.0,
    "comment": "One of those \"everything but the kitchen sink\" games. This is a heavy, long Euro, and is sort of difficult to categorize, mechanics-wise, as it has so many. There's nothing particular exciting or novel here, but there doesn't have to be either. It does what it does well, and that is provide an enjoyable gaming experience. The theme is non-existent, but if you can get past that, then the game can be fun, although it can feel a little long for my taste if players suffer from AP (likely).\n\nI think it's a bit too tactical for my taste, in that you really have to chase those end-of round objectives for their vps. This kind of forces your path, losing some of the variability of being able to try something new.",
    "timestamp": 1735599600
  },
  {
    "username": "oemorgan1",
    "rating": 6.0,
    "comment": "Thought I'd like it more than I did",
    "timestamp": 1735513200
  },
  {
    "username": "TrentonTron",
    "rating": 6.0,
    "comment": "This is a great gamer's game, although the first game became rather bogged down with AP. My favorite games are the brain burners, but even I found this to be quite demanding. This will definitely improve with future plays, though, since will be able to focus on strategy and not the complex ruleset. Unlike several other recent titles (Lords of Waterdeep and Tzolkin), the game definitely lives up to the hype. I only refrained from purchasing this at Origins for $80 because heavy Eurogames that do not support 2 players well do not get much play in my house, and CABS has a copy. I am very much looking forward to playing it again, though.",
    "timestamp": 1734649200
  },
  {
    "username": "Eunseob_SKJ",
    "rating": 6.0,
    "comment": "2P experience is not fun but definitely 100% skill based. Low Interaction.\nHowever, I will print out \"The Bend\" 2p map, try again and rerate it\n\n4P experience is what most ppl recommend but we felt it dragged on for really long. Hard to teach. Probably would be more fun on a repeat and with faction drafting.",
    "timestamp": 1732748400
  },
  {
    "username": "Coralouwho",
    "rating": 6.0,
    "comment": "#LetterT\n#BGA",
    "timestamp": 1732575600
  },
  {
    "username": "Hibou77",
    "rating": 6.0,
    "comment": "Very good, if somewhat dry, game. The spatial element is interesting. The way power is managed is a little bit too gimmicky for me (moving those purple cubes around). I got rid of it because it was a duplicate in my gaming group. (Sold at La Revanche Bazar)",
    "timestamp": 1732489200
  },
  {
    "username": "Zeusman",
    "rating": 6.0,
    "comment": "Non-Library Copy",
    "timestamp": 1732230000
  },
  {
    "username": "Dyzthar",
    "rating": 6.0,
    "comment": "Heavy Euro, no luck and with the expansion and promo pack, extremely well balanced. Many different asymmetrical factions to play offering much replayability. Better player almost always wins.\n\nOnly complaint is that sometimes the choosing of the starting locations, in the eyes of veterans, may already decide the game if no one makes any silly mistakes or arbitrary choices. Also once experienced, play patterns become quite common and almost textbook/scripted (like in chess openings).",
    "timestamp": 1732057200
  },
  {
    "username": "bjsully6",
    "rating": 6.0,
    "comment": "I want to like this game but sometimes the massive rules get in the way of itself. There is a lot of strategy to this game which is the really good part. The magic bowls are complicated on how things move around it is tricky to get used to. I am close to selling it but I do have a solo mode to try out before I decide to sell it or not. There are plenty of factions to play which each play differently.",
    "timestamp": 1730156400
  },
  {
    "username": "Geoboffin",
    "rating": 6.0,
    "comment": "For the n00b it is way too easy to lose the game in the first turn. Which is a bit much for a 4 hour game.",
    "timestamp": 1729720800
  },
  {
    "username": "TheBiggestBoss4",
    "rating": 6.0,
    "comment": "I need to give this a second chance since I can see it being very good but at the moment didn't click at all with me.",
    "timestamp": 1729634400
  },
  {
    "username": "Delphinium",
    "rating": 6.0,
    "comment": "Standard Euro style with plenty of interaction but there r is a lot of investment in understanding your own powers and that of your opponents to pull me into investing more plays to get comfortable with the game.",
    "timestamp": 1729461600
  },
  {
    "username": "Valcurdra",
    "rating": 6.0,
    "comment": "This game is a vanilla sandwich, vanilla between 2 slices of vanilla. Turns out though that vanilla is pretty tasty. The lack of theme, boring art and pain components pushes it out of my all time favorites, but happy to play this one anytime.\n\nMechanically a very good economic game with lots of variety between plays, challenging and engaging. Comes in at a comfortable length and level of complexity.\n\nUltimately though, there are many better euros out there.",
    "timestamp": 1727215200
  },
  {
    "username": "Massche",
    "rating": 6.0,
    "comment": "€30",
    "timestamp": 1726524000
  },
  {
    "username": "Neluran",
    "rating": 6.0,
    "comment": "Really interesting systems that found an even bigger following in the later Gaia Project. Tech tracks are better than cults and theme may be a bit more \"there\" for some people in Gaia Project. I think TM is more thematic but ymmv. The adjacency rules make TM more clear for me. I think it's easier to grasp while providing the same amount of depth. The thing is: Terra Nova exists. And that's a better streamlined version. I don't need complexity for complexities sake.",
    "timestamp": 1725919200
  },
  {
    "username": "m4p3t",
    "rating": 6.0,
    "comment": "BGA",
    "timestamp": 1725660000
  },
  {
    "username": "hxbx",
    "rating": 6.0,
    "comment": "I'm very glad I got to play this before buying it. I can't exactly say what I didn't like about it but I think it's some combo of the convoluted actions, abstract feel and unhelpful theme.\n\nI like heavy euro games but this didn't excite me. I didn't feel any \"turn angst\" when playing it and felt a bit too unconstrained for my liking.",
    "timestamp": 1725400800
  },
  {
    "username": "Nyhkon",
    "rating": 6.0,
    "comment": "Steam",
    "timestamp": 1721858400
  },
  {
    "username": "shoemoney",
    "rating": 6.0,
    "comment": "TL;DR: Absolute genius design of unusual mechanisms tightly interwoven into a complex economy. Would be ranked higher except (1) I’m not a fan of replayability through power asymmetry, which is a BIG part of the game, and (2) my enjoyment varies greatly depending on which faction I'm playing.\n\nA chess-y, no-randomness (beyond setup) game of intertwined mechanisms. Two features stand out: One, the mechanisms are so connected that most things are achievable each round if you can find the efficient pathways. (Hello, AP.) Two, the asymmetry of the fourteen individual player factions aren't perfectly balanced, but they’re close enough, and there are a plethora of solutions around if you look: draft & auction, different starting VPs, etc. There are so many levers that pulling off a good move can make you feel like a grandmaster, even if it is just manipulating the system to conjure up another turn. Caveats: if you’re not careful, you can stall your engine early and ensure yourself a bad play; some factions don't play well with others (avoid colour-wheel neighbours if you can); and it needs an insert to ease the considerable set-up and tear-down. Survived the Great Purge of 2024 for its depth, but only by the skin of its teeth.",
    "timestamp": 1720389600
  },
  {
    "username": "Oezz",
    "rating": 6.0,
    "comment": "It's amazing how different each race feels. I like trying to balance space to expand with generating power from neighbouring buildings. Lots of paths to take and each game feels very different. The art is pretty outdated, and the theme was a bit half baked. Can be daunting to newcomers, dense with lots of iconography. Not big on the cult tracks either, but I understand why they're necessary.",
    "timestamp": 1719180000
  },
  {
    "username": "KingD7W",
    "rating": 6.0,
    "comment": "Very long engine building and area control game with unique player powers. Scythe is preferable to me.",
    "timestamp": 1718316000
  },
  {
    "username": "goonzo",
    "rating": 6.0,
    "comment": "new in shrink\n\nBGA: 2 plays",
    "timestamp": 1716242400
  },
  {
    "username": "Egwood",
    "rating": 6.0,
    "comment": "Terra Mysticas rating has dropped after every game. I´ve come to realize that it´s too long for me with 5 players, but doesn´t work with 2-3. 4 is probably the only I´ll play.\n\nAnother issue is the huge importance of starting positions. You can pretty much lose your game in the start with bad placement. And that sucks hard...",
    "timestamp": 1714255200
  },
  {
    "username": "Forgeforgeforge",
    "rating": 6.1,
    "comment": "Extremely large skill gap. Any given scenario hugely favors certain factions, or there's a rock paper scissors situation in faction selection. It really frontloads the most interesting decision in the entire game to just the choice of faction and starting location, and then you have to sit there for 3ish hours to play it out.\n\n\nMuch better with the expansion and variable turn order. But then the expansion factions that overwrite the map hexes and mostly ignore the terrain wheel totally undermine a core mechanic of the game. Also a shame that it's so expensive to get both boxes, variable turn order and additional scoring tiles should have come out as a second edition of the base game.\n\nThough I really hate Earth 1 favor tile (and asymmetric scoring in general)\n\nThis is an n dimensional puzzle where people's goals rarely interact meaningfully.\n\nThis might be far enough away from what I like about board games that I'd rather just be playing broodwar, but in certain moods i'm still awestruck by it.",
    "timestamp": 1712181600
  },
  {
    "username": "sykano",
    "rating": 6.1,
    "comment": "It's interesting, but it's overly complex for what it wants to do.\nI guess it wants to be a luck-free strategic game with advanced complexity and a thin fantasy theme.\nI like the theme of fantasy races, although the game is quite abstract.\nAsymmetric player powers are always great, and in this game it's done in an elaborate way. Every race has numerous properties that differ from the other races. It's neat, but also a lot stays more or less the same.\nThe idea of the terraforming is brilliant and adds a bit of special flavor to the game.\nThe materials look great. I like those massive wooden blocks of different shapes that represent different types of buildings, abstract but fitting.\nAnd there is something about the visuals after painting the board in your color by terraforming and building, and then the mix of shapes and colors from all players at the end of the game.\n\n\nWhat's not so great?:\n- The core mechanics are overly complex (especially the power cycle and upgrading buildings covering up production you already had).\n- The \"workers\" look like stone bricks.\n- 14 races but not every combination is possible (That's because every race is bound to a color and a terrain type, and there are two for each color.)\n- not enough interaction between players\n- expensive\n- Do the races really feel different in gameplay? Not really.\n- It feels like there is something missing in the game, that it could be better if it was designed a little bit differently.\n- There are a lot of options what you can do, but usually not many that are good in a certain situation. So the game more or less pushes you in a direction and by that limits your decision making. Also, the races more or less dictate a main strategy that works best with the given race. And usually resources are very tight which further limits your decisions. And on top the round bonus tiles push you into a direction.\n- The races aren't fully balanced. (There are auctioning rules in the expansion to mitigate that, but it works only for very experienced players who know exactly what the races are \"worth\" in a given situation.)\n- Where are fun aspects? Well, not by cool interaction and not by smooth and elegant gameplay, and the building aspect isn't all that great either. The theme is thin, and the luck-free competition aspect is not what I would call fun, and frankly, it isn't superb.\n\n\nin short:\n+ fantasy theme with terraforming\n+ many races with numerous different properties\n+ good materials (and lots of them)\n+ visuals of colors and shapes (at the end of the game)\n+ round tiles and bonus tiles make you think a little bit differently every game\n0 luck-free strategy (not sure if I really like that)\n- overly complex(!) and a bit too abstract\n- not enough player interaction\n- a strong feeling that it could have been made better\n- balancing issues (races)\n- expensive\n- not really fun(!)",
    "timestamp": 1711922400
  },
  {
    "username": "magoivan",
    "rating": 6.0,
    "comment": "Muy largo para lo que ofrece. Algo farragoso. Mejor jugar con la copia de otro.\n\n20/03/2024\nRevisión de nota:\n-Reglamento: 5\n-Diseño: 6\n-Componentes: 6\n-Adicción: 5\n-Escalabilidad: 7\n-Originalidad: 7\n-Tema: 6",
    "timestamp": 1710889200
  },
  {
    "username": "chaoticgood4life",
    "rating": 6.0,
    "comment": "Terra Mystica mixes long-term strategic planning and tense tactical decision making in a highly satisfying way.\nThere is definitely a significant mechanical puzzle element to the game, which regularly straddles the “busywork” line. That’s something I am generally not too fond of. However, all your micro level decisions are informed by the fact that you’re engaged in a super tight, highly competitive struggle for key hexes on the map as well as for cult track positioning. The game mechanics and even more so your opponents’ actions pull you in a number of different directions —- figuring out the best course of action is immensely rewarding.\n\nThe asymmetry between the factions feels just right. Everyone is definitely playing the same game but will pursue vastly different paths to victory.\n\nOverall, I am a big fan of Terra Mystica despite its mechanical complexity and spreadsheet optimization. The battle for map control and cult spaces makes all the difference and wraps the entire game into a tight and highly engaging package. A remarkable game!\n\nUpdate 2024: I am cooling significantly on asymmetric player powers and TM is moving down a notch because of that.",
    "timestamp": 1710630000
  },
  {
    "username": "bfrizb",
    "rating": 6.0,
    "comment": "Close to a 7, but I knocked it down to a 6 because of its lackluster artistic design and because I didn't like power bowl mechanic (initially).\n\nAge of innovation substantially improves with drafting starting positions.",
    "timestamp": 1709506800
  },
  {
    "username": "FR_IT",
    "rating": 6.0,
    "comment": "Without any doubt i have played an excellent game, but i was not thrilled and i tasted something very dry - a sort of White Lady cocktail with no gin and only triple sec.\n\nSetting and elements are extremely abstract and not contextualize.\nI was suggested to try \"Gaia Project\".",
    "timestamp": 1708210800
  },
  {
    "username": "J_D_",
    "rating": 6.0,
    "comment": "So many fiddly bits.",
    "timestamp": 1707260400
  },
  {
    "username": "Bankler",
    "rating": 6.0,
    "comment": "After five plays, there's a game here, but I don't particularly care for what it's going for.\n\nRating -- Indifferent",
    "timestamp": 1701126000
  },
  {
    "username": "jonnyutah",
    "rating": 6.0,
    "comment": "de 2 a 5, tablero\nDuro muy Duro, largo muy largo. Demasiado esfuerzo para la satisfaccion que me produce.",
    "timestamp": 1700348400
  },
  {
    "username": "MrMistysea",
    "rating": 6.0,
    "comment": "Only played on BGA.",
    "timestamp": 1699484400
  },
  {
    "username": "eagerson",
    "rating": 6.0,
    "comment": "it's a good game, but a bit overrated I think. suffers from balance issues and some amount of complexity that doesn't add value (I love complexity, but added complexity must always add value).",
    "timestamp": 1698271200
  },
  {
    "username": "heathbarATL",
    "rating": 6.0,
    "comment": "(BGA) A good mixture of area control and resource mgmt, but the power system is odd and feels like work.",
    "timestamp": 1698012000
  },
  {
    "username": "msalmon14",
    "rating": 6.0,
    "comment": "The game is fun and has a lot of cool mechanics and ways to score.... but almost too much. There is too many things to think about and focus on for yourself but you also have to be watching your opponents as well. Fun game and I don't mind playing but I could see myself playing this game 50 times until I decided I have a good grasp of everything going on.",
    "timestamp": 1697493600
  },
  {
    "username": "Valza92",
    "rating": 6.0,
    "comment": "Very solid, but not for everybody.",
    "timestamp": 1697320800
  },
  {
    "username": "motoboy",
    "rating": 6.0,
    "comment": "Gift for Father’s Day",
    "timestamp": 1697234400
  },
  {
    "username": "RogueDeckbuilder",
    "rating": 6.0,
    "comment": "Solid game, but a bit over the top. I don't have anything negative to say about it because it definitely deserves the praise. Just personal preference that I would rather play something like Terraforming Mars or Paladins.",
    "timestamp": 1697148000
  },
  {
    "username": "Auzette",
    "rating": 6.0,
    "comment": "It has a ravenous cult following, though I find it amusing enough but not jaw dropping.\n\nIt's popular enough, despite the author's unfortunate vitriol and misguided revulsion of his peers.",
    "timestamp": 1696975200
  },
  {
    "username": "Xyt4n",
    "rating": 7.0,
    "comment": "+ + I prefer the tightness of the map compared to AoI\n+ I prefer the factions in TM with the fixed abilities\n+ The factions in TM feels more thematic\n- - - I prefer that you can build more in AoI. In TM its very slow and not much is happening on the map compared to AoI",
    "timestamp": 1762653540
  },
  {
    "username": "Nuvium",
    "rating": 7.0,
    "comment": "Another player can ruin your game by playing a single move.",
    "timestamp": 1762297200
  },
  {
    "username": "Scifi66",
    "rating": 7.0,
    "comment": "An excellent Euro game about building buildings! I much prefer this to GP due to the tension around hex site competition. It also doesn't have the AP from GP's tech (nor the Gaia Planets...). AoI added a new resource books which detracted from the tightness of the original game. You do need to bid on the starting factions once you are a bit more experienced.\n+ Board design is colourful and easy to see\n+ Mana system is neat\n+ Many different factions = asymmetry!\n+ Land grab at 4-5p is tense and there is further interaction with the power tiles and built tracks\n+ Great decision making in a 2 hour game\n- It's a planning game, you mostly plot out your strategy at the start but tactical moves are needed if neighbours are aggressive.",
    "timestamp": 1761692400
  },
  {
    "username": "BrutusA",
    "rating": 7.0,
    "comment": "Aesthetic: 1\nMechanism: 2\nInvolvement/length/fluid: 2\nReplayability: 1\nOther: 1",
    "timestamp": 1761519600
  },
  {
    "username": "ImZhe",
    "rating": 6.7,
    "comment": "Very interesting game, love the variable setup into 0 randomness gameplay. However, there's a lot of weirdness to the game including the cult track, power bowls, and getting bonuses for other people building next to you. Makes the teach a little convoluted and unintuitive",
    "timestamp": 1760911200
  },
  {
    "username": "dthipp",
    "rating": 7.0,
    "comment": "Sold on FB Marketplace.",
    "timestamp": 1760911200
  },
  {
    "username": "shmonkey",
    "rating": 7.0,
    "comment": "Having played this after many plays of Gaia project, I picked this up quickly. The cultist track does not feel as satisfying, but overall it is still a very fun game.\n\nI dont think i would ever pick this over gaia project, except as a change of pace. Because of this, although my score would suggest a \"must own\" or at least \"must have access to\", I dont feel the need to own this one.",
    "timestamp": 1759874400
  },
  {
    "username": "Ddyraw",
    "rating": 7.0,
    "comment": "Its good, but not really worth the squeeze for me, I did like the newer simpler version better.",
    "timestamp": 1759442400
  },
  {
    "username": "PermaFrost88",
    "rating": 7.0,
    "comment": "This is an engine building game with a loose fantasy theme.\n\nPlayers each control a difference race and they play somewhat differently with differentiating stronghold power.\n\nEach player also indirectly compete over land, special resource actions, the cult tracks, and having the most connected buildings.\n\nThe game is buttery smooth, and resource management is crucial to success.\n\nI just wish there was more player interaction, it sometimes feels like you are playing a solitaire game with players who happen to be near you.\n\nWaiting on the re-implementation, Age of Innovation.",
    "timestamp": 1759096800
  },
  {
    "username": "atlas64gaming",
    "rating": 7.0,
    "comment": "FEBRUARY 2025: 88TH",
    "timestamp": 1758492000
  },
  {
    "username": "hiimjosh",
    "rating": 7.0,
    "comment": "I go back and forth as to whether I prefer this to Gaia Project or not. I think I do. It has less obnoxious rules and is a cleaner design. It's still not a favorite however as it is long, arduous, and not very interactive\n\nEDIT: This game has aged really well. The more time goes by, the more I look at this as one of my favorite strategic modern euros. I do like this more than Gaia Project because I like the spatial board play which seems absent in GP - though perhaps I need to revisit that one.",
    "timestamp": 1757887200
  },
  {
    "username": "fantazyn",
    "rating": 7.0,
    "comment": "Terra Mystica, wydanie PL/CZ\nGra używana, w bardzo dobrym stanie. Po instrukcji widać niewielkie ślady kilkukrotnego czytania, brak śladów na komponentach, minimalne ślady na pudełku. W zestawie 2 akrylowe nakładki na plansze gracza.",
    "timestamp": 1757455200
  },
  {
    "username": "cturner0034",
    "rating": 7.0,
    "comment": "All content combined between core game box and Merchants of the Seas Box.",
    "timestamp": 1757023200
  },
  {
    "username": "pingus",
    "rating": 7.0,
    "comment": "I've replayed it after enjoying Terra Nova a lot and I kinda like it, but definately don't love it. The respect is still there, but it's a bit too much to study and I don't usually like games that are best with 4 unless they have a parallelized turns, obviously this one does not.\n\nPlayed some more and 2v2 makes this a worthwhile experience\nI've played quite a lot of it already and it's nice, but my main problem is that it's not TERRA NOVA, which is just MUCH better. Temu Mystica is shallower strategically, less replayable, less balanced, doesn't have good 1v1, doesn't have any of the improvements like being able to convert at the end of the turn or better leech mechanic, is longer, has super annoying key mechanic and the only thing going for it is that you can have a bit cooler turns with gaining power throught going on the tracks. But that is not enough to make it worth playing in my eyes.\n\nThe base system is incredible, but we desparetely need a fresh modernized version and neither Gaia Project, nor Age of Innovation are those version. They have some advantages, but ultimately are worse for me.\n\nI'm rating it as an 7 for 2v2 and 1v1. I don't think I can play a 3 or 4 player game FFA and have fun.\nAnd even 2v2 and 1v1 are straight worse than Terra Nova and too long for my liking",
    "timestamp": 1756245600
  },
  {
    "username": "JSMA",
    "rating": 7.0,
    "comment": "Besser als gaia",
    "timestamp": 1755900000
  },
  {
    "username": "Arnar146",
    "rating": 7.0,
    "comment": "bga",
    "timestamp": 1754517600
  },
  {
    "username": "SamuraiCoyote",
    "rating": 7.0,
    "comment": "Good ideas and design, but the economy is harsh to understand, collect, optimize, and visualize.",
    "timestamp": 1754258400
  },
  {
    "username": "Bryle",
    "rating": 6.5,
    "comment": "GROUP AVERAGE: 7.22\nBryle: 7\nChung: 7\nDewey: 7.3\nMario: 7\nSixtus: 7.8",
    "timestamp": 1753480800
  },
  {
    "username": "RoundTableGames",
    "rating": 7.0,
    "comment": "develop league once we get stock",
    "timestamp": 1753308000
  },
  {
    "username": "gyroscope1045",
    "rating": 7.0,
    "comment": "VG/LN 30",
    "timestamp": 1752444000
  },
  {
    "username": "CharlieMnemonic",
    "rating": 7.0,
    "comment": "It's good. The round-scoring tiles make the game much easier to pick up as a beginner, since you can just focus on what will give you points this round.",
    "timestamp": 1752357600
  },
  {
    "username": "mudville9",
    "rating": 7.0,
    "comment": "This one can be surprisingly engaging for the mechanism-spinning resource conversion game it is. Probably because of all the different races. I played Gaia Project and the tech track did seem to be an improvement over the cult track, which was always my least favorite part of TM. Not sure about the rest of the game though, losing the ability to block seems like a downgrade. Neither of them is really my taste as far as euro-games go.",
    "timestamp": 1752184800
  },
  {
    "username": "Schwartzkopf",
    "rating": 7.3,
    "comment": "A big, heavy, euro! I have several friends who love this even more than I do and are always up for a game. I really like the game, but I'm really bad at it also. But that's ok - I enjoy stumbling around trying to figure out what's going on and trying to make it all work. For me that's fun. I know that there are detailed strategy guides for each race and stats for which races are stronger than others. That knocks the game down slightly in my estimation. I try not to play with people who read strategy guides, but for some reason this game seems to demand it...But I avoid the strategy talk reflexively. I need to experience games for myself, and Terra Mystica is definitely a game I continue to enjoy exploring ...",
    "timestamp": 1750975200
  },
  {
    "username": "BeloW06",
    "rating": 7.0,
    "comment": "A real gamers game! If played casually, you can make sense of everything when you play with the beginners setup. However, what makes it shine is to know how all the 16 races work and make the best out of it from start to finish. I guess I won't ever get that far...",
    "timestamp": 1750802400
  },
  {
    "username": "_Dynomite_",
    "rating": 7.0,
    "comment": "Tough for me. Tournament players make me feel small when I score 50 points at the end of the game. Asymmetric factions keep it fun for a play every now and then",
    "timestamp": 1749420000
  },
  {
    "username": "Tatsu",
    "rating": 7.0,
    "comment": "After playing I was surprised at previous comments I had read about low player interactions, as we found the game to be cutthroat on many levels. This was a fun game, but a little long.",
    "timestamp": 1747778400
  },
  {
    "username": "KvdBergh",
    "rating": 7.0,
    "comment": "+++ Very interesting puzzle each play\n+++ Each race plays very differently\n++ Lots of replayability\n++ Enormous amount of depth\n\n- Lots of downtime with slow players\n- Does not look pretty",
    "timestamp": 1746914400
  },
  {
    "username": "Chroust84",
    "rating": 7.0,
    "comment": "You try to create an efficient engine using unique races. Some player interaction, long and not a lot of fun.",
    "timestamp": 1744927200
  },
  {
    "username": "gorgue",
    "rating": 6.8,
    "comment": "",
    "timestamp": 1744668000
  },
  {
    "username": "arad70",
    "rating": 7.0,
    "comment": "Artwork: 7\nMechanic: 9\nTheme: 7\nFun: 4\nQuality: 8\nReplayability: 9\nStrikes: none\n———————————-\nSCORE: 7.3\n———————————-",
    "timestamp": 1744408800
  },
  {
    "username": "jimgrant",
    "rating": 7.0,
    "comment": "Fun but fiddly, which I expect from a euro game like this. I felt it was necessary to rigidly follow the scoring goals each round in order to earn the most points rather than expand otherwise. So I'd argue that there weren't very many paths to victory during any particular game, though each game would play out with different things to focus on at different points.",
    "timestamp": 1743631200
  },
  {
    "username": "Gumstep",
    "rating": 7.0,
    "comment": "Interesting decisions but not much interaction.",
    "timestamp": 1743372000
  },
  {
    "username": "soul2197",
    "rating": 8.0,
    "comment": "Players: 3-5 (best 4)\nPlaying time: 60-150 min",
    "timestamp": 1762579740
  },
  {
    "username": "CocoLE_FDU",
    "rating": 8.0,
    "comment": "sell 2025.11",
    "timestamp": 1762297200
  },
  {
    "username": "greetingsfrombergen",
    "rating": 8.0,
    "comment": "NOK 240\nNOK 290 incl exp. (Town tiles, Mini exp, Shipping promo)",
    "timestamp": 1761778800
  },
  {
    "username": "Minh_Nguyen",
    "rating": 8.0,
    "comment": "Fiddly. Quite fiddly. But, the engine building and network building and faction asymmetry is very satisfying. Thinking back to my one play of this, I think this game might have zero luck in it.",
    "timestamp": 1761170400
  },
  {
    "username": "Roygeek",
    "rating": 7.7,
    "comment": "The game was very fun initially. Then all of my group stated playing it online and so I became disinterested.",
    "timestamp": 1760997600
  },
  {
    "username": "RougeHemlock",
    "rating": 8.0,
    "comment": "Extremely asymmetric game of magical terraforming and expansion. Almost entirely skill based, as all randomness happens in the setup, with no more randomness during actual gameplay. Everything is cause and effect and planning. It can be a little intimidating to learn, and skill gaps are extremely apparent with no real way to do handicaps, but if you get an evenly matched playgroup it's a great time.",
    "timestamp": 1760824800
  },
  {
    "username": "rigacu",
    "rating": 8.0,
    "comment": "Vienna",
    "timestamp": 1760392800
  },
  {
    "username": "Malelo96",
    "rating": 8.0,
    "comment": "40",
    "timestamp": 1760220000
  },
  {
    "username": "spiderff",
    "rating": 8.0,
    "comment": "Current #72",
    "timestamp": 1760133600
  },
  {
    "username": "akinfantryman",
    "rating": 8.0,
    "comment": "Great game. Gave it away when left AK.",
    "timestamp": 1759874400
  },
  {
    "username": "Galgor",
    "rating": 8.0,
    "comment": "Likening only at 4 players. At 3, one can be easily excluded from getting power. At 2, too much solo. At 5, too long.",
    "timestamp": 1759528800
  },
  {
    "username": "Dioxz",
    "rating": 8.0,
    "comment": "+ solo automa uitbreiding",
    "timestamp": 1758232800
  },
  {
    "username": "Matttastic",
    "rating": 8.0,
    "comment": "I found the game very difficult to learn. There a lot of little nuances that take time to pick up. Once you do however it’s really a fantastic game. I definitely recommend it.",
    "timestamp": 1757800800
  },
  {
    "username": "dpbernath",
    "rating": 8.0,
    "comment": "Dice Tower Retreat 2025",
    "timestamp": 1757196000
  },
  {
    "username": "Jasper_Scott",
    "rating": 8.0,
    "comment": "One of my favourite games. A real brain burner.",
    "timestamp": 1757023200
  },
  {
    "username": "Udruga Kockica",
    "rating": 8.0,
    "comment": "BID.",
    "timestamp": 1756936800
  },
  {
    "username": "coxy_fc",
    "rating": 7.5,
    "comment": "First play with 2 a little bit disappointing but improved next play with 5. Still doesn't appear to match the hype. Played it more now and really like it but its a very harsh game.",
    "timestamp": 1756764000
  },
  {
    "username": "marinexx",
    "rating": 8.0,
    "comment": "Gaia project absolutely kills this game.",
    "timestamp": 1756677600
  },
  {
    "username": "yxd20250823",
    "rating": 8.0,
    "comment": "利用各个种族能力，建造地形，每个种族都是一种新玩法，可以开很多次，规则比大创造时代稍微简单一点",
    "timestamp": 1756591200
  },
  {
    "username": "Cerberus777",
    "rating": 7.5,
    "comment": "(Physical copy not owned)\n(App owned)\n\n IMPORTANT NOTE: TEMPORARY RATING This rating is done considering that I have only played this game on an App.\n\n\nBase Game: Digital Games Played = 0 times (5-10-19-38)\n\n\n\n\n COMPLETE RATING:\n\n\nSCORE  CRITERIA       WEIGHTING       ------- STAR RATING SCALE -------\n\n(7.0) FUN             (x15):         BORING  REALLY FUN\n\n(7.0) GAMEPLAY         (x5):       NO DEPTH  LOT OF DEPTH (FOR THE WEIGHT)\n(7.0) GAME FLOW        (x5):         FIDDLY  SILKY SMOOTH\n(7.0) DOWNTIMES        (x2):         LOT OF  ZERO\n(7.0) RANDOMNESS       (x2):      PURE LUCK  PURE SKILLS\n(7.0) MECHANICS        (x2):         BORING  INTERESTING / INNOVATIVE\n\n(7.0) REPLAYABILITY    (x5):           ZERO  INFINITE\n(7.0) SCALABILITY      (x3):           POOR  GREAT AT ALL PLAYER COUNTS\n(7.0) PORTABILITY      (x1):          BULKY  SUPER EASY TO PLAY ANYWHERE\n\n(7.0) THEME            (x1):   UNATTRACTIVE  ATTRACTIVE\n(7.0) AESTHETICS       (x1):           UGLY  GORGEOUS\n(7.0) COMPONENTS       (x1):    LOW QUALITY  HIGH QUALITY\n(7.0) VALUE            (x2):  TOO EXPENSIVE  REALLY CHEAP(LOW COST FOR WHAT WE GET)\n\n(7.0) SETUP TIME       (x2):           LONG  ZERO\n(7.0) GAME LENGTH      (x2): TOO SHORT/LONG  JUST PERFECT\n(7.0) RULES COMPLEXITY (x1):        COMPLEX  SIMPLE\n\n\nTOTAL = 350.0/50 = 7.00\n\n\n POSITIVE POINTS:\n\n++ ABC\n\n\n NEGATIVE POINTS:\n\n-- ABC\n\n\n OTHER GAME INFO:\n\nGame Weight = 3.9/5\nRelease Date = 2012\nNumber of Player = 2-5\nApp game length = 45 min.\n2-player length = 90 min.\nPlayer Count Preference = Best at 3, great at 4, recommended at 5! (Not recommended at 2)",
    "timestamp": 1756418400
  },
  {
    "username": "Qumle",
    "rating": 8.0,
    "comment": "including the Automa solo box expansion",
    "timestamp": 1755900000
  },
  {
    "username": "Zenji",
    "rating": 7.8,
    "comment": "Storage Location: Pune",
    "timestamp": 1755727200
  },
  {
    "username": "Song_of_Shield_Lady",
    "rating": 8.0,
    "comment": "有盖亚，所以没买神秘大地了。\n好玩，不过固定版图、爬轨没那么有感觉，种族的设计也不如盖亚华丽",
    "timestamp": 1755554400
  },
  {
    "username": "VeStil",
    "rating": 8.0,
    "comment": "Terra Mystica is a great game about outmaneuvering ones opponents in a competition for area control and network building in in what is supposed to be a magical fantasy world. That being said, the theme does not shine through at all, but the colorful board and the different faction art sure is beautiful!\n\nOwned expansions:\n- Fire & Ice\n- Merchants of the Seas",
    "timestamp": 1755554400
  },
  {
    "username": "florent77",
    "rating": 8.0,
    "comment": "als app",
    "timestamp": 1755468000
  },
  {
    "username": "redbirdbluesong",
    "rating": 7.5,
    "comment": "App version",
    "timestamp": 1754776800
  },
  {
    "username": "eddieb",
    "rating": 7.5,
    "comment": "Thinky, but hard to get to the table. You need to play with people who are your level. Cause this is a game that you can master. And you will get killed if they know it. And you will destroy a brand new person if you've played three times.",
    "timestamp": 1754690400
  },
  {
    "username": "thelastofme",
    "rating": 8.0,
    "comment": "The game that brought me into the hobby.\n\n+ Ice and Fire\n+ Merchants of the Sea\n+ Promo expansion sheet\n+ DIY foam core insert done",
    "timestamp": 1753912800
  },
  {
    "username": "Suffpirat",
    "rating": 8.0,
    "comment": "unbalanced but basically a good game",
    "timestamp": 1753912800
  },
  {
    "username": "stupidforgames",
    "rating": 8.0,
    "comment": "Plays: >100 hours",
    "timestamp": 1753740000
  },
  {
    "username": "Oppo28",
    "rating": 8.0,
    "comment": "Really enjoy this game, though it is far too complex for my usual group. Setup/tear down is a pain, and the whole shebang makes me think of Cones of Dunshire.\n\nThe asymmetry is awesome; the engine building is awesome; the tension around spaces, powers, and power tiles is great; the tactility is awesome. I wish I had a group that would play this semi-regularly, as its a meaty game you can sink into.\n\nMarginally prefer it to Gaia project due to the increased interactivity, the slightly lower complexity, and the better tactility/table presence/theme.",
    "timestamp": 1753740000
  },
  {
    "username": "marpaj123",
    "rating": 8.5,
    "comment": "price 68.24 amazon ordered 9-22-18, first played 9-29-18,rank twenty",
    "timestamp": 1753394400
  },
  {
    "username": "d3struct10n",
    "rating": 9.0,
    "comment": "Solid euro game with a lot of depth and variability. At times feels over complicated and not all factions are well balanced (Fakirs are a joke ?), but great nevertheless.",
    "timestamp": 1762621680
  },
  {
    "username": "kajabbar",
    "rating": 9.0,
    "comment": "- 75e +fire & ice expansion, all in their boxes.",
    "timestamp": 1762383600
  },
  {
    "username": "ditterio",
    "rating": 9.0,
    "comment": "Solo Helper: https://brdgm.me/terra-mystica/#/",
    "timestamp": 1762297200
  },
  {
    "username": "Derianhorgen",
    "rating": 9.0,
    "comment": "SpielboxRating 8-10, av. 8,50\nHandsigniert auf Cover",
    "timestamp": 1762124400
  },
  {
    "username": "GoldenOlaf",
    "rating": 9.0,
    "comment": "App",
    "timestamp": 1761865200
  },
  {
    "username": "norkbes",
    "rating": 9.0,
    "comment": "Wow. 2p very good. 4p out of scale.",
    "timestamp": 1761692400
  },
  {
    "username": "J_Clay",
    "rating": 9.0,
    "comment": "2025",
    "timestamp": 1760047200
  },
  {
    "username": "LL81",
    "rating": 9.0,
    "comment": "Also digital (Steam)",
    "timestamp": 1759874400
  },
  {
    "username": "jorissuurmeijer",
    "rating": 8.5,
    "comment": "Very tactical game and with so many replayability. It does tend to take a little long, but it is a very good, high skill game with no elements of luck.",
    "timestamp": 1759788000
  },
  {
    "username": "Avid_Equinox",
    "rating": 9.0,
    "comment": "+ Thinky\n+ Player interaction is present and enough to be interesting\n+ Zero randomness, so great for repeat plays\n+ Incredible depth of strategy\n- Dry\n- Unbalanced factions that need different starting VP's or auctioning to fix\n- Hard for new/infrequent players as it's a 0 luck euro",
    "timestamp": 1759701600
  },
  {
    "username": "djsturz",
    "rating": 9.0,
    "comment": "Very interactive euro game that will have your in intense thought throughout. Still a fun game to explore even when getting beaten down by an experienced player.",
    "timestamp": 1759701600
  },
  {
    "username": "pboivin",
    "rating": 9.4,
    "comment": "This is an excellent area control and resource management game. There was many strategic layer in this game, many path to victory. Rules are not so complicated to understand and remember for a game of this complexity.",
    "timestamp": 1759615200
  },
  {
    "username": "Beatriz Grifol",
    "rating": 9.0,
    "comment": "Me encanta",
    "timestamp": 1758664800
  },
  {
    "username": "cold25",
    "rating": 9.0,
    "comment": "2x",
    "timestamp": 1758405600
  },
  {
    "username": "tobytoast",
    "rating": 9.0,
    "comment": "This is starting to get its hooks into me. Want to understand it more, and realise I'm only just scratching the surface so far.",
    "timestamp": 1758232800
  },
  {
    "username": "blaklyte",
    "rating": 8.5,
    "comment": "Expansion:\n- Fire & Ice",
    "timestamp": 1758060000
  },
  {
    "username": "miha_lis",
    "rating": 9.0,
    "comment": "2-5 игроков",
    "timestamp": 1758060000
  },
  {
    "username": "chateauzou",
    "rating": 9.0,
    "comment": "A 4-player treat!",
    "timestamp": 1757628000
  },
  {
    "username": "Khumbanigash",
    "rating": 9.0,
    "comment": "I don't play this enough. But there is one guy in my regular group who refuses to play it (or any of the Terra Mystica games), also it is long and not a good fit for new players at higher player counts e.g. at cons. Remarkable game I really like lot. Foundational board game experience.",
    "timestamp": 1757023200
  },
  {
    "username": "USSRocker",
    "rating": 9.4,
    "comment": "A kind fairy-tale.",
    "timestamp": 1756936800
  },
  {
    "username": "wmksdm",
    "rating": 9.0,
    "comment": "2-5",
    "timestamp": 1756936800
  },
  {
    "username": "pauloantunes",
    "rating": 9.3,
    "comment": "With so many factions the game is always fresh. Before dominating a faction you have to play the game a lot and this process doesn't get boring.\n\n[90 €, with all stuff I have for that]",
    "timestamp": 1756591200
  },
  {
    "username": "madmax6661",
    "rating": 8.5,
    "comment": "Didn't work out for us at 2 players, and didn't see us playing it with more players. Unfortunately sold a solid game.",
    "timestamp": 1756591200
  },
  {
    "username": "dandyy",
    "rating": 9.0,
    "comment": "Amazing resource management, economic game. Each nation feels different.\n\nIf you can - have someone explaining you the rules rather than trying with the rule book.\n\nGreat and clear iconography.\n\nAlmost everyone I tried it with enjoyed.\n\nWhen you know the rules it actually is not that long (maybe 25min per player).",
    "timestamp": 1756332000
  },
  {
    "username": "bjackso3",
    "rating": 8.8,
    "comment": "2–5 Players\n60–150 Min\nPlaying Time\nAge: 12+\nWeight: 3.97 / 5Complexity Rating",
    "timestamp": 1756332000
  },
  {
    "username": "Zoozolissimo",
    "rating": 8.5,
    "comment": "You start getting a hand of the situation only after a few games, but the possibilities are infinite and succeeding in a strategy is rewarding",
    "timestamp": 1756332000
  },
  {
    "username": "OneTrueRowan",
    "rating": 9.0,
    "comment": "This game is fairly good in some respects - but I feel like the focus is all over the place. The Cult Track for example is a sideboard but it has a huge impact on scoring and in lots of ways seems more important than the main, huge board. (i.e. the most visual element is not the most important thing to pay attention to)\n\nSome stuff though is great and I see why people can enjoy it so much. The rondel mechanic works well and there are lots of possibilities for how to upgrade your player board engine. A classic for sure, just not one that makes it to the table all that often for us.\n\n[Edit: Having gotten some more plays in, I have started to enjoy the game more and more. We played to back-to-back games in our last session and I think that has really helped bring the game together for me. Rating bumped up to 8!]",
    "timestamp": 1756332000
  },
  {
    "username": "Brot_und_Spiel",
    "rating": 8.5,
    "comment": "14 verschiedene Völker - jedes spielt sich anders.\nDa nicht alle Völker gleich stark (ausgewogen) waren, hat Feuerland eine Anpassung der Start-Siegpunkte vorgenommen.\nErweiterungen zu dem Spiel müssen unbedingt auf meine Wunschliste.\nimmer noch ein absolutes Weltklassespiel, obwohl es fast schon 10 Jahre alt ist.\nTolles Erstlingswerk von Feuerland.\n\nNixen: 103\nNomaden: 78\nKonstrukteure: 61",
    "timestamp": 1756332000
  },
  {
    "username": "ILoseAtLife",
    "rating": 8.5,
    "comment": "Terra Mystica is complicated and has a great level of depth, but all the actions make sense and the iconography is solid. The asymmetric factions are interesting and games have a sense of growth as they progress. Overall an amazing game.",
    "timestamp": 1755900000
  },
  {
    "username": "espoon82",
    "rating": 9.3,
    "comment": "I told my sister this game was like Terraforming Mars meets Lords of Waterdeep. It has some of the coolest factions in it I have seen as well. Gameplay-wise: totally see why this game is so highly esteemed. It is a real pleasure to play.",
    "timestamp": 1755813600
  },
  {
    "username": "Archimicarus",
    "rating": 8.5,
    "comment": "Fallen back in love with TM after assembling an all-expansions box organizer. Just an all-time-great playground for exploring sequences and synergies.",
    "timestamp": 1755727200
  },
  {
    "username": "DanielDose",
    "rating": 9.0,
    "comment": "Plays tracked: Big Box",
    "timestamp": 1755727200
  },
  {
    "username": "silenceisgolder",
    "rating": 10.0,
    "comment": "A real classic eurogame that inspired so many of the trends of the decade that followed. Once you get over the initial learning curve, you're rewarded with a fast, tight, tense game about tempo and prioritization. Points sure don't score themselves -- like Mario Kart, the game gives you a road to stay on but a whole host of carrots and sticks taking you off course. A front-loaded and strategic game, each round manages to still deliver really satisfying tactical trade-offs. A true gem.\n\n(Play count excludes dozens of online plays over the years.)",
    "timestamp": 1762210800
  },
  {
    "username": "bonster20",
    "rating": 9.5,
    "comment": "[Won in an auction on BGG.]\n[Second copy still in shrink given to me, sold in BGG auction]",
    "timestamp": 1761778800
  },
  {
    "username": "Kater_Inna",
    "rating": 10.0,
    "comment": "4",
    "timestamp": 1761778800
  },
  {
    "username": "louisj2016",
    "rating": 9.5,
    "comment": "Expert++",
    "timestamp": 1760824800
  },
  {
    "username": "Auroric",
    "rating": 10.0,
    "comment": "A modern classic. The skill ceiling is limitless, even after hundreds of plays. There's enough tricky math that you need a mix of abstract and strategic thinking, as well as small tactical decisions. The amount and style of interaction means that you are extremely invested in your opponents choices. There's also just something so satisfying about seeing players slowly transform sections of the board into bustling economies. The production is classy and timeless with nice chunky wood pieces - not a single piece of plastic in sight. I really can't speak enough praises for this game, and still believe it should be in the top 10 on BGG. I've heard some say that TM feels \"solved\" but this couldn't be further from the truth. There are tons of intricate decisions, even for experienced players. Bidding for factions adds a whole other layer to the game once players are comfortable, making replayability endless.\n\nIt's hard to find anything bad to say about this game. The main con is that it is punishing for new players. Some factions play very poorly on certain setups, which can be tough to parse before players are experienced enough to use the auction system. That said, it's a key part of why this game is so good, so not a true con in my books, just something to be aware of. The \"earth 1 meta\" can also feel restrictive, but eventually that falls by the wayside as well as groups find other approaches.\n\nTM is the game that really opened my eyes to the hobby. I would sit solo and puzzle out different openings for all the factions, theorycraft strange build orders, etc. They really did capture lightning in a bottle with this design. It's successors are incredible games in their own right, but I still think the OG is the best of the bunch. This game is as close to perfect as I've seen, and it remains so to this day.",
    "timestamp": 1760565600
  },
  {
    "username": "theaaron",
    "rating": 10.0,
    "comment": "Update 2025: I didn't like Gaia Project very much, mainly because of how it changes the cult track. In TM, the cult track is incredibly interactive and leads to a lot of tension as players jockey for the top position. Gaia Project turned it into a series of tracks where you get resources and a fixed amount of points, so it no longer matters where you rank on each track compared to the other players.\n\nI no longer own TM because I think Age of Innovation is the best of the series. It adds a new currency and new things to buy with it, and even more variability. It also retains the \"good\" cult tracks that are all about player interaction.\n\n--------------------------------------------\n\nExcellent. The game is just fun to play, and the different player powers make it a different experience every time.\n\nI also want to commend the iconography and built-in reminders. There's a lot going on in this game, but I haven't had to reference the rulebook at all after the first play. Everything just makes sense and is easy to remember because of the graphic reminders on the player boards and the main board. What do I get during the income phase? Just look for the hand icon. How much do I pay to build this? Just look at your player board. How many points for end-game scoring? Just look at the main board. What are my options on a turn? Look at your reference card. Great design, great layout, great game.\n\nUpdate: I've now had this game since around the time it came out and I've played it several times with different groups. It's still a definite 10. This is the perfect \"heavy\" game for me. Some games (such as those by Vital Lacerda or What's Your Game) are complicated just for the sake of being complicated. Terra Mystica is heavy in the sense that there is no randomness (outside of the initial setup) and there are several different elements in play at all times. The difference, though, is that in TM everything flows smoothly and just makes sense. There are none of those \"fiddly\" rules that I hate and overall the game is pretty easy to explain.\n\nPlayer Count Verdict: 4-5\nTwo players doesn't work, and the game is just okay with three. You really need 4-5 to tighten up the board and the fight for territory.",
    "timestamp": 1760047200
  },
  {
    "username": "stofke",
    "rating": 10.0,
    "comment": "R014",
    "timestamp": 1758492000
  },
  {
    "username": "Nylo",
    "rating": 9.5,
    "comment": "Big Box 2022\n+ Organizer Folded Space",
    "timestamp": 1758319200
  },
  {
    "username": "nifdgad",
    "rating": 10.0,
    "comment": "contained in Terra Mystica: Big Box\n\nOne of my first heavy euros. I love this game. Excellent Engine Builder with Fantasy theme. Very interactive.",
    "timestamp": 1758232800
  },
  {
    "username": "Zouzou825",
    "rating": 10.0,
    "comment": "So smooth and so fun. I'm quite surprised a heavy strategy game can be such fluent. No randomness during the play at all, you never need to complain about bad luck but yourself for wrong move.",
    "timestamp": 1757714400
  },
  {
    "username": "PoisonJamUK",
    "rating": 9.6,
    "comment": "Played twice now. I honestly can't really fault this one! I could happily play it with the same group every week!\n\nTM doesn't need a variable map or other gimmicks to make it more 'replayable' (here's looking at you, Gaia Project). Just like Hansa Teutonica, TM is almost infinitely replayable purely due to truly great game design.",
    "timestamp": 1757455200
  },
  {
    "username": "singlemaltdram",
    "rating": 10.0,
    "comment": "First \"hobby\" board game we ever bought. Only began to wish for something else to play after around 60 or 70 games of Terra Mystica - very good value for money!",
    "timestamp": 1756850400
  },
  {
    "username": "NairHotel",
    "rating": 10.0,
    "comment": "This might be the actual best game of all time. I love the balance between doing your own stuff and interacting with your opponents. I have played this game like 40 times and I just love every single moment of every play. There is SOOOOOO much to learn to get better at this game, and you need like a minimum of maybe 18 games to properly get a grasp on all of the factions (and that isn't even including the fan factions). I do think that the mini expansion with the extra town tiles, the shipping scoring bonus tile, and the temple round scoring tile are a necessary inclusion after you have played enough to want to get decent at this game, but you really don't need anything else. If later, you want more variety, get the fan factions. But this base game has a ridiculous amount of depth. If you are scared off by people saying that everyone should take the Earth 1 favour tile or other comments about the imbalance of the factions, just don't worry. You are likely not actually good enough to see the difference in faction strength (I'm definitely not), and the claims about Earth 1 are exaggerated. As the meta for this game has developed, lots of things have changed, and there are very strong cases that have been made for people overvaluing that favour. Anyways, this game is amazing. It's a forever game.",
    "timestamp": 1756764000
  },
  {
    "username": "couchlife",
    "rating": 10.0,
    "comment": "09/01/25 - The top-tier of heavy Euros. Endlessly replayable, deep, and exciting. Doesn't forget that there are other players at the table and forces tense races and tight maneuvers against them. What a masterpiece.",
    "timestamp": 1756677600
  },
  {
    "username": "Soapermania123",
    "rating": 10.0,
    "comment": "Nov 2023: sold for $450 w/expansions. Replaced by Age of Innovations.\nAug 2025: reacquired. AoI too long for weeknights, and too complex for most.\n\n+Like this one more than Gaia due to the increased tightness of the map. It is this map tightness that gives Terra Mystica its delicious tension, and elevates it above the standard \"soulless\" euros.\n\n-Too much is decided by the initial setup placement. Coupled with a static map, this makes the game feel less open.",
    "timestamp": 1756418400
  },
  {
    "username": "xistonxiston",
    "rating": 10.0,
    "comment": "In-game free",
    "timestamp": 1756245600
  },
  {
    "username": "TokenOpinion",
    "rating": 10.0,
    "comment": "I actively acknowledge that this is the better game of the two, but I really prefer Gaia Project.",
    "timestamp": 1756245600
  },
  {
    "username": "chebinche",
    "rating": 10.0,
    "comment": "Part of the big box.",
    "timestamp": 1756072800
  },
  {
    "username": "DeadDomino",
    "rating": 9.5,
    "comment": "It's so good. I think it's one of the first heavy-ish euros I learned and so possible I'm biased towards it.",
    "timestamp": 1755554400
  },
  {
    "username": "Sir Melancholie",
    "rating": 9.7,
    "comment": "Replaced with the Big Box version of the game.",
    "timestamp": 1755208800
  },
  {
    "username": "GarazoGranie",
    "rating": 10.0,
    "comment": "full strategy, each game is different and do not plan to much move forward",
    "timestamp": 1755036000
  },
  {
    "username": "Bozok",
    "rating": 10.0,
    "comment": "Combinatorial (perfect information, no chance), not an economic engine game, rewards long-term planning (which I'm better at than constantly adapting). The factions aren't perfectly balanced, but there's an official \"New Starting Victory Points\" sheet to fix that. There's also the bidding mechanic from Fire & Ice that can be used with the base game.",
    "timestamp": 1754949600
  },
  {
    "username": "ConnerCP",
    "rating": 9.5,
    "comment": "sell",
    "timestamp": 1754431200
  },
  {
    "username": "smit2174",
    "rating": 10.0,
    "comment": "Incredible game.",
    "timestamp": 1753740000
  },
  {
    "username": "pkcanno",
    "rating": 10.0,
    "comment": "The Modern Classic Boardgame.",
    "timestamp": 1753480800
  },
  {
    "username": "AHforever",
    "rating": 9.9,
    "comment": "The good:\n1. A few games throw rewards at you constantly and it feels so good. This one does that and allows you to CHOOSE them as well. Constant infinite choices of rewards. The Dopamine-est game ive played.\n2. No dice or cards makes it feel so different. Anybody can make a top-notch game with dice or cards. Try doing it with neither.\n3. High level of interaction. Partly due to the semi-coop energy rewards.\n4. This is such an interestingly minimal level of asymmetry. Minimal asymmetry sounds like a negative. Terra mystica shows that if your asymmetry is minimal, unlike Clans of Caledonia or Marco Polo, it does several things: it is still just enough to keep the game fresh and slightly change your playstyle and also keep you excited about trying new races. However it avoids the TRAPS that come with heavy asymmetry, such as imbalance, and forcing players into a strategy and playstyle that matches their race, and forcing players to practically learn another set of rules they might NEVER need to use again.\n\nThe bad:\n1. due to its no-luck nature, the game is slightly solveable and you ARE still slightly forced into a strategy to maximize your asymmetry.\n2. Cant play with with AP players \n3. Some people take the blocking moments on the map personal and cant handle it. The blocking decides games.\n\n\n\nNo dice or cards: a no luck masterpiece. This is chess for the year 2525. We will all be playing it to pass the time on space stations someday. I have no idea how it was brought back in time now to us in the present.\n\nThis is also my second favorite board game app.\n\nI picture the designers sitting there with the almost- finished product saying “the chess-like nature of this might be intimidating to some crowds and without dice or cards it lacks a little spice. What can we do?”.........TWENTY asymmetric races?..........both problems solved in one of the greatest moments of boardgame design history.\n\nThe only criticisms i can come up with, are that you can lose the game on the spot by getting blocked by an opponent. This is fine with me as just that fact alone makes this one of my most tense euros, but it wont be for everybody. Also, like Five tribes and Scoville and so many other games, this can be a bad one to play with AP people.",
    "timestamp": 1753221600
  },
  {
    "username": "Straddllw",
    "rating": 10.0,
    "comment": "I was very overwhelmed when I first played this resulting in a total cerebral meltdown. However, the second time I played, I was surprised at how quickly everything clicked. I would love to get in a lot more plays as I can see that there is incredible depth to be discovered. Almost a 10/10 for me. Replaced by Gaia Project.",
    "timestamp": 1752444000
  },
  {
    "username": "LouieSTFU",
    "rating": 10.0,
    "comment": "Core Collection",
    "timestamp": 1752444000
  },
  {
    "username": "mighty_scoop",
    "rating": 10.0,
    "comment": "u",
    "timestamp": 1752357600
  },
  {
    "username": "Oliver_D",
    "rating": 10.0,
    "comment": "Pure joy.",
    "timestamp": 1752012000
  },
  {
    "username": "Samichi",
    "rating": 9.5,
    "comment": "Digital",
    "timestamp": 1751925600
  },
  {
    "username": "KangaxxTheLich",
    "rating": 10.0,
    "comment": "Errata corrected using stickers",
    "timestamp": 1751666400
  }
]