[
  {
    "username": "MorelliBuendia",
    "rating": 1.0,
    "comment": "This is like a sudoku, but worse and colourful. If you want a better sudoku, just play Sagrada.\n\nMogul Scale: 1/A",
    "timestamp": 1759528800
  },
  {
    "username": "Londoneye1919",
    "rating": 1.0,
    "comment": "Rules are unclear regarding color placement and it implies you should place one color per line, but the example pictures show the same color repeated per line. Very confusing and hard to play the game with a good strategy to win because the rule is not explicit. I hated this game, then thought it was okay, now back to hating it. Dumping the game because I don’t even want to bother selling it.",
    "timestamp": 1752271200
  },
  {
    "username": "joelinmortaja",
    "rating": 1.0,
    "comment": "Absolutely overrated. The most boring board game ever. Don't waste your money on 100 squares and a bunch of cardboard.",
    "timestamp": 1744236000
  },
  {
    "username": "Kigerspirit",
    "rating": 1.0,
    "comment": "This game is for sadists. How is this fun when all people do is try to screw over the other players?",
    "timestamp": 1737068400
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "Yay drafting euro combos. I guess there's no terrible artwork, at least.",
    "timestamp": 1722204000
  },
  {
    "username": "properplay",
    "rating": 1.0,
    "comment": "I absolutely don't understand what the fuss is all about. Visually the tiles look completely unlike Portuguese tiles and mechanically it's absolutely dull and very unpredictable. If there's any strategy to this game I fail to see what it is. At least it plays quick.",
    "timestamp": 1721944800
  },
  {
    "username": "Tufturk",
    "rating": 1.0,
    "comment": "There is usually something about a game that I like, but that's not the case with Azul. I find zero excitement in placing abstractly-patterned tiles into rows and columns for points, and though Azul poses as a light game, it really isn't. It's a sequencer, where you're thinking about possible sequences, over and over and over.\nTo calculate the sequences and make informed moves, and not just half-assed ones, you have to take into consideration what is happening on other player boards, and in anything but a drawn-out contest between two players (and there are so many more interesting games for that, chess, for starters), that is just too much information and calculation to process for a \"light\" game. This just gets worse and worse as the boards fill up, culminating in an endgame that promotes a downtime-inducing orgy of analysis as players calculate ways to avoid ending up with a bunch of negative points, and where one might even calculate final scores, given enough time or room for obstinacy.\nThis is a pure abstract calculation game, one I find both painful and completely uninteresting. I'd prefer playing Bingo, or War with 8 decks of cards, over another game of Azul.",
    "timestamp": 1708642800
  },
  {
    "username": "WBGTheshy",
    "rating": 1.0,
    "comment": "Toooo light for board game fans",
    "timestamp": 1698184800
  },
  {
    "username": "Rednas79",
    "rating": 1.0,
    "comment": "Waste of time and boring.\nMuch better games out there.",
    "timestamp": 1666648800
  },
  {
    "username": "christhomas226",
    "rating": 1.0,
    "comment": "boring",
    "timestamp": 1641250800
  },
  {
    "username": "notasockpuppetlol",
    "rating": 1.0,
    "comment": "Lots of sockpuppets rating this game an 8 with no comment at all. In fact this game is terrible.",
    "timestamp": 1631224800
  },
  {
    "username": "asksupertramp",
    "rating": 1.0,
    "comment": "its really not a new concept its similar to patchwork and this guy just made a bunch of money on it - its really not that great a game - if you are fooled by the colorful pieces then you are an idiot",
    "timestamp": 1610319600
  },
  {
    "username": "chrboesen",
    "rating": 1.0,
    "comment": "Multi-player solitaire. Girls 8-10 like it some, wife does not like it. Played 20 times.",
    "timestamp": 1583362800
  },
  {
    "username": "Otiac1",
    "rating": 1.0,
    "comment": "One of the most unabashedly boring games I've ever had the poor fortune to play.",
    "timestamp": 1561586400
  },
  {
    "username": "Oihane91",
    "rating": 1.0,
    "comment": "Me esperaba más de este juego. Al jugar una partida pierde la gracia ya que no tiene variantes. Es un juego muy bonito pero solo es estética.",
    "timestamp": 1557007200
  },
  {
    "username": "rainbowrose",
    "rating": 2.0,
    "comment": "Hate drafting.\n\nTraded in Aug 2020 US Math Trade",
    "timestamp": 1760997600
  },
  {
    "username": "DanZDK",
    "rating": 2.0,
    "comment": "Played at work",
    "timestamp": 1756504800
  },
  {
    "username": "Whiteshape",
    "rating": 2.0,
    "comment": "it´s very boring",
    "timestamp": 1744927200
  },
  {
    "username": "Adrianrg_",
    "rating": 2.0,
    "comment": "No, no, y no. No me gusta ordenar azulejos. No me parece divertido seleccionar azulejos. No me mola nada hacer filas o columnas o lo que sea con azulejos.\n\nHay muchos otros juegos mejores, no tienen ni por qué ser abstractos. Realmente cualquier otro juego de mesa resulta más interesante y divertido, te permite echarle imaginación, disfrutar de su temática... ¿En serio alguien siente emoción ante la idea de montar una partida de esto con amigos?",
    "timestamp": 1733612400
  },
  {
    "username": "ZweiFalter",
    "rating": 2.0,
    "comment": "Abschluss! Nur noch wenn es sein muss. Gateway Game.\n\nWird ausziehen, will es nicht mehr sehen. Runtergestuft.",
    "timestamp": 1702767600
  },
  {
    "username": "au4au4g4",
    "rating": 2.0,
    "comment": "557",
    "timestamp": 1689890400
  },
  {
    "username": "lyndathompson1",
    "rating": 2.0,
    "comment": "Tried it... personally found it a bit boring.",
    "timestamp": 1674169200
  },
  {
    "username": "Tjorriemorrie",
    "rating": 2.0,
    "comment": "No one in my family got the appeal of this game.",
    "timestamp": 1650578400
  },
  {
    "username": "Fragasnap",
    "rating": 2.0,
    "comment": "A multiplayer variation on tit-for-tat. The primary aim is to build a column and hope no one else tries to build a similar column so you don't bump against them.\n\nProbably good in 2-player.",
    "timestamp": 1633730400
  },
  {
    "username": "attackofmilk",
    "rating": 2.0,
    "comment": "==2021/04/10==\nNope. Asmodee games get 2s. Won't buy unless I can get for massive, massive discount.\n\n==2020/12/08==\nThis is such an elegant design.\n\nThe rules are so easy to remember. Your turn is so fast and simple to resolve -- draft a color from a group, then add it to a row on your player board's queue. Scoring is (almost) completely intuitive.\n\nAnd yet-- Despite how simply turns resolve, and despite how quickly play passes around the table, there is *so much* to think about. It's a deep game that I can play with anyone.\n\nAzul is the kind of design that deserves to be mentioned in the same breath as Ticket to Ride, definitely. The design elegance, graphic design, and production are all top-notch. But I think that Azul is by *far* the better design.\n\nI personally don't consider Azul an abstract. In my head, abstract games don't have drafting elements. Because of this, I consider Azul a direct competitor to Splendor and Century: Spice Road. I think I'll always prefer Azul to Splendor (but I haven't played anything from Century).\n\nMy geekbuddies tell me that the game is very cutthroat at 2p, and that sounds right to me. My first play just now was at 4p, and I was playing quickly with just my own tableau in mind. I would probably avoid playing this at 2p.\n\nMy initial reaction to LAMA was likewise absolutely ecstatic (rating it also a 10), and then I later cooled on the design (bringing it down to an 8). I will probably experience that same kind of arc here with Azul, if I get enough plays with it.\n\nI'll likely take the same kind of stance on owning Azul as I did with Ticket to Ride -- not worth owning because everyone else around me will have a copy.\n\nAlso, regarding the insert: Ticket to Ride is secretly an extra $25 more expensive than the sticker price, because I had to replace the insert, buy an expansion for the regular-sized cards, and get custom tuckboxes for the deck. Azul... maybe... needs the plastic overlays from the expansion? (The scoring track on the top of the player boards was my biggest hesitation with Azul for the longest time) But otherwise, Azul is a complete product even off-the-shelf.",
    "timestamp": 1618092000
  },
  {
    "username": "floyd_revolution",
    "rating": 2.0,
    "comment": "Played at a con. The game basically played itself. We wracked our brains trying to identify any possible strategy or player choice that would give player's some autonomy, but gave up. Every move was entirely predictable and obvious. Not sure why everyone loves this game. 2 plays.",
    "timestamp": 1602453600
  },
  {
    "username": "sgosaric",
    "rating": 1.5,
    "comment": "Whatever this does, Qwirkle does it better. And I'm not a big fan of Qwirkle.\n\nIt's like all the joy of the engine builder type fiddling plus the joy of engine builder type interaction without the engine building. Yay! Which I guess makes for a lower overhead, more accessible experience. Actually the way how scoring snowballs shows at the traces of engine building still being in there.\n\nBasically it's a game of glossing over the assembled tiles and player boards and constructing some 5-6 parallel data sequences in your mind and optimise around them. That's it. It's juggling with data that feels exactly like all the engine building games, without the engine building (though, scoring has the same dynamic). It's exactly what's been popular lately in euroblandia, only it's simpler (which is good) and as bland and devoid of any narrative. (Kingomino was better). So you're juggling this data in isolation of your mind, and possible somebody takes and action that makes you need to ditch 3 of the 6 equation sequences and build them anew (the horror! Oh, noes!). What's the point? There's no narrative. No sense of progression. Possibly interaction happens when people get on comparable levels of optimisation proficiency. Possibly.\n\nSeems similar in interaction and supposed dickery to The Little Prince: Make Me a Planet - and that game looked WAY more charming, had less optimisashun of tedious data sequences, and had a narrative. A narrative!\n\nAnyhow, high rating of 2.5 as maybe I would play it once more, with more players. (Above based on one 2 player game).",
    "timestamp": 1597874400
  },
  {
    "username": "TFuentes",
    "rating": 2.0,
    "comment": "I feel like I have to work at getting points which is not appealing to me. Very little player interaction other than the end.",
    "timestamp": 1565474400
  },
  {
    "username": "tbpinter",
    "rating": 2.0,
    "comment": "I don’t understand the hype on this one. Very light, completely obvious gameplay. Boring.",
    "timestamp": 1556575200
  },
  {
    "username": "neverik",
    "rating": 2.0,
    "comment": "Boring game. You want to play nice 1v1 abstract, go Santorini. More engaging and joyfull. BGG Overhyped.",
    "timestamp": 1524693600
  },
  {
    "username": "korossyl",
    "rating": 3.0,
    "comment": "A classic, apparently, but a game that just feels like it was made by committee. Unintuitive, too complex to feel abstract. A definite pass.",
    "timestamp": 1757455200
  },
  {
    "username": "cogstockeros",
    "rating": 3.0,
    "comment": "It caused a fight…",
    "timestamp": 1757196000
  },
  {
    "username": "uglystru",
    "rating": 3.0,
    "comment": "This is just mancala but prettier. Only hit the table twice before I realized I wasn't really having fun.",
    "timestamp": 1753308000
  },
  {
    "username": "TForever",
    "rating": 3.0,
    "comment": "Arguably filler game. You just get the tiles you need, and fill your board. Pretty light.",
    "timestamp": 1744408800
  },
  {
    "username": "Boroslegion",
    "rating": 3.0,
    "comment": "Played it on a game night, with 3 other guys. Neither of us could understand the hype. Its a low level thinking pick a tile game without any ups or downs. Played 3 rounds (you know, some games need time and it´s quite fast finished, so we tried a couple of times), but no, nothing changed. The game is so colorfull, jet so grey.\nNo twists, no mindfuck, no hardcore strats. I don´t know why this game is ranked so high",
    "timestamp": 1741906800
  },
  {
    "username": "Xyt4n",
    "rating": 3.3,
    "comment": "PLAYED AND NOT INTERESTED ENOUGH\n\nIts an okay game, if you dont know what to do in the next 20min\n\n+ + its a short game which you want to play often in the beginning\n+ short setup\n- - - but after each play it feels bland and way not memorable\n- - - nobody talks about the play after the game\n- - - - finally, I dont care anymore about the game. I dont care to win, I even dont care to play it",
    "timestamp": 1738796400
  },
  {
    "username": "ByDavid3002",
    "rating": 3.0,
    "comment": "Juego abstracto malísimo muy aburrido me parece no lo recomiendo acaso te te guste hacer puzles",
    "timestamp": 1736722800
  },
  {
    "username": "xPasis",
    "rating": 3.0,
    "comment": "It does not really speak to me at all. I got some friends who like it so I'd play it again.",
    "timestamp": 1736463600
  },
  {
    "username": "E4z9",
    "rating": 3.0,
    "comment": "Boring, lots of hate drafting, not optional",
    "timestamp": 1736290800
  },
  {
    "username": "WalkerGame",
    "rating": 3.0,
    "comment": "vergogna le piastrelle no",
    "timestamp": 1735599600
  },
  {
    "username": "Jmccue",
    "rating": 3.0,
    "comment": "A tile selecting and placing game with extremely light depth. Most decisions are obvious. I saw all the game had to offer after 2 plays. It is kind of pretty but just so boring after a couple plays. I'm in the minority here, but felt this game is majorly overrated. If you want mass market games in the same price range that are more fun and involve deeper strategy get Sagrada (gorgeous), Kingdomino or Queendomino, or even Splendor.\n\nThe game is fine. My low rating is in part a reaction to this game being in the top 50 games of all time. #1 abstract game? No way it deserves that.",
    "timestamp": 1732834800
  },
  {
    "username": "bjsully6",
    "rating": 3.0,
    "comment": "This is not a bad game just not really my style so it was torture for me. Game mechanics and strategy are solid but just not something I want to play.",
    "timestamp": 1730242800
  },
  {
    "username": "NadiaTrue",
    "rating": 3.0,
    "comment": "this game frustrates me",
    "timestamp": 1720562400
  },
  {
    "username": "Bertuccia",
    "rating": 3.0,
    "comment": "Interesting concept, but not a style of game I particularly enjoy. Too luck based and a lot of take that.",
    "timestamp": 1716760800
  },
  {
    "username": "SYGF",
    "rating": 3.0,
    "comment": "for some reason, I simply cannot stand this game. I think it's the nim-puzzle so it feels like it should be mathable, but it's too much calculation too far out. I'd prefer to just play chess.",
    "timestamp": 1716415200
  },
  {
    "username": "Papinek",
    "rating": 4.1,
    "comment": "Das Artwork ist wirklich gelungen. Leider finde ich das Spiel eher langweilig ( ich habe es bisher allerdings nur zu zweit gespielt ). Einmal pro Jahr reicht ! Harmonies ist für ein Legespiel die weitaus bessere und vor allem interessantere Lösung !",
    "timestamp": 1762637580
  },
  {
    "username": "SpielzusammenGER",
    "rating": 4.0,
    "comment": "Rules are flawed. Games end really fast. The rules need to be reworked / changed.\nStraight forward game bit super easy to win. Games dont last longer than 15 minutes.\nAfter they fix the error in the rules the game will become more interesting. For now you just complete one line and you win. Easy. But maybe on purpose so that kids can play it.",
    "timestamp": 1761429600
  },
  {
    "username": "Sidekicken",
    "rating": 4.0,
    "comment": "Scratches the same itch as Sagrada and I much prefer Sagrada.",
    "timestamp": 1759960800
  },
  {
    "username": "Aurion254",
    "rating": 4.0,
    "comment": "I'm not sure this deserves the hype it gets, but then I prefer a game with a lot more interaction with other players.",
    "timestamp": 1759183200
  },
  {
    "username": "marpaj123",
    "rating": 4.1,
    "comment": "price 35.04 amazon.",
    "timestamp": 1753394400
  },
  {
    "username": "Jacobdoesrule",
    "rating": 4.1,
    "comment": "Great for the beginner gamer!",
    "timestamp": 1752357600
  },
  {
    "username": "Aurora84",
    "rating": 4.0,
    "comment": "It will be popular for many, many years to come, I suppose, and that's fine. I'll play it with someone who prefers light games, but otherwise it will never hit my table. Sold (twice).",
    "timestamp": 1750456800
  },
  {
    "username": "darkfinale",
    "rating": 4.0,
    "comment": "Introductory game.\nTile placement (Not my type).\nSome blocking and calculating involved.",
    "timestamp": 1744495200
  },
  {
    "username": "d3stinyman",
    "rating": 4.0,
    "comment": "It's an ok game, but I did not really enjoy it. I'm not sure why, but it felt a bit random and I never felt like I had control over what was happening.\n\nI would play Cascadia over this one if I'm in the mood for that type of game. Harmonies is also a better choice and so is Calico.",
    "timestamp": 1741561200
  },
  {
    "username": "dopebones",
    "rating": 4.0,
    "comment": "Not too bad, a low interaction drafting game, better on the reverse side where you can make your own patterns. There's not really much strategy, but quite tactical with plenty of hate drafting and there's a bit of gambling element trying to guess availability of tiles in later rounds, what your opponents are likely to take, etc. I think this is a superior game than 7 Wonders and which is in the same category I would argue.",
    "timestamp": 1740006000
  },
  {
    "username": "winolopez",
    "rating": 4.0,
    "comment": "Not my type",
    "timestamp": 1736377200
  },
  {
    "username": "VaultBoy",
    "rating": 4.0,
    "comment": "Looks very pretty. But, there's nothing that really hooks me.",
    "timestamp": 1736204400
  },
  {
    "username": "saoirseclerks",
    "rating": 4.0,
    "comment": "最不喜欢的一类拼贴桌游，号称轻策实则早教游戏。",
    "timestamp": 1735945200
  },
  {
    "username": "SushiMooshi",
    "rating": 4.0,
    "comment": "At higher player counts, there isn't much control in terms of drafting tiles for max efficiency. You are quite often at the mercy of turn order and the level at which all players are lucid to each others board states. Sometimes, feels like the game is playing itself as the strategy is pretty straight forward (always build top 3 each round maximizing adjacency, fill bottom 2 to make complete columns for end game scoring).\n\nProbably better at lower counts (as alluded to by bgg player preference survey), but at that point I'd rather play other things (this is usually a fun \"light\" party game in my playing contexts).",
    "timestamp": 1734649200
  },
  {
    "username": "tectactoe",
    "rating": 4.0,
    "comment": "A great, simplistic design that makes for a wonderful experience at just about all player counts. Two-player especially becomes a nearly cutthroat experience, since you start drafting tiles that harm your opponent as much as they help you.",
    "timestamp": 1733785200
  },
  {
    "username": "Ephorus",
    "rating": 5.0,
    "comment": "What I like:\n- The tiles are beautiful and satisfying to handle.\n- Simple rules but still some interesting decisions, especially around timing and denying tiles to others.\n\nWhat I dislike:\n- The punishment for leftover tiles can be pretty harsh.\n- Lacks some excitement or tenseness that I enjoy in other games.\n\nWhy I culled it:\nAzul is a solid game, but I just didn’t find myself excited to play it anymore. The decisions started to feel repetitive, and the interaction wasn’t quite enough to keep it interesting. If I want a quick abstract, I have others I’d rather pull out — ones with more variety or more player interaction. Azul’s not bad at all, just not one I needed to keep.",
    "timestamp": 1762038000
  },
  {
    "username": "Graycat_The_Gray",
    "rating": 4.5,
    "comment": "Tempted to get rid of.",
    "timestamp": 1761778800
  },
  {
    "username": "Shiroyama",
    "rating": 5.0,
    "comment": "very simple and broing",
    "timestamp": 1760565600
  },
  {
    "username": "SoloGamingDad",
    "rating": 5.0,
    "comment": "I'm not a big fan, just too basic. But it was worth buying the tiny travel size for, well, travel. The production is great for travel purposes!",
    "timestamp": 1760306400
  },
  {
    "username": "Neeby",
    "rating": 5.0,
    "comment": "Good game, very solid. Super easy to learn and play as well.",
    "timestamp": 1759615200
  },
  {
    "username": "Kovie2",
    "rating": 5.0,
    "comment": "One of my first modern boardgames I played. Still like it, just not played as often. Looks nice and is fairly quick, but the scoring always confuses players for some reason.",
    "timestamp": 1759269600
  },
  {
    "username": "Arseny_Vasily",
    "rating": 4.5,
    "comment": "nice but unimpressive abstract",
    "timestamp": 1758837600
  },
  {
    "username": "sykano",
    "rating": 5.0,
    "comment": "abstract puzzle game with old wall tiles\ndoesn't appeal to me, neither game mechanics nor aesthetics\nsuper boring theme and gameplay\nvery expensive for what it is\n\nI played it and decisions were mostly obvious and unexciting, and seem to be the same every game. It's pretty shallow and boring.",
    "timestamp": 1758837600
  },
  {
    "username": "NaokoBP5",
    "rating": 5.0,
    "comment": "Take it leave it... well nothing special. I like the game, but I would play only with the player who is not too emotional of losing. We often let other player to gain many minus points though.",
    "timestamp": 1758146400
  },
  {
    "username": "Scifi66",
    "rating": 5.0,
    "comment": "Gave to family. Nice gateway/abstract. Can be mean if you play with a skilled opponent. It's best at 2p (7) it gets chaotic with more players.\n+ Tiles are a great tactile experience\n+ Clear layout easy to see opponents' boards\n+ Hate drafting exists...\n+ Simple to teach / quick to set up and play\n+ Players in charge of game end creates tension\n+ Dual sided player boards if boards were neoprene mats without the scoring board and dice counters are used this could ultra portable too.\n– Score board section is annoying if you knock it, a recessed board or dice counter / clicker would be better\n– Some tiles don't have patterns",
    "timestamp": 1757109600
  },
  {
    "username": "lionellyyn",
    "rating": 5.0,
    "comment": "Never understood the hype for this game. This game is just average. Would recommend Harmonies over this.",
    "timestamp": 1756850400
  },
  {
    "username": "SecretSauce275",
    "rating": 5.0,
    "comment": "It was fun but nobody ever requests this.",
    "timestamp": 1756332000
  },
  {
    "username": "althreen",
    "rating": 5.0,
    "comment": "It was \"OK\" but wasn't for me.",
    "timestamp": 1755813600
  },
  {
    "username": "James_in_STL",
    "rating": 5.0,
    "comment": "It's pretty and has some interesting strategy, but doesn't hold up to repeated play and there are better games.",
    "timestamp": 1754776800
  },
  {
    "username": "AzuNiTe",
    "rating": 5.0,
    "comment": "Was ok, i expected more from this game after hearing about it.",
    "timestamp": 1754172000
  },
  {
    "username": "federik21",
    "rating": 5.0,
    "comment": "Played with 4 players... I didn't like the drafting system, maybe it works better with 3 players.",
    "timestamp": 1753480800
  },
  {
    "username": "JazzFish",
    "rating": 5.0,
    "comment": "Neat, but too much \"don't set up the next guy for a score\" for my taste.\n\n(At 2P it's a 7, but at 2P it's competing with a host of other better games.)",
    "timestamp": 1753048800
  },
  {
    "username": "Nodens",
    "rating": 5.0,
    "comment": "Never won it and never will, fucking someone completely over while touching the nice stones is good enough sometimes. +1 for the material",
    "timestamp": 1753048800
  },
  {
    "username": "Nino_223",
    "rating": 5.0,
    "comment": "ABSTRACT\nTILE LAYING",
    "timestamp": 1751839200
  },
  {
    "username": "selvalabelva",
    "rating": 5.0,
    "comment": "Brainburn         Longevity    \nLuck impact       Rules/Setup  \nInteraction       Involvement  \n\nAftertaste           Enthusiasm   \n\n Played at 4 player count only\n Confrontation: multiplayer solitaire\n\n Satisfying tactile and visual presence",
    "timestamp": 1751320800
  },
  {
    "username": "seb_48784",
    "rating": 5.0,
    "comment": "after 2 games on BGA: The game has elegant mechanics and is visually so clear that you quickly see what’s going on. There’s definitely some thinking involved, but you can also play intuitively. Still, it didn’t keep me hooked. I simply didn’t find it appealing to play a full game and optimize my points. When the options for good moves narrow toward the end, I find that more annoying than exciting.",
    "timestamp": 1750888800
  },
  {
    "username": "jeremysprofile",
    "rating": 5.0,
    "comment": "Few options to make truly impactful decisions. More or less plays itself with players of middling skill. Perhaps there is some tier of gameplay that I'm too dumb to access.",
    "timestamp": 1750629600
  },
  {
    "username": "jauggy",
    "rating": 5.0,
    "comment": "OK but I'd rather play Splendor",
    "timestamp": 1748988000
  },
  {
    "username": "Liver_Spots2024",
    "rating": 5.0,
    "comment": "Played this game lots over the years. It's like splendor, everyone I teach it to (largely non-gamers) goes straight out and buys it. Easy to teach, Easy for those playing the game to learn it and be active players",
    "timestamp": 1748642400
  },
  {
    "username": "Doverkeen",
    "rating": 5.0,
    "comment": "Nothing special.",
    "timestamp": 1747778400
  },
  {
    "username": "starsfan777",
    "rating": 5.0,
    "comment": "I am terrible at this one. I hate seeing someone get stuck with excess tiles for a negative score. Quite often me.",
    "timestamp": 1746223200
  },
  {
    "username": "M100G",
    "rating": 5.0,
    "comment": "Prosta gra i wydaje mi się, że na tle innych Azuli szybko zacznie wiać nudą, skoro już po kilku partiach miałam wrażenie mechanicznego dokładania kostek na właściwe dla nich miejsca. Sama gra wykonana dość porządnie i graficznie ładna. Punktowanie trochę irytujące jak dla mnie, ale to kwestia przyzwyczajenia. Niemniej myślę, że gra sprawdzi się nie tylko podczas rodzinnych rozgrywek, ale i w szkolnej świetlicy, czy w bibliotekach.",
    "timestamp": 1745618400
  },
  {
    "username": "spencyrrh",
    "rating": 5.0,
    "comment": "The tactics can get tense, the rules feel light, and what gorgeous pieces! Unfortunately, I don't get excited about draft-based interaction.\n\n[Update 2022-04-27] Okay, I sometimes get excited about draft-based interaction! I feel that meanness and precision in Azul. But it feels a little flat to me. I think it's because the goal is just 'points now'. Basically, I think I prefer to be messed with through a slightly more strategic or thematic puzzle. Is that coherent?",
    "timestamp": 1744236000
  },
  {
    "username": "dosxtres",
    "rating": 5.0,
    "comment": "*",
    "timestamp": 1741906800
  },
  {
    "username": "Sand_iii",
    "rating": 5.0,
    "comment": "Stadtbibliothek",
    "timestamp": 1741474800
  },
  {
    "username": "Jimbojumbo",
    "rating": 6.0,
    "comment": "Puzzly abstract pattern building game. Fun, but I prefer Sagrada.",
    "timestamp": 1761865200
  },
  {
    "username": "guiler31",
    "rating": 6.0,
    "comment": "Players: 2-4 Best 2.\nTime: 30-45 min",
    "timestamp": 1761519600
  },
  {
    "username": "GrimThunderbrew",
    "rating": 6.0,
    "comment": "Don't get why people like it. Theme sucks, game boring.",
    "timestamp": 1761170400
  },
  {
    "username": "mwscarponi",
    "rating": 5.5,
    "comment": "Good thinky abstract, but best strategies seem to be brutally punishing to opponents. Have to have players who are comfortable with serious \"take that\" or know how to defend against it.",
    "timestamp": 1760911200
  },
  {
    "username": "AndrewRK",
    "rating": 6.0,
    "comment": "Pretty solid, chill game. Fun with some good table talk, but the game itself doesn't really incentivize it through its design.",
    "timestamp": 1760824800
  },
  {
    "username": "StrongbowGold",
    "rating": 6.0,
    "comment": "A-4",
    "timestamp": 1760738400
  },
  {
    "username": "moonerie",
    "rating": 6.0,
    "comment": "2-4 players (rec 2-4; best 2)\n7.7 rating\n1.77 complexity\n30-45 mins\n\nNotes: Not bad but nothing super interesting going on(?). It's nice and chill though, even if you screwed yourself over a little. Might be a lower rated game for me but I think it's a nice game to play if you wanna chit chat while playing more then deeply think about your next move.",
    "timestamp": 1760652000
  },
  {
    "username": "abaloo",
    "rating": 6.0,
    "comment": "Mécanique OK",
    "timestamp": 1760479200
  },
  {
    "username": "Sz0lt4n",
    "rating": 6.0,
    "comment": "Suli",
    "timestamp": 1760479200
  },
  {
    "username": "kashio70",
    "rating": 6.0,
    "comment": "pretty fun to play, would recommend to play if someone offers to play it",
    "timestamp": 1760392800
  },
  {
    "username": "Lightspeed_aust",
    "rating": 6.0,
    "comment": "Probably a good game but not my style.",
    "timestamp": 1760306400
  },
  {
    "username": "yaenz",
    "rating": 6.0,
    "comment": "I played Azul once, found it to be a likeable abstract game with a straightforward puzzle built upon a easy-to-grasp drafting mechanism. I immediately forgot about it and later found out it's in the top 100. Interesting. The game's charme seems to stem from the fine intricacies of these pillars, whereas i would like there to be more depth to explore.",
    "timestamp": 1759874400
  },
  {
    "username": "IsolatedPawn",
    "rating": 6.0,
    "comment": "A solid design, and although games unfold differently, they do so in non-memorable ways, which is probably why my interest has waned over time. It’s a competitive abstract game at two players, and meaner than the theme suggests, but many 3-4 player games will be handed to one player simply due to the way player interests align.",
    "timestamp": 1759615200
  },
  {
    "username": "PvtBeckMorale1",
    "rating": 6.0,
    "comment": "Axelle’s copy.\n\nMaybe I just couldn’t get into it, but on this play I wasn’t too keen.",
    "timestamp": 1759615200
  },
  {
    "username": "TheGayBert",
    "rating": 6.0,
    "comment": "A good, let's play something to kill time game. Not a marquee board game night play. Tiles and board feel high quality and it is aesthetically pleasing. Not a ton of overall strategy beyond some planning ahead. Minimal interaction between players other then some griefing by taking a tile someone else might want.\n\nDon't forget about endgame scoring conditions LOL",
    "timestamp": 1759528800
  },
  {
    "username": "selwyth",
    "rating": 6.0,
    "comment": "Take tiles from the middle and pick which slot to put them in your play mat. What sets this apart is taking a color causes the remaining options to morph and the remaining turns to change, with players having to account for not gorging on too many tiles and also not being stuck last with a bad grab. Lovely chunky components that look like chocolates, and a nice feel reminiscent of Tetris-like puzzlers. The elegance helps it here and keeps the options clear.\n\n4+2",
    "timestamp": 1759528800
  },
  {
    "username": "Circe81",
    "rating": 5.5,
    "comment": "Le jeu est simple et peut apporter son lot de moment de détentes et de partage, mais il peut aussi être très frustrant quand vous vous retrouvez dernier à prendre des tuiles ce qui est assez facile à calculer, surtout si vous êtes en concurrence sur une couleur. L'ordre de rotation de table devient donc essentiel, et le potentiel d'antijeu est ainsi trop important à mon goût. Il est assez simple d'envoyer 10 ou 15 points de pénalité à un adversaire et ainsi s'assurer une victoire assez facile et téléguidée après seulement deux ou trois manches.",
    "timestamp": 1759442400
  },
  {
    "username": "dougfoolery",
    "rating": 6.0,
    "comment": "Easy to learn abstract game with a surprising amount of depth. I enjoy the drafting mechanism where leftover tiles are placed in a common pool, as it allows for more tactical outmaneuvering. It can feel mathematical since you can map out the likely sequence of play. Not a huge fan of abstract games but this is a quick interactive puzzle with a lovely tactile feel that goes well with casual gamers.",
    "timestamp": 1759356000
  },
  {
    "username": "logopolys",
    "rating": 6.0,
    "comment": "Themeless drafting game that looks like a tile-laying game, but it isn't really. Strange placement rules and penalties, but it somehow works. I wish the player boards hadn't been identical.",
    "timestamp": 1759269600
  },
  {
    "username": "ValerianofEternia",
    "rating": 6.0,
    "comment": "Pros :\n• Pleasant components to handle\n• Lots of interaction in 2-player games with some hate-drafting\n• Simple yet deep gameplay\n\nCons :\n• Chaotic with 3 or 4 players\n• Blue and red tiles lack patterns\n• Lacks variety in player boards\n\nConclusion :\nAn elegant game that ends up feeling repetitive after several plays.",
    "timestamp": 1759269600
  },
  {
    "username": "mhinto",
    "rating": 6.0,
    "comment": "2-4 players.",
    "timestamp": 1759096800
  },
  {
    "username": "Jpeddle9917",
    "rating": 5.9,
    "comment": "Looks better than it plays",
    "timestamp": 1758146400
  },
  {
    "username": "Picatoli",
    "rating": 6.0,
    "comment": "Grande jogo, com grande nome. Optimo para descontrair e não pensar muito.",
    "timestamp": 1757455200
  },
  {
    "username": "TheGoddamnDuke",
    "rating": 6.0,
    "comment": "Good family game, too poor interaction",
    "timestamp": 1756764000
  },
  {
    "username": "dreamer1789",
    "rating": 6.0,
    "comment": "Harmonies replaced this game for me.",
    "timestamp": 1756591200
  },
  {
    "username": "Killi",
    "rating": 6.0,
    "comment": "Although the original Azul is great, there is some other variations I prefer.",
    "timestamp": 1756504800
  },
  {
    "username": "AirikH",
    "rating": 6.1,
    "comment": "Грали декілька незареєстрованих партій",
    "timestamp": 1756418400
  },
  {
    "username": "SleepyKei",
    "rating": 6.0,
    "comment": "2–4 Players\nCommunity: 2-4 — Best: 2",
    "timestamp": 1756159200
  },
  {
    "username": "Drimy",
    "rating": 6.0,
    "comment": "After 4 plays, its just nothing much left",
    "timestamp": 1756159200
  },
  {
    "username": "Thegooddoc_help",
    "rating": 6.0,
    "comment": "Neat, I suppose",
    "timestamp": 1755900000
  },
  {
    "username": "StoriTella",
    "rating": 7.0,
    "comment": "Amigos",
    "timestamp": 1762694520
  },
  {
    "username": "Murkxsi",
    "rating": 7.0,
    "comment": "verliehen an Ingrid/Rudi",
    "timestamp": 1762683960
  },
  {
    "username": "MonkeyKnifeFighter",
    "rating": 7.0,
    "comment": "Played at the Cooinda Centre Meet-up in March '25\nMy Highest 2-Player Score: 82\nMy Highest 3-Player Score: 66",
    "timestamp": 1762597200
  },
  {
    "username": "Auroric",
    "rating": 7.0,
    "comment": "Just a fantastic abstract. Low barrier to entry, high skill ceiling. A game I can get my mom to play, and a great addition to any collection. Prefer it with 2 or 3.",
    "timestamp": 1762470000
  },
  {
    "username": "Murzik619",
    "rating": 6.6,
    "comment": "Top 1 abstract, top 1 familly for everyone, top 1 chill game.",
    "timestamp": 1762470000
  },
  {
    "username": "ManuelGarand",
    "rating": 6.9,
    "comment": "Dull theme, pretty much an abstract game.\n\nThe mechanics didn't really make up for it either unfortunately.",
    "timestamp": 1762383600
  },
  {
    "username": "Raffaelo",
    "rating": 7.0,
    "comment": "Its fun but in my opinion a little overhyped",
    "timestamp": 1762297200
  },
  {
    "username": "davidxiang",
    "rating": 7.0,
    "comment": "桌游启蒙第二步！",
    "timestamp": 1762124400
  },
  {
    "username": "silenceisgolder",
    "rating": 7.0,
    "comment": "Really tense and scales great from 2-4 players (though better with 2-3). Strikes a perfect balance of player-driven, controlled chaos where you can navigate it just right to get what you want and make your opponents' lives just a bit more painful. One of the best (if not THE best) take and make game.",
    "timestamp": 1762124400
  },
  {
    "username": "LemonToAKnifeFight",
    "rating": 7.0,
    "comment": "There seems to be a single best strategy that usually wins the game and its just a matter of who gets it first",
    "timestamp": 1761951600
  },
  {
    "username": "bettytr",
    "rating": 7.0,
    "comment": "Storage Unit",
    "timestamp": 1761865200
  },
  {
    "username": "Karahkwa",
    "rating": 7.3,
    "comment": "So competitive and beautiful. The decision making is excellent. The end game is tight. The pace is fluid. Outside of the theme being no where to be found... The game does everything right. The design is brilliant.",
    "timestamp": 1761865200
  },
  {
    "username": "musicalanarchy",
    "rating": 7.0,
    "comment": "Really enjoyed this game. Everything looks really pretty and it's a lot of little plans tied together that ultimately work really well.",
    "timestamp": 1761692400
  },
  {
    "username": "merismo",
    "rating": 7.0,
    "comment": "Not usually a fan of abstract games, but this one is always a good time. More strategic than it makes itself out to be, and it can get surprisingly tense. My favorite part- if you play your cards (tiles?) right, you can hilariously mess other people up.",
    "timestamp": 1761606000
  },
  {
    "username": "OneOfOneMillion",
    "rating": 7.0,
    "comment": "Has been replaced by Harmonies for me.",
    "timestamp": 1761606000
  },
  {
    "username": "A73DUSTER",
    "rating": 8.0,
    "comment": "Travel Edition",
    "timestamp": 1762701720
  },
  {
    "username": "WickedWizardry",
    "rating": 8.0,
    "comment": "As a 2-player game it's an amazing, interactive and mean experience.",
    "timestamp": 1762559640
  },
  {
    "username": "t3hjonneh",
    "rating": 8.0,
    "comment": "Reserved for Laura",
    "timestamp": 1762470000
  },
  {
    "username": "Gregski",
    "rating": 7.5,
    "comment": "Provides a lot of strategy options with simplicity.",
    "timestamp": 1762383600
  },
  {
    "username": "CrazyBlueDwarf",
    "rating": 7.5,
    "comment": ".25/1 Storytelling\n.75/1 Effort to fun ratio in line with complexity\n.75/1 Variety in play/strategy\n1/1 Art\n.5/1 Appropriate level of setup for it's complexity\n.75/1 Meaningful Decisions\n.75/1 Likelihood to skip similar games for this one\n.75/1 Keeps me engaged\n.5/.5 Immediately want to play again\n.5/.5 Theme\n.5/.5 Components\n.5/.5 Subjective/Evangilization",
    "timestamp": 1762210800
  },
  {
    "username": "Nanferun",
    "rating": 8.0,
    "comment": "Easy to play abstract game, almost all people love to play it time to time.",
    "timestamp": 1762124400
  },
  {
    "username": "The_Philosophers_Die",
    "rating": 7.5,
    "comment": "Fun, but way too little player interaction.",
    "timestamp": 1762124400
  },
  {
    "username": "Scootmin",
    "rating": 7.5,
    "comment": "Very simple, elegant design with easy rules. Tons of replayability.",
    "timestamp": 1762124400
  },
  {
    "username": "Rogojine_",
    "rating": 7.5,
    "comment": "Very simple, but quite interesting",
    "timestamp": 1762038000
  },
  {
    "username": "Laura_Luna93",
    "rating": 8.0,
    "comment": "2-4 players\ncompetitive\nnice tiles",
    "timestamp": 1761951600
  },
  {
    "username": "Sly_Quick",
    "rating": 8.3,
    "comment": "N/A Expansions\n\nN/A Inserts",
    "timestamp": 1761951600
  },
  {
    "username": "screwy81",
    "rating": 8.0,
    "comment": "Nominee\nGame of the Year 2018",
    "timestamp": 1761951600
  },
  {
    "username": "Connduit",
    "rating": 8.0,
    "comment": "2-4",
    "timestamp": 1761951600
  },
  {
    "username": "Raoulinho82",
    "rating": 8.0,
    "comment": "P: [2-4] (4) Competitive",
    "timestamp": 1761865200
  },
  {
    "username": "Exodusland",
    "rating": 7.5,
    "comment": "Bought it for my wife. She likes the game very much, it is easy to play and to travel with. I'd recommend to anyone who likes the theme.",
    "timestamp": 1761865200
  },
  {
    "username": "JimTacobs",
    "rating": 8.5,
    "comment": "Had to up this rating, I cannot rate a game that I've played over 100 times to be just an 8. I keep coming back to it, it's great fun, it's beautiful. Just love this game.",
    "timestamp": 1762681800
  },
  {
    "username": "Euroman",
    "rating": 9.0,
    "comment": "Great drafting/set collection game with great tactile feel.\nQuick to teach, quick to play!",
    "timestamp": 1762657200
  },
  {
    "username": "YoLYcmqZ",
    "rating": 9.0,
    "comment": "Thoughts: A fun abstract puzzle. Simple structure but surprisingly thinky—the mix of tactical and strategic elements keeps it engaging. Love how elegant it is and the art is beautiful. BGA adaptation is perfect and makes it easy to play multiple games at once.\n\nTag(s): Abstract, Spatial Puzzle, Quick Play\nBest Player Count: 2-4, {2}\nRating: 8, +1.0\nOwn: Physical, BGA\n+ Azul: Crystal Mosaic",
    "timestamp": 1762652880
  },
  {
    "username": "CarsonChandler",
    "rating": 8.5,
    "comment": "The opportunities for meanness take this down a notch for me. I do enjoy playing it, but I don't like risking making others upset, which this game can definitely facilitate despite it's innocent appearance.",
    "timestamp": 1762649400
  },
  {
    "username": "smriera",
    "rating": 8.9,
    "comment": "Gran juego de colocación de losetas.",
    "timestamp": 1762470000
  },
  {
    "username": "Tigropigro",
    "rating": 8.6,
    "comment": "Alcune partite con Stefy\n4 partite con Jole ed Adel",
    "timestamp": 1762210800
  },
  {
    "username": "SinnedYam",
    "rating": 9.0,
    "comment": "Best: 2 Players",
    "timestamp": 1762038000
  },
  {
    "username": "mrtoffee79",
    "rating": 9.0,
    "comment": "Sell",
    "timestamp": 1762038000
  },
  {
    "username": "Ghostratz",
    "rating": 9.0,
    "comment": "Very fun game!! When you get into the groove of the rules it's good for scheming against the other player + constantly evaluating strategy",
    "timestamp": 1761429600
  },
  {
    "username": "hockeyjones",
    "rating": 8.9,
    "comment": "63\n\nPlayed in 2025",
    "timestamp": 1761170400
  },
  {
    "username": "kelnage",
    "rating": 9.0,
    "comment": "Mini version",
    "timestamp": 1760911200
  },
  {
    "username": "Drb89_",
    "rating": 8.5,
    "comment": "Tile drafting\nTile placement\nPattern building\nSet collection\n++ Components and art\n+- Tense and mean",
    "timestamp": 1760911200
  },
  {
    "username": "yodadood",
    "rating": 8.8,
    "comment": "Expansions & Upgrades:\n- Wooden Player Boards",
    "timestamp": 1760911200
  },
  {
    "username": "MissP1ggy",
    "rating": 9.0,
    "comment": "Fast paced, challenging, pretty puzzle game.",
    "timestamp": 1760565600
  },
  {
    "username": "Robber91",
    "rating": 9.0,
    "comment": "good at all player counts",
    "timestamp": 1760479200
  },
  {
    "username": "Louvae12",
    "rating": 10.0,
    "comment": "So much good family nights.",
    "timestamp": 1762690740
  },
  {
    "username": "gabtoschi",
    "rating": 10.0,
    "comment": "After playing Azul, it easily became one of my favorites. From the mind games involved in choosing the factories to the strategy of assembling your mosaic, everything about it always makes me happy and excited.",
    "timestamp": 1762470000
  },
  {
    "username": "Pimpinella",
    "rating": 10.0,
    "comment": "Mára már klasszikussá vált absztrakt játék remek komponesminőséggel, egyszerű szabályokkal. Van szerencsefaktor benne, de jó játékkal kiküszöbölhető a rossz csempekínálat. Taktikus, gondolkodós. Kár, hogy nincs hivatalos szóló módja.",
    "timestamp": 1762038000
  },
  {
    "username": "Harvest777",
    "rating": 10.0,
    "comment": "One of My wife's favorite games.\nEvery one of my non-gamer friends that I played this game with LOVED IT !!!\nTHIS GAME IS A HIt. I give it a 10",
    "timestamp": 1761865200
  },
  {
    "username": "mimiwo",
    "rating": 10.0,
    "comment": "Love it, two players is the best, a lot more cutthroat",
    "timestamp": 1761865200
  },
  {
    "username": "Hokub",
    "rating": 10.0,
    "comment": "Kdybych někdy musel redukovat svou sbírku her, AZUL bych si nechal bez váhání. Je to neuvěřitelně dobrá a silně strategická hra, pokud hrajete ve dvou hráčích. Ve více hráčích je to skvělá rodinná hra s příznivou herní dobou.",
    "timestamp": 1761778800
  },
  {
    "username": "Rasdel",
    "rating": 10.0,
    "comment": "An amazing abstract game that looks beautiful and has polished and simple mechanisms. It hides enough depth in it's simplicity to be very replayable. Probably one of the best abstract games out there.",
    "timestamp": 1761519600
  },
  {
    "username": "FR_IT",
    "rating": 9.5,
    "comment": "Great abstract boardgame: high quality components, good interaction and smart mechanisms.",
    "timestamp": 1761519600
  },
  {
    "username": "darkk_",
    "rating": 10.0,
    "comment": "The game is an elegant masterpiece that new players understand right away after 1 or 2 rounds of how-to-score winning points.\n\nCaptivating ✅\nEngaging ✅\nReplayability ✅\nRules ✅\nQuality ✅\n\nMy BGG Perfect 10?\nAcquired 2+ ✅",
    "timestamp": 1761429600
  },
  {
    "username": "Freydey",
    "rating": 10.0,
    "comment": "2-4 Versus",
    "timestamp": 1761343200
  },
  {
    "username": "Viziviz",
    "rating": 10.0,
    "comment": "Such a great game! Doesn`t get boring. Like it with all player counts. The Mini version is also great and we like to take it on holidays.",
    "timestamp": 1761170400
  },
  {
    "username": "le_faria",
    "rating": 10.0,
    "comment": "Este é um jogo que não cansa de jogar nunca! Precisa ter estratégia, mas é muito leve e divertido! Costumo jogar com os meus pais entre uma partida de buraco e outra. Eles se divertem muito também! Contempla várias idades, não tem quem não goste. Se você ainda não conhece o jogo, eu sugiro que compra a versão \"azul - mini\" é igualzinho ao azul normal, mas menor, vem com um protetor em cada tabuleiro e é metade do preço! O custo-benefício é ótimo.",
    "timestamp": 1760479200
  },
  {
    "username": "tersagun",
    "rating": 10.0,
    "comment": "My in-laws decided to buy the game for themselves after playing 2 rounds.\n\nThat explains a lot.",
    "timestamp": 1760306400
  },
  {
    "username": "asmonder",
    "rating": 10.0,
    "comment": "one of my favorite games with an easy-to-learn premise and a high skill ceiling.",
    "timestamp": 1760220000
  },
  {
    "username": "SammySnijbonen",
    "rating": 9.5,
    "comment": "As far as gameplay is concerned, they could have just as easily gone with cardboard chits. But they didn't, and that gives Azul tremendous visual appeal that's definitely worth its cost.\n\n The rules are easy to learn, and there's more interaction involved than you'd guess at first glance: \"Do you pick these tiles to score points, or the other tiles to deny your opponent a good scoring opportunity?\"\n\n Scales very well with different player counts.\n\n It has built-in revitalization of gameplay: once it starts getting stale, you flip your board to the side without pre-printed patterns.\n\nAlso includes:\n- Azul: Joker Tiles",
    "timestamp": 1759701600
  }
]