[
  {
    "username": "khepriq",
    "rating": 1.0,
    "comment": "Original is better",
    "timestamp": 1761692400
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "No VP, yay! But still no theme involved. As Mordor, I played very peacefully and united all the nations under my rule, defeating the warlike hobbits. Doesn't really justify the LotR theme, and I dislike the artwork used. Even the tied victory condition, although probably rare, was completely baffling to read. Why would the war just end with no resolution?\n\nIn actual play, doesn't really fix the problems I had with 7 Wonders Duel. Instead of text, there's icons for the upgrade paths, but they're super tiny icons. Icons everywhere, so nobody has to learn any names. So abstract. Even battles are just 1 for 1 trades, so that's unlikely to appeal to anyone who wants any kind of war. But will the 95% euro portion of the game appeal to those who would rather play the original 7 Wonders Duel?\n\nCathala and Bauza working together are like Sauron and Saruman joining forces.",
    "timestamp": 1757455200
  },
  {
    "username": "StefanH87",
    "rating": 1.0,
    "comment": "Great game, rating at as 1 due to in my opinion essential promo's not being made available, even to people who did preorder the game (just in the wrong country).",
    "timestamp": 1755381600
  },
  {
    "username": "nT___Ts",
    "rating": 1.0,
    "comment": "I've cancelled my preorder based on quality feedback from other users and the fact that it is obvious that expansions are already planned.",
    "timestamp": 1729634400
  },
  {
    "username": "stepolk",
    "rating": 2.1,
    "comment": "Kraków",
    "timestamp": 1756936800
  },
  {
    "username": "Katzenkraft",
    "rating": 2.0,
    "comment": "Sadly, this is a rather big step back from the excellent 7 Wonders Duel. While the map adds a wee amount of area control as one of three possible victory conditions, some core elements from 7 Wonders Duel were dropped, perhaps, to make this game even more suitable as a gateway game or 'family friendly'. It is no longer possible to increase the resource cost to play cards for other players and the resources are all worth the same (in 7 Wonders Duel two resources were scarcer and more valuable than the others). Also, in Duel for Middle-Earth you have less control over your gold income, as it cannot be increased the same way as in its predecessor. Despite of the three possible victory conditions, gameplay has become a lot simpler and more luck-dependent. In other words, the decision space for players has become smaller.\n\nThe race track is merely a gimmicky effect (with shoddy execution), for which two pawns on the same track on the map would have sufficed.\nUltimately, the execution of the theme is disappointing. The visuals are, at best, mediocre, they resemble clichéd and interchangeable fantasy stereotypes (the depiction of Gollum for example suggests a blend between a gremlin and a monkey and most of the depicted scenes on the cards do not even hint at the many pivotal moments in the original Lord of the Rings books, but are very often reminiscent of... nothing).\n\nThe game seems cheaply produced, from the impractical insert that with some copies causes lid lift, the unusual (small) card size or the aforementioned race track.\n\nAll in all, this game is a worse reimplementation of a great game, cheaply produced and overhyped, mainly due to the all-time popular theme.",
    "timestamp": 1741388400
  },
  {
    "username": "DuneImperium",
    "rating": 2.0,
    "comment": "Its a missed opportunity with the artwork... the theme... the somehow disjointed gameplay, a melting pot of \"bad stuff\". As a fan of lord of the rings nothing really draws me in or makes me connect to this game.\n\nWe couldn't even force ourselves to play this abomination again even tho we would have liked to give it another try.\n\nFor a new 2025 game the artwork looks just abysmal and seems like some homework assignment for a project in middle school.\n\nEven Monopoly Hansi Hinterseer Edition is better than this.",
    "timestamp": 1737068400
  },
  {
    "username": "gkizilis",
    "rating": 2.0,
    "comment": "boring and disapointing. easy to snooker yourself out of options",
    "timestamp": 1731452400
  },
  {
    "username": "Sucrek",
    "rating": 3.0,
    "comment": "Very dull and symmetrical.\nNo depth. No strategy. Fake tactical.\nThis game is basically a tug of war.\nDidn’t felt the thematic.\nMake me wonder if this website is just about fomo… top 31… did they play it more than one game ?\n\nJust toss a coin to know who will win and play something else.",
    "timestamp": 1761865200
  },
  {
    "username": "Clivelaw",
    "rating": 3.0,
    "comment": "Seule véritable décision à prendre : quand passer mon tour pour obliger l'autre à s'autodétruire ?\nTraduit mal le thème (après 6 parties la poursuite de l'anneau mène toujours à une défaite) et a un système de jeu trop agressif pour être agréable (tout l'intérêt du jeu étant d'empêcher son adversaire de jouer).\nÉtant donné la symétrie de jeu, la partie se termine de manière aléatoire.",
    "timestamp": 1755900000
  },
  {
    "username": "robvw",
    "rating": 3.0,
    "comment": "We don’t get this game. You pick a card and you get something. Why? What did you do to earn this? Small board, does not help getting in the theme. Rules are vague. Played once, and put it straight in the for sale pile.",
    "timestamp": 1732057200
  },
  {
    "username": "joven11",
    "rating": 3.0,
    "comment": "not better than the original",
    "timestamp": 1728338400
  },
  {
    "username": "bcnevan",
    "rating": 4.0,
    "comment": "By just a touch, I don't find this game as terrible as 7 Wonders Duel. But everything about the package and experience feels lazy. There's lazy symmetry to the sides. This results in both sides feeling the same. This also means the LOTR paint is here just to sell the game. There is little effort to make the setting interesting. The gameplay is dominated by lazy icon collection that feels arbitrary and not clever. Eventually, I feel the pull to stop making attempts at denying card flips to my opponent just to make the game be over faster.",
    "timestamp": 1761084000
  },
  {
    "username": "Negoc",
    "rating": 4.0,
    "comment": "Very disappointed. Actions feel arbitrary.",
    "timestamp": 1760997600
  },
  {
    "username": "Banassi",
    "rating": 4.0,
    "comment": "Ich wollte das Spiel wegen dem Thema mögen. Die Tischpräsenz ist schön anzusehen. Auch wenn es für die Spieldauer viel Platz benötigt. Ich mag die Illustrationen der Karten. Das Material ist bis auf diese Ring Schiene super. Warum bitte diese Klapperschiene die sich leicht verschiebt, wenn man dagegen kommt. Man hat ein paar nette Entscheidungen im Spiel zu treffen. Das Thema kommt nicht wirklich rüber, die Karten haben nicht mal Namen. Leider hat man trotz der 3 Siegbedingungen nur bedingt Einfluss auf das Ende.\nDie Karten müssen richtig kommen, damit etwas schnelles passiert. Ansonsten kann sich das Spiel wie Kaugummi ziehen, um am Ende in einem Area Control geschiebe zu enden.\nIch denke der Wiederspielwert hält sich in Grenzen, da man eigentlich immer das selbe macht, egal welche Seite man wählt. Ich hatte das Gefühl nach einem Spiel schon fast alles gesehen zu haben.\nMich hat es leider nicht überzeugt.",
    "timestamp": 1756850400
  },
  {
    "username": "Lionel_Triay",
    "rating": 4.0,
    "comment": "Mais pourquoi Sauron a-t-il les même pouvoir que ses adversaires ?",
    "timestamp": 1749592800
  },
  {
    "username": "Cenagal",
    "rating": 5.0,
    "comment": "No se ni por que lo intento. Si no te gustó el original, este no creo que te encante.",
    "timestamp": 1761429600
  },
  {
    "username": "Napattack",
    "rating": 5.3,
    "comment": "2.06\n2\n45 (135)",
    "timestamp": 1760392800
  },
  {
    "username": "kystas",
    "rating": 5.0,
    "comment": "7 Wonders Duel in a disguise, this is it. Sure some changes and there is even map, but even that one is so abstracted that it is mostly ruined chance. I've already played enough it's precessor than this Lord of the Rings version doesn't feel new enough. More a miss than a hit for sure AND for me it's very hard to understand why this is so high in overall BGG-rankings. Deserves same rating than 7 Wonders Duell (which was at first 6, but more lately changed to 5).",
    "timestamp": 1759615200
  },
  {
    "username": "BigspenderPL",
    "rating": 5.0,
    "comment": "Okish, but nothing more.",
    "timestamp": 1758060000
  },
  {
    "username": "sirale",
    "rating": 5.0,
    "comment": "Outrageously symmetric (just like good and evil in Middle-earth!?). Still stinks of the glue used to paste the theme on. Ok game, I guess, although the base system is nowhere near as interesting and impressive to me as people make it, even if 7 Wonders Duel, which I've never played, didn't exist. Modern gamers and I really want different things.",
    "timestamp": 1756764000
  },
  {
    "username": "verandi",
    "rating": 5.0,
    "comment": "I liked this a bit more than 7 Wonders Duel, but neither is really my type of game. 2p is a crowded space and not something I do often. I get the mass appeal, but give me a spatial abstract over this any day.",
    "timestamp": 1752098400
  },
  {
    "username": "danielksan81",
    "rating": 5.0,
    "comment": "Habe es wieder verkauft, da es an das originale 7 Wonders Duel nicht rankommt, vor allem mit der Agora Erweiterung.\nDas Artwork istvTop, mechanisch wurden einige Dinge geändert, allerdimgs macht gefühlt das Herr der Ringe Thema das Spiel kaputt. Es sind einige Dinge vorhanden, welche keinen Sinn machen aber der Mechanik geschuldet sind. Mit einem anderen Thema wie beibdem originalen Duel wäre es sicherlich besser rumgekommen.",
    "timestamp": 1752012000
  },
  {
    "username": "Mayasty",
    "rating": 5.0,
    "comment": "Much worse than \"7 Wonders duel\". I don't feel here much depth. Possible strategies are pretty straightforward. The area control element is crude and disappointing. It looks like artificial and incomplete.",
    "timestamp": 1749852000
  },
  {
    "username": "sorcretic",
    "rating": 5.5,
    "comment": "Why I culled it (Oct. 2024): Big disappointment for me given the pedigree. Unfortunately, I found that the streamlining in this game took away most of what I love about 7WD--the economy. That’s where much of the depth of 7WD lies, maneuvering over resources, making things more expensive for your opponent, and building up an engine. Although many of the mechanics of 7WD are present, there’s little engine-building in Duel for Middle-Earth. I did enjoy the area control map, and would be interested to see that incorporated into a 7WD expansion. I can see they were going for a lighter experience to suit the IP that just isn't for me.",
    "timestamp": 1762621260
  },
  {
    "username": "Sack",
    "rating": 6.0,
    "comment": "a symmetric LOTR game just feels wrong! :-(\n\nAlso, too simplistic for my taste. Grey, then red+strongholds. Almost always.",
    "timestamp": 1762297200
  },
  {
    "username": "Dampfhammer",
    "rating": 6.0,
    "comment": "Schnell gespielt. Leider lässt es immer noch die Situation zu, dass man durch die berechenbare Kartentaktung zwischen den Spielern ins Verderben läuft, wenn die Alternativaktion Gebietsplättchen zu kaufen leer ist (was in Runde 3 passiert). 3 eigene Runden vor Ende war klar wer gewinnt. Weil eben die Siegerkarte hinten lag und kein Weg möglich war, das noch zu verhindern: A nimmt die, B die, A die usw. Haben es dann vorzeitig beendet. Ich hätte gerne mehr Einfluss, solche Momente meinetwegen für einen gewissen Preis zu verhindern. Das fühlt sich auf keiner Seite befriedigend an, weil es random kommt und nicht herausgespielt wurde.",
    "timestamp": 1761951600
  },
  {
    "username": "margrabius",
    "rating": 6.0,
    "comment": "uproszczona wersja pojedynku",
    "timestamp": 1761778800
  },
  {
    "username": "btasam",
    "rating": 6.0,
    "comment": "Nothing remarkably compelling except for when you manage to give your opponent a challenging decision either from drafting or victory condition tension. This is probably the best 7 Wonders game to date and the LotR theme certainly helps.",
    "timestamp": 1760047200
  },
  {
    "username": "Fevin",
    "rating": 6.0,
    "comment": "Variante de 7 Wonders Duel qu m'a moins convaincu que l'original. Possible que je sois devenu plus exifgeant ou moins réceptif à ce genre de jeux. Possible que ça soit moins bien.",
    "timestamp": 1759356000
  },
  {
    "username": "dougfoolery",
    "rating": 6.0,
    "comment": "Faster but just as addictive as the original. Streamlining the trade system vastly improves game flow and accessibility. All three victory conditions are easy to understand but diverse enough to provide an interesting decision space. Choosing between advancing your own goal or blocking your opponent's is just as agonizing as before. The game ramps up in tension from round to round, often leading to a cinematic ending that will leave you wanting another go.",
    "timestamp": 1759356000
  },
  {
    "username": "dtmoney75",
    "rating": 6.0,
    "comment": "1 Play\n\nPlayed at: 2",
    "timestamp": 1758924000
  },
  {
    "username": "larrydurbin",
    "rating": 7.0,
    "comment": "Liked most of this game , but really disliked the unnecessarily mean area control. Sold it.",
    "timestamp": 1762470000
  },
  {
    "username": "paulkessels",
    "rating": 7.0,
    "comment": "Basically the same as 7 wonders duel. Thematic I prefer the original though.",
    "timestamp": 1762383600
  },
  {
    "username": "silenceisgolder",
    "rating": 7.0,
    "comment": "Smoother than the original with a couple of interesting new twists. Managing the tension of the three Victory conditions while also trying to develop your economy while also trying to manage the options available to you and your opponent is just a lot of goodness packed into a really smooth system.",
    "timestamp": 1762124400
  },
  {
    "username": "validcat",
    "rating": 7.0,
    "comment": "Top!",
    "timestamp": 1762038000
  },
  {
    "username": "Bethobrien",
    "rating": 8.0,
    "comment": "Game category: engine building",
    "timestamp": 1762639680
  },
  {
    "username": "John501",
    "rating": 8.0,
    "comment": "Games this quick are usually not this satisfying. Duel For Middle Earth hits a sweet spot. The LOTR setting (which is otherwise wholly pasted-on) is brought to life in striking style via Dutrait’s splendid illustrations.",
    "timestamp": 1762297200
  },
  {
    "username": "jennazaid7",
    "rating": 8.0,
    "comment": "Mine",
    "timestamp": 1762210800
  },
  {
    "username": "majicbaby",
    "rating": 8.0,
    "comment": "+Allies expansion",
    "timestamp": 1762124400
  },
  {
    "username": "CarsonChandler",
    "rating": 9.0,
    "comment": "Instant buy for me, maybe the first ever? It's good. Granted, I am the target audience as a fan of LOTR and 7 Wonders Duel. So tense every time I play it. It is pretty swingy, and I think that brings it down a notch for me, but that's also why it's so tense to play. Also, the art is phenomenal.",
    "timestamp": 1762650900
  },
  {
    "username": "louisj2016",
    "rating": 9.0,
    "comment": "2p",
    "timestamp": 1762640640
  },
  {
    "username": "pintman",
    "rating": 8.5,
    "comment": "Auch wenn ich kein großer Fan vom Herr der Ringe bin, hilft die Thematik, tiefer in das Spiel eintauchen zu können. So ist das Spiel immer ein schöner Begleiter für Urlaube, der sehr gut für 2 Personen funktioniert.",
    "timestamp": 1762640340
  },
  {
    "username": "Lindemann08",
    "rating": 9.0,
    "comment": "En solo",
    "timestamp": 1762631040
  },
  {
    "username": "Sly_Quick",
    "rating": 9.5,
    "comment": "+ Allies Expansion\n+ Promos Grond/The Shire Location Tiles\n\n(3D Printed Insert)",
    "timestamp": 1762470000
  },
  {
    "username": "Raffaelo",
    "rating": 10.0,
    "comment": "One of my favorite games! Just incredible good and fun to play",
    "timestamp": 1762297200
  },
  {
    "username": "Bateyes",
    "rating": 10.0,
    "comment": "Ich habe:\n- Basisspiel (gekauft auf der Spiel 2024).\n- Verbündete (gekauft auf der Spiel 2025) (in Basisspielpackung) (Kleine Erweiterung).\n- Das Auenland Promotile (The Shire) (in Basisspielpackung) (gekauft auf der Spiel 2025) (Promo).\n- Rammbock Promotile (Grond) (in Basisspielpackung) (gekauft auf der Spiel 2025) (Promo).\n\nSleeves: Swan Panasia 54x85mm.\n\nZu bestellen und ersetzen: Paladin Bedivere (54x86mm).",
    "timestamp": 1762210800
  },
  {
    "username": "zabivan",
    "rating": 10.0,
    "comment": "Не думал, что скажу такое - но эта версия превосходит во многом свою старшую сестру \"7чд\". Более простые правила: теперь нет подсчета победных очков, а есть три условия победы - помимо уже знакомых по старшей сестре зеленых карт, это контроль регионов и трек кольца. Думаешь, практически как в шахматах - каждое твое решение влияет на расстановку сил",
    "timestamp": 1762210800
  }
]