[
  {
    "username": "LittleIskender",
    "rating": 1.0,
    "comment": "actually a good game but pointing is fucked up",
    "timestamp": 1760652000
  },
  {
    "username": "Boardgamer80",
    "rating": 1.0,
    "comment": "If you are the 3rd r 4th player, you can only follow. 2 animal tiles were never available and you can only change landscape tiles but not animals. Start with the wrong animal type and you are doomed. I don't understand why this game gets such votes while it is just sheer luck and starting position that determines your chance of winning.",
    "timestamp": 1750370400
  },
  {
    "username": "lililililil",
    "rating": 1.0,
    "comment": "Casual",
    "timestamp": 1747432800
  },
  {
    "username": "bernstein82",
    "rating": 1.0,
    "comment": "way too simple. interesting for kids aged 7.",
    "timestamp": 1743717600
  },
  {
    "username": "Ludwig3366",
    "rating": 1.0,
    "comment": "On a l'impression de tourner les pages d'un livre d'enfant sur les animaux. Je me suis rarement autant ennuyé à une table de jeu. Revendu",
    "timestamp": 1734476400
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "There's not much tension because everyone's staring down at their personal boards and thinking about scoring combos. Which makes me think about 90s puzzle videogames, and how at the very least they understood that big combos have to be activated.....",
    "timestamp": 1722204000
  },
  {
    "username": "ultimoratio",
    "rating": 1.0,
    "comment": "Back to 1 star\n\n============\n\nThe parallel game between animals and terrain is interesting. Decent game. Increased to 2 stars.\n\n========================\n\nClearly not my thing. The production is very nice, but found the whole game to be incredibly tactical and monotonous.\n\nAt the very least, it didn't ask a lot of my time and rules faff, unlike so many \"light\" games today.",
    "timestamp": 1721253600
  },
  {
    "username": "mac93",
    "rating": 1.0,
    "comment": "demasiado simple y bobito para mi gusto",
    "timestamp": 1713909600
  },
  {
    "username": "zasizo",
    "rating": 2.0,
    "comment": "A mintaépítő, csempelerakó sikerjátékok közül ezt gondoljuk az első olyannak, ahol kötetlen a térbeli építkezés, de azóta rátaláltam a Cascadia elődére, amiből ezt fejlesztették, és a HABITATS érdekesebb, mint a Cascadia.\nA műfajhoz tartozó játékokat szerintem mindig valahogy egy hajszál választja el attól, hogy magányos pasziánszként éljük meg vagy sem. Ha a feladataink mellett a játék eléri, hogy tudunk és kell az ellenfélre is figyelni, akkor a műfajba tartozó játék sikerült, ha meg nem tudja ezt a játékmenet, akkor a mintaépítő játék meditatív szóló játékká válik és a társas magányt erősíti. Az én értelmezésemben egy ilyen társasjáték nem társasjáték, tehát hiábavaló. Márpedig a Cascadia pont ilyen.\n\nElőnyök és hátrányok:\nA tábla nélküli, szabad terjeszkedés miatt itt könnyebb bármit taktikai alapon lerakni. Szabadon építkezhetünk, és ez jó élmény. Emiatt azonban bonyolítani is kellett azon, hogy mi mivel együtt ad pontot, különben nem lenne agytorna. A döntések azonban még így is triviálisak.\n\nSzemélyesen nekem a Cascadia dizájn is messze van attól, amit vonzónak találok, de ez szubjektív. Viccesnek tartom, hogy míg a társasjátékos közösség az egyik játékot elátkozza, amiért annak témája leválik a mechanikáról, a másik játékot egekbe emeli valami miatt, és már nem is zavarja, hogy ugyanúgy otromba módon leválik róla a téma. Mint itt. Mert az absztrakt mechanikára rakott téma tényleg gyenge a Cascadiában. A havas hegycsúcson megjelenő hal tipikus példája, hogy az egész nagyon erőltetett.\n\nEredetileg azt gondoltam, na, majd a Calico-t lecserélem ezzel, ha végre megjelenik, mert a Calicoban eléggé erős a szerencse faktor, ami a végén érezhető legjobban, amikor már szűkösnek érződik a zsákhúzásból származó lehetőség. Pedig a Calico elbűvölően szép, és ott pont a határok miatt válik nagyon nehézzé a játék. A végén ennek érezzük a kellemetlenségét is. Húzózsák esetén azonban egy mintaépítő játékban ez a probléma könnyen jelen van, ha nincs valami kiigazítás is, ami ezt orvosolja.\n\nA Cascadia azonban összeütközés és megerőltetés nélküli gondolkodás. És elképesztően terjengős.\nAmi leginkább hasonlít hozzá, az talán a Kohaku. Ott sincs kötött építési terület, de ott nem célkártyák nehezítik a csempelerakást, hanem maguk a csempék: a kétféle csempetípuson megjelenő, mást mással párosító minták.\n\nA Cascadia az én szememben egy erősen túlértékelt, gyenge mintaépítő. Népszerűsége a Qwirkle sikerére rímel, amely attól eredeti, hogy a dominót újította meg színekkel és formákkal, miközben nem több, mint csevegés közbeni időtöltés, játéknak alig nevezhető könnyűség, annyira egyszerű és felületes. Kiskorúakkal és öreg családtagokkal persze remek.\n\nA fő baj a Cascadiában súlyosabb, mert a Cascadia nem társasági élmény, és miközben könnyűsége az absztrakt játékok élére emelte, az igazán jó absztrakt játékok alig észrevehetők mellette. Utóbbi persze a tömegízlés látlelete, nem érték kategória. A BGG rangsora az eladást segíti, és pont annyira súlytalan, mint az iMDb-n a legjobb filmek sorrendje, aminek a legjobb filmekhez tényleg semmi köze. :-)",
    "timestamp": 1760220000
  },
  {
    "username": "Rasp727",
    "rating": 2.0,
    "comment": "Probably one of the most boring and inconsequential games I’ve ever played.",
    "timestamp": 1734217200
  },
  {
    "username": "cascadianski",
    "rating": 2.0,
    "comment": "after i finished, i didn't even care to tally my score. i just didn't care anymore. the game never hit a point where things got interesting. multiplayer solitaire is not my scene.",
    "timestamp": 1676242800
  },
  {
    "username": "pkulczynski",
    "rating": 2.0,
    "comment": "Boring",
    "timestamp": 1665525600
  },
  {
    "username": "koalaguy4566",
    "rating": 2.0,
    "comment": "I can't believe how much I dislike this game. It's sooooo boring. Just a bunch of random nonsense. I had the misfortune of playing this game at 4-players and I suspect that I might like the game a little more at 2-players.\n\nThe game is just way too random and doesn't have anything exciting going on. There's no hidden scoring objectives (aka there's nothing at stake). All the turns feel the same. Repetitive, boring, rinse, repeat.\n\nWorst of all, there's no way to plan out your turn in advance, so the AP keeps ramping up as the game goes on. BORING. WAIT. BORING TURN. WAIT SOME MORE. BORING TURN.\n\nUGH.",
    "timestamp": 1662501600
  },
  {
    "username": "Jdcnl",
    "rating": 2.0,
    "comment": "This game is a solo puzzle and doesn't really feel like a game. Really didn't like what I played.",
    "timestamp": 1652047200
  },
  {
    "username": "marcodegoede",
    "rating": 2.0,
    "comment": "Boring, Solo game with other people on the table. Not interactive. Point soup. Would not recommend it.",
    "timestamp": 1651960800
  },
  {
    "username": "northwayjohn",
    "rating": 2.0,
    "comment": "not for me",
    "timestamp": 1642806000
  },
  {
    "username": "Euroman",
    "rating": 3.0,
    "comment": "Another Multi-Player Solitaire\nA festival of luck. If the right tiles and animals come up on your turn, you win. No player interaction AT ALL! Gameplay is annoyingly repetitive. One of the most overrated games I've ever played. It is boring and lacks any sense of suspense or fun. I really want to rate this a 1. I question anyone who likes this game. Do you like board games, or do you like jigsaw puzzles?",
    "timestamp": 1762564140
  },
  {
    "username": "Ephorus",
    "rating": 3.0,
    "comment": "What I like:\n- Very casual and puzzly.\n- Enjoyable as long as turns are taken fast.\n- Changeable animals goal cards increase variability so that animal patterns may change each game.\n\nWhat I dislike:\n- Close to no interaction if you're not willing to monitor the other player tableaus.",
    "timestamp": 1762038000
  },
  {
    "username": "Schr0dinger85",
    "rating": 3.0,
    "comment": "Yet another multiplayer solitaire with an animal theme.\nIt can induce AP, thus prolonging the agony.",
    "timestamp": 1761519600
  },
  {
    "username": "Zengoeroe",
    "rating": 3.0,
    "comment": "Just placing tiles and animals to score the most points. It's barely a game, or maybe I should say, it's barely a game to me. I can't even pitch one good thing to other people about this.\n\n* 2025 : I have to adjust my comments about Cascadia,\nthere is one good thing about this game, it's easy to play, the rules are very simple.\n\nFor me the mechanics of Azul bring more tension to the table than Cascadia.",
    "timestamp": 1753999200
  },
  {
    "username": "Lyke53",
    "rating": 3.0,
    "comment": "Played this once, pretty boring. There's nothing inherently wrong with this game mechanically, I just think it doesn't do anything new, (which isn't a bad thing) but it also feels a lot like a lot of other games I've played before that I would rather play. Kinda overrated.",
    "timestamp": 1751407200
  },
  {
    "username": "Scifi66",
    "rating": 3.0,
    "comment": "2 plays and I'm done. If I had to play it would only be with one other player so 2p or nothing. It's a lemonade in summer game drink as you play. Very solo focused. It does have a chill vibe so for couples who dislike conflict this would be a plus. Package is pretty, objectives are mostly clear and the game doesn't take forever but it is all staring at your own boards or waiting for someone else to take the turn. Better with less players.",
    "timestamp": 1750716000
  },
  {
    "username": "TForever",
    "rating": 3.0,
    "comment": "This is a light game. It you play for 30 minutes, it's filler game. Tile placement, and the game gives you some goals to reach for, but you get in each other's way. It's okay.",
    "timestamp": 1744408800
  },
  {
    "username": "spencyrrh",
    "rating": 3.0,
    "comment": "2023-04-17 (1 play at 2): Light, pretty, pacey and short enough not to incur my ire for lacking interaction, flow, theme, or mechanical interest. I can see the appeal of focussing on this puzzle after work.\n\nThe scoring seemingly insists on keeping things as close as possible. We tied on our first game. Even modern Euros usually offer significantly more dynamism.",
    "timestamp": 1744236000
  },
  {
    "username": "Geor9eX",
    "rating": 3.5,
    "comment": "1.85 Cmplx/18th",
    "timestamp": 1762383600
  },
  {
    "username": "mbick",
    "rating": 4.0,
    "comment": "I think this is just about the best casual game for playing with people who do not like board games. That said it is still a bad game, given that there is little to no player interaction.\n\nA lot of people seem to think Wingspan, for example, fits this niche well. I think Cascadia does it infinitely better. Cascadia finds the right balance between allowing for casual, relaxing play and providing an interesting puzzle. Moreover, it has very simple rules that are logical to non-boardgamers and easy to explain.\n\nLike Wingspan, there is a lot of randomness. However, the randomness in Cascadia does not prevent one from making long-term strategic plans. It does however allow one to play more by feel than other mechanically intricate games. Cascadia also shares the broadly appealing nature theme and great artwork that Wingspan has.",
    "timestamp": 1761084000
  },
  {
    "username": "btasam",
    "rating": 4.0,
    "comment": "My frustration with these types of games lies in the institutionalized activity of a pseudo-peaceful experience. There's hardly any thwarting but in fact, a mutual agreement to share together in the navigating of variable scoring thresholds.\n\nOh, how you doing over there?\nNicely done\nShucks, I really wanted that salmon.\n\nGames like this tend to be more suitable with smaller player counts because the drafting paired with the scoring is just too chaotic. Cascadia is definitely better than Calico, but still suffers from some of the same issues like getting out-drafted by the player to your right when a token finally makes an appearance after a while. Both designs can learn from Azul which creates dynamic drafting and the ability to assess what your opponents need quickly.",
    "timestamp": 1759874400
  },
  {
    "username": "mojopet99",
    "rating": 4.0,
    "comment": "I really gave it the food 'ol college try and have played it at least 1/2 a dozen times, but each time I find it boring.\n\nAlso, in the two and three player games, I wish they indicated which tiles to use somehow - like in with dots on the front. Sometimes I just need a d**n salmon tile and I don't even know if there is one left in the draw pile.",
    "timestamp": 1758146400
  },
  {
    "username": "Dobroso",
    "rating": 4.0,
    "comment": "Schickes Plättchenlegespiel. Das Material ist wirklich toll.\nSolo ziehe ich Dorfromantik aber vor.\nAls tiefenentspanntes Familienspiel ab 2P vielleicht ganz nett. Allerdings ist es mir zu langweilig. Keine Action, keine Interaktion, keine Spannung.\nFür Kinder in meinen Augen absolut nicht geeignet, da viel zu langweilig. Unsere drei Kinder würden es nur spielen, um die schönen Holzplättchen in den Händen zu halten und planlos anzulegen.\nFazit: Wer diese Art von Spielen mag, hat hier materialtechnisch und spielerisch sicher ein Highlight. Ansonsten für uns recht \"dröge\". Bin mir noch nicht sicher, ob es in der Sammlung bleibt.",
    "timestamp": 1756072800
  },
  {
    "username": "Mijjy",
    "rating": 4.0,
    "comment": "Take & Make multiplayers solitaire",
    "timestamp": 1752357600
  },
  {
    "username": "BggTroll",
    "rating": 4.0,
    "comment": "solo, sold",
    "timestamp": 1750888800
  },
  {
    "username": "TheRook",
    "rating": 4.0,
    "comment": "Point salad scoring system becomes too complex and creates too much AP for a casual game. Was hoping for something a little more relaxing.",
    "timestamp": 1747951200
  },
  {
    "username": "grasa_total",
    "rating": 5.0,
    "comment": "I liked seeing where (I suspect) so many of the tics in the modern take-and-make genre had come from. And this has a few less-imitated tricks up its sleeve, like the tiles requiring a partial, usually not total, commitment to which animals might go there. But in the end for me it still bore the curse of the take-and-make -- players ruined each other's plans frequently, and yet almost never meant to. I would usually rather play a game of totally isolated striving than one which works like that.\n\n[1 play]",
    "timestamp": 1762658100
  },
  {
    "username": "MorelliBuendia",
    "rating": 5.0,
    "comment": "Similar to Calico. Multiplayer solitaire game of making patterns. Not my type of game, but a very clever design, and the difficulty can be adjusted to make it quite the brain-burning experience.\n\nMogul Scale: 2/A.",
    "timestamp": 1761692400
  },
  {
    "username": "Slaverzguild",
    "rating": 5.0,
    "comment": "\"Cascadia\" is a fine tile laying game, but I feel as though I've done it all before. It's too light for what it's trying to do. Playing the animal tokens in patterns while keeping your terrain regions together is far too easy. I've played too many games become slow and tedious because no one wants what's available but none of the conditions to reset have been met.",
    "timestamp": 1761084000
  },
  {
    "username": "thierrydms",
    "rating": 5.0,
    "comment": "niet de mooiste design\nGespeeld 12.7.2022 en verloren. Ik was niet zo enthousiast.\nHerspeeld Vives (Piet, Franky, Jef, Peter) 17.9.2025, uitbreiding Landmarks.\nTerug niet zo entoesiast (layout, spelmechanisme, weinig interactie, moeilijke opdrachten, alles zeer moeilijk te combineren, hierdoor gebrek aan spelplezier …). En terug verloren!!\nMoeilijk te begrijpen dat het zo goed loopt en verkoopt!\nGespeeld 17.10.2025 bij Maria en Fernand. Maria zeer enthousiast (en gewonnen). Ik vond het iets beter, maar nog steeds geen grote fan.\nToch een 5 ipv 4 ?",
    "timestamp": 1761084000
  },
  {
    "username": "Bobekistan",
    "rating": 5.0,
    "comment": "Chillax vibes based setting with fun pieces to manipulate. It's nice to sit around and not have to brain too much. Just take tiles and animals, place them together to match some basic scoring opportunities, maybe if you're lucky you'd even get to hate draft, but it's less hate and more friendly jab draft.\n\nBut for me this is just a little too chillax, a little too mathed out. The play by play is satisfying enough, but the end result is a bit like staring at a half finished canvas and wondering if it was worth it?\n\nIt's hard to justify it sitting on my shelf when I have more fun playing something like Cascadero or Ride the Rails which have similarly light rules loads.",
    "timestamp": 1760047200
  },
  {
    "username": "Patknez",
    "rating": 5.0,
    "comment": "Cascadia should have been right up my alley. I wanted to like it and tried really hard to. The core of the game is there, the looks are there, and so is the challenge of getting the right things in the right places.. but in the end it was one thing that sticks with me... one of the hexes is for a prairie salmon. There isn't even water on the tile and for some reason my brain can only remember that.\n\nMechanically it is a great game and most people really like it. I even understand why they do.",
    "timestamp": 1759356000
  },
  {
    "username": "FirstToFall",
    "rating": 5.0,
    "comment": "Meh",
    "timestamp": 1758837600
  },
  {
    "username": "frostypenguinz",
    "rating": 5.0,
    "comment": "Just an alright game. Simple to teach, simple to play, but it is a bit lifeless. You can make it as casual or strategic as you want, I suppose, but it's not really for me. There are lots of other abstract games I like more.",
    "timestamp": 1758405600
  },
  {
    "username": "thecorsetmaker",
    "rating": 4.5,
    "comment": "A nice tile laying game, but nothing spectacular and feels quite dated. Still not quite sure how this won the SdJ when Calico was not even short listed and it is the superior game. The subsequent Verdant is a huge improvement on the entwined drafting mechanism.",
    "timestamp": 1758405600
  },
  {
    "username": "NotTasty",
    "rating": 5.0,
    "comment": "Harmonies mogs this game",
    "timestamp": 1757887200
  },
  {
    "username": "dale12",
    "rating": 5.0,
    "comment": "Not a bad game, I would play it if someone requested it, but would I would not be the one to suggest it. How in the world is this game ranked 79 and number 1 abstract game?!",
    "timestamp": 1757714400
  },
  {
    "username": "dreamer1789",
    "rating": 5.0,
    "comment": "Very nice family game. However, at this price point I was expecting a whole lot more game for my buck.\n\nMaybe Cascadia: Alpine Lakes will be better.",
    "timestamp": 1756072800
  },
  {
    "username": "rharn",
    "rating": 5.0,
    "comment": "Fine game, but too much of a multiplayer solitaire for me to want to play regularly.",
    "timestamp": 1755900000
  },
  {
    "username": "chickenwang",
    "rating": 5.0,
    "comment": "print",
    "timestamp": 1755208800
  },
  {
    "username": "SKN_TNS",
    "rating": 5.0,
    "comment": "I feel like its hard to do what you want in this game.",
    "timestamp": 1754431200
  },
  {
    "username": "KyberPearl",
    "rating": 5.0,
    "comment": "Finally got my hands on this one! Ended up buying upgrades for the animals and nature tokens.\n\nCost: $?\nToken upgrades: $32",
    "timestamp": 1753135200
  },
  {
    "username": "darthboywonder",
    "rating": 6.0,
    "comment": "A serviceable but unexciting tile layer. The definition of inoffensive. There's some interesting trade-offs to be had and a fine spatial puzzle to navigate but nothing that's going to get your Spidey sense tingling. Also, for a nature game, it's surprisingly lackluster in its presentation. I much prefer Harmonies for a game of similar length and vibe.",
    "timestamp": 1762383600
  },
  {
    "username": "pfQ03",
    "rating": 6.0,
    "comment": "A household favorite, and even if I don't share the same appreciation, I don't mind the spatial puzzle and the light-yet-sometimes-fierce competition for terrain majorities.\n\nShelf: CG",
    "timestamp": 1761343200
  },
  {
    "username": "hall0n",
    "rating": 6.0,
    "comment": "Another harmless knitting club game, there are a dime a dozen. Here you juggle two types of spatial puzzles: landscapes and animals. Try to make the best of what you get and at the end see what everyone has knitted. Very tactical as available tiles and/or animals change between turns. Not very stressful, as you can always use some tile and/or animal for something productive. (23.10.2025)",
    "timestamp": 1761170400
  },
  {
    "username": "wallyg",
    "rating": 6.0,
    "comment": "Played a few times. Little (but not quite no) player interaction.",
    "timestamp": 1760911200
  },
  {
    "username": "wooloo1",
    "rating": 6.0,
    "comment": "Yawn.",
    "timestamp": 1760824800
  },
  {
    "username": "ditterio",
    "rating": 6.0,
    "comment": "Too relaxing for me.",
    "timestamp": 1759960800
  },
  {
    "username": "HughCross",
    "rating": 6.0,
    "comment": "you have 20 points to score the most points, yay! That's about it. Not as relaxing for me, and i crave the tension of strategy.",
    "timestamp": 1759874400
  },
  {
    "username": "Andural69",
    "rating": 6.0,
    "comment": "Good, but after a few plays I feel like I've seen it.I I wish there was more variety",
    "timestamp": 1759528800
  },
  {
    "username": "iplaybgnaked",
    "rating": 6.0,
    "comment": "Very pleasant family weight drafting tile laying point salad that presents an interesting enough puzzle for its playtime. While it presents a lot of potential ways to earn points, the scoring is tight enough that proper placement of the tiles and hate drafting becomes significantly meaningful while still being loose enough to give the game a casual appeal. The game offers enough luck mitigation that you never feel frustrated with your options or mad that your opponent got lucky. That said, the game does still suffer from the same \"the perfect combo piece gets revealed for my opponent after whatever I took\" issue that many similar games are hurt by.\nI still find this one to be the best of the \"take & make\" type of games, but I'm just cooling on the genre in general.",
    "timestamp": 1758060000
  },
  {
    "username": "Arial_Narrow",
    "rating": 6.0,
    "comment": "Un euro de patrones quizá un poco por encima de la media. Recomendable para quien le gusten esos juegos.",
    "timestamp": 1757282400
  },
  {
    "username": "bhudson1972",
    "rating": 5.5,
    "comment": "A fine game. Friendly theme. Nice components. The game feels a little long for what it is. Those that like tile placement, map building and trying to match up icons will enjoy. I think there are other, similar games that do this better.",
    "timestamp": 1756764000
  },
  {
    "username": "TheGoddamnDuke",
    "rating": 6.0,
    "comment": "Fairly good family game, the main issue is the poor interaction.",
    "timestamp": 1756764000
  },
  {
    "username": "Kovie2",
    "rating": 6.0,
    "comment": "One of the better family puzzle games I played. Doesn't get played as often, but I enjoy it whenever I do. Wish the tiles were as pretty as the card artwork, but the graphic design is clear and functional.",
    "timestamp": 1756591200
  },
  {
    "username": "FaseMenosUno",
    "rating": 6.0,
    "comment": "Precio de compra: 40. Precio de venta: 24. Total: 16",
    "timestamp": 1756504800
  },
  {
    "username": "Vinetou",
    "rating": 6.0,
    "comment": "Basic game is too basic. With some expansions it becomes a bit better strategically.. It doesn't seem that random at first but it is quite random.\nPlayer interaction almost non existant.",
    "timestamp": 1756418400
  },
  {
    "username": "Kottis",
    "rating": 6.0,
    "comment": "SELGE?",
    "timestamp": 1756418400
  },
  {
    "username": "Fabianozoth",
    "rating": 7.0,
    "comment": "Deutsch",
    "timestamp": 1762693440
  },
  {
    "username": "samseite",
    "rating": 7.0,
    "comment": "[Traded]\n+150k to Kutna Hora",
    "timestamp": 1762691040
  },
  {
    "username": "Lindemann08",
    "rating": 7.0,
    "comment": "En solo",
    "timestamp": 1762630920
  },
  {
    "username": "Garath_",
    "rating": 7.0,
    "comment": "Another tiles placement game, with a nature theme.\nEasy to teach, less than 1h play, good puzzling for the mind.\nI would clearly suggest it in the right context.",
    "timestamp": 1762383600
  },
  {
    "username": "sentient_blanket",
    "rating": 7.0,
    "comment": "Really solid multiplayer solitaire/drafting game. A calm and peacful 30 minutes, and fun decisions that never tip into AP territory too much.",
    "timestamp": 1762383600
  },
  {
    "username": "agn1929",
    "rating": 6.8,
    "comment": "*Mostly played at two players.\n+Decent art\n++Somewhat interesting but light dynamic tactical optimization puzzle.\n\n-Games sometimes seem artificially close from high amount of randomization. As long as you and your opponent play decently competently, the point difference between you and your opponent can basically be down to a coin flip.\n\n-You can get screwed by bad tiles, whose composition for a game you do not know and which you cannot affect directly; you can only sometimes pick unmatched token and tile pairs to mitigate this to an extent.\n\nOverall: 6.75/10 -- Decent",
    "timestamp": 1762297200
  },
  {
    "username": "Dragonmaster256",
    "rating": 7.3,
    "comment": "7.5 for Alex, 7 for Cye",
    "timestamp": 1762210800
  },
  {
    "username": "kimgun0220",
    "rating": 7.0,
    "comment": "캐스캐디아",
    "timestamp": 1762038000
  },
  {
    "username": "Bethobrien",
    "rating": 8.0,
    "comment": "Game category: tile placement",
    "timestamp": 1762638600
  },
  {
    "username": "Kristhgr",
    "rating": 8.0,
    "comment": "Great game!",
    "timestamp": 1762470000
  },
  {
    "username": "Herzer",
    "rating": 7.5,
    "comment": "Las expansiones lo mejoran\n\nCambio por Toy Battle",
    "timestamp": 1762383600
  },
  {
    "username": "KingsxGuardian",
    "rating": 7.5,
    "comment": "Erica: (10/10)",
    "timestamp": 1762297200
  },
  {
    "username": "WardenOfDoom",
    "rating": 8.0,
    "comment": "Own Digital IOS\nExp In This Box:\n● Cascadia: Landmarks (2023)\n.",
    "timestamp": 1762297200
  },
  {
    "username": "solitaryquest",
    "rating": 8.0,
    "comment": "One of my favorite abstract strategy games for its combination of straightforward gameplay and strategic depth. I appreciate the light interaction between players, being able to draft tiles that would be more favorable to another player, or strategically wipe the slate. I find each game starts out exciting as players work out their scoring avenues, but sort of becomes a drafting slog towards the end. Prefer multiplayer to solo.",
    "timestamp": 1762210800
  },
  {
    "username": "tuxskin84",
    "rating": 8.0,
    "comment": "Inserto fet i pujat a la BGG",
    "timestamp": 1762124400
  },
  {
    "username": "brazwhazz",
    "rating": 8.0,
    "comment": "A Calico killer made by the very makers of Calico.",
    "timestamp": 1762124400
  },
  {
    "username": "purvisa",
    "rating": 9.0,
    "comment": "This went from a perennial almost-bought, based on the box and description that just came up short, to a favorite and the first game I have rated a 10 here on BGG. That rating has now fallen to a 9, though.\n\nThis is the holy grail of games for me: a simple game that is fast, fluid, and full of opportunities for both strategic and tactical plays. While the game is inherently competitive, it is not necessarily loaded with backstabbing and nastiness.\n\nEach player gets a starting tile comprised of three hexagons arranged around a central point. One is a keystone tile (one of the five animal types and one of the five habitat types), and the other two are each two habitat types such that all five appear between the hexagons, and between them all five animal types (two on one and three on the other, including the keystone species from before). These are all of the possible combinations (one each habitat and animal, two habitats and two animals, and two habitats and three animals).\n\nThe game comes with 83 tiles, and a game requires 20X+3 tiles, where X is the number of players, so a 3-player game uses 63 tiles. Players put out four tile-animal combinations, and when it is a player's turn, that player takes one pairing, placing the tile and, if possible and desired (almost always) placing the animal. The tile can go anywhere, but larger sections of orthogonally adjacent habitat types score more points. Animals may only be placed on a habitat that has the appropriate animal symbol.\n\nWhen you play an animal on a keystone tile, you get a pine cone that you can use later to pick a tile from one pairing and an animal from another.\n\nWhile you score for the habitats in the largest corridors you create, you also score by placing the various species into configurations from randomized cards for each animal type. Between these two forces, the game never repeats.\n\nSetup takes a couple of minutes, and rebooting takes even less time. Scoring takes only a couple of minutes as well, and gameplay is so quick that players can squeeze in a couple of games in less time than many other games they likely own.",
    "timestamp": 1762470000
  },
  {
    "username": "austinlolo",
    "rating": 9.0,
    "comment": "Must have !",
    "timestamp": 1762470000
  },
  {
    "username": "Thorin81",
    "rating": 9.0,
    "comment": "w kolekcji:\n- Pomniki Przyrody",
    "timestamp": 1762124400
  },
  {
    "username": "Sly_Quick",
    "rating": 9.4,
    "comment": "+ Landmarks Expansion\n+ Promos Kickstarter Scoring Card Pack & Landmarks Scoring Card Pack\n\n(Folded Space Insert)",
    "timestamp": 1761951600
  },
  {
    "username": "Connduit",
    "rating": 8.5,
    "comment": "2-4",
    "timestamp": 1761951600
  },
  {
    "username": "Kater_Inna",
    "rating": 9.0,
    "comment": "2",
    "timestamp": 1761778800
  },
  {
    "username": "Beboy208",
    "rating": 9.0,
    "comment": "Steam",
    "timestamp": 1761778800
  },
  {
    "username": "Svtx_08",
    "rating": 8.5,
    "comment": "Owned - Noël 2024",
    "timestamp": 1761692400
  },
  {
    "username": "EpicFrenzy",
    "rating": 9.9,
    "comment": "Really enjoyed my first playthrough. Probably because objective fulfilling and tile placement is similar to Isle of cats, though it is hexagon tiles, not polyomino tiles.\n\nOwned now - excellent game. Really puzzling and satisfying",
    "timestamp": 1762210800
  },
  {
    "username": "_wolo_",
    "rating": 10.0,
    "comment": "Enjoy this a lot in \"family version\". If adding more complex cards will scale up to adult experience.\nAdding \"more complex\" cards made game more thinky indeed.\n\nWent up from 8 to 9 and then to 10.\n\nQuick, nice, can be thinky. Love the rule variations . One of a minority of solo games I am happy to play just for points, without win-lose setup.",
    "timestamp": 1762124400
  },
  {
    "username": "Barbune_Ice",
    "rating": 9.6,
    "comment": "This is a sublime game. Easy to learn and play but still has that thinkyness. Going through all the scenarios is a good challenge and takes a lot of plays! Great in so many ways.",
    "timestamp": 1762038000
  },
  {
    "username": "Lourou7",
    "rating": 10.0,
    "comment": "BGG Score - 10 - Outstanding. Always want to play and expect this will never change.\n\nGame description - Personal Puzzle, tile-laying, gateway\nPlayer count 2-4 (Best at 2)\nDuration : 45mins (Max 60mins)\nStrategy :\nLuck ~~X~~ Skill\nComplexity for beginners :\nEasy ~X~~~ Hard\nInteraction :\nIsolated ~X~~~ Involved\n\nRating -\nGameplay : 5/5\nReplayability : 5/5\nArt & Theme : 5/5\n\nReview\nA perfect game for non-gamers, and gamers alike. One of the most satisyfing, engaging and social personal puzzle games on the market. The interchangebale point cards add some much needed variety and a decent range of complexity levels.\n\nYou almost never feel like you are out of options, and the ability to cull animals with nature tokens and when you have over population is exciting everytime for all players around the table. If I could only keep 5 games, Cascadia (along in with it's expansion) would definitely stay, no questions asked",
    "timestamp": 1762038000
  },
  {
    "username": "CatnipTheGrey",
    "rating": 9.6,
    "comment": "Must have in any starting collection. Equally fun as a cosy game or as puzzly challenge",
    "timestamp": 1761692400
  },
  {
    "username": "Napattack",
    "rating": 9.5,
    "comment": "1.85\n1-4\nBest at 2-3\n45 (1,125)\n#28",
    "timestamp": 1761692400
  },
  {
    "username": "Lozar",
    "rating": 10.0,
    "comment": "Best abstract, beautiful and easy to learn tile drafting game. Get the correct tiles and tokens to make the best ecosystem and score the most with your wildlife and habitats. Works perfect solo and with any number of players, one of my all time favorites.",
    "timestamp": 1761429600
  },
  {
    "username": "VFG66",
    "rating": 10.0,
    "comment": "Un excelente juego abstracto que disfruto mucho ya sea para jugar sola o en grupo",
    "timestamp": 1760565600
  }
]