[
  {
    "username": "QueenOfBread",
    "rating": 1.0,
    "comment": "CGE supports transphobia.",
    "timestamp": 1761778800
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "There's a few cute ideas here, like tokens investing time to get better rewards. It's not all bad!",
    "timestamp": 1730502000
  },
  {
    "username": "M St",
    "rating": 1.0,
    "comment": "Another Tascini horror - painfully overconvoluted puzzles perambulating in pointless patterns on a pretty plan to no particular purpose. Too much work, not enough game.",
    "timestamp": 1686952800
  },
  {
    "username": "sunyushen",
    "rating": 1.0,
    "comment": "还没玩明白，摸索中",
    "timestamp": 1679612400
  },
  {
    "username": "Frozen Flesh",
    "rating": 1.0,
    "comment": "I came here, because of all the people rating mature themed games like KD:M or Hate with a 1, just because of their mature theme.\nThis games theme is boring!",
    "timestamp": 1547074800
  },
  {
    "username": "ravn1ca",
    "rating": 2.0,
    "comment": "Not worth it",
    "timestamp": 1752357600
  },
  {
    "username": "enbycass",
    "rating": 1.5,
    "comment": "The game itself is an inventive worker placement game so let's say a 6.5.\n\nTheme is -5 for getting Maya civilization and culture so incredibly wrong. There's not even an actual Tzolk'in in the game at all and it's clear the designers not only knew nothing about the subject matter, but didn't even bother to do cursory research on Wikipedia. I've read a couple articles about what this game gets wrong and they don't even get into the worst of it, honestly.\n\nI really expected this game would at least include the Mesoamerican 260 day calendar considering of 13 numbers and 20 day signs as part of its core mechanic, but no. The Aztec Sun Stone used as a decoration on the center wheel includes a ring of the 20 Nahua day signs, but 1) that is not at all Mayan - the Maya have their own 20 day signs, 2) it's a symbol of the Aztec state so it's not just not Mayan, but it's one of the most famous artifacts of Aztec civilization, and 3) the wheel in the game has 26 spokes, not 20, and doesn't include day signs at all. The game is called tzolk'in but literally has no tzolk'in in the game.\n\nI could go on and on about little things like crystal skulls being complete European fabrications, the weird mixture of Maya and Aztec deities, the cities in the game being active at wildly different periods in history, or the pictures of Maya cities being associated with the wrong cities, but really nothing is as absurd as the game but including an actual tzolk'in.",
    "timestamp": 1746482400
  },
  {
    "username": "dangardavid",
    "rating": 2.0,
    "comment": "While this game is mechanically sound and well produced it suffers from the cardinal sin of hobby gaming. It's not fun. I suppose I should say that I'm not a big fan of \"pure\" worker placement games. Meaning worker placement with no other mechanics. Too many turns where what I could do was not exciting and/or interesting. I can see how over repeated play one could get to understand the synergies better but I can't see how that would make it more fun. I played a 4 player game where the eventual winner scored very little points during the game and just bounded to victory from the end-game bonuses. He ignored two of the wheels entirely and just pumped the resources in order to get end game bonuses. A valid approach and effective, but if you can ignore half of the game and still win then something's off. It also took 3 hours to play, a third of the way in I was done with it and mentally checked out. I will never play this game again.",
    "timestamp": 1721253600
  },
  {
    "username": "Splasheslass",
    "rating": 2.0,
    "comment": "Borrowed of Sarah March 2024\n\nTo complex for me to teach and learn. I would need someone who knows how to play help me.\n\nI did make it through a game and I understood the basics of placing workers and taking them off and I understood the rotation.\n\nBut all the extra stuff was really hard to memorise or keep having to check the rules.\n\nWeight 3.76 maybe a bit much for me",
    "timestamp": 1713218400
  },
  {
    "username": "Dagless15",
    "rating": 2.0,
    "comment": "Progress isn’t made through shared incentives, just the passing of time… Which isn’t particularly interesting to me. Limited availability as the primary antagonist. Not particularly interesting to me. Strategic interplay of waiting with little overlap and or impact on opponents past surface blocking.\n\nI’m sure there is some entertainment in mining strategies and maximising potential scoring game to game, but this just felt like the gimmick was playing the game a bit, and it would quickly fall apart without it. This obviously makes sense when time passing is a key mechanic in the game, with consideration of always making sure someone is available to take or place without interrupting grand plans, but when the base is a typical WP Without much interest, a gimmick won’t save it. Can’t imagine playing it enough for the structure to be satisfying.",
    "timestamp": 1684015200
  },
  {
    "username": "darkfinale",
    "rating": 3.0,
    "comment": "Other nicer games I would like to play. Played once on BGA. Artwork not my type but game seems to flow smoothly. Need more plays.",
    "timestamp": 1744495200
  },
  {
    "username": "wynarator",
    "rating": 3.0,
    "comment": "This game is probably good, but just not for me - very dry and boring.",
    "timestamp": 1743804000
  },
  {
    "username": "gamer2024",
    "rating": 3.0,
    "comment": "Not for me",
    "timestamp": 1742684400
  },
  {
    "username": "gonesse",
    "rating": 3.0,
    "comment": "just don't like it\n\nbut can see why other do",
    "timestamp": 1742166000
  },
  {
    "username": "parpari",
    "rating": 2.8,
    "comment": "This game likes sand box to created sand castle but also, gives players tool to ran over it without any repercussions (cog movements) because there is no real share incentive. Therefore; it makes pointless mental effort to play it.",
    "timestamp": 1739401200
  },
  {
    "username": "SteoanK",
    "rating": 4.0,
    "comment": "Would like to play again!",
    "timestamp": 1760392800
  },
  {
    "username": "logopolys",
    "rating": 4.0,
    "comment": "The moving bits on the board are nice, and really pretty clever. There's some conceptualizing of the future that needs to go on, but beyond that, the moving bits don't add a whole lot. It's a neat game, but there are better Euros.",
    "timestamp": 1759356000
  },
  {
    "username": "gizmobj",
    "rating": 4.0,
    "comment": "Probably ranked as high as it is because it is gimmicky. Game play is ok but I can't see myself ever playing this game again.",
    "timestamp": 1757109600
  },
  {
    "username": "davebo",
    "rating": 4.0,
    "comment": "Pretty overwhelming first play. Perhaps I just need to play it again, but there's a lot of thinking ahead multiple moves which isn't my strong suit. I feel like there's games I like better that do the same thing.\n\nPerhaps I need to play it again.",
    "timestamp": 1749679200
  },
  {
    "username": "EconSean",
    "rating": 4.0,
    "comment": "The cog mechanism is neat, but I believe only serves in obscuring the real upsides and downsides that placing workers has. This is a lot more of a resource management game than a worker placement game. I might play this again, but this was a game where I felt like I lost on the first turn of the game because the tradeoffs in the game that you are making are too hard to see without many plays of the game, which leads to a miserable 3 hour experience. Other games like Agricola have far more safeguards and ways for people to get back into a game and feel like you did something. In this game I did not feel like I did anything by the end.",
    "timestamp": 1739660400
  },
  {
    "username": "abaloo",
    "rating": 5.0,
    "comment": "Gestion de ressources hasardeuse",
    "timestamp": 1760479200
  },
  {
    "username": "Mestail",
    "rating": 5.0,
    "comment": "dislike....",
    "timestamp": 1747519200
  },
  {
    "username": "Grildensnork",
    "rating": 5.0,
    "comment": "Used to think this was really clever. It's still clever; I just can't stand it any more. Frustrating and tedious future-planning with very little pay off.",
    "timestamp": 1745445600
  },
  {
    "username": "TForever",
    "rating": 5.0,
    "comment": "I just think the waiting with worker placement is unnecessary, so I think the game is long for what it is. You either like it, or you don't like it.",
    "timestamp": 1744408800
  },
  {
    "username": "Beastly_Venturer",
    "rating": 5.0,
    "comment": "10+ plays. Good game. Lacked something to make it truly great. Interesting design though. Got a broken strategy though.",
    "timestamp": 1740870000
  },
  {
    "username": "capasso2300",
    "rating": 5.0,
    "comment": "2 Plays since buying it. I already own Teoticuan, so upon digging into the rules and learning Tzolk'in, I basically found i'm playing the same game, with slightly different mechanics.\n\nThere's 3 temple tracks, there's technologies to give you buffs, there is Crystal Skulls instead of building the pyramid, there's corn instead of cacao, there's wood/gold/stone used to construct thigs. They both have a concept of powering up the ability of your workers, by letting them colllect/linger in one area.\n\nThat being said., we enjoyed our playthroughs. The game is full of tough decisions, much like it's sequel. It might be a tougher nut to crack, as far as figuring out a winning strategy.\n\nIs there room for both in the collection? Probably not honestly. The games are far too similar to want to play them both in close succession in my oppinion. I just have to decide which one i like better now.\n\n----3rd play\nI think thats probably our last game. This game play, although filled with analysis paralasis, was enjoyable untill the very end. My wife tallied her points, and i tallied mine, and even tho it looked like she was blowing me out of the water, i inched by between my leading on a couple of the temple tracks, and the end game points one of my monuments had earned me. Then after relishing in the win for a moment, my wife realized that the turn earlier, she never moved up on the temple track when taking an action like she was supposed to....so that changed the outcome to her winning by 1.\n\nNow that kind of thing isn't unusual in board gaming, especially complicated ones with lots of combos. But all three games we've played have been super close, despite vary different strategies. The comlpicated nature of the action wheels, plus the ticking clock on this game board, paired with an outcome that is low scoring, and usually within 5 points.....This game is decidedly not an enjoyable experience for us.\n\nPros: Great idea, good production, interesting decisions, tough puzzle,\n\nCons: ultimately very restrictive, you cant tell who's the winner till the end, AP gets bad in this one, Too many things to do/point salady, and winning is ultimately unsatisfying,",
    "timestamp": 1738623600
  },
  {
    "username": "missdragonara",
    "rating": 5.0,
    "comment": "Too long and a bit dull",
    "timestamp": 1736204400
  },
  {
    "username": "TrentonTron",
    "rating": 5.0,
    "comment": "Based on two 2-player games. Worker placement games generally aren't my cup of tea, but this is a well-designed one for fans of the genre. Not something I'd suggest, but I'd like to see how it plays with 4, which is supposed to be the optimal number of players.",
    "timestamp": 1733612400
  },
  {
    "username": "Peekstrom",
    "rating": 5.0,
    "comment": "Fine but kinda dry",
    "timestamp": 1732489200
  },
  {
    "username": "MeepleSmuggler",
    "rating": 5.0,
    "comment": "Just a bunch of tracks. Very tight game. I don't particularly enjoy the core mechanism - a lot of the game is spent placing workers out and trying to delay removing them, so a lot of turns you're not actually taking any actions.",
    "timestamp": 1730502000
  },
  {
    "username": "Rudbeckia144",
    "rating": 6.0,
    "comment": "Tzolk'in has everything I tend to appreciate in a game - great table presence, multiple paths to victory, tight resource management and that one cool thing (the rotating gears) that differentiate it from all other games out there.\nBut I found the game play to be pretty dry in this one. It just didn't click with me.",
    "timestamp": 1760652000
  },
  {
    "username": "stofke",
    "rating": 6.0,
    "comment": "R014",
    "timestamp": 1758492000
  },
  {
    "username": "Avid_Equinox",
    "rating": 6.0,
    "comment": "+ Great decision space for the number of rules (low rules, highly strategic).\n+/- : lots of options on your turn\n- Strategy is not obvious and you're required to have long-term plans spanning up to the entire game length from the opening: Experienced players will skill-gap newbies with ease at this game",
    "timestamp": 1757973600
  },
  {
    "username": "thealexhopp",
    "rating": 6.0,
    "comment": "Didn't really care for this game. It's needlessly complicated and a bit AP inducing because if you forget to do your actions in the right order you will pass right by which can be frustrating.",
    "timestamp": 1756677600
  },
  {
    "username": "Killi",
    "rating": 6.0,
    "comment": "Decent game. But there are a few broken strategies that ruined it for me.",
    "timestamp": 1756504800
  },
  {
    "username": "DaneTheBeast",
    "rating": 6.0,
    "comment": "Played (TTS)",
    "timestamp": 1755554400
  },
  {
    "username": "LabRat002a",
    "rating": 6.0,
    "comment": "I prefer lighter games. While I can do well at this game and there are certainly interesting choices, it's more complicated than I would like. The wheel is a gimmick and I don't find it that interesting. Nor do the gears remind me of Maya. And a big part of the game is getting to spaces before other players to gain and spend your resources efficiently. And you have to be able to feed your people. There is a lot of tension. But it is very interesting to put out your workers and then decide how long to leave them out before picking them up to take the action on the space they have arrived at. It's also interesting to increase the technology tracks. But I completely forget all the rules between each time we play it.",
    "timestamp": 1751752800
  },
  {
    "username": "jeremysprofile",
    "rating": 6.0,
    "comment": "Suffers from extremely long turns as players are forced to plan 4 rounds in advance when they lock in a piece.",
    "timestamp": 1750629600
  },
  {
    "username": "Antura_V",
    "rating": 6.0,
    "comment": "T",
    "timestamp": 1744236000
  },
  {
    "username": "JosiekJosette",
    "rating": 6.0,
    "comment": "1 four player game.\nThe game dragged a bit. Even when you get used to it, there's an incompressible decision time for each player that makes the game way too long.",
    "timestamp": 1743976800
  },
  {
    "username": "SJS1971",
    "rating": 7.0,
    "comment": "Only played online. I was expecting to love this game, but there's something a bit soul-less about it. (I wonder if that's partly the online aspect.) It feels very math-y, because you have x number of workers and you are timing x turns of the wheels. I often like games of this complexity, but for some reason this has been a math problem I'm not all that motivated to solve. Recent plays have been more fun, however, so this rating could go up if I start grokking multiple strategies I like to pursue.\n\nUPDATE: My appreciation for this one has grown.",
    "timestamp": 1760306400
  },
  {
    "username": "getareaction",
    "rating": 7.0,
    "comment": "Not a game that you can play fast and loose. Requires planning and precision to not score only 9 points as I did in my first game. A smart game. Rating based on one play.",
    "timestamp": 1760220000
  },
  {
    "username": "dtmoney75",
    "rating": 7.0,
    "comment": "11 Plays\n\nExpansions: Tribes and Prophecies, Mini Expansions 1 & 2\n\nPlayed at: 2 & 3",
    "timestamp": 1759701600
  },
  {
    "username": "NateClark",
    "rating": 7.0,
    "comment": "Thought it was gimmicky. It kinda is. Still a fun puzzle though. If you like this try Arborea and vice-versa.",
    "timestamp": 1759615200
  },
  {
    "username": "MorelliBuendia",
    "rating": 7.0,
    "comment": "This is the only Italian eurogame I've played so far, bit I've liked it quite a bit. A bit modern-euroey for my tastes, kind of like Great Western Trail, but for some reason it works. There's quite a few tracks and not as much interaction, but it has interesting decisions and the gears are very cool. Not sure how long it would hold up, but it hits that euro spot without getting too convoluted, so even though I don't own it I'd suggest playing it.\n\nMogul Scale: 3/C",
    "timestamp": 1759528800
  },
  {
    "username": "xWilcoXx",
    "rating": 8.0,
    "comment": "While agonizing over how to pay and feed people strips some of the fun away from the game, it definitely has some very interesting decisions to be made. Need to play more.",
    "timestamp": 1762470000
  },
  {
    "username": "jasonxerri",
    "rating": 7.9,
    "comment": "2-4 Players",
    "timestamp": 1762383600
  },
  {
    "username": "Derianhorgen",
    "rating": 8.0,
    "comment": "SpielboxRating 7-9, av. 8,00",
    "timestamp": 1762297200
  },
  {
    "username": "funnyfishman",
    "rating": 7.5,
    "comment": "2012 - https://boardgamegeek.com/geeklist/338583",
    "timestamp": 1762124400
  },
  {
    "username": "Phyriel",
    "rating": 8.0,
    "comment": "Organizer Cormoran K-DON 1006\npromo:\n- mini expansion 1\n- mini expansion 2",
    "timestamp": 1761692400
  },
  {
    "username": "griffinritmire",
    "rating": 9.0,
    "comment": "Bring to South Africa",
    "timestamp": 1762670820
  },
  {
    "username": "kjbds",
    "rating": 9.0,
    "comment": "Includes\n- Base game\n- Tribes & Prophecies expansion\n- Folded Space insert\n- Geeked Up Bits components\n\n-------\nUnique worker placement, I really enjoy this one",
    "timestamp": 1762383600
  },
  {
    "username": "ditterio",
    "rating": 9.0,
    "comment": "Gespeeld. Heel tof spel.",
    "timestamp": 1761951600
  },
  {
    "username": "mavericklancer",
    "rating": 8.5,
    "comment": "Bought from BGG Marketplace (Local) 3/4/16.\n\nI love how the game uses time as an actual resource. The wheels aren't just a gimmick; they really do create a whole new level of strategy. It does take some time to learn how to play effectively. The only other game that I end up thinking about so much is Terra Mystica.\n\nGood variable starting resources and buildings. Base game suffers from requiring everyone to go temples.\n\nThe expansion makes this even better.\n\n---\nUpdate 3/17/16. Rating changed from 8 to 8.5. We've played this every day this week (5 plays over 5 days). The depth of strategy is similar to Terra Mystica, which means that I constantly want to play it. Play time is 30 - 45 min, meaning it's perfect for mid-week quickies.\n\n---\nUpdate 5/6/16. Rating increased from 8.5 to 9. I still constantly want to play this. I don't get to as much as I want to, and I've really been feeling it.",
    "timestamp": 1761606000
  },
  {
    "username": "DeadFrog",
    "rating": 9.0,
    "comment": "Very tight planning involved. Very unique game mechanic, lots of fun!",
    "timestamp": 1760911200
  },
  {
    "username": "GWondowski",
    "rating": 10.0,
    "comment": "November 2025",
    "timestamp": 1761951600
  },
  {
    "username": "mls75",
    "rating": 9.5,
    "comment": "Beautiful game, in all respects. Tough choices, lots of strategy. Would play any day.",
    "timestamp": 1761865200
  },
  {
    "username": "pwhy5",
    "rating": 10.0,
    "comment": "+ Mini Expansion 1\n+ Mini Expansion 2",
    "timestamp": 1761606000
  },
  {
    "username": "TristanGeeraert",
    "rating": 10.0,
    "comment": "Review based on 19 plays (07/09/2025)\nIncluding:\n- Tribes and Prophecies\n- Promo Tiles\n- Promo Tribe\n\nTzolk'in is simply amazing. What a game! Even apart from the fact that I really like the use of gears in a board game, here they are implemented very cleverly to integrate the aging mechanic in an intuitive manner. Tzolk'in was one of the first heavier games I played when getting into boardgames in 2018 and it still stands as one of my favorite titles. Ever since discovering this game, Simone Luciani and Daniele Tascini are on my radar with regard to their new releases. With a few exceptions they are always a hit!\n\nI whish I could play Tzolk'in more often, but my wife finds it a very punishing game due to the fact that you need corn for both your actions and for feeding your workers. Being low on corn really limits your choices. After each quarter of the game, the obligatory feeding phase may result in a next round where you lost all your corn (and possibly also a lot of VP). Her argument is definitely true: Tzolk'in can be punishing, but it doesn't stop me at all from loving this game.\n\nI think maybe one of its best features is that even after a considerable amount of plays, I'm really not good at the game. It is still a challenge for me to perform well in this game. I know it's possible to achieve much higher scores (based on not just BGG forums, but also the opponents I play against who almost always win the game) but knowing what is possible in Tzolk'in does not mean that I can easily replicate it.\n\nAnother major plus for me is that what you can do in the game is continuously changing based on where your opponents place their workers. It's such a great dynamic experience. I also like the addition of the Tribes from the expansion. Some of them are more difficult to play well, but each Tribe gives you a highly unique player power, which contributes to many different playstyles. Kudos to the designer, as this game is really extraordinary.\n\nOn a closing note, I do also think that Tzolk'in is one of these rare eurogames that plays well at all player counts. Quite an accomplishment!",
    "timestamp": 1761606000
  },
  {
    "username": "bkevans",
    "rating": 10.0,
    "comment": "Everything about this game is fantastic, and the gears! The gears! So very cool. Get the expansion too!",
    "timestamp": 1761519600
  }
]