[
  {
    "username": "JustinRRizzo",
    "rating": 1.0,
    "comment": "Not much of a game.\n\nLast time I played a player ran out so fast (very large straight) I was only able to play 2-3 cards. This happened two rounds in a row, and since it was 3P game that was 66% of the game (each player deals once).\n\nAdded to my hard ban pile.",
    "timestamp": 1762669320
  },
  {
    "username": "Esyhpe",
    "rating": 1.0,
    "comment": "En gros tu reçois des cartes dans un ordre qui t'arrange absolument pas et tu vois ton voisin enchaîner les mains parfaites.",
    "timestamp": 1736463600
  },
  {
    "username": "asfhgwt",
    "rating": 1.0,
    "comment": "I really don't like games where you can't rearrange your hand.",
    "timestamp": 1715810400
  },
  {
    "username": "Orion0224",
    "rating": 1.0,
    "comment": "I do not see the appeal of this game.",
    "timestamp": 1711234800
  },
  {
    "username": "Geor9eX",
    "rating": 1.5,
    "comment": "1.38 Cmplx/20th",
    "timestamp": 1762383600
  },
  {
    "username": "lkeohane",
    "rating": 2.0,
    "comment": "4",
    "timestamp": 1753740000
  },
  {
    "username": "orange",
    "rating": 2.0,
    "comment": "interactive card game, but not interesting.",
    "timestamp": 1746223200
  },
  {
    "username": "wkover",
    "rating": 2.0,
    "comment": "The idea of picking up an opponent's cards is great, but so is democracy and look where that got us.",
    "timestamp": 1703113200
  },
  {
    "username": "darkk_",
    "rating": 3.0,
    "comment": "Scoring cards are difficult to track during play for players who don't calculate scoring while playing.\n\nCaptivating ❌\nEngaging ✅\nReplayability ✅\nRules ❌\nQuality ❌",
    "timestamp": 1761429600
  },
  {
    "username": "ChefPepperJack",
    "rating": 2.6,
    "comment": "I feel like I'm missing something with how high this game is rated. I played it four, maybe five times, and I don't get how it's special. No matter what, almost all hands will be playable extremely quick, and you rarely actually Scout, which is the name of the game.\nThis is here, yet something like Phase 10 is extremely unpopular? What?",
    "timestamp": 1751234400
  },
  {
    "username": "Geekishgamer",
    "rating": 3.0,
    "comment": "Not very fun. I don’t get why people like this one so much.",
    "timestamp": 1749420000
  },
  {
    "username": "jaieless",
    "rating": 3.0,
    "comment": "Genuinely dislike playing this game, awkward to teach for its complexity, and felt choices that I was making weren't fun or interactive\n\nApril 2023 New - May 2025",
    "timestamp": 1747519200
  },
  {
    "username": "Egwood",
    "rating": 4.0,
    "comment": "It's allright, but the hype for this game is just unreal. It's not that good. I wished the game had more to do with flipping the cards.",
    "timestamp": 1762210800
  },
  {
    "username": "Sorlag_XI",
    "rating": 4.0,
    "comment": "CARDGAME",
    "timestamp": 1760220000
  },
  {
    "username": "Nodens",
    "rating": 4.0,
    "comment": "It's a card game. Better if played with a fun elderly couple, as all games are.",
    "timestamp": 1754517600
  },
  {
    "username": "gianlucadario87",
    "rating": 4.0,
    "comment": "pessimo filler",
    "timestamp": 1753740000
  },
  {
    "username": "davidxiang",
    "rating": 5.0,
    "comment": "很火，但我玩起来就无感",
    "timestamp": 1762124400
  },
  {
    "username": "VanguardUK",
    "rating": 5.0,
    "comment": "Photo Box",
    "timestamp": 1761951600
  },
  {
    "username": "Fierezza",
    "rating": 5.0,
    "comment": "Ersteindruck",
    "timestamp": 1757023200
  },
  {
    "username": "rharn",
    "rating": 5.0,
    "comment": "Decision space just isn't very interesting. I constantly felt like I would rather be playing other card shedders/climbers. Linko blows this out of the water, for example.",
    "timestamp": 1756936800
  },
  {
    "username": "AwMar",
    "rating": 5.4,
    "comment": "Wildly overrated. The person with the best starting hand always wins, players have little control and catching up between rounds happens rarely.",
    "timestamp": 1756072800
  },
  {
    "username": "Deus_Ex_Machina",
    "rating": 5.2,
    "comment": "Was probably expecting too much here. A statisfying, quick lightweight game that doesn't feel like a filler. It turned out to be yet another tricktaker in an endless sea of them and I have little idea what supppsedly elevates this one above others. That all aside it's a perfectly fine game, but I was overall pretty meh about it. For what it's worth, I felt similarly about almost all the other smallbox filler tricktaking games I've played.",
    "timestamp": 1755381600
  },
  {
    "username": "RangerFox",
    "rating": 5.0,
    "comment": "Altough it ha s a 2-player variant, it is terrible, I would not recommend it for 2-player... I still have to try it with more people.",
    "timestamp": 1754690400
  },
  {
    "username": "Puglord",
    "rating": 5.0,
    "comment": "It’s fine but at the end of the day I’m not convinced it’s really any better than card game classics like rummy or brag (and it’s certainly not as good as a more sophisticated classic card game like Bridge). The production is nice but I find the gameplay in Scout fairly limited, to be honest. Luck is certainly considerably more important than skill. For me, there are a LOT of better hobby card games out there. And that is talking about the game played with four or five. At two or three players , it is absolutely terrible; so bad, in fact, that it should never have been advertised as playable at those counts, imo. So, really, 5/10 feels maybe too generous. If I were to take the experience at lower player counts into account, I’d have to drop my score to a three.",
    "timestamp": 1753999200
  },
  {
    "username": "Derianhorgen",
    "rating": 6.0,
    "comment": "SpielboxRating 6-8, av. 7,79",
    "timestamp": 1762038000
  },
  {
    "username": "TimTimTimTim",
    "rating": 6.4,
    "comment": "3-5",
    "timestamp": 1761778800
  },
  {
    "username": "MissP1ggy",
    "rating": 6.0,
    "comment": "Fun, quick card game with nice tactics\n\nDutch rules summary: https://boardgamegeek.com/filepage/272952",
    "timestamp": 1760911200
  },
  {
    "username": "willbeplayin",
    "rating": 6.0,
    "comment": "Krass Kariert+, in a manner of speaking. Once you play a round or two, you get the idea. Theme is of course non-existent but the mechanisms are solid, as befits a good card game. Very lucky, very swingy though.",
    "timestamp": 1759874400
  },
  {
    "username": "Kovie2",
    "rating": 6.0,
    "comment": "Simple card game which I liked, but not overly crazy to play often. Wish it was good in 2P. I would say it's fairly overrated for what it is.",
    "timestamp": 1759269600
  },
  {
    "username": "FirstToFall",
    "rating": 6.0,
    "comment": "cute, but takes too long. That \"20 min\" is a bald faced lie.",
    "timestamp": 1758837600
  },
  {
    "username": "JeepMomma",
    "rating": 6.0,
    "comment": "Fun little game, Will didn't care for it",
    "timestamp": 1757541600
  },
  {
    "username": "andyliu33756",
    "rating": 6.0,
    "comment": "覺得還好",
    "timestamp": 1757368800
  },
  {
    "username": "wpolka",
    "rating": 7.0,
    "comment": "I prefer Jungo nowadays even though it's simpler or maybe because of that",
    "timestamp": 1762470000
  },
  {
    "username": "pezpimp",
    "rating": 7.0,
    "comment": "A cute idea, with easily accessible gameplay for a climbing card game. I personally prefer it with more players since you get a few more games in. I feel that it cut too short at 3 and didn't allow enough play each round or overall, but with 5 players, when everyone knows the game or catches on quickly, the game play is much better. The turns are fairly short, and a bad hand can be frustrating, but with multiple rounds and 5 players, this becomes much less of an issue, and it becomes more fun. Still though, there are much better climbing games in my opinion.",
    "timestamp": 1762124400
  },
  {
    "username": "Sylweczkaaa",
    "rating": 7.0,
    "comment": "spoko, łatwa przyjemna",
    "timestamp": 1761865200
  },
  {
    "username": "Crow_Theater",
    "rating": 7.0,
    "comment": "It's a simple game for the times of cozy picking game with friends. I couldn't get more out of scenario when I played but the mechanism was really fun.",
    "timestamp": 1761692400
  },
  {
    "username": "Bethobrien",
    "rating": 8.0,
    "comment": "Game category: card game",
    "timestamp": 1762640340
  },
  {
    "username": "Savcore",
    "rating": 8.2,
    "comment": "As good as a card game can get. Perfect game for pubs.",
    "timestamp": 1762636140
  },
  {
    "username": "marklcmlsc",
    "rating": 8.0,
    "comment": "Feels like a classic card game with an interesting twist, effortlessly entertaining and a joy to teach.\n\nEDIT after 100+ plays: for its simple ruleset, the game has a surprising amount of strategy. SCOUT has quickly become a classic and hits the table frequently. Plays well with 2-5, where each player count requires a slight shift in strategy.",
    "timestamp": 1762383600
  },
  {
    "username": "Stacey219",
    "rating": 8.0,
    "comment": "This was a good game to play with family. Fairly easy to learn. Some of the younger kids didn't quite understand the strategy.",
    "timestamp": 1762210800
  },
  {
    "username": "smriera",
    "rating": 8.5,
    "comment": "Genial juego Trick Taking game para jugar con 4 - 5 personas.",
    "timestamp": 1762470000
  },
  {
    "username": "Hrontajkpa",
    "rating": 9.0,
    "comment": "This scratches a pattern-recognition-puzzle itch in me. Simple enough that almost anyone can play, enough substance that it's never boring.",
    "timestamp": 1762383600
  },
  {
    "username": "fuxoft",
    "rating": 9.0,
    "comment": "Amazingly inventive. Very simple rules, hard to master, plays quickly.",
    "timestamp": 1762210800
  },
  {
    "username": "the_rhebb",
    "rating": 8.5,
    "comment": "Overall - 8.5/10\n\n(The following scores reflect how the category/factor positively impacts the experience. 5 = Increases enjoyment significantly, 1 = Subtracts from enjoyment significantly).\n\nThe Brain:\nLearnability - 4.5/5\nTeachability - 4.5/5\nKid Friendly - 2.5/5\n“Non-Geek” Friendly - 4.5/5\nSetup/Teardown - 4/5\nFiddliness - 4/5\nCrunchiness - 4.5/5\nStrategic Satisfaction - 5/5\nPlay Time - 5/5\nPlayer Count Scaling - 4/5\nSolo Play - N/A\n\nThe Eyes:\nArt/Appearance - 3/5\nTheme - 2/5\nUniqueness - 4/5\nStory/Narrative Quality - N/A\nComponent Quality - 3/5\nSize - 5/5\nPrice - 4/5\n\nThe Heart:\nLaugh Factor - 3/5\nParty Factor - 4/5\nLuck Factor - 3.5/5\nReplayabilty - 5/5\nFun Factor - 4.5/5\n\nSimple, engaging, strategic-enough, and just fun. Easy to teach, quick to play. This will be a regular card game in my rotation, even when just sitting around drinking with friends. Honestly, I have no idea why this game isn’t more popular or well-known. Shares space with games like Uno, Phase 10, Skip-Bo, and I will be singing its praises to people who enjoy those games.",
    "timestamp": 1761778800
  },
  {
    "username": "d3stinyman",
    "rating": 10.0,
    "comment": "If you want a simple, portable and fun game with a little bit of strategy, this is it. The perfect filler for 15-20 mins to play after a long game or during a break. Needs 4 people to work well, 3 could also be ok. edit: I thought about it and this is the best game to play imo if you are at least 5 people and need a game that is fairly easy to explain. Totally recommended",
    "timestamp": 1762624620
  },
  {
    "username": "dahntheboss",
    "rating": 10.0,
    "comment": "packed in What a wonderful Kingdom",
    "timestamp": 1762210800
  },
  {
    "username": "clawp1995",
    "rating": 10.0,
    "comment": "3D Insert\nSleeve Kings USA Chimera 57.5 x 89 SKS-8808",
    "timestamp": 1761951600
  },
  {
    "username": "GonkalBell",
    "rating": 10.0,
    "comment": "Feels like a classic card game, and makes it hard to go back to playing other classic card games with how good it is.",
    "timestamp": 1761429600
  }
]