[
  {
    "username": "Bunsy",
    "rating": 1.0,
    "comment": "You couldn't pay me to play this again. Hated it.",
    "timestamp": 1762602480
  },
  {
    "username": "hcmacro",
    "rating": 1.0,
    "comment": "Maybe the worst enjoyment-to-price ratio of any game. But is great during Halloween season.",
    "timestamp": 1760479200
  },
  {
    "username": "Jawshoeaw1",
    "rating": 1.0,
    "comment": "Worst gaming experience of my life",
    "timestamp": 1757800800
  },
  {
    "username": "Mr More Dakka",
    "rating": 1.0,
    "comment": "Takes itself WAY too seriously",
    "timestamp": 1750975200
  },
  {
    "username": "lalo_Gx17",
    "rating": 1.0,
    "comment": "It is just a werewolf all over again, not really a innovation, and also very expensive for the meh expirience",
    "timestamp": 1748815200
  },
  {
    "username": "NeoBandit",
    "rating": 1.0,
    "comment": "I don’t get the hype for this game, i honnestly found it frustrating and too long, i think it’s only good marketing, despite my friends took very serious their role and tried their best and our game master was very experienced many of us were hoping to end it soon, if the game was cheaper i think it could be for secret roles fans, but is way too overpriced for what it offers",
    "timestamp": 1748037600
  },
  {
    "username": "RaymanY",
    "rating": 1.0,
    "comment": "Review after 30h.\nIt is an overhyped, overproduced social deduction game that brings nothing truly new to the genre. At its core, it’s just another werewolf-style game—except with an enormous price tag for both the physical and online versions.\n\nAn actual deduction in BotC often feels borderline impossible due to the ambiguity of the information given.\nWhile many modern social deduction games have evolved past outdated mechanics like \"night phases\", player elimination, and moderator, BotC doubles down on them. Sessions that should take 30 minutes drag on for three hours, making the experience feel overstretched.",
    "timestamp": 1739574000
  },
  {
    "username": "cenbrandt",
    "rating": 1.0,
    "comment": "... Um demônio está à solta, assassinando à noite e disfarçado em forma humana durante o dia. Mas o Demônio e seus servos malignos estão espalhando mentiras para confundir e gerar suspeitas.\n\nBlood on the Clocktower é um jogo de blefe com 5 a 20 jogadores em equipes adversárias do Bem contra o Mal.",
    "timestamp": 1739228400
  },
  {
    "username": "SethroTall",
    "rating": 1.0,
    "comment": "Theoretically a logical deduction game, except people can lie, and sometimes are telling the truth, but even they don't know they are actually lying? An absolute waste of time. Not fun. Tried twice, will not play again.",
    "timestamp": 1737759600
  },
  {
    "username": "Creativenothing",
    "rating": 1.0,
    "comment": "Blood on the Clocktower is a fundamentally broken game, with no shortage of unacceptable downtime, mechanical flaws and anti-fun game design.\n\nIf it wasn't for the entertaining antics of a certain popular youtube group, this game would have completely failed.\n\nClocktower gets a pass for issues that are heavily criticised in other games. Players have to spend way too long with their eyes closed with absolutely nothing to do. If you’re lucky you’ll get a useful and fun character ability, but you may also end up with a character that learns information ONCE the entire game. Even worse, if you die, you will lose any kind of ongoing power. Don't worry though, death is not the end, you still get one last exciting vote. Don't spend it all at once.\n\nThe story tellers role in this game is to \"rebalance\" the absurdly long 2 hour slog. Despite needing a dedicated GM being ridiculous for this kind of game, it's the only somewhat enjoyable role.\n\nBottom line, clocktower is fun to watch, but not to play. Much like squid game, it exists purely for the spectators amusement.",
    "timestamp": 1736290800
  },
  {
    "username": "parpari",
    "rating": 1.2,
    "comment": "I do not get it. This is story telling version of Werewolf/Mafia. There is nothing innovative about it. It just becomes more complicated which makes this style of games more inaccessible and longer as a party game. Also; Werewolf/Mafia is free to play with all it's alteration.",
    "timestamp": 1730502000
  },
  {
    "username": "Elmartino123",
    "rating": 1.0,
    "comment": "Too long for not much more gameplay than oldschool werewolf. On top far too expensive.",
    "timestamp": 1728424800
  },
  {
    "username": "CaptainRubbish",
    "rating": 1.0,
    "comment": "Dog plops",
    "timestamp": 1727301600
  },
  {
    "username": "smurfodeth",
    "rating": 1.0,
    "comment": "I don't know if a game exists that I am less of the target audience for than this.",
    "timestamp": 1726437600
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "So it's Starcraft Mafia aka Town of Salem, with way too many roles, yet YOU GOTTA LEARN EM ALL TO DEDUCE. But no computer moderator to handle them all instantly? Noticing how this is designed for the enlightened nerd, there's no town center where everyone talks together and drums up group outrage, but they go off in private rooms and puzzle abilities out.\n\nThat wouldn't be entirely awful, but the moderator rebalancing the sides really kills it. Now the hidden roles game doesn't even matter, and it's an overcomplicated roleplaying game in disguise. Which isn't even as good as any RPG, or even those murder-dinner games. Two sides pretend to attack each other but not really?\n\nThere's not much humor value in this, even Starcraft Mafia had weirdness that couldn't be pulled off in other formats, like the Jester. This is super serious and lasts waaaay too long.",
    "timestamp": 1725400800
  },
  {
    "username": "realjw",
    "rating": 1.0,
    "comment": "If you ever wished social deduction could have an awful learning curve, needing a moderator and would last up to a painful FOUR HOURS (yes my game lasted that long), then you'll like this game.\n\nThe people who liked this game kept saying about how it's nice that you can still contribute after you're dead and that it \"fixed\" the player elimination bit. Yeah but the werewolf 2.0 games (Resistance, Secret Hitler, etc) had already ELIMINATED that problem by having a shorter game span. This game resurrected the problem because it's so god damn long and tried to make it less awful by making the dead people be able to vote one last time still. Guess what, if you're dead the first few rounds, you're still barely useful because your actions are still restricted.\n\nPerhaps the worst werewolf iteration to date. If you have that many people willing to play social deduction, play Among Us instead. That game shows how inferior board game social deductions are.\n\nPlayed again on 25 Apr 24 with 6 and 7 players. Score stays at 1:\nGame didnt last 4 hours because of shorter player count but was still quite long. I forgot to add another big gripe I have about the game, the unreliable information.\n\nThe information you get in this game is never going to be 100% reliable and it's frustrating. Eg., okay you are the washerwoman oh cool you get to learn that one of the two people in play is an investigator. Pretty neat eh you got some information. Umm no actually you dont and your information is completely wrong because you got poisoned by the minion. And guess what that means, you actually are throwing everyone off because of your false info, which makes you worse than a regular townsfolk in other games. Your role and info can either be compromised because of RNG (poisoned) or because game master just wants to fuck with you and make you a drunk. Playing a ~2 hours game to be a nonsense spouting clown isn't fun. There's like layers upon layers of misinformation/misdirection in this game to the point where you'll always have to guess and hope youre correct all the time.",
    "timestamp": 1714168800
  },
  {
    "username": "Fundle",
    "rating": 1.0,
    "comment": "Added complexity does not equate depth. It feels like you are randomly voting.",
    "timestamp": 1712527200
  },
  {
    "username": "gabdewulf",
    "rating": 1.0,
    "comment": "Pure chaos and nonsense acting class that pretends to be a game.",
    "timestamp": 1709852400
  },
  {
    "username": "dethwing",
    "rating": 1.0,
    "comment": "Take all the terrible parts of Werewolf and other Social Deduction games and add so much fake information and mistrust, that you might as well just be voting randomly. I will never be in the same room as this 'game'. Ever again.",
    "timestamp": 1706828400
  },
  {
    "username": "Radaniel",
    "rating": 1.0,
    "comment": "Demasiado hype. No es tan malo pero su precio si lo es, por eso la calificación. Es una exageración por un juego de roles que no supera a los otros juegos de su estilo.\n\nSi su mejor argumento es ofrecer muchisimos roles, pues resulta que son tantos que muchas veces lo que hacen es entorpecer la partida en vez de favorecerla.\n\nY eso de que morir no te saca del juego, pues es una verdad, pero a medias, ya que mas bien sigues “activo” pero sin ninguna acción relevante (o divertida).\n\nTanto hype y calificaciones infladas me recuerda al cuento “el nuevo traje del emperador”, porque tal vez muchos de los que lo compraron a ese precio tan exagerado, prefieren defenderlo tan ciegamente en lugar de aceptar la realidad; que es un juego de roles muy muy normal que solo supera a sus rivales por su desmesurado precio.",
    "timestamp": 1706655600
  },
  {
    "username": "khepriq",
    "rating": 1.0,
    "comment": "expensive",
    "timestamp": 1705964400
  },
  {
    "username": "Blackwaffle",
    "rating": 1.0,
    "comment": "How would you like to pay $150 for a popularity contest in a fancy box?",
    "timestamp": 1705878000
  },
  {
    "username": "Lapsus",
    "rating": 1.0,
    "comment": "Lol what? $185 CAD for a social deduction game that you can play for free online? Sometimes I wonder what people are thinking. What a gouge. No, just no. Just get yourself a $20 copy of resistance or avalon.",
    "timestamp": 1705359600
  },
  {
    "username": "OzzyTGAP",
    "rating": 1.0,
    "comment": "Basically Werewolf reskin costs a ridiculous amount of money. What's the hype for?",
    "timestamp": 1704668400
  },
  {
    "username": "joker111",
    "rating": 1.0,
    "comment": "GM vs good vs bad.\nUnlike other social deductions, if your GM is bad at explaining the roles and points at who is what role and players around you don't trust you. Then you will have a hard time like me in this game!",
    "timestamp": 1698184800
  },
  {
    "username": "msalmon14",
    "rating": 1.0,
    "comment": "I actually wanted to play this game, but it's SO obvious that there are hundreds of fake \"10\" ratings that. 1) I will rate it a 1 to counterbalance 2) I don't even want to play the game because so many of the ratings with comments are clearly fake.\n\nClearly whoever has created that many fake accounts is a sad sad group of individuals trying to pump up a game that they don't truly believe in.",
    "timestamp": 1696111200
  },
  {
    "username": "FuetterMeinEgo",
    "rating": 2.0,
    "comment": "Not even owned by myself, but played several times:\n\nAfter all the hype, the game disappointed me bitterly:\nToo unbalanced, far too complex for such a large group game (without knowing the function of all the roles, it's just a completely pointless guessing game), too dependent on the skills (or the character) of the storyteller - and ultimately far too long, while you spend a good part of the time sitting around with your eyes closed. Not a board, a bored game!\n\nTranslated with DeepL.com (free version) - Thank you, DeepL",
    "timestamp": 1761256800
  },
  {
    "username": "Sorlag_XI",
    "rating": 2.0,
    "comment": "DEDUCTION | TEAMS",
    "timestamp": 1760220000
  },
  {
    "username": "Dark_Mirror",
    "rating": 2.0,
    "comment": "Too long, not immersive enough and at the end (because you can never be sure about the information you get) you need the right feeling if you can trust the right persons. You can have the same in much shorter and cheaper games like \"Tempel des Schreckens\" or \"Feed the Kraken\". Its for me not worth the time.\nOur gamemaster was awsome and did a great job! I hope they have many more rounds, but without me.",
    "timestamp": 1759701600
  },
  {
    "username": "CampingRamen",
    "rating": 2.0,
    "comment": "Was the undertaker. Was happily waiting to get information on the second night. Nominated the virgin. Instantly executed. Sat for the next hour still \"playing\".\n\nNo notes.",
    "timestamp": 1750543200
  },
  {
    "username": "windgrace",
    "rating": 1.5,
    "comment": "Just why? The main appeal of of 'good' werewolf derivatives (secret hitler, avalon, etc) is that they're mercifully short and don't require dedicated GM.\nAt this level of length and rules complexity you'd be better off playing a proper RPG.",
    "timestamp": 1744754400
  },
  {
    "username": "Poscat",
    "rating": 1.5,
    "comment": "It is far too long for what it is. It solve the problem of werewolf with the people who died still having some kind of very small power. But it is still annoying to die at the beggining as you feel insignificant, with no insight, but still have to concentrate on what's happening in a long game. It also has the feeling like the GM is only GM with lot of job, not a player, and can abuse its power to have a small feeling of importance on the game. And for none gamer, it feels like there are too much roles and it is a bit more complicated than the alternatives. I'd rather play werewolf/the resistance/avalon/secret hitler.",
    "timestamp": 1739142000
  },
  {
    "username": "BlueMaxima",
    "rating": 2.0,
    "comment": "It has some really great ideas, and the amount of roles and their interactions can create thoroughly different games, but with a learning curve / barrier to entry equivalent to Everest at a 135 degree angle if you aren't starting with a completely fresh group that won't bounce around the included scripts, the potential for any wrong move on any one player or the storyteller to absolutely ruin a 2+ hour game, and just pure luck adding on top of that potential chance to ruin your game, can end up resulting in a 3 hour game where you simply get to sit around and do nothing while everyone else has fun, and it's soured me to the game massively over time, to the point where I'll avoid it unless I'm forced into it.",
    "timestamp": 1736809200
  },
  {
    "username": "Edward33",
    "rating": 2.0,
    "comment": "This game got worse with every subsequent play. Randomness, chaos and misinformation. I personally prefer the deduction part of social deduction games. None of your information could be relied upon because of a manipulated game state. Without some good information it's a mess.",
    "timestamp": 1734390000
  },
  {
    "username": "mmazala",
    "rating": 2.0,
    "comment": "Key background info: Werewolf is my 11/10 game.\n\nBotC is Werewolf for the lazy, the chaotic, and those who like to pretend they are playing a game.\n\nWhy the lazy? Because information is spoonfed to you. You don't need to actually find liars - you need to solve a basic logic puzzle.\n\nWhy the chaotic? Because that spoonfed information will sometimes be fucked with RNG elements and the moderator.\n\nWhy those who like to pretend they are playing a game? The moderator is going to fuck around with the outcome so it will go to F5 each time - if that happens, why are we even playing with more than 5 people?\n\nI'm glad others like BotC, but it is absolutely not for me.",
    "timestamp": 1730588400
  },
  {
    "username": "ivansd_26",
    "rating": 2.0,
    "comment": "El lobo pero durmiendo hasta cuando te matan peor todavía",
    "timestamp": 1728511200
  },
  {
    "username": "Fawkes",
    "rating": 2.0,
    "comment": "Whoever thought that adding complexity to Mafia and turning it into a LARP that takes even longer than the most Ultimate Werewolf game should be drawn and quartered. Absolutely excruciating. Never again.",
    "timestamp": 1712527200
  },
  {
    "username": "Gregish62",
    "rating": 2.0,
    "comment": "A more complicated and convoluted version of werewolf/mafia",
    "timestamp": 1695160800
  },
  {
    "username": "Jephque",
    "rating": 2.0,
    "comment": "would rather be punched than play it ever again.",
    "timestamp": 1687557600
  },
  {
    "username": "Kampesten",
    "rating": 2.0,
    "comment": "I cannot understand Blood on the Clocktower's popularity, since it in my opinion ruins the core elements of social deduction. Many mention the innovative mechanic of being able to do a bit while dead (because players in BotC still have a one-time-use vote), but that concept was first used in Witch Hunt from 2016, which I think is a better game. The main problem of BotC is that it removes the fun of the classic werewolf/mafia framework, especially by having too many special characters into play, and removing the real possibillity to deduce anything, or at least reducing it a lot (yes, I think the roles of werewolf/mafia are more interesting).\n\nThe primary reason that I argue that there is a lack of deduction, is because of the huge amount of randomness of the roles in BotC, and while some finds it interesting to \"not being able to fully know anything\", I do not like this mechanic in a more heavy SD game, and would rather play one of the many One Night games instead (as they are more true funny Party games, where the randomness are totally welcome).\n\nIn addition to this, if someone is looking for a SD game without as hard player elimination as in werewolf/mafia, I think The Resistance: Avalon is a much better choice than BotC, since there is actually almost no difference on the player elimination in BotC and werewolf/mafia (at least I do not feel more interesting about being dead in BotC than in werewolf/mafia, maybe even less in BotC).",
    "timestamp": 1682373600
  },
  {
    "username": "kakitamike",
    "rating": 2.0,
    "comment": "This has been a roller coaster of reviews, but I’ve found that this game’s worth is entirely up to the storyteller. They can make it a social deduction game, or they can make it where evil is playing a strategy game while the good team plays Fluxx. This game lives or dies by what the storytellers idea of fun is, and if it differs from the players, the game is just miserable.",
    "timestamp": 1682028000
  },
  {
    "username": "AvalonXQ",
    "rating": 2.0,
    "comment": "Game is terribly unbalanced. GM makes decisions that affect the outcome. You don't even learn whether you executed an evil person or not.\n\nThere are many other werewolf/mafia variants. Play one of them instead.",
    "timestamp": 1632002400
  },
  {
    "username": "Nactra",
    "rating": 2.0,
    "comment": "Failure to improve on werewolf.",
    "timestamp": 1613343600
  },
  {
    "username": "notarealeaccount",
    "rating": 2.0,
    "comment": "Just balancing the 10 I gave it before",
    "timestamp": 1600552800
  },
  {
    "username": "ExplodingSnail",
    "rating": 2.0,
    "comment": "Obtuse, over long and massively expensive. This is not a re imagining of the social deduction game as claimed.",
    "timestamp": 1579302000
  },
  {
    "username": "rtcodo",
    "rating": 2.0,
    "comment": "I got to play this at BGG Con this year and was curious to see how it held up to other social deduction games. I play Werewolf when I go to BGG Con and I enjoy it. However, after playing it the last few conventions it is getting a little repetitive. So I more than happy to give this new game a try.\nI think I expected to much from this game. We played it twice at the con and neither play through was not enjoyable. The first play through ended after the first night, and the second lasted over 5 hours. What I initially thought was a cool idea of having the dead players still participate led for huge pointless accusations and discussions. We played with the Traveler who turned out to be the second most powerful killer in the game. The spy seemed like a really cool idea until I figured out their powers were broken. Being able to see all the roles seems a little over powered in a game like this.\nAlso I admit I was the same character twice working for the Imp. The Scarlet Woman really had no purpose but to keep the Imp team after his potential death in the first few rounds.\nThe game was at best in my opinion just ok. It never really scratched that itch.",
    "timestamp": 1574722800
  },
  {
    "username": "Shampoo4you",
    "rating": 2.0,
    "comment": "As someone who has played Werewolf thousands of times and many other social deduction games, this one has two of my least favorite variants of that formula. Namely not revealing roles on death and an overly long playtime.",
    "timestamp": 1574463600
  },
  {
    "username": "BionicProfessor",
    "rating": 2.0,
    "comment": "I was quickly bored due to the 8 or 10 very long \"night phases\" where we sat with our eyes closed waiting for the storyteller to contact each person one at a time with what that person's character learned. I found myself wishing that there was a player elimination feature so I could move along.",
    "timestamp": 1562018400
  },
  {
    "username": "Pastor_Mora",
    "rating": 2.0,
    "comment": "A ton of ghost users without any thumbs received or given, or any other contribution to the site, just come here to rate this single unreleased kickstarter with a 10 and comment how wonderful it is. And don't get me started with suspiciously unusual reviews...\n\nI smell a fat, awful, hairy RAT.",
    "timestamp": 1554069600
  },
  {
    "username": "Ilthuain",
    "rating": 2.0,
    "comment": "Played at SHUX. Didn't dig it.\n\nIt's Werewolf with a dye job. Don't let anyone convince you otherwise. I'm not really a fan of Werewolf, and I sure as shit am not a fan of Werewolf that takes three times as long.\n\nWhat I am a fan of? The cult-like behavior of BotC fans. I log in here every day and get to be endlessly entertained by the 7+ paragraph treatises on how this game redefines everything you thought you knew about entertainment. If it wasn't for that, this game would get a \"1\".\n\nAlso, the price point thing is hilarious. FELT: The Fabric of Kings!",
    "timestamp": 1554069600
  },
  {
    "username": "estalabub",
    "rating": 2.0,
    "comment": "10x more complicated but only 10% better than werewolf",
    "timestamp": 1553382000
  },
  {
    "username": "plus2joe",
    "rating": 2.0,
    "comment": "Slight reflavor of mafia, but nearly every change is for the worse. Not an upgrade to your classic mafia/werewolf game--stick with the free rules you find online.",
    "timestamp": 1536012000
  },
  {
    "username": "darkk_",
    "rating": 3.0,
    "comment": "New players may struggle to grasp the roles and gameplay when given roles with zero information. Players eyes are mostly closed sitting in silence a good portion of the game.\n\nCaptivating ✅\nEngaging ❌\nReplayability ✅\nRules ❌\nQuality ✅",
    "timestamp": 1761429600
  },
  {
    "username": "thorbot",
    "rating": 3.0,
    "comment": "Extremely overrated, overlong, with most player roles being utterly useless and boring. Only slightly engaging if you get one of the handful of interesting roles, and early player elimination can have people sitting around bored for 2+ hours. Not for me.",
    "timestamp": 1760911200
  },
  {
    "username": "NVRAM",
    "rating": 3.0,
    "comment": "I truly don't get how this is rated above a 5.0, after multiple plays it's definitely one of my least favorite games.\n\nI like, and own, multiple social deduction, hidden role and other party games. But w/the misinformation players have about their own roles, I *would not* call this \"social deduction\" - at best it's a \"party\" game where you spend hours interacting with characters but not actually with the players.",
    "timestamp": 1759442400
  },
  {
    "username": "fredthedeadhead",
    "rating": 3.0,
    "comment": "One of the pain points of Werewolf is if you die, you have no more agency, and have to sit in silence. BotC fixes that by letting dead players talk. And that's the only improvement over Werewolf.\n\nBotC goes further, and introduces a lot of other changes to bring in more downtime and undermine player agency.\n\n- There are more roles, and they are more complex. This means the game in general takes much longer to run. The night phases are especially painful, as the DM must check in with each special role. I don't enjoy sitting in silence for 10 minutes. Yawn.\n- The DM can, at any point, lie to you about anything. There is usually no way to determine this yourself. You have no agency.\n- The game is less about social deduction and more about being able to run a simulation of the game in your head to determine the possible explanations and what actually happened. Newbies have no chance of being able to figure out all of the confusingly worded, poorly explained, and conflicting roles. This usually reduces the player agency to just parroting information they have heard, and letting the most experienced player figure out the logical combination of characters.\n- The bad guys can get killed almost immediately. Big yawn if this happens, get ready for a lot more downtime for the game to reset.",
    "timestamp": 1757714400
  },
  {
    "username": "sykano",
    "rating": 3.0,
    "comment": "slightly fixed \"Werewolves\" is still \"Werewolves\"",
    "timestamp": 1753567200
  },
  {
    "username": "SYGF",
    "rating": 3.0,
    "comment": "all of these social deduction games are essentially the same. The more complicated they get the more they take away from the single underlying idea: reading your opponents and knowing whether they are telling you the truth. I prefer here something like SKULL, which distills this idea down into the bare minimum",
    "timestamp": 1747173600
  },
  {
    "username": "Fd12",
    "rating": 3.0,
    "comment": "Update after ten rounds on four occasions:\n\nAwful game. The GM decides which teams wins. Players have nearly no agency, since many \"may lie\" effects allow the GM to increase difficulty into incredibly hard or easy.\n\nHad four GMs now. We usually say \"let's just kill the person claiming to be the virgin and play another round\" after 15 minutes, lose the game and start again, since even part of the groups noticed this trend.\n\nUndefeated in four games, I still mostly hate this. Too long. Needs a whole house. Too loud and stressful. Not everyone gets to play, but the storyteller needs to push to make winning possible for both teams.\nA worse version of one night ultimate werewolf. And the price is just instance, but print and play is easily an option, say my student friends.",
    "timestamp": 1745186400
  },
  {
    "username": "BCS00",
    "rating": 3.0,
    "comment": "As a great fan of Avalon, I was invited to participate in a game of BOTC with 16 people. I was the first one eliminated. Then I basically had to sit with the group for the next two hours until the game concluded. For me, the game took way too long, the roles too complex, and for me it was extremely boring. I won't play it again. Give me Avalon every time as that is my favorite game.",
    "timestamp": 1740870000
  },
  {
    "username": "el_marko",
    "rating": 3.0,
    "comment": "Far too long and complex for a hidden roles game for me, I personally couldn't stand it. Too much pressure and hard work, exhausting.",
    "timestamp": 1737327600
  },
  {
    "username": "TeamAbsolute",
    "rating": 3.0,
    "comment": "Overlong, overpriced, over complicated, overly reliant on the story teller being experienced and doing a good job, requires a dedicated group to play.\nJust about everything I don’t want from a party game.",
    "timestamp": 1728511200
  },
  {
    "username": "Solipsiste",
    "rating": 3.0,
    "comment": "Vastly overpriced.",
    "timestamp": 1727301600
  },
  {
    "username": "pingus",
    "rating": 3.0,
    "comment": "8+ games feel like mostly a downgrade from other social deduction games.\n\nThe Storyteller having a power is sometimes fun for the storyteller, but I'd argue that in the way this is structured it hardly is a game anymore until a final night. The rules are just too vaguey and what ST is trying to do is artifically prolong the game. There is hardly any deduction, because of the number of powers changing the outcomes that people are seeing. The voting system is convoluted and long, nights are long and very quiet.\n\nI like the idea of outsiders (good guys with negative ability for balance purposes) and I like some of the soft Townsfolk powers. Travellers seem also like an interesting idea.\n\nTeensyville (5-6 player) is much better experience, I'd rate it as high as 8 or 9, but as this is marketed and received nobody is interested in playing it. The base game for me is around 3 or 4.\n\nTo use cheesy cheese analogy, this is like an extremely stinky cheese that people who love stinky cheeses are trying to tell you is the best thing for everyone to eat, even those who are lactose intolerant. If you love social deduction and always wanted more and more sure go for it, but if you find that \"just more rules\" is not the solution to social deduction I'd stay away.",
    "timestamp": 1726524000
  },
  {
    "username": "SirMarmight",
    "rating": 3.0,
    "comment": "I'm thankful for my onetime exposure to 14 players repeatedly shut their eyes, lie & or accuse for the next two hours plus. As it taught me a valuable lesson...\n\nAvoid mixing in social deduction that stretches beyond its welcome. It only meddles with your fond memories of The Resistance / The Resistance: Avalon.",
    "timestamp": 1721772000
  },
  {
    "username": "GermanMeepleGames",
    "rating": 3.0,
    "comment": "For social deduction experts who have a big and regular group looking for a long an intense experience this might be a 10. For me it was very much like Werewolves, only five times longer and more confusing. We started at 7, I really wanted to go to bed at 11, we finished at 12.30. However, there were a lot of first timers in the group including me and we were 16.",
    "timestamp": 1721340000
  },
  {
    "username": "kevan",
    "rating": 3.0,
    "comment": "Werewolf with roles for everyone, dead players still getting to chat, private conversations encouraged, and multiple mechanics for false information which the narrator gamesmasters at whim based on which side they think needs more help, rather than resolving as blank or random. Playing online it felt like too complex a pinboard, with too many possibly-active player roles to consider and large swathes of \"well, unless the narrator chose to give us/me very clever false information about X\" fog.",
    "timestamp": 1710198000
  },
  {
    "username": "wynxii",
    "rating": 3.0,
    "comment": "Look I can see why people like this. For the players I know it's like a cult. But for me outside the cult it's just so hard to get into. The learning curve was immense meaning that the first two game 1hr30 each were not enjoybale. It's just too much for this simple gamer.",
    "timestamp": 1710111600
  },
  {
    "username": "nickv2002",
    "rating": 3.0,
    "comment": "I love many other hidden role games, but can't get into BotC. It is decidedly not for me. Things I don't like:\n- DM required\n- Player elimination but not really because you're a ghost\n- Drunk and similar states that just exist to add uncertainty",
    "timestamp": 1706482800
  },
  {
    "username": "Jreilly89",
    "rating": 3.0,
    "comment": "The set-up and down time between rounds really bugged me.",
    "timestamp": 1703286000
  },
  {
    "username": "Destrio",
    "rating": 3.0,
    "comment": "Not my kind of game, but definitely takes Werewolf style gaming up a notch.",
    "timestamp": 1702162800
  },
  {
    "username": "randomphantom",
    "rating": 3.0,
    "comment": "I don't understand the hype. You have probably a higher downtime on all nights accumulated than if you'd die in the first night of a game of Werwolves. Storyteller directing the story and giving false information to players is not my idea of a social deduction game. Also, dead players should be dead.",
    "timestamp": 1697061600
  },
  {
    "username": "millsyboy",
    "rating": 3.0,
    "comment": "Even though it's not for me I can tell that a lot of care and attention has been put into this game by people who love the genre of werewolf/mafia games.\n\nOne of the selling points of this game is that players who are killed during the game can still participate and vote (once) - in my experience that didn't amount to much.",
    "timestamp": 1696370400
  },
  {
    "username": "thisted",
    "rating": 3.0,
    "comment": "It's werewolf except being evil is harder and less satisfying. That you're not out of the game after dying is good though.",
    "timestamp": 1684101600
  },
  {
    "username": "Redward",
    "rating": 3.0,
    "comment": "Werewolf that takes longer, is more moderator dependent, costs far too much, is over produced, and is too easily ruined by moderator errors (or player errors and confusion).",
    "timestamp": 1682719200
  },
  {
    "username": "emptyset",
    "rating": 3.0,
    "comment": "It is a very good social deduction game but it is a longer and more invovled one and they are simply not for me.\n\nBut if you like them, you should try it out for sure!",
    "timestamp": 1682200800
  },
  {
    "username": "JukkaMikael",
    "rating": 3.0,
    "comment": "Werewolf in a big, fancy, expensive box. Overhyped and you dont even get quality components for your money. I really dont get all the 9’s and 10’s here. I could come up with 99 ”different” roles and put them in a 100x100cm box and sell it for 1000€ and it still would not be anything else but werewolf wrapped in extra cardboard. Emperors new (Kickstarter)clothes.",
    "timestamp": 1681164000
  },
  {
    "username": "samcrane2011",
    "rating": 3.0,
    "comment": "I just do not click with this game. Even playing with different groups and experienced storytellers, I still find it super unsatisfying. Obviously I'm in the minority here, but I don't understand the point of trying to decipher anything when it is literally someone's job to influence the game behind the scenes however they see fit - even your character role isn't reliable here. I keep hearing about how fun this game is supposed to be, and then proceed to play a game where everyone meanders around with nothing concrete for 90 minutes.",
    "timestamp": 1680559200
  },
  {
    "username": "Vittrar",
    "rating": 4.0,
    "comment": "It’s ok but for me, too many of the roles were passive. So it wasn’t much skills to use, (while others had something every night/day)",
    "timestamp": 1760824800
  },
  {
    "username": "Mountain_Nat",
    "rating": 3.5,
    "comment": "Glad I tried it but I have no desire to play it again. Not my type of game at all.",
    "timestamp": 1755900000
  },
  {
    "username": "arpogan",
    "rating": 4.0,
    "comment": "Completely not my type of game – I’m glad I tried it, but never again.",
    "timestamp": 1755036000
  },
  {
    "username": "D4rryl",
    "rating": 4.0,
    "comment": "It’s okay. Too Chaotic to do any deduction. Even though you are still in the game if you die, death is still unfun. Finding out you’ve been given the drunk role (or poisoned) and all the information you’ve been getting is incorrect is unfun. By the 2nd game I was done. It’s a fun Halloween game or a game to play a couple of times a year.",
    "timestamp": 1752530400
  },
  {
    "username": "goethean",
    "rating": 4.0,
    "comment": "A game passionately loved by extroverts, loudmouths, and bullies. I have gotten roped into playing this twice at parties. No one explained how the roles work because \"it's simple\" and \"everybody knows how to play.\" Then some loud person invariably takes charge and starts ordering everyone around and everyone sheepishly goes along with whatever he says. As someone who is not used to making up bullshit and lying to people like a sociopath, I find this game stressful and no fun at all. And I am suspicious of people who do like it.",
    "timestamp": 1751752800
  },
  {
    "username": "Berengere",
    "rating": 4.0,
    "comment": "It's Werewolf. Except you don't die. But it's Werewolf.",
    "timestamp": 1748296800
  },
  {
    "username": "lee elektrik",
    "rating": 4.0,
    "comment": "It's Werewolf/Mafia.\n\nBut wait, there is more: This version is only for big group, takes abouts 2-3 hours to play, does not add anything innovative, but adds a lot of complicated rules overhead! Oh, and different from most Werewolf/Mafia clones, dying in this game does not mean you are free to go; you have to keep playing, with severly reduced agency, until the whole thing is over.\n\nDo not be misled by this being labelled as \"social deduction\"; Similar to many entries in this genre, or rather even more so, this game gives you no \"facts\" to base your \"deduction\" or \"gameplay\" on; almost no information is trustworthy, and even that information which theoretically might be, might always be tampered with – including things you are told by the game master, which are equally prone to falsehood, so you may not even trust \"yourself\". Actually, you might not even be who you think you are.\n\nThere is a heap or roles (~200?) and, accordinlgy, rules, edge cases, and so forth, all of which does not increase accessibility (at all) and on top absurdly prolongs the \"night\" phases — players sit around with their eyes closed for 5 to 10 minutes and wait silently for the game master and the currently acting player to finish their stuff, so the actual game can go on.\n\nThe game master has a lot of agency and how well they handle it decides how much fun is to be had. And, as with all of these games, even a competently mastered round can be utterly broken by un-motivated players.\n\nAll of that said, with a motivated and talkative group, this is surely great fun, but I would say _almost_ in spite of the game.",
    "timestamp": 1741561200
  },
  {
    "username": "KingInTheCorner",
    "rating": 4.0,
    "comment": "Had not so good experiences playing in club with a very competitive crowd. The idea of a serious, competitive party game is a bit self-contradictory to me. Would love to play this with a crowd of friends in a more atmospheric setting, but it's unlikely this is ever going to happen.",
    "timestamp": 1739314800
  },
  {
    "username": "Odukla",
    "rating": 4.0,
    "comment": "8 if I am the GM",
    "timestamp": 1738710000
  },
  {
    "username": "pluviometer",
    "rating": 4.0,
    "comment": "I dislike social deduction, but somehow Blood on the Clocktower is good?! Assuming you have a good storyteller, you can actually collect testimonies and facts and piece together what's happening, whereas other social deduction games tend to devolve into loud unproductive arguments. Additionally, while lying makes me want to puke, there are lots of built-in opportunities to cover your tracks in this game. Basically if someone suggests playing a social deduction game, I'll say \"ugh no\" for most other ones and \"...fine\" for Blood on the Clocktower, which is high praise.",
    "timestamp": 1733958000
  },
  {
    "username": "glow1729",
    "rating": 4.0,
    "comment": "Maybe the group I played it with wasn't great, and also I don't really like social deduction games, but I don't get the hype for this game at all",
    "timestamp": 1733266800
  },
  {
    "username": "ovis",
    "rating": 4.0,
    "comment": "It improves on some classic social deduction games in some ways, but then has some other issues that balances it out to something, I end up being very \"meh\" on again.\n\n+ the roles, how they interact and combine make this sometimes almost a straightup deduction game to puzzle out which information fits together and what the odd one out lie might be, which I enjoy overall.\n\n+ the variety of roles and scripts allows for fairly different types of games that have very different playstyles to them.\n\n- nights can be extremely long, creating a lot of downtime which is worse as you are having to spend it with your eyes closed\n\n- I strongly dislike the amount of influence the storyteller has. It generally feels like they are having the most intersting game to play, which would be cool if it weren't almost always at the cost of player agency a lot of the time.",
    "timestamp": 1732402800
  },
  {
    "username": "poguelife",
    "rating": 4.0,
    "comment": "Played at a con. Horrible teach, confusing as hell \"dead players still play\"... is not \"good\" thing. There's a reason the expression is \"Dead men tell no tales\". If you're a bad guy you want to kill off those who know too much. Too much walking around and conspiring... gave flashbacks to Diplomacy (the game). I did NOT like this game.",
    "timestamp": 1731279600
  },
  {
    "username": "netes",
    "rating": 4.0,
    "comment": "Lobos de Castronegro sobrecomplicado con cada jugador su rol.",
    "timestamp": 1729893600
  },
  {
    "username": "Delphinium",
    "rating": 4.0,
    "comment": "Played once, but never again.",
    "timestamp": 1729461600
  },
  {
    "username": "kvakk",
    "rating": 4.0,
    "comment": "I wish player elimination was restricted to the last part if the game. Being killed early ruins all fun. It's nice that eliminated players can still talk, but having no power and only a single one \"ghost vote\" for an entire game is not fun at all",
    "timestamp": 1728856800
  },
  {
    "username": "MikeKoro",
    "rating": 4.0,
    "comment": "Need to try again, the first experience was a dud but I don't know that it was the game's fault.",
    "timestamp": 1727301600
  },
  {
    "username": "Apos",
    "rating": 4.0,
    "comment": "It's social deduction... chat? In BotC you get random role and you need to figure out who is good, who is bad. While it sounds cool, it all boils down to chatting, walking, chatting... It's 20 minute party \"chat-game\" that lasts 2-4 hours! In that time you can play heavy euros, Pax or wargames!\nI enjoy good party boardgames like Deception, which is full of player interaction, deduction and mystery. Deception is 30 minutes game and I have a feeling I achieve as a player much more there, than in Blood on the Clocktower.\nOther thing are roles - some are alright, some are boring and some feel unnecessary. When you get throwaway role, where you share your bit of information in first 5 minutes, the game is mostly over for you, unless you like to have a chat. In Deception all players are equally involved in murder mystery and have their own job through the entire case!\nI see Blood on the Clocktower as glorified chat for non games with some bland story behind it.",
    "timestamp": 1723068000
  },
  {
    "username": "shmonkey",
    "rating": 4.0,
    "comment": "Not my favorite genre but this one felt sufficiently different from other offerings to be interesting. A lot more unique roles. Also a lot more ways to screw with other people's information. Games take between 60 and 90 minutes, at least the two that we played. I like the getting killed doesn't knock you out of the game completely, some roles learn things when they die, and everyone still gets one final vote to attempt to win. The people that are into this game are really into it though, and that's not a scene I'm looking to get into.",
    "timestamp": 1716674400
  },
  {
    "username": "harzal",
    "rating": 4.0,
    "comment": "Too many liitle rules for each role which opens the door to many confusions between the players taking place. The drunk subrole introduces an element of utter chaos that goes against any meaningful deductions the villagers can make. Besides, there is very little room for the villagers finding out much during the first turns.\n\nAll in all, way too long for what it is. Not my cup of tea.",
    "timestamp": 1708642800
  },
  {
    "username": "wallstreetrebel",
    "rating": 4.0,
    "comment": "Many layers to this game, the group of 7 we played with really enjoyed the mental challenge.\n\nI found the lack of physical game pieces a greater challenge, I want to be able to see and interact with the world in a physical way.\n\nThis needs a group of people interested in the deep conversation about a thing. The other players very much enjoyed it, I would not participate in the future. 3/10",
    "timestamp": 1708470000
  },
  {
    "username": "tyclone",
    "rating": 4.0,
    "comment": "First impressions: I feel like being dead or a traveller is not that interesting or rewarding, and I'd rather be flat out eliminated. The game drags on way too long for me personally and I dislike the reliance on a moderator.",
    "timestamp": 1704668400
  },
  {
    "username": "Zubon",
    "rating": 4.0,
    "comment": "The Storyteller makes or breaks the game. The Storyteller is empowered to decide the outcome of many or most powers and decisions. That could keep everything interesting for the players or just be whatever interests the Storyteller while the players wait to see what the Storyteller decides happens this game.\n\n\"Everyone has an ability\" is a selling point but many of the abilities do not give information, choices, or actions. Of the 22 roles in Trouble Brewing, 6 abilities provide decisions to make; 4 provide one piece of information, once, which the Storyteller can choose to be false information; and 8 are entirely passive abilities that provide nothing for the player to do or learn. The Tinker is the extreme example: its ability is that the Storyteller can choose to have it die at any time for no apparent reason. The entire category of Outsider abilities is \"you are a hindrance to your team, worse than if you were not in the game.\"",
    "timestamp": 1699743600
  },
  {
    "username": "realityfoible",
    "rating": 4.3,
    "comment": "Blood on the Clocktower is a social confusion game; social deduction lacking deduction.\nEveryone gets special powers, but few are useful. Information is everywhere but is rarely consistant or meaningful. You don't know what roles are or aren't in play, can't determine if information is accurate, or even if the game is actively lying to players about what they know.\n\nWith very little ability to verify or trust information, sessions of BotC just feel arbitrary. Things certainly happen, but there's no strategy involved or cleverness to be had. Theorizing, discussion, and debate is pointless. Trying to deduce the game state is an act of hopeful futility.\nI find it incredibly frustrating.\nBotC is not a social puzzle. There is no signal to find from the noise unless the evil team shoots themselves in the foot. It's just chaos and hoping for the best. Some people love that - its a goofy silly thing where the game does all the lying for you.\nAbsolutely not for me.\n\nCredit where it is due: the writing about social dynamics in the rulebook is wonderful, and the physical design is phenomenal. Using the box itself as a modding tool is really cool, and the tacky felt that holds tokens in place feels wonderful to use.",
    "timestamp": 1699311600
  },
  {
    "username": "nukeu666",
    "rating": 4.0,
    "comment": "Werewolf in sheep's clothing",
    "timestamp": 1697752800
  },
  {
    "username": "Name1ess",
    "rating": 4.0,
    "comment": "There's a good chance you'll spend half the time with your eyes closed waiting to wake up dead. The Storyteller role is overpowered and can ramp up the chaos for any reason. Fun if you like lots of pointless arguing with lots of down time.",
    "timestamp": 1697666400
  },
  {
    "username": "Ephorus",
    "rating": 5.0,
    "comment": "What I like:\n- Creates great moments, especially when the game has ended and all the confusion has been lifted who had which role. The drunk and poisoned state adds so much more thinkyness and confusion to the game.\n- A lot of content and an amazing production. So far we've only tried the first two difficulty levels.\n\nWhat I dislike:\n- The nights where you keep your eyes closed take forever. This can be really annoying. Also, the game has a lot of book keeping which slows it down considerably. Also, the game master can only host the game and not join in on the fun.\n\nThis game might get fully replaced with Avalon The Resistance for me since it's 100 percent the fun without all the book keeping and downtime.",
    "timestamp": 1762038000
  },
  {
    "username": "Reciclerishu",
    "rating": 5.0,
    "comment": "Social deduction - werewolf/mafia based games with component and scenario upgrade, it has many improvements and what I like most - is that you are not just \"civilian\", you always get some power, which includes you into gameplay rather just existing.\nStill it massively depend on moderator and group, I had great experience with very good moderated games, but I can see how this could go downhill with wrong group.",
    "timestamp": 1761951600
  },
  {
    "username": "FranzK",
    "rating": 5.0,
    "comment": "Played this with 10 other people. The emergent story was lots of fun, and I really enjoyed this considering that social deduction isn’t usually something I go for. The one downside is that this game can go really long - the one play took about 3 hours.",
    "timestamp": 1758405600
  },
  {
    "username": "mjhm",
    "rating": 5.0,
    "comment": "multiple plays (philly)",
    "timestamp": 1758319200
  },
  {
    "username": "mawilson4",
    "rating": 5.0,
    "comment": "A gigantic deductive canvas upon which to socialize, BotC nevertheless suffers due to its length, and how some roles (or dying early) severely limit how much you can meaningfully interact. In a game that can last two hours, having one remaining action after, say, 15 minutes of play can be a brutally unpleasant realization, as can being mistrusted randomly early on. The ability to scheme throughout doesn't help much, as it will be harder to find willing dance partners, so to speak, when it's known you likely have to save your only action until the game's final rounds.\n\nI think it also misunderstands the role of moderators in some games, here giving them manipulative powers that in theory will keep things balanced but in reality just mean nothing ever feels like it's an authentic result of player actions.\n\nDespite the direct interaction, downtime can also be ponderous. This is especially true in more complicated scenarios, where the night time's procedural steps mean that multiple players are going to simply be left with their thoughts with nothing to do for 5-15 minutes.\n\nAt a couple late-night Con games (with those who have played a lot, and are thus more predisposed to the more convoluted scenarios) I nearly fell asleep during the protracted downtime where I had to keep my eyes shut. \"Had to fight against falling asleep\" is not exactly an endorsement.\n\nSo in trying to solve for the genre's occasional problems with its ideas, it reintroduces them in different guises at times.\n\nAs I've played more, it's also become obvious to me that the appeal for many is that they can turn it into a complicated logic problem and work out probable outcomes based on the roles and scenario. This is sort of the opposite of the interpersonal manipulation that lies at the heart of its spiritual predecessors like Werewolf/Mafia. And so the deduction lies in procedural, mechanical elements, not in people. This is the opposite of what draws me to this genre.\n\nThe opposite side of this is that the narrative elements are extremely strong. Even as I play homebrew scripts and with veterans players, mechanically it is ponderous, but its mega-fans are in it for the story. This is a valid way to experience the game; it just needs to come with the caveat that the buffeting forces of the game's supposed ingenuity will generally overwhelm the players' attempts to create an emergent narrative. If you just want a story, regardless of how you get there, the game will deliver. And if you can imagine your role in it, it confers a sense of ownership over the experience, which aids in enjoyment.\n\nThis will always be fun for a certain type of gamer who just wants the biggest, most sprawling game in which to sow chaos, dissension or hone deductive theories. I can create some of this fun for myself, so it's not without bright spots. But that's also the game demanding I make diamonds from coal on my own, rather than producing it organically through play, as the best social deception games seem to.\n\nSo it will lose many casual social deduction fans in that same ambition. I waffle on this one a lot, because despite all the negative comments above, it's highs are actually quite high. But I have been able to look around in most of the several sessions I've played and find some who are simply bored or frustrated. Occasionally it's me, but it's always someone. When that's the case, how can I endorse it?\n\nReview:\nhttps://bumblingthroughdungeons.com/blood-on-the-clocktower-...",
    "timestamp": 1757628000
  },
  {
    "username": "Mattlawson1234",
    "rating": 5.0,
    "comment": "There are just so many better social deduction games out there",
    "timestamp": 1757455200
  },
  {
    "username": "douglasfir7",
    "rating": 5.0,
    "comment": "I enjoy this more as a social activity than as a game. There might actually be some decent room for strategy here (especially in comparison with other social deduction games), but I prefer to just turn my brain off when I play. Most of the groups I play with have settled into a meta-game that emphasizes private conversations over public discussion. I think this probably is not good strategy for the good team (vs sharing all information openly at all times), but it's the more fun way to play. Roles that necessitate some secrecy for the good team are, therefore, highly appreciated (e.g the \"Damsel\" experimental role).\n\nEasily the best social deduction game I've played - it's killed all my interest in playing any others. I've probably played over 100 times now, and would still happily play more.",
    "timestamp": 1757282400
  },
  {
    "username": "rongbeo93",
    "rating": 5.0,
    "comment": "I don’t understand why this game is so popular—it’s basically just Werewolf with extra steps. The host can make or break the entire experience on a whim.",
    "timestamp": 1756677600
  },
  {
    "username": "fabericus",
    "rating": 5.0,
    "comment": "Boring, tedious and incredibly long. Why would anyone want to play this overhyped and overpriced things beyond me. To see this game ranked in the \"strategic\" board is hilarious (to date 16 people voted to classify it in \"strategy\", 16 in \"party games\" and almost now one in \"thematic\". Ironic). Secret Hitler does a much better job in allowing deduction, hence is imho superior. One night werewolf is why, way shorter. Hence the best choice by far (imho again).",
    "timestamp": 1752012000
  },
  {
    "username": "fortyrods",
    "rating": 5.0,
    "comment": "Social deduction games are never really my thing, and BOTC didn't do a whole lot to change that. I do enjoy the fact that you still have a presence after death, but there is so much agency given to the storyteller and so little to the players.\n\nThis one is hard to rank because it can be as high as a 7-8 with a great storyteller and a 2-3 with a bad one. Definitely met some cool people playing this, but I prefer games that are less on rails being directed by another person.",
    "timestamp": 1747346400
  },
  {
    "username": "Chronos1",
    "rating": 5.0,
    "comment": "Ok to play but not better than the lean and simple Werewolves as was promised. Too many unnecessary rules and extra's. Will obviously play again when I have the chance.",
    "timestamp": 1736636400
  },
  {
    "username": "Fravoc",
    "rating": 5.0,
    "comment": "Big group social deduction. Long wait between rounds and it takes a large group that knows each other reasonably well to really make things difficult and fun. Large group deduction is not my favorite thing really.\n\nDependent on talented DM as well to play up the twists and turns.",
    "timestamp": 1735686000
  },
  {
    "username": "Carnigula",
    "rating": 5.0,
    "comment": "A somewhat overproduced social deduction version of Sudoko. A bit of roleplay can help the experience but mechanically it's dissappointingly clunky in many ways, relies on someone who can guide the process without directing it too much, and it's essentially solvable which renders the roleplay element pointless, particularly with repeat plays. As far as the social deduction aspect goes, in the sense of reading and bluffing people it can actually be a less effective experience than games like Werewolf, the Resistance or SH and more of an acting gig, since the logic side can generally be puzzled out. If you're more into the puzzle side and less of the roleplay there are better suited alternatives out there. It's OK but struggling to see how the hype can be justified.",
    "timestamp": 1732921200
  },
  {
    "username": "Daedalica",
    "rating": 5.0,
    "comment": "Too long and not as gamey as I like.\nSmall group dialogues are not my thing.",
    "timestamp": 1732316400
  },
  {
    "username": "mdahl14",
    "rating": 5.0,
    "comment": "I'm quite surprised this is rated as highly as it is (#1 party game).\n\nMy group of 15 experienced board games spent 2.5 hours on game 1, then 2 hours on game 2 with 10 people. That is way too long for a party game.\n\nThere are similar games that are much shorter, but still have the same thrill of social deduction. This game also depends heavily on the storyteller, and that person can swing the game a lot by what information they share.\n\nI also didn't like how some players roles are useless, while others are much more important. That's fine for a short game, but it leaves a lot of players not having much to do. While its nice people can still participate when dead, they have much less power. I'd play it again, but only if I can't talk people out of playing a different game.\n\nI tend to review social deduction games low versus other games (4-6), so this may be some personal preference. I did like One Night Ultimate Werewolf, which can be played quickly.",
    "timestamp": 1728252000
  },
  {
    "username": "athanatus",
    "rating": 5.0,
    "comment": "I think this game really shines with the following but ONLY with the following conditions:\n\n1. Amazing storyteller who can magically set the atmosphere and juggle the balance\n2. Physically have a lot of spaces where people can talk in private\n3. A complete understanding of all possible characters among EVERYONE participating in the game\n\nWith these three conditions, this game becomes mediocre at best.\nThis is true to a point where in many occasions, it is actually much MUCH more fun to \"watch\" others play (e.g., NRB with good scripting and acting) than actually \"play\" the game.",
    "timestamp": 1726783200
  },
  {
    "username": "erikjanvanoosten",
    "rating": 5.0,
    "comment": "30 minutes of gameplay wrapped into at least 3 hours of hypotheticals and yes/no discussions. I have yet to play a game of this I didn't regret participating in..",
    "timestamp": 1723240800
  },
  {
    "username": "BoltKey",
    "rating": 4.7,
    "comment": "Another mediocre ordinary everyday social deduction game, and pretty basic at that. There are the good guys, the bad guys, the bad guys try to convince everyone they are the good guys, there are hidden roles that create chaos. I have seen this many times, and it has been done to death already. I don't see what this game brings to the table.\n\nDidn't have much fun. There were some fun and surprising moments, but not enough to justify the sheer amount of time the game took.",
    "timestamp": 1702076400
  },
  {
    "username": "snth",
    "rating": 4.8,
    "comment": "from a 9 to a 5 to a 1 after having played more and learned more.\n\nProbably the 1-rated game I have played the most.\n\nBack up to 4.8 after thinking that the storyteller role is similar to the Equalizer in Tayü and playing better scripts like Boozling.",
    "timestamp": 1701385200
  },
  {
    "username": "Fuzzel",
    "rating": 5.0,
    "comment": "Eine aufgepimpte Version von \"Werwölfe\" für den zehnfachen Preis ...",
    "timestamp": 1698793200
  },
  {
    "username": "Educatedguess",
    "rating": 4.5,
    "comment": "Slight improvement on Werewolf, but this is basically another random (and quite long) social deduction game with (potentially) a lot of talk but not much game. Avalon, Deception, Secret Hitler or Coup are better, shorter experiences, mainly because they are more structured. It is often claimed that in this game there is no player elimination, but I don't think this is true (if you are eliminated in the first few rounds, you will spend 1-2 hours doing nothing).",
    "timestamp": 1696111200
  },
  {
    "username": "Zalasta",
    "rating": 5.0,
    "comment": "Let me preface my comment by saying that I have not actually played Blood on the Clocktower, but rather have watched two games in their entirety. My biggest issue with this is that for me, social deduction games work because one can rely on the fact that the rules cannot be broken and can be trusted, so even if you don’t know who to believe, the game itself will not lie to you. Blood on the Clocktower on the other hand makes everything unreliable, giving the storyteller the unequivocal power of being to manipulate things throughout, thereby helping a team (usually the evil side) and lengthening the gameplay as they see fit. That just does not sit well with me, deduction is pointless when information is untrustworthy. Perhaps there is entertainment value in this, but the design is faulty.\n\nUPDATE: With two more sessions seen under my belt, including the next module of Sects and Violets, I’m even more convinced that Blood on the Clock Tower is simply more interested in a chaotic game, even at the cost of not following its own rules. For example, there was an instance where the poisoner targeted the undertaker, but instead of messing with his power, the storyteller opted to give him the truth as if he wasn’t poisoned, all because the result is more “interesting”. I’m sorry, I am all for showing people a good time, but if you have to break rules to manipulate the experience, what’s the point of them?\n\nFurthermore, death can be rather frivolous here. In mafia and werewolf the number matters, as such it is so important to stay alive. However, in Blood on the Clocktower people often volunteer to be killed, because the dead still gets to participate and have one final vote. While having no complete player elimination can be a good thing, but it definitely diminishes the urgency of building a good defense from being executed. In addition, you don’t even have to kill anyone, instead you can just mutilate a corpse. All of these reinforces the fact that BoTC will make sure every game won’t end quickly and pretty much always go down to either the final three or two.\n\nI am still very interested in playing this and maybe be proven wrong, but as a spectator I am torn, sure it is funny to watch people struggle against rules that are not reliable, but I am also frustrated that the storyteller can perhaps have too much personal influences into the game.",
    "timestamp": 1693951200
  },
  {
    "username": "Sir Pent",
    "rating": 5.0,
    "comment": "Yet another social deduction game. It is closer to Werewolf than it is to the Resistance. The good thing is that each person has a unique special ability. The bad thing is that it takes a REALLY long time and the information that people gain is too likely to be wrong due to poison or drunkenness. I much prefer Coup or Resistance.",
    "timestamp": 1693173600
  },
  {
    "username": "wkover",
    "rating": 5.0,
    "comment": "For the social deduction enthusiasts in my hobby circles, this is a lifestyle game. I don't question BotC's mechanical design, despite the fact that it isn't for me.\n\nI had a brief flirtation with Werewolf in the early 2000s. My first experience was amazing, then my interest waned with each additional play. These days I generally avoid SD games.\n\nMy introductory play of BotC was... OK. Each time the storyteller spoke, a new rule was introduced. Not great, but I can deal. I ended up playing twice, and my experience has now officially concluded.\n\nIronically, the host's big selling point was: Unlike Werewolf, dead players keep playing! That's only a benefit if you want to keep going.",
    "timestamp": 1688076000
  },
  {
    "username": "Jackieh9",
    "rating": 5.0,
    "comment": "Well made, I just don't really like social deduction games",
    "timestamp": 1686952800
  },
  {
    "username": "raitoning",
    "rating": 5.0,
    "comment": "It's an overproduced social deduction game that has some fun logic puzzles and a ton of content, but ultimately boils down to just set dressing for what is a pretty standard social deduction game with a recipe for fun that is entirely decided by your friend group and the people you're playing with. Was hoping for more structure and better logic puzzles but it boils down too often to blind guesses, trolling, and metagaming. You're also literally paying 200 bucks for a fancy box that like one person sees and interacts with per game.",
    "timestamp": 1684533600
  },
  {
    "username": "Entropology",
    "rating": 5.0,
    "comment": "This ranking is based on my personal frustrations of actually being able to play this. It's big, it's complicated and it is the poster child for 'event' game activity. Tried so many times, but people wouldn't show and we always fell below the number needed. Is this the game's fault? Mostly no, but somewhat yeah. Part of a game (and a ranking) is the ease of getting it played. Be it complicated rules, restrictive player counts, unintuitive icons, whatever reduces that is on the game. BotC sits in the tail of the 'playable' spectrum. I'm sure if you can make the perfect situation, it's divine. But I tried and couldn't make it work. It's both our faults.",
    "timestamp": 1684274400
  },
  {
    "username": "Shogun1981",
    "rating": 5.0,
    "comment": "It's Werewolf. Plain and simple. The roles are even all the same with one or two new ones added in. It just takes longer and requires enough space to have private conversations.",
    "timestamp": 1683237600
  },
  {
    "username": "EccentricOwl",
    "rating": 5.0,
    "comment": "Torturously long; Werewolf with more steps, more cost, and more confusion. I crave the sweet release of death but it does not come.",
    "timestamp": 1682200800
  },
  {
    "username": "ForeverAFK",
    "rating": 5.0,
    "comment": "A more complicated version of One Night Werewolf that doesn't live up to the hype created by Shut Up and Sit Down. I think I might have to play this one more but our first two games left me a little unimpressed. I feel like this game takes much longer and doesn't really offer anything unique to the table that One Night Werewolf already has. Sure, killed off players can make a vote after dying which is nice however there are so many roles it's a little overwhelming. The game is also incredibly expensive and requires a lot of people to properly play. Perhaps this game is too group dependent but I wasn't left with a great first impression. The production of the game is wonderful though, it just doesn't seem like production like this is justified for a social deduction game. Perhaps I need to get more familiar with the roles and scenarios, but my first impression wasn't that great but I'm willing to keep trying this game to give it another chance. It's basically a hardcore gamer's version of One Night Werewolf, which could be good or bad for the person playing. I do enjoy hardcore games but I just don't see the appeal of making a social deduction game hardcore, meaning more rules and roles which add room for different bluffing but you'll play as good as you are a bluffer in both One Night Werewolf and Blood on the Clocktower so I don't see a need for the extra room. It's also unfortunate that this game requires a moderator so one person is going to be left out from the game, although that again could be good or bad because I know some people enjoy DM'ing more than adventuring in D&D so I'm sure the same audience would be thrilled to moderate.\n\nI have to admit the production on this game is wonderful. The game looking like a book is charming and the game itself would make anyone passing by interested seeing this on the table. But with that said, I still don't see the justification for pimpifying a social deduction game considering this is a $150 game, when you can just get One Night Werewolf for 1/5 of the price.",
    "timestamp": 1681941600
  },
  {
    "username": "Urtho",
    "rating": 5.0,
    "comment": "Like most social deduction games, it is very group dependent. The group was fine, but I think there were just too many theatrical overheads for the game to be something I would seek out.",
    "timestamp": 1672009200
  },
  {
    "username": "goldspire",
    "rating": 5.0,
    "comment": "It's... fine. The game-play is good. Specifically, it's the best version of werewolf you could ever hope for. That said... it's still werewolf. It requires a storyteller and a group willing to roll-play a bit. It might get a 7 or 8 out of me if not for the mediocre component quality, the massively oversized box, and the ridiculous price-tag. I was anticipating something more like a poker chip for the roles and instead, got relatively thin cardboard \"tokens.\" The game feels neither premium nor prudently priced. Overall, a very expensive party game.",
    "timestamp": 1656972000
  },
  {
    "username": "FlamezOfGamez",
    "rating": 5.0,
    "comment": "If I wanted everyone to have a power in Werewolf and for everyone to be allowed to continue playing even after they die, I’d just play One Night Ultimate Werewolf. I respect the idea, but I prefer either just fully embracing Werewolf or fully embracing One Night.",
    "timestamp": 1641855600
  },
  {
    "username": "nswoll",
    "rating": 5.0,
    "comment": "The first scenario is great. I'd probably rate the game a 9. However, the \"mad\" mechanic introduced in the second scenario completely ruins the game.\n\nYou can't put a subjective rule in a game. That's design 101. The fact that the mechanic is completely open to interpretation really destroys an otherwise good game.\n\n\nThe amount of possibly false information that can occur in the second scenario also basically removes all strategy from the game.",
    "timestamp": 1633212000
  },
  {
    "username": "Abdul",
    "rating": 5.0,
    "comment": "Even with the basic set of roles, there more rules and powers than I care to learn for a social deduction game. How enjoyable the game is, seems too dependant on what kind of narrative the Storyteller wanted to make up. I didn't feel particularly invested in the outcome, and it just ran on too long.",
    "timestamp": 1578092400
  },
  {
    "username": "MegaLars",
    "rating": 5.0,
    "comment": "Quite drawn out for a game that adds little to the social deduction genre, good fun but not a succinct experience.",
    "timestamp": 1577833200
  },
  {
    "username": "theSlex",
    "rating": 5.0,
    "comment": "I jumped at the opportunity to learn this game at an official event at Gen Con. Unfortunately, the GM phoned in his effort, people trickled in late, and the game needed to be restarted 15 minutes in.\n\nI'd be willing to give it a second shot, but didn't really see what all the fuss was about.",
    "timestamp": 1573167600
  },
  {
    "username": "brandon75689",
    "rating": 5.0,
    "comment": "A decent game that adds minute details to an already oversaturated genre. Though I do not think that these additions reinvent the wheel in anyway. More depends on players than it does the game.",
    "timestamp": 1558476000
  },
  {
    "username": "chessbestboardgame",
    "rating": 6.0,
    "comment": "The main variable is if I'm poisoned or not, because without that, by the 3rth round all the good guys should have enough info to keep voting for the devils and easily win. Werewolf with extra steps, might be interesting with the right group and specially with the right host since one single mistake and a redo is necessary wasting everyone's time.",
    "timestamp": 1762297200
  },
  {
    "username": "johngarrison",
    "rating": 6.0,
    "comment": "The core is well done, but many of the roles are lackluster and some players feel unimportant or like they can't do anything. Highly variable experience, but has the potential to be a riot if you have the right people, in the right numbers, with the right roles. Not something I'd seek to play by choice, but if others are up for it I'll probably join in. There are worse ways to spend an afternoon.",
    "timestamp": 1761429600
  },
  {
    "username": "chipsmith",
    "rating": 6.0,
    "comment": "I've played 3 times now, all 3 times evil, and once I thought I was on the good side, but turned out I was the marionette (evil but doesn't know it).\nI have mixed feelings about this game. Newbies are absolutely lost in this game, and can impact the game in random ways. The games I've been in are with a group that has had many plays, and they understand the subtleties of the characters. So, as evil, trying to lie my way through the game without understanding all the roles has been very difficult. Perhaps I would feel differently if I finally got a less active \"good\" role, so I could mostly sit back and watch/understand the game better.\n\nThe group I played with has an excellent moderator, and I can tell the game overall is good... it just hasn't been a great experience for me personally. Maybe I'll give it one more chance, since I have the opportunity, but perhaps this game just isn't for me.",
    "timestamp": 1758492000
  },
  {
    "username": "Sigurd1410",
    "rating": 6.0,
    "comment": "Interesting experience",
    "timestamp": 1757887200
  },
  {
    "username": "Arial_Narrow",
    "rating": 6.0,
    "comment": "Un Castronegro 2.0, 15 veces más caro pero no 15 veces mejor. También es cierto que la mecánica de roles ocultos se me ha desinflado muchísimo con el paso del tiempo, las dinámicas son siempre muy parecidas.",
    "timestamp": 1757109600
  },
  {
    "username": "mr0santan",
    "rating": 6.0,
    "comment": "Happy to play every once in a while",
    "timestamp": 1756677600
  },
  {
    "username": "Smexy217",
    "rating": 6.0,
    "comment": "Pros:\n-A great game for large groups of people\n-An impressive amount of unique roles, each of which can be integral\n-Better than most other social deduction games at allowing dead players to contribute\n-Unironically a great way to meet new people, if joining open lobbies in the online version\n\nCons:\n-With it's large numbers of roles and interactions, it is less approachable than many other social deduction game (Werewolf, Secret Hitler)\n-While true of most social deductions games, it is no exception here that playing as the \"evil\" characters is much more fun\n-The skill gap between experienced and new players is noticeable and oppressive\n-Long play sessions (with 8+ players games can easily last more than 90 minutes)\n\nBlood on the Clocktower is a modern classic in the world of social deduction. Its clever addition of so many unique information roles makes each game play out very differently. However, all of these roles do make it a less approachable game for new players. Additionally, experienced players often have an easy time controlling the game when newer players are present, and that can be abrasive for anyone trying to learn the game. I would highly recommend playing only with groups all around the same skill level, as vast differences in experience will lead to newer players feeling lost, useless, and frustrated. I fully acknowledge that social deduction games aren't exactly my cup of tea, but I can appreciate the unique mechanics this one introduces, while still preferring the simplicity of \"Secret Hitler\". Overall, Blood on the Clocktower is a fairly complex social deduction game that presents a lot of depths for fans of the genre, and I am happy to hop into a game whenever invited.",
    "timestamp": 1756677600
  },
  {
    "username": "CHRISDH",
    "rating": 6.0,
    "comment": "There are some cool things with this social deduction game. I like that every role has some sort of ability, the presentation is great, and the addition of an extra vote for eliminated players really adds an extra level of strategy.\n\nThese sort of games fit in well with many groups. I typically like social deduction games to play quicker and be more of that filler. Blood on the Clocktower took up a good chunk of time, and it was fun, but I would want to play on occasions. For a longer game I would much rather play a Euro.",
    "timestamp": 1752616800
  },
  {
    "username": "Lord360",
    "rating": 6.0,
    "comment": "I understand why people enjoy it, but I feel only so-so about most social deduction games. Also don't know if I've ever played with the more advanced elements, which could change my view.",
    "timestamp": 1752530400
  },
  {
    "username": "MrFlovi",
    "rating": 6.0,
    "comment": "Social deduction for me is about finding a strategy to bluff your way through a game. You come up with a game plan, you execute it, maybe come along some obstacles along the way, and then see if it works out or not.\n\nYou make some bluffs ad rem, some things you might have already thought out before the start of the game. I enjoy social deduction games that have a lot of variety and stimulate creativity. One of the things this game does extremely well is keep confirmed information to a minimum and stimulate hiding information for later in the game.\n\nThat said, this game would seem perfect, and on one occasion, I brought it along to try out with a group of friends with whom I play Town of Salem for about 6 years. We tried two games of Trouble Brewing, and while I did somewhat enjoy what I saw at the table, many other players were bored or frustrated pretty quickly. Once a player found out after the game that they were drunk and therefore \"they were useless\", they were just furious. It wasn't the best experience for that group. It happens, I was disappointed, but I haven't written off the game because of these experiences.\n\nI really, really don't like the influence the game master has over the game. I've read the blog posts about the design choices, and this feels more like a storytelling game than strategic social deduction. Evils get a pre-made list of roles from the game master that are their claim space. In addition, the game master sets up a really limited list of roles that can be in play (about 20, average 12 good roles, 4 travellers, 4 minions, 4 demons). In my opinion, this really limits the creativity of the game to how much freedom your game master let's you have.\n\nThe game master influences not only the game, but also the social deduction aspect of the game, which I think is horrible. When I want to win, I don't want to thank my game master for helping me by shifting the odds in my favour to extend the game time. Shorter games where one team wins by a steam roll are okay, and makes the longer games stand out more and feel more special. This game sometimes tries too hard to be balanced, and in doing so, it lets go of all things that for me make a social deduction game enjoyable and rewarding to play.\n\nAlso it is overpriced by like 5x for a game that can be recreated on +/- 20 pieces of paper, pen and notebook. I just made my own version on some blanco playing cards, printed out a cheat sheet of the roles in play, and had pen and paper for the storyteller.",
    "timestamp": 1752098400
  },
  {
    "username": "AztecTwoStep",
    "rating": 6.0,
    "comment": "The final evolution of Werewolf/Mafia. Solves most of the issues by brute force - what if everything in the game was heavily curated, and the storyteller acted as a balancing force.\n\nIt is a success, and a lot of fun, but it shows the creaking, groaning old timbers beneath very sharply. Taking the game to such a fine level of tuning was a labour of love, but it still lives or dies on the same arguments and logic puzzles. I think the Resistance still respects player's time much more, and BSG provides a more engaging narrative layer, but this is a great argument engine.\n\nI'm just ready for the next big step forward in hidden traitor games.",
    "timestamp": 1747692000
  },
  {
    "username": "TheWrongTrousers",
    "rating": 6.0,
    "comment": "It cranks the complexity of the roles up to 11 but outside of some QoL touches to the formula, I found it way too involved and drawn-out, given none of my 3 roles gave me much to play with. I’d give it another go but only with a less chaotic role set.",
    "timestamp": 1745964000
  },
  {
    "username": "plataille",
    "rating": 6.0,
    "comment": "Have played this a ton at my store but there are WAY too many drunk roles.",
    "timestamp": 1743289200
  },
  {
    "username": "Sara_r",
    "rating": 6.0,
    "comment": "Tipo lupus, ma più complicato, con molti personaggi da ricordare",
    "timestamp": 1742511600
  },
  {
    "username": "asta",
    "rating": 6.0,
    "comment": "The ultimate social deduction game. I like watching this more than playing.\nThe regular groups in Auckland are borderline cults as people have become obsessed with this game.\n\nIt is incredibly good and does everything you want in a social deduction game brilliantly- I just can't play more that twice (at a push) in row as it drains my social battery more than any other game.",
    "timestamp": 1741993200
  },
  {
    "username": "ts0ng",
    "rating": 6.0,
    "comment": "I admit I don’t have enough experience with Social Deduction in recent years to say how well this stacks up against its peers. I understand and appreciate what it does differently from Werewolf or Mafia, but could not honestly say I would seek it out over either at this point. I’m sure based on what’s been relayed to me by its fervent fans that the game opens up remarkably as you become more familiar with all the possible roles and interactions, but I don’t play these games often enough to rack up that kind of mileage.",
    "timestamp": 1741561200
  },
  {
    "username": "tangentline",
    "rating": 6.0,
    "comment": "There’s a lot of depth and shenanigans that can happen and a good storyteller makes the experience better… But there still are some dead roles that can sit around not knowing anything and sometimes have to stay quiet to not reveal anything. There’s still the luck problem on abilities that can give too much information early. Furthermore all the drunkenness and dual appearance roles just make things unnecessarily muddy to complicate things. Rules explanations online and the publisher should be far more detailed especially for the individual roles instead of trying to pick it up midgame, summary sheet is vague and roles don’t workout exactly as they are described so it’s especially hard to bluff as a new evil player or strategize as good if things aren’t all explained.",
    "timestamp": 1741561200
  },
  {
    "username": "verandi",
    "rating": 6.0,
    "comment": "I get why this is considered best in class among werewolf style games, but the private conversation aspect turns me off. I understand this is the deeper game, but for my taste Avalon is preferred for its elegance and focus. Ultimately, I don't dislike social deduction, but it's not a genre I lean into.",
    "timestamp": 1740870000
  },
  {
    "username": "waferthinninja",
    "rating": 6.0,
    "comment": "Perhaps I am just too introverted to enjoy this. I just don't feel happy when I play, win or lose.",
    "timestamp": 1740783600
  },
  {
    "username": "mondkuss",
    "rating": 6.0,
    "comment": "I honestly don‘t get the hype about this game. It certainly is ok, but basically it is just Werewolves without the player elimination.",
    "timestamp": 1740178800
  },
  {
    "username": "Aladin1k1",
    "rating": 6.0,
    "comment": "Social Deduction",
    "timestamp": 1738796400
  },
  {
    "username": "DBAustin",
    "rating": 6.0,
    "comment": "Some really good ideas but some characters just do not have any agency and if go early have minimal involvement for a very long length of time.",
    "timestamp": 1738796400
  },
  {
    "username": "staygeeky",
    "rating": 6.0,
    "comment": "https://youtu.be/tJRpecmL5M0",
    "timestamp": 1737932400
  },
  {
    "username": "BBorneo",
    "rating": 6.0,
    "comment": "Fun social deduction game where the abilities are greatly designed to help player interaction, but also could be a bit difficult to grasp for non gamers. For those who never played a similar game could have a difficult time grasping the gameplay at first. Not my fav genre but I can understand the appeal",
    "timestamp": 1734649200
  },
  {
    "username": "taloskhaos",
    "rating": 6.0,
    "comment": "While social deduction games are not really my cup of tea and this one has relatively few game components, the interplay of the roles the simplicity of the system but the complexity of the powers + roles make this intriguing. I just will likely never enjoy playing it. I settled on a decent score, because I don't want to rate a well designed game poorly just because I am generally done with social deduction.",
    "timestamp": 1731798000
  },
  {
    "username": "KalElSkywalker",
    "rating": 6.0,
    "comment": "I am just not a fan of hidden role games and social deduction. This game is fine, but suffers from the same issues all of these games deal with. Lots of posturing and lying. I would rather spend my time playing something fun.",
    "timestamp": 1730415600
  },
  {
    "username": "lexay1415",
    "rating": 6.0,
    "comment": "I once again realise that I am not a mafia game person",
    "timestamp": 1729461600
  },
  {
    "username": "cenealon",
    "rating": 6.0,
    "comment": "2023 New-to-Me Games Ranked",
    "timestamp": 1727992800
  },
  {
    "username": "LeoHike",
    "rating": 6.0,
    "comment": "Overly complex, hard to remember all the roles in play and all the role claims you hear. Imagine playing with 11 other players where each of them claims to be one of 2 or one of 3 roles. Good luck remembering 20+ claims and making sense of them. This game is \"wide\" and shallow compared to Avalon. Avalon has much simpler roles, but then it allows for deeper chains of thinking, deceiving, bluffing, deduction, etc.\n\nIn Avalon, I enjoyed playing even during my first game ever. In BotC, even after 20+ games, it is hard for me to bluff and I never enjoyed the game to the same degree as Avalon.",
    "timestamp": 1726869600
  },
  {
    "username": "emmaak",
    "rating": 6.0,
    "comment": "Social Anxiety - The Game. Not necessarily the kind of anxiety I’m after in a board game, but it has had its moments for sure.",
    "timestamp": 1726437600
  },
  {
    "username": "TwiznessAsUsual",
    "rating": 6.0,
    "comment": "someone got paid for turning Mafia (a free camp-style game) into a board game ~ Sid owns",
    "timestamp": 1725314400
  },
  {
    "username": "RainbowRawen",
    "rating": 6.0,
    "comment": "People love it. It's basically like werewolf, but with more complex roles and you stay in the game after your death. Social deduction...\n\nBUT the options are always so many that you can never be sure. Some game-set-ups are making the game absurd because of that.",
    "timestamp": 1722463200
  },
  {
    "username": "Lukashi",
    "rating": 6.0,
    "comment": "Not a bad experience, but not so great as a game.\nA bit of setup, game master needed, Avalon still a king",
    "timestamp": 1722204000
  },
  {
    "username": "Edag",
    "rating": 6.0,
    "comment": "Very engaging and involved social deduction experience perfect for groups of any size. Learning curve can be steep if you don't usually play games of the genre and is heavily reliant on having an able player as moderator. Not for everyone but clicks a lot of boxes for my groups.\n\nPlayed some pnp versions",
    "timestamp": 1720216800
  },
  {
    "username": "joeyvigil",
    "rating": 6.0,
    "comment": "Played it with a lot of people, did not know what was going on",
    "timestamp": 1715551200
  },
  {
    "username": "GypoNolan",
    "rating": 6.0,
    "comment": "Too long and some of the roles are hell to play unless you're very experienced",
    "timestamp": 1713996000
  },
  {
    "username": "KevinNoBacon",
    "rating": 6.0,
    "comment": "Felt like an overcomplicated version of werewolf.",
    "timestamp": 1713650400
  },
  {
    "username": "JESUSisCHRIST",
    "rating": 6.0,
    "comment": "Meh.\n\nComplex. Too complex for my liking?\n\nToo long at 1.5 hours for 10 people.\n\n(-) Mixing experienced players who are domineering amongst many newer players turns out to be less ideal, because of the lack of structured speaking times, and the complexity, will leave many players in the dust.\n\nModerator can balance, but then becomes part of the meta-game.\n\nProbably only for aficianados, or good for a recurring group.\n\n10+1+2 player game, Strategicon 2024,",
    "timestamp": 1708210800
  },
  {
    "username": "ErrantSword",
    "rating": 6.0,
    "comment": "I prefer to Storyteller, rather than a player",
    "timestamp": 1704495600
  },
  {
    "username": "drunkcrunkfranken",
    "rating": 6.0,
    "comment": "Game has a lot of crunch so I can see why people like it, and the fact that the dead stick around and talk gives the game a distinct flavor not found in other games (though I'd hesitate to say that this is \"better\"). The downside to this is that it takes a fair bit of time to teach, especially with a larger group.\n\nUltimately the amount of decisions in the game that are left up to the discretion of the moderator represent a huge ding on what might otherwise have been the perfect heavy social deduction game.\n\nI ended up selling my copy because I can't see myself wanting to play this over Mafia/Werewolf. Hell, maybe I'll even try this Witch Hunt game that's been sitting unplayed on my shelf for years.",
    "timestamp": 1703718000
  },
  {
    "username": "HicSuntDracones",
    "rating": 6.0,
    "comment": "Very dependent on Storyteller to be fun. With a good one it can be fun, but often it does not leave me with a good feeling - often frustration. Being evil is also very stressful.\nI am also not sure that the game has solved the player elimination problem, I always see the early dead players checking out mentally, not really interesting to be part of the game at that point if you never got to contribute (yes, I know you can still vote and talk, but I usually see people being very little invested, me included)",
    "timestamp": 1700694000
  },
  {
    "username": "Shinkenshi",
    "rating": 6.0,
    "comment": "This is a pretty decent social deduction game, but I feel like there are too many single points of failures. What I mean by this is that your level of enjoyment greatly depends on the group, role you receive, your storyteller, and the scenario you are playing. Any one of those things can ruin your enjoyment of a game, so it'll result in some incredible highs and pit bottom lows. I can feel the appeal behind the theme, the deduction, and the teamwork, but I need the experience to be consistently good for me to dive more into the game.",
    "timestamp": 1699916400
  },
  {
    "username": "bneffer",
    "rating": 6.0,
    "comment": "This is a game that requires one player to run the game. I never like that. That said - most of these players seem happy to do so in the way a GM would be for an RPG. I think an RPG with a good GM is better. But this is an interesting game - just bigger and more than I think I'd go for myself.",
    "timestamp": 1699570800
  },
  {
    "username": "Santosolkt",
    "rating": 6.0,
    "comment": "Only social deduction extremists should play this game. There are way too many characters' abilities with added layer of uncertainties due to certain effects like drunken and poison that makes everything even more confusing than they already are.",
    "timestamp": 1695506400
  },
  {
    "username": "onepilgrim",
    "rating": 6.0,
    "comment": "Somewhere between Werewolf and Two Rooms and a Boom lies Blood on the Clocktower. It fixes the player elimination problem of Werewolf (good), while extending the downtime/night phases considerably (bad). If you aren’t lucky enough to draw a meaningful role that gets to act during the night phases be prepared to effectively sit-out half of the game with your head down and eyes closed. Furthermore, the moderator is effectively a super-powered dungeon master (one who gets to pick outcomes rather than roll the dice), significantly determining the outcome of games and minimizing the influence of players. The rating I gave here is dependent on playing with the right crowd and the right set of house rules.",
    "timestamp": 1691532000
  },
  {
    "username": "syedshowmic",
    "rating": 6.0,
    "comment": "Advanced version of Werewolf essentially.\n\nWhat it fixes is player elimination.\n\nHowever, I don't really love this game. And the reason is that this game \"pretends\" to add logical deduction. I use the word \"pretend\" since within the game space and liberty given to the story teller to \"balance\" the game the logical deduction can be misinformation. Thus there are branching possibilities that emerge when the evil team is experienced and plays well. In Resistance, the information available is purely social cues. I respect that game for offering a more pure social deduction experience. Adding logical deduction to the formula seems like a fantastic addition and I would wholeheartedly welcome it, had it not been for the feeling that good play by evil team can create counter branches of logic that there is no way to disproof. Thus you are left with a social deduction game with extra steps.",
    "timestamp": 1688508000
  },
  {
    "username": "slyestfox",
    "rating": 5.5,
    "comment": "I prefer the great social dynamic of Werewolf. BotC always just feels random, with the storyteller utilizing their balancing options throughout the game to keep anyone from ever knowing anything for sure. Nights take *much* longer and the game takes longer in general. Players also *frequently* drop the ball in this game by fundamentally misunderstanding how the core game or their roles work. Rarely an issue in Werewolf or other social deduction games.",
    "timestamp": 1685656800
  },
  {
    "username": "JedderCheese",
    "rating": 6.0,
    "comment": "played it once as a semi unprepared thing and we didnt set up for a whole session so take it with a grain of salt",
    "timestamp": 1684274400
  },
  {
    "username": "heyman31891",
    "rating": 6.0,
    "comment": "As far as social deduction games go, this one is fine but ultimately it's still social deduction which isn't my favorite. Also a bit long. Werewolf but players can get up and have private discussions and dead players still get one more vote.",
    "timestamp": 1682978400
  },
  {
    "username": "Skymory",
    "rating": 6.0,
    "comment": "Like most social deduction games, how much you enjoy this game is very playgroup dependent. It has interesting mechanics that set it apart like being able to talk and affect the game even after you die, roles that all have special abilities and a storyteller (player not in the game like a DM) who can make decisions and tells the players what happens. There's a lot of strategic depth to these games and lots of replayability.\n\nThat said, I want to emphasize how important the players playing the game is. Since each role has an ability and players are always relevant to the game, it's very easy for a few players who has a lot of information to dictate the win/loss of the entire game. This is especially true once you get to groups larger than 10 players and things get more chaotic. Unless you play with the same group, you can find yourself investing 1-2 hours into a game that gets progressively less fun through no action of your own, simply based on other players.",
    "timestamp": 1680732000
  },
  {
    "username": "Andy Parsons",
    "rating": 6.0,
    "comment": "The problem with Werewolf is that there’s too little information on which to base accusations. Anyone, like the Seer, who knows something about who’s who, must feign ignorance for fear of an untimely death. It boils down to who is best able to influence others.\n\nThe problem with Blood on the Clocktower is that there’s too much information. Anonymous villagers are now gone; everyone has a role, more of them know something about who’s who, and others are expected to behave in observable ways. Beyond the lies of the demon and his minion(s), some of the things the good guys find out will be false. Sorting the facts from the falsehoods may be possible, but that requires the kind of open communication that gets people with powers or knowledge killed.\n\nMuch has been made of this game solving the problem of player elimination. The dead remain active participants, with their powers and voting rights curtailed. Setting aside the oddity of this concept, death does still feel like defeat and I have seen players become much less engaged after it happens to them. While the Storyteller may encourage open communication by the townsfolk, death remains a disincentive to that. Ultimately, the result may still boil down to those powers of persuasion.\n\nThe big box, the lectern, a whole host of characters, and the fuzzy felt pieces are all very nice, but paying £120+ for a souped up version of a public domain game offends my sense of value for money.",
    "timestamp": 1678489200
  },
  {
    "username": "iadena",
    "rating": 6.0,
    "comment": "Better at higher player count, like 7 plus. At 5 and less, it is random and humans tend to default to who they are friends with in real life rather than logic. At higher player count, I like that all players can participate and feel like they can do something about. No need to own.",
    "timestamp": 1677970800
  },
  {
    "username": "moneybee517",
    "rating": 7.0,
    "comment": "Got to try this game at a gaming retreat and enjoyed the experience. Not a game I can regularly play given that its operates best with a large group, but I wouldn't mind playing again.\n\nVery much liked the fact that there isn't player elimination and I got to play a cool role (undertaker).\n\n+13 players",
    "timestamp": 1762210800
  },
  {
    "username": "ZZBrent",
    "rating": 7.0,
    "comment": "This is a well designed system but, similar to D&D (and many other role playing based games) this is highly dependent on the game master.",
    "timestamp": 1760911200
  },
  {
    "username": "MattAndersson3",
    "rating": 7.0,
    "comment": "Surely a good option for a party game even though I think the playing experience is affected by the type of players. I honestly find difficult to find players willing to play this kind of games in the right way. The game master can help to make the game more smooth but it loses a lot of appeal if players are not all able to play it well.",
    "timestamp": 1760047200
  },
  {
    "username": "Astronica",
    "rating": 7.0,
    "comment": "Very good social deduction game, if you like mafia/palermo you're gonna love this one. It is really engaging and intriguing as everyone has an ability and something to \"talk about\". Negatives are the \"dungeon master\" who has to facilitate the game though not really playing, and he needs to be on top to speed the game. For me though it's quite longer than what I'd prefer and it's quite group-dependent. It must be said as well, it's really overpriced for what you get.",
    "timestamp": 1758578400
  },
  {
    "username": "cid78250",
    "rating": 7.0,
    "comment": "For sale",
    "timestamp": 1757628000
  },
  {
    "username": "GXY_BGG",
    "rating": 7.0,
    "comment": "Don Paco, via AsN.\n\nes una edicion ultra deluxificada (y \"no declarada\") del clasico \"hombres lobo de castronegro\".\n\nla premisa es la misma... aldeanos, lobos, nominaciones, votaciones, sospechas, muertes... (la mayoria de ellas, evitables). lo que cambia es la \"portada\". presentacion muy currada, impresion de alta calidad para manuales, fichas, etc. y una serie de marcos argumentales y de roles con acciones especificas, todo ello muy trabajado.\n\npero al fin y al cabo... lo dicho, es el hombres lobo de castronegro de toda la vida. si te cabe, te lo vas a pasar camion. si no tanto (como a mi)... pues \"oc\"\n\neste ademas tiene otra caracteristica que si eres Don Paco (propietario del juego y que dirigió la partida), pues ni tan mal, pero si no, tanto el que asuma el rol como los que jueguen, tienen un problema: es un juego super dependiente de que El Narrador (que dirige la partida pero NO juega) se lo curre muchisimo. Como ya digo, en la partida (realmente fueron 2 partidas) que jugue yo, cero problemas porque en eso Don Paco es un crack. pero me imagino una partida de esto narrada por Yeray (con todos los respetos, yo te quiero un monton, pero de narrar un juego vas regularcito y de dirigirlo no siendo participe, mas aun) y mae mia, mae mia el desastre que puede ser eso... xDDD\n\nle doy un 7 por la presentacion, por el trabajo argumental que lleva encima y por la excelente labor del Sr. Don Francisco. Al juego de por si, le daria un 5. y gracias.",
    "timestamp": 1757023200
  },
  {
    "username": "DeadDomino",
    "rating": 7.0,
    "comment": "I've played this a handful of times now and I've watched some online games. I think I like the idea of the game more than I like actually playing it. Maybe it's just because I'm bad at lying and I've almost always been on the evil side, but I've often left an evening feeling drained rather than energised.",
    "timestamp": 1755640800
  },
  {
    "username": "Jestertrek",
    "rating": 7.0,
    "comment": "Hard game to rate! It lives or dies based on the strength and experience of the storyteller, so an individual game of BOTC can be epic or can be rubbish depending on that. The scripts, roles, and special rules add a lot of replayability, style, and ingenious and unique ways to play, so a +1 for that. However, in the end it doesn't stray very far from its Werewolf roots and if you aren't a fan of the core concept, BOTC is not going to sway you away from that. For players who do enjoy the core concept, this will quickly become a lifestyle game. For the rest, it's just something to try once to say you've done it.",
    "timestamp": 1755036000
  },
  {
    "username": "byturn",
    "rating": 7.0,
    "comment": "complex mafia game with no common folks",
    "timestamp": 1753394400
  },
  {
    "username": "Cjhutchi",
    "rating": 7.0,
    "comment": "Better then Werewolf, not as good as Avalon.",
    "timestamp": 1753394400
  },
  {
    "username": "hexpixy",
    "rating": 7.0,
    "comment": "I'm not big on social deduction games, but if i had to play one, this would be it",
    "timestamp": 1752098400
  },
  {
    "username": "Emil1979",
    "rating": 7.0,
    "comment": "Played at my local Board Game Cafe (Dine & Dice, Branson MO). I like it a lot, but it requires a host. Thus, I don't actually recommend buying this game. Rather, I think it's best to find your local board game cafe to see if they will host a session. It is great fun, but probably not worth the price to own.",
    "timestamp": 1751925600
  },
  {
    "username": "Qhorin",
    "rating": 7.0,
    "comment": "As much fun as I can ever have with social deduction.",
    "timestamp": 1751752800
  },
  {
    "username": "Frog0fWar",
    "rating": 6.5,
    "comment": "8-15 (9-12)",
    "timestamp": 1751407200
  },
  {
    "username": "AetasAaM",
    "rating": 7.0,
    "comment": "I have only played this game four times so far, mostly with strangers. It was pretty fun, and I could see how there's a lot of deduction and social interaction complexity in this game, potentially making it a really \"maximal\" version of the werewolf-type games. I don't think it's exactly my type of game though. I think I prefer the fast rounds and greater focus on social interactions than complex logic. I'll update my rating as I play more.",
    "timestamp": 1750543200
  },
  {
    "username": "Desiderata",
    "rating": 7.0,
    "comment": "It's a heavier social deduction game in the same category of Werewolf. Probably best with experienced players, bc a newbie who gets the demon may well struggle to remain hidden. Overall, this is a good time.",
    "timestamp": 1750197600
  },
  {
    "username": "harty_oz",
    "rating": 7.0,
    "comment": "Great social deduction game. Deeper than Werewolf.",
    "timestamp": 1748728800
  },
  {
    "username": "thedacker",
    "rating": 7.0,
    "comment": "TLDR; not a great game per se, but a great thematic experience. Best served with close friends and all the thematic touches you can throw at it.\n\n--\n\nBlood on the Clocktower's popularity isn't due to great game design. In fact, within this genre, I think it's one of the worst designs. The problem is that the designer wanted to have a character in the game that could counter the ability of every other character in the game. (The designer actually said something to this effect in an interview I watched, so this isn't just an opinion.) And while I can see how this might be exciting in design, it breaks down for me in practice, because in the end, you can't EVER know anything for sure, because there could always be that other character that nullifies the usefulness of your special ability.\n\nFrom a game design perspective, this adds up to be nothing more than an exercise in frustration to me. I use my power to learn some information...that ultimately could be nothing more than a red herring because there's that other character that means I can't rely on any information I get with my special power. Blah.\n\nMy favorite game in this genre is The Resistance: Avalon. Before each round, everyone knows exactly which characters are going to be in the round. So the social puzzle is solvable--hard yes, but ultimately, solvable. And when you use a special power from your character to learn information, you can trust the information and the game becomes convincing your cohorts about your information while the baddies are lying to them with another story. I much prefer this kind of experience to that of BotC.\n\nHowever, BotC isn't all bad. In fact, it's BEST OF GENRE in two categories: experience and production.\n\nI will be keeping BotC in my collection for now. But I'll probably only play it once a year or so. When I do, I'll pull out all the stops. I'll send custom invitations with a BotC-themed design. We'll dress up as our favorite character from the scenario's character list. (And by sending the character list ahead of time, I will have already made the game better by giving participants incentive to study the characters). We'll do lighting, appropriate snacks, move furniture around, etc. etc. This is where the real fun of BotC will emerge.",
    "timestamp": 1748383200
  },
  {
    "username": "dr.morton",
    "rating": 7.0,
    "comment": "Needs the right people to work.",
    "timestamp": 1747692000
  },
  {
    "username": "ItsMagic",
    "rating": 7.0,
    "comment": "convincing permanently bluffing communicative differencing fantastical ...;\nFeed the Kraken? favoured;\nfavoured over Among Cultists, One Night Ultimate Werewolf, Gathering of the Wicked, Crossfire, Secret Hitler",
    "timestamp": 1745013600
  },
  {
    "username": "Avid_Equinox",
    "rating": 7.0,
    "comment": "+ Adds plenty of interesting additional concepts on top of social deduction\n+ Status effects are cool\n+ plenty of interesting/different character roles\n+ Great design decisions such as the Traveller mechanic if someone needs to leave early or arrives midway through, also the Angel mechanic to help new/young players. Shows good thought to the fact that it's a game played by real people instead of balanced on a dry spreadsheet.\n\n- Still can suffer from the \"he said/she said\" dynamic that most social deduction games fall to (sometimes there's not enough evidence to make any real deductions).\n- Hard to table it: very long game to play and also needs a high amount of dedicated social deduction lovers (which is a love/hate game genre)\n\nWorth experiencing for sure, but no need to own it",
    "timestamp": 1745013600
  },
  {
    "username": "hiimjosh",
    "rating": 7.0,
    "comment": "Sects & Violets gets a 7, Trouble Brewing gets a 5. It's not so radically different from other social deduction games, but it is perhaps too complex. I prefer fast games which are more about body language and cues. This one moves faster than my brain can process, and I enjoy it less.",
    "timestamp": 1741561200
  },
  {
    "username": "emagius",
    "rating": 7.0,
    "comment": "A cut above the other “social” social deduction games like Werewolf/Mafia with a hands-on storyteller and without full player elimination, but overall I prefer the more game-y side of the genre (BSG, Resistance/Avalon, etc.).",
    "timestamp": 1739833200
  },
  {
    "username": "Afrochiapet",
    "rating": 7.0,
    "comment": "Blood on the Clocktower is the answer to those praying for a rich and robust social deduction game. Inside a giant grimoire is an assortment of player roles, modules, and other ingredients to make any social gathering devolve into a suspicious, paranoid mess. BotC succeeds in creating tension and atmosphere with a relatively economic amount of rules and setup. A DM interested in crafting or adapting a scenario for their players to improv/deduce a whodunit mystery will be hard-pressed to find a better option on the market. It is an easy recommendation for anyone who loves the genre, and that…is my caveat.\n\nI must come clean as an ambivalent social deductor. I generally have a distaste for juggling role-playing and deductive reasoning, enjoying the latter much more than the former. BotC’s strong framework does not prevent the variability of player agency. The flow of a game session can range from a dramatic storybook reveal to a tedious conversation grind. BotC conceptually tickles my fancy of seeing how variable game and puzzle states resolve, but I thus far have not experienced personal highs from playing the game itself. I can see why people revere it, but it does not move the needle for me.",
    "timestamp": 1738450800
  },
  {
    "username": "cplayer99",
    "rating": 7.0,
    "comment": "I guess I was expecting more after the SU&SD review of it. Maybe it plays better at a larger player count (I played with 9). There was not as much drama as I expected for the number of varying roles available.",
    "timestamp": 1737414000
  },
  {
    "username": "thealexhopp",
    "rating": 6.5,
    "comment": "Seems a bit overrated to me. Just my opinion. You have to be a very good liar in this game.",
    "timestamp": 1734822000
  },
  {
    "username": "Cheesechick",
    "rating": 8.0,
    "comment": "Yes, it's \"just Werewolf\" but it addresses the two questions that anyone who has ever played Werewolf has asked:\n\n1) Why do some villagers just not get special powers?\n2) What, I'm just supposed to sit here and WATCH after I die?\n\nAnd it even answers a question no one has when playing Werewolf, but absolutely will after playing Blood on the Clocktower:\n\n3) Why doesn't Werewolf's box turn into a fancy little lectern and book?!\n\nAbsolutely absolutely need more plays (with the same group!) to see the full breadth of the roles and understand their interactions. How interesting the interactions are will absolutely make the game, I'm sure.\n\nI don't think a game like this can replace One Night Ultimate Werewolf for me, in terms of sheer # of laughs and having that puzzly aspect that I crave... but it sure as shit can replace Werewolf.",
    "timestamp": 1762383600
  },
  {
    "username": "fluiwd",
    "rating": 8.0,
    "comment": "As a player, I enjoy Blood on the Clocktower (BotC) only slightly more than Werewolf (the Wolfen variant with no player elimination).\n\nHowever, in terms of moderating, I like Blood on the Clocktower a lot more than Werewolf because I have more control and the Grimoire makes it much easier to track the game state. This is important to me because I tend to be the one moderating.\n\nI would enjoy Werewolf (no-player-elimination variant) even if I were a villager who got killed on the first night because for me, the fun is in the social deduction and reading the body language of other players.\n\nHowever, all the players I've introduced BotC to prefers it over Werewolf because there are more unique roles in BotC which makes it more interesting to them, although it does increase the complexity of the game.\n\nThe unique roles in BotC also makes it so that most players have some information to offer. This makes it easier for quieter players to participate because the more talkative players still needs to get information from everyone. It also makes it more fun for the moderator because there are more ways to set up the game depending on the players.\n\nAs far as I can tell, there are only two downsides to BotC.\n1. The box is huge which makes it difficult to transport. In contrast, you only need a deck of cards for Werewolf.\n2. It is quite expensive compared to most other games.\n\nThat said, I'm happy with this purchase as I want a diverse collection and this definitely fits a niche: fun party game that supports many players. Probably the best Werewolf experience that you can get currently.",
    "timestamp": 1762124400
  },
  {
    "username": "adel9591",
    "rating": 8.0,
    "comment": "The best social deduction game I've played and solves all the problems I experiences in other such games. By abstracting the actions players take and keeping them hidden helps obscure the roles of players in a balanced and tense way. Drawbacks are that it requires a GM and has a laughably exorbitant price point for what is basically a bunch of rulebooks and player aids in a big box.",
    "timestamp": 1761429600
  },
  {
    "username": "AndrewRK",
    "rating": 8.0,
    "comment": "Super fun with a good group, but can be a little bit of a miss sometimes. An excellent convergence of ideas that have spawned from Mafia and its ilk, proposing engaging, enjoyable solutions to many of the original game's core \"problems\".",
    "timestamp": 1760824800
  },
  {
    "username": "jezambranos",
    "rating": 8.0,
    "comment": "Dificultad to play fue to narrator and number of people",
    "timestamp": 1760738400
  },
  {
    "username": "Togii",
    "rating": 8.2,
    "comment": "Strategic Depth: 7/10\nRNG Mitigation: 9/10\nGoofiness Potential: 10/10\nSimplicity: 6/10\nArtistic Direction: 8/10\n\nTime Commitment: 60+ min",
    "timestamp": 1760306400
  },
  {
    "username": "joeeoj010",
    "rating": 8.0,
    "comment": "it's a lifestyle game for a lot of people, so that's saying something positive about its legs. my take is that this is everything I always Werewolf to be - a game with a good amount of logic and actual deduction in addition to the social element. I think it is a little difficult to get into as a newcomer, because getting a large group on board together is tough, and jumping in with with players with hundreds of games experience is going to be a challenge regardless of how welcoming they are",
    "timestamp": 1760220000
  },
  {
    "username": "skur78",
    "rating": 8.0,
    "comment": "Noviembre 2024",
    "timestamp": 1759960800
  },
  {
    "username": "jejuma",
    "rating": 8.0,
    "comment": "En español",
    "timestamp": 1759701600
  },
  {
    "username": "DaneTheBeast",
    "rating": 8.0,
    "comment": "Played (IRL)",
    "timestamp": 1759701600
  },
  {
    "username": "dj_koen",
    "rating": 8.0,
    "comment": "There is no set of roles that i really like but i always had tons of fun with this game",
    "timestamp": 1759528800
  },
  {
    "username": "sid4321",
    "rating": 8.0,
    "comment": "Andres",
    "timestamp": 1759010400
  },
  {
    "username": "MrNobody012",
    "rating": 7.5,
    "comment": "Probably the best social deduction game I've ever played, but my experiences have been sort of hot and cold",
    "timestamp": 1758751200
  },
  {
    "username": "GattoNero25",
    "rating": 8.0,
    "comment": "plus Etsy upgrades",
    "timestamp": 1758405600
  },
  {
    "username": "AmongFriends",
    "rating": 8.0,
    "comment": "This game can get really thinky with all the possible combinations of who everyone and even who you can be. You have to be able to come up with the different scenarios in your head. It's not enough to know someone is bad. You have to know which bad person they are.\n\nI enjoy it. It's got a lot more going on than your average Werewolf game. But it also has this weird hump you have to get over to understand the game. You have no board to look at, people are lying to you so they can't help, and you could potentially give something away by asking or saying the wrong thing.\n\nOnce you get past all that, it's a good game, but sometimes I do wonder if the juice is worth the squeeze for this one.",
    "timestamp": 1758060000
  },
  {
    "username": "The Flame of Error",
    "rating": 8.0,
    "comment": "Could be a 10, but I occasionally feel burnt out on it after a game.",
    "timestamp": 1757282400
  },
  {
    "username": "Prophdng",
    "rating": 8.3,
    "comment": "JX",
    "timestamp": 1756936800
  },
  {
    "username": "Valcurdra",
    "rating": 8.0,
    "comment": "Obtuse and demanding, but ultimately, a transcendent and unique design, more of a lifestyle commitment than most other games, but worth it.\n\nAs a player, you have a perfect experience of social deduction, the game was clearly extensively play tested and refined into an incredible state. There are a tonne of roles that are interesting, but more importantly create a tangled interplay of mechanisms that create strategy, tactics and enough confusion to muddy the waters without being completely obscure. Blood on the Clocktower is a mechanical masterpiece that achieves something that no other SD game has ever achieved, good side players are motivated and need to lie. In every other SD game, only bad guys lie, this is handled in various ways by the respective games, but its a fundamental design glitch of the genre, BOTCT is the only experience that offers a solution to this and for that alone, its a significant design.\n\nThe flaws however are not trivial, firstly you need a game runner, this is far from ideal as it involves a level of self sacrifice and ultraism is in short supply in many cases. You also benefit form a large group of players, 9-16 is gleefully supported, but small groups are not. Thankfully this game seems to have a huge level of community engagement, spawning clubs and enthusiasts, willing to carry the torch, to keep this game alive. Bless their accursed hearts, for their passion and dedication, in some cases paid, but in many not. If you have a group for this, deep dive, it will be a phenomenal experience. If not and you live outside a major population centre, just close window and move on, its not happening for you.\n\nComplexity wise, this game is all in, you have a tonne of roles, complex interactions, obtuse and unexplained mechanisms and likely experienced players in the game, that will have an advantage, you will feel lost and overwhelmed at times as a new player and experienced players have the responsibility to not exploit that in an unfair way, yet they also should try to carry the team through adversity. In my experience the social contract and polite etiquette is required and shouldn't really work, and yet, it is fulfilled by motivated players\n\nBlood on the Clocktower is an impossible premise that is so ambitious it should have fallen in a disastrous heap. Yet, that same ambition that has spawned an entire sub culture and if that's not the ultimate compliment, I don't know what is. If you have a group 10, if not 0, its that type for game for sure.",
    "timestamp": 1756936800
  },
  {
    "username": "deedee1504",
    "rating": 8.0,
    "comment": "Medium weight social deduction.\n\nPros\n+ no player elimination\n+ many characters, often with unique powers\n+ replayability. different scenarios offer new challenges\n\nCons\n- requires an administrator to play, effectively removing them from the game\n\nOverall\nNot as groundbreaking as its reputation would lead you to believe, but still comfortably sits atop the other contenders in the genre.",
    "timestamp": 1756504800
  },
  {
    "username": "parzi42",
    "rating": 8.0,
    "comment": "werwolf on crack. cant decide if there is too much randomness or if it is just me not being capable enough in this game.",
    "timestamp": 1756159200
  },
  {
    "username": "Sedd",
    "rating": 8.0,
    "comment": "Im Grunde haben wir hier ein aufgebohrtes \"Werwölfe\" / \"Nacht in Palermo\" oder wie es sonst noch heißen mag.\n\nEs gibt in meinen Augen 3 kleine Dinge die große Änderungen bewirken und dieses Spiel echt gut machen:\n1.: In der 1. Nacht stirbt der Erzähler und kein Spieler.\" Lasst uns seinen Mörder finden!\"\n2.: In der ersten Nacht erhalten (normalerweise) einige Spieler ein paar Informationen und es muss daher nicht jemand aufgrund von \"Da drüben hat es geraschelt\" hingerichtet werden.\n3.: Wer gestorben ist, kann trotzdem mitreden und sogar noch ein mal, im gesammten, restliche Spiel, eine Stimme abgeben. Manche Charaktäre bekommen sogar erst durch Ihren Tod Informationen.\n((4.: Es gibt mehrere Szenarien))\n\nDas Grundszenario Trouble Brewing reicht prinzipiell aus – ich habe damit bereits über 20 Partien gespielt und freue mich auf weitere. Die beiden anderen Szenarien sind ebenfalls empfehlenswert (mehr Infos, siehe Unten), erfordern jedoch deutlich mehr Einsatz vom Spielleiter. Einige Fan-Szenarien auf der offiziellen Website sind zudem als „empfohlen“ markiert und erweitern das Spiel sinnvoll.\n\nWichtig: Die erste Nacht zieht sich üblicherweise, da der Erzähler viele Informationen verteilt. Auch die ersten Spieltage sind erfahrungsgemäß lang, laut und mitunter emotional – das kann anstrengend werden. Eine Partie dauert insgesamt deutlich länger als Werwölfe, bietet dafür aber auch mehr Tiefe in Sachen Kommunikation und Deduktion.\n\nDer Einstieg ist aufgrund der vielen Rollen nicht ganz leicht, macht das Spiel aber spannender. Allerdings ist der Preis von rund 150 € für diese Art von Spiel sehr hoch – trotz der schönen Aufmachung, etwa dem buchförmigen Karton. Außerdem braucht man eine ausreichend große Runde, was spontane Spielabende erschwert.\n\nNach über 20 Partien fällt auf: Durch die Vielzahl an Informationen gibt es oft mehrere plausible Gründe, warum jemand gut oder böse sein könnte. Das kann ermüden und macht einfachere Social-Deduction-Spiele wie Werwölfe aus dem Düsterwald manchmal sogar reizvoller – einfach weil sie schneller gespielt sind.\n\nFazit: Ich spiele Blood on the Clocktower sehr gern mit – am liebsten sogar. Aber selbst kaufen? Eher nicht. Für meine Sammlung reichen Werwölfe, Tempel des Schreckens, Bühne frei!, 2 Rooms and a Boom oder Das perfekte Alibi völlig aus.\n\nEDIT zu \"BAD MOON RISING\": Es unterscheidet sich insofern mit dem \"Trouble Brewing\"-Szenario, das es viel weniger Infos gibt. Man kann aber viel daraus schließen was in der Nacht passiert ist. Sterben mehrere, oder vielleicht gar keiner. Kommt vielleicht sogar jmd. von den Toten zurück?\nDie Characktäre sind komplett andere. Es bringt mehrere Characktäre mit Betrunkenheit ins Spiel.\nInsgesamt ist es etwas anstrengender (vor allem für den Spielleiter), macht aber genauso viel Spaß. Es sollte aber nur mit erfahrenen Blood o. t. C.-Spielern gespielt werden. (Tipp: erst nach 10 Partien \"Trouble Brewing\")\n\nEDIT zu \"SECTS AND VIOLETS\": Ich sag nur, der Arme Spielleiter, der viel managen/nachhalten muss. (Aber hier zeigt sich teilweise, warum das Spiel so kostenintensiv ist.)\nInsgesamt liegt der Fokus darauf, das alles sehr wage ist. Ein Dämon und auch ein Bürger können durch falsches wählen das Team wechseln. 2 Schergen sorgen dafür das man Sie entweder ganz genau kennt oder weiß das dieser bestimmte Scherge dabei ist.\nDie Außenseiter wollen am besten unbekannt bleiben und die interessante Eigenschaft rund um \"Besessenheit\" kommt dazu.\nFazit: Auch hier empfiehlt es sich, nur mit erfahrenen Blood o. t. Clockt.-Spieler zu spielen. (nach etwa 10 Partien \"Trouble Brewing\"). Vor allem der Spieleleiter sollte schon einige Runden geleitet haben. Außerdem empfiehlt es sich, mit der richtigen Anzahl an Leuten zu spielen, damit potentiell alle 4Dämonen fürs Szenario gewählt werden können. Alles in allem, wieder etwas anderes und spannendes.",
    "timestamp": 1755986400
  },
  {
    "username": "KevTheRenegade",
    "rating": 8.0,
    "comment": "I think it can be very fun with the right group which I don't really have.",
    "timestamp": 1755640800
  },
  {
    "username": "tmoiynmwg",
    "rating": 7.5,
    "comment": "The boundless mystery of forum mafia distilled and perfected in board game form. Great for fun post-mortem discussions to discover how everything unraveled.",
    "timestamp": 1755468000
  },
  {
    "username": "earlNetwal",
    "rating": 8.0,
    "comment": "Still waiting on kickstart, will update if product is ever received.",
    "timestamp": 1755468000
  },
  {
    "username": "jubilant_decimeter",
    "rating": 8.0,
    "comment": "amogus but better",
    "timestamp": 1755122400
  },
  {
    "username": "mybiggestanemone",
    "rating": 8.0,
    "comment": "Very intimidating to new players. But it's a great social deception game once you know how to play it. I've been betrayed a couple of times and I've caused a lot of drama.\n\nI played a script that was not Trouble Brewing one time and it was so chaotic it gave me a headache.",
    "timestamp": 1755122400
  },
  {
    "username": "FaceInAClock",
    "rating": 9.0,
    "comment": "PnP copy",
    "timestamp": 1762470000
  },
  {
    "username": "ZuluXray",
    "rating": 8.5,
    "comment": "party - social deduction",
    "timestamp": 1762038000
  },
  {
    "username": "ditterio",
    "rating": 9.0,
    "comment": "One of the best social deduction games out there. A little complex for a party game but a lot of fun!",
    "timestamp": 1761778800
  },
  {
    "username": "Uniquilizer",
    "rating": 9.0,
    "comment": "Blood on the Clocktower is always a great pickup. My friend group really enjoys the conversation and deductions involved in every game. Sometimes situations can go wrong, but otherwise I would recommend for anyone who loves a bit of lying and not the bigger price tag.",
    "timestamp": 1761606000
  },
  {
    "username": "Fencejummper",
    "rating": 9.0,
    "comment": "The best mafia style game I have ever played, not close. I really enjoyed the game a lot and the suspense was awesome.",
    "timestamp": 1761606000
  },
  {
    "username": "nikmd23",
    "rating": 9.0,
    "comment": "- Token Holder",
    "timestamp": 1760652000
  },
  {
    "username": "michaelderr",
    "rating": 9.0,
    "comment": "If Trouble Brewing were the only script in this game, it would still be the best social deduction game I've played. The fact that it has so much more packed into it is astonishing. This game is as fun to run as it is to play.",
    "timestamp": 1760479200
  },
  {
    "username": "chayashida",
    "rating": 9.0,
    "comment": "This seems like the ultimate social deduction game.\n\nOn my first play, I was one of the new people in the group and was a bad guy both times. I was found out pretty easily. It was hard to figure out what to do. It didn't help that we sat in a circle and ate snacks - it was really hard to have private conversations with other players.\n\nShoe and Christina hosted a game a second time, and the two games we played there made me realize that I do really love this game. Even if you are \"killed\", you are still involved in the game, as you can use your final vote once.\n\nIt's expensive, and I saw a copy at a local store, but I have the feeling that I'd *always* be the one running the game and never get to play.\n\nThis game might be stuck being a convention or event game, but I think it's still the best social deduction game I've played to date. I'm just not sure that I'd want to run a game.",
    "timestamp": 1760220000
  },
  {
    "username": "Xyt4n",
    "rating": 9.0,
    "comment": "+ + better than Werwolf in every way (but Mafia is still something different)\n+ very good rules\n+ multiple scenarios\n+ narrator has still some interesting decisions to make",
    "timestamp": 1759442400
  },
  {
    "username": "Pelle0809",
    "rating": 8.5,
    "comment": "Not a huge Social deduction player, but this one is a lot of fun. Nice mix of actual deduction and bluffing / misleading people. Storyteller has a lot of control, so it is highly dependent on having a good story teller.",
    "timestamp": 1759356000
  },
  {
    "username": "yu_mao",
    "rating": 8.8,
    "comment": "什么是狼人杀？没听说过。",
    "timestamp": 1759183200
  },
  {
    "username": "Devin_D",
    "rating": 9.0,
    "comment": "I own a janky self made copy, but I love this game",
    "timestamp": 1758837600
  },
  {
    "username": "Mirlord",
    "rating": 8.7,
    "comment": "De momento me falta mucho por probar, pero lo que he visto me ha gustado mucho y todo lo que me falta por probar, me promete tanto que me emociona solo pensar en futuras partidas. Siento que puede ser un juego muy grupo dependiente y que incluso de una partida a otra puede cambiar mucho a nivel de sensaciones y en cuanto a tu propia agencia en la partida. No obstante, siento que la variabilidad tan alta que tiene de escenarios, personajes y de la narratividad que facilita a la persona narradora hacen que las partidas puedan brillar por encima de otros juegos de roles ocultos.",
    "timestamp": 1758837600
  },
  {
    "username": "BGMarc",
    "rating": 9.0,
    "comment": "This is pure entertainment",
    "timestamp": 1757973600
  },
  {
    "username": "GonkalBell",
    "rating": 9.0,
    "comment": "Possibly the greatest, but also most complicated social deduction game. At first it might just seem like werewolf with extra roles. But all the roles interact to make a puzzle that you can reason out. But there's still enough misinformation that the game isn't completely solvable.",
    "timestamp": 1757368800
  },
  {
    "username": "teslion64",
    "rating": 9.4,
    "comment": "Pretty much the best mafia style game I have ever played. Scenarios range from easy to understand if you are playing for the first time up to custom \"absolutely mind-boggling for anyone\", which is pretty great.",
    "timestamp": 1756677600
  },
  {
    "username": "PraxisLoki",
    "rating": 9.0,
    "comment": "So good.",
    "timestamp": 1756504800
  },
  {
    "username": "Gusiluz23",
    "rating": 9.0,
    "comment": "2024 (noviembre)",
    "timestamp": 1755381600
  },
  {
    "username": "noob99",
    "rating": 9.0,
    "comment": "One of the best social deduction games out there; similar to Mafia/Werewolf but everybody gets a special ability.",
    "timestamp": 1755381600
  },
  {
    "username": "storied",
    "rating": 8.5,
    "comment": "First play was excellent. It's a really well crafted piece of social deduction and puzzle solving. Timing is key in this game. When to lie, when to reveal important information. Understanding that timing is a delightful experience.",
    "timestamp": 1755122400
  },
  {
    "username": "DrSammyD",
    "rating": 9.0,
    "comment": "Favorite social deduction game, and I've mostly run the game.",
    "timestamp": 1754776800
  },
  {
    "username": "Gernial",
    "rating": 8.9,
    "comment": "Anders als Werwölfe von Düsterwald, mit paar Stärken und Schwächen im Vergleich. Neueinsteiger können durch Unwissen leicht Gruppenerlebnis schmälern.",
    "timestamp": 1754604000
  },
  {
    "username": "Matisa00",
    "rating": 9.0,
    "comment": "Homemade",
    "timestamp": 1754258400
  },
  {
    "username": "Geogimli",
    "rating": 9.0,
    "comment": "gespielt Berlin Con 2025",
    "timestamp": 1754258400
  },
  {
    "username": "Quadenstein",
    "rating": 8.6,
    "comment": "Belongs to Toni now. Great social deduction game. A lot of fun! Quick game. 8 to 12 players are perfect. The players just need chairs, no table necessary.",
    "timestamp": 1754085600
  },
  {
    "username": "LloydGM",
    "rating": 9.0,
    "comment": "Kills all other social deduction games for me. This might just be the best boxed game ever created...",
    "timestamp": 1753653600
  },
  {
    "username": "K1L5B",
    "rating": 10.0,
    "comment": "Custom Copy",
    "timestamp": 1762210800
  },
  {
    "username": "devilfer",
    "rating": 10.0,
    "comment": "Grenyas\n\n\"Hombres lobo\"-like",
    "timestamp": 1762210800
  },
  {
    "username": "rywoods",
    "rating": 10.0,
    "comment": "From a storyteller perspective, I think the game is pretty incredible. I really enjoyed crafting the puzzle for my group of players. How can I make each role involved? How can I make information important and relevant while still making a close game for evil? What kind of traps would be fun but fair to throw in to make some chaos? All these questions asked for the sake of a memorable experience.\n\nI myself questioned agency of the players during these decisions, but there are no retroactive choices here, they are made before the first night, providing a baseline consistency before the discussion and killing unfolds.\n\nFrom a player perspective, I think I can see how you might feel uninvolved, especially if you are killed pretty early and don't get to use your ability. But I love how the storyteller has a lot of agency to attempt to help people and avoid this scenario. Something I will do going forward will be to take new players aside and give them some suggestions on ways to perform their role, such as.. \"they could protect good players by claiming important roles, since you'll still have information when you die\". Also encouraging private conversations seems like a good way to be more involved as well, as you can talk with your cohort of information to make sense of the bit of chaos you have been given... and it allows you to talk without being talked over, which evil would love to do. One of the best game interactions stemmed from one of these private conversation, so I will encourage them greatly going forward.\n\nDespite being crafted from the story teller, the game gives an incredible amount of agency to players to determine the story themselves. The moderator being a consistent supporting force provides a player guide and confidant, and a stable pillar for ensuring people get to speak and calming the group if things get out of hand.\n\nWas also expecting night time to take way longer, but never took more than a couple minutes.\n\nCan't wait to play again!",
    "timestamp": 1762124400
  },
  {
    "username": "Gediablo",
    "rating": 10.0,
    "comment": "As a social deduction game this solve the issue of being dead for hours early in big games if you die first. A bit daunting as a new player learning all the roles and how they interact even if you have played other social deduction games a lot. That the storyteller can adjust the balance through some decisions during the game had strengths and weaknesses - make the games more even, but can also take away from making you feel like you solved the game making it more random of who ends up winning in the end. Storytelling this game takes a lot of practice.",
    "timestamp": 1762038000
  },
  {
    "username": "h2omax",
    "rating": 10.0,
    "comment": "Home made",
    "timestamp": 1761606000
  },
  {
    "username": "Steezish",
    "rating": 10.0,
    "comment": "2/10/25: What an experience. I don't think I want to play any other pure social deduction game besides this into the future.\n\n6/13/25: Played one night ultimate werewolf and all I could think about was how cool it would be to show that group blood on the clocktower.\n\n10/26/25: Had 2 games of this last night that played out so differently than all of the other times. I truly believe this game will stay in my collection forever and will almost always be a hit.",
    "timestamp": 1761429600
  },
  {
    "username": "DommyyJayy",
    "rating": 10.0,
    "comment": "Little bit stressful at times but i am obsessed with this game and have so much fun playing it! more interesting and puzzle solving than werewolf, keen to play again and again!",
    "timestamp": 1760997600
  },
  {
    "username": "whitecatplays",
    "rating": 10.0,
    "comment": "The rumors are true.",
    "timestamp": 1760738400
  },
  {
    "username": "mhoku",
    "rating": 10.0,
    "comment": "Best of the genre! Best a social deduction game can be",
    "timestamp": 1760565600
  },
  {
    "username": "Sirell",
    "rating": 10.0,
    "comment": "I'm always down for social deduction games. I use these with my students as storyteller and they tend to just sit in a circle together and play, but when I play with adults as a player, we always get up and make groups and talk to everyone, make alliances based on deduction, etc. So your mileage my vary based on the vibe that your players set down, but despite this, everyone always has fun in this game.\n\nThis is probably the best one I own, but only at player counts of 10+. At lower counts, Quest, Avalon, or No Touch Kraken/Don't Mess With Cthulu tend to be a bit better and faster to set up (and I can participate as player, not storyteller).\n\nBut if anyone asks if I'm down for a Blood on the Clocktower even after a grueling day or week at work, the answer will always be yes. If you wake me up at 4am and ask me if I want to play Blood on the Clocktower, I'll say yes. Even if I have to go to work at 6am.",
    "timestamp": 1760565600
  },
  {
    "username": "todd_mcdonough",
    "rating": 9.6,
    "comment": "Fun: 9.4\nArt: 10\nAccessibility: 9.5\n\nTotal = 9.6",
    "timestamp": 1760392800
  },
  {
    "username": "KauriToa",
    "rating": 10.0,
    "comment": "Started off as a hater for no reason but now I love it. Play a game or two every fortnight.",
    "timestamp": 1760392800
  },
  {
    "username": "Lorelei_Cheshire",
    "rating": 10.0,
    "comment": "LOVE this game, great for big groups and so dynamic, it solves a lot of the issues with this type of game in creative ways, like keeping the dead involved in the game and giving the moderator or storyteller enough agency to really make the game pop.",
    "timestamp": 1760220000
  },
  {
    "username": "Platnumxstatus1",
    "rating": 10.0,
    "comment": "This is the greatest social deduction game I have ever played. I've started Storytelling and I e gotten friends into the game just as much as me",
    "timestamp": 1760220000
  },
  {
    "username": "yaenz",
    "rating": 10.0,
    "comment": "The pricepoint of Blood on the Clocktower is ridiculous, there's no way around it. With that out of the way, this game produced some of my greatest experiences in board games. As with all social deduction games, the group itself holds the power, the game is only the catalyst.",
    "timestamp": 1759183200
  },
  {
    "username": "adi_venturer",
    "rating": 10.0,
    "comment": "BotC is the peak of social deduction games. This is not a genre I find myself usually engaging with, but I have a lot of fun every time I do. This game is clearly a cut above the rest in this category though. One of the main reasons behind this is that there is no player elimination - in fact, knowing when to get \"killed\" and timing of executions is a core part of the strategy of the game. Given unique player roles, the game is designed to allow people to break into groups and have sidebars before discussing things as a group. This is so much better than being at the same table with all information being public, as in games like Secret Hitler. This is a really well-executed design.\n\nI was a bit sad to see Dycrypto being replaced as the #1 party game on BGG, but Blood on the Clocktower is a very worthy successor. I got sucked deep into this world as soon as I played my first game, and now find myself seeking live games in my city, as well as binging NRB episodes on Youtube. This game rates at a rare 10 for me.\n\n(Plays: 70+)",
    "timestamp": 1758578400
  },
  {
    "username": "Jarekk82",
    "rating": 10.0,
    "comment": "Ein grossartiges Social-Deduction-Spiel! Alle Mitspielenden haben eine Rolle mit Spezialfähigkeit - und wer stirbt, darf weiterhin mitspielen. Tolle Ausstattung und hochwertige Anleitung.\nEinziger Nachteil: Das Spiel ist richtig teuer.",
    "timestamp": 1758578400
  },
  {
    "username": "Lecaro",
    "rating": 10.0,
    "comment": "Kurzrezension:\nIn einem entfernten Ort, kurz nach Mitternacht, zeigen die Menschen erschrocken hoch zum Glockenturm, an dessen Zeiger die Leiche des weit bekannten 'Geschichtenerzählers' hängt!\nWer steckt hinter diesem grausamen Mord? Die Anzeichen lassen nur die Vermutung zu, dass dämonische Mächte ihr Unwesen treiben! Doch wer ist der Dämon und wer sind seine Helfer?\n\nSpielablauf:\n\"Blood on the Clocktower\" ist ein 'Social Deduction' Spiel, bei dem die Spieler zu Spielbeginn geheime Rollen mit Sonderfähigkeiten erhalten.\nZudem werden die Spieler in zwei verdeckte Fraktionen mit gegensätzlichen Zielen aufgeteilt. Der Dämon und seine Schergen möchten das Dorf und jeden Bewohner darin zugrunde richten. Die Dorfbewohner suchen den Dämonen und möchten ihn auf dem Scheiterhaufen verbrennen.\nNachdem jeder Spieler einen Chip aus dem Sack gezogen hat, sammelt der Geschichtenerzähler - ein neutraler Spieler - alle Chips ein und vermerkt sich diese in seinem Grimoire. Jeder Chip wird passend zum Sitzplatz der Personen in dieses Buch gesetzt, sodass der Geschichtenerzähler jederzeit nachhalten kann, welcher Spieler welche Rolle innehat.\n\"Blood on the Clocktower\" ist in Nacht- und Tag-Phasen unterteilt. In der Nacht geht der Geschichtenerzähler herum und weckt bestimmte Personen in einer festen Reihenfolge auf. Die aufgeweckten Spieler erhalten geheime Informationen oder führen aktiv Aktionen aus. Ab der zweiten Nacht tötet der Dämon jedes Mal einen Spieler seiner Wahl.\nDie Kommunikation der Nacht geschieht im Stillen und ausschließlich per Handzeichen.\nAm Tag diskutieren die Spieler in kleineren oder größeren Gruppen, was sie in Erfahrung gebracht haben und wer der Dämon sein könnte. Das Ziel der meisten Bewohner ist, diesen ausfindig zu machen und auf dem Scheiterhaufen zu verbrennen.\nDoch Vorsicht. Der Dämon ist direkt unter ihnen und auch er nutzt seine Informationen, um im Dorf Verwirrung zu stiften. Außerdem ist er nicht allein!\nAm Ende jeden Tagens können Spieler dazu nominiert werden, hingerichtet zu werden. Erhält eine Person mindestens die Hälfte und die absolute Mehrheit der Stimmen der lebenden Personen, wird diese gehängt. Andere Nominierungen und Argumente können das Blatt aber jederzeit wenden und doch eine andere Person zum Tode verurteilen.\nDer Tod ist nicht das Ende! Die Dämonen-Opfer und hingerichteten Spieler spielen weiterhin mit und versuchen ihre Fraktion zum Sieg zu führen. Sie verlieren beim Sterben lediglich ihre spezielle Fähigkeit und können für den Rest der Partie nur noch ein einziges Mal für eine Hinrichtung abstimmen. Geister erhalten zudem oft ein erhöhtes Vertrauen der Dorfbewohner und sind damit ein wichtiger Bestandteil des Spiels.\nAnders als in anderen Sozial-Deduktion-Spielen werden Spieler dazu aufgefordert aufzustehen und sich in kleinen Gruppen im Raum zu verteilen. Gespräche könnten aber jederzeit belauscht werden! Stehen Räume zur Verfügung, können sich Spieler auch im Geheimen besprechen. Wer mit wem redet, könnte natürlich wieder Aufschluss über die Gesinnungen der Spieler geben.\nWurde der Dämon ausfindig gemacht und hingerichtet, gewinnen die Dorfbewohner. Sind nur noch zwei lebende Personen im Dorf und der Dämon ist unter ihnen, gewinnt er mit seinen Schergen!\n\nErweiterungen:\nIn der Grundbox sind bereits drei verschiedene Skripte enthalten, denen feste Rollen zugeordnet sind, wobei aber niemals alle Rollen gleichzeitig mit von der Partie sind, sodass jede Partie wirklich einzigartig ist.\nDie Spielerfahrung, die jeder Spieler mitbringen sollte, erhöht sich in den drei Szenarien, sodass unerfahrene Spieler mit 'Trouble Brewing' anfangen sollten, bevor sie mit den anderen tiefer in die Welt abtauchen.\n'Trouble Brewing' ist das empfohlene Einsteiger-Script. Es enthält einfache Rollen mit grundlegenden Fähigkeiten, die für eine Deduktion nicht zu verwirrend sind.\nIn 'Bad Moon Rising' erhöht sich der Schwierigkeitsgrad dahingehend, dass die Spieler ihren eigenen Tod riskieren müssen, um an wichtige Informationen zu kommen. Dafür können sie von verschiedenen Rollen beschützt oder sogar wiederbelebt werden! In diesem Skript gibt es zudem eine Auswahl an vier verschiedenen Dämonen, die alle etwas anders funktionieren und so nicht mehr so einfach identifiziert werden können. Einer davon muss sogar zweimal getötet werden, um wirklich tot zu sein!\nBeim dritten Skript 'Sect & Violets' steigt der Chaosfaktor für alle Fraktionen deutlich an. In diesem Skript wird die Besessen-Mechanik eingeführt. Die davon betroffenen Spieler müssen vorgeben, eine bestimmte Rolle zu sein. Machen Sie das in den Augen des Spielleiters nicht überzeugend genug, werden sie noch am Tage von ihm getötet. Es gibt auch in diesem Skript mehr als einen möglichen Dämon und das Dorf muss erst einmal herausfinden, mit welchem sie es zu tun haben. Außerdem wird der Spielleiter selbst mit einbezogen, da manche Rollen mit ihm direkt interagieren können, um auf diese Weise an Informationen zu kommen.\n\nMeinung:\n\"Blood on the Clocktower\" hat mich durch eine Welle von Gefühlen gezogen. Im ersten Aufeinandertreffen hatte ich kein wirkliches Interesse am Spiel selbst. Ich dachte, es sei wieder ein \"Werwölfe\"-Klon und es würde recht schnell in der Versenkung verschwinden. Doch das Spiel tauchte in vielen Medien der Brettspielszene auf. Allen voran hat es 'Thomas' von 'Better Boardgames' so stark beworben, dass ich es mir doch näher anschauen wollte.\nNach einigem Studium habe ich die deutsche Ausgabe vorbestellt. Doch da mir diese nicht früh genug ausgeliefert wurde, musste ich mir eine eigene Version basteln, die einige Male erfolgreich zum Einsatz kam, bevor ich mit dem Originalmaterial arbeiten konnte.\nDabei war meine erste Partie ein wahres Wechselbad der Gefühle. Nach der Regelerklärung von 'Trouble Brewing' dachte ich mir, dass der Geschichtenerzähler im Grunde alles steuern kann und je nach Laune die eine oder andere Seite zum Sieg führt. Während der ersten Nacht verstärkte sich mein schlechtes Gefühl sogar noch, denn sie dauerte ewig, ohne dass auch nur einer gesprochen hatte oder ich aufgeweckt wurde. Der Höhepunkt war erreicht, nachdem alle wieder wach waren und wir uns nur fragend anschauten … wie es jetzt weitergeht!\nDann kam aber sehr schnell der Durchbruch, als Spieler aufstanden und sich Grüppchen bildeten. Wer redet mit wem und warum? Wer hat was herausgefunden? Erste Theorien machten sich breit und am Ende des Tages wurde dennoch keine Anklage erhoben.\nDie nächste Nacht verging vergleichsweise schnell und am darauffolgenden Tage war ich tot!\nIn diesem Moment stellte ich fest, dass der Tod nicht das Ende ist und mir vielmehr eine Sonderstellung einbrachte. Denn plötzlich vertrauten mir die anderen, weil es unwahrscheinlich klang, dass der Dämon sein eigenes Gefolge töten würde.\nSo konnte ich die Informationen der einzelnen Spieler sammeln, filtern und meine eigene Theorie aufstellen, die uns schlussendlich - nach nur ein paar wenigen Nächten - zum Sieg führte.\nEin geniales Gefühl, das ich so noch nicht erlebt hatte.\nMeine erste von mir selbst geleitete Spielsession fand in Vollbesetzung, mit 15 Spielenden statt. Dies war so nicht unbedingt beabsichtigt, aber hat dennoch sehr gut funktioniert.\nIn den folgenden Partien kam es leider immer wieder dazu, dass sich einige wichtige Rollen - aufgrund von Unwissenheit - zu früh im Spiel verrieten, sodass sie recht schnell starben. Mir als Geschichtenerzähler bleiben in einem solchen Fall kaum noch Möglichkeiten, die schwache Seite zu unterstützen, um wieder ein Gleichgewicht herzustellen.\nGelernt habe ich sehr viel aus diesen ersten Partien. Beispielsweise lockert ein kleines Buffet die Atmosphäre auf und regt zum Diskutieren an. Außerdem ist eine feste Zeitvorgabe von fünf bis zehn Minuten pro Tag-Phase, ein guter Fixwert, der eingehalten werden sollte, da sich das Spiel - vor allem gegen Ende - sonst sehr in die Länge ziehen kann. Die Teilnehmer können dann am Tagesende gerne noch kurz in großer Runde weiterdiskutieren, bevor es zur Abstimmung kommt.\nMit steigender Spielerfahrung der Gruppe verringern sich die Leichtsinnsfehler und das Spiel wird immer spannender. Auch die beiden anderen Skripte 'Bad Moon Rising', 'Sect&Violets' und sogar einige experimentelle Rollen, die ich von der Homepage geladen habe - konnten wir schon ausprobieren. Sie fordern nicht nur die Spieler, sondern auch mich als Geschichtenerzähler, da sehr viele Informationen nachgehalten und weitergegeben werden müssen, ohne Fehler zu machen.\nBei der Menge an Informationen, die ich als Spielleiter festhalten und entscheiden muss, passieren mir noch heute immer mal wieder kleinere Fehler. Doch selbst diese führen zu keiner schlechten oder abgebrochenen Partie. Das Spielkonzept ist so robust, solcherlei Dinge auszugleichen.\n\"Blood on the Clocktower\" schreibt in seinem Genre vor allem die Deduktion groß. Die Spieler müssen die bruchstückhaften Informationen wahrhaftig ermitteln. Sie müssen die Lügen herausfiltern, um an die Wahrheit zu kommen, ohne schlicht zu raten, wie es in anderen Spielen der Fall ist.\nEine sehr große Verantwortung hat der Geschichtenerzähler. Er ist der Einzige, der alle Rollen kennt und muss im richtigen Moment einschreiten, wenn eine bestimmte Situation eintritt, zum Beispiel wenn Spieler vergiftet, betrunken oder ähnliches sind. Die Spannung steigt und fällt mit einem guten Spielleiter.\nIch selbst liebe es, diese Rolle einzunehmen. Ob ich sie gut ausfülle, müssen die Bewohner meiner Dörfer entscheiden!\nBedauerlicherweise funktioniert \"Blood on the Clocktower\" in kleineren Gruppen nicht wirklich gut. Ab acht Teilnehmern entfaltet es aber bereits einen großen Spielspaß. Wir haben dennoch einige Partien zu sechst ausprobiert und haben dafür die Tiny Town Skripte 'Over The River' und 'No Greater Joy' verwendet. Diese funktionieren in diesen kleinen Runden zwar besser, dennoch kann ich \"Blood on the Clocktower\" in dieser kleinen Besetzung nur bedingt empfehlen.\nEine feste Großgruppe, die sich regelmäßig zum Spielen trifft, habe ich bereits ins Leben gerufen und ich freu’ mich darauf, noch viele, viele Sessions leiten zu dürfen. Seit dem Release der deutschen Ausgabe sogar mit dem Original-Spielmaterial.",
    "timestamp": 1758319200
  },
  {
    "username": "NotBrandonJaspers",
    "rating": 10.0,
    "comment": "Have The Carousel, grim bag from con, grim cover, Player count marker, card holder token, small whiteboard tokens, and Grim Accessories.",
    "timestamp": 1758232800
  },
  {
    "username": "Tax_Collector_Games",
    "rating": 10.0,
    "comment": "I have always been fascinated by the social deduction genre. I find nothing more enthralling than solving a puzzle of lies and evidence as good, or conjuring up elaborate lies as an evil.\n\nWhen I was 10 years old, I loved playing mafia with my cousins at christmas and town of salem on my parents computer. Then it was secret hitler, which I've probably played around 500 times. Then Avalon. Ive even prototyped my own social deduction game concepts (which haven't gone so well) because I always thought there was something more to be done with the genre.\n\nMafia doesn't have enough information. Dying sucks, and the moderator doesn't play. You have to go off 'soul reads' most of the time which isn't really a game.\n\nSecret Hitler, well its good, but after many plays the policy deck is super rubber-bandy and a terrible fascist team can be carried by RNG. Also, the decision space is quite small. Yeah there is some tech to learn, conflicts to perform in the right moments, but once you have a solid grip, there are no deeper strategies you can really explore.\n\nWhen I played Avalon, I was actually quite disappointed. For a game that has been deemed 'the goat' of social deduction, from my perspective it was just a unsolvable puzzle of 50/50 or 33/33/33's, and at the end of the day, to win the game you would still need to 'soul read'. Adding lady of the lake just straight up solved the game, and without it, it was a blind guessing game. Also, the decision space is also quite shallow, after a few plays.\n\nBLOOD ON THE CLOCKTOWER, I can say with absolute confidence, IS SINGLE HANDEDLY THE BEST GAME I have (and probably will ever) play. It is so deep. Like among-us level deep (without running on a computer). The amount of strategy and decision you can sink your teeth into is ridiculous. The designers have been super creative to break the mold of the standard social deduction formula - dead players still play, almost infinite role capabilities, scripts, demons, outsider mechanics, poisoning + drunk mechanics etc. The entire genius is that the storyteller (moderator) decides how false information is given, to assist evil in crazy strategic plays and to forge a difficult, yet solvable puzzle if the town can decipher it.\n\nFor context, I live in an Australian College at university, and I bought this game because I thought people would like it, even though the usual social events are drinking/partying/smoking.\nI story told the first game with a group of 12, and straight after EVERYONE was excited and begging for another. A group chat was formed and we have been playing 3-4 nights a week for like 4 hours each time.\n\nThanks pandemonium, you guys are literal geniuses.\nIf you are on the fence, get this game. You will not regret it.\nWorth every penny.",
    "timestamp": 1757109600
  },
  {
    "username": "maxwellryder",
    "rating": 10.0,
    "comment": "This game is the best game.",
    "timestamp": 1756764000
  },
  {
    "username": "CrystalDragonfly2",
    "rating": 10.0,
    "comment": "I am so addicted to this game.",
    "timestamp": 1756677600
  },
  {
    "username": "vapapav",
    "rating": 10.0,
    "comment": "09-12, 07-16, 30-120",
    "timestamp": 1756504800
  },
  {
    "username": "Killi",
    "rating": 10.0,
    "comment": "Before BoTC I had played many different social deduction games in the past.\n\nTown of Salem, One night werewolf, secret Hitler, Coup, Avalon, some mafia themed games in online forums, Among US, you name it.\n\nBlood on the clocktower just blows everything out of the water. To the point I don't even want to play any other social deduction game.\n\nThis game just does everything that a social deduction game does, but better. The only CON comparing to other games is the duration, depending on player counts it can go up to 2hrs per game.\n\nBut it engages players so much, and really tells a story every single game. The players will keep talking about the game for hours even after the game is finished.\n\nThe skill ceiling in this game is immense and you will never truly master it, but you will understand how to play it from your first game.\n\nI like playing it, I love storytelling it even more.\n\nI cannot recommend this game enough, even if you are not that much into these type of games.",
    "timestamp": 1756504800
  },
  {
    "username": "Mauxel",
    "rating": 10.0,
    "comment": "Hands down the best social deduction game of all time.\n\n- Both fun for the players and the storyteller, the latter getting way more to do than in similar games\n- Dead players keep playing (a vital role in solving the mystery)\n- Almost everybody has an exciting ability - A lot of possibilities for great plays and bluffs. The poison/drunkeness mechanic is genius",
    "timestamp": 1756159200
  },
  {
    "username": "nathandobrien2",
    "rating": 10.0,
    "comment": "Social Deduction",
    "timestamp": 1756159200
  }
]