[
  {
    "username": "Floating World",
    "rating": 1.0,
    "comment": "Expansions should not be ranked",
    "timestamp": 1754172000
  },
  {
    "username": "sykano",
    "rating": 1.0,
    "comment": "I like the original \"Ticket to Ride\",\nbut I hate Legacy games with a passion.",
    "timestamp": 1685916000
  },
  {
    "username": "jmsmith2434",
    "rating": 1.0,
    "comment": "2 for being a Ticket to Ride game. Docked an additional point for being legacy.",
    "timestamp": 1685743200
  },
  {
    "username": "khepriq",
    "rating": 1.5,
    "comment": "Manifest Destiny the Board Game. This should have been a good educational game. John Company tells that you can make a game fun and informative.",
    "timestamp": 1743372000
  },
  {
    "username": "vouzoum",
    "rating": 2.0,
    "comment": "Le pire aventurier du rail auquel j’ai pu joué.\nLa pose des wagons n’est pas valorisée. Les destinations ne vont que vers la région de départ.\nL’aspect blocage n’existe plus à cause de la sous-traitance.",
    "timestamp": 1706828400
  },
  {
    "username": "Cainayato",
    "rating": 2.0,
    "comment": "un legacy ça ?\nvous plaisantez !\nl'histoire est insipide.\n12 pochetez surprises sans but.\n12 partie d'un jeu vieillissant.\ndecevant",
    "timestamp": 1700089200
  },
  {
    "username": "stormbirdd",
    "rating": 3.0,
    "comment": "The game is actually excellent, definitely an 8 out of 10. The problem is when you mix gamers and non-gamers. DO NOT DO THIS. What you will arrive at is obvious leaders untouchably separated by about game five or six, and the rest of the players beginning to understand they have no chance at winning or claiming even second place. And the catch-up mechanisms are FAR too weak to accommodate casual players.\n\nThis is what happened to us. We didn't finish the campaign because the non-gamers - who were actually the ones who kept asking to play over my own warnings and objections - were wiped out every time. One of them, the youngest (a teen), cried at the end of the final game - only round nine - after which I tossed it into the garbage.\n\nImagine a game where you are already in third place, best case scenario, and there are hours to go. How would that make most people feel? An campaign makes the ever-growing series of bleak losses worse and worse as everyone at the table sees the crushing ending awaiting dozens of hours away of pointless play.\n\nCo-op campaign games work. But PvP campaign games are a pretty terrible idea unless everyone has essentially the same skill level. And this one masquerading as a casual game was all the worse for the disguise.",
    "timestamp": 1744581600
  },
  {
    "username": "mi_de",
    "rating": 3.0,
    "comment": "Yipes, two of my least favorite things under one cover!",
    "timestamp": 1744063200
  },
  {
    "username": "Siterath",
    "rating": 3.0,
    "comment": "Janky mishmash of mechanisms creating a fiddly, and extremely luck driven, experience. New mechanisms make no thematic sense, and the game contains a “story” in name only. By the middle, games quickly became a slog that long overstayed their welcome, and had me dreading what might be added next. By far my least favorite TTR experience, and a real tragedy for what could have been.",
    "timestamp": 1744063200
  },
  {
    "username": "Dasoogle",
    "rating": 4.0,
    "comment": "In some ways better, in some ways worse than the original",
    "timestamp": 1760306400
  },
  {
    "username": "NavayaTCG",
    "rating": 4.0,
    "comment": "Not sure why this one is highly rated. I do like the hidden objective part though.",
    "timestamp": 1750024800
  },
  {
    "username": "azeem",
    "rating": 4.0,
    "comment": "[abridged version of review to remove spoilers]\n\nCompleted a 3-player campaign, plated at a pace of one game per week.\n\nI enjoy the original Ticket to Ride. I had fun with this campaign, but I cannot say Legacy is good. There are too many design decisions which with I cannot agree. It surprises me that this superstar design team would allow a product with such glaring oversights and lack of playtesting to be released, although perhaps that was due to the publisher's influence. I can't imagine Alan Moon is pleased with the soul of his magnum opus being tortured in this way.\n\nLegacy is too quick at the beginning, too complicated in the middle, and too long at the end. Most mechanisms are only mildly interesting, and do not have a significant impact on decision-making within a given game. The story is decidedly low-concept and forgettable. Who is the intended audience of this legacy game? It seems too heavy to appeal to TTR fans, and too boring to appeal to legacy game fans.\n\nOn too many occasions, the reward structure is outright unknown. This uncertainty undermines much of the game’s content.\n\nThe extra content that gets unlocked varies widely, and can become overwhelming when much of it overlaps.\n\nThere are some flashes of brilliance, but they are small and mostly not legacy-dependent.\n\nI hope TTR Legacy gets recognized as a swing and a miss for legacy games. It can still be loads of fun, but we should be open and honest about what doesn’t work in a board game, to improve games going forward. It’s a shame because there are a lot of great ideas in this box, but the execution just isn’t right.",
    "timestamp": 1730588400
  },
  {
    "username": "Belphe",
    "rating": 5.0,
    "comment": "Every game was the same except for minor changes. No wow moments. So glad it's over.",
    "timestamp": 1761951600
  },
  {
    "username": "scooter630",
    "rating": 5.0,
    "comment": "More of an activity than a game. Introduces some interesting game mechanics, but they don't stick around for longer than a game or two. Luck plays an overwhelming factor in determining who is the winner (both of the campaign and individual games), especially when playing with seasoned TTR players.",
    "timestamp": 1758578400
  },
  {
    "username": "ultimoratio",
    "rating": 5.0,
    "comment": "NO SPOILERS\n\nUpdate: Halfway into the campaign - made me love Ticket to Ride again by fixing the serious issue I have with this game by removing the skewed route scoring and focus the system towards ticket scoring.\n\nI will really get into TTR (any map) again if we play with the Legends of the West basic rules\n\n=================\n\nAmazing campaign game. One of the few that got it right. Rules changes are also very well done! I really like how they removed the scoring on routes and instead have remaining trains as points\n\nHighly recommend",
    "timestamp": 1750975200
  },
  {
    "username": "Elsabethy",
    "rating": 4.8,
    "comment": "Not a bad game and technically worth more than a 4 however I would always rather play regular ticket to ride. Would prefer the modules to build on each other rather then choosing and picking and the tickets can be completely debilitating. You either draw something really good and matching the games current mechanics or not",
    "timestamp": 1748556000
  },
  {
    "username": "rjones53",
    "rating": 5.0,
    "comment": "Catch up mechanisms are poor and it's super lucky, not a good combination for a legacy game. Some mechanics are badly implemented. Balance is very bad. The last episode could have been better, a very lucky bonus for whom ever got luckiest. Overall it's fun but far too lucky. I'd only recommend for people who aren't competitive and just after some fun.",
    "timestamp": 1741302000
  },
  {
    "username": "trainings_pl",
    "rating": 5.0,
    "comment": "After 3 plays: so far noting special, pretty standard TTR.",
    "timestamp": 1741129200
  },
  {
    "username": "clawp1995",
    "rating": 6.0,
    "comment": "3D Printed:\n- Towns\nGamegenic Sleeves 66 x 91 Value Pack (200 pack)",
    "timestamp": 1761951600
  },
  {
    "username": "Mars1234",
    "rating": 6.0,
    "comment": "Enjoyable at 2p, but would probably be much more exciting at 4p. The game starts to loose its novelty/become repetitive midway through the campaign.\n\nGame has a non-legacy mode/rules for after the campaign finishes. We have not played it yet.",
    "timestamp": 1761865200
  },
  {
    "username": "Gamer_2k4",
    "rating": 6.0,
    "comment": "While it was nice seeing the classic Ticket to Ride expanded to a legacy, game, and while the novelty of unlocking new parts of the country was always enjoyable, every mechanic that got added just seemed like more \"stuff\" that was only there to pad out the game.\n\nPlus, we played with two players, which is fine for cooperative legacy games but certainly not for competitive ones. One of us began pulling ahead with four or five games left in the campaign, and the winner was never really in question after that. It just stopped being fun when you knew that no matter the outcome of each game, the winner of the campaign had already been decided.\n\nLegends of the West is quite a spectacle, and it's nice that there's the option to keep playing after the legacy campaign is finished. But I already am not overly fond of the original game, and this legacy edition didn't change that.",
    "timestamp": 1755036000
  },
  {
    "username": "HungryPenguins",
    "rating": 6.0,
    "comment": "Awesome ideas and great gameplay mechanics on principle. Sadly a lot of design flaws in terms of balancing (financier, turn order and amount of turns, most of the time way too dependent on luck, region mechanics too powerful in contrast to tickets, ...) turns a 9.5 game into a 6.",
    "timestamp": 1748642400
  },
  {
    "username": "Sir Pent",
    "rating": 6.0,
    "comment": "Legacy version of Ticket to Ride. It starts with much less board, many less trains, and no points for length of train segments or longest train. You do get bonuses for playing segments of your own color, and for connecting to certain cities. Gradually the board expands, you get to piggyback on other's, and other new rules are introduced. It was fun, but the early rounds are less fun than traditional TTR.",
    "timestamp": 1746914400
  },
  {
    "username": "DocCool",
    "rating": 6.0,
    "comment": "It's nice, but there's a lot of randomness and luck involved. Depending on how lucky players were when drawing their connections, we had players score anything between 40 and 200 in the same round (11 + 12) from connections, with the roles reversed in another round, so it's not a skill issue.\n\nIf you happen to get two connections from the same city in the west to two neighboring cities in the east, you basically get twice the amount of dollars with the same work. OTOH if you only get small connections wildly distributed across the USA, you have no chance to score high. Same with drawing new cards during a round: are there several which have a large overlap with your existing network or are they all far off?\n\nIn the end, the player who won did so because he had three games with a lot of synergy in his connections while the others had just one or two.\n\nAnother thing which makes this a bit worse than some of the other legacy games we played (e.g. Charterstone and Queensdale) is the lack of a real catch-up mechanism. Points are hidden and the only \"catch-up\" is by giving the loser of the previous round some big advantages (start player + extra turn + first free connection(s)). It really helps to sit behind the player who loses more often than others (as our winner did), because that player will often be the start player and the player order remains clockwise, so even as the leader and/or winner of the previous round you still get to play second.",
    "timestamp": 1746828000
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 7.0,
    "comment": "Ticket to Ride Legacy: Legends of the West was a fun legacy game. I am not a huge Ticket to Ride fan, but this one won me over. The campaign was varied and interesting. The excitement of expanding the board across the USA over several sessions was fun. Opening the boxes of hidden treasures was also exciting. Recommended.\n\nHowever, we have never been enticed to revisit the post-legacy game. As it is untradeable, I may eventually scavenge usable parts and bin the rest.",
    "timestamp": 1757628000
  },
  {
    "username": "Killi",
    "rating": 7.0,
    "comment": "One of the best Family games out there. You can play with your kids and they will love it!",
    "timestamp": 1756504800
  },
  {
    "username": "drphilphil",
    "rating": 7.0,
    "comment": "Huh, so where to start?\nI really liked the game.. for the most part. Some mechanisms were great, I loved the gold rush and the digging for treasures. Others I found not that exciting like the robber and the bridges. And that's fine, not every idea has to be a 10/10. The pace of the game was also very good. I enjoyed every game.\nBut i can't rate this game highly because they missed such a big opportunity. The story of this game is horrible. It is so boring that no one in my game group cared for a single moment at any point. It is a weird mix of pseudo historical stuff and very bland fiction. The worst mix possible. Why in the name of the lord Dr. Knizia didn't they just retell actual history in this really interesting period of U.S. history? Maybe spice it up a little bit?\nThis is one of the last big frontiers for board gaming in my opinion. To tell good stories and have actual storytelling. Almost no game did it for me for so far in that regard. And this one missed it by such a wide gap, that it lowers my score considerably. This would have been an 8 or even a 9 if the story would have been at least kind of good. And a straight 10 if they would have succeeded to write a really good story, which this game was almost predestined to have for me.",
    "timestamp": 1755122400
  },
  {
    "username": "zkaufman",
    "rating": 8.0,
    "comment": "A very fun implementation of Ticket to Ride, but the Legacy element was a bit lacking.",
    "timestamp": 1762470000
  },
  {
    "username": "PBandJellyfish",
    "rating": 7.8,
    "comment": "@TX",
    "timestamp": 1761170400
  },
  {
    "username": "yamibakura",
    "rating": 8.0,
    "comment": "Magiur/Francesco/Fabio/Paolo/Dave",
    "timestamp": 1761170400
  },
  {
    "username": "BrainWave94",
    "rating": 9.0,
    "comment": "FYI: : Spoiler-free review\n\nAs avid fans of Ticket to Ride, diving into our first campaign and Legacy game has been an exciting journey. We're currently on game 8 of the 12-game campaign, and it's been a fantastic experience so far!\n\nFor newcomers to the campaign and Legacy format (as we were), the introduction of new rules in each game can be slightly overwhelming. We even chose to skip the new rules in one session, and still had a great time.\n\nHowever, we noticed that these rules might be challenging for older players, like those over 70, to grasp. This aspect prevents us from giving a perfect rating.\n\nBased on our experience, here are some tips and insights (without spoilers):\n- The campaign component is a one-time adventure. Post-campaign, the game remains replayable, with the final state of the campaign influencing future games.\n\n- If you're new to campaign-style games, do a bit of research first. The initial complexity is manageable, and you'll quickly adapt.\n\n- When playing with people skeptical to new games, or those who find new games and rules daunting, it helps if someone ine the group has researched extensively beforehand, even if it means encountering some spoilers. This preparation will allow you to smoothly guide everyone through the new gameplay.\n\n- We've been playing as a duo, though four players are recommended. Despite this, our experience has been incredibly enjoyable!",
    "timestamp": 1762383600
  },
  {
    "username": "screwy81",
    "rating": 9.0,
    "comment": "",
    "timestamp": 1761951600
  },
  {
    "username": "Sinoc",
    "rating": 9.0,
    "comment": "Good game, obviously, with great material and nice adventure",
    "timestamp": 1761865200
  },
  {
    "username": "Sekfsing",
    "rating": 9.5,
    "comment": "I suddenly feel that I dont wanna end this game after regular cycle. means worth 10",
    "timestamp": 1762650060
  },
  {
    "username": "davidjanda",
    "rating": 10.0,
    "comment": "Kennerspiel des Jahres\n2023 Nominierung",
    "timestamp": 1762297200
  },
  {
    "username": "jagiell82",
    "rating": 10.0,
    "comment": "In our group games can take a bit long.\nThere is not that many rules to remember from game to game in contradiction to some legacy games.\nOnly complain: a bit of luck can screw too much.",
    "timestamp": 1761778800
  }
]