[
  {
    "username": "TOOMUCHGOOD",
    "rating": 1.0,
    "comment": "Didn’t like the way your works were sent out. It wasn’t fun game to me.",
    "timestamp": 1699311600
  },
  {
    "username": "DanFred",
    "rating": 1.0,
    "comment": "I may not be being fair as I’ve only played this game once but this is the opposite of my game style. I like games with simple rules, deep strategy and high player interaction. Maybe The Gallerist is deep but I don’t care enough to find out. The game is way too bloated and not intuitive at all and the rules get in the way of the gameplay. Also the game has minimal player interaction and the game is long and feels long with lots of downtime between turns.",
    "timestamp": 1697925600
  },
  {
    "username": "GaiaHero",
    "rating": 1.0,
    "comment": "Game about art that is horribly ugly... you had ONE job ???",
    "timestamp": 1624744800
  },
  {
    "username": "Nomorepiratedgame",
    "rating": 1.0,
    "comment": "For working with Yoka, a company known for its plagiarism of Bang!",
    "timestamp": 1607554800
  },
  {
    "username": "safety pin",
    "rating": 1.0,
    "comment": "A very positive game in attitude. You're never blocked from an action and can be enabled to take an extra if someone else wants the same one. Everything you do gives you STUFF. This mechanical cleverness obscures that the decision space is small. The international market especially feels tacked on and thematically disconnected.\n\nI feel like it's a game which tells me how smart it is rather than a game that lets me discover that myself.",
    "timestamp": 1588111200
  },
  {
    "username": "Frozen Flesh",
    "rating": 1.0,
    "comment": "I came here, because of all the people rating games like KD:M or Hate with a 1, just because of their mature theme.\nI’m offended by how boring the theme of this game is!",
    "timestamp": 1547074800
  },
  {
    "username": "Peepser",
    "rating": 1.0,
    "comment": "Just balancing out the 10's because I'm a real boon to BGG society. But it's okay because I \"payed\" my dues. Seriously, folks, I never played the game, so I rate on high price, lack of stock, and mostly for having the extreme misfortune of participating in the Gallerist forums and meeting certain users. So, it's more a review of the BGG user base for the game, something that should have its own rating system. Update march 2016....game actually went up in price from $72 to $100. Can buy actual art for this price. I have played Vinhos and Kanban and found both overly complex, too long and boring. I read the rules to The gallerist and it is the same. Really do not understand the hype about this designer. He needs an editor. His games do not deserve thick tiles and over production wth huge boxes. The ‘air of superiority’ behind his releases is truly sickening.\n\nPs - lacerda actually emailed me about this rating, whining \"You didn't even play it. Why are you disrespecting me?\" This is very poor form from a designer, harassing customers over a rating that was very clearly explained. I bought his games in the past and he hassles me? This shit needs to end. I even corrected his English and he got pissed about that, too. Will never support him or EGG again. Listen, Lacerda, if you don't want '1', stop redoing all your games, upping the price from $40 to $175, and making the games worse in the process. Very bad habit that NO ONE else does. If you continue to sign contracts with EGG that price everything at $150 +, it's your own fault your ratings suffer. Suck it up.",
    "timestamp": 1515711600
  },
  {
    "username": "Topanga",
    "rating": 1.0,
    "comment": "Watching paint dry or play this game about watching paint dry... tough decision.",
    "timestamp": 1450220400
  },
  {
    "username": "smurfodeth",
    "rating": 2.0,
    "comment": "Games by Lacerda make me say, \"no, sir-da.\"",
    "timestamp": 1754604000
  },
  {
    "username": "Wozzeck68",
    "rating": 2.0,
    "comment": "Ok at 3, uninteresting at best at 2, terrible solo, chaotic at 4. Average of 1/1/5/1=2.\nIt is supposed to be a game, where is the fun?",
    "timestamp": 1747519200
  },
  {
    "username": "mountstnobody",
    "rating": 2.0,
    "comment": "A suffocating exercise in not-fun. This is the first Lacerda I've played, and it will be my last. The theme barely makes any sense - a cockamamie hodgepodge of collectors, VIPs, influence tracks, fame tracks, reputation markers, executive actions - the whole thing is an absolute mess and misses out tons of storytelling opportunities and refinement. Maybe the designer could have actually spoken with some people who work in the museum and galleries sector? (I did for 15+ years - this game is a terrible exercise in real world modelling, one of the worst I've ever come across) Poor application of subject matter aside, there's just no ah-ha moments, no elegance, no joie de vivre. There's a streamlined game here, but no gameplay - and the difference is fundamental to why we play games. The puzzles are clever, but tired (racing to fill columns for end of point scoring, etc.) and the strategy simulates something much deeper than it actually is. It's a boring, obtuse, mechanical slog with a half-thought of a setting tagged on, a slot machine wrapped in tinsel. By the end of the game you've achieved very little - you've bought and sold some cardboard art, and wasted three and half hours of your life.",
    "timestamp": 1696284000
  },
  {
    "username": "IOIXIOI",
    "rating": 2.0,
    "comment": "Dans ce type de jeu, truffé d'une multitude d'actions bonus contre-intuitives, je n'ai pas la certitude d'avoir déjà vu un tour de jeu correctement exécuté.\n\nPersonne n'a la mémoire d'un super ordinateur pour jouer à ces jeux : regardez les vidéos de joueurs solo qui doivent corriger une pléthore d'erreurs et d'oublis après leur partie filmée.\n\nJe pense que même Vital Lacerda préfère jouer à Dune : Imperium, plutôt qu'à ses propres jeux.\n\nAlternatives de jeux avec pose d'ouvriers : Mombasa, Pillards de Scythie (léger), Targui (2 joueurs)",
    "timestamp": 1689458400
  },
  {
    "username": "U is for Unicron",
    "rating": 2.0,
    "comment": "A puzzle overburdened with an opaque core loop and tons of inscrutable icons. I’ve never felt so disengaged playing anything.",
    "timestamp": 1654120800
  },
  {
    "username": "NormandyWept",
    "rating": 2.0,
    "comment": "This is often lauded as the most accessible of Lacerda's games but I found it to be another virtually-incomprehensible wall of rules. If there's a game in here it's hidden under far too much complexity, with the result that you are too often wrestling with the game rather than competing with your fellow players.",
    "timestamp": 1650578400
  },
  {
    "username": "Darius van Duyn",
    "rating": 2.0,
    "comment": "Absolute absence of theme. Abstract and cumbersome mechanisms. Thousands better games.",
    "timestamp": 1557612000
  },
  {
    "username": "DaveyJJ",
    "rating": 2.0,
    "comment": "Reiner Knizia's Modern Art is the best game about art ever made. Period. So with that out of the way, the following may not come as surprise ...\n\n--------------------------\n\nWhile I sort of admire Vital Lacera's continually-the-same-game design chops, I think that most of his game designs (and fans) are confusing complexity of mechanics and crowded decision trees for depth and/or elegance. They tend to be a mis-mash of far too many mechanics and individual parts, with many of them feeling that they were simply tacked on to add processes to the game design. His inelegant designs feature too many, poorly thought through mechanics that are more complex than they need to be, and wind up putting work before fun.\n\nHis games seem to me ... as an award-winning visual designer of 25 years ... to lack any trace of having all the unnecessary design cruft removed. It's almost as though he tries to add too many moving bits into his designs, and then add the kitchen sink as well, in an attempt make his designs feel \"heavy\" or important when, in fact, they are only adding unnecessary complexity, fiddliness, and that slow the game down too much. That results in players having to focus on the mechanics of a game, more-so than the consequences of the decisions they make. To quote another BGG user ...\n\n\nQuote:\nI [am] the first person to advocate for the less-is-more design approach, which is driven by elegance above all else, and which has been emulated by numerous brilliant designers. It is clear to me that Vital doesn't share that design thesis .... There is so much gratuitous complexity [in Lacerda's designs] for complexity's sake, that I find the experience[s] difficult to enjoy.\nThat sums it up really well.\n\nMy own ratings of his games to date would probably look something like this: Vinhos > CO2 > Kanban. Vinhos I enjoyed playing when I first tried his designs, but still only occasionally. CO2, on the other hand, is a game that I merely a strong \"meh\" ... I could take it or leave it, but would rather not ever play it again, despite outstanding visual design and theme. And Kanban? I actively and quite strongly dislike Kanban, a game I've been known to refer to as a \"hot mess of mechanics that is inelegant, too long, and far to complex for what it is trying to achieve\" (much like how I feel about the game Bruxelles 1893).\n\nI had read a long time ago on the forums that The Gallerist was going to (finally) be a more medium-weight game, and have that polish and elegance that seem to be generally lacking in his other titles. That rumour, plus my love of art and the art world, got me really excited for the game. Then came the word that this wasn't the case, this was another heavy one is his usual wheelhouse, a game without question that followed his overly burdened and obtusely complex design patterns and apparent inability to simplify and remove mechanics that should probably be removed to improve flow and elegance.\n\nBut, as I said, I am an art lover, I publish an art magazine, paint competently, know many artists, collect art, etc. I had some hope that despite it's complexity, The Gallerist's theme would help me feel better about the complex grinding gears Vital's games seem to feature. Both in terms of the weight of games I like and my own interests outside gaming, I should be the target audience. I often deeply enjoy heavy games (when they are elegant designs). I enjoy games that make me smile and grin while I play them (Snowdonia, Keyflower, Inhabit the Earth, Power Grid, hell, I smile when playing Troyes). I never seem to do that when playing Vital's designs.\n\nI played a four player game of The Gallerist as my first go ... probably not the best number for this game which, after thinking it through, would probably be best at three players ... enough conflict and interaction, without slowing the game down with the overly complex and game-slowing \"bumped actions\" rules. Even so, with rules lookups and some fiddliness, we managed to knock out a game in three hours. A great group of gamers played, so that always helps. So what do I think after one game?\n\nVinhos > CO2 > The Gallerist (provisionally) || Kanban.\n\nI'm left generally disappointed (not unexpectedly) after the first game. It's another inelegant Vital design, ponderous, heavy (apparently) simply for the sake of being heavy. There is too much superfluous stuff that could have been removed to make the game smoother and flow better, too much complexity that hides the real essence of what this game's theme is fundamentally about ... run a gallery, buy art, sell art, profit and prestige. It could have been more elegant if the actions and gameplay had been better thought through and ruthlessly pared down. That would have increased the fun and lowered the mental work required to understand the mechanics, so that the strategy and depth of play were the focus. The end-game scoring is a mess of complexity that strikes me as one of the most inelegant scoring flows I've recently encountered in any game. And it doesn't help that there is a contradiction in the rulebook versus the board's scoring track about whether or not to score sold art versus hanging art first, though I'm not sure that it matters score-wise which one is scored first in any case.\n\nEven more unfortunate, however, is that I can't make up my mind if the scoring mechanic is more inelegant than the whole international market/buying actions, which seems to me to be the least elegant and most \"tacked on\" mechanic in the whole game. Wow. That whole set-up, with it's myriad of randomized bonus tokens that takes too much work to think through how each unique one might affect your long term prospects and end-game scoring. It is also a clear warning sign to me of a designer's inability to clarify and simplify their design, so that each piece of the whole works better and more smoothly, and the consequences and inter-connectedness of each player choice are clearer and more easily identified and understood. There is also no reason the gallery spaces need a lobby plus the gallery, that whole mechanic could have been simplified. Finally, the ability to be able to move meeples out of other people's galleries is, I find, simply a mechanic that was added to the game to complicate the game for no apparent reason except to add to player interactivity.\n\nThe visual design is very nice (that's my job, btw, so I appreciate elegant visual and information design) but the gameplay itself isn't a clean design. There are too many moving pieces again to get a handle on the mechanics that allow you to focus on playing the game, rather than the game playing you.\n\nFor example, in The Gallerist, here's what I mean about simplifying to make game flow better: The design would have worked just as well and far more smoothly if, when you are bumped from one of the four spots on the board, you simply get a specific \"bonus\" for each of those four spaces, and you move your player marker back to your gallery. Money, prestige, increase and artist's reputation etc. Simpler and more elegant and smoother game flow.\n\nAfter years of thinking about the game, I've decided that this isn't a game I will ever bother trying again.\n\nI didn't find it anywhere near as enjoyable as other, heavier games I have been introduced to in the meantime such as 1846, which is a far, far better designed and elegant game. Plus as I've been moving into my later-50s, I find myself reducing my collection to gems I absolutely love ... there's no room on the shelf anymore for fiddly, complex, work>fun games that aren't elegant and deep that I don't absolutely love playing (I've gone from a collection of 1,000+ to 350 to \"only\" 80 in the past ten years).\n\nI would love to see a design in the future from Vital that is far more polished and less complex. I would have liked to see Vital have designed this game so that it was meant to be played in 90 minutes. I'd like to see him ask himself, as all of us designers must do in the course of any type of design, what could he remove from a design to make that game cleaner, more elegant, and flow better. But maybe he simply can't do this type of game design?\n\nHowever, if Rosenberg can create Merkator (which I enjoy) or the lighter delightful game that is Patchwork, surely Vital can recognize and perhaps finally try to break out of his unfortunate \"kludgy-heavy\" design patterns. A medium weight, elegant mechanic game from Vital would be a must-have, I suspect.\n\nEven more, in my fantasy land of \"what-if?\", I would have absolutely loved to see what The Gallerist could have been if it had been designed by someone like Tony Boydell, Richard Breese, Mac Gerdts, or the brilliant Reiner Knizia (whose masterpieces include Tigris & Euphrates, Samurai, and the simplest but most elegant art-related game ever made, Modern Art), or even what it would have liked like in the hands of a designer I run hot and cold on, such as the \"point-salad king\" Stefan Feld.\n\nThe Gallerist is another (failed) case of complexity in mechanics pretending to be a deep/elegant game. The art/gallery theme actually does work, but the game overall fails to be elegant or fun, sadly, as much as I really wanted to really love it. It is, thankfully, a better game than Kanban, but only by the barest of considerations.\n\nP.S. This is the only game that when I look at my Geekbuddy ratings, I wonder what game those folks were actually playing, because it sure wasn't the same game I was playing. 8? 9? Clearly some sort of medication was messing with their judgements.",
    "timestamp": 1556575200
  },
  {
    "username": "Cone Defense",
    "rating": 3.0,
    "comment": "I just don’t get it - you end up in a very tight loop of doing a lot of the same things over and over. Theme is cool and mechanisms are fine, but way too much work for what it is.",
    "timestamp": 1757887200
  },
  {
    "username": "AndryWhite",
    "rating": 3.0,
    "comment": "No theme, it is not a game, just math and corporate commercial serial product, sorry)) Calculate hard, steal other meeples, don’t have fun. «A lot of better games do a lot more with a lot less.» Won't play this again",
    "timestamp": 1729202400
  },
  {
    "username": "Scifi66",
    "rating": 3.0,
    "comment": "This does have interaction and is much simpler than most Lacerdas in terms of rules. Now played 3 times. At two player this had a good pace but it feels like 4p is the best player number. Last two 4p games have run over 3 hours.\n\nLikes:\n+ We are running art galleries = yay!\n+ Money as victory points, simple and works, aids theme.\n+ Main board is very clear\n\nDislikes:\n- Kickout -> disrupts flow of the game, adding a lot of length. Often players haven't considered what they will do before kickout thus inducing further analysis.\n- Sidelined -> this occurred in my last game where after I took an action causing a kickout, the other 3 players also proceeded to kick each other out meaning 7 actions occurred until my next turn, not only are you are falling behind but this is boring to boot.\nx Collusion -> two players can either explicitly or implicitly co-operate, we saw an artist bumped up to masterpiece from nowhere in the space of two (+kickout actions) turns. I'm not sure you can prevent this, as players could combo to buy the two works of art first then promote them.\n- International auction and reputation matrix feels tacked on in turns of theme.\n- Bonus tiles in the reputation section seem paramount. Person with most of these seems to win. They are additional scorers as well as triggering bonus resources in game.\n- Overall the theme didn't quite come through despite the interesting visuals. This is purely personal, I find Lacerda's other titles to have strong thematic elements ie Lisboa, Kanban etc.",
    "timestamp": 1706137200
  },
  {
    "username": "kornfee",
    "rating": 3.0,
    "comment": "I'm a big big fan of Lacerda, but this game is the worst for me. I almost own them all, in the best edition if possible. I played this game three times and all the time, my playing partners and me were happy when the game was over. No fun, continuously reading and checking rules and in a way not really fun and pleasure while playing.",
    "timestamp": 1701039600
  },
  {
    "username": "jojajo",
    "rating": 3.0,
    "comment": "Too heavy and designed for me. Feels like \"Yeah, the designer must have been very clever\" but I don't experience fun.",
    "timestamp": 1684879200
  },
  {
    "username": "ssk0909",
    "rating": 3.0,
    "comment": "I just dont care for Lacerda games. Theres always a heavy puzzle element that seems interesting and deep. But once the game is over, I've never been able to say \"I had fun\".\n\nAnd thats the biggest issue for me. The games simply arent that fun, and thats why I play games.",
    "timestamp": 1614121200
  },
  {
    "username": "Fredrik83",
    "rating": 3.0,
    "comment": "A game that you don't fully understand after one play doesn't deserve a higher grade",
    "timestamp": 1610060400
  },
  {
    "username": "gamerdoge",
    "rating": 3.0,
    "comment": "played 4p for 2 hours and 45 mins. tbh I don't see what makes this special. just another Euro game.",
    "timestamp": 1607122800
  },
  {
    "username": "btasam",
    "rating": 4.0,
    "comment": "The Gallerist is a nice one-worker placement puzzle with limited duel-actions and an intriguing kick-out mechanic. The gameplay is straightforward, and I really enjoy the speculative investment relationship between artists and artwork. However, many of the other subsystems like contracts and tickets were really uninteresting. The international market feels tacky and in our plays, the winner has been the one who tends to acquire the most bonus tiles.\n\nSimilar to Escape Plan, The Gallerist presents this incredibly variable experience that doesn't feel any different from game to game. The artwork, production, and theme are unmatched respectively, but Lacerda's optimization genius continues to elude me after multiple plays.",
    "timestamp": 1759874400
  },
  {
    "username": "Beedun",
    "rating": 4.0,
    "comment": "Need more plays.",
    "timestamp": 1752703200
  },
  {
    "username": "dtmoney75",
    "rating": 4.0,
    "comment": "2 Plays\n\nPlayed at: 2",
    "timestamp": 1749852000
  },
  {
    "username": "Beastly_Venturer",
    "rating": 4.0,
    "comment": "A disappointment. 2 plays.",
    "timestamp": 1740783600
  },
  {
    "username": "VacuumBoogie",
    "rating": 4.0,
    "comment": "The Gallerist is a thick boy. Thick meeples, thick cardboard, the box is armored it seems like. It's very premium and it doesn't need it. Strip it down to essentials and throw out deluxe components, and it's a solid $20 euro.",
    "timestamp": 1738450800
  },
  {
    "username": "tectactoe",
    "rating": 4.0,
    "comment": "I think this is Lacerda's best design because it's the only one that doesn't totally lose its identity in an overwhelming sea of forced interconnectivity, secondary actions, and pointless endgame/global scoring objectives. (To be clear, endgame & global scoring objectives ARE here, but I think they're handled better than in, say, KANBAN EV.) The kicked-out actions are easier to plan for considering the board only has four available action spaces. The theme is far less opaque w.r.t. the gameplay versus something like LISBOA or INVENTIONS. My group and I have a lot of fun with this, and it's the only Lacerda game we continue to play.",
    "timestamp": 1733785200
  },
  {
    "username": "cherdan",
    "rating": 4.0,
    "comment": "Reminded me why I love euros. Thank you, Vital Lacerda.",
    "timestamp": 1720821600
  },
  {
    "username": "Janasik",
    "rating": 4.0,
    "comment": "It feels like the game's rules could have been a little more streamlined. The gameplay does so much with such a small number of actions. It has a unique them, and the mechanics do a decent job of telling a story.",
    "timestamp": 1704063600
  },
  {
    "username": "jonesy792",
    "rating": 5.0,
    "comment": "The weakest of the Lacerda designs that I’ve played (the others being Kanban EV, Lisboa and On Mars). In contrast to those other designs, the thematic and mechanical integration is poor here , making the ruleset and gameplay fiddly and unintuitive. Relatedly, grokking the iconography and board state is an arduous experience. It’s also the weakest in terms of artwork, which is disappointing considering the theme !",
    "timestamp": 1757109600
  },
  {
    "username": "Killi",
    "rating": 5.0,
    "comment": "Thematic, like most Lacerdas. But I just didn't like it the 2 times I have played it.",
    "timestamp": 1756504800
  },
  {
    "username": "Joeristoef",
    "rating": 5.0,
    "comment": "Geekmarket",
    "timestamp": 1754517600
  },
  {
    "username": "Forgeforgeforge",
    "rating": 4.6,
    "comment": "Meh, critical path unlock chaining.\n\nObtuse perpendicular goals.\n\nSquint at tiny symbols on the far side of the board.\n\nHope you get bumped, probably lose if you don't.",
    "timestamp": 1745877600
  },
  {
    "username": "Lone Ranger",
    "rating": 5.0,
    "comment": "Game is probably better than my rating but I was lost all the way through. Very hard to learn game.",
    "timestamp": 1743116400
  },
  {
    "username": "PizzaChip",
    "rating": 5.4,
    "comment": "Jest to moja druga duża gra od Lacerdy i jest to też mały zawód. Słyszałam, że jego gry słyną z dobrego połączenia mechaniki z tematyką. W the Gallerist tego absolutnie nie czułam. A te sztalugi, które służą tylko do tego, że zabieramy z nich obraz na koniec gry, to szczyt absurdu. Sama rozgrywka też była dla mnie średnia. Ludzie, którzy byli bardziej ograni i zaznajomienie w zasadach, dobrze ogarniali swoje akcje i tak to rozwiązywali, że co chwilę mieli akcję dodatkową. Mi gra szła dużo gorzej, ale byłam pod wrażeniem, jak inni umiejętnie wykorzystywali swoje akcje. Jednak sama gra jakoś mi nie podeszła, nie widzę w niej nic nadzwyczajnego i nie czuję tego klimatu. Mogę jeszcze kiedyś zagrać, ale nie będę o to zabiegać.\n\nOcena po 1 partii w 4 osoby. Czas gry = 126 min.\n\nBartek M.",
    "timestamp": 1732748400
  },
  {
    "username": "Jemaima",
    "rating": 5.0,
    "comment": "Только что доиграла свою сессию в галериста. Разобраться оказалось гораздо легче чем я ожидала и сам процесс очень интересный.\nПонравилось очень небольшое взаимодействие игроков, сами произведения искусства, много стратегии долгая партия)))\nИз минусов конечно самое малое количество ресурсов, которые просто невероятно сложно получить. Просто... ааааааа!!! Просто невозможно. И дурацкий органайзер.\nНо в целом игра понравилась.\n\nОбновление спустя время.\nОчень редко достаётся. Правила несложные, но меня утомляет дефицит ресурсов настолько, что после 5 или 6 игры я уже смотрю на коробку с ужасом. Каждый раз делаю выбор в пользу игры где мне не придётся страдать от недостатка ресурсов",
    "timestamp": 1732402800
  },
  {
    "username": "cscottk",
    "rating": 5.0,
    "comment": "Traded away for Keytown (2019).",
    "timestamp": 1732143600
  },
  {
    "username": "PotatoKing_",
    "rating": 5.0,
    "comment": "재미에 비해 너무 복잡하게 얽힌 액션",
    "timestamp": 1720476000
  },
  {
    "username": "nishikawa-collector",
    "rating": 5.0,
    "comment": "Yawn just another Lacerda game…..he is boring sadly",
    "timestamp": 1716933600
  },
  {
    "username": "shanev316",
    "rating": 5.0,
    "comment": "First Lacerda experience was slightly disappointing. I knew what I was getting into, but his games may just not be for me. There's so much barrier to entry, so many minor rules that are easy to forget, and just zero flow to the game. I'd like to play again to see if it's any better the second time around, but I'd need convincing to try another Lacerda.",
    "timestamp": 1706310000
  },
  {
    "username": "ekloff",
    "rating": 5.0,
    "comment": "Without question the most exquisitely produced board game to ever hit my table. The board conveys oodles of information, but the layout is very clean and logically organized, and the crisp graphic design adds to the overall aesthetic without creating distraction. From a gameplay perspective I find that the strategies are very delicate, and hinge on a specific order of operations, which is not a criticism in itself, but turns into one due to the kicked-out actions. While being strategically fascinating, these actions too often interrupt game flow and force players to constantly piece back together their next few moves in a manner that is more frustrating than satisfying. Instead of adding a tactical level of player interaction, they create a frustrating downtime issue, and exacerbate the game's overall length problem. Overall, despite the slow and methodical gameplay, each and every decision provides a satisfying crunch.",
    "timestamp": 1705359600
  },
  {
    "username": "AmandaDesignsGames",
    "rating": 5.0,
    "comment": "Like many of Vital's games, I like many parts of it, but the game ends up being both too complex and too circular for my tastes. Too many ways to do the same thing, and everything affects too many things, and too many of these things are too small. I feel like I'm just not the target demo.",
    "timestamp": 1701817200
  },
  {
    "username": "hiimjosh",
    "rating": 5.0,
    "comment": "Played a solo game of this. The rules were pretty tough to get through. The core structure of the game is mostly straightforward worker placement but introduces two types of special actions. I've heard the game described as \"simple to learn but hard to master\". It is definitely simple to play but hard to master. The action spaces are all pretty involved though and the game is very procedural. For example, buying a piece of art involves 7 steps none of which are complicated in isolation, but the whole process requires following the action reminder card very closely step by step.\n\nAs a solo game it plays great. The AI is just a simple dummy player that moves in a circle and is basically a timer. There is a lot to think about in the game and it definitely takes a game or two to even understand what you should be trying to do. The option space is large and complex but honestly not too bad. Enough to keep you exploring for awhile but not so overwhelming that you won't be able to eventually start figuring things out. The game doesn't seem very interactive to me as far as worker placement goes - the interaction there actually seems like it would be a little forced and irrelevant. The interaction is much stronger in denying scoring opportunities and competing for shared goals, and I like that.\n\nOverall I think the game is interesting. It reminds me a lot of Snowdonia in the sense that the core framework is lightweight while the strategies are nuanced. Unlike Snowdonia I prefer the theme here (although it is still quite abstract) and I think the mechanics here are much more compelling. Solid game for me right now that I need to play a few more times to get a final verdict on rating-wise, but definitely a keeper\n\nEDIT: Some slight regret for getting rid of The Gallerist. Vital Lacerda's games are far from elegant, and this is no exception. However, the scoring works really well here and the procedures aren't too bad. There are lots of bad parts though - like the worker placement thing",
    "timestamp": 1701385200
  },
  {
    "username": "galaxyxy",
    "rating": 5.0,
    "comment": "29/1/23: played once. Took 30m to learn the rules. Didn't even finish playing the game and had to call it quits because we had another event on and had to leave. Too long and complex for the fun payoff. Will be selling this game.\nJune 2023: pain to set up, rules overhead was annoying, no plays since jan. Sold.",
    "timestamp": 1688853600
  },
  {
    "username": "looch",
    "rating": 5.0,
    "comment": "The rules are way too complex and fiddly for a game that doesn't have the tough decisions and tension to match. Feels more like work than fun.",
    "timestamp": 1686261600
  },
  {
    "username": "Qhorin",
    "rating": 6.0,
    "comment": "Criminally long vs stated playtime. Interesting theme and action selection. Actions are almost intuitive. But like all Lacerda, not really for me. Just too many actions, efficiency combos, and point adds ups in the end.",
    "timestamp": 1762619040
  },
  {
    "username": "ImZhe",
    "rating": 6.0,
    "comment": "I think the game is pretty good, but thematically the actions don't really make sense to me. Probably the other lacerdas are a little better at having the theme mesh with the mechanisms",
    "timestamp": 1759960800
  },
  {
    "username": "Kroomiester",
    "rating": 6.0,
    "comment": "Like Lacerda’s other games, The Gallerist is a tight action efficiency puzzle where you’re trying to snowball your resources into points by way of a few fairly involved actions.\n\nThe game is more streamlined than other Lacerda’s, with it being focused on getting money by buying and selling artwork. The question in my first game of the Gallerist was very rarely whether you should, but whether you could. That said, like most Lacerda games, repeat plays unlock far more strategic depth than first impressions, so I’ll look forward to trying it again.",
    "timestamp": 1757973600
  },
  {
    "username": "iplaybgnaked",
    "rating": 6.0,
    "comment": "Clever economic euro that unfortunately feels streamlined to fault leaving little moments of excitement to be found in its dry optimization puzzle. While it's interesting to figure out at first, the worker movement puzzle quickly becomes samey as you tiredly repeat the looping \"do x to do y to do z\" sequence of moves while min/maxing the benefits of the bonus tiles, the influence track, the executive actions, and the kick out actions throughout the game with little variation, which is made worse by the game's slow pacing. There's nuance to be found in the various bonuses and the artist stock market both in game and between games, but it isn't enough to overcome the repetitive nature of the game to make me want to play it again.\nMore plays of this has me warming up to the design, I still find it samey but there's enough depth in optimizing your usage of the influence track and the scoring tiles combined with the other aspects of the game that it winds up being a puzzle that holds up much better on repeated plays than I anticipated.\nAnd so I ended up becoming cold to this design again. Really my issue comes down to the scoring, almost every game has been won by the player that went to the International Market space first and more often than the other players to the point the meta I've played in warped around that space more than the other actions in the game. Gaining the column bonus at the end of the game alone is enough to push you ahead of the other players (provided you're keeping up with them in the other areas) for the win, having tempo control over the scoring tiles creates to big of a point swing by either scoring you huge or denying your opponent their optimal scoring, and while often minor winning the auction for the painting at the end can yield a strong swing in points. To the game's credit, it's difficult to pull that off while maintaining parity with the other players and you can just as easily deny them the benefits, so it's certainly balanced but just not the type of enjoyable experience I was looking to get out of this game.",
    "timestamp": 1756418400
  },
  {
    "username": "geekmekci",
    "rating": 6.0,
    "comment": "The first game felt really nice. It's a very thematic game and all the actions make sense. Also, it is easy to play even though there are many rules. The actions are intuitive.\n\nHowever, the game feels very same-y with more plays. Overall, the actions you take and the order you perform them does not change much from game to game. Discover an artist, buy an artwork from them, get them more famous and sell the artwork for a profit. This cycle repeats in every game without much variation.",
    "timestamp": 1756332000
  },
  {
    "username": "ditterio",
    "rating": 6.0,
    "comment": "I've played this once and my head exploded, I have to give it another chance to give it an honest rating.",
    "timestamp": 1755208800
  },
  {
    "username": "jcarvin",
    "rating": 6.3,
    "comment": "I'd play this again but I didn't love my first play. I'm not sure I even liked it but maybe I didn't understand something.",
    "timestamp": 1755036000
  },
  {
    "username": "icheyne",
    "rating": 6.0,
    "comment": "2025-07-12\nVital Lacerda was a graphics designer, and you can see it in the iconography. It make an indigestible game swallowable.\nThe interlocking scoring at the finish is borderline ridiculous. We were all convinced that I was coming comfortably last, but I won.\nThe theme is strong and there's plenty of player interaction.\nOur learning game took 2.5 hours. I'd play again.",
    "timestamp": 1752271200
  },
  {
    "username": "selvalabelva",
    "rating": 6.0,
    "comment": "Brainburn         Longevity    \nLuck impact       Rules/Setup  \nInteraction       Involvement  \n\nAftertaste           Enthusiasm   \n\n Played at 4 player count only\n Confrontation: indirect\n\n Exceptional production quality",
    "timestamp": 1751320800
  },
  {
    "username": "mac_s_1",
    "rating": 6.0,
    "comment": "Played once. Very overwhelming game with many interlocking mechanisms and tons of end-game bonuses. Everything goes in small steps. It's ok, and I would play again to get a better understanding of it, but this style of game design is generally not my cup of tea. It does look good though.\n\nSecond play, ten years later: had a mostly similar reaction.",
    "timestamp": 1750370400
  },
  {
    "username": "Takhyon",
    "rating": 6.0,
    "comment": "I definitely do not agree with the majority opinion about this being the “approachable” Lacerda game, or perhaps my brain is wired differently because I actually found this incredibly obtuse, unthematic, and difficult get into. When comparing it to something like Kanban EV, the objective of what you’re trying to accomplish feels a lot more opaque to me, plus there’s heaps more moving parts and game-y rules to conceptualize. The rulebook also most definitely didn’t help as the way it's formatted seems to prefer less clarifications and examples for the sake of fitting particular sections nicely into a single page.\n\nAs usual with Lacerda’s games, all the different elements and actions mesh together to create an intertwined and brain-burning optimization puzzle. Only four locations to choose from with eight possible actions to take, but a lot of interconnectivity and nuance between all of them. Once you manage to sequence your moves correctly and keep a good momentum going by getting the maximum efficiency from each action and chain various bonuses together, the game can feel super rewarding. The puzzle has some enjoyable moments, but this a game where the juice is not really worth the squeeze for me.\n\nThe downsides of the game for me are that while I appreciate the kicked-out actions since they do add a lot more depth to the game and knowing how to get the maximum benefit out of them by using your influence is a fascinating part of the puzzle… It's just that this added crunchiness unfortunately comes with the expense of the game flow. When all players are constantly taking actions out of turn, the game gets a bit clunky as players lose track of where the turn order actually goes, which happens frequently. Especially since a lot of the actions also come with so many small procedural steps to follow and it’s easy to forget some of them, making the experience rather fiddly.",
    "timestamp": 1749333600
  },
  {
    "username": "paulastoria",
    "rating": 6.0,
    "comment": "ok game",
    "timestamp": 1748383200
  },
  {
    "username": "daveosuave",
    "rating": 5.9,
    "comment": "0 plays\n\nShelf of shame but hope to learn it someday",
    "timestamp": 1744149600
  },
  {
    "username": "tbrofromspace",
    "rating": 6.0,
    "comment": "After 7 plays, I feel that I've experienced most of what this game has to offer. Beautiful production, interesting systems, but it seems to become more a game of micro adjustments rather than one of taking different strategic tracks, which is less interesting to me.",
    "timestamp": 1743631200
  },
  {
    "username": "Tsaar",
    "rating": 6.0,
    "comment": "Wonderful experience. At first it’s a bit much to grasp but after two or three turns the mechanisms started to make sense. One 3p, already looking forward to the next play.\n\nUpdate, the next play, 4p this time: After six months the rules have faded so a new walkthrough was necessary. During play I forgot to take quite some micro actions which annoyed me. After three hours we called the last round and counted scores. I came in second but the gap with the winner was significant. While I had been busy buying and selling art, promoting artists, I had also pretty much ignored the international market. That cost me quite some points, it appeared.\n\nSo, at second thoughts my excitement has gone from 9 to 8. If only I could play it again, sooner than after six months. There are so many connected actions that can be mind boggling how to achieve certain (sub-) goals.",
    "timestamp": 1743030000
  },
  {
    "username": "alandric",
    "rating": 6.0,
    "comment": "too long for what it is",
    "timestamp": 1740178800
  },
  {
    "username": "Avid_Equinox",
    "rating": 7.0,
    "comment": "Good but not great game.\n\nA little boring until the end-game as you do a fairly standard eurogame resource snowball loop. Endgame sees you scrap a bit more over points and try to maximise your points.\n\nI need to like a game of this weight and length much more than I like this game for it to be a keeper.",
    "timestamp": 1762561920
  },
  {
    "username": "SkyeHalon",
    "rating": 6.5,
    "comment": "Custom Inserts and baggie w/ ID for random distribution",
    "timestamp": 1761084000
  },
  {
    "username": "robertoabr",
    "rating": 7.0,
    "comment": "A great theme. Nice art and components. There are parts of this game that are fun and really thematic: buying/selling art, discovering artists. The prestige track is also very interesting mechanically. But there are other parts that aren't as interesting or thematic: the international market, the bonus points soup everywhere.\n\nOverall unnecessarily complicated for me. A beast to setup and a beast to learn. Bonus points everywhere. Too much point salad for me.\n\nThat said , I have only played this with two. May be better with more players interacting , bidding up the same artists etc..",
    "timestamp": 1760911200
  },
  {
    "username": "jellyfishjoe",
    "rating": 7.0,
    "comment": "Heavy for sure, but not so bad as Lacerda's later offerings. There's a nice thematic tie-in that keeps things flowing smoothly. I'd revisit, but the rules overhead is stifling to teach new players",
    "timestamp": 1759183200
  },
  {
    "username": "pezpimp",
    "rating": 7.0,
    "comment": "Gallerist is a mixed bag for me. I find it to be one of the more straight dforward games from Vital Lacerda but also one of the least interesting. The game is heavy but has a more straight forward flow and method of gaining points than some others as you buy and sell artwork with a goal of having the most money at the end. It is very well designed, but the buy and sell mechanics don't bring a lot of interaction as players cannot block each other in their worker placement or effect the value of others' paintings in notable ways. The board, player aid and iconography are mostly excellent, almost everything is there. I need a few more plays but it would not be at the top of my choices from Lacerda.",
    "timestamp": 1757973600
  },
  {
    "username": "DoctorPhil",
    "rating": 7.1,
    "comment": "First impressions: https://anchor.fm/board-game-doctors/episodes/First-Impressi...\n\nCriteria (out of 5)\nRules complexity 3\nPlaytime/complexity ratio 3\nStrategic avenues 3\nMechanism strength 4\nThematic integration 5\nVariability 4\nReplayability 4\nFun factor 3\nSolo mode 3\nPlayer interaction 4\nElement of mastery 3\n\nOverall 7.1 out of 10",
    "timestamp": 1756072800
  },
  {
    "username": "kaepone",
    "rating": 7.0,
    "comment": "Anna\nJust ok. Prefer Kanban EV.",
    "timestamp": 1755208800
  },
  {
    "username": "Javivesa",
    "rating": 7.0,
    "comment": "Recomendado por clint",
    "timestamp": 1753912800
  },
  {
    "username": "Bayushi Sezaru",
    "rating": 7.5,
    "comment": "There is a reason for having the phrase “it is a Lacerda” in boardgamers lingo. The games by this designer are very complex euros, with the complexity rooted in the theme.\n\nThe Gallerist is probably one of the best designs by Lacerda, and certainly the one I enjoyed the most: lots of interlocking mechanics, and yet the theme emerges somewhat among all the actions and bonus actions. It is really a great game. But it is also a pain to explain, with lots of details to remember.\n\nThere was a time in my life as a gamer, 10 years ago (maybe even less that that), in which I would’ve fallen in love with a game like this. I would’ve rated it a 9 or even higher. Now I am getting older, more disenchanted about the chance to play these long meaty euros enough with experienced players, and even more prone to fatigue when I play.\nFurthermore, I tend to value more the games I can play with my family.\n\nFor these reasons, the rating is toned down. In spite of the fact that I really liked my first play, that I am looking for more of it, and that my gamer-sense is tickling...",
    "timestamp": 1762210800
  },
  {
    "username": "Ultracool_Muffin",
    "rating": 8.0,
    "comment": "У Сани",
    "timestamp": 1761606000
  },
  {
    "username": "marcosbmello",
    "rating": 8.3,
    "comment": "Jogo muito bom bem ao estilo Vital Lacerda com temática densa e muita demanda por planejamento além do já conhecida qualidade de peças e design elegante.Jogamos na Encounter em 4 .Fiquei em 3o. Com 105 pontos atrás de 123 e 120.3 horas de jogo mais 30 mins de explicação.Joguei 2.a partida em casa , simulando 3 players.Joguei melhor e mais rapido e com melhor entendimento porem pontuei menos: 89, 85 e 70 RESPECTIVAMENTE.Acho que comprar obras a todo custo pode ser muito oneroso. Joguei uma 3.a partida na Encounter: novamente em 3o. com 115 pontos;125 e 176 o vencedor e um 4o. colocado em 105 pts. Joguei mais 2 partidas em casa uma SOLO ( gostei bastante mas nao adorei)e uma de 2 players : 146 PTS E 126 pontos. Muito bom o jogo.Mais uma rodada em casa em 3players- 114, 112 e 96",
    "timestamp": 1761519600
  },
  {
    "username": "biggy_serg",
    "rating": 8.0,
    "comment": "Great game but will not keep because I don't have a group to play this more than once a year. Having to relearn and teach it again is a slog.",
    "timestamp": 1760738400
  },
  {
    "username": "Sedd",
    "rating": 7.5,
    "comment": "Kurz: Ein leichterer Lacerda? Auf jedenfall wurden Thema und Mechanik gut miteinander verschmolzen.\n\nLangform:\nThe Gallerist ist ein komplexes (für Lacerda eher mittelschweres) Strategiespiel, das Wirtschaft, Kunst und Einfluss auf faszinierende Weise miteinander verwebt. Als Galeristen managen die Spieler Künstlerkarrieren, kaufen und verkaufen Kunstwerke und ziehen Besucher in ihre Galerien. Der Mechanismus basiert auf einem Aktionssystem mit cleverem \"Folgen-/Verdrängungsbonus\", das interessante Interaktionen erlaubt. Die Präsentation ist – typisch für Lacerda – erstklassig: hochwertige Komponenten, stilvolles Design und eine thematische Tiefe, die sich besonders im fortgeschrittenen Spielverlauf entfaltet. Wer Freude an verzahnten Systemen und ökonomischem Denken hat, wird hier voll auf seine Kosten kommen. Neueinsteiger in das Genre oder Gelegenheitsspieler werden wahrsch. an der hohen Einstiegshürde scheitern. Es ist eines der Spiele, die man öfters spielen sollte, um den vollen Spielspaß raus zu kitzeln. Aber wir waren positiv überrascht, das wir in nicht mal 2 h fertig waren (zu 3.).\n\nPRO:\n+anspruchsvolles, thematisch dichtes Spiel\n+interessantes, unverbrauchtes Thema\n+exzellente Materialqualität und Artwork\n+innovative \"Verdrängungs\"-Mechanik\n+hoher Wiederspielwert durch variable Elemente und Strategiewege\n+tiefe strategische Entscheidungen\n+trotz Komplexität, ist Mechanik nachvollziehbar\n\nNeutral:\n-Für ein solch komplexes Spiel, gar nicht so lang\n-Downtime ist bei Grüblern möglich, aber durch Verdrängung ist man immer involviert\n\nKONTRA:\n-Sehr hohe Einstiegshürde\n-Verdrängung sorgt für etwas Unübersichtlichkeit bei der Reihenfolge\n-Kaum Platz für Fehler in der Strategie",
    "timestamp": 1760738400
  },
  {
    "username": "AdmiralAckbar31",
    "rating": 7.5,
    "comment": "$100",
    "timestamp": 1759960800
  },
  {
    "username": "ElkeM1",
    "rating": 7.5,
    "comment": "Played once. It took a while for the game to 'click', but then I really liked it. Want to play again.",
    "timestamp": 1759010400
  },
  {
    "username": "heatbbx",
    "rating": 7.5,
    "comment": "+ Promo Pack\n+ Promo Tiles\n+ Promo Artists",
    "timestamp": 1758837600
  },
  {
    "username": "dJJa",
    "rating": 9.0,
    "comment": "EXPERT",
    "timestamp": 1762470000
  },
  {
    "username": "bordspelkampion",
    "rating": 9.3,
    "comment": "beautiful components , piece of art!!!\nfantastic gameplay, heavy thinking , perfect !!\nlove the theme.",
    "timestamp": 1762038000
  },
  {
    "username": "halfchickenhalfsteak",
    "rating": 9.0,
    "comment": "(11/25) Having a much better sense of how scoring is all connected on repeat plays made this sing. My favorite Lacerda so far!\n\n(1/23) Loved my first play of this. Way more interactive than I thought it would be with the kick out actions, which kept engagement on board state high. Felt super streamlined and interconnected, not fiddly, and very functional graphic design. The Lacerda \"simple action but a whirlwind of deep choices\" truly shines here.\n\nThere might have been too much going on in the endgame scoring, but every action did feel like it knowingly contributed to each piece of that scoring, so I couldn’t be bothered. For a game to be as strong and integrated with a theme is so impressive... this is truly deserving of the praise it gets as the standard of what a heavy Euro should be.",
    "timestamp": 1761951600
  },
  {
    "username": "igor_f",
    "rating": 8.5,
    "comment": "1-4",
    "timestamp": 1760220000
  },
  {
    "username": "OGRussHood",
    "rating": 9.0,
    "comment": "My 2025 Top 250: #236\nMy 2024 Top 250: #185\nMy 2023 Top 250: #110\nMy 2022 Top 250: #61\nMy 2021 Top 250: #41\nMy 2020 Top 250: #31\nMy 2019 Top 200: #23\nMy 2018 Top 100: #20",
    "timestamp": 1758492000
  },
  {
    "username": "admi99",
    "rating": 8.6,
    "comment": "KS Stretch Goal 1&2, insert 3d, scoring exp",
    "timestamp": 1756591200
  },
  {
    "username": "alexlikesgames1994",
    "rating": 9.0,
    "comment": "Crunchy and fun!",
    "timestamp": 1756418400
  },
  {
    "username": "ajie426",
    "rating": 9.0,
    "comment": "第二次玩了，第一次是2021年2月。\n驱逐行动设计得挺好的，让所有玩家不至于空等，复杂哥之后设计的很多游戏都有类似的互动机制。而且作为他早期的作品，并没有那么的强行复杂，行动还蛮清晰明了的，教学+游戏（4人局）也就两个小时左右。\n极致的美工和panda的做工给游戏增色不少，漂亮的艺术品连我只玩轻策的老婆都忍不住尝试了一把，评价挺高，加一分。\n不太舒服的地方是画作的升值方式运气成分比较大，翻出来的下一副画影响太大。",
    "timestamp": 1756159200
  },
  {
    "username": "ryanmat33",
    "rating": 10.0,
    "comment": "Don't let the game's weight scare you from giving it a go . . . or you may be missing out on a gem. Playing two handed solo, I was able to breakup several different afternoons, to try out every action. By the third/fourth repeated action of all four locations, intermediate scoring, rules caveats, etc., I was able to no longer refer to the rulebook/player aid (which are amazingly done by the way!) and recall by the amazing iconography that has all the rules you need to understand the steps.\n\nEverything is clicking in place for me and this game feels more like a slightly heavier game than Agricola. My first game of that took 3 1/2 to 4 1/2 to process the rules with simulating a two player game solo to learn it. The Gallerist, I've spent about 4 to 4 1/2 hours, and my game is nearing the end. I suspect each game the playing time will decrease. My goal is to enjoy it in about 60 to 75 minutes at 2 player (my only player count I play games at or solo). If any are on the fence, this is not as intimidating as it's made out to be. Quite honestly, I only made a couple of set up mistakes that I noticed along the way and also only a couple of mistakes in gameplay. This was a relatively easy game to learn/play (at least to me).",
    "timestamp": 1761606000
  },
  {
    "username": "mayflowery",
    "rating": 10.0,
    "comment": "my personal favorite lacerda game.\nthe lacerda recipe in action, simpler than ever. turns are quick and analysis paralysis is few and far between.\nwhat i really like is that all the upkeep/admin is handled as part of actions instead of being its own thing like in kanban.\ndesperately need to play and finish a game of this with 4p. its complete chaos and i love it",
    "timestamp": 1759960800
  },
  {
    "username": "blake33",
    "rating": 9.5,
    "comment": "I think this one may end up being an all-time favorite. I love the game and am excited to try more Lacerda games now. While it takes a little long to teach, it really doesn’t feel that heavy when you’re actually playing. Great mix of theme, strategy, and interaction. I love it!",
    "timestamp": 1759269600
  },
  {
    "username": "Sigurd1410",
    "rating": 9.8,
    "comment": "Interesting theme. Intelligent with ugly modern art. Great game!",
    "timestamp": 1757887200
  },
  {
    "username": "Howlhazel",
    "rating": 10.0,
    "comment": "The gameplay is very tight and logic, this game is underated now",
    "timestamp": 1757455200
  },
  {
    "username": "BionicBeaver",
    "rating": 9.5,
    "comment": "Complete Version with scoring expansion.\n\nThis is the cleanest and most robust Lacerda game imo. Plays well at all player counts. Is my #1 game of all time.",
    "timestamp": 1757455200
  },
  {
    "username": "turzin",
    "rating": 9.5,
    "comment": "SOUS JOUÉ",
    "timestamp": 1755813600
  },
  {
    "username": "masterlelik",
    "rating": 10.0,
    "comment": "boardgames\nonce\nO",
    "timestamp": 1752616800
  }
]