[
  {
    "username": "Telaz",
    "rating": 1.3,
    "comment": "My rating(50%): 1.5\nMy “want to play-again” rating(50%): 1\nMy overall rating: 1.25\nPlays: 5+\n\nI HATE long/lucky games and this is exactly that. The worst sort of games ever created. Will NEVER play again. It has some interesting concepts however it is an awful game.",
    "timestamp": 1761865200
  },
  {
    "username": "thegreatbandini",
    "rating": 1.0,
    "comment": "My experience may have been tainted by the person who taught this. It's design is overblown - like all of the designer's games",
    "timestamp": 1761084000
  },
  {
    "username": "Nicocolithophoride",
    "rating": 1.0,
    "comment": "Help, so bad !",
    "timestamp": 1757541600
  },
  {
    "username": "DatDudeTho",
    "rating": 1.0,
    "comment": "Nothing really special once you get pass the novelty. Winner is the player who others ignore. If players target you, there is nothing you can do. Pure kingmaking, fine for those who enjoy it. If you are looking for strategy, this isn't it. Additional randomness due to dice roll and card draws.",
    "timestamp": 1757541600
  },
  {
    "username": "dlestarge",
    "rating": 1.5,
    "comment": "Overhyped",
    "timestamp": 1755381600
  },
  {
    "username": "Nacht99",
    "rating": 1.0,
    "comment": "I never walked away from the table before this game. I have not walked away since.",
    "timestamp": 1753740000
  },
  {
    "username": "Lapming1992",
    "rating": 1.0,
    "comment": "I played it so you don't have to. I like how the designer's games are so difficult than everything I've ever played before. But I have yet to find a game of his that I like.",
    "timestamp": 1751061600
  },
  {
    "username": "RatherDashingIL",
    "rating": 1.0,
    "comment": "Leder",
    "timestamp": 1737154800
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "Everyone's playing their own euro game and sorta interacting sometimes. They all collect VP at different geometric rates (probably the main reason this is so popular). At first I thought it was an issue with people not being experienced enough to negotiate. Then I played a tournament and got pretty far, and even these experienced players were stone quiet, refusing to talk or reveal anything. That was quite the wake-up moment.\n\nThe inspiration seems to be \"what if we took the best parts of euro games and war games, and combined them?!\" but to me it feels like the worst parts of each. People are so focused on their over-complicated personal boards that it's hard to interact on the map, and even then people only realize they need to stop a leader once they're close to winning (then it's too late). So one must play it a dozen times just like a euro game just for players to reach any competitive level. Kind of a backwards arc to me, shouldn't the interaction come first? But it's not much a war game either, there's no firm setting involved (less work, more sales!), no specifics or details. To me the most interesting war games have gaps in them, allowing players to fill in the details with roleplaying or research or maybe both. Most importantly, allowing players to actually worry about the other side's intentions instead of optimizing VPs.\n\nSo there's a chaotic core but it doesn't matter, this is intended to sell to euro gamers. Some will get really turned off by the combat and others will love it (I don't mind, but it's not gonna convince the former to keep playing when their engine falls apart), but to me there's hardly anything to fight with, since so much of the design is focused on economic engines. It's like the polar opposite of hybrids I do like, where the fighting comes first, and then players realize they need to tinker with that by adjusting their economic builds, and voila strategy emerges. Here it's the problem I have with euros in general: they're so focused on StRaTeGy first that it dominates everything, and then eventually you do tiny optimizations to adjust that. But not after a battle, then it's far toooo laaaate, you gotta do it 2 turns in advance!",
    "timestamp": 1734303600
  },
  {
    "username": "bjsully6",
    "rating": 1.0,
    "comment": "This game is terrible. I am not sure why it is so highly rated. It has very unique characters and abilities. The problem is that it just ends up being a very frustrating game because you cannot do things a lot. A lot of people would probably say well that is just the strategy of the game. I see that but at the end of the day the game just is not fun. I just don't find being frustrated all the time as fun.",
    "timestamp": 1730156400
  },
  {
    "username": "TheSmokeyFox",
    "rating": 1.0,
    "comment": "If you are playing this at 2 players there is really no way to play it asides from birds and cats giving it no replayability the AI components in the expansions don’t really work well either",
    "timestamp": 1722981600
  },
  {
    "username": "robotwizard42",
    "rating": 1.0,
    "comment": "This was quite possibly the worst board game experience I have ever had.\n\nBecause every faction plays differently, and the faction playstyles and effective strategies are not well explained, you need to have at least one player at the table who is intimately familiar with your faction if you want a chance of succeeding as a new player.\n\nIf you do not have this, you have very little guidance on how your particular faction should be played, and unlike other games, you can't just learn from what other players do since they are essentially all playing different games. This means that you're liable to spend multiple hours of gameplay just trying to figure out how to effectively play your faction with little guidance.\n\nThis miserable new player experience could be forgiven if the game didn't also take upwards of four hours to play, with very long turns. Strangely, my faction seemed to take very quick turns while everyone else's took ages. In addition there are very few opportunities for interaction on other players' turns. Because of this, in an over three and a half hour game, I spent maybe 15 minutes actually being able to affect the game in any way whatsoever.\n\nI played as the Corvid Conspiracy, and in my nearly four hour game, I was able to do the following:\n\nCraft one item\nBattle once\nFlip two plot tokens (my faction's main way of scoring points)\nBuy one card from the Riverfolk trader\n\nAnd that's basically it outside of basic actions like movement and card draw.\n\nThis is the only game I have ever played that I wouldn't play again if you paid me.",
    "timestamp": 1720044000
  },
  {
    "username": "dakotamassie",
    "rating": 1.0,
    "comment": "I HATE THIS GAME\nSo much down time in between turns, its boring, the factions are stressful and not fun, also the luck of the card draw drove me nuts\nDID I MENTION I HATE THIS GAME",
    "timestamp": 1717711200
  },
  {
    "username": "MotherMary",
    "rating": 1.0,
    "comment": "I find childish artwork marketed to adults very unsettling.",
    "timestamp": 1715119200
  },
  {
    "username": "Captain Boris",
    "rating": 1.0,
    "comment": "This game is complete garbage. When everyone has a different way to win, forget about learning how to play from people who know the game better than you do - especially if they don’t know how you win with your faction. There are many better ways to spend your evening than giving yourself a migraine.",
    "timestamp": 1703113200
  },
  {
    "username": "TOOMUCHGOOD",
    "rating": 1.0,
    "comment": "This isn’t a game that I would own, asymmetric is so different, it is hard to tell what player are ahead or behind.",
    "timestamp": 1699311600
  },
  {
    "username": "Rinkuli",
    "rating": 1.0,
    "comment": "I won, still hated it.",
    "timestamp": 1686693600
  },
  {
    "username": "Elanif",
    "rating": 1.0,
    "comment": "Unfortunately I'm forced to keep playing it",
    "timestamp": 1673046000
  },
  {
    "username": "Cr_nchy",
    "rating": 1.0,
    "comment": "I really wanted to like this game but it just wasn’t for me.",
    "timestamp": 1667775600
  },
  {
    "username": "CJE1111",
    "rating": 1.0,
    "comment": "Anthropomorphic animals... While used well by Aesop. Such a bad idea with modern sentiments.",
    "timestamp": 1667775600
  },
  {
    "username": "honk3d",
    "rating": 1.0,
    "comment": "+1 np",
    "timestamp": 1667257200
  },
  {
    "username": "KAMWAH",
    "rating": 1.0,
    "comment": "Physical copy (score 1): hard to teach, hard to keep track of everyone doing right for their faction,(own puzzle game) unfair to new players, who without complete knowledge of other factions. only good for those who have regular playgroup to explore this game. (need 4+ games to try out all factions (base game), before you really get into the entrance and plan strategy against others)\n\nApp: (score 7) Cancel out most of the drawbacks of Physical copy. A lot of people rated it high only because of the App. Is root still a board game while people don't want to play it with a physical copy? Why don't I rate a PS5 game here?",
    "timestamp": 1652220000
  },
  {
    "username": "JGRno5",
    "rating": 1.0,
    "comment": "I have no use for a game that I have no chance to win due to anothers action/inaction. I'm one and done on this one.",
    "timestamp": 1650924000
  },
  {
    "username": "Behowulf",
    "rating": 1.0,
    "comment": "This is a much shittier version of risk with furry characters.",
    "timestamp": 1634767200
  },
  {
    "username": "sdkfz181",
    "rating": 1.0,
    "comment": "Unbalanced!",
    "timestamp": 1631138400
  },
  {
    "username": "PlamenBr",
    "rating": 1.0,
    "comment": "Could have been great COIN war-game but thematically screwed up. Waiting for someone to use and adapt its system for a proper military history game.",
    "timestamp": 1623276000
  },
  {
    "username": "Lividentity",
    "rating": 1.0,
    "comment": "The rules are extremely confusing. The basic game 2 turn setup is poorly done. Played around person game and it easily took 90 minutes just to figure out. The art style and have complexity is so disconnected it's ridiculous. Would absolutely not recommend playing.",
    "timestamp": 1618783200
  },
  {
    "username": "eireenene",
    "rating": 1.0,
    "comment": "Tried this three times before deciding it wasn't for me.\nI bought it because the cute graphic got me, Kyle Ferrin's designs are incredible, but the game is awful to put it mildly.\nBoth groups I played with, we spent one to two hours trying to comprehend the rules, and even with two rulebooks and some cue cards we couldn't grasp it all. We watched some videos to try and learn, and we still had a hard time. Moreso, once we started playing it was a mess, where the asymmetric side of the game can be really heavy when other factions won't collaborate, or when everything gets decided by a roll of dices (yikes!).\nThe thing that let me bitter the most tho was the fact that this game is impossible to play in 2 players. It just doesn't work, and my usual group of gaming is 2-3, or 6 and plus.\nI hope Kyle Ferrin gets to draw illustrations for other games that aren't Root, thank you.",
    "timestamp": 1615935600
  },
  {
    "username": "BloodyMe",
    "rating": 1.0,
    "comment": "I gave up after one turn.",
    "timestamp": 1612047600
  },
  {
    "username": "f3lip3almeida",
    "rating": 1.0,
    "comment": "This game feels like homework to learn and play. It has 2 manuals and several cue cards but none of them explains everthing you need to know. Me and my three friends spend hours, trough multiple playtroughs just to learn each faction and in every play there is always something that we were missing. But most importantly: we weren't having any fun, its reealy a chore to play and it truly feels like we were wasting our time, until we decided to finally give up and play something else. If you like intricate and detailed gameplay maybe this one is for you but im sitting this one out.",
    "timestamp": 1608937200
  },
  {
    "username": "The7thLegion",
    "rating": 1.0,
    "comment": "Anyone buying this game is in for a terrible first experience (or five).\n\nThe \"intro\" book is 27 pages long, that is expected to be known by at least one person, before doing the intro walkthrough.\n\nI might see this game becoming enjoyable after 10 or more attempts at playing it, but do not expect to play this with friends, who've not played before, and enjoy your time.\n\nI bought this, bause of the good reviews, however it is a terribly explained game right from the moment you unpack the box. I also specifically bought this to play with two people, figuring you could pick any faction. But the game isn't balanced so your stuck with only being able to play as two. Meaning you experience 50% of the game.\n\nDo yourself a favour and skip this game.",
    "timestamp": 1603926000
  },
  {
    "username": "ogunil",
    "rating": 1.0,
    "comment": "complex version of the intrigue",
    "timestamp": 1602799200
  },
  {
    "username": "bakerja",
    "rating": 1.0,
    "comment": "I despise this game",
    "timestamp": 1595714400
  },
  {
    "username": "Hadesrso",
    "rating": 1.0,
    "comment": "Unbalanced, dice throws can change the winner, definitely hated the game. Do not understand the rating !",
    "timestamp": 1589320800
  },
  {
    "username": "Angino",
    "rating": 1.0,
    "comment": "played 3times allready,... bad, bad , so bad.",
    "timestamp": 1585778400
  },
  {
    "username": "BraxtonBragg",
    "rating": 1.0,
    "comment": "Mindless Muck.",
    "timestamp": 1574377200
  },
  {
    "username": "Michellian",
    "rating": 1.0,
    "comment": "Unique game design of highly asymmetric style requires that each faction player knows how to do their part to maintain a balance in the game. If a player tilts this fragile balance, someone will win outright without giving others a chance, no matter how strong they are in their gameplay. In other words, game balance is highly dependable on players.",
    "timestamp": 1567893600
  },
  {
    "username": "Nomorepiratedgame",
    "rating": 1.0,
    "comment": "For working with Yoka, a company known for its plagiarism of Bang!",
    "timestamp": 1564092000
  },
  {
    "username": "erniemacmurray",
    "rating": 1.0,
    "comment": "Not a war game",
    "timestamp": 1556229600
  },
  {
    "username": "yiorgolas",
    "rating": 1.0,
    "comment": "Too complex for 5 year olds, artwork cannot be tolerated by an adult on his right kind of mind. Grimm Forest has same artwork, but it matches excellently with the theme and it is playable from 5 year old kids.....",
    "timestamp": 1552431600
  },
  {
    "username": "Billnyhilist",
    "rating": 1.0,
    "comment": "sucks",
    "timestamp": 1548716400
  },
  {
    "username": "Frozen Flesh",
    "rating": 1.0,
    "comment": "I came here, because of all the people rating games like KD:M or Hate with a 1, just because of their mature theme.\nI’m offended by how boring the theme of this game is!",
    "timestamp": 1547074800
  },
  {
    "username": "vikings40",
    "rating": 1.0,
    "comment": "Very bad game...",
    "timestamp": 1544742000
  },
  {
    "username": "Mitchuation",
    "rating": 1.0,
    "comment": "Was somewhat upset by the perceived value of this game. I have boycotted companies in the past before (TMG) for showing a drastically different suggested MSRP then what the price ends up being. Not only this, but the company choosing to make this available to folks at a convention prior to the kickstarters left a bad taste. If the gameplay wasn't as fun, I would be leaving this with a rating of 1.\n\nWith that said, on top of this the gameplay is also not without its balance issues. Some of the factions are completely dependant on the play of others due to their reactive nature. Some completely stomp others if not dealt with properly. Some just match up poorly against other factions due to their conflicting playstyles.\n\nGames shouldn't be balanced around the \"Oh, by the way, this class is the most powerful in this 3 person match-up so we'll have to both ensure they don't run away with it.\"\n\nAny amount of collusion required to make a game balanced needs to go back to the drawing boards. Although the gameplay is fun, because it appears to be slightly imbalanced, replay value will be minimal.\n\nI am just left with the impression that the organization doesn't care enough to deliver a quality product. Will update rating if this game starts rubbing me the right way, but for now I'll think twice before backing Ledergames new product.",
    "timestamp": 1542495600
  },
  {
    "username": "Killagame",
    "rating": 1.0,
    "comment": "Waste of time, especially if you play with different groups.",
    "timestamp": 1538258400
  },
  {
    "username": "tswider",
    "rating": 1.0,
    "comment": "not a wargame",
    "timestamp": 1537048800
  },
  {
    "username": "Roboninjadino",
    "rating": 1.0,
    "comment": "Played it twice and hated every minute of it.\nThe barrier to start is baffilingly high in my opinion because of the variance in gameplay between species.\nThe gameplay itself I felt like was a series of feel bad moments leading to a sense of powerlessness. Im sure that if I spent another 10 play-throughs on it I would figure it out, but I disliked it so much Im not interested in going back after my two abismal sessions. Not for me, sorry.",
    "timestamp": 1536962400
  },
  {
    "username": "VonDodo",
    "rating": 1.0,
    "comment": "I never gave a 1 to any game.. but this KS experience is by far the worst..... First they pretend to be pure and cool to not put exclusives (agreeable) and then you discover only reason is tied to logistic costs since they wants to ship and produce KS and Retail together with all problem that will come by that. Then after 6 months they keep preorders open outside KS at the same KS price (i bet KS will get their copies after retail either)..... Then they change graphic and content on the run (because it lookd better... right i am going to believe that is not because srtandard size meeples costs less). And so on... Last game i will ever buy from this company.....retail or KS. This beside being the opposite spectrum of some famous companies exploiting KS is noway better... reminds me of Electronic Arts if anything...",
    "timestamp": 1526594400
  },
  {
    "username": "Noobidish",
    "rating": 2.0,
    "comment": "It’s a game about conflicts, but it’s not really saying much about anything. I don’t know what a mouse-man in suspenders and shorts is supposed to be fighting for. See COIN games for conflicts about real things and people, though yeah, a lot of those arent very good either.",
    "timestamp": 1762557720
  },
  {
    "username": "SpielzusammenGER",
    "rating": 2.0,
    "comment": "Played it a couple of times.\nUnbalanced factions and pretty much every single time you have an uproar / mutiny which ruins your plans.\nNeat theme and cute animals but this needs a remake with nerfed rules and balanced factions.\nThe cats are boring as hell and i have never seen them win. Not recommended.",
    "timestamp": 1761429600
  },
  {
    "username": "AbgalAzag",
    "rating": 2.0,
    "comment": "Too much rules for what it is, downtime in everything, good art, bad game.",
    "timestamp": 1759788000
  },
  {
    "username": "pingus",
    "rating": 2.0,
    "comment": "Given the designer speech on defense of Kingmaking I'm no longer surprised that I hated the game.\n\n3 plays so far (Birds, Cats & Woodland alliance).\n\nGeneral impression:\nI feel the game is 3 cowboys (mages) problem squared. Also there is like 4 minigames (one per faction) and none of them is very interesting. There is a lot of randomness in getting the right cards (the right cards are always birds) and there is not a lot you can do about a bad start.\n\nBirds:\nVery dependant on getting bird cards, the core gameplay is propably the most fun, but their dependance on these random cards from the start make tham all or nothing as they really can't catch up. Not fun to play.\n\nCats:\nVery easy to play and very linear gameplay. I've seen them 3 times and all the times they are doing the same things and usually winning or in contention for 1st place. Not fun to play, but you can win.\n\nWoodland Alliance:\nUntil you get base your gameplay sucks. You can not get a base for a while, because of stupid rule about max 5 cards without a base. You can only win with exploding by sacrificing your units for alliances counter in one explosive round. Not fun to play.\n\nHaven't played trashpanda, but he is so out of place and there is so many rules about him that other players don't feel like they have the info to stop him. I really hate this kind of design personally. On the flip side he seems to be the side with the only real decision. \n\nTL;DR: play blood rage instead. Learning to play this is so much effort for so little payoff.",
    "timestamp": 1754949600
  },
  {
    "username": "p_morphy",
    "rating": 2.0,
    "comment": "My experience on my first game, playing it with some others who already knew that game: 3 players where just waiting that the last totally overpowered faction overrunning the others players finally won in a completely unbalanced game. Will never play that again.",
    "timestamp": 1750543200
  },
  {
    "username": "pluviometer",
    "rating": 2.0,
    "comment": "The art is really really cute. That's the only thing I like about this game unfortunately -- war games and area control are completely out of my interest zone. Even playing as the Vagabond couldn't salvage my enjoyment.",
    "timestamp": 1744840800
  },
  {
    "username": "lefthandedsquat",
    "rating": 2.0,
    "comment": "There are few games that I despise. This one tops that short list. I play games to have fun. There is nothing fun about this game. Nothing.",
    "timestamp": 1741129200
  },
  {
    "username": "NaokoBP5",
    "rating": 2.0,
    "comment": "Too complicated, not possible to remember what each roles are doing. I really do not like the unfairness that each player have different abilities.",
    "timestamp": 1737932400
  },
  {
    "username": "tzar323",
    "rating": 2.0,
    "comment": "Not for me",
    "timestamp": 1737846000
  },
  {
    "username": "Drenchoor",
    "rating": 2.0,
    "comment": "Сложна только из-за обилия сильно асимметричных фракций, после изучения игры на которых (1-2 партии), игра превращается в простую погоню «кто задушит лидера. Может была бы интересной, если бы было уникальное положительное фракционное взаимодействие (кроме бродяги и выдр), создающее хоть немного игру над столом.",
    "timestamp": 1736636400
  },
  {
    "username": "tectactoe",
    "rating": 2.0,
    "comment": "Have played the digital implementation against the PC only, though I'm not sure I could manage this physically. Having to remember all the edge cases and specific rules for each faction seems like something of a nightmare, even if it is rather impressive how all the different mechanics can combine in various ways and still engender tense, balanced gameplay. I think there's just an inherent \"flaw\"—quotes because obviously some/many people would not see this as a flaw at all—to these sorts of games that require entirely different rulesets for each character/faction, meaning you'll essentially have to learn multiple \"games\" to be semi-competent. If you plan on playing ROOT dozens of times, great. But what if you don't?",
    "timestamp": 1734822000
  },
  {
    "username": "Boroslegion",
    "rating": 2.0,
    "comment": "Played with 4 players, noone ever played that game before.\nIt was a desaster, noone had fun and we gave up after 1.5h of rulesreading/discussing, making almost nothing with impact on the board and whishing for playing other funny games.\n\nI don´t know if i ever had less fun in a game session.",
    "timestamp": 1731452400
  },
  {
    "username": "revshafer",
    "rating": 2.0,
    "comment": "Possibly the greatest asymmetrical game ever published. Each faction is well designed with definite strengths and weaknesses. Players seem to have the freedom within the game to attack or defend from whomever they might choose. The graphic design is extraordinarily well done and begs for even further marketing. It's very well done. It is all a high quality production.\n\nUnfortunately, the unforeseen costs of manufacturing in China have produced some issues with the game. Some slowdown has occurred in Kickstarter fulfillment, due to the coronavirus outbreak. Leder Games wishes to be artistic and socially conscious yet does its manufacturing in a country that harvests political prisoners for organ transplantation.",
    "timestamp": 1725141600
  },
  {
    "username": "PJV666",
    "rating": 2.0,
    "comment": "C'est bien l'asymétrie dans des jeux bien gérés (twilight/dune imperieum, 7wonders, rising sun etc.) Mais alors là, c'est vraiment un des pires jeux asymétries que j'ai vues... Le chat qui est fait pour les débutantes et assez faciles à jouer et un peu fort... Le vagabond over cheaté et je n'en parle pas quand c'est joué par une personne qui a déjà pas mal de parties actives. Le corbeau qui est dur à jouer et a win. Enfin bref beaucoup trop de défauts et surtout un gros point qui pour moi rend un jeu 'mauvais' c'est le fait de devoir jouer avec les mêmes personnes et le même nombre de parties sinon on voit tout de suite la personne qui a fait + de parties qu'un tel par le fait d'être VRAIMENT avantagé (voir cheat) que ceux qui ont beaucoup moins de parties dans les pattes... Ce n'est pas un léger avantage comme certain deck building, c'est vraiment un avantage x5.",
    "timestamp": 1723154400
  },
  {
    "username": "4Corners",
    "rating": 2.0,
    "comment": "Opaque, unbalanced and not very interesting. I'm not the target audience for this game clearly.",
    "timestamp": 1722031200
  },
  {
    "username": "FR_IT",
    "rating": 2.0,
    "comment": "Are you kidding me? A puss in boots vs cats vs raccoons vs silly things.\nPlease folks read some history and play something else.\nThe most overrate game i have ever seen to whom i was invited to play...i lost my time.",
    "timestamp": 1720994400
  },
  {
    "username": "t0dd0",
    "rating": 2.0,
    "comment": "How is this the #31 overall game? It’s terrible. Just a few unlucky die rolls knock you right out of the game? The bird people can be manipulated right out of the game depending on their card draws and opponent playing around them? There’s too much left to chance in this game, making it feel like the victors just got luckier, that’s not a good feeling or a fun time. I guess I can see why it’s popular, anyone has a shot at winning just due to the capriciousness of fate.",
    "timestamp": 1719612000
  },
  {
    "username": "noom777",
    "rating": 2.0,
    "comment": "It feels like a job and not a game to enjoy yourself.",
    "timestamp": 1715378400
  },
  {
    "username": "overcommunikate",
    "rating": 2.0,
    "comment": "The art is beautiful but honestly we couldn't figure out the rules so just played a long game of making up our rules.",
    "timestamp": 1708729200
  },
  {
    "username": "Jackyboi",
    "rating": 2.0,
    "comment": "A game that takes a playthrough of every type of faction others can play before standing a chance at the game is brutal to new players. The way I see it we are all not playing the same game and I find it incredibly frustrating. 4 hrs of play and I have no I idea how the game went, somebody won... I think. Terrible game design. No fun.",
    "timestamp": 1706655600
  },
  {
    "username": "PetSven",
    "rating": 2.0,
    "comment": "The winner came down to king-making.",
    "timestamp": 1703804400
  },
  {
    "username": "Forgeforgeforge",
    "rating": 2.1,
    "comment": "Fuck victory points treadmills and fuck this game. ambitious and singularly unpleasant.\n\nWehrle's idea that unfairness and kingmaking are good is either charmingly coocoo-bananas or genuinely infuriating. Games can, and should, be a better world, I have no interest in simulating the pointless injustice of reality in miniature.\n\nIf you're going to make the factions this numerous and wildly unbalanced, which is a cool idea, there should be a scenario book for various combinations that include starting placements or optional rules that rebalance them and showcase a dynamic.\n\nPutting the balancing on the players, when the rules are as inharmonious and laborious as they are, is a recipe for the vast majority of players, on the vast majority of occasions, to have an awful time (eg lizard cultists vs lord of hundreds, it takes the lizards a full turn of actions to clear a single mob token. unbelievable. Lord also has up to 5 attacks to scrub corvids off map (of course lords score no points, so no one accomplishes anything or has fun)).\n\nEven in such a rich and kooky and wild landscape as this, all of its heart just gets fed into the blender that is incremental victory points. You're going to make a game this broken and then rob of us of asymmetric victory conditions defined by the current board state (or even just symmetric but board based eg cyclades)?\n\nCrafting for points is amazingly uninspiring. I could not care less about points. I cannot stress this enough. Fuck Points for points sake. Players should play for success, power, and industry, and then have scoring being rewarded incidentally to those strategic goals.\n\nThe cards in general are dull, when getting draws should be exciting. Your hand should matter, and they're mostly just tokens, suited or not. If you're going to make a broken game, make the crafting be for interesting exciting powers that change how the game plays (something oath did right, only to fall down in every other way).\n\nSwingy wild pointless ending. Drag the leader back until you can't anymore. what fun. Anyone who says this game \"tells a story\" should go read a book.\n\nThe factions are all unique, and their differences are interesting. Actually playing any one faction, though, is dull and scripted. There's very few opportunities to be clever, though the game is clever itself. There's very little agency outside of the explicit powers and roles you'll be acting out the same way every turn. If the different woodland powers were NPC mercenary factions that each player could commission each turn, you could have an interesting game with such scripted powers. All the fun root has to offer was had by its designer.\n\nI think this game does damage to the hobby.",
    "timestamp": 1701126000
  },
  {
    "username": "Nikkinoonoo",
    "rating": 2.0,
    "comment": "Overly complicated to learn the multiple classes. Much more fun to play the steam version of the game as it’s hard to gauge what you’re allowed to do and not allowed to do. The use of vocabulary for different things in the game (e.g dynasty) is not very friendly for the lesser geeky of us here.",
    "timestamp": 1690840800
  },
  {
    "username": "Mckrakalaka",
    "rating": 2.0,
    "comment": "Just dull as dirt. Rinse repeat, get through it to get it over with. There are bo surprises or joyful discoveries.",
    "timestamp": 1688335200
  },
  {
    "username": "mallie_67",
    "rating": 2.0,
    "comment": "Pas terminé, à refaire",
    "timestamp": 1681509600
  },
  {
    "username": "doggydog",
    "rating": 2.0,
    "comment": "wasn't fun\nasymmetry takes 4* to learn\nyou will lose friends in board games if you don't invite the right people",
    "timestamp": 1677366000
  },
  {
    "username": "FrancescoFarina",
    "rating": 2.0,
    "comment": "Too much asimmetric. Too long to understand what is happening. Not sure if the races are balanced, probably not at all. Not bad, anyway, but I dont like it.",
    "timestamp": 1672009200
  },
  {
    "username": "Janasik",
    "rating": 2.0,
    "comment": "I adore the art style and the general idea of the game, but the gameplay left me and my group feeling underwhelmed. The biggest problem is the amount of rules Root requires you to learn despite it being a simple war game at its core. You have your own rules to learn, but then you have to learn the rules for the other factions too, so you're not caught off guard by a special ability. A majority of the rules you have to learn and understand are rules that you, yourself, will never use.\n\nSo many games use asymmetry to make you feel overwhelmingly powerful in some unique way, but here the differences feel skin deep. Each faction has different rules, but it feels interchangeable whether you're fighting a cat or bird. Roll dice, and pray for a high number.",
    "timestamp": 1664661600
  },
  {
    "username": "seaapple",
    "rating": 2.0,
    "comment": "Hated it. I don't understand the hype.",
    "timestamp": 1664316000
  },
  {
    "username": "lovelyz",
    "rating": 2.0,
    "comment": "structurally unbalanced",
    "timestamp": 1651356000
  },
  {
    "username": "Brizzley",
    "rating": 2.0,
    "comment": "Played a few times now and it is not for me. My gaming group like it!",
    "timestamp": 1649368800
  },
  {
    "username": "ghiralle",
    "rating": 2.0,
    "comment": "One of the most over rated game i've ever seen! Too much asymmetrical, confusing rules, boring tima, and the only-gain-score system is useless for the mechanic.",
    "timestamp": 1645311600
  },
  {
    "username": "hg_enterprises",
    "rating": 2.0,
    "comment": "Sold did not care for",
    "timestamp": 1640559600
  },
  {
    "username": "NormandyWept",
    "rating": 2.0,
    "comment": "On the one hand, a real success at what it sets out to do - raising interest in asymmetric conflict games through a well-written rulebook and some sensational presentation.\n\nHowever, each faction's unique play is essentially expressed through the most 2018 delivery system possible: their own contemporary-Euro-style player board puzzle. The things each player has to manage are just a bit too opaque and it feels like too much work to learn every system before you can get into the substance of the game itself and a real contest between players.",
    "timestamp": 1633557600
  },
  {
    "username": "Greedful",
    "rating": 2.0,
    "comment": "Won’t play again.\nAs with most area control/strategy games, the players just decide who wins. Everyone beats up on one player, that player loses… not really surprising.\nSo it comes down to table talk like: don’t beat me up, beat them up, they’re winning more - or - leave me alone guuuuys pleaaase - YAWN.\nOk so this game was clearly not going to be for me due to above points - but it is made worse by:\nAn insanely long teach due to everyone’s factions being different.\nWatching sliders go up and down based on players positions and how close to winning they are - which helps as newer players won’t necessarily even be able to tell who is winning due to asymmetric factions - but also serves to draw focus back to the ‘they’re winning get them’ table talk… again, those conversations are so dull!\nOr - players follow there own agendas, and in so doing, the winner can be picked out from turn 4-5 and there’s not much point in the rest of the game, as it’s a forgone conclusion.\nMost of the time someone just sneaks across the finish line at the end and it’s super anticlimactic.\nSome of the mini games of factions are fun - like the aerie/birds programming - but most aren’t fun/interesting, like the vagabond… but they sure take a long time to learn either way! Hurray!\nHard pass, imo look elsewhere for fun.",
    "timestamp": 1631656800
  },
  {
    "username": "myyysha",
    "rating": 2.0,
    "comment": "My idea of Hell is playing Root for eternity with any other faction than the Forest Alliance, who is basically destined to win.",
    "timestamp": 1626127200
  },
  {
    "username": "Soenny",
    "rating": 2.0,
    "comment": "gespielt",
    "timestamp": 1621634400
  },
  {
    "username": "Pterik",
    "rating": 2.0,
    "comment": "Interesting mechanics - but very unbalanced expecially after expansion",
    "timestamp": 1619992800
  },
  {
    "username": "rafazaki",
    "rating": 2.0,
    "comment": "Si bien inicia interesante, rápidamente los turnos se vuelven demasiado largos y aburridos donde en la gran mayoría de casos no tienes opciones sino que, o haces lo más conveniente o pierdes... eso sumado a que los turnos largos generan entre turnos inaguantables.\n\nParecía interesante y tenía ganas de probarlo pero al jugarlo terminé aburrido.",
    "timestamp": 1619733600
  },
  {
    "username": "jmsmith2434",
    "rating": 2.0,
    "comment": "Too asymmetric for my tastes. Not worth the investment.",
    "timestamp": 1613084400
  },
  {
    "username": "sir_galahad",
    "rating": 2.0,
    "comment": "Incredibly boring......zzzzzz.",
    "timestamp": 1612220400
  },
  {
    "username": "zb1035",
    "rating": 2.0,
    "comment": "The game here is bad. It’s all about the cuteness and novelty of the factions. Once that wears off the gameplay leaves a lot to be desired. Which is a problem because it’s impossible to teach.",
    "timestamp": 1607382000
  },
  {
    "username": "Marzuki",
    "rating": 2.0,
    "comment": "COIN Lite. Interesting faction mechanics make this game stand out.\n\nEdit: After about 6 plays, I don't ever want to play Root again. Mechanics are bland and lopsided after the shine wears off.",
    "timestamp": 1597701600
  },
  {
    "username": "pulibidda007",
    "rating": 2.0,
    "comment": "This game plays awful with 2 players. They should just market this as a 3-4 player game.",
    "timestamp": 1594591200
  },
  {
    "username": "fillette",
    "rating": 2.0,
    "comment": "It's not bad but it's really really really\nnot for me.",
    "timestamp": 1594245600
  },
  {
    "username": "Courgax",
    "rating": 2.0,
    "comment": "Frustration in a box. I played twice, and I'm done now. I left the first game (first time ever I've done that) after 3h, second one was terrible too but at least short (1h+ rules and 1h30 gameplay at 4).\nYou can not plan much because you can get rekt by others anyways, factions are not balanced (ok it's a feature), but you can barely play your own and have no idea how others really work in your first few games. After 1h+ of rules you're don't even want to know. Players with experience will destroy you and make the game even more frustrating.\nIf you ever find yourself first in VP, prepare to see everything you built up destroyed. Maybe for others, never again for me.",
    "timestamp": 1584313200
  },
  {
    "username": "bernard8416",
    "rating": 2.0,
    "comment": "Jeu bien compliqué pour pas grand-chose...\nJe pense qu'il faudrait plusieurs parties avant de comprendre les finesses de ce jeu... s'il y en a!\nJe déconseille!",
    "timestamp": 1584226800
  },
  {
    "username": "Antyrael",
    "rating": 2.0,
    "comment": "This seems to be less of a strategy game and more of a \"gang up on whoever is winning\" game that results in being punished for being ahead. This overrides any strategy in the game and it's terrible for new players because they have to learn every faction to feel like they know what's going on and what they should be doing (which they can't do). If I can't get somebody to enjoy a game on their first playthrough, it's not going into my collection.",
    "timestamp": 1562623200
  },
  {
    "username": "Hogwa5h",
    "rating": 3.0,
    "comment": "Not my kind of game. A lot of my friends like it, but unless I can play the merchant character where I don't have to play the actual game, not interested.",
    "timestamp": 1760392800
  },
  {
    "username": "SuncoastGuy",
    "rating": 3.0,
    "comment": "Once it comes down in price / increases availability.",
    "timestamp": 1759183200
  },
  {
    "username": "Tamino1",
    "rating": 3.0,
    "comment": "A 3, I know I'm giving this a three, one of the most popular asymmetrical war games. It's really hard to write about this game, as the art and the concepts in Root are really great. I truly love all the cards and the illustration of the game board; it makes it feel as though the game doesn't take itself too seriously. Which is a nice change for a war game. Really adding to the appeal. And the concepts are really interesting from a game design point of view. I like the role of the Vagabond just walking around in a forest full of fighting, minding their own business. But absolutely capable of interfering with players who get too strong. But the gameplay loop itself is just not enjoyable. It feels like ages waiting for your turn while watching the others mostly doing meaningless things that don't affect you at all. You can't even plan your next move because you never know what a different player will do. Additionally, the game feels tedious. I love long, complex games like Brass: Birmingham, but Root felt like every turn you are just inching forward (if at all). Maybe this game should have been shorter and smaller, making you more aware of what other people are doing, because it doesn't take much from them to win. Anyway, I won't be playing this again, which is unfortunate, as I really wanted to like this game.",
    "timestamp": 1757800800
  },
  {
    "username": "Lady_Valington",
    "rating": 3.0,
    "comment": "For me personally the worst game i played multiple times.",
    "timestamp": 1757023200
  },
  {
    "username": "CharlieMnemonic",
    "rating": 3.0,
    "comment": "It’s just not for me.",
    "timestamp": 1756245600
  },
  {
    "username": "weidox",
    "rating": 3.0,
    "comment": "Lots of learn due to massive asymmetry for what is underneath just a pretty simple and boring game.",
    "timestamp": 1756159200
  },
  {
    "username": "TittleSkittle",
    "rating": 3.0,
    "comment": "As someone who mostly plays solo and 2 player this was way too much for me. I heard Spirit Island was hard to grasp solo and this was way more intense. The bots turns take longer than mine and I don't want to spend 75% of the game doing something for someone/something else. ( I had Riverfolk and Clockwork as well). Also, they changed the rules so much it was kind of annoying to figure out what was new and what I could use out of the box. No other game I own has required extra online digging to figure out whats the latest implementation. So make sure you get the latest edition.\n\nIt's not great if you're mostly solo or two player. You're better off playing something else you like at those player counts. This won't hit the table too often unless you're at 3 or 4 where the game really shines.\n\nThe components are awesome and I respect the game 100%. If you have game nights its a good war game for sure.",
    "timestamp": 1754431200
  },
  {
    "username": "Antch007",
    "rating": 3.0,
    "comment": "I hate it, it is so unneeded complex for quite an uninspiring experience",
    "timestamp": 1754258400
  },
  {
    "username": "Affensohn",
    "rating": 3.0,
    "comment": "Zuvorderst fällt mir nach 3 Partien mit den Katzen das unvollständige Balancing auf. CitOW hatte dieses Problem ebenfalls, so dass Tzeentch seltener als die anderen Fraktionen gewinnt (etwa 2/11 Partien, jede andere 3/11). Was bei der Fraktion allerdings trotzdem Spaß gemacht hat, war, dass man unter dem Radar bleiben konnte, weil man mit der schwächsten Boardpräsenz von Khorne gemieden wurde und eine Vielzahl von kampfbeeinflussenden Karten allen Fraktionen die Kämpfe mit Tzeentch verleidet hat, so dass diese kein primäres Ziel darstellten.\n\nBei Root ist nun wohl wie von mir wahrgenommen die Markisenkatze die schwächste Fraktion. Statt unter dem Radar bleiben zu können, ist diese aber durch ihre Boardpräsenz immer primäres Ziel von eigentlich jeder anderen Fraktion. Einzig der Vagabund könnte sich den Luxus erlauben, bevorzugt gegen andere vorzugehen, bei Maus und Vogel sehe ich diese Möglichkeit nicht. Das heißt, dass kaum eine Chance besteht, dass sich andere Fraktionen untereinander aufreiben und schwächen, stets ist man mit involviert.\n\nFragwürdig ist in dem Zusammenhang die Design-Entscheidung, dass es für das Verhindern von Siegpunkten kaum (gg die Mäuse) bis gar keine (gg den Vagabunden) eigenen Siegpunkte gibt. Auch das war bei CitOW ganz anders gelagert, wo Khorne direkt davon profitiert hat, den Runaway Leadern zuzusetzen bzw sogar darauf angewiesen war.\n\nIm Gegensatz dazu ist bei Root nicht eindeutig zu beantworten, wer diese Verantwortung wahrnehmen muss, was zu ständigem Aufhetzen (du musst dich um x kümmern) und Lamentieren (bin selbst so schwach) führt.\n\ntl;dr: play CitOW instead!\n\nTaken from Reddit: \"[...]the biggest problem with Root. Players need to \"play right\" and if they don't, the game crumbles. And it doesn't crumble in a way where it hurts the player who played \"wrong\" like what happens in most games, it crumbles in a way where it hurts the whole game.\"",
    "timestamp": 1750716000
  },
  {
    "username": "jeremysprofile",
    "rating": 3.0,
    "comment": "Because each species has completely different rules and win conditions, it's very challenging to make sure everyone completely understands everyone else's goals and actions. I've played 3 times, and never played a correct game - someone has always discovered partway through that they misunderstood a core component of how to play their species.",
    "timestamp": 1750629600
  },
  {
    "username": "gglkid",
    "rating": 3.0,
    "comment": "(Digital)",
    "timestamp": 1750543200
  },
  {
    "username": "lililililil",
    "rating": 3.0,
    "comment": "Automata",
    "timestamp": 1747432800
  },
  {
    "username": "wholesomedegenerate",
    "rating": 3.0,
    "comment": "It's not a bad game, at all. But I did not enjoy it. The rulebook is an absolute disaster and has lead to more confusion than any game of similar scope I've played - a problem shared with its spin-off.",
    "timestamp": 1746914400
  },
  {
    "username": "Elius404",
    "rating": 3.0,
    "comment": "Feels pretty miserable on a first playthrough due to the nature of it being both significantly complex and asymmetrical",
    "timestamp": 1745877600
  },
  {
    "username": "asocil",
    "rating": 3.0,
    "comment": "Played only one game, it was confusing, long and boring. I'm not willing to try again, but maybe my rating would go up if I did.",
    "timestamp": 1745186400
  },
  {
    "username": "Erboka",
    "rating": 3.0,
    "comment": "Friend's game",
    "timestamp": 1745013600
  },
  {
    "username": "tbrofromspace",
    "rating": 3.0,
    "comment": "If I want to have the terms of play dictated to me, I would go to school",
    "timestamp": 1743631200
  },
  {
    "username": "Albertinum",
    "rating": 3.0,
    "comment": "Hard work. Not fun.",
    "timestamp": 1742598000
  },
  {
    "username": "Beastly_Venturer",
    "rating": 3.0,
    "comment": "1 play. Fell flat for me. I know this will likely reward after many plays but I just did not see enough in the game to bother. I seem to be in the minority on this and that's OK.",
    "timestamp": 1742166000
  },
  {
    "username": "Bobekistan",
    "rating": 3.0,
    "comment": "One good experience, one quite bad and one mediocre. Game is super fragile and very reliant on players controlling each other. Meaning to punch the leader in the mouth, then steal their wallet. This is fine, I'm not inherently opposed to \"put the leader in a blender\" games, but it's just mechanically too tight while at the same time too plodding to provide me with any interest.\n\nGame balance is not really there, and instead reliant on a local meta game forming to make sure every player gets at least one turn of being punted by everyone else. In my case the bird player won two games in a row simply because 2 other players were too busy rangling with their comparatively difficult factions.\n\nMany other annoyances: The rulebook is trying to be parsimonious to the point of being semi useless and as a result it felt like a certain faction shouldn't be able to do the thing that they did do. The rules are split into multiple books, which I really really hate, same shitty system that fantasy flight uses and it has exactly the same problems here.\n\nOther aspects that kept grating on me:\n\n1) Art is charming, but the board is therefore harder to read. Roads and rivers in particular can be confusing due to the size of each forest section and the clearings attached at the corners.\n\n2) Some of the factions are tedious to play, and there's not enough pizzazz when running them, particularly against some of the weirder factions. Woodland alliance is MIA for half the game and does very little. Vagabond could either be the best or most boring and none of it feels within your control. Cats start out as interesting, but diminish as the birds become a bigger threat, and it becomes a slow loss by attrition. River shylocks end up mostly playing a tedious mini game of who is the dumbest player, and lizard cult are a completely useless faction unless played by an expert.\n\n3) Cards are kind of all over the place. It feels similar to the upgrade mechanic in Chaos in the Old World, except rather than having a few meaningful and a few red herring upgrades, you have a whole deck of random bullshit. Some of which feels game-breaking, and some feels irrelevant. Why not have baked the cards into each faction? People loooove hand management, feels like a wasted effort on a mechanic that is bolted onto the side. Additionally, dominance cards can be a straight up ass-pull. One player just accidentally stumbled into victory - even though they should have lost - by just pulling a dominance card that was favourable to their already existent board position. Just Bizarre all around.",
    "timestamp": 1741129200
  },
  {
    "username": "vyolin",
    "rating": 3.0,
    "comment": "A finely crafted game that will feel very mean and random until you put in lots and lots of play time.",
    "timestamp": 1739660400
  },
  {
    "username": "AntonVatchenko",
    "rating": 3.0,
    "comment": "First evening we spent to understand the core rules. At the second we could play two base fractions with stopping and looking at rules. At the third we played almost confident with two fractions. Next evening we gave up.\nWhy? Why not to make clear rules? Maybe, some easy actions. In Citadels we had three games to understand 8 roles. Then suddenly switched to new 8 characters and understood their abilities during one game.\nIn Root you have useless combat system, game is imbalanced for two players, you need a lot of time to set up and then to pack it all at end.\nOne of the similar games is 7 Wonders, where you set up a lot and need to re-organize decks according to players count. But there you have simple rules that are clear after first game and you have a lot of abilities to win.",
    "timestamp": 1738796400
  },
  {
    "username": "generalpf2",
    "rating": 3.0,
    "comment": "No way I'm explaining a bunch of different factions every time I play this with a new group. I like how Eclipse does this: every board has a basic side that is the same for all boards, and a special side that isn't. But the game probably doesn't work that way.",
    "timestamp": 1736722800
  },
  {
    "username": "PepsiFizz",
    "rating": 3.0,
    "comment": "Perhaps this dislike can be blamed on the bad teaching of the game, but my experience playing this was miserable. Having different powers and actions from everyone else meant I could not watch what others were doing and take my clues on possible moves from them.",
    "timestamp": 1736636400
  },
  {
    "username": "repear",
    "rating": 3.0,
    "comment": "3 - Likely won't play again, but could be convinced.\n\nFirst, the good. The art and flavor of the game is superb. Each faction is intensely evocative.\n\nHere's what I dislike:\n\nROOT is the kind of game you need everyone in the group to play a lot in order for the game to not fall completely flat.\n\nThe asymmetry in ROOT will make the initial games multiplayer solitaire, which is exactly what the game tries not to do.\n\nEvery faction does something completely different, but none of those \"minigames\" would be worth playing on their own.\n\nThe \"stories\" in ROOT feel the opposite of emergent, and more as though the game is trying to lecture me. I am not opposed to game makers showing their world perspective through a game. But this case to me is one where the author did a lot of telling and not a lot of showing.\n\nWhen your group is proficient at the game, it becomes bash the leader, which isn't bad, but is IMO bad for a game this heavy. Why not just play the classics, like Cosmic Encounter, and get to the good part immediately?",
    "timestamp": 1736031600
  },
  {
    "username": "BoardGamingCouple",
    "rating": 3.0,
    "comment": "3/5\n\nSimply not a fan. too much going on at different times. very complicated to explain to other people. the theme and artwork are great. the components are nice, but very minimal as they should be. This did not need several kickstarters, they had enough money to make the expansions.",
    "timestamp": 1735254000
  },
  {
    "username": "ChrisBach",
    "rating": 3.0,
    "comment": "Only own the digital version which explains it well (as far as possible at least) and makes factions clear but at least for me I becomes so overwhelming once you have 3-4 thinking humans on the board since it's impossible to simply \"do your own thing\". It's required to cross other players plans and with this it becomes unejoyably difficult, at least for me. But also because I don't enjoy games where I don't really feel I understand what's going on. The idea of the game is super appealing to me but turns out I don't have the brains and patience for this.",
    "timestamp": 1733007600
  },
  {
    "username": "bored_gamer123",
    "rating": 3.0,
    "comment": "too asymmetric for my taste. every player needs to learn 4 different games",
    "timestamp": 1732921200
  },
  {
    "username": "JFed01",
    "rating": 3.0,
    "comment": "[digital] highly overrated",
    "timestamp": 1731279600
  },
  {
    "username": "Leonardo",
    "rating": 3.0,
    "comment": "Only played once but thats enough, didn't like the winning condition either",
    "timestamp": 1729029600
  },
  {
    "username": "Sann7bergen",
    "rating": 3.0,
    "comment": "Really didn't like my game as the cats. Once the balance changed to the other side there was nothing more to do than see the other players destroying what I build up and by that time I was too weak to change anything about it. Just looked at the clock for the game to be over...",
    "timestamp": 1726005600
  },
  {
    "username": "TheMaz",
    "rating": 3.0,
    "comment": "No.",
    "timestamp": 1721167200
  },
  {
    "username": "smurfodeth",
    "rating": 3.0,
    "comment": "More and more, I'm finding such heavy-handed, front-loaded asymmetry to be both tedious and restrictive.",
    "timestamp": 1718920800
  },
  {
    "username": "abdbla",
    "rating": 3.0,
    "comment": "in half of the games you know you've lost halfway through, which means another two hours of slogging to the end.",
    "timestamp": 1718488800
  },
  {
    "username": "Flatirons",
    "rating": 3.0,
    "comment": "Tyrell owns it.",
    "timestamp": 1718229600
  },
  {
    "username": "williamwonka",
    "rating": 3.0,
    "comment": "After 3 plays, I feel bad ranking this a 3, but the BGG definition for a 3 fits my feelings for this game (Bad - likely won’t play this again). I'm tempted to rate it a 2 (Very bad - won’t play ever again), because I will choose to skip game night if this is the game we're playing, but I suppose there is a remote chance my group could convince me to suffer through this again.",
    "timestamp": 1715983200
  },
  {
    "username": "EllenCaroline",
    "rating": 3.0,
    "comment": "I don't like asymmetrical games",
    "timestamp": 1715810400
  },
  {
    "username": "leumas88888",
    "rating": 3.0,
    "comment": "Only one play, so maybe I just don't get it. But is this game much more than the sum of its parts? It simultaneously requires adept knowledge of each faction in play, not just their mechanics but how they win, but is also so fickle that often strategic plans just fizzle out once it's back to your turn? As such it demands a level of knowledge about each faction to play best, but doesn't feel like it rewards you for doing so.... It also feels like it gives you the illusion of strategic choice, but often you don't get to do that much on your turn? And also a runaway leader that cannot be stopped makes the back 3rd of the game essentially administration as we collectively limp towards handing them the win.... Still though: +100 points for cuteness and also for length. Maybe it gets better next play.",
    "timestamp": 1715292000
  },
  {
    "username": "trodat123",
    "rating": 3.0,
    "comment": "brilliant design but didn't get a good game out of it. Guess you would have to play always with the exact same players to really grow into and I'm not willing to do that since I wasn't keen on my first play\n\nKickstarter miss for me",
    "timestamp": 1714428000
  },
  {
    "username": "Mpls79",
    "rating": 3.0,
    "comment": "Digital",
    "timestamp": 1714341600
  },
  {
    "username": "adamsinger109",
    "rating": 3.0,
    "comment": "Same issue I had with Vast: Crystal Caverns. The game is fine, and probably shines with a consistent player group and repeated plays. But tribes basically have a rock paper scissors mechanism where one player can basically king make another if they don't play there character optimally.",
    "timestamp": 1713823200
  },
  {
    "username": "ivan_diaz",
    "rating": 3.0,
    "comment": "The game is beautiful. Tee problem is that is too complicated, every faction has to be learned, the first time they explained it to me I hardly understood what I was supposed to do, I had no idea what others were doing. It's like learning 5 games in one. I bough it and sold it.",
    "timestamp": 1713218400
  },
  {
    "username": "purplecow55",
    "rating": 3.0,
    "comment": "An unique gameplay for each player that suffers greatly with too long of a teach.",
    "timestamp": 1712872800
  },
  {
    "username": "codyscott",
    "rating": 3.0,
    "comment": "i downloaded the mobile version of the game. I guess I'm not a huge fan of mega asymmetry, because it just felt like every player is playing a completely different game. I could never keep straight how each character plays, much less how they are supposed to interact with each other on an intuitive level. not for me.",
    "timestamp": 1710802800
  },
  {
    "username": "Komissar13",
    "rating": 3.0,
    "comment": "Rules are not so clear.\n\nYou are moving without spending an\nThe power at battles using the dice ? depends of your soldier, meaning that even if you score the highest number you cannot score it, unless you have so many soldiers (highest 3) the same happens even if you have more than 3 soldiers, again you will score 3 .\nThe defending players at the battle will need to take out the building that THEY will choose but first needs to took off all the soldiers.\n\nThe rules and the mechanisms of this game is not for me.",
    "timestamp": 1710802800
  },
  {
    "username": "Kbjordan",
    "rating": 3.0,
    "comment": "Not my kind of game.",
    "timestamp": 1706655600
  },
  {
    "username": "KiviK",
    "rating": 3.0,
    "comment": "To win at it, just be the nice guy with no plan. Same as winning at most reality shows.",
    "timestamp": 1705618800
  },
  {
    "username": "asketes",
    "rating": 3.0,
    "comment": "Not for me.",
    "timestamp": 1699484400
  },
  {
    "username": "Erhoads",
    "rating": 4.0,
    "comment": "Two player this game, due to its insane asymmetry, sucks. Depending on what you are playing and who you are playing against it can be impossible to win. Don't play 2 player.\n\nHave on Steam.",
    "timestamp": 1757887200
  },
  {
    "username": "latschediwes",
    "rating": 4.0,
    "comment": "I played two learning games of Root. The game looked like an area‑control war game set in a charming woodland world, but once I started playing, it felt very different. Each faction has its own unique rules and interlocking mechanisms, so in practice every player is solving their own little optimization puzzle. There is some interaction on the board, taking control of clearings, removing enemy pieces, but beyond that, everyone seems to be playing their own private game.\n\nIt's focused on point optimization and engine‑building, separates players by design and is needlessly complicated. I’ve seen this in other games, and while I can understand why it appeals to some persons, it leaves me cold.\n\nThe artwork is beautiful, the components well‑designed, and the production quality is excellent. But underneath that aesthetic charm, Root is not the wargame it appears to be. It's is an needlessly complicated, solitaire eurogame wearing a thematic disguise, or, more precisely, it's four different eurogames in one box.\n\nI suspect it rewards repeated play and deep learning. But I personally have no desire to invest the time to master each faction’s intricate rules when there are other games that offer me more immediate joy.",
    "timestamp": 1755208800
  },
  {
    "username": "g4bor",
    "rating": 4.0,
    "comment": "If multiplayer asymmetry still needs the right connection points to work, then it's not properly realised here, especially with strategies being so hard-coded. Furthermore, if you leave it entirely up to the players to balance a game, it's not a good idea to overload them with indirect rules, all of which they must learn and understand to be able to do so. Funny dice and the 'yeah, okay' cardplay are just icing on the cake.",
    "timestamp": 1751493600
  },
  {
    "username": "Dlearn",
    "rating": 4.0,
    "comment": "After playing it 5 times. I still forget fundamental rules about this game.",
    "timestamp": 1751493600
  },
  {
    "username": "Hinmatt",
    "rating": 4.0,
    "comment": "Every faction you can choose has unique possible actions they can take and different winning conditions from the other factions.\nThis makes the game very hard to understand because you have to remember the unique actions and winning condition of all factions at the table to make smart moves on the board.\nIt is a quite long area control game. And it can feel very chaotic because of the completely different way everyone has to play around the table.\nI think this game needs a dedicated game group who is willing to play it several times to understand how to play well within this unique concept.\nI don't like the game enough to try it several times. The concept is unique, but just no fun at all for me.",
    "timestamp": 1750543200
  },
  {
    "username": "jakoozzi",
    "rating": 3.8,
    "comment": "On Steam\nDidn't enjoy it on my first play, don't feel like I'm eager to try learning the whole thing.",
    "timestamp": 1749938400
  },
  {
    "username": "ZigZagPunch",
    "rating": 4.0,
    "comment": "A ridiculously clunky, hard to teach, over-complicated game where no matter what factions are in play, everyone feels stunted and trapped.\n\n80% of Root is realizing there's nothing effective you can do on your turn and then begrudgingly doing all the same things you did last turn because there's just no other option.",
    "timestamp": 1749333600
  },
  {
    "username": "PocketPete4602",
    "rating": 4.0,
    "comment": "it's a game which I always have felt like the next time we play will be good",
    "timestamp": 1749074400
  },
  {
    "username": "Third_Era",
    "rating": 4.0,
    "comment": "",
    "timestamp": 1748901600
  },
  {
    "username": "Zyrdalfs",
    "rating": 4.0,
    "comment": "I tried but just wasn't fun. I played 3 player because I don't have 4 people. And after the first game one of them refused to play it again. And the two player mode... isn't a game. Maybe I will try to play it with the recommended 4 some day. Waste of money, only get if you know this type of game works for your group and you have 4 people. I will try to play it again because I want it to be good.",
    "timestamp": 1748815200
  },
  {
    "username": "TertiaVigilia",
    "rating": 4.0,
    "comment": "The theme is nice, the game is hard to learn/teach and easy to play. It should be the other way around, it should be easy to learn but hard to master. Something went wrong with Root here...",
    "timestamp": 1747519200
  },
  {
    "username": "Sorlag_XI",
    "rating": 4.0,
    "comment": "EUROSTRAT",
    "timestamp": 1747087200
  },
  {
    "username": "BigDave76",
    "rating": 4.0,
    "comment": "An asymmetric game that promises great depth, and that can be had, but you must nearly re-learn the game for every faction that is brought to the table. The rules are overly time consuming for a game that can come down to a few bad dice rolls.",
    "timestamp": 1747000800
  },
  {
    "username": "Woody40",
    "rating": 4.0,
    "comment": "Not really a good game for me.",
    "timestamp": 1747000800
  },
  {
    "username": "MaxJohansen",
    "rating": 4.0,
    "comment": "Having a hard time getting into this",
    "timestamp": 1747000800
  },
  {
    "username": "NeutralGood",
    "rating": 3.5,
    "comment": "I’ve played this twice, once with four and most recently with three.\nPros:\n- Having everyone play different systems is interesting, and I think most people will find a play style that aligns with one of the factions\n- the art is really good\nCons:\nI only have 1 con but it’s a big one. There are big structural problems that make Root unsatisfying and leaves everyone disappointed.\nEvery faction has exponential growth potential.\nThis creates two outcomes, either there’s one leader who shoots ahead & is going to win; or everyone gangs up on anyone who is about to get too out of reach. If everyone is smart, and paying attention, the game plays out like the latter. So this cycle is created where one player gets too ahead, everyone focuses one them, and then the field is leveled. The arbitrary victory point condition then leaves people unsatisfied, because the winner is just whomever is lucky enough to pop off last, before the playing field can be leveled.\nIf there was a more narratively satisfying win condition, I feel like this game would be saved. Because right now the game just ends, and the lucky guy at the top in that moment is deemed the winner. But all the players know, if it continued that the ‘winner’ would be knocked off the top and everyone would be level pegging again.",
    "timestamp": 1742943600
  },
  {
    "username": "secondofthenew",
    "rating": 4.0,
    "comment": "First edition, first printing. Card deck and components have seen lots of regular wear.",
    "timestamp": 1740783600
  },
  {
    "username": "SebWilder",
    "rating": 3.5,
    "comment": "Played Steam version only",
    "timestamp": 1740438000
  },
  {
    "username": "mikesanerd",
    "rating": 4.2,
    "comment": "It was ok, I guess. I don't super get the appeal of this game. Seems like a pretty basic game to me that is balanced by Munchkin-style gang-up-on-the-leader mechanics until everyone gets exhausted and someone lurches over the finish line. I really didn't have a great time playing it, and I won. In fact, I don't think a single person had a good time when I played this.",
    "timestamp": 1740351600
  },
  {
    "username": "Ridicule",
    "rating": 4.0,
    "comment": "Decide the fate of the forest as woodland factions fight for contrasting goals.\n\nType: Strategy, Wargames, Area Control, Hand Management, Variable Player Powers",
    "timestamp": 1738969200
  },
  {
    "username": "ryanespin",
    "rating": 4.2,
    "comment": "KS",
    "timestamp": 1738450800
  },
  {
    "username": "RalfMalf",
    "rating": 4.0,
    "comment": "I've played this twice, and didn't enjoy it on either occasion. Too much randomness because nobody knew what anyone else was doing. I'd rather play a game that is enjoyable.",
    "timestamp": 1736550000
  },
  {
    "username": "Desiderata",
    "rating": 4.0,
    "comment": "Just not very interesting gameplay. Very dry for a game that claims to be thematic. All items are merely worth VPs, for example. No distinction between a sword or a pair of boots, other than maybe one is worth an extra VP. I can see it being a shorter, easier alternative to other asymmetric, multi-player games such as the COIN games, but I am not a huge fan of those anyway. Although I do appreciate the historical themes of those at least.",
    "timestamp": 1735599600
  },
  {
    "username": "tscox87",
    "rating": 4.0,
    "comment": "See Shut Up and Sit Down's excellent and accurate review. The game is absorbing because of the novelty and discovery of trying to understand the asymmetric factions. But the public scoring and gang up on the leader are hugely problematic and the game ends with someone somehow having a huge point turn from out of nowhere that no one could do anything about. So the end of the game is incredibly unsatisfying.\n\nI wonder how this would rate if it didn't have cute are and meeples. My guess is not very high.\n\nUPDATE: 4 plays. Not for me.",
    "timestamp": 1735254000
  },
  {
    "username": "iareblunt",
    "rating": 4.0,
    "comment": "I started out playing against CPU players on the iPhone app and found the game incredibly boring and anticlimactic, but chalked that up to not playing with actual humans. Just played an in-person 4-player game tonight, and what a SLOG. Nearly 3 hours of gameplay; 2 1/2 of which were spent trying to tell other people what moves they should be making rather than figuring out what I should be doing with my moves. We were thoroughly exhausted once someone finally won.\n\nUPDATE: 2nd playthrough with the same group. Going on hour 3 now. Same story as the first game. This one’s definitely not for me.",
    "timestamp": 1731279600
  },
  {
    "username": "MrNobody012",
    "rating": 4.0,
    "comment": "good game probably, not for me though",
    "timestamp": 1725746400
  },
  {
    "username": "sykano",
    "rating": 4.0,
    "comment": "very asymmetric strategy game\noverrated, has severe problems\nIt looks like a good design, but plays rather badly (and not because of asymmetry and rules complexity). The very restricted options during gameplay and the arbitrary 30 points end condition completely kill the game for me.\n\n\neach faction has completely different rules\nsome cool mechanics (..., Vagabond items, ...)\nvicious theme but with animals depicted like in a children's book\nessentially a war game\nnice components and cute artworks\ncool idea\nBUT the game is neither enjoyable nor that much replayable (!!)\n\nFrom what I've seen, there are not much different directions to take for each faction. The mechanics dictate pretty much one way to go. Games develop similarly every time except for what cards players get and some dice rolling.\nThe Vagabond has no real challenges, he's more something like a clock. He wins when the other players are too slow. At least most of the time it's like that.\n\nBiggest problem is that the first player who has 30 points wins. This arbitrary limit makes the game super random and unenjoyable. Not even equal number of turns are played when the 30 points limit is triggered, although it could be easily done. Awful!\n\nThere can also be pseudo player elimination, when one faction is crushed early and has no chance to get back into the game.\n\nThe faction guides are good. But the faction rules are like a straight jacket.\n\nvery expensive\nand you also want the numerous expansions\n\nThis game really needs a rules variant to fix the gameplay experience!\n\nYes, the materials are nice, especially the pieces.",
    "timestamp": 1724796000
  },
  {
    "username": "mortoray",
    "rating": 4.0,
    "comment": "The rules are overly complex and the asymmetry makes it quite hard to know what to do, or whether it will have any effect it all. It's too much to track, to determine who might be winning or how you can stop them. Some roles seem to be playing games on their own, without real interaction.",
    "timestamp": 1724536800
  },
  {
    "username": "Fecundaloon",
    "rating": 3.5,
    "comment": "Root...if it is a modern euro, then it is kind of better than the lot of them. One the other hand, if it is a wargame, then it leaves me a lot of questions. Why does everyone have the same goal? Why is the formula to achieve the goal a slight variation of the motif? Why no hit and run tactics? Why not more secrets? Why not more asymmetry in information? Why not more imperfect information? Why not more financing and re-supply issues and an inter-dependency that could arise between factions? Why not more war-profiteering? Why not more trading?\n\nThe faction boards are text heavy, but similar enough across factions to make the others quick to pick up; albeit, the faction boards are not exhaustive in that there is faction specific rules not present on the boards (that is instead elsewhere).\n\nRoot has some incongruence between the engine of a faction and the shared space amongst your fellow players. The two are often connected: your engine depends in part on your board state, but rather than have juxtaposition of two parts pulling in opposite directions---a solitary direction, and the other towards intuiting or deducing player psychology---I would want it forged removing the former impurities; inasmuch as, developed into a thematic harmonious whole. Such a whole could be more social and better engrave a story in the ole noggin.\n\nThe card play can: feed into your engine, crafted items (points, one time or continuous abilities), ambush cards, dominance cards, and whatnot. I wish the card play was more risky and centered more over the other people you played with.\n\nIf I were to play this week after week after week after....I may be able to overlook these wrinkles.",
    "timestamp": 1724536800
  },
  {
    "username": "Apaws",
    "rating": 4.0,
    "comment": "want to try again, just wasn’t loving it",
    "timestamp": 1723500000
  },
  {
    "username": "brownsound",
    "rating": 3.5,
    "comment": "Root jest grą z wieloma problemami. Przede wszystkim jest to kolos z monstrualną wręcz liczbą zasad do kontrolowania podczas gry. Asymetria jest tutaj posunięta tak daleko, że każdy gracz nie tylko ma cele różne od pozostałych, ale gra wręcz w nieco inny tytuł. Root wymaga dużego zaangażowania i chęci poznania go, a sens tej produkcji leży tak naprawdę w \"grze nad stołem\" i \"biciu najsilniejszego\", przy jednoczesnym dążeniu do... stania się tym najsilniejszym, a więc następnym w kolejce do bicia; przy czym każda z \"frakcji\" ma bardzo ograniczone możliwości reagowania na to, co dzieje się na planszy. Nie widzę miejsca na Roota w swojej kolekcji. Gra solo odziera ten tytuł z jego największej zalety; znalezienie grupy, która chciałaby z kolei regularnie grać \"tylko w to\" jest wręcz niemożliwe. Cukierkowy layout dodatkowo utrudnia to zadanie; Root jest mało seksowny w porównaniu z pozycjami, do których przyklejono atrakcyjniejszą tematykę. Nie rozumiem tak wysokiej pozycji tej gry na BGG.",
    "timestamp": 1720303200
  },
  {
    "username": "Peripeteiannnna",
    "rating": 4.0,
    "comment": "I feel like every time I play Root I'm left with my face in my hands, contemplating why I keep doing this to myself. It's like a toxic relationship I keep coming back to. In this case, it really is me, not the game that's the problem. I can tell there's gears and cogs that all interplay, I just can't get them to interlock and actually work together. I'm always left with an engine that spits oil and hot steam at me while it falls apart, no matter which faction I play.",
    "timestamp": 1719439200
  },
  {
    "username": "tmoiynmwg",
    "rating": 4.0,
    "comment": "I have really mixed feelings about this one. It's really cool and feels really dumb at the same time.",
    "timestamp": 1716242400
  },
  {
    "username": "GeorgW",
    "rating": 4.0,
    "comment": "It's an impressive design, but I'm never going to like a complex multiplayer war game like this. They've done a good job hiding the war game with a cute yet dark theme, but it's there.\n\nPros:\nThe production, art, and graphic design are all amazing! I can definitely see this appealing to a lot of people purely on visuals and I wonder how popular this would have been without the gimmicks of asymmetry and cute art.\n\nI also really like the domination cards, because it keeps all players in the game and the end game tense.\n\nThe asymmetry is well done, it's thematic, very varied, and unlike its predecessor Vast it keeps the general structure and some rules common for all players.\n\nConceptually I really like how the asymmetry is implemented in the broader war game schema. If players want to play together but have different predilections for punching each other in the face, there's options for more peaceful, defensive, mercantile, or sneaky factions to complement the more warlike ones (some available as on-release expansions as a brilliant marketing move)!\n\nCons:\nThat said, I still dislike this type of asymmetric design. It creates an additional barrier to interact with other players when we all interface with the game in different ways. I also think the solution for people that wouldn't normally like this style of game is to play something else rather than trying to design for everyone within a single game.\n\nThis barrier problem is especially egregious in this design, it's extremely onerous to keep track of what other players can do or how to stop them. Most of my games of this have ended with someone pulling out a 7-15 point combo that no-one saw coming because we were too busy parsing our own game state to realize how close someone else was to win!\n\nI don't like the randomness. The dice are frustrating and most factions draw too few cards to mitigate luck of the draw, especially if cards are important for your race.\n\nIt's really long and very complex, it's the sort of game that will only really reveal itself and be fun after a handful of games, and those early games will likely take 4+ hours!\n\nRoot has all the standard issues of kingmaking and sandbagging that multiplayer interactive games have, but the fact that everyone is playing a different game heightens this feeling of unfair competition because it can be truly difficult to say who you should be attacking, or if you should even be attacking at all, at any given point in time.",
    "timestamp": 1714687200
  },
  {
    "username": "gatchaman",
    "rating": 4.0,
    "comment": "I realized my absolute least favorite part of the game, and it's anything to do with the clearing types and the suits on the cards. You've got completely arbitrary clearing types, which have to match up with suits on the random cards you draw, so all it achieves is a random arbitrary limitation on what you can do with your turn. Why do we need this extra limitation?\nAnd on top of that, it's done in a really confusing way because the clearing types are animals but have nothing to do with the animal races you're controlling! Bird cards are wild for some reason...but that has nothing to do with the bird races...rabbits and foxes are just different animals...it's so frustrating.\n--------------\nPicked this up on the iPad to give it another try, and its complexity is just so frustrating. With each faction having completely different rules, with almost no overlap, it's so hard to even learn to play the game.\n--------------\nTaking a quote from a comment by _The_Inquiry_, it feels like Root 'is more about learning \"how to play the game\" rather than actually \"playing the game\"'. Knowing how your faction plays is one thing, but the real point of the game is in assessing the progression and momentum of the other factions. And that doesn't seem that enjoyable, and requires a lot more plays than I'm ever going to give.\n\nI was introduced to Root as \"Wehrle's take on a COIN game\" which I think turned out poorly for Root. I would have been better off just playing it as its own game. Because when I thought about it that way, then they took out all of my favorite parts about COIN games. First, the event deck - I love managing the actions and events and priority of the event deck. Secondly, the historical setting - having a historical setting gives me something to sink my teeth into and learn about, instead of just arbitrary animals. And lastly, no real solo mode -- where the COIN games are often even better solo, as far as I could tell in Root the solo mode was kind of half-baked and didn't let you play all the factions.",
    "timestamp": 1713823200
  },
  {
    "username": "iplaybgnaked",
    "rating": 4.0,
    "comment": "A unique and fun war game disappointingly let down by the scoring system cheapening the gameplay decisions. The CDG-like card play mixed with the various faction specific minigames is engaging and entertaining as the different euro engines colliding on the map is interesting to see play out, though I do question if there is more robust depth to each faction's toolkit or if after a certain point the game is entirely table talk politics due to there being optimal sequences of moves for each faction that's resilient to both card draw and other player. Unfortunately the game being a straight forward victory point race promotes the heads down play of min maxing your faction specific point engine which forces the player interaction to only be done out of convenience in the early to mid game (ie you only bother to smack another player that's entered one of your clearings or is in a nearby clearing you're expanding to) or be done to bash the leader in the late game (ie X player's VP engine scores enough to win in Y turns therefore I must hit them to slow it down to have a chance to come back or more likely for someone else to come in and win because our attention was divided) which narrows the decision space to lame options.",
    "timestamp": 1711753200
  },
  {
    "username": "ThroughTheDeckGlass",
    "rating": 4.0,
    "comment": "3 rule books! Never did find basic info about what is on cards Maybe it was a bad rules teach, as the other 2 struggled to point to the right place in the rules. No one figured out how crafting worked. Hard to start. Rules questions multiple times. NOT beginner friendly!\n\nBasics of game play NOT helped by highly asymmetric player powers.",
    "timestamp": 1711580400
  },
  {
    "username": "JasonSaastad",
    "rating": 4.0,
    "comment": "aesthetically adorable\n intrinsically interactive\n emergent experience\n\n communal cards \n dramatic dice \n pedagogically problematic \n\nRoot > COIN\n\nHaving to teach each player a different mini-game to play the communal game on top of my tactics being narrowed via input-variable card draws I had no pre-game control over, and combat choices determined by output-variable dice rolls is more frustrating than fun for me. I need more creative agency.",
    "timestamp": 1710802800
  },
  {
    "username": "Kottman",
    "rating": 4.0,
    "comment": "This is probably my most controversial take in board gaming. I do not like this game. Maybe I will give it another try at some point but I doubt it.",
    "timestamp": 1705532400
  },
  {
    "username": "Snake86",
    "rating": 4.0,
    "comment": "This was complicated. Its hard to understand all the mechanics, and you need to know all factions to be able to understand what might happen in one round. In an instance all you troops can be destroyed because you did not know what you opponent might do as a NORMAL turn.",
    "timestamp": 1704409200
  },
  {
    "username": "hiimjosh",
    "rating": 4.0,
    "comment": "Root isn't a bad game - far from it - but I have trouble finding much here that I liked which games like Chaos in the Old World didn't do in a much better way. Root's catch is that it is mechanically asymmetrical at it's core while CitOW is only asymmetrical in stats and abilities (keeping the core rules mostly the same across factions). Playing Root made me realize that I prefer the latter. The initial learning curve, teach, and investment required in Root are very high and at the peak of anything I want from a multiplayer game. Root is a highly mechanical game with a lot of puzzly elements. I played the Woodland Alliance in my game, and I felt like I was staring at my board and trying to wrestle with my own mechanics more than I was staring at the rest of the board. Root still does keep the rest of the board engaging, but ultimately I felt like I was playing an engine builder with the ability to easily and temporarily stamp out other peoples' engines. I don't like that dynamic of \"stamp out, rebuild, stamp out, rebuild\" and much prefer the \"wrestle until someone spirals out of control\" which I felt like Root was lacking. Downtime was also a bit much for this kind of game, though I could see that getting much better with another play\n\nNow for some things I liked. The cards are super simple and work well. They can be used for tableau building or taking actions. The asymmetry is very, very strong. Combat is simplistic but very effective. There are interesting implications around movement restrictions. All of the factions seem tight and are well-designed with their own puzzles\n\nAll that said, though I enjoyed my play of Root and would like to play it some more, I just never want to teach it again. It will never be a game I pick up for myself. I've yet to find my desert island dudes on a map game, but it is somewhere in between CitOw, Blood Rage, and Root\n\nEDIT: I've played Root a little less than 10 times now. I liked Root while the factions were still a mystery, but it quickly became a game of repeatedly stomping each other's anthills which I found unengaging. At least in Chaos in the Old World you are getting beaten down by an unstoppable force which you can try to kite",
    "timestamp": 1704409200
  },
  {
    "username": "Geeken",
    "rating": 4.4,
    "comment": "Feel like a mix of Vast + Cry Havoc",
    "timestamp": 1702594800
  },
  {
    "username": "uduhno",
    "rating": 4.0,
    "comment": "Game was not fun, too hard to balance around multiplayer game. If people focus you there is no winning.",
    "timestamp": 1701817200
  },
  {
    "username": "MartynF",
    "rating": 4.0,
    "comment": "I really like the asymmetry in the game.\n\nOnly played two times, but the turns felt very repetitive. Without much change in game play. It also starts very slow.\n\nWhen all play in the right way, the game ebbs and flows like many other battle games. And that is not really my type of game.",
    "timestamp": 1700521200
  },
  {
    "username": "yroeht",
    "rating": 4.0,
    "comment": "The entry barrier of such widely asymmetrical games is too high: you need to learn four games in one to understand what is going on and not play solitaire, and even then at its core it's a dudes on a map game and I don't like those.",
    "timestamp": 1700434800
  },
  {
    "username": "NLDkossy",
    "rating": 4.0,
    "comment": "The rules are difficult to understand so mistakes are common. But once you get the rules you get excited and at first it gets better. But then it gets worse. The game is well balanced even though every player uses different roles. This is a great technical accomplishment. The main problem is that once you get a hold of the mechanics the game feels very... Mechanical. You try to optimize your game, and disrupt the other players game. Because everyone eventually gains points someone wins by reaching 30 point. But it kind of feel random who wins and heavily depends on how much you were obstructed and how much luck you had. The dice rolling in a battle, kind of like Risk, get's tiring.",
    "timestamp": 1699225200
  },
  {
    "username": "chadmoores1988",
    "rating": 4.0,
    "comment": "I fins it very overwhelming, and hard to grasp when trying a new character. I have played this game a handful of times and still don't fully understand it. I will keep trying when asked to play as i want to love this game as much as most others do.",
    "timestamp": 1698793200
  },
  {
    "username": "koflo1",
    "rating": 4.0,
    "comment": "1-6 (4)\nohne Exp. 2-4",
    "timestamp": 1695938400
  },
  {
    "username": "Apolloontje",
    "rating": 5.0,
    "comment": "Not for me.",
    "timestamp": 1762038000
  },
  {
    "username": "Maftiosi",
    "rating": 5.0,
    "comment": "2-6",
    "timestamp": 1761865200
  },
  {
    "username": "SpeedyAkron",
    "rating": 5.0,
    "comment": "After playing 10-15 games (all on steam single player), no desire to play more. Game just isn't that exciting. Tends to be very hard to catch up when you get behind. Might be better with the social aspect of playing with other people.",
    "timestamp": 1760047200
  },
  {
    "username": "ImZhe",
    "rating": 5.0,
    "comment": "The asymmetric factions are very interesting but it's not my style of game overall. Optimizing your turns feels pointless because other people can gang up on the leader if you get too far ahead. The suit play wasn't super interesting for me either, and although the factions are asymmetric it didn't feel super interesting to play them.",
    "timestamp": 1759960800
  },
  {
    "username": "Eniven",
    "rating": 5.0,
    "comment": "Root sounds like a game that I should love, but the two games of it that I have played thus far really hasn't done much for me. I'm not sure if it is simply because of the group I have been playing with, or if I just didn't quite grasp the rules the first couple times. I'm definitely hoping to give Root another try.",
    "timestamp": 1759183200
  },
  {
    "username": "5ro4",
    "rating": 5.0,
    "comment": "Very high complexity for a disappointing payoff.\n\nLearning to play the game is a pain because you need to know at least 4 factions, but then I didn't feel like any of the factions had that much depth; you are often pretty limited on what you can do.\n\nIt also requires all players to work together on stopping whoever is doing better, or some factions can quickly become unstoppable. It didn't feel like it's up to you to win.",
    "timestamp": 1757455200
  },
  {
    "username": "Destrio",
    "rating": 5.0,
    "comment": "Ultimately had to move this bundle of games unopened as I'd rather play other people's copies and if I were to choose a game I'd choose something like Chaos in the Old World or John Company second edition instead.\n\nAfter several games, this one seems a bit overhyped in terms of fun factor and teach. There are definitely more complex games that take about as long to teach and have a more compelling design space. That being said, the game isn't bad at all. The faction strategies do feel a bit on rails, but perhaps after getting more experience, I'll feel differently.",
    "timestamp": 1757109600
  },
  {
    "username": "Pillow_fluph",
    "rating": 5.0,
    "comment": "SOLD - When a game just isn't for me, I give it a 5. I don't think its a bad game, just not for me.",
    "timestamp": 1755986400
  },
  {
    "username": "jellyfishjoe",
    "rating": 5.0,
    "comment": "There's clearly a lot of thought put into the design and I can see how the game would thrive at high level play, but I don't enjoy it enough to overcome the 3-5 learning games required to understand the game.",
    "timestamp": 1755554400
  },
  {
    "username": "tech7",
    "rating": 5.0,
    "comment": "Purely objectively there is a well designed game there, but it just isn't fun ( for me) and all players have to have a good understanding of all factions.",
    "timestamp": 1755208800
  },
  {
    "username": "Algon610",
    "rating": 4.5,
    "comment": "Only played once. Teach wasn't the best",
    "timestamp": 1754344800
  },
  {
    "username": "JAC578",
    "rating": 5.0,
    "comment": "Digital Version - interesting asymmetric gameplay, but not a fan of wargames in general, personally dislike dice rolls determining combat",
    "timestamp": 1753135200
  },
  {
    "username": "GrimThunderbrew",
    "rating": 5.0,
    "comment": "Least favorite of the popular games\n\nUpdate: Played a couple more times. meh.\n\nCool, but not sure about the vagabond not interacting with the alliance main ability that I was playing on the first game.",
    "timestamp": 1752876000
  },
  {
    "username": "elricwulfgar",
    "rating": 5.0,
    "comment": "Played at SXSW with game designer and company owner. I found it to be mediocre. Was going to back the expansion Kickstarter, but decided to drop it. I recommend playing it before buying it.",
    "timestamp": 1752444000
  },
  {
    "username": "marriedcouple",
    "rating": 5.0,
    "comment": "It's a bit complicated for what it should be. Dunno. Sometimes it's ok, sometimes, it's not.",
    "timestamp": 1751752800
  },
  {
    "username": "theTeaPack",
    "rating": 5.0,
    "comment": "I would like to like this game. It sound like something really for me - I like games with asymmetry and interactions. Yet this one has 1 big problem which arise from the abovementioned things. And that is that to be good in this game you need to know how to play your clan and how to play every other clan on board. It sounds really good that they are so different but to play ok-ish against your opponent you need to have the feel about what their clan is doing, which means that you had to play as their clan at least once. So in 4 players game you need to know how you play the game as those 4 clans. This necessary investment in the game might give you a really great game experience, but personally I would rather learn how to play 4 different games than how to play 1 game 4 different ways.",
    "timestamp": 1750888800
  },
  {
    "username": "sirensong1986",
    "rating": 5.0,
    "comment": "I know this one is highly rated but i just... cant. We've tried a few times but need to play with someone who can show us how its done maybe? Just seems unbalanced and overly complicated I guess? Hard to explain",
    "timestamp": 1750802400
  },
  {
    "username": "S3nd0h",
    "rating": 5.0,
    "comment": "Not for me, the asymmetry broke the game with everyone playing a different game...",
    "timestamp": 1750543200
  },
  {
    "username": "Kroomiester",
    "rating": 5.0,
    "comment": "Played recently after not playing for over a year. I have no desire to return to Root again. Similarly to MTG, I find that once I remove the rose tinted glasses of someone who dedicated himself to playing a game for years, it is just a frustrating experience that often favors a loud-mouthed politician over pure tactical skill.\nThere was no doubt when I was playing root regularly that the game was very political, but at that time I bought into Cole Wehrle's mantra that politics and king making are good. I do believe that as he says, they make good stories, but don't often make satisfying games.\nRoot is rarely satisfying for all players.",
    "timestamp": 1749765600
  },
  {
    "username": "Takhyon",
    "rating": 5.0,
    "comment": "Sigh. I saw someone describe Root as a \"brilliant design that is not fun to play\", and that pretty much perfectly captures my thoughts about it as well. I can't deny that it is a very clever design with some cool mechanisms (the one highlight of the package being the action programming with the bird faction) and a beautiful production, but the gameplay just doesn't bring me any joy. The complete clown show -levels of asymmetry combined with so many countless \"gotcha\"-cards and player-dependant balancing via leader-bashing makes this an infinitely frustrating gameplay experience for me.\n\nThe amount of asymmetry is actually isolating and distracts from the interaction, and makes the experience very clunky with the constant rules nuances and clarifications. I also just don't think the rules overhead, the finickiness, or the teach are worth the effort for what you get out of it. It's really only for players who either enjoy the initial discovery of figuring out how to play the different races and how they interact, or a lifestyle game for a group that always consists of the same four players who enjoy really deep-diving into one game and playing that over and over again.",
    "timestamp": 1749247200
  },
  {
    "username": "fuipig",
    "rating": 5.0,
    "comment": "A bit of a meh for me. It is not my game where everybody is playing by different rules.",
    "timestamp": 1748901600
  },
  {
    "username": "graybeard76",
    "rating": 5.0,
    "comment": "Not really my type of game. Had to refer to the BGG forum many times to figure out the rules. Started getting into it mid way through, but unsatisfying in the end.",
    "timestamp": 1748901600
  },
  {
    "username": "Lagged0203",
    "rating": 5.0,
    "comment": "5 stars because the online game makes things better, I would personally not invest in the physical game.\n\nReason I won't invest in the physical game is because getting to enjoying this game is a HEAVY investment. I think this reddit comment summarizes this well:\n\n\"That said, I’d venture that Root works best for someone that can reliably get the same group of people (ideally 4) together who are open to repeat plays, that are okay with a significant rule set, enjoy heavy player interaction, “take that” mechanics and ganging up on the leader. A group that also enjoys player negotiation and understanding how current board states effect your opponents that operate under an entirely separate system of rules and values. Aside from that, the production quality is excellent.\"\n\nGetting together a group like this, while possible, is I think understandably a LOT to ask for the weekly game night. If you have kids or a busy schedule and just want a casual fun game to play on a weekend, this is not for you.\n\nI think the online game is better because you can find matches of 4 easily with experienced players, set up time is zero, etc.",
    "timestamp": 1748210400
  },
  {
    "username": "Ghost CoD",
    "rating": 5.0,
    "comment": "Any strategy devised for this game is 90% pointless, as in the end you need to persuade the opponents to attack the other players instead of you, so it degenerates in obscene kingmaking and a social game of diplomacy. So, at that point, why not play a social, party game in the first place? If this game had a less cute artwork, nobody would be speaking about it.",
    "timestamp": 1746741600
  },
  {
    "username": "Jertlemiah",
    "rating": 5.0,
    "comment": "Root itself is an okay asymmetric war game, but I don't think it would be so highly rated without the cute woodland creature art or the thrill of learning how to play a new faction since each is literally ENTIRELY different from each other, so it's often like you're playing a whole new game each time.\nOnce you've tried all the factions, the joy of the game really wears off and beneath it all is a war game which I've never been a big fan of to begin with.",
    "timestamp": 1746396000
  },
  {
    "username": "brw12",
    "rating": 5.0,
    "comment": "4 plays\n\nNot as difficult to learn as it at first seems, in part because the various explainers do such a poor job of introducing the game's common elements, which are pretty straightforward.\n\nThe complexity comes in all the different rules each faction follows, which make it hard to strategize to beat other factions if you're not already familiar with them. Each faction's balance of complexity and depth tip too far towards complexity; there always seem to be extra provisions on an opponent's current cards that you didn't take into account in your turn, and even for your own turn, it's too easy to overlook some element. When people keep saying 'oops, I forgot, I take one less hit because my current Mood is Stubborn\" or whatever, it's the game design smelling suspicious.\n\nAlong these same lines, the game chooses to balance everything out using various rates of victory point scoring, instead of more concrete and palpable win conditions. This scoring creates endgame scenarios where the stakes of decisions feel low, and wins seem non-thematic. Building buildings and knocking them down shouldn't be a net gain -- it should matter because of the power those buildings have to fuel a player's engine.\n\nIt's worth specifically comparing Root to Small World, which share the same rough level of board complexity and have asymmetric powers. But the faction-specific rules in Small World are simple enough that opponents understand them completely right away, and turns only need a fraction of the analysis. There isn't as much depth, of course, and I appreciate that you can learn to play a Root faction better over time. But I think the overall trade-offs make me want to replay Small World more; the focused factional differences and their thematic clarity greatly add to the satisfaction of a turn well played, and better telegraph the story of who is winning and why.\n\nIt's a shame that the various factions here weren't worked into more satisfying form. The \"Woodland Alliance\", for example, is a grassroots revolutionary movement that foments rebellion that can overthrow local rule in various forest clearings. Sounds neat! Well, no, the rebellions don't really work in a way that has thematic meaning; they're just another arbitrary chit.\n\nSo I don't think Root is the masterpiece that some say it is. The components are visually wonderful, and it does have a certain magic. But I find the game bulky, sluggish, inelegant and unsatisfying. I do want to keep playing, but I don't have the feeling of eagerness to refine my playing strategy that I wish I had.\n\nComplexity: 4 out of 5",
    "timestamp": 1746223200
  },
  {
    "username": "dl1ngo",
    "rating": 5.0,
    "comment": "Elegant design. Not good for casual games since it requires knowledge of all factions' mechanics.",
    "timestamp": 1745186400
  },
  {
    "username": "allenkimatsu",
    "rating": 5.0,
    "comment": "Juego asimétrico estilo wargame donde la interacción entre las diferentes facciones es la clave para que el juego sea disfrutable, por lo que la experiencia también puede variar partida a partida según el grupo de jugadores.\nEn este bonito juego (el arte es genial), controlad una facción de animales del bosque con el fin de obtener el dominio de este, pero que a mi parecer el desbalance está muy presente, sintiendo este en las 4 partidas aproximadamente que le he dado a este juego, haciendo que 4/4 partidas haya ganado la misma facción.\nEncuentro que las mecánicas están bien hechas y también es genial como cada facción es muy distinta de otra, otorgandote una experiencia totalmente distinta al jugar con cada una, lo cual le hace ganar mucho a este juego, pero el desbalance y también el entreturno, el cual se siente aburrido en comparación a otros juegos estilo wargame, me hace bajarle mucho la nota, ya que un elemento esencial en este estilo de juegos es la interacción, haciendo importantísimo el entreturno ya que en todo momento ocurren cosas, cosa que no senti grata en este juegos.",
    "timestamp": 1744927200
  },
  {
    "username": "TheBeresford",
    "rating": 5.0,
    "comment": "Please don't get the expansions for this",
    "timestamp": 1744840800
  },
  {
    "username": "p00q",
    "rating": 5.0,
    "comment": "I believe heavily asymmetric games like this have a strong inherent flaw of needing system expertise. If you aren't playing this with the same group frequently, you're likely going to have a lot of uneven experiences.",
    "timestamp": 1744668000
  },
  {
    "username": "darkfinale",
    "rating": 5.0,
    "comment": "Played once but feel base game can be drawn out with some ganging up on the leader. Needs time to get into each role's powers.",
    "timestamp": 1744495200
  },
  {
    "username": "rharn",
    "rating": 5.0,
    "comment": "Only played once a long time ago and remember it feeling too multiplayer solitaire, and don't really like how difficult it is to onboard new players to the asymmetrical powers.",
    "timestamp": 1744063200
  },
  {
    "username": "gram_niebieskim",
    "rating": 5.0,
    "comment": "My BGG:\n10 - excellent game, always have a great time\n7 - enjoyable game, I'm willing to play again\n5 - not bad but it's not my cup of tea\n2 - won't play ever again",
    "timestamp": 1743717600
  },
  {
    "username": "bloodragon",
    "rating": 5.0,
    "comment": "Played digital version. Its..",
    "timestamp": 1743372000
  },
  {
    "username": "joebri",
    "rating": 5.0,
    "comment": "Location: Bedroom",
    "timestamp": 1742770800
  },
  {
    "username": "FoxFjylgia",
    "rating": 5.0,
    "comment": "I love the artwork for this game. I love the asymmetric design, and the amount of work they've put into the mechanics, and the cutesy animals. I want to love this game so bad. I can even forgive it for the steep learning curve. But every time we do all the effort to set it up, learn the details and play it again, I am just left feeling \"meh\".",
    "timestamp": 1742598000
  },
  {
    "username": "Trevor03",
    "rating": 5.0,
    "comment": "Seemingly a tremendous game design. My middling rating is only based on my desire to go back to it, since I view it as a lifestyle game that requires regular play to appreciate and enjoy properly. If you're not, it's not feasible to internalize how the different factions work. After three plays with three different factions, I can barely remember how any of them work, and the winner just sort of happened randomly since it falls apart if even one person isn't playing their faction \"properly.\"\n\nSo, the game feels like a mix of solitaire (learning your own faction) while attacking other players as they also learn their faction. Playing it even remotely well is basically then impossible until you've interalized every faction's capabilities.\n\nIf you game with the same people and can play this at least monthly, there's clearly a great design here. Alas, that's not my desire or situation with all the great games out there.",
    "timestamp": 1742252400
  },
  {
    "username": "properplay",
    "rating": 5.0,
    "comment": "Victory is highly relative to how targeted you are by other players regardless of how good you play your own game. Some factions on the base game seem overpowered compared to others.",
    "timestamp": 1740438000
  },
  {
    "username": "adamgrey",
    "rating": 5.0,
    "comment": "I want to like this so much but after Arcs fell flat for me I think I just need to give up on this style of game. I don't have a dedicated group for it and there is a lot of teaching investment with all the asymmetry. Plus its available digitally if I ever change my mind.",
    "timestamp": 1738882800
  },
  {
    "username": "Fireblaze",
    "rating": 5.0,
    "comment": "Kingmaking",
    "timestamp": 1738018800
  },
  {
    "username": "LonelyTree",
    "rating": 5.0,
    "comment": "With Riverfolk, Underworld, Clockwork, and Exiles Partisan Deck.\n\nI have played this maybe half a dozen times live and double that on the app. I like the birds pretty well, but overall it’s just not a lot of fun to play. I hate the dice rolling mechanic for battle. Maybe the crafting stuff is okay, but I can enjoy that more in other games. It’s just not fun.\n\nWhat I think I don't like about it is the dice rolling combat. I really hate that the defenders take the highest number. It just makes everything feel like a slog.\n\nPurging. It has been four years since I have played this and I really don't have any desire to play it again.",
    "timestamp": 1737241200
  },
  {
    "username": "Addiction2k",
    "rating": 5.0,
    "comment": "I've played this two times and I love the idea of the mechanics but the game didn't land for me at all. Both times was a completely mediocre experience. Well actually one was mediocre, the other was considerably less fun than that.",
    "timestamp": 1736982000
  },
  {
    "username": "geear",
    "rating": 5.0,
    "comment": "Perfect condition, no missing pieces, only played a handful of times.",
    "timestamp": 1736636400
  },
  {
    "username": "udance4ever",
    "rating": 5.0,
    "comment": "something about this game doesn't quite stick. I own the digital version so maybe it will grow on me but I'd rather play Everdell!",
    "timestamp": 1736118000
  },
  {
    "username": "robosheep",
    "rating": 5.0,
    "comment": "Every play through of this game leaves you with a different story.",
    "timestamp": 1735599600
  },
  {
    "username": "Javajoesworld",
    "rating": 5.0,
    "comment": "Halfway through my first game being taught I realized that I had been taught my actions wromg. Tried again with a different group, was raiding we’ll be realized or not a game for me",
    "timestamp": 1735426800
  },
  {
    "username": "pickpackpaddy",
    "rating": 5.0,
    "comment": "Dominance cards seem a bit overpowered, and the item cards dont seem quite balanced, but overall a solid game.",
    "timestamp": 1735340400
  },
  {
    "username": "MsAppear",
    "rating": 5.0,
    "comment": "You NEED four people or else you don't unlock the game's full potential.",
    "timestamp": 1735081200
  },
  {
    "username": "skyenikko",
    "rating": 5.0,
    "comment": "The asymmetry is interesting, but there is soo freaking much to keep track of, especially of your immediate neighbor. Just too much for our typical playgroups. If you invested the time to get to know everything about the game, I could see it being fun and engaging. Played twice digitally, and we knew that it just wouldn't make it to the table. Offloaded.",
    "timestamp": 1734130800
  },
  {
    "username": "enzo622",
    "rating": 5.0,
    "comment": "Two games, both won by the Woodland Alliance. Even knowing they had to be stopped... we couldn't due to how you have to pay them cards to remove their pieces. So they use the cards you gave them to rebuild next turn. I see multiple threads about them possibly being overpowered. That's a concern but very possibly just an ignorance on our part as novices.\n\nOther than that, the game is brilliant. I really like the the cardplay mechanisms and how each faction plays in a unique manner. It's a Vast: The Crystal Caverns killer for sure as far as I'm concerned.",
    "timestamp": 1733871600
  },
  {
    "username": "Adam9172",
    "rating": 5.0,
    "comment": "A deceptively fiendish game, where the players have to ensure they at once cooperate against the biggest threat and yet also advance their own agendas.\n\nHaving played this twice now, I'm not 100% sure I enjoy this game. There's far too much random element, both in terms of how other players launch their opening gambit, and one or two bad set of rolls at the beginning can all but completely cripple you. I fully admit it may be me being a bit slow with the \"soft alliance\" concept so familiar with games from this designer (see Oath also.), but I am willing to try it out more.\n\nAs it stands, however, I'm honestly very let down with this game as I had heard a lot of good things about it and it's been such a mediocre game, both in terms of available mechanics and reliance on other players.",
    "timestamp": 1732834800
  },
  {
    "username": "BeepoisonGameMadness",
    "rating": 5.0,
    "comment": "Se siente incómodo, cada jugada que se hace te deja pensando que te equivocaste. Si se quiere jugar bien hay que aprender todos los personajes y eso es mucha información que no te da suficiente recompensa, en vez de sacar expansiones mejoren el juego plis.\n\nEl arte es bonito e icónico, además me gusta que tenga lore, tengo que jugarlo de nuevo para actualizar la nota, pero no dan ganas.",
    "timestamp": 1730242800
  },
  {
    "username": "minnovator",
    "rating": 5.0,
    "comment": "Didn't hit home with me",
    "timestamp": 1730070000
  },
  {
    "username": "bertvo11",
    "rating": 4.5,
    "comment": "Boring with two players, still have to play with more",
    "timestamp": 1729980000
  },
  {
    "username": "parpari",
    "rating": 5.2,
    "comment": "This is the my favorite game from Cole Wehrle. However; it still has lot of randomness and luck and also extreme power unbalance between factions. This leads to gang up on the leader mechanics to balance game by players which it is going to whole game. Unfortunately; Coin games blows this out water in any aspects for me.",
    "timestamp": 1729029600
  },
  {
    "username": "F4everEver",
    "rating": 5.0,
    "comment": "sell",
    "timestamp": 1728770400
  },
  {
    "username": "mykindameeple",
    "rating": 5.0,
    "comment": "A friend owns this and we can play their copy.\n\nPlayed this a few times with friends (only at 5 or 6 players I believe). It's okay, definitely not my favourite. I find the breadth of rules to be convoluted and it's a time consuming game, but will play if my friends really want to. Definitely not a top pick for me. The asymmetry is too much.",
    "timestamp": 1728338400
  },
  {
    "username": "farmergiles",
    "rating": 5.0,
    "comment": "Root has a fun concept - but is let down considerably by two big problems. Firstly it's an impractical game. You have to teach not only the fundamentals, but then also how every single faction works and each one being completely different just makes that job hard as nails. And with new players, you just get balance issues.\n\n............though that's just a compound for the balance issues already present. This game's factions are fundamentally unbalanced especially in the expansions. The Lizards........wow they suck balls. The Hundred Rats - how did a faction that obscenely OP get past play testing?\n\nYou want balanced assymetric factions?............honestly it's hard to do so, but Hegemony does it the best.",
    "timestamp": 1727647200
  },
  {
    "username": "BlockBadger",
    "rating": 5.0,
    "comment": "Base Root was a mess. Massive balance issues, and lacking choice or the asymmetric gameplay it promised.\n\nLater additions have fixed a lot of the Ballance, so the gameplay can shine through, but without the advanced setup from the Marauders expansion balance issues still define the game.\n\nWith all the DLC ...I mean expansions... its a solid 8. However without, it can often be a mess.",
    "timestamp": 1725832800
  },
  {
    "username": "minnesota84",
    "rating": 5.0,
    "comment": "over rated , may differ with the factions",
    "timestamp": 1725141600
  },
  {
    "username": "Duke_Rufus",
    "rating": 5.0,
    "comment": "And I thought my first marriage was complicated. In a good way!",
    "timestamp": 1724968800
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 5.0,
    "comment": "I like this, but have not played much. Only have played the original 4 factions.\n\nI have all of the expansions. Interested in playing them.",
    "timestamp": 1724709600
  },
  {
    "username": "RaymanY",
    "rating": 5.0,
    "comment": "Slow gameplay, not so interesting, disbalanced",
    "timestamp": 1720648800
  },
  {
    "username": "Jegesmedve",
    "rating": 5.0,
    "comment": "Not bad but... meh. If I wouldn't like the design I would drop it to a charity shop.",
    "timestamp": 1720303200
  },
  {
    "username": "skipboris",
    "rating": 5.0,
    "comment": "Root was fun while learning the factions and marveling at the interconnected machine, but once everyone understands everything the decision space was actually really shallow. More shallow than Risk even due to the limited number of clearings and connections. The entire meta really boiled down to 'that guy is in the lead so everyone attack him (if you even can)' and try to stay in 2nd or 3rd place then blast ahead to win the last 2 turns. Pretty components at least.\n\nIts a good game for children I'll give it that. They just have fun running their faction regardless of score.",
    "timestamp": 1720044000
  },
  {
    "username": "Xstream",
    "rating": 5.0,
    "comment": "Own the app.\nJust one game so far. Wasn't impressed yet. Not really my style of game I think. Will play It more to see how It develops.",
    "timestamp": 1719180000
  },
  {
    "username": "LuckOfTheDrawBG",
    "rating": 5.0,
    "comment": "I get what it is going for it's just it has too much going on with a huge power difference in the factions. Choosing your favorite faction might not be the best against the other player's faction, in fact it could completely counter it, so it feels like I have to play optimally to be able to do things, which means never touching some characters that I had really enjoyed as an idea. I think there are better games that implement asymmetric area control better, so I will stick with those until one of my friends (who loves the game) asks to play it every once in a while since we mostly avoid it as a group.",
    "timestamp": 1718920800
  },
  {
    "username": "zackt",
    "rating": 5.0,
    "comment": "Area control game with four different factions. Steep learning curve to wrap your head around the factions but gameplay is pretty fun and flows once you get going.\n\n10/3/22: Yep. Definitely not a game for me. Makes for some really cool moments but the cost of entry is too high, and cards can be ridiculously swingy. Totally get why people love it and why it's a lifestyle game for so many",
    "timestamp": 1715032800
  },
  {
    "username": "Brandizzle",
    "rating": 5.0,
    "comment": "It's fine. Too long for a game that is exclusively about conflict.",
    "timestamp": 1714860000
  },
  {
    "username": "metapone",
    "rating": 5.0,
    "comment": "Played 1 3-player game. It's hard to get into because you have to understand all player's factions instead of just one (you won't have enough time to react), and the turn structure is weird. Ultimately it might just be a \"me\" problem.",
    "timestamp": 1713564000
  },
  {
    "username": "TFJ383",
    "rating": 5.0,
    "comment": "A beautiful looking war game that's held back by it's complexity, uninteresting win condition, and the necessity of playing the game with the same people every time.",
    "timestamp": 1712095200
  },
  {
    "username": "Orion0224",
    "rating": 5.0,
    "comment": "I wasn't super into it and if players claim the victory condition cards the game devolves into a crab bucket.",
    "timestamp": 1711234800
  },
  {
    "username": "tycham85",
    "rating": 5.0,
    "comment": "to be fair, i only played the ios app, and i really couldnt get into the game. i would be down to try again if someone really experienced was willing to teach and go easy for a game. ive seen this set up at a convention and really want to like it due to the asymetric game play and table presence.\n\nios app: own - seems like a solid adaptation and would be great for keeping the different factions abilities straight. i worked through the tutorial a bit, but i didnt care for the game itself. i think the app is fantastic though.",
    "timestamp": 1710543600
  },
  {
    "username": "moxen001",
    "rating": 5.0,
    "comment": "Meh, simply meh.",
    "timestamp": 1708902000
  },
  {
    "username": "Steve9999999",
    "rating": 5.0,
    "comment": "One thing, I do not like the drawings on this game.\nIt looks like a child did them or from a childrens book.",
    "timestamp": 1708729200
  },
  {
    "username": "Metteintopf mit Feta",
    "rating": 5.0,
    "comment": "All players playing a different game with different rules, but all fitting together to a remarkably designed game. I still don't like playing it - too many rules that don't serve a purpose other than having several games in one. Also rather chaotic and not short enough to compensate for it.",
    "timestamp": 1708383600
  },
  {
    "username": "gyroscope1045",
    "rating": 5.0,
    "comment": "Not Sleeved",
    "timestamp": 1707778800
  },
  {
    "username": "luqon",
    "rating": 5.0,
    "comment": "This is simply not my kind of game. I can see how others might like it and the asymmetric nature of the game is well-implemented, but I just don't get any joy out of this. I feel like I'm not achieving anything, with others mostly undoing your work and then having to put most effort into preventing others from winning. And I know that is the nature of the game, but I would rather spend my time on something else.",
    "timestamp": 1706914800
  },
  {
    "username": "lamaros",
    "rating": 5.0,
    "comment": "It does its things well. But those things aren't interesting to me.\n\nFirstly, the game requires too much before (most) players can move their focus from their player boards to those of other players and the central board. At the same time game isn't doing anything interesting enough to motivate players to put that time and effort in. At the least, it's not offering me anything interesting enough.\n\nIt's a multi-player wargame which focuses on competition and generalised conflict, not inherent to a narrative (exacerbated by the thematic trappings, not complimented). Which to my mind is almost entirely missing the point of wargames, and games generally.\n\nFor the people that think of it an an allegory... well, let's go with Tolkien, and say that: \"I cordially dislike allegory in all its manifestations, and always have done so since I grew old and wary enough to detect its presence. I much prefer history – true or feigned– with its varied applicability to the thought and experience of readers.\"\n\nRoot feels like clever systems in search of a point - or explored for their own sake - rather than a point with systems to develop and support it. It's interesting, and good work, but it's not really the point of playing games in much the same way that most Eurogames aren't for me.",
    "timestamp": 1706742000
  },
  {
    "username": "Piottros",
    "rating": 5.0,
    "comment": "Too abstractive for my taste. In boardgames I like to feel the theme and I don't get the war between mouses, ravens and foxes.\nApart from that, game is quite okay, doesn't have enormous timeplay, rules are quite straightforward, moreover, I feel really big replayability.\nI like Cole Wehrle's games, but I am much more into \"real\" setting, like John Company",
    "timestamp": 1705878000
  },
  {
    "username": "Denny_Moses",
    "rating": 5.0,
    "comment": "Game breaking cards, as a first time player don’t know about these. I would have won by 30 points victory on my next move, but the other player picked up the dominance card and won. lot of work learning this game for a stupid card to lose by.",
    "timestamp": 1705791600
  },
  {
    "username": "lemonhead1986",
    "rating": 5.0,
    "comment": "Willing to trade. Have only played it 2 times. Not a huge fan.",
    "timestamp": 1705186800
  },
  {
    "username": "PainkillerMix",
    "rating": 5.0,
    "comment": "Не понял, не прочувствовал, возможно, из-за отсутствия игровой ячейки и неприятных первых впечатлений.",
    "timestamp": 1701730800
  },
  {
    "username": "TravisGifford",
    "rating": 5.0,
    "comment": "Too hard to teach new players. Too hard to get to. the table.",
    "timestamp": 1700262000
  },
  {
    "username": "Eiknarf",
    "rating": 5.0,
    "comment": "Digital Copy",
    "timestamp": 1697666400
  },
  {
    "username": "Jsheebz",
    "rating": 5.0,
    "comment": "I can see why people will really like this one but it's not for me.",
    "timestamp": 1697407200
  },
  {
    "username": "4edges",
    "rating": 5.0,
    "comment": "I love the theming and the bits. Because the game play just really didn’t appeal and the complexity of on-boarding new players was so high, it was not getting played. I am happy to have it out of my house.",
    "timestamp": 1697148000
  },
  {
    "username": "SirDadelot",
    "rating": 5.0,
    "comment": "Geekup bag set: 12 euro\nBase game: 45 euro",
    "timestamp": 1695852000
  },
  {
    "username": "dalec",
    "rating": 5.0,
    "comment": "Same reason I never became a programmer, put in a days work to only have a screen display some trivial display. Likewise what I put into this game in learning and playing I don't feel what I got out of it was worth the effort.",
    "timestamp": 1695074400
  },
  {
    "username": "cynical81",
    "rating": 5.0,
    "comment": "An interesting game, just not my style lately. Reminds me of Scythe but with cute theme. Likely requires many a play-through to master.",
    "timestamp": 1694383200
  },
  {
    "username": "Jadlak",
    "rating": 5.0,
    "comment": "I think I want to sell this.",
    "timestamp": 1693605600
  },
  {
    "username": "BioPermafrost",
    "rating": 5.0,
    "comment": "The game is well done but the mechanics and time required to learn every faction is not worth it in my opinion.\nit's just destroying the engine building of others every turn with luck of dice, and most of all you need a stable group of players because the difference with a newcomer is huge and unrewarding, so I prefer to use tje time in my group on other games",
    "timestamp": 1693346400
  },
  {
    "username": "Sundower",
    "rating": 5.0,
    "comment": "Looks amazing & creates the illusion of strategy but is ultimately just a King making game as each player gains points pretty much at an equal pace. One of the most over rated games I know. I really want to love this game but its like somebody got 95% through making the greatest boardgame ever but then got lazy for the last 5% which ruined the whole thing. King making is awful and removes any sense of achievement when you do win as everyone is always 'one turn from winning' and you only win if someone else beats down someone else for you essentially making them chose the winner. The game also requires everyone to be of equal experience and ability otherwise you just win easily and when you do get a game of equally experienced players its again just a neck and nexk race which ends in dumb kimg making. I dont get the love for this game outside of it looking thematically beautiful?? As a boardgame Its simply not what it sells itself as and again gives an illusion of a complex War/strategy game when it really isnt.",
    "timestamp": 1693346400
  },
  {
    "username": "HowitzerBug",
    "rating": 4.5,
    "comment": "Adorable and very interesting. Its strength is also its weakness... The factions play very differently which makes for very interesting games, but you also need to learn different rules for each faction, even your opponents, if you're going to have any hope at playing effectively.",
    "timestamp": 1692309600
  },
  {
    "username": "Delphinium",
    "rating": 5.0,
    "comment": "Another game with asymmetric powers which unless all the players are familiar with ALL the powers being played therefore understand how each is trying to win just falls flat. I can't see myself ever wanting to find a big enough group who are all going to put in the effort to reach a situation where the game is played \"properly\" - the other concern is that it could be a long way to travel to discover imbalances....",
    "timestamp": 1692223200
  },
  {
    "username": "Sedd",
    "rating": 5.0,
    "comment": "Kurz: Der Aufwand es gut spielen zu können ist mir einfach zu hoch.\n\nLangform:\nAufgrund...\n-der hohen Einstiegshürde (viele Spezialregeln, unterschiedliche Spielermechaniken (asymetrische Völker), verschiedene Punktegeneratoren der Völker, die man alle kennen sollte)\n-der Tatsache dass man das Spiel mehrfach spielen sollte, um die Feinheiten zu verstehen\n-die Spielergruppe etwa das selbe Niveau haben sollte\n-konfrontativen Spielweise, in Kombination mit der Spiellänge\n-die Unbalanciertheit (die die Spieler selber+bewusst ausgleichen sollen/müssen)\n... ist es kein Spiel für mich\nEs könnte für die Leute perfekt(!) sein, die wirklich oft das selbe Spiel spielen wollen; am besten immer mit der selben Gruppe. Und selbst dann, kann ich mir bessere Spiele vorstellen (Food Chain Magnate z.B.)\nEs gibt auch ein paar positive Dinge; die Grafik sowie das Spiel-Material",
    "timestamp": 1692050400
  },
  {
    "username": "emoprzemoc",
    "rating": 6.0,
    "comment": "One of the top long-term struggles I had with assigning a number to a game since I started rating board games a few months ago, after several years of gaming.\n\nBut when I started rating, I decided to primarily follow my instincts - such as my willingness to play the game (again). Surely the paragraphs I write in my comments on ratings doesn't look very 'instinct-esque', but that's really a rule of thumb here, which leads to numerous generally acclaimed games (that I've also got great respect for them) getting not that good ratings from me. And so, that's the case here, too.\n\nI've seen people posting stuff about this game, declaring it's one of their favourite games to teach others how to play, as it's so easy and it takes them like 15 minutes. Wait, what? I know I never got this good at neither playing 'Root' or teaching others, but it really sounds impossible to me.\n\nI've played several games of 'Root', mostly at 2P (with either my wife or my friend) or at 3P (with both of them), and I was the one who had more knowledge about the way that game and particular factions worked and I still needed to check the rulebook every now and then, and then the otheer rulebook as I didn't really find what I was looking for, and then I needed some time to properly interpret the rules. Well, usually there was... some time between one game of 'Root' and another, so it wasn't easy to get used to even some core concepts... Anyway, I was the only one of us who tried playing as all the possible factions in the base game (+ Lizards from 'Riverfolk' expansion). Others just preferred playing as Birds mostly (my wife) or were relatively good with trying different factions, including some version of the Vagabond (my friend).\n\nThe problem is that as it's a highly asymmetric game, it's not easy to play even if you've memorised all the core rules and what's the goal for your faction. You need to know how all the factions used by other players actually work. And that's the problem. I often got accused of winning because... 'you know your faction and know the game more than we do, we can't win this way'. Erm... Oh, and once or twice it was also mentioned that I played solo in the app version. I did it ONCE... I'm not trying to discredit my co-players here, I'm trying to make a general point: there IS a lot to learn and you need some DEDICATION to have fun with this game. Sure, I'm not that good at teaching others, despite being the one doing it most of times; and I know that there are various ways of learning how to play (or learning anything else in life) and some ways just aren't very efficient for everyone. My fellow players didn't really try to learn the rules other way. The other option is to keep playing over and over again. That didn't happen in our group, as usually they wanted to play something else, and we didn't own that many games then as we do now. I'm also a 'board game explorer', I like to play new games instead of mastering several one, playing them a few hundred times. But I really tried to make step forward in this direction with 'Root', but it failed.\n\nThere's... another problem with 'Root' in OUR case. We mostly play at 2 players, sometimes 3 players. There are 4 different scenarios for 2 players listed in the base game's rulebook, with just one (Marquise vs Birds) marked as suitable for novice players. But there's another way to find out which factions to play with at specific player count - a table of 'reach' values which says that you need a sum of at least 17 for a decent 2-player game and the only combination that meets this requirement in the base box is that marked one.\n\nWell, I was aware of it, I saw the community of BGG declaring the game suitable only for 3-4 players, and that's why I didn't buy it when I was a newbie in the hobby; but at some point later we got a voucher & there was a great offer on 'Root' AND 'Riverfolk Expansion' (that adds a bot player), and that's how and why we got it...\n\nSo. I agree that it's an amazing game - it's a great concept and system of core rules and it's astonishing how expandable it is - there's a lot of new variants of the Vagabond, new factions, both official and fan-made, alternate main deck, additional main boards, bot players... This way there's almost endless replayability in just game components... and as it's a 'war' game with lots of player interaction, there's much much MUCH more replayability in PLAYERS (and the more players you know, the more strategies you'll see).\n\nPlus, the game looks really good, especially the Kyle Ferrin's artwork and animeeples here - though they may fool some people into thinking it's a cozy game with cute animals... naaah, they're totally not cute, they're DEADLY. \n\nSo: a wonderful game that's easily a 9/10 one (or more), but just... not for me and my gaming group!  But I'd like to play it again at some point... I had soooo much fun as Woodland Alliance!\n\n+ great concept\n+ core mechanics allow creators and fans to constantly expand the game\n+ cool artwork\n+ some of the best animeeples in games\n+ full of player interaction\n+ asymmetry\n+ lots of possible setups (there's even a double-sided board)\n+ i love woodland alliance :')\n\n- a lot to learn at first\n- high asymmetry + high interaction means you need to know all the factions, not just yours\n- requires some dedication from all the players\n- not all the possible matchups work well\n- just one really balanced scenario for 2 players\n- really shines at 4 players and that's not possible in my group\n- no bot player included in the core box",
    "timestamp": 1762210800
  },
  {
    "username": "ferion",
    "rating": 6.0,
    "comment": "I'd say that this is a great design for players who like combat-driven games. It is just not for me.",
    "timestamp": 1762124400
  },
  {
    "username": "Quatrimus",
    "rating": 6.0,
    "comment": "Root is a game that I find fantastic based on its design. The way that the different factions function and interact with one another, along with the art, are very appealing to me. However, when I actually play it - I find it to be 'too much'. There are too many things going on at the same time, too many things to pay attention to in order for this game to actually be fun for me. So I'd give this an 8 purely based on its design, but it's a 6 at most when it comes to my personal enjoyment when playing.",
    "timestamp": 1762038000
  },
  {
    "username": "Gareth",
    "rating": 6.0,
    "comment": "Includes 2 Playmats (Lake/Mountain and Fall/Winter) and Resin Clearing Markers.\nIncludes Underworld Expansion.\nIncludes Riverfolk Expansion.\nIncludes Exiles and Partisans Deck.\nIncludes Vagabond Pack.\nIncludes The Clockwork Expansion.\nIncludes Upgrade kit, plus the superseded boards.\nFolded Space insert used for counters and cards, so the maps, player boards and rules are in the Underworld Expansion box.\nThe Riverfolk Expansion is housed in the original box plus the Underworld Expansion box. I no longer have the original box for The Riverfolk Expansion.\nThe Clockwork Expansion is in its original box.",
    "timestamp": 1761951600
  },
  {
    "username": "Nonoku",
    "rating": 6.0,
    "comment": "2-4 B: 4\nW: 3.81",
    "timestamp": 1761606000
  },
  {
    "username": "federik21",
    "rating": 6.0,
    "comment": "Owned digital.\nSome factions have a brilliant gameplay, others are more boring/passive.\nI constantly get overwhelmed by remembering and following each faction’s mini game.\nEnding is anticlimactic, where a player just puts some tokens to reach 30 and win, after kingmaking or king bashing.",
    "timestamp": 1761519600
  },
  {
    "username": "Davos_Seaworth",
    "rating": 6.0,
    "comment": "- Cats are playable\n- Suited recruiting\n- 6 officers\n- \"Violence is not the answer...\n\n...It's the question...\n\n...AND THE ANSWER IS YES!\"",
    "timestamp": 1761429600
  },
  {
    "username": "Bonejar",
    "rating": 6.0,
    "comment": "I admire this game more than like it. That being said, if you want to venture into the woods, do it this way: Get four friends together that know nothing about the game, then learn it together over several outings. Build up your understanding of the game's vast landscape. (Never accept a new player into your group. You will be doing the new player a big favor.) Then you will need to play this game repeatedly and frequently (possibly to the exclusion of every other game). To really \"get\" Root it must become a lifestyle. Ultimately, for me, life is too short.",
    "timestamp": 1761256800
  },
  {
    "username": "whitecatplays",
    "rating": 6.0,
    "comment": "Cool and all, but you either like domino kingslaying or you don't.",
    "timestamp": 1760738400
  },
  {
    "username": "btasam",
    "rating": 6.0,
    "comment": "The forest is unstable. The hegemony is up for grabs. Quiet. Traditions of power gather and the interweaving of operations is nothing short of extraordinary. Root consistently punches me with poetic ambivalence... I love it, I hate it, what is it again?\n\nRoot has never been my favorite experience. I still find it soulless and unmemorable. However, the expansion content has been incredible. I appreciate how the factions provide a plethora of playing styles to explore. For reasons like this, I don't find Root overrated and I think it works for a lot of different people in a lot of different ways.",
    "timestamp": 1760392800
  },
  {
    "username": "dj_koen",
    "rating": 6.0,
    "comment": "Its oke i guess",
    "timestamp": 1759528800
  },
  {
    "username": "dr4gonfly",
    "rating": 6.0,
    "comment": "not my type of game",
    "timestamp": 1758751200
  },
  {
    "username": "tokkinho",
    "rating": 6.0,
    "comment": "so far more a miss for me than i want it to be. feels scripted and constraint for the sake of balancing asymmetric powers. love the theme, the playfulness and the political allusions. some design choices are very elegant, while some feel superficial and unnecessarily complex. artwork is playful.",
    "timestamp": 1758146400
  },
  {
    "username": "SFRR",
    "rating": 6.2,
    "comment": "Update 9/5/2025: for Root game plays I'm now no longer including online play (Steam). I've played 4 FtF games with all current expns except Hirelings.\n\nHave now played 2 FtF games with 5 players. Both games were fun. The VB is O/P IMHO, spamming aid cards for 14 VPs is a bit much. This game is really difficult and tedious when playing 3 or so new players, the teaching process is laborious and exhausting. It's also really difficult to find other Root players.",
    "timestamp": 1757887200
  },
  {
    "username": "gapstone3",
    "rating": 6.0,
    "comment": "Copy in very good condition available for sale or trade. Includes Clockwork expansion in base game box. Prefer sale.",
    "timestamp": 1757541600
  },
  {
    "username": "demiesta",
    "rating": 6.0,
    "comment": "Getting better each play",
    "timestamp": 1757196000
  },
  {
    "username": "rongbeo93",
    "rating": 6.0,
    "comment": "I’ve only played Root digitally, never the physical version, and after several sessions I still don’t understand the hype. Beyond the charming artwork and the innovative idea of asymmetrical factions, it feels like a bland mix of card drafting and area control. It’s also difficult to teach and often feels unbalanced.",
    "timestamp": 1756850400
  },
  {
    "username": "TheGoddamnDuke",
    "rating": 6.0,
    "comment": "a good game, a blast. But too much assymetry that prevent to be played often. This is a real problem. Why having a good game if you cannot play it anyway.",
    "timestamp": 1756764000
  },
  {
    "username": "Killi",
    "rating": 6.0,
    "comment": "I get the hype, asymmetry well done with gorgeous artwork. I just don't want to spend many hours learning all the factions just to be able to somewhat understand how to play.",
    "timestamp": 1756504800
  },
  {
    "username": "Jclancy15",
    "rating": 6.0,
    "comment": "The art is and theming is obviously incredible, even if it comes from a fairly simple insight. I need more plays, and obviously high-level play adds nuance to this, but the core gameplay loop of bopping the leader that you get in many Wehrle designs and multipolar wargames (with highly connective maps) isn't my favorite.",
    "timestamp": 1756332000
  },
  {
    "username": "nhjelmberg",
    "rating": 6.0,
    "comment": "It's hard to rate Root after only one game. Its core is actually a point salad but each player has their own abilities and goals, which more often than not will interfere with the opponents. It probably gets better with repeated plays with the same players, since this will make it easier to assess the game state and understand which players to cooperate with and which players to bash. Nevertheless, even my first game was interesting as I tried different paths in the Root forest to see where I would end up.",
    "timestamp": 1756332000
  },
  {
    "username": "Re_Condor",
    "rating": 6.0,
    "comment": "Best materials, but i dont know why i never full enjoy the game.",
    "timestamp": 1756072800
  },
  {
    "username": "azhu",
    "rating": 6.0,
    "comment": "Very hard to set up and start",
    "timestamp": 1755468000
  },
  {
    "username": "Mageknight12",
    "rating": 6.0,
    "comment": "Root has gorgeous art and ambitious asymmetry, but it's incredibly hard to teach and balance. Mismatched player experience levels often lead to one-sided games and confusion.",
    "timestamp": 1755036000
  },
  {
    "username": "ChaosFarseer",
    "rating": 6.0,
    "comment": "Ah, Root. So many people love Root. We have good friends who love Root, at least aesthetically, yet there has been a surprising number of their games which have been absolutely awful experiences for at least one player.\n\nPitfalls:\n* If anyone is vulnerable to action paralysis, the game will bog down.\n* Absolutely do not play with 5+ players, IMO.\n* Each faction is generally hard to grok. Despite the theme usually being simple, the minute details are important to get right and very difficult to get right on a first playthrough.\n* You should understand how other factions work or the existence of certain cards in order to play effectively, or else fail to deny opponents victory points or risk getting annihilated by surprise. In our first game, the card which destroys all opponents in four regions was a game-ender for an opponent who didn't know about that card.\n* A lot of the game requires attacking other players and messing up their day. Especially, the cats always get punched in the face first thing, so don't play them if you don't like that experience.\n\nIf you play the game lighthearted and without worry about the stakes, that may help a lot. Also, certain factions may be less precarious than others.\n\nAnd all that said, I absolutely love that the factions are so different and depict various real-life political structures. Heck, playing the moles and realizing their true nature was an experience I'll never forget. The game is like a cat, though - looks cute, lovely concepts, might bite you when played.",
    "timestamp": 1754344800
  },
  {
    "username": "TheCaptainAwesome",
    "rating": 6.0,
    "comment": "Was not something that clicked with my group, and solo wasn't an option. Great potential",
    "timestamp": 1754258400
  },
  {
    "username": "Mandurang",
    "rating": 6.0,
    "comment": "Asymmetric game from the maker of Vast: The Crystal Caverns. I grew out of it, unfortunately, and would rather play a whole list of other things before I ever sit on a Root table.",
    "timestamp": 1753912800
  },
  {
    "username": "jgoyes",
    "rating": 6.0,
    "comment": "2021-04-24\n\nInitial Rating: 7.0 (April 2021)\n\nI know Root is a big hit, but my desire to play the game has always been low due to two facts. 1. I played Vast a long time ago and I didn´t enjoy it much (perhaps due to a bad explanation) and 2. Playing with asymmetrical armies makes the game hard to explain and hard to get to the table (this remains true), still, I enjoyed the game way more than I though I would, so, I was pleasantly surprised by it.\n\nRoot´s rules aren’t very complex, but there are A LOT of different rules so explaining the game takes a long time as each player needs a personalized explanation. This is very cool on theory, but in practice, it is a hassle as you need to make sure all players understand all factions. You can teach the rules in around 30 minutes. Playtime is around 2 hours.\n\nThe game´s components are very well done and they look great on the table. The art is also topnotch.\n\nThe theme it´s there but I don’t really care much for it.\n\nRoot it´s a dudes on a map game and I was pretty sure I was going to dislike it due to this BUT, I didn’t. In Root, each army has a different way to generate VPs and the goal is to achieve 30 VPs, so the game doesn´t feel too long. It is VERY cool that each army plays very differently from each other and I really want to explore them further.\n\nLuck plays a role in the game and this bothers me a bit. The luck of the draw with the cards can decide games (it decided ours). There are some cards that can give a lot of VPs, like Royal Claim (although they are harder to play). There are also dominion cards which gives you an alternate form of victory, but these cards don’t bother me that much. With a couple of games, you will know for sure to be on the lookout for them. To summarize this part, I would have liked it a bit better if the cards power level was more balanced, BUT, in this kind of game, players balance the game themselves (which I kind of dislike). There is also luck with the combat dice but, ironically, this luck doesn’t bother me as you can easily calculate the odds.\n\nAnother (minor) dislike for me is that the game gets balanced by the players themselves, that is, everyone attacks the perceived leader, so the best strategy is to go second in VPs until you are ready to spring for victory, this is a common characteristic of area control games and/or dudes in a map games. This also could lead to kingmaking situations so I think it is best played as a 4 player game.\n\nAfter 1 play, I cannot begin to comment on the power level of the armies, but, again, in this kind of game, this responsibility falls to the players to balance the game themselves, so it doesn’t worry me too much. Having said that, there are some factions that play much easier than others, other factions require more finesse to be played successfully (again, not a bad thing).\n\nIt also bothers me a bit that every army has an except that tells players how to play it. I hate this in rulebooks and in player aids. The reason is that I feel this robs me of the opportunity to discover the best strategy for myself, and, even when I don’t read it, when other player do, this affect gameplay a lot. This is, obviously, a personal preference, but would have liked it more if the tips were only in the rulebook. I also get why the designer did this, the game can be complex for new players.\n\nReplayability seems very high, not only each faction plays very differently, the game has lots of expansions.\n\nI'm not sure if Root is a Wargame or not., According to BGG´s definition, it does seem to be a Wargame, and, in this case, it should win the spot for best Wargame (and only game I have played in this category) in my personal 2018 list . As I´m not sure, I´m still not ready to give it the award though.\n\nBottom line, I was pleasantly surprised by Root, I liked the game enough to keep it in my game collection (for now) and I want to explore it further. It also made me want to play Vast again to see what did I miss the first time. Root is, undeniable, a good game so it deserves its reputation. I, generally, don’t enjoy much this kind of game and having asymmetrical armies makes the game hard to hit the table (due to its long explanation). I imagine it would be bliss to play it often with the same game group (as to avoid the explanation), but, these days, there are almost always new players in our game group. I´m a bit worried about the power level and balance of the cards, but this is a small issue for me (in this kind of game).\n\nCurrent Rating 7.0\n\n\n2025-07-29\n\n• It finally happened. Root was always a borderline 7.0 (good game) to me. Intellectually, I KNOW Root is a great game, but my desire to play it has always been lowish. I´m no longer into area control games or \"dudes in a map\" games (there are some exceptions).\n\n• Due to this, I sold my whole and complete Root collection.\n\n• Also due to this, I’m downgrading this rating. I could play Root again, but as I have it on the iPad I see no reason to keep it in my game collection as I’m trying to get it under control.\n\n• Root is no longer among my favorite games of 2018.\n\nCurrent Rating: 6.0\n\nJgoyes´ Awards:",
    "timestamp": 1753740000
  },
  {
    "username": "Cerberus777",
    "rating": 6.0,
    "comment": "(Physical copy not owned)\n(App owned)\n\n IMPORTANT NOTE: TEMPORARY RATING This rating is done considering that I have only played this game on an App.\n\n\nBase Game: Digital Games Played = 3 times (6-12-23-46)\n\n\n\n\n COMPLETE RATING:\n\n\nSCORE  CRITERIA       WEIGHTING       ------- STAR RATING SCALE -------\n\n(7.0) FUN             (x15):         BORING  REALLY FUN\n\n(7.0) GAMEPLAY         (x5):       NO DEPTH  LOT OF DEPTH (FOR THE WEIGHT)\n(7.0) GAME FLOW        (x5):         FIDDLY  SILKY SMOOTH\n(7.0) DOWNTIMES        (x2):         LOT OF  ZERO\n(7.0) RANDOMNESS       (x2):      PURE LUCK  PURE SKILLS\n(7.0) MECHANICS        (x2):         BORING  INTERESTING / INNOVATIVE\n\n(7.0) REPLAYABILITY    (x5):           ZERO  INFINITE\n(7.0) SCALABILITY      (x3):           POOR  GREAT AT ALL PLAYER COUNTS\n(7.0) PORTABILITY      (x1):          BULKY  SUPER EASY TO PLAY ANYWHERE\n\n(7.0) THEME            (x1):   UNATTRACTIVE  ATTRACTIVE\n(7.0) AESTHETICS       (x1):           UGLY  GORGEOUS\n(7.0) COMPONENTS       (x1):    LOW QUALITY  HIGH QUALITY\n(7.0) VALUE            (x2):  TOO EXPENSIVE  REALLY CHEAP(LOW COST FOR WHAT WE GET)\n\n(7.0) SETUP TIME       (x2):           LONG  ZERO\n(7.0) GAME LENGTH      (x2): TOO SHORT/LONG  JUST PERFECT\n(7.0) RULES COMPLEXITY (x1):        COMPLEX  SIMPLE\n\n\nTOTAL = 350.0/50 = 7.00\n\n\n POSITIVE POINTS:\n\n++ ABC\n\n\n NEGATIVE POINTS:\n\n-- ABC\n\n\n OTHER GAME INFO:\n\nGame Weight = 3.7/5\nRelease Date = 2018\nNumber of Player = 2-4\nApp game length = 45 min.\n2-player length = 90 min.\nPlayer Count Preference = Best at 4, recommended at 3! (Not recommended at 2)",
    "timestamp": 1753135200
  },
  {
    "username": "legion170",
    "rating": 6.0,
    "comment": "Likely a great game if you have a stable group, but not very playable at two (the player count we play at most) and not easy enough to teach to the family and friends who visit sporadically. A game I want to like, it just never gets played.",
    "timestamp": 1752962400
  },
  {
    "username": "SunnyD44",
    "rating": 6.0,
    "comment": "Played a five player game. There were a couple of us who hadn't played; this is a game where you need the majority to know what they are doing given the different asymetric faction abilities.",
    "timestamp": 1752444000
  },
  {
    "username": "NikolasGimli",
    "rating": 6.0,
    "comment": "Too much to keep track of.",
    "timestamp": 1751752800
  },
  {
    "username": "mlcknight06",
    "rating": 6.0,
    "comment": "Digital only",
    "timestamp": 1751666400
  },
  {
    "username": "selvalabelva",
    "rating": 6.0,
    "comment": "Brainburn         Longevity    \nLuck impact       Rules/Setup  \nInteraction       Involvement  \n\nAftertaste           Enthusiasm   \n\n Best at 4 player count\n Rating inclusive of expansions gameplay\n Replayability improved with expansions\n Confrontation: direct\n\n Fragile design depending on factions in play\n Vagabond questionably balanced\n\n Beautiful unique wooden components",
    "timestamp": 1751320800
  },
  {
    "username": "tristammizak",
    "rating": 6.0,
    "comment": "Play Group Owned.\n\nGreat components, the art is compelling, and the gameplay is fun. It can be difficult to keep track of everyone's individual goals in a game, but not impossible.\n\nHowever, balance is a bit of a challenge. The Vagabond, by nature, has the easiest time winning, and can play a bit of a kingmaker role. No problem, that's part of the game. But then there will be set-ups that just result in players that have difficulty interacting with each other, but both can interact with a third player. This causes that third-player to deal with constant harrying from those players, which weighs down their ability to pursue their goals.",
    "timestamp": 1750802400
  },
  {
    "username": "WeNeedthePooh",
    "rating": 6.0,
    "comment": "Played it multiple times. I now come to a conclusion that I don't really enjoy games with direct confrontation with multiple sides that much.",
    "timestamp": 1750716000
  },
  {
    "username": "Jbbeav",
    "rating": 6.0,
    "comment": "Has potential, but found it hard to learn, and it so far has failed to hook me.",
    "timestamp": 1750370400
  },
  {
    "username": "bami1020",
    "rating": 5.9,
    "comment": "app\n[puzzle 8 replay 6 invest 4 solo 2.5]\n-must learn all factions to play competently\n-I wonder if the hype is more about admiring the mechanics than the enjoyment of the game\n-some factors bored me (e.g. faction of action planning which I just don't enjoy), and I just couldn't be bothered to learn 4 factions and understand the significance of my decisions",
    "timestamp": 1750284000
  },
  {
    "username": "harvey thomas",
    "rating": 6.0,
    "comment": "Pretty good fun",
    "timestamp": 1750197600
  },
  {
    "username": "onceplayed",
    "rating": 6.0,
    "comment": "preliminary. the game seemed to me more of an art project than a game to me. while everyone plays their own game, the decision space didnt seem to be particularly appealing but that might have been related to me playing cats/it being my first game. lots of waiting not a lot of acting. Might have also been related to me spending half the game dealing with the green plague.",
    "timestamp": 1750111200
  },
  {
    "username": "Folofl",
    "rating": 6.0,
    "comment": "The art is so cute but I absolutely HATE this game, it is so mean. Only willing to play the clockwork/coop version of this and even that is somehow a toxic experience haha.",
    "timestamp": 1748210400
  },
  {
    "username": "MountainLionGrrr",
    "rating": 5.5,
    "comment": "Well if you take it as a neat pastime activity, that shouldn't be taken seriously. Then the game is good entertainment. But when you start nitpicking on what it is, you might end up pit in the cold with it. The game isn't so deep that the so called asymmetrical faction could be fully balanced. And that is fine, if you just understand that in game there is things that you can't influence without king-making table talk, and even then people might just choose wrong actions for your liking, or the dice doesn't favor, but it is what it is. And when you balance it and go side by side in victory points track, and the winner is just decided by who gets to craft 2VP sword first. It is what it is... and yes Vagabond just stole 0.5 points from the rating but gave you a card for return.",
    "timestamp": 1748124000
  },
  {
    "username": "Kwenami",
    "rating": 6.0,
    "comment": "Own On Steam",
    "timestamp": 1748037600
  },
  {
    "username": "nanobastaddo",
    "rating": 6.0,
    "comment": "Excellent graphic and concept. Some great disappointment about the selection of the \"4 players\" (sic) core box, and the fact that the core box is more a starter set of a collectible game: there are a lot of expansions.",
    "timestamp": 1747087200
  },
  {
    "username": "cantbelikewater",
    "rating": 6.0,
    "comment": "Good but you need to prepare and learn every faction since they are so asymmetric",
    "timestamp": 1745532000
  },
  {
    "username": "Avid_Equinox",
    "rating": 6.0,
    "comment": "It's more of a negotiation game than a wargame, as four players will keep knocking the leader of the group back until someone is unable to be stopped. This means winning/losing feels a bit random and less \"earned\".\n\nIt's an enjoyable game - one I would be happy to play again, but I'd also not actively suggest, giving it the 7.5 rating.",
    "timestamp": 1744754400
  },
  {
    "username": "Danno77",
    "rating": 6.0,
    "comment": "Own Digital",
    "timestamp": 1743804000
  },
  {
    "username": "AhabXXX",
    "rating": 6.0,
    "comment": "Wargame like with asymmetrical animal families: nice.",
    "timestamp": 1743544800
  },
  {
    "username": "individyouall",
    "rating": 6.0,
    "comment": "I have the same issues with Root as many others. Essentially a game that bills itself as a war-game, fails to deliver on its promise. Battles when they occur are dice driven, which I am not a fan of, unless there are interesting ways to alter the chances of success. There is also too much randomness elsewhere and too many dull ways of generating VPs (e.g. what skill is required to craft items?).\n\nI've played it twice, so I do appreciate that for the game to really shine, you likely need to invest the time to play multiple factions and then compete against those factions again. Otherwise the game is essentially a solitaire puzzle with very little meaningful interaction. Or at least, interaction that has meaning to the players involved. And for me, despite being attracted by the artwork, I'm just not interested or excited enough by the game to want to invest the time required to see if there is an epic game here. I'd rather invest time elsewhere or on other games.\n\n---- After 3rd Game ----\nI finally managed to play a game involving factions all players know and it was disappointing. Whilst the objectives of the inevitable 'Bash the Leader' became more apparent, sadly faction weaknesses meant that all efforts by the rest of the table had to be concentrated on that action. Inevitably meaning that the player who was in second before the 'Bash the Leader' actions were taken ultimately benefitted the most and won a few turns later. No one had anything left in their armoury to stop them. Plus they won with a final points turn (once again) that took a long time to calculate and involved multiple crafting points, failing to provide once again an epic or memorable game experience.\n\nI really want to like Root because there is a lot here to like. But I just find many more games a lot more fun and enjoyable. I have never been more convinced that if this game had say the art of Gaia Project, it would be nowhere near the top 100.",
    "timestamp": 1743372000
  },
  {
    "username": "Brandon04",
    "rating": 6.0,
    "comment": "Score reflects current experience with game",
    "timestamp": 1743116400
  },
  {
    "username": "SadWormEater",
    "rating": 6.0,
    "comment": "Maybe I would rank it higher if I had friends to play with it more, but as it is every time I play a few times with a group no one has a desire to keep playing once they \"get it\"",
    "timestamp": 1742857200
  },
  {
    "username": "toadles",
    "rating": 6.0,
    "comment": "Unplayable without understanding all the roles.",
    "timestamp": 1742252400
  },
  {
    "username": "BigG1989",
    "rating": 6.0,
    "comment": "It's brilliantly designed. But it's not fun it's work",
    "timestamp": 1742166000
  },
  {
    "username": "San Il Defanso",
    "rating": 6.0,
    "comment": "Root takes asymmetry to about the furthest extent you can in a game that is less than two hours long. The four factions all feel entirely different, well-designed, and (basically) balanced. They are also on top of a basic game that feels mostly pretty intuitive, leaving the complexity on the player powers.\n\nBut the player powers aren't just different; each person is essentially playing a completely different game. This isn't a problem in theory, but in practice it has made this game extremely difficult to get played. If you have a group that is willing to play regularly you can get over the hump pretty well. Otherwise this one might not be worth the money to buy it. Also, it really requires three players. If it's just two people you can do a lot better.\n\nI like asymmetry, and I like Root. But it has never completely broken through for me after a lot of attempts. So consider this a \"weak 8\" as much as a \"strong 6,\" using my 5-point rating scale.",
    "timestamp": 1741906800
  },
  {
    "username": "IronChefZod",
    "rating": 6.0,
    "comment": "This game is like a 5 with bad mix of factions. It's a 7 or 8 with a good mix of factions. I don't like the vagabond in the game at all. With the Underworld expansion there is literally no need to ever have a vagabond in the mix, Riverfolk or Corvid Conspiracy are much better options to mix.",
    "timestamp": 1741734000
  },
  {
    "username": "StevenKiel",
    "rating": 6.0,
    "comment": "This game sucks to learn and sucks to teach, but it is a rewarding game as more plays and deeper game knowledge increases enjoyment. Dont like how expensive Expansions are but base game is fine.",
    "timestamp": 1741561200
  },
  {
    "username": "ntww12",
    "rating": 6.0,
    "comment": "It's beautiful. Has gorgeous artwork and tokens, with a lovely board. Only thing is how difficult it is to actually learn and play! Tried it twice but we've failed to really maximise the actions and often become quite confused with what we're supposed to do. Hoping my friends and I will get the hang of it soon to really enjoy the game.",
    "timestamp": 1741474800
  },
  {
    "username": "TheKloewers",
    "rating": 6.0,
    "comment": "Long and difficult to learn, but I would play it again to try the other factions.",
    "timestamp": 1741129200
  },
  {
    "username": "ArwenZett",
    "rating": 6.0,
    "comment": "First of all, the artstyle is immaculate. I love these goofy bloodthirsty animals, but the gameplay in my opinion is lacking to say the least. It's tough to get into because of the fractions, the flow of the game is extremely slow and players usually end up waiting half an hour for their next move. The fractions are interesting and allow for different playstyles but in no way are they balanced. I rarely take this game out because of the steep learning curve and monotonous gameplay.",
    "timestamp": 1741042800
  },
  {
    "username": "romishou",
    "rating": 6.0,
    "comment": "Adoro il concept di Root e mi sarebbe piaciuto giocarlo di più quando era ancora nella mia collezione.",
    "timestamp": 1739746800
  },
  {
    "username": "Mosik",
    "rating": 6.0,
    "comment": "Not my type of game",
    "timestamp": 1739660400
  },
  {
    "username": "Trylden",
    "rating": 6.0,
    "comment": "Root is actually very good. Maybe even great, I don't know. I have a lot of respect for it, and for what Cole Wehrle has managed to do with what is, at its core, a war game. It certainly deserves the praise and the following it's accrued.\n\nI just don't actually enjoy playing it.",
    "timestamp": 1739401200
  },
  {
    "username": "Daniel109",
    "rating": 6.0,
    "comment": "A solid experience with the right group, but its complexity doesn't quite feel justified, and it always seems to overstay its welcome. Measuring victory via a point track is lame for this genre of game. For the same political/war experience distilled into a tighter package, I'd rather play Inis. Still, the asymmetrical gameplay is unique and can lead to some exciting moments.",
    "timestamp": 1739314800
  },
  {
    "username": "rielnano",
    "rating": 6.0,
    "comment": "Good game, with good mechanics and asymmetrical features that amuses and generates commitment as the game progresses.",
    "timestamp": 1739228400
  },
  {
    "username": "mr0santan",
    "rating": 6.0,
    "comment": "Really cool game, haven't gotten to play it enough yet.",
    "timestamp": 1738882800
  },
  {
    "username": "EllikTheren",
    "rating": 6.0,
    "comment": "Asymetric war game. The different factions are fun to figure out and play as. The nature theme helps bring the game to the table with a greater variety of players.",
    "timestamp": 1738623600
  },
  {
    "username": "towerofcheezah",
    "rating": 6.0,
    "comment": "Weak combat system, factions are fun but the game doesn't seem to work with less than 4. At 3 there was less downtime but way less interaction.\n\nPlayed a ton, would love an in person group but just doesnt lift off unless everyone at the table is all in",
    "timestamp": 1738278000
  },
  {
    "username": "Trachten",
    "rating": 6.0,
    "comment": "Steam",
    "timestamp": 1737932400
  },
  {
    "username": "MUKid",
    "rating": 6.0,
    "comment": "I want to love this more. It's so good. But it's so hard to teach, making it hard to get to the table.",
    "timestamp": 1737846000
  },
  {
    "username": "doerrhb",
    "rating": 6.0,
    "comment": "Giant learning curve. ROI on this one is low unless you play a lot with the same people. IMHO Everdell does the cute forest theme better, and is more fun.",
    "timestamp": 1737586800
  },
  {
    "username": "dmar5000",
    "rating": 5.5,
    "comment": "Raised a bit after playing with the mercenaries",
    "timestamp": 1737586800
  },
  {
    "username": "threhane",
    "rating": 6.0,
    "comment": "Fun, asymmetric, war game with a light theme.",
    "timestamp": 1737414000
  },
  {
    "username": "BG_Geek",
    "rating": 6.0,
    "comment": "Sold",
    "timestamp": 1736809200
  },
  {
    "username": "orthros",
    "rating": 6.0,
    "comment": "So hard to explain exactly why it's fun, but it definitely is.",
    "timestamp": 1736290800
  },
  {
    "username": "feldm1",
    "rating": 6.0,
    "comment": "Need to play again with the right group",
    "timestamp": 1736290800
  },
  {
    "username": "bfrizb",
    "rating": 6.0,
    "comment": "First play around June 2023 with these 4 factors: Birds, Mice/Woodland alliance, Otters (Riverfolk expansion), and Moles (Underworld expansion). I was the Mice/Woodland alliance.",
    "timestamp": 1736204400
  },
  {
    "username": "ToymakerSpring",
    "rating": 6.0,
    "comment": "Played it not totally right, need to retry with better undestanding of the rules.",
    "timestamp": 1736204400
  },
  {
    "username": "LotrScaper",
    "rating": 6.0,
    "comment": "Complexity of asynchronous sides makes for a hard teach. Otherwise, area control with interesting twists that relies heavily on other players playing well.",
    "timestamp": 1735945200
  },
  {
    "username": "Armandocassiano1",
    "rating": 6.0,
    "comment": "I don’t have, or will have the group to play it.\nToo painful to teach newcomers every time",
    "timestamp": 1735686000
  },
  {
    "username": "Grumdy",
    "rating": 6.0,
    "comment": "I didn't find the rules as overwhelming as so many critics say. Sure, each faction plays differently, but it was simple enough to learn them all. The variety in the factions is Root's greatest strength.\n\nWhat kills this game for me is that it's bad at two players, and I'm completely uninterested in backfilling the game with the clockwork factions.",
    "timestamp": 1735513200
  },
  {
    "username": "shmonkey",
    "rating": 6.0,
    "comment": "I have played twice. The game definitely needs to be balanced by the players. Both wins were huge turns by the WA and Vagabond. For the best experience, each player should know the basics about each faction and their relative power curves. Then the real meta game can evolve. This will probably go up in ranking as we play more. Sold because nobody expressed an interest in getting this to the table, and better games (to me) came along and reduced my interest as well.",
    "timestamp": 1735513200
  },
  {
    "username": "hankthetankk",
    "rating": 6.0,
    "comment": "Fun concept. This was my first asymmetrical game and I really enjoyed the art and style. Mechanics were fun. A bit on the laborious side, but fun nonetheless.",
    "timestamp": 1735340400
  },
  {
    "username": "meepersjeepers",
    "rating": 6.0,
    "comment": "Adorable critters doing horrific acts of warfare! What's not to love! My only issue is that I am not a fan of the dice rolling for combat, and this game's competitive mode feels like an unsatisfying match of tug of war at times.",
    "timestamp": 1735254000
  },
  {
    "username": "opks22",
    "rating": 6.0,
    "comment": "iOS version",
    "timestamp": 1735081200
  },
  {
    "username": "quanras",
    "rating": 6.0,
    "comment": "I enjoyed my first few plays of this, but I don't feel like I've truly gotten to know it yet.\n\nThe mechanic choices for each of the factions are really great, and reflect the theme well. (Marquis is a bit boring, but it's good to have one faction that's more straightforward.) The interplay between the players, and the way everyone has to work to keep each other in check works well.\n\nI'm a touch disappointed that VPs were used for the victory condition. I know Cole Wehrle has been making great strides simplifying more exotic game styles to suit the tastes of mainstream board game audiences, and I applaud the effort. But I can't help but feel an asymmetric war game would be more interesting with asymmetric goals. Maybe I just need to wade into COIN territory, and this COIN-light approach isn't quite for me.\n\nI don't think the game really works at 2, but it does at 4. I'd like to try it at 3: the Vagabond is so different from the other factions that he throws some players off - trying it with only 3 factions that are more alike would be interesting.\n\nUnfortunately I don't yet play this often enough to bring the expansion into play.\n\nEdit: I sold this because it's just a bit impractical, and I didn't find all of the factions equally interesting.",
    "timestamp": 1734649200
  },
  {
    "username": "darvid111",
    "rating": 6.0,
    "comment": "Changed from 8 to 6. It’s a bit too conflict dependent for my taste. I have never seen cats win. Art and theme and amazing.",
    "timestamp": 1734649200
  },
  {
    "username": "Short14",
    "rating": 6.0,
    "comment": "",
    "timestamp": 1734649200
  },
  {
    "username": "ogzz",
    "rating": 6.0,
    "comment": "I can see why people love this game, but I don't think it fits my personal tastes. Happy to play, but not going to suggest it",
    "timestamp": 1734476400
  },
  {
    "username": "Punchiiez",
    "rating": 6.0,
    "comment": "Weight: 3.5\nPlayer: 2-4",
    "timestamp": 1734476400
  },
  {
    "username": "tolhs",
    "rating": 5.8,
    "comment": "2024:+1\n\ntbp:30",
    "timestamp": 1733958000
  },
  {
    "username": "neiglib",
    "rating": 6.0,
    "comment": "+ 누구나 혹할 법한 아트웍과 디자인\n+ 확장마다 다양해지는 개성 있는 팩션, 팩션별 메커니즘 또한 컨셉과 찰떡\n+ 플레이어 전원이 룰을 완벽하게 숙지하고 협잡에 거부감만 없다면 궁극의 게임이 될 수 있음\n- 단순 영향력 게임보다는 협잡이 주 요소인 점을 간과할 시 허무한 과정과 결과를 맞이함\n- 제대로 된 플레이를 하기 위해 넘어야 할 팩션별 룰, 잔룰 숙지의 장벽이 너무 높음",
    "timestamp": 1733094000
  },
  {
    "username": "Lulukai",
    "rating": 6.0,
    "comment": "As a medium light gamer. I have mixed feeling about this game.\nThis is the very first game of my board game purchase. To my game group, this game has its special place.\nTo start, it is such a painful experience to learn how to play this game, or how to play this game *right*.\nThough Root opens my eyes to the board game world, introducing me this wonderful and complicated habit. It also scares me with its complexity.\nThe asymmetric fractions provides a lot of replay value and possibility, while also being impossible to learn this game in a single play or teach any new gamers along the way.\nTo be honest, I enjoy paying Root & i think the design is brilliant. Still, I can always feel that tiny uncertainty in me when taking every actions. Till now, after around 10+ plays spread out a year, we still feel like we haven't fully understand all actions of a fraction or the synergy between them. (We played with the same four people, since it is almost impossible to introduce to new player)\nWe still want to add the expansion in near future just to fresh up the game, especially when everything about the look of this game is amazing.\nFrankly, we will never go for games that are more complicated than Root.\n\nUpdate Dec 2024: Sold. Not able to bring to the table at all.",
    "timestamp": 1733094000
  },
  {
    "username": "minitj",
    "rating": 6.0,
    "comment": "1 партия на 4-х.\nИгра сильно ассиметричная и какое-то мнение сформировать по одной партии сложна.\nЯ сам себе заруинил игру сыграв в середине партии карточку меняющую мне победное условие, хотя по очкам победил бы \nОчень сложная для ввода новичков не готовых изучить большой объём правил, т.к желательно понимать правила каждой расы.\n\nUPD:\n\nСыграл ещё 2 партии на четверых.\nКруто конечно, что в игре такая мощная асимметрия и игра за каждую фракцию дарит уникальный геймплей, но всё это слишком перегружено кучей правил и нюансов. Начать играть очень трудно, нужно изучить множество правил, желательно хотя бы немного понимать, что могут делать другие фракции, за один раз это сложно всё запомнить, а в процессе игры каждый ход всплывают различные нюансы, которые размазаны по книге правил. В действиях нету ничего интиутивно понятного, всё нужно искать в правилах, нету понятной иконографики. Первую партию мы поиграли с кучей ошибок и при этом постоянно искали ответы в правилах. Ко второй партии казалось бы нашли ответы на все вопросы, через неделю сыграли ещё и опять возникали вопросы и нюансы, снова приходилось лазить в книгу правил, снова какие-то вопросы забылись, потому что они просто не понятны интуитивно, их надо знать наизусть.\nИгра точно не для нашей игровой ячейки, у нас много различных игр и мы не заигрываем какие-то постоянно, соответственно возвращаться к корням через время это будет очередное изучение правил и копание в книге во время игры. Да и сам игровой процесс не то, чтобы сильно интересный и увлекательный. Никто не был в восторге от игры, полагаю больше мы к ней не вернемся.",
    "timestamp": 1733094000
  },
  {
    "username": "ChocoStout",
    "rating": 6.0,
    "comment": "Very challenging to learn, but worth the effort. Plays best with 4 players - there's a significant decrease in fun with only 3 factions on the table.",
    "timestamp": 1732834800
  },
  {
    "username": "zfairborn",
    "rating": 6.0,
    "comment": "A good game with solid novelty, though it does wear off after a few games and you start to spot optimal moves.\n\nThe community behind it is very good, and the factions are all \"fair\" while being completely asymetrical, and the designers have worked hard to make the game Tournament Supported (i.e.: make each faction balanced against each other).\n\nAfter multiple plays though, the game would have more value if it went up to 40 points (instead of 30) as soo often you feel ready to enact your plan, and the game ends via point salad. It would help the factions that need a LIL more time.\n\nStill a worthy game though. I recommend everyone try it at least 3+ times.",
    "timestamp": 1732748400
  },
  {
    "username": "Peekstrom",
    "rating": 6.0,
    "comment": "Experience would be better without Vagabonds. Absolute horror to teach.",
    "timestamp": 1732489200
  },
  {
    "username": "miauna",
    "rating": 7.0,
    "comment": "Braucht Leute über dem Gelegenheitsspieler-Level.",
    "timestamp": 1762124400
  },
  {
    "username": "Paoh",
    "rating": 7.0,
    "comment": "2-4p 12+ 90min\n5-6p w/ exp",
    "timestamp": 1761951600
  },
  {
    "username": "Eldored",
    "rating": 7.0,
    "comment": "Owned (Mobile)",
    "timestamp": 1761606000
  },
  {
    "username": "ygram",
    "rating": 6.5,
    "comment": "Multiple plays: Thus game nails asymmetric play, the fractions feels very different and the ones I have tried was fun.",
    "timestamp": 1761519600
  },
  {
    "username": "ithinkimasofa",
    "rating": 7.0,
    "comment": "this one is hard to rate for me. its a great game, but i've only been able to play it once with a group.... its a bit complicated knowing how each faction works.... my group doesn't exactly like this one so I play it digitally most often.",
    "timestamp": 1761429600
  },
  {
    "username": "bomberleung",
    "rating": 7.0,
    "comment": "2019 International Gamers Award - General Strategy: Multi-player Winner\nBGG31\nVariable Player Powers",
    "timestamp": 1761256800
  },
  {
    "username": "Joerie",
    "rating": 7.0,
    "comment": "Digital\nProf analog\nF. Skinny",
    "timestamp": 1760997600
  },
  {
    "username": "abaloo",
    "rating": 7.0,
    "comment": "Bonne première partie avec la compagnie des Blaireaux (attention à l'équilibrage)",
    "timestamp": 1760479200
  },
  {
    "username": "GrandAt",
    "rating": 7.0,
    "comment": "Played on app",
    "timestamp": 1760306400
  },
  {
    "username": "aleph_",
    "rating": 7.0,
    "comment": "good",
    "timestamp": 1760306400
  },
  {
    "username": "mrssallyintown",
    "rating": 7.0,
    "comment": "Very complicated game, but still pretty fun. The cute art style tricked me into thinking it was a simpler game.",
    "timestamp": 1760220000
  },
  {
    "username": "DevOpsProDude",
    "rating": 7.0,
    "comment": "63.5x88 - 341\n70x120 - 17\n\nPlayed on board game night.",
    "timestamp": 1760047200
  },
  {
    "username": "WadeB1977",
    "rating": 7.5,
    "comment": "Staying below 9 rating until I get a good four player game in. Fun game and lots of player combos but needs 3 players to really jazz the board. Not a great one for our family as it has a bit too much \"gotcha\" for Becky and the kids.",
    "timestamp": 1759874400
  },
  {
    "username": "jorissuurmeijer",
    "rating": 7.0,
    "comment": "It is a good game but for me it just does not hit. Haven't played with the expansions. I just don't like elements like the tabletalk to form alliances and who you should collaborate on sabotaging, not my type of playstyle",
    "timestamp": 1759788000
  },
  {
    "username": "Rolz64",
    "rating": 7.0,
    "comment": "Terrific game. It's just so hard to get it to the table with the right people...",
    "timestamp": 1759701600
  },
  {
    "username": "BarFightBill",
    "rating": 7.0,
    "comment": "Best: 3-4\nOwner: Hanna\nWeekend game",
    "timestamp": 1759615200
  },
  {
    "username": "MrAlza",
    "rating": 7.0,
    "comment": "Rating only applies WITHOUT Vagabond. With Vagabond, c.6",
    "timestamp": 1759615200
  },
  {
    "username": "DaGreenMachine",
    "rating": 7.0,
    "comment": "I like it. The art is cute and the gameplay is intriguing. I don't generally find the strategy of war games fun, but for these asymmetric ones, especially where points matter more than combat, I tend to like them more.\n\nMy main problem with these asymmetric war games is that I do not have any interest in learning to play these games at a high level and the games just feel broken at a low skill level. The factions are SO asymmetric that the games all but require multiple playthroughs with every faction to figure out what you should be doing and for and against various factions. If I loved the game, I can see that adding to my enjoyment, but as a game genre I will play very sparingly, it is a big downside.",
    "timestamp": 1759183200
  },
  {
    "username": "MagisterLudo",
    "rating": 7.0,
    "comment": "Purchased the android version to practice.",
    "timestamp": 1759096800
  },
  {
    "username": "zgabor",
    "rating": 7.0,
    "comment": "Elég jó volt. Kettőt játszottunk vele egymás után, én ugyanazzal a fajjal voltam mindkétszer, így ami elsőre nagyon nem ment, az a másodikra teljesen jól összeért és meg is nyertem a játékot. Persze nem ezért tetszett, de az már az első játéknál is kiderült, amikor nagyon csúnyán kikaptam, hogy azért több van ebben és tipikusan az a játék, amit valamennyire ki kell ismerni és ez nagyon igaz az ellenfelek karaktereire is. A sok teljesen különbözően játszható faj miatt egyébként szinte teljesen végtelen az újrajátszhatósága, ráadásul teljesen más arcát mutatja három, négy vagy akár öt fővel. Nagyon szívesen játszom majd még vele, ha előkerül, jók a karakterek és bőven van mit kipróbálni benne.",
    "timestamp": 1758924000
  },
  {
    "username": "Verrjerah",
    "rating": 7.0,
    "comment": "(Steam version)",
    "timestamp": 1758664800
  },
  {
    "username": "Yellish",
    "rating": 6.9,
    "comment": "Not for me I guess",
    "timestamp": 1758664800
  },
  {
    "username": "Scifi66",
    "rating": 7.0,
    "comment": "Updated this to a 7. It's a fun fantasy COIN type game that is heads-up In fact much more fun than the COIN games I've played to date.. Appreciate the design. Cute animal art camouflages an in your face, bash the leader, take that! game. If you have a stable group that likes to dig into a single title with repeat plays this could be your conflict game. Unfortunately low rotation means this requires significant teach and the game state can be opaque leading to random plays by disengaged players.\n+ Asymmetry in the factions is a massive plus for long term replay\n+ Akin to a COIN game but more simple\n+ Has a satisfying game end if players are experienced\n- Tough teach and it's required every game unless your group is stable\n- Need to read the board state to bash the leader, players can kingmaker if they are not fully cognisant.",
    "timestamp": 1758578400
  },
  {
    "username": "emmakgunnar",
    "rating": 7.0,
    "comment": "A touch too complicated for me to want to play all the time, but can't deny it's a great game.",
    "timestamp": 1758578400
  },
  {
    "username": "ultimoratio",
    "rating": 7.0,
    "comment": "UPDATE: FEB 2024 - still a very good game, but after playing most of the Wehrle's ludography, I found Root to be his oddest design and also the weakest, in terms of depth. AIT, JoCo, Pax Pamir, and even Oath are all better than this\n\n=============================\n\nOne of the best asymmetric game I've ever played. I don't know how I can dive into the COIN genre after playing this.\n\nUnfortunately, the different mechanisms made the game feel solitaire-ish in comparison to other games like the Pax series, or Cthulhu Wars.\n\nI end up preferring Cthulhu Wars with its ease of internalising of the rules, while maintain the depth that the asymmetric factions provide.\n\nIncludes:\nLandmarks Pack\nMarauder Hirelings Pack & Hireling Box\nRiverfolk Hirelings Pack\nExiles and Partisans Deck\nMarauders expansion\nRiverfolk expansion\nUnderworld expansion\nVagabond Pack\nUnderworld Hirelings Pack",
    "timestamp": 1758319200
  },
  {
    "username": "GattoNero25",
    "rating": 7.0,
    "comment": "Grundspiel (4. Edition, Qualitybeast) sowie Flussvolk-, Unterwelt-, Vagabunden-, Exilanten & Partisanen- und Uhrwerk-Erweiterungen.\n\nDazu gibt es Premiumsleeves, Münzkapseln für die Krähen (nebst Reservemarkern) und die originalen Lichtungsmarker aus Resin.\n\nAbgerundet wird das Paket durch Sticker für alle Meeple sowie eine komplette Laserox-Ausstattung und -Crate",
    "timestamp": 1758319200
  },
  {
    "username": "mjhm",
    "rating": 7.0,
    "comment": "2 plays (philly)\nneed to play again, not great group",
    "timestamp": 1758319200
  },
  {
    "username": "peterlevi",
    "rating": 6.5,
    "comment": "4 (3)\n(open)\n\nAmazing art and components, as well as world-building. I so much wanted to like this game. But the gameplay felt mechanical and fiddly. I'll definitely give it more chances though, maybe it will grow on me once I play more times with players who are familiar with the game.",
    "timestamp": 1758060000
  },
  {
    "username": "smwoz17",
    "rating": 7.0,
    "comment": "The only game I have acquired, culled, and required...multiple times...before even playing.\n\n7 years after backing the first kickstarter we finally played Root. Admittedly, the learning curve wasn't nearly as bad as we thought it would be for a game where \"everyone plays by different rules\".\n\nI actually really liked this game. Its absolutely not at its best with only 2 players, which is 95% of our gaming. I can totally see thing being a banger at 4+ players but I don't know if we'll ever get there.\n\nWhile the hirelings make the 2 player game a bit more interesting, they also make the game quite a bit longer...especially if one player is controlling multiple at once.",
    "timestamp": 1757973600
  },
  {
    "username": "AndBobsYourUncle",
    "rating": 7.0,
    "comment": "Need to play more!",
    "timestamp": 1757541600
  },
  {
    "username": "Andr01dx86",
    "rating": 7.0,
    "comment": "Only own Digital",
    "timestamp": 1756936800
  },
  {
    "username": "NairHotel",
    "rating": 7.0,
    "comment": "Really fun, but a very occasional game for me. It's a hard teach and takes a long time to play, but it is a fun experience",
    "timestamp": 1756764000
  },
  {
    "username": "Rolan Snyder",
    "rating": 7.0,
    "comment": "Given the high degree of asymmetry between factions, I doubt they will ever be perfectly balanced, regardless of the number of post-release balance changes.\n\nA pity, too, because if the factions were somehow balanced, then this would be a perfect \"10\".\nAs it is, the cats fare great in 3 player games but suck at higher player counts, given the faction's fixed action economy. Conversely, the Alliance seems to do better with more players, as more players means more movement into Alliance controlled clearings.\n\nAnd the Vagabond always seems to fare well, regardless of player count. Since there's never a reward for attacking the vagabond, as there is sometimes when attacking other factions, anyone attacking the vagabond does so at the cost of losing their own tempo. Additionally, in the current state of the rules, if the attacker is an enemy of the vagabond, the vagabond can score points even as the defender, giving a disincentive to attack him.\n\nI understand that \"balance\" may not be among the designer's chief concerns, and I will grant him that this is an excellent design. But for me, it is paradoxically both very close and very far from perfection.",
    "timestamp": 1756677600
  },
  {
    "username": "mickwood",
    "rating": 7.0,
    "comment": "2-4 players with several expansions and >300 variants. iPad & Steam versions.",
    "timestamp": 1756591200
  },
  {
    "username": "JesusChristIsKing97",
    "rating": 7.0,
    "comment": "Valamiért nekem nem jött át ez a játék, biztos, hogy újra ki kéne próbáljam.",
    "timestamp": 1756504800
  },
  {
    "username": "Kaiho",
    "rating": 7.0,
    "comment": "Root is thematically rich game and its many details contribute to its excelent worldbuilding. Most of the rules in the game are intuitive in relation to the game's ecosystem, but as there are many rules to be remembeted it becomes quite rule heavy game. But it is rewarding to start to understand what opportunities the game has and how strategies may change when different set of factions are used.\n\nCombat is straightforward, and I would say that the real challenge lies in building working infrastructure for your faction.\n\nVictory points makes sense if they are understood to represent how you gain legitimacy in the forest. But there are times when I wish it would have some other victory conditions instead. (Dominance Cards are a good idea, but there should just be more diverse ways to gain dominance.)\n\n*\n\nAt this point Root is very expansion heavy game. I have found myself asking what do certain expansion factions actually add to the conflict described in the base game. That has cooled me off from collecting large amount of expansions (I do own couple, though). While this restraint to buy expansions may be seen as a negative, it has a positive side: there is still enough to discover with the base game's three factions (I don't care about the Vagabond, but see it having some potential in a co-op game against a bot).",
    "timestamp": 1756504800
  },
  {
    "username": "Ctrlalt",
    "rating": 7.4,
    "comment": "A good game that I would recommend to most players. It offers a great experience and showcases high-quality mechanics and artwork.",
    "timestamp": 1756072800
  },
  {
    "username": "AwMar",
    "rating": 6.8,
    "comment": "I love root but the base game alone is not amazing. If it didn't have expansions it would never ever get played. Unbalanced factions and deck, plus the vagabond is not well designed.",
    "timestamp": 1756072800
  },
  {
    "username": "Archimicarus",
    "rating": 7.0,
    "comment": "ROOT has extremely high highs and extremely low lows. Satisfying play necessitates that everyone knows how everyone's factions work, so that the dynamics of intrigue and multi-party area control can bear out beautifully instead of in a way that's plain frustrating. The stars don't align that way as often as I'd like.",
    "timestamp": 1755727200
  },
  {
    "username": "duanewulf",
    "rating": 7.2,
    "comment": "Expansions owned:\nRoot: The Riverfolk Expansion\nRoot: The Underworld Expansion\nRoot: The Clockwork Expansion\nRoot: The Exiles and Partisans Deck",
    "timestamp": 1755554400
  },
  {
    "username": "C_Kilgore",
    "rating": 7.0,
    "comment": "We've only logged one 2p game so far, so no rating as yet -- but it was a blast to play! Definitely felt like the Marquise de Cat had an easier strategic time of it than the ol' birds, but we'll see how things go... Very fun \"dudes on a map\" area control experience, with a great asymmetric twist!\n\nUpdate: We've played one more at 2p and one at 4p, to try out all 4 factions at once -- I have to say, for strategic resource management / area control, it's not as fun as, say, Scythe, and for asymmetric supremacy game, not as thematic as Hegemony... Feels more fiddly than the payoff is worth, but might just not be quite our cup of tea.",
    "timestamp": 1755468000
  },
  {
    "username": "AsianPride842",
    "rating": 7.0,
    "comment": "A game that encourages emergent gameplay in a fully asymmetric system.\n\nToo repetitive with just the base game but becomes increasingly more interesting with every expansion.\n\nRiverfolk, Marauders, and Exiles Deck is just enough variety to make it a truly exciting game for me.\n\nI recommend playing with exactly 2 militant factions per game, as well as no vagabond in 3 player and mandatory vagabond in 5.",
    "timestamp": 1755122400
  },
  {
    "username": "eddieb",
    "rating": 6.5,
    "comment": "deeper than you would think. odd to a fault. could be your favorite or hate it. for me it was what you play so the guy who bought it, stops asking you to play it.",
    "timestamp": 1754690400
  },
  {
    "username": "raitoning",
    "rating": 7.0,
    "comment": "Assymmetry at its finest. Each clan feels so unique to play. The game isn't as brutally dudes-on-a-map as I thought and while you have to be cognizant of where everyone is in order to play properly there is a lot of clan management you have to do as your own thing. I do worry about replayability once you've played each clan a few times though as there doesn't seem to be too too much difference in between games as the same clan.",
    "timestamp": 1754604000
  },
  {
    "username": "Angustina1984",
    "rating": 7.0,
    "comment": "Sicuramente il più conosciuto di Cole ma non il migliore. Il suo essere pulcioso permette di attirare un vasto pubblico ma non è affatto banale. La complessità deriva principalmente dalla significativa asimmetria tra le fazioni. Non tutte le combinazioni sono possibili per presenza di un certo grado di sbilanciamento.",
    "timestamp": 1754517600
  },
  {
    "username": "manuelxhoracio",
    "rating": 7.0,
    "comment": "Es un diseño con muchas limitaciones, porque requiere cuatro personas a la mesa, y una explicación algo dilatada, porque cada facción es diferente. Pero una vez dentro, el juego funciona y te va llevando. Todo esto hace que sea difícil de sacar a la mesa.",
    "timestamp": 1754431200
  },
  {
    "username": "spieleben",
    "rating": 7.0,
    "comment": "150€ Deutsche Version all in",
    "timestamp": 1754344800
  },
  {
    "username": "Doctor_Cowboy",
    "rating": 7.0,
    "comment": "I like the base version of this game quite a bit, but there are some definite downsides, like having to learn the game 4 separate times. I don't think it's very balanced at all, and I think if players don't know to shut down the birds or the Alliance early, there's not much to do to stop them from snowballing. Much harder to win as the cats or the Vagabond. But I DO really enjoy being the tinker with 3 hammers and just building the favor cards to completely nuke my opponents across the board. But... the ability to do that does ruin others' good time.",
    "timestamp": 1754344800
  },
  {
    "username": "YoLYcmqZ",
    "rating": 8.0,
    "comment": "Thoughts: I fell hard for this game, as one does. Looks so fun and demands you buy everything, only to find out you have no one to play it with. Tried to get my wife into it—tried Clockwork, tried Hirelings—nothing worked. Sold most but kept base and Clockwork in hopes I find someone. Resolved that my only plays will be digital, and those are fewer and fewer these days. A heartbreaker.\n\nTag(s): Asymmetric, Area Control, Heavy\nBest Player Count: 3-4, {4}\nRating: 8.5, -0.5\nOwn: Physical, Digital\n+ Clockwork Expansion\n+ Riverfolk Expansion (Digital only)\n+ Underworld Expansions (Digital only)\n+ Exiles & Partisans Deck (Digital only)\n\nFor Sale: $40, including Clockwork.\n(Amazon: $50, GN: $48 | CW sold out everywhere)",
    "timestamp": 1762693260
  },
  {
    "username": "samseite",
    "rating": 8.0,
    "comment": "(+) The asymmetry can be confusing at first, but that’s exactly the selling point. My kids love this game because of the different factions.\n(+) The cute animal theme clearly isn’t for me, but both my son and daughter absolutely love it.\n(?) Balance-wise, I’m not sure the factions are well-tuned. Vagabond and Woodland Alliance feel too strong to me… though I might be wrong.\n\n(-) You’ll need the expansions to make this game a solid 9...the 4 factions in the base game just aren’t enough.\n(-) A bit pricey, at least in my country, for components that are honestly quite standard.",
    "timestamp": 1762690500
  },
  {
    "username": "thebard8",
    "rating": 7.5,
    "comment": "Difficult to rate without playing multiple times. Feels like need to invest a lot of time into it to really get all the asymmetry. Also felt too short. Admittedly all of this is only after one play. Would be open to playing again with another faction.",
    "timestamp": 1762660260
  },
  {
    "username": "GomJabbar",
    "rating": 8.5,
    "comment": "My Rank: 33",
    "timestamp": 1762470000
  },
  {
    "username": "krembo18",
    "rating": 8.0,
    "comment": "Nice game. High quality production. Beautiful drawing on the cards.\nThe rules for each faction and in general don't seem very complex at first.\nBut the combination , which is understanding what is are ways and different aims for the other players & factions really complex things.\n\nI've played first with other exp. players and it was little challenging.\nSeems that it needs at least 2-3 games with different factions to fully understand & enjoy.",
    "timestamp": 1762383600
  },
  {
    "username": "Venetas",
    "rating": 8.0,
    "comment": "Digital",
    "timestamp": 1762383600
  },
  {
    "username": "prestonbiro",
    "rating": 8.1,
    "comment": "I've enjoyed the three times I've played it so far, but it took a long time to get to the table knowing how hard it would be to get started. Asymmetry is one of my favorite style of games because of the replayability and strategy, but unfortunately it seems like its a harder one to teach. My most recent game had two new players, one who got really frustrated going into turmoil as the eyrie, which feels like will make it harder to sell next time. The game also lasted several hours with setup and teaching the game. The individual turns last a long time, especially with new players, but even so with experienced players. But I anticipate playing this game for a while, and I hope it will grow on those around me.",
    "timestamp": 1762383600
  },
  {
    "username": "jann1",
    "rating": 8.0,
    "comment": "Cut throatring and table talk. At first I thought that the smartest wins, but here it's more important to make friends and get out of your enemies radar rather than playing optimally and rushing for victory",
    "timestamp": 1762210800
  },
  {
    "username": "Yves1981",
    "rating": 8.0,
    "comment": "",
    "timestamp": 1762038000
  },
  {
    "username": "Budgetface",
    "rating": 8.0,
    "comment": "1000",
    "timestamp": 1761778800
  },
  {
    "username": "Schenke9497",
    "rating": 7.5,
    "comment": "Knowing the Meta of factions is surprisingly important for this game, as for new players, some factions completely shut down other factions. I'd suggest when playing with new characters, making sure that each faction in play has at least one faction that can counter-play another faction, or they just simply won't have a good time at all.",
    "timestamp": 1761778800
  },
  {
    "username": "Graycat_The_Gray",
    "rating": 8.0,
    "comment": "Own Underworld, Riverfolk, Marauder, Exiles and Partisans Deck, and Marauder Hirelings.\n\nOrdered remaining (non-clockwork) expansions with the Homeland crowdfunding campaign.",
    "timestamp": 1761778800
  },
  {
    "username": "cinnzel",
    "rating": 8.0,
    "comment": "Me parece que a nivel de diseño tiene un gran mérito conseguir que cuatro facciones tan asimétricas puedan generar un ecosistema tan bien entretejido que permitan que una partida se pueda resolver por detalles. Lo recomendaría exclusivamente para cuatro personas experimentadas en juegos tácticos.",
    "timestamp": 1761692400
  },
  {
    "username": "klutzyk",
    "rating": 8.0,
    "comment": "Its a great asymmetric board game with some really unique mechanics. Loved playing with the Eyrie and their decree mechanic. Its a great way to employ a “make your bed and sleep in it” ploy to fully give us consequences for our actions while also balancing out the VP earnings. Played just two games so far (2p) and it seemed like the Marquise just has a bit more advantage with all the VP obtainable from their build actions and the ability to revive downed soldiers with no negative effects like the Eyrie. Should be more balanced with higher counts",
    "timestamp": 1761692400
  },
  {
    "username": "MegaWestWolf",
    "rating": 8.0,
    "comment": "I had a MUCH better experience with this than Vast. Super hesitant to pick this up but very glad that I did!\n\nThat being said, I mainly play this digitally now. I just have very little interest in teaching people how to play. That is too much of a chore.",
    "timestamp": 1761606000
  },
  {
    "username": "Freydey",
    "rating": 8.0,
    "comment": "2-4 Versus",
    "timestamp": 1761343200
  },
  {
    "username": "nickj4",
    "rating": 8.0,
    "comment": "Only played twice, so there's a lot to be learned, but it has me wanting to come back and really figure it out. The asymmetric nature of the game has you scrambling to think of all the possible outcomes.",
    "timestamp": 1761084000
  },
  {
    "username": "netfilterz",
    "rating": 7.7,
    "comment": "I really like the game, the strong asymmetry makes it very hard to get to the table though...",
    "timestamp": 1760997600
  },
  {
    "username": "Smow",
    "rating": 8.0,
    "comment": "Love it. I have played a lot, own few expansions and it still sparks joy. Teaching it is a chore.",
    "timestamp": 1760997600
  },
  {
    "username": "justinjaeger",
    "rating": 8.0,
    "comment": "Been learning this on mobile which I highly recommend for self teaching. Would need to play more and with humans to see if I love it. Definitely a game that needs a few plays before you really get the hang of it",
    "timestamp": 1760911200
  },
  {
    "username": "Termyth",
    "rating": 8.4,
    "comment": "Contexte : nombreuses parties en version physique avec extensions (dans ma collection), uniquement solo multi-handing. Nombreuses parties de jeu en ligne sur application et steam.\n\n+++++ : le plaisir de gagner une partie tendue comme un string, où votre prévoyance a fait la différence. Ou de gagner avec une faction qui peine à se démarquer. Ou d'empêcher un adversaire trop sûr de lui de marquer ce trentième point pour lui repasser devant ensuite.\n+++ : la négociation. Parvenir à convaincre l'adversaire qu'on n'est pas une menace pour mieux arracher la victoire deux tours après.\n+++++ : la rejouabilité. Chaque partie est unique grâce à la multiplicité des factions, des stratégies, des extensions qu'on peut rajouter au jeu,...\n+++++ : les illustrations. Le paradoxe de la guerre dans les sous-bois incarnée par de petits animaux tout mignons et un dessin aux traits innocents.\n+ : le livret d'apprentissage, les règles détaillés du mode compétitif\n+ : le matériel\n++ : un mode solo et co-op qui ont le mérite d'exister et de bien fonctionner...\n- : ...mais qui manquent de quelques règles pour vraiment être au point. On voit clairement que le jeu n'est pas prévu à la base pour ces modes.\n- : le kingmaking, contre-coup de la négociation mais qui ne gâche globalement pas les parties.\n- - : difficile de faire découvrir aux nouveaux joueurs un jeu compétitif aux faction multiples et au stratégies codifiées. J'attends la map \"marais\" de la nouvelle extension pour initier mon groupe à Root, en co-op, pour mieux assimiler les factions tout en gagnant. En version physique en attendant, je me sens seul.\n- : l'équilibre du jeu, impossible objectivement à balancer correctement. Pourtant avec quelques règles évidentes en plus...\n0 : la communauté en ligne, parfois toxique. Mais difficile de reprocher au jeu le comportement des joueurs.\n\n+++++ : Bonus sentimental. Le jeu qui m'a lancé dans le jeu expert\n\nTotal: 27/32 = 8.4/10",
    "timestamp": 1760652000
  },
  {
    "username": "Theravada",
    "rating": 8.0,
    "comment": "\"Cedido\" a Arnau",
    "timestamp": 1760652000
  },
  {
    "username": "PotatoKing_",
    "rating": 8.0,
    "comment": "비대칭의 끝에는 루트가 있다",
    "timestamp": 1760306400
  },
  {
    "username": "JamieMulligan",
    "rating": 7.5,
    "comment": "Fantastic concept and how the asymmetric systems interact is quality and what's not to love about the cutesy artwork and little animal meeples!. Let down by the slightly overwhelming teach which makes it a bit of a chore to get to the table, unless you play with the same players consistently. It doesn't seem to have enough replay value to warrant multiple plays. I played it about 5 times and it's quite fun but the opaqueness of the vagabond being able to churn out 10+ points on a single turn to win the game immediately felt a little off.",
    "timestamp": 1760220000
  },
  {
    "username": "aliakel",
    "rating": 8.0,
    "comment": "@",
    "timestamp": 1760220000
  },
  {
    "username": "brutemong",
    "rating": 8.0,
    "comment": "The game is great, but it was hard to get on the table. Rules were hard to learn and teach.",
    "timestamp": 1760220000
  },
  {
    "username": "Mr Mjeh",
    "rating": 8.0,
    "comment": "A great asymmetric game that definitely rewards repeated plays",
    "timestamp": 1760220000
  },
  {
    "username": "JHunter101",
    "rating": 8.0,
    "comment": "Rating Elaboration:\n\nBase Game Rating (x2): 8.0\n\nMarquise de Cat Rating: 8.0\nThe Eyrie Rating: 8.5\nVagabond Rating: 8.0\nWoodland Alliance Rating: 7.5\n\nFinal Rating: 8.0",
    "timestamp": 1760133600
  },
  {
    "username": "Dumbthumbinc",
    "rating": 7.5,
    "comment": "-base game (new) 8,600\n-3D tokens 13,500\n-stickers 9,000\n-sleeves 2,000\n-draw strong bags 4,500\n-wooden dice 4,000",
    "timestamp": 1760133600
  },
  {
    "username": "YtaiTouf",
    "rating": 8.0,
    "comment": "i juste hope that my wife like its as much as me lol",
    "timestamp": 1760047200
  },
  {
    "username": "barobkat",
    "rating": 7.6,
    "comment": "several expansions, play matts, etc",
    "timestamp": 1759788000
  },
  {
    "username": "mondauge",
    "rating": 8.0,
    "comment": "I like the design a lot, but it suffers badly if people do not lean into balancing the game state (and often it may be my fault). Cannot recommend if at least one person prefers to just play along without paying enough attention to balance (again, could be me).",
    "timestamp": 1759442400
  },
  {
    "username": "Ddyraw",
    "rating": 8.0,
    "comment": "This game grows on me each time I play it. The App has helped me gain further appreciation. Ultimately the teach is a bear and I dont think I need to own it. I do see why people love it though.",
    "timestamp": 1759442400
  },
  {
    "username": "DoctorPhil",
    "rating": 8.4,
    "comment": "review after 10 plays: https://spotifyanchor-web.app.link/e/lY0VDTOaYCb\n\nCriteria (out of 5)\nRules complexity 2\nPlaytime/complexity ratio 4\nStrategic avenues 4\nMechanism strength 5\nThematic integration 5\nVariability 4\nReplayability 4\nFun factor 4\nSolo mode\nPlayer interaction 5\nElement of mastery 5\n\nOverall 8.4 out of 10",
    "timestamp": 1759356000
  },
  {
    "username": "HerbertML",
    "rating": 8.2,
    "comment": "/*#V4*//*stay*/\nnice assymetric funny area control wargame",
    "timestamp": 1759356000
  },
  {
    "username": "Swakers",
    "rating": 8.0,
    "comment": "Has been fully sleeved and inserted",
    "timestamp": 1759269600
  },
  {
    "username": "mhinto",
    "rating": 8.0,
    "comment": "2-4 players. Advanced.",
    "timestamp": 1759096800
  },
  {
    "username": "TheSlushySnake",
    "rating": 8.0,
    "comment": "Woodland Factions-Themed, 'COIN' Wargame.\n3-4 Players. (Best With 4 Players).",
    "timestamp": 1759010400
  },
  {
    "username": "PolarDad",
    "rating": 8.0,
    "comment": "OkieCon 2021, Really liked it. Smoother than Vast. Would buy it if I wasn't downsizing. ...still might...\n\nLast played 2025",
    "timestamp": 1758924000
  },
  {
    "username": "Blowncover",
    "rating": 7.7,
    "comment": "STEAM\n\niOS",
    "timestamp": 1758837600
  },
  {
    "username": "Beer4Dad",
    "rating": 7.5,
    "comment": "7/10 - I want so badly to love this and maybe will some day. I have played a handful of games on the app and once at the table, recently. Right now, I have a middling opinion on Root. I don't love dudes on a map games (strike 1). I don't love wild asymmetry (strike 2). What I do love, is when a game gives you opportunities to use the tools they give you in creative ways. Root definitely presents those opportunities IF you know what you are doing.\n\nThe problem is that I don't think I had fun playing this at the table. It was mostly a frustrating experience of beating my head against the restrictions of my faction while, simultaneously, getting absolutely railroaded. It is hard when a game depends on players to self-balance the ecosystem, especially when there is an experience gulf. That's a rough hole to crawl out of (as far as first impressions go) and I'm not entirely certain I want to invest my gaming time trying to love Root. That said, I'm not done exploring this one just yet.\n\nUPDATE\n8.5/10 - I have seen the light.",
    "timestamp": 1758664800
  },
  {
    "username": "Klaymore",
    "rating": 8.0,
    "comment": "Cool PvP game, playing as the cats is not very fun since you get beat up at the beginning, but the other factions are cool.",
    "timestamp": 1758664800
  },
  {
    "username": "Astronica",
    "rating": 8.0,
    "comment": "Really good asymmetric strategy game. It has quite a few rules which are easy to miss when playing your first games, the fact that you're so asymmetric means as well that it's hard to keep track of everyone. It's definitely a game that gets better with more plays.",
    "timestamp": 1758578400
  },
  {
    "username": "player43572398",
    "rating": 8.0,
    "comment": "Steam",
    "timestamp": 1758405600
  },
  {
    "username": "Kalas152",
    "rating": 8.0,
    "comment": "+ Complete",
    "timestamp": 1757973600
  },
  {
    "username": "blaklyte",
    "rating": 8.0,
    "comment": "Expansion:\n- The Exiles and Partisans Deck\n- The Riverfolk Expansion\n- The Vagabond Pack",
    "timestamp": 1757887200
  },
  {
    "username": "bnoterman",
    "rating": 8.2,
    "comment": "28",
    "timestamp": 1757887200
  },
  {
    "username": "Tommytrudel",
    "rating": 7.5,
    "comment": "Digital app",
    "timestamp": 1757887200
  },
  {
    "username": "Lillisi",
    "rating": 9.0,
    "comment": "Best friendship ender game.",
    "timestamp": 1762690860
  },
  {
    "username": "smriera",
    "rating": 9.0,
    "comment": "Versión digital en Steam. Juegazo. El juego te enseña a jugar poco a poco e incluye escenarios que te obligan a ganar de una forma concreta. Para solitario Steam es genial.",
    "timestamp": 1762470000
  },
  {
    "username": "williamdmp",
    "rating": 9.0,
    "comment": "In perfect conditions (having 4p who all understand the game well) this is my best gaming experience, full stop. unfortunately, it's very difficult to achieve perfect conditions, which knocks it down a few slots.",
    "timestamp": 1762383600
  },
  {
    "username": "simon_dt",
    "rating": 8.6,
    "comment": "I find fascinating the sheer asymmetry of the factions and how they interact in a way that no one clearly run away, in a game in which players have more or less the same experience. I like also that each different mechanics try to reproduce the different concept and character of the factions (capitalistic cats, noble eagles, etc.). That is why for me is always enjoyable play this game and see how the chosen factions tell the story of the woods.\n\nRules or abilities are a lot and sometimes unclear, but it is easy putting them together with more experience under your belt.\nUnfortunately I am not able to set this game on the table as often as I wish. I usually find myself not willing to explain each different faction mechanics and I am afraid that new gamers will get lost in rules and exceptions and won't enjoy all the interactions... Probably I'm just guilty of laziness!",
    "timestamp": 1762124400
  },
  {
    "username": "ismailegler",
    "rating": 8.8,
    "comment": "diplomacy, brutal war, conflict, whatever you need is in this game. not a gateway for war games I guess.\nDefinitely not as cute as it seems. Masterpiece from Wherle",
    "timestamp": 1761865200
  },
  {
    "username": "T_i_f_a_vii",
    "rating": 9.0,
    "comment": "Love this. Really want the solo expansion.",
    "timestamp": 1761865200
  },
  {
    "username": "LuneFox",
    "rating": 9.0,
    "comment": "2-6 игроков, пвп\n❗Владелец: Аня",
    "timestamp": 1761865200
  },
  {
    "username": "gamergenevieve",
    "rating": 9.0,
    "comment": "one of my favorites. i do wish the complexity was as high with just two players so i look forward to finding a copy of the automata",
    "timestamp": 1761692400
  },
  {
    "username": "Cocoabine",
    "rating": 9.0,
    "comment": "9/10: Great game of asymmetric factions vying for power with a cutesy art style, I want it play it much more. The variety and complexity of how all the different factions are used can get tiring explaining to new players, they tend to make the same predictable mistakes over and over, like giving resources to the Otters or ignoring the Vagabond, in spite of warnings, so this game really requires a core group to understand how everything works.",
    "timestamp": 1761606000
  },
  {
    "username": "JGMTFreedom",
    "rating": 9.0,
    "comment": "Players: 2-4",
    "timestamp": 1761519600
  },
  {
    "username": "Jeffs042",
    "rating": 9.0,
    "comment": "Asymmetric woodland massacres. This is a fun and vicious wargame with narratives embedded in the faction designs and beautiful artwork. Great game and cannot wait to play more.",
    "timestamp": 1761429600
  },
  {
    "username": "Chamutetin",
    "rating": 9.0,
    "comment": "De mis favoritos",
    "timestamp": 1761343200
  },
  {
    "username": "invader_sAu",
    "rating": 8.9,
    "comment": "3+4p",
    "timestamp": 1761170400
  },
  {
    "username": "DarceVader1",
    "rating": 9.0,
    "comment": "Amazing game. Only problem is that it doesn't work well with mixed skill and experience levels.",
    "timestamp": 1761170400
  },
  {
    "username": "PBandJellyfish",
    "rating": 9.0,
    "comment": "@SC & @Digital",
    "timestamp": 1761170400
  },
  {
    "username": "antonkartashov",
    "rating": 9.0,
    "comment": "3p, 4p!\n2p - Marquise vs. Eyrie\n5p - w/ The Riverfolk Expansion\n\nComplexity: ●●● (hardcore)\nDuration: 90 mins\n\nA difficult to learn area-control game. A deeply thought-out universe: each faction in the game is so unique that it has its own rules. Having learned the rules of one faction, you can play once, but most likely, “Roots” will seem chaotic to you. In order to play consciously and build a strategy, you need to know all the factions you play against well. Nevertheless, this game is a masterpiece.",
    "timestamp": 1760997600
  },
  {
    "username": "koriakin",
    "rating": 9.0,
    "comment": "Upped 8 -> 9\n\nAfter playing this on app I think this is one of the best games ever made. Only downside is that everybody playing should be really knowing what they are doing and know the rules of eaxh faction. But this game have perfect vibe, strategy, little bit of luck, assymetric play, fighting for the land - I just love it!",
    "timestamp": 1760911200
  },
  {
    "username": "Flow1",
    "rating": 8.7,
    "comment": "Amazing Asymmetrical Game with a very different experience every time you play. A little hard to get into but once you know the rules, it's a crazy well thought through Game!",
    "timestamp": 1760824800
  },
  {
    "username": "ItsMagic",
    "rating": 8.7,
    "comment": "differencing unlocking spreading banishing convincing expandable mastering risky aesthetic fantastical;\nInis??, Game of Thrones? favoured;\nfavoured over Vast: Mysterious Manor?, Kemet: Blood and Sand, Cyclades, Rurik",
    "timestamp": 1760824800
  },
  {
    "username": "BloodWarlock",
    "rating": 9.2,
    "comment": "+ Root\n+ Underworld Hirelings Pack\n+ Marauder Hirelings Pack & Hireling Box\n+ Landmarks Pack\n+ Riverfolk Hirelings Pack\n+ The Clockwork Expansion 2\n+ The Marauder Expansion\n+ The Exiles and Partisans Deck\n+ The Underworld Expansion\n+ The Riverfolk Expansion",
    "timestamp": 1760824800
  },
  {
    "username": "darkk_",
    "rating": 9.0,
    "comment": "The Root's Vagabonds and the Eyrie Dynasty (birds) are the best faction to learn for new players. Root's rulebook and individual factions are in fact a grueling barrier to learning the game; although, if you can completely survive your first game with a person or group holding your-hands through the entirety of the first game, Root will become an instant admiration.\n\nCaptivating ✅\nEngaging ✅\nReplayability ✅\nRules ✅\nQuality ✅\n\nMy BGG Perfect 10?\nAcquired 2+ ❌",
    "timestamp": 1760824800
  },
  {
    "username": "DinkieTinkie",
    "rating": 9.0,
    "comment": "My favourite game.\nBasically the only major flaw is that it really needs 4 players AND those players need to all enjoy and understand root.",
    "timestamp": 1760652000
  },
  {
    "username": "JHristomilo",
    "rating": 8.6,
    "comment": "Se trata de un wargame disfrazado con motivos amables y cuquis. Me enamoré de este juego desde el primer momento. De hecho, supe que lo iba a comprar antes incluso de saber cómo se jugaba.\nEl arte de Kyle Ferrin es maravilloso. Encima, el juego es una pasada. Las facciones son diametralmente distintas y controlar cómo juegan es esencial para dominar el juego. Quizá ese sea uno de sus mayores \"defectos\", que no es fácil tener un grupo que lo domine por igual.\nAún así, un juegazo.",
    "timestamp": 1760652000
  },
  {
    "username": "Treehouse76",
    "rating": 9.0,
    "comment": "all expansions and upgrades",
    "timestamp": 1760652000
  },
  {
    "username": "twimposter",
    "rating": 9.0,
    "comment": "If everyone is close the same skill level it is an amazing experience, otherwise it's not that good. Takes a lot of games to master even just one faction. I mostly play the cats",
    "timestamp": 1760652000
  },
  {
    "username": "kulczon",
    "rating": 9.2,
    "comment": "10\n\nsolo",
    "timestamp": 1760479200
  },
  {
    "username": "Raphael_Splinter",
    "rating": 9.0,
    "comment": "Su único problema es que si quieres jugar con más amigos, todos deben saber muy bien, solo por eso no lo puedo sacar mucho a mesa",
    "timestamp": 1760220000
  },
  {
    "username": "HughCross",
    "rating": 9.0,
    "comment": "a cute looking war in the forest, with lots of table talk, negotiations, alliances and direct conflict. All of my favorite things! highly assymetrical, great for playing but a pain to go through with newcomers.\n\nMy favorite animals are the raccoons so that makes this game even better. Shame that no one likes the trash pandas (although i understand why, they are op). The only flaw i can find is that it rquires a consistent gaming group to really shines and it is a paint to teach due to it's high asymmetry.\n\nIt may be a hot take but i think it's a better game without expansions.",
    "timestamp": 1760047200
  },
  {
    "username": "Bozok",
    "rating": 8.5,
    "comment": "Asymmetric wargame-ish designed by Cole Wehrle. Takes a lot to learn it. King-making (but even more king-bashing) is a big component. I've only played this a few times, and I don't fully understand it yet. So I'm rating this an 8.5 on the suspicion that once I play it a bunch, I'll love it. It certainly seems like it would be my kind of game. Also, need to play with the right people.\n\nI own the digital version on Steam and iOS.",
    "timestamp": 1760047200
  },
  {
    "username": "MoMahili",
    "rating": 9.0,
    "comment": "Keep",
    "timestamp": 1759874400
  },
  {
    "username": "V4d3r",
    "rating": 8.5,
    "comment": "-The Riverfolk Expansion\n-The Underworld Expansion\n-The Marauders Expansion",
    "timestamp": 1759788000
  },
  {
    "username": "DarkJjay",
    "rating": 9.0,
    "comment": "Includes the Riverfolk, Underworld, Marauder, all hirelings, Exiles and partisans and vagabonds expansions. Stored in Folded Space insert.",
    "timestamp": 1759788000
  },
  {
    "username": "BoarderTerrier",
    "rating": 8.5,
    "comment": "11. November",
    "timestamp": 1759701600
  },
  {
    "username": "EljenBGs",
    "rating": 9.0,
    "comment": "Summary:\n+ Interesting mechanics\n+ Fun and complex strategy\n+ Beautiful design\n- Difficult to learn\n- Poor sorting of pieces in container (plastic bags for pieces)\n\nGreat game with lot of player value but it is quite a complex game and requires a lot of games to get used to. Difficult to get others into the game if the aren't dedicated. Great for dedicated game night group, bad for visiting grand parents. If it was easier to get into, it would get a ten. The difficulty does give it increased replay-ability though so it has its positives.",
    "timestamp": 1759528800
  },
  {
    "username": "tjbizzle",
    "rating": 9.0,
    "comment": "I feel like I haven't played this game remotely enough to understand the full depth of it. I have only played with 5 different factions, but that was enough to see how cool it is that factions can be SO different. I love how much action and storytelling happens in such a short gametime. It's awesome that you can play multiple games in a 3 hour session. I still like how Arcs has the option to play without asymmetry and then leans into more with Blighted Reach, BUT if I am feeling a wargame and like I want to learn a new faction, ROOT is that game. The art and components help to draw people that would otherwise be uninterested into the game.",
    "timestamp": 1759442400
  },
  {
    "username": "Brutuz",
    "rating": 8.5,
    "comment": "Can be loaned from neighbours",
    "timestamp": 1759442400
  },
  {
    "username": "MorelliBuendia",
    "rating": 8.5,
    "comment": "With Riverfolk and Marauders expansions.\n\nOnly two plays and both with the vagabond, so the rating is provisional and very likely to go up.\n\nEdit: Rating increased from 7.5 to 8 after trying the birds. Sooooo cool. Excited to play again as the birds and to try the rest of the factions. Rating could easily keep going up.\n\nMogul Scale: 4/D. Hard to rate. Teaching each individual faction to beginners for a first game would be painful. However, learning your individual faction and knowing the very basics of how the rest work is simple enough, and the core shared rules, combat, dominance cards, etc., is very simple.",
    "timestamp": 1759442400
  },
  {
    "username": "Migacz112",
    "rating": 9.0,
    "comment": "2024 print",
    "timestamp": 1759356000
  },
  {
    "username": "Tanhauser69",
    "rating": 8.5,
    "comment": "Hay que jugarlo mucho para cogerle el gustillo, pero una vez se lo coges sube varios peldaños en tu ranking personal. Muy recomendado.",
    "timestamp": 1759356000
  },
  {
    "username": "blake33",
    "rating": 8.9,
    "comment": "If everyone understands the rules, this is a lot of fun - not easy to teach though",
    "timestamp": 1759269600
  },
  {
    "username": "FlareInsonn",
    "rating": 9.2,
    "comment": "It is a very good game, with great art and smooth gameplay. It is not for those who hate complex games, however.",
    "timestamp": 1759269600
  },
  {
    "username": "El_Vis",
    "rating": 9.0,
    "comment": "Sinusoida doświadczeń. Od ulubionej gry po lądowanie na bazarze.\nW stałym składzie z tymi samymi frakcjami ma szansę mocno zaistnieć; bo jednak próg wejścia jest stosunkowo wysoki. Tak czy inaczej na ten moment to naprawdę dla mnie bardzo bardzo dobra gra i mocny kandydat to wszelkiej maści Topek.\n\n+ Plemiona Rzeczne\n+ Podziemia\n+ Talia Banitów i Partyzantów\n+ Paczka Włóczęgów\n+ Maruderzy\n+ Playmaty\n+ Zestaw Elementów 3D",
    "timestamp": 1759269600
  },
  {
    "username": "Prox_u",
    "rating": 8.5,
    "comment": "The theme of the game is fantastic. 2 player matches can be a bit stale but they are a lot faster. Game requires a lot of reading but once you get over that hurdle it’s a deep and fantastic asymmetric game. Some factions are weaker than others but that doesn’t mean you can’t win or screw with others. Overall fantastic strategy and conflict game 8.5/10",
    "timestamp": 1759183200
  },
  {
    "username": "VietcongSlav",
    "rating": 9.0,
    "comment": "Game becomes 10/10 with expansions (more factions and ADSET)",
    "timestamp": 1759096800
  },
  {
    "username": "Matteo32",
    "rating": 9.0,
    "comment": "bellissimo",
    "timestamp": 1758924000
  },
  {
    "username": "Robert Osvalds",
    "rating": 9.0,
    "comment": "Innovative and brilliant.\nRich in theme and mechanics.",
    "timestamp": 1758837600
  },
  {
    "username": "QuI4ViC",
    "rating": 9.0,
    "comment": "It is a game with beautiful art, but do not be fooled, you must read a lot, have good strategies, understand the different factions, and yet it is very, very fun.",
    "timestamp": 1758751200
  },
  {
    "username": "kwalzl",
    "rating": 8.9,
    "comment": "7B",
    "timestamp": 1758664800
  },
  {
    "username": "Ferns",
    "rating": 10.0,
    "comment": "Great theme and art along with fun mechanics. Can be difficult to bring to the table and is challenging to teach. Requires repeated play. I find myself most often playing the digital edition online, but getting to set up my tabletop copy is a treat.",
    "timestamp": 1762691820
  },
  {
    "username": "pintman",
    "rating": 9.5,
    "comment": "Wunderschönes artwork und ein extrema assymmetrisches Gameplay machen dieses Spiel zu etwas ganz besonderem. Leider funktioniert es nur mit vier Personen, die sich in ein komplexes Regelwerk einarbeiten wollen.",
    "timestamp": 1762639020
  },
  {
    "username": "Therayofhope",
    "rating": 10.0,
    "comment": "It’s hard not to give this game a perfect 10. To me this game feels completely different at different player counts. I enjoy it at all player counts and because of the different fractions and players involved - they can feel so different. And the fractions also work in extremely interesting way. The player experience and interaction can easily spice things up in a game. I have had really wonderful experience playing root. It’s a game that will be in my top 10 of all time.",
    "timestamp": 1762470000
  },
  {
    "username": "DarkOyster",
    "rating": 10.0,
    "comment": "I found Root in a local game store, I had never heard of it before but I liked the art and the brief description. After just a few games, I bought all the expansions and can not get enough. What is so fun about this game, is there is such a huge variety of play styles, intricate systems, a deep strategy. There is some luck in card draw, but dice rolling minimal. Everything is so well thought out, each game is so different, each combination of factions requires unique strategies. Everything is quality, from the pieces, the art work, the packaging, and nothing feels like unnecessary fluff when it comes to the expansions.\n\nTwo downsides, its a tough teach, and it works best at 4 people, so it can be hard to get to the table with a good meta.",
    "timestamp": 1762210800
  },
  {
    "username": "Talyth",
    "rating": 10.0,
    "comment": "+ Root\n+ La Compagnia del Fiume\n+ Il Mondo Sotterraneo\n+ Predoni e Cavalieri\n- Homeland\n\n+ Kit del Vagabondo\n+ Kit delle Meraviglie\n\n+ Esuli e Partigiani\n- Squires and Disciples",
    "timestamp": 1762210800
  },
  {
    "username": "mothertruckin",
    "rating": 10.0,
    "comment": "This game has style and substance. I've been quite impressed with the rulebook and learn to play book - well done. Actually playable in under 90 min with four. I'm pretty sure this game is in my all time top 5, especially with the first couple expansions.\n\nUpdate: over 500 plays and still loving it.\n\nFavortie factions:\nAlliance\nVagabonds\nCorvids\n\n*Top 5 all-time game.",
    "timestamp": 1762210800
  },
  {
    "username": "tobytoast",
    "rating": 9.5,
    "comment": "After initial uncertainty and complex teaches, this slow-burner is now warbling, meowing and hissing with outrage every time I near the gaming shelf. It dominates my attention, rouses my sympathy and tries to get me to recruit it from the shelf – yet again deposing my intended gaming plans and sending them into turmoil. Masterful game design – give it a Wehrle.",
    "timestamp": 1761865200
  },
  {
    "username": "rywoods",
    "rating": 10.0,
    "comment": "Root is so cool. The blend of factions in the shared space is masterfully constructed. One of the coolest dynamics is that some factions are very much engine-building monsters, while other factions have incremental ways to get points. The former would rather have no disruptions, while the latter wants to disrupt as much as possible. The warring desires create great table talk, but ultimately relies on a solid understanding on what each faction is capable of doing, barring some surprises held in the hands of the players.",
    "timestamp": 1761778800
  },
  {
    "username": "Zronos3008",
    "rating": 9.5,
    "comment": "Torto",
    "timestamp": 1761692400
  },
  {
    "username": "l_Nebulas_l",
    "rating": 10.0,
    "comment": "Granted, Root requires you and those you play with to have played a handful of games to really get the gist of the asymmetrical nature of the game, this game is near flawless. If you are someone that loves to immerse yourself thematically and delve deep into game strategy, this is the one.\n\nI’ve spent countless hours playing and learning every faction, and I can confidently say the experience playing now is so much more rewarding than the first few games you spent simply learning the game. If you want to be able to jump in and expect to know the full scope, this is simply not the game. It takes patience and a willingness to want to get better and have a deeper understanding.\n\nThere is just so much replayability with the variety of factions now, as well as varying strategies for each faction. Huge fan of Leder games and so stoked for theiexpansions. If you can get this to the table with a consistent group, it will be so much more rewarding for everyone in the end. Highly recommend this game to anyone with a patience to learn games.",
    "timestamp": 1761429600
  },
  {
    "username": "faalavia",
    "rating": 10.0,
    "comment": "Absolute gem of a game",
    "timestamp": 1761343200
  },
  {
    "username": "Ofera",
    "rating": 10.0,
    "comment": "What can I say, it's the king of astmetry, this war/cute/heavy game it's my favorita so far",
    "timestamp": 1761256800
  },
  {
    "username": "saoneal",
    "rating": 10.0,
    "comment": "Everyone really needs to know their roles well to compete, so it takes a game or two to settle in (it's also very much a player-regulated system without structural guardrails against a runaway leader); but when everything clicks, this game's brilliance really shines through. The interplay of competing faction goals, the ever-shifting undercurrent of cooperation and betrayal, the mini-puzzles each faction is quietly partaking in (until someone else realizes that stomping through your puzzle pieces will benefit their own). It's transcendent. The complete asymmetry feels so ambitious, yet is balanced by a shared set of core rules and expectations, and tempered by mild combat uncertainty and fairly breezy turns.\n\nThere's the matter of the incredibly rich theme too - a vibrant woodland wonderland that blunts the fact that its mechanisms are primarily concerned with blood and empire - the subjugation of a native populace, the burning fires of industry, the rigidity of reactionary traditionalism, the toll of violent insurgency. To be able to capture glimpses of something so dark yet balance it against a fairly cuddly art design is impressive.",
    "timestamp": 1761170400
  },
  {
    "username": "clawdew",
    "rating": 10.0,
    "comment": "The asymmetrical game play lends itself to an extremely interesting and dynamic game almost every time you play. The only reason this game isn't a 10 is because I can't get it to the table as much as I would like, and it is a difficult game to help people truly understand since they not only need to know their faction, but the also\nhow the other factions play to truly have a chance at winning.",
    "timestamp": 1761170400
  },
  {
    "username": "lostboyy",
    "rating": 10.0,
    "comment": "40 plays in half of them at two player and we cant play enough, I still love this game without any of the expansions !",
    "timestamp": 1760911200
  },
  {
    "username": "Alex_P_",
    "rating": 10.0,
    "comment": "Best game I know of. Excellent use of asymmetry, insane depth and variability with straightforward core rules, Will never get tired of this, my favourite game by a margin.",
    "timestamp": 1760911200
  },
  {
    "username": "beatlesboy67",
    "rating": 10.0,
    "comment": "Phenomenal game—four specialized base character critters each with a fun play loop.",
    "timestamp": 1760911200
  },
  {
    "username": "Grumpy_Cat",
    "rating": 10.0,
    "comment": "An amazing asymmetric experience! Would highly recommend.",
    "timestamp": 1760824800
  },
  {
    "username": "grayzilla",
    "rating": 10.0,
    "comment": "All cards are sleeved.",
    "timestamp": 1760738400
  },
  {
    "username": "ihavecheckmate",
    "rating": 10.0,
    "comment": "Root is the best game I have ever played. First introduced to it by my friend, I quickly became obsessed. 10/10 experience, I would pay 5x the price they charge for this.",
    "timestamp": 1760738400
  },
  {
    "username": "Beanreaper",
    "rating": 9.5,
    "comment": "One of my first major board game buys. Love war games and the player interaction that comes from it. Love the theme, rules and assymettry.",
    "timestamp": 1760565600
  },
  {
    "username": "Auroric",
    "rating": 10.0,
    "comment": "Root is my favourite game. The asymmetry between factions and how they all interact is an absolutely masterful design. It really is an ecosystem, and seeing the way all these mechanisms crash into each other in a different way every game just keeps me coming back. There's a ton of playstyles possible, even in the base game, and the political sandbox it provides allows for an incredible depth of varying approaches. All the expansions are fantastic, and there's genuinely infinite combinations of factions, maps, hirelings, card combos etc. It's pure interaction, both negative and positive, while still allowing for non-confrontational attempts. Every single game I look at this never before seen setup with glee. Kyle Ferrin's art is amazing here, and the screen printed meeples are perfect, although I do wish the faction boards were dual-layer.\n\nIs it hard to learn? Certainly. Is there king making? Of course; that's a key part of a political war game. Are the factions unbalanced? For sure; this is a feature, not a bug. This gets the ball rolling on table talk from the very first turn, as someone is already in a much stronger position than other players. It's a game that requires multiple plays to really come to life. For me this is not a criticism; I keep a lean collection and I love the process of deep diving into one box, but this is not a game for everyone.\n\nI guess my main critique is that Root is not made for low player counts. I'll play at 3, but 4-6 (with expansions) is where it shines. Root is best at 6, I'll die on that hill. Oh, and it can be sensitive. When players aren't willing to bash the leader, or decide to pick on a losing player who's help is needed in the rest of the woodland, the game's balance can get thrown out of whack, leading to runaway leaders, and disappointing first experiences. Not a problem with experienced players, but worth mentioning. This is a highly interactive game, so that comes with the territory. It also means online play is often terrible, because no one uses the chat.\n\nOverall I can't say enough good things about Root, it really deserves all the hype that it's gotten; it's a brilliant game. I'll continue to pick up every expansion that's released, and I'll continue to look forward to exploring it after many, many plays. I even like the vagabond, no house rules needed.",
    "timestamp": 1760565600
  },
  {
    "username": "WoodlandSquire",
    "rating": 10.0,
    "comment": "Peak",
    "timestamp": 1760479200
  },
  {
    "username": "Gwen_stuffs",
    "rating": 10.0,
    "comment": "Capitalism captures us all!",
    "timestamp": 1760479200
  },
  {
    "username": "uzeeyo",
    "rating": 10.0,
    "comment": "Not an easy game to teach. Once you get going though it's a blast. I've played at 2 and 5 players and I definitely prefer the bigger play counts.",
    "timestamp": 1760306400
  },
  {
    "username": "domind",
    "rating": 10.0,
    "comment": "Love this one",
    "timestamp": 1760306400
  },
  {
    "username": "Beercy",
    "rating": 10.0,
    "comment": "Okey I'll be honest I am big Leder Games fanboy and Root is partially the reason for that. As someone who is well addjusted to assymetric fractions form other board games and pc games like heroes of might and magic I find the amount of possibilities in this game truly incredible.\n\nAll the fractions feel very different, some might seems stronger or way more advanced but in reality the board politic makes it even out. The game thanks to different fractions, maps, decks, landmarks and such makes it truly such a differnt expiriance. I mostly played on basic setup, lately we play with my friends in advance setup and it's another amazing oppotunity for different play patterns.\n\nThe amount of depth in this game is enourmous. It's just fun to plan, scheme, try to talk other players to punish someone else while taking a lead. It's just great amount of fun with such an amount of interactiosns. I'll be honest I am biased. This game is just for me and I will be glazing it. For me it's an easy 10. Waiting for the new expansion to come into my way.\n\nAs the addition there is great PC version and Mobile version for those who fancy it that way. I enjoy making challange maps on breaks from work and such so it's a nice addition",
    "timestamp": 1760133600
  },
  {
    "username": "Sketcherrrr",
    "rating": 10.0,
    "comment": "Birds and badgers and bears (hiringlings), oh my!\n\nI have over 100 games of this played on the app and a few dozen with my phsyical copy.\n\nAssymetry, politics, combat, strategy, and cut throat combat all mixed into one.",
    "timestamp": 1759960800
  },
  {
    "username": "Indiana__Jones",
    "rating": 10.0,
    "comment": "Simplemente, EL MEJOR JUEGO DE LA HISTORIA. El mejor juego que jamás he visto. Así de sencillo. Con expansiones, un 11 sobre 10. Cada facción es un mundo completamente distinto que ya da para explorar diferentes estrategias en varias partidas, por lo que con las múltiples combinaciones que se pueden dar se genera que cada partida sea un mundo.\n\nUna obra maestra desde la creación, un juego que es infinito y que agradece cada partida invertida en el mismo para mejorar con cada personaje. Además, están sorprendentemente bien balanceados y todos son equilibrados.\n\n* LO MEJOR: La infinita variabilidad y rejugabilidad gracias a una asimetría magnífica.\n\n* LO PEOR: La brutal curva de aprendizaje y lo extenso de la explicación pueden ahuyentar a muchos jugones.",
    "timestamp": 1759874400
  },
  {
    "username": "Nrgrushap",
    "rating": 10.0,
    "comment": "This game only gets better every play! Creates great table talk and lots of opportunities for player interaction!",
    "timestamp": 1759874400
  },
  {
    "username": "manolios",
    "rating": 9.9,
    "comment": "The best game that i own that hits the right spots in every level.",
    "timestamp": 1759701600
  },
  {
    "username": "brootalatops",
    "rating": 10.0,
    "comment": "Root will never leave my collection. Once you get past learning the individual factions. Gaslighting your friends into believing that someone else is the most prominent threat and that we should all gang up on them to break their scoring engine, while you slip by for the win is where this game shines. When everyone has this understanding and everyone is doing it at the same time leads to hilarious table shit talk.",
    "timestamp": 1759615200
  },
  {
    "username": "rdavidh91",
    "rating": 10.0,
    "comment": "This was my first game right after I got interested into the hobby. It's such a fun a deep game. Love to play it every time friends come to our house.",
    "timestamp": 1759528800
  },
  {
    "username": "logopolys",
    "rating": 10.0,
    "comment": "War Game\n\nA beautiful asymmetrical game that involves such distinct gameplay experiences that it's remarkable that it all fits together. And yet: the intersections of the four separate rulesets are so intuitive that you never worry about how interaction works. Everyone has a clear personality, with the Cats taking a clear COIN role, the Birds and the Woodland acting as insurgents, and the Vagabond acting as a balancing force to stop runaway leaders but can become a runaway leader itself. The game is ripe for diplomacy and tabletalk, and there's a wealth of opportunity for variability. I've seen the game identified as COIN adjacent (and I've even just used that vocabulary myself), but it doesn't quite scratch the same itch for me; this will have a separate place in my collection.",
    "timestamp": 1759356000
  },
  {
    "username": "Tychose",
    "rating": 9.5,
    "comment": "E raptor insert",
    "timestamp": 1759269600
  },
  {
    "username": "Kabuki_Kult",
    "rating": 10.0,
    "comment": "Definitely one of my favorite board games.\nThe asymmetry of the different factions give it a nice amount of replayability as well as tactical diversity.",
    "timestamp": 1759269600
  },
  {
    "username": "ViktorPersson",
    "rating": 10.0,
    "comment": "My all time favorite game. The artwork is great. The asymmetry is better than anything I've seen. Hard to teach, but once you've got going, it plays great! So cosy, cute and awesome at the same time!",
    "timestamp": 1759269600
  },
  {
    "username": "Fraidei",
    "rating": 10.0,
    "comment": "My favorite board game so far. Super fun to play with many players (4+). Somewhat still enjoyable at lower player counts (with expansions)",
    "timestamp": 1759096800
  },
  {
    "username": "Crow_Theater",
    "rating": 10.0,
    "comment": "I can't say enough about this real gem. It playes in another league of boardgames.\nBut beware of the asymmetrical design, it takes long enough to teach each player a faction. So prepare real gamers!",
    "timestamp": 1759096800
  },
  {
    "username": "P3te",
    "rating": 10.0,
    "comment": "Landmarks Pack, Marauder Hirelings Pack & Box, Riverfolk Hiremings, Clockwork Expansion, Clockwork expansion 2, Exiles and Partisans Deck, Marauder Expansion, Riverfolk Expansion, Underworld Expansion, Vagabond Pack, Underworld Hirelings Pack",
    "timestamp": 1758751200
  },
  {
    "username": "Mightsrain",
    "rating": 10.0,
    "comment": "Played with all expansions",
    "timestamp": 1758664800
  },
  {
    "username": "Corvolleo",
    "rating": 9.5,
    "comment": "Great game, great style!",
    "timestamp": 1758405600
  },
  {
    "username": "Gatsu97",
    "rating": 9.5,
    "comment": "Production Quality 5/5 - very nice meeples and overall high production value\nTheme 4/5 - Though practically a war game it is disguised under a whimsical coat of art and every factions ability is quite fitting under the setting\nComplexity 4/5 - heavy\nInteractivity 5/5 - highly interactive although varies a bit depending on the faction\nReplayability 5/5 - different factions and learning the different strategies provides great replayability\n\n+ truly unique and interesting asymmetrical factions\n+ great quality and charm\n+ lots of strategy and exciting interactions\n+ helpful and expansive rules/materials\nneutral point: while it is playable at 2 and enjoyable at 3, the game truly shines at 4\n- the core mechanics are easy to understand but altogether the game is still overwhelming\n- it is hard to keep track of what the other players are doing and what their goal is",
    "timestamp": 1758319200
  },
  {
    "username": "Abelardo_Blue",
    "rating": 10.0,
    "comment": "I need to get the expansions.\n\nOne of my top 10.",
    "timestamp": 1758319200
  },
  {
    "username": "somniumsomno",
    "rating": 10.0,
    "comment": "BEST GAME I EVER PLAYED.",
    "timestamp": 1758146400
  },
  {
    "username": "Goplay92",
    "rating": 10.0,
    "comment": "Stupendo",
    "timestamp": 1758060000
  },
  {
    "username": "Guilive",
    "rating": 10.0,
    "comment": "Favorite asymmetric game",
    "timestamp": 1758060000
  },
  {
    "username": "Gruglede",
    "rating": 10.0,
    "comment": "Love this game so much",
    "timestamp": 1758060000
  }
]