[
  {
    "username": "zmartianov",
    "rating": 1.0,
    "comment": "Not all the groups that were part of life at the time are represented",
    "timestamp": 1754604000
  },
  {
    "username": "ultimoratio",
    "rating": 1.0,
    "comment": "UPDATE: Mar 2022\n\nThe game is too linear and tactical to the point that it gets boring. Going for any strategy doesn't lead to any significant difficulty on achieving them.\n\nI'm consider if I should downgrading it to 1 star\n\n============================\n\nFor a heavy game, Great Western Trail is pretty pleasant. It doesn't make me overload with the processes \"Oh before I can do this, I have to do X and Y, but before I can do X, I have to do Z\". No. None of that regimental malarkey.\n\nAnd the game makes the ending satisfying. Having staff in your personal player board. Cows in your deck. Deliveries reaching San Francisco and your train reaching far. The game doesn't feel soulless.\n\nThe game is still a very solitaire experience. It lacks player interaction though, and lack of the playful jabs you can do to your friends, unlike Mombasa. Indeed, while the game has buildings in which everyone travels on, I don't really care with everyone's moves.",
    "timestamp": 1736722800
  },
  {
    "username": "muzrobertson",
    "rating": 1.0,
    "comment": "Overlong multiplayer solitaire, laden with a theme that makes no sense whatsoever. A tedious excess of moving parts.",
    "timestamp": 1736290800
  },
  {
    "username": "utahman06",
    "rating": 1.0,
    "comment": "Superseded by 2e. No need for this to occupy any prominent place in rankings.",
    "timestamp": 1727820000
  },
  {
    "username": "theCrabbyDice",
    "rating": 1.0,
    "comment": "Crabby Dice Game 12",
    "timestamp": 1723068000
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "Why is the train going west? And then straight into the ocean where someone scores points.",
    "timestamp": 1722549600
  },
  {
    "username": "5mokus",
    "rating": 1.0,
    "comment": "Tactical \"1\"\nThe new version is strictly better.",
    "timestamp": 1707260400
  },
  {
    "username": "Tolio",
    "rating": 1.0,
    "comment": "fantastic game, second edition is better and i hate that first and second editions both have a separate rating in bgg. so first editions get a 1.",
    "timestamp": 1691704800
  },
  {
    "username": "Buszmanos",
    "rating": 1.0,
    "comment": "The best of Alexander Pfister so far, Boonlake is much worse, Maracaibo not bad =D",
    "timestamp": 1690840800
  },
  {
    "username": "sten77380",
    "rating": 1.0,
    "comment": "Pister n’est décidément pas un auteur pour moi.\n\nJe vais arrêter d’insister. C’est tout ce que je déteste, ma découverte fut un calvaire.",
    "timestamp": 1679785200
  },
  {
    "username": "Rednas79",
    "rating": 1.0,
    "comment": "Game length is to long to make it an ok game\nFor the rest it is pretty dry and boring.\nGame is way overrated.",
    "timestamp": 1666648800
  },
  {
    "username": "AdeMaui",
    "rating": 1.0,
    "comment": "Endless game…",
    "timestamp": 1642287600
  },
  {
    "username": "KaoX10",
    "rating": 1.0,
    "comment": "Most boring game i have ever played, and even though some call it Deck builder it is definitely not a deck builder.",
    "timestamp": 1615762800
  },
  {
    "username": "Nomorepiratedgame",
    "rating": 1.0,
    "comment": "For working with Yoka, a company known for its plagiarism of Bang!",
    "timestamp": 1607554800
  },
  {
    "username": "Mayasty",
    "rating": 1.0,
    "comment": "The first game in my life I didn't know what to say. I felt overwhelmed with all these details (enhanced by extension). Another extremely sophisticated solitaire for few players. No interaction, no fun. Collecting victory points from hundreds of options without any interaction with others is not my story. It might be even better to play it solo to reduce huge downtime. Too many elements that work together without sense (e.g. train and all its rails). Very boring.",
    "timestamp": 1550617200
  },
  {
    "username": "beri2",
    "rating": 1.0,
    "comment": "Much, so much, too much, way too much stuff. Feels like a game with 12 expansions included. My reference of game design clunkiness.",
    "timestamp": 1522879200
  },
  {
    "username": "Biscotti",
    "rating": 1.0,
    "comment": "Nothing wrong with game. I'm sure its a splendid affair. However after watching run through and or reading reviews, absolutely no desire to play.",
    "timestamp": 1481238000
  },
  {
    "username": "orange",
    "rating": 2.0,
    "comment": "first impression, lukewarm. it had a solitaire feel. strange mixture of a game. while managing your deck of cards, you are going round and round a board, visiting buildings that enable you to build more buildings, pay for and acquire more cards, acquire helpers you put on your player board, advance your engine on a track, that allows you to develop your player board and also score endgame points, acquire tiles that score endgame points and acquire money. the elements are nicely meshed together, and provide stuff to think about and replayability. There is some competition for stations on the engine track, for better places to build on the board, for getting cheaper helpers and for higher value tiles, but there is always something to do and your actions seem incremental, I never felt, that if my opponents take something away I could lose, so did not need to keep a close eye on what they were doing. I do not like the deck building element and the somewhat repetitive nature of the game.",
    "timestamp": 1746223200
  },
  {
    "username": "yiechow",
    "rating": 2.0,
    "comment": "The designer is well-known by various methods of gaining scores. Unfortunately, I barely experienced that during playing. Even more hilarious, I received a penalty which I have to move my train backwards for discarding my hands in a DBG thematic game.",
    "timestamp": 1715205600
  },
  {
    "username": "JFinkeldey",
    "rating": 2.0,
    "comment": "Edit - after numerous (unlogged) multiplayer and solo games I can appreciate the design and gameplay, but am simply terrible at the game and get no enjoyment whatsoever out of playing it.",
    "timestamp": 1702249200
  },
  {
    "username": "nraw",
    "rating": 2.0,
    "comment": "1 hour wasted on setup and rules. 2 hours wasted on doing something with cows. Gave up half way through by acknowledging I have invested more thoughts into cows in the last two hours than I would have ever considered to devote to this topic in my lifetime. MOO this game away from me please. Why do people play this anyway? The only purpose of my friends playing the game with me was so that they can make the map more annoying. It's either no interaction or a negative one. I'd rather play a round of slapping each other and people would still be more happy about each other's presence.",
    "timestamp": 1668898800
  },
  {
    "username": "illusionDS",
    "rating": 2.0,
    "comment": "boring eurotrash\ntoo many engines and not enough turns to develop them, like most eurotrash.\ndrop the rail, buildings, and \"northern map\" and just let me run cows",
    "timestamp": 1665698400
  },
  {
    "username": "Volodymyr_Bilodid",
    "rating": 2.0,
    "comment": "That was too complicated. Path growing during game made this experience too bad.",
    "timestamp": 1657576800
  },
  {
    "username": "Pura_Vida",
    "rating": 2.0,
    "comment": "Playing cowboys as if all was fine in 19th century America. Gameplay is too much of everything anyway.",
    "timestamp": 1654293600
  },
  {
    "username": "Legomancer",
    "rating": 2.0,
    "comment": "In Great Western Trail, you are a cattle rancher, driving your stock from Texas to Kansas City. You have to get them through hazards, do some canny cattle trading along the way, hire hands to manage the stock, and hope for a big payday once you get to the end of the trail!\n\nAnd you build buildings. You make buildings or towns or something along the way, because that's what cattle ranchers did, they built towns and such and hired workers to help build them. I guess? Look, just focus on the cattle drive for the moment. We need to get to Kansas City!\n\nAnd build a railway. Because the goal of a cattle drive was to go to a city that didn't have a railway and construct one. And along the way you'd traditionally build stations, which you could then man with your train engineers, builders, or cowboys. Cowboys were all the time leaving the profession in order to become station agents. Look it up.\n\nIn addition to these tasks that your basic ranchers had to perform, they would also create and then clean up hazards, trade with natives, and manage an employment office. The life of the average rancher was full of diverse responsibilities.\n\nWhat I'm trying to say here is that GWT is a thoroughly modern board game trading on the latest trend: more is more. Why merely put the players in a single, well-defined, approachable role when instead they can play as, I don't know, \"The Spirit of the Western Frontier\" or something. Why give a clear goal -- you're looking to make your fortune driving beeves to market -- when you can instead provide ELEVEN different scoring categories to sum up? Why give a bonus for trading with natives when you can have two different kinds of natives for no reason other than more natives is better? Why make a game that can be taught and learned easily when you can instead add unnecessary wheels and levers and gears in the name of \"depth\"?\n\nThere's a good and interesting game hidden inside of GWT, but it's buried under a lot of -- well, there's a thematic element I could say it's buried under, but why commit to a theme now? Instead you're given a myriad of options and paths, but no method for really exploring any of them. If you're trying to do the thing the game is ostensibly about -- sell cows -- you're going to want a lot more hand/deck management than you're allowed. If you want to build buildings, you have to make a lot of money, which means you have to sell cows as well. If you want to run a railroad, that's great, but you're going to have to do other things to score some points. And of course the objective cards want you to do a little of everything because focus? We don't need no stinkin' focus.\n\nI'd like to really like GWT, but like so many current board games, it collapses under its own weight. So much incoherent nonsense has been added in that playing the game is less fun than frustrating, mostly because you're not competing against the other players but against the design of the game. Too many times it wasn't other players that were my issue (at least not by their intention) but because the game was asking me to do something convoluted that required the precise alignment of stars to get right.\n\nAn editor with a red pen could have made this into a really great game. Instead we got yet another flavor of the week puzzle box that will be long forgotten when the next such game comes out. It'll get bought, learned, played a couple times, then hang out on a shelf for the rest of its life, constantly getting passed over because, \"I don't even remember how to play that.\"\n\nupdate: played it again after many years since my first play and can report that it still sucks. downgrading to a 2 because it makes me so furious that this trash is in the top 20.",
    "timestamp": 1652306400
  },
  {
    "username": "Peter Loftus",
    "rating": 2.0,
    "comment": "A mess of poorly integrated mechanisms. Not my idea of fun at all. The train track at the end is the pits.",
    "timestamp": 1651788000
  },
  {
    "username": "SaphariGames",
    "rating": 2.0,
    "comment": "Mechanically a 7\n-5 rank for whitewashing and trivialization of the genocide of indigenous peoples",
    "timestamp": 1650405600
  },
  {
    "username": "dogzard",
    "rating": 2.0,
    "comment": "The idea of the game is ok, but the execution is so cumbersome. The different mechanics are OK, but they don't mesh into a cohesive whole. The rulebook is hard to read, and some info isn't even in the base rulebook. Overall, an abundance of confusion, ennui, a numb keister, and a decided lack of fun. Plus, the game is just designed to take too damn long. 4 hours on 1 game is just too much. By the end of it, I'd already checked out. I've lost my taste for this one permanently.",
    "timestamp": 1630274400
  },
  {
    "username": "the bilge rat",
    "rating": 2.0,
    "comment": "another boring mixed bag of mechanics not related to the theme (e.g. why do my cows have to be different - that makes f. all sense), plus the theme is so dull, but I understand why this mostly usa site gets their jollies from it. and isn't the train running the wrong way?\n\ngreat western fail.",
    "timestamp": 1628892000
  },
  {
    "username": "Nilssonius",
    "rating": 2.0,
    "comment": "Played with expansions. Too long, complicated, repetitive. Experienced players dominate. Only liked the cards. Reminds me somehow of monopoly. Not for me. Will not play again.",
    "timestamp": 1622757600
  },
  {
    "username": "YeaHrzOO",
    "rating": 2.0,
    "comment": "5 games in one",
    "timestamp": 1612220400
  },
  {
    "username": "fatpie42",
    "rating": 2.0,
    "comment": "Too long. Too slow. A euro with a deckbuilder awkwardly shoved into it.",
    "timestamp": 1605481200
  },
  {
    "username": "goalum",
    "rating": 2.0,
    "comment": "Nach zwei abendfüllenden Spielen für mich eine Enttäuschung. Das Spiel ist nicht schlecht, mein Spielpartner liebt dieses Brettspiel, mich persönlich konnte das Spiel aus folgenden Gründen aber nicht packen:\n- Ein Feeling fürs Thema kam bei mir nie auf. Es war ein Kuh-Techniker-Handwerker-Bahnhof-Gebäude-Steinschlag-Cowboy-Wald-Indianer-Brei ohne Seele,\n- Ich wusste bis zur Hälfte des Spiels nicht wirklich, wo ich stehe und wie ich meine Position verbessern kann.\n- Als mir dämmerte, dass ich im Hintertreffen war, wusste ich, dass ich für den Rest des Spiels (weit über eine Stunde) dem unausweichlichen Sonnenuntergang entgegenreite... Ein Catchup-Mechanismus fehlt.\n- Spielerinteraktion? Fehlanzeige. Jeder wurste(l)t vor sich hin.\nFazit: No thanks, habe das Spiel meinem Spielpartner geschenkt, er weiss es zu würdigen.",
    "timestamp": 1602194400
  },
  {
    "username": "The Barefoot Killer",
    "rating": 2.0,
    "comment": "I'm going to give this game the most backhanded compliment I've ever given: this is likely the best terrible game I've ever played.\n\nIt's terrible because it's incredibly overwrought, which adds immense breadth but little depth. This breadth makes the game a complete slog to teach (40 minutes from a great teacher!) but then is at heart an incredibly simple game. This is the purest example of everything AS WELL AS the kitchen sink that I can think of. It's a bland buffet.\n\nIt's terrible because the game can take almost three hours but there is never once a feeling of ebb and flow or drama because it is almost impossible to tell who is in the lead at any given time. Because EVERYTHING gets you victory points. So whose multitude of victory points are highest at any given time? *shrug* Though I guess it doesn't really matter because there's nothing you can do to really affect other players, which brings me to...\n\nIt's terrible because I've played few other games that offer so little player interaction. This is multiplayer solitaire at its worst. You could literally play the entire game with only a rare glance at what other people are doing and do just fine. That's forgivable in a game that takes 60 minutes or less but not so here.\n\nIt's terrible because I was excited to play a game with this unique theme of driving cattle but the theme just does not come through. This is how the players talk during the game: \"Ok, I move two spaces. I'm going to stop here and convert this black card into two coins and my second action allows me to do an auxiliary action, so I'll draw two cards... *draws* and discard these two.\" YEEHAAW!\n\nThe most frustrating thing is that I can see sparkles of a great game nestling within this steaming cow patty. This could have been a fun family game if the designer or publisher had just said \"whoa!\" and reined things in. As is, though, I can't imagine this game having much longevity. There's a reason why the Knizia classics had legs. Modern game design needs to look back a little further for its influences. To me, Great Western Trail is the epitome of what is wrong with post-Agricola Euro games.\n\nUPDATE: Currently in the top 10... I stand by my opinion that it is a crap game.",
    "timestamp": 1572476400
  },
  {
    "username": "Hinmatt",
    "rating": 3.0,
    "comment": "It's a mix of mechanisms and a rather heavy Eurogame. There are a lot of different things going on here.\nUnfortunately, I don't like it. The strangest thing for me is the roll and move without the rolling. Your meeple walks along a track, but you can decide freely how far you go within a range the game allows. Sometimes it's better to stay at a spot and build a building. Although there is no rolling and there are different ways to reach your destinations this still feels like an outdated element to me.\nThere is one thing I generally like in this game though. And that's deck-building. Unfortunately, it's only a really limited element of the game.\n\nNot a game for me, but I am not a big fan of heavy Eurogames anyways. But this game somehow feels especially boring for me.",
    "timestamp": 1756245600
  },
  {
    "username": "darkfinale",
    "rating": 3.0,
    "comment": "Game about assembling enough cows, and buying buildings etc, to get points. Haven't played enough.",
    "timestamp": 1744495200
  },
  {
    "username": "Jertlemiah",
    "rating": 3.0,
    "comment": "Yon: \"It'll be great! It takes like 90 minutes!\"\n-6 hours later-\nMe: \"please kill me\"",
    "timestamp": 1744322400
  },
  {
    "username": "Betote",
    "rating": 3.0,
    "comment": "Reseña en español en El dado de Jack:\nhttps://eldadodejack.com/2017/03/30/great-western-trail-im-a...",
    "timestamp": 1740006000
  },
  {
    "username": "BoardGamingCouple",
    "rating": 3.0,
    "comment": "3/5\nGWT 1E: Solid game, but far too fiddly. Takes too much time to setup & teardown. The games runs a bit too long. Not much emphasis on deckbuilding. The rondel is great fun. Not sure about variability.\n\n4/5\nGWT NZ: Another solid entry. Beautiful components, artwork, & a unique setting. The theme isn't super strong. This version offers a ton of variety & replayability. This version pretty much feels like it has an expansion already included. We hate box inserts, but this insert is actually pretty good. The box could have definitely been a bit bigger (won't fit sleeved cards). The game still takes forever to setup & teardown & it is a huge table hog. Really good crunchy point salad game. Love that it is language independent!",
    "timestamp": 1737327600
  },
  {
    "username": "trodat123",
    "rating": 2.5,
    "comment": "what a mish-mash of mechanics... after the first time around you go through the whole actions time after time... I really did not like this game although I actually managed to win once",
    "timestamp": 1736895600
  },
  {
    "username": "aaj94",
    "rating": 3.0,
    "comment": "Bleck. Never has a mess of mechanics felt so disconnected and uninspired. Not even sure why I bounced off this so hard, but it was so bad I feel little desire to go give it a second chance. Others feel it's great, you should probably listen to them and not me.",
    "timestamp": 1734562800
  },
  {
    "username": "kraedy",
    "rating": 3.0,
    "comment": "My friends like it, I don't. I've played five times, and didn't enjoy it once.",
    "timestamp": 1713650400
  },
  {
    "username": "qtzlboardgamer",
    "rating": 3.0,
    "comment": "The aspects of Great Western Trail that are interesting to me do not win the game; the aspects of Great Western Trail that win the game are not interesting to me.",
    "timestamp": 1712354400
  },
  {
    "username": "gramsdad",
    "rating": 3.0,
    "comment": "I'm not sure if its the game or just me on my low rating for this one. I've tried on several occasions to learn it and so far I've been unable to get through the rules without drifting off. I've begin to come to the realization that Euros probably just aren't my style of game. Time to moo ve on!",
    "timestamp": 1705359600
  },
  {
    "username": "Mr_Lolypop",
    "rating": 3.0,
    "comment": "The great western trail. An example of great game design in combination with not enough product testing.\n\nThis boardgame was on my wishlist for some time. It turned out to be a huge dissapointment! I've played it for a full session with fellow boardgame enthousiasts. Not once did I feel like I was enjoying the game. It's complex and there are so many ways to build your engine but nothing in the process of building your engine feels rewarding.\n\nThere is no clear way to see if you're winning the game, there is no feedback to see if you're making right choices. In essence it's a game you get better at with playing it more often. If you're into euro games propably a great fit for you. But for me it felt like a big wast of time, time of my life I'd propably could have spent better. The experience I had was like I was in detention waiting for it to be over. As a 30 year old adult man thats not realy the experience I was looking for.\n\nIn summary I was sitting at the table, looking at the clock hoping for the game to end. Never wil touch this game again.",
    "timestamp": 1694556000
  },
  {
    "username": "AKHawkster",
    "rating": 3.0,
    "comment": "The second edition is a strict improvement on this version. Still a quality game, but my desire to play it has dipped significantly knowing the second edition is out there and better.",
    "timestamp": 1689026400
  },
  {
    "username": "jibibgg",
    "rating": 3.0,
    "comment": "Need to try this again but the overall rondel gameplay was extremely unsatisfying.\n\nEDIT: I really just don't enjoy this game or find it fun. All of the \"fun\" is strangled by the restrictiveness of the game and the constant penalties. Penalised for moving. Penalised for not having your train far enough. Penalised for a poor cow delivery. I actually enjoy \"tight\" games but the loop of this game just isn't satisfying for me. In fact the rondel gets more and more tedious as the game goes on and as the safe spots to deliver to get taken up. As well as that the actions you take on the rondel aren't very interesting since the only thing that matters is your hand at the end. Feels like I'm fighting the game system to do anything fun.",
    "timestamp": 1684360800
  },
  {
    "username": "John Rogers",
    "rating": 3.0,
    "comment": "This feels like the prototypical, modern mid-weight euro. It’s a kitchen-sink of popular mechanisms, a newish (slightly better than pasted) theme, points-salad, rondel-esque, born and bred to be indirect in its interaction, inoffensive in play, and easy on mistakes.\n\nI get why it’s so popular but who said popular was good eh? I feel like the core concept here of herding cattle to cities has potential. Unfortunately it’s buried beneath the banality of disjointed mechanisms and needless clutter. Enjoy spinning plates do ya? Well try it with cows on top in Great Western Trail!\n\nAnd this isn’t sour grapes talking. I won going away 98-84-52 basically going full tilt on buying cattle, cowboys, creating a money engine, and increasing my speed to make multiple deliveries. The owner (84pts) was shocked to see that I got 42pts from my cow cards alone (and maybe that I won at all).",
    "timestamp": 1680386400
  },
  {
    "username": "Krevillen",
    "rating": 3.0,
    "comment": "I think right now I am definitely not a fan of Pfister's games, though some time ago I might have liked them.",
    "timestamp": 1679785200
  },
  {
    "username": "abernath",
    "rating": 3.0,
    "comment": "Very long game that I would play again if others brought it out but would never suggest it. Mechanisms are interesting but I found it ultimately frustrating.",
    "timestamp": 1675983600
  },
  {
    "username": "Sir Pent",
    "rating": 3.0,
    "comment": "Very much a Euro, Rondel-style game with a Western theme of herding cows, extending train tracks, and building a town. There seems to be a few too many moving parts for my taste, and both the cow and building strategies seem unbalanced compared to the train engineer strategy.",
    "timestamp": 1671058800
  },
  {
    "username": "LeapinWeasel",
    "rating": 4.0,
    "comment": "2nd ed makes this redundant in my opinion.",
    "timestamp": 1759356000
  },
  {
    "username": "JohnGrimes",
    "rating": 4.0,
    "comment": "Viel zu lange nicht gespielt!",
    "timestamp": 1750716000
  },
  {
    "username": "baurfamily",
    "rating": 4.0,
    "comment": "Couldn't really say why, but this one didn't click with me. I'd be willing to try it again at some point, though. I don't actively *dislike* the game.",
    "timestamp": 1740956400
  },
  {
    "username": "StevenKiel",
    "rating": 4.0,
    "comment": "Played 3 times, didn't get the hype",
    "timestamp": 1739746800
  },
  {
    "username": "No2Ross",
    "rating": 4.0,
    "comment": "Of all the games that are on the BGG top 100 this one confuses me the most because it's fine. The set up takes a while, and the teach is long for a game which ultimately does not have many rounds to it. The theming of collecting the best hand of cows to sell on a market is nice, but then the gameplay just makes you feel completely divorced from that aspect of the game, as you end up playing a game of real estate bomberman.\n\nPlayed twice.",
    "timestamp": 1739401200
  },
  {
    "username": "azeem",
    "rating": 4.0,
    "comment": "Great Western Fail.\n\nThis game features a number of mechanisms and a number of ways to score points. The game ends up feeling diluted as a result.\n\nI respect any game that punches above its weight class, but it’s hard for me to see the mass appeal.",
    "timestamp": 1738710000
  },
  {
    "username": "Lostrato",
    "rating": 4.0,
    "comment": "Rather would play second Edition. Therefore downvoted.",
    "timestamp": 1736377200
  },
  {
    "username": "Flow25",
    "rating": 3.9,
    "comment": "5 Mini games in one, many small rules and in the end you get a point salad. Would not play this even for money.",
    "timestamp": 1733785200
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 4.0,
    "comment": "I won my first game. I haven't come close since. Challenging game. Neat theme, even though it has some illogical features.\n\nPlayed a game years later, now with the expansion. I was so lost. I will avoid playing in the future. This is not a game that lower skill level players will enjoy when playing against advanced players.",
    "timestamp": 1724709600
  },
  {
    "username": "MoonyCinzia",
    "rating": 4.0,
    "comment": "I don't understand how it can have 8+ as rating. The graphic of tiles and board is horrible. The tiles aren't self explanatory. Usually I get stressed with games that are too quick and I can't get enough rounds to finish all I want. That's not the case. It's long and boring. I wasted 2 hours of my time.",
    "timestamp": 1717192800
  },
  {
    "username": "raafl",
    "rating": 4.0,
    "comment": "Played a couple of times on BGA.\nNot a bad game per se, but very mechanical and themeless. No interesting stories emerge. The trains make no sense. The deck-building is both uninsteresting and nonsensical. I have no interest in playing again.",
    "timestamp": 1712008800
  },
  {
    "username": "Lone Ranger",
    "rating": 4.0,
    "comment": "Three things I don’t like.\nYou will have to look up rules all the time.\nSmall icons you can’t see.\nUneven turns.\nIt last too long.\nI hope I never play This again!",
    "timestamp": 1710543600
  },
  {
    "username": "rjones53",
    "rating": 3.5,
    "comment": "Even with rails to the north seems to still have some big issues.\n\nThe black disc limit screws up the end of the game, especially with rails to the north.\nI can see that it should be harder to place black discs compared to white. But once all black are placed you should be allowed to place white discs on black spaces..\n\nThere is also a runaway leader issue with no real catchup mechanism.",
    "timestamp": 1703113200
  },
  {
    "username": "Minarchist",
    "rating": 4.0,
    "comment": "I don't get why this game is so popular, but most people love it. I find it long, fiddly, and overly complicated for the strategic decisions to be made.",
    "timestamp": 1700607600
  },
  {
    "username": "hiimjosh",
    "rating": 4.0,
    "comment": "See comments for 2nd edition",
    "timestamp": 1699398000
  },
  {
    "username": "KingsElite",
    "rating": 4.0,
    "comment": "Shockingly boring. I don't see the appeal here.",
    "timestamp": 1681855200
  },
  {
    "username": "LordTengil",
    "rating": 4.0,
    "comment": "DOes nothing to tickle me.",
    "timestamp": 1680213600
  },
  {
    "username": "RobooWoo",
    "rating": 5.0,
    "comment": "Czekam na Second Edition...",
    "timestamp": 1762470000
  },
  {
    "username": "Webbe",
    "rating": 5.0,
    "comment": "Nice game.\nAfter 6 plays I'm feeling a bit bored.\nThe purple guys are way to important early and being locked out feels very annoying. Also start player advantage is bigger than 1 extra money per player.\nAnd then the randomness of the card draw...\n\nStill a nice game but lowering from 7 to 6.\nAnd to 5, not a game that survives repeated plays.",
    "timestamp": 1760652000
  },
  {
    "username": "DevOpsProDude",
    "rating": 5.0,
    "comment": "56x87 - 120\n59x91 - 1\n\nPlayed on board game night.",
    "timestamp": 1760047200
  },
  {
    "username": "xlimxz",
    "rating": 5.0,
    "comment": "There're so many mechanics that they mesh together quite coherently: there's a bit of deck building, unlocking your own player board, choosing where to build or destroy tiles + worker placement, and pushing your train along. Not surprisingly, that gives the game strategic variety + it's relatively balanced, but I thought the trains mechanic was unnecessary and overall it's quite overwhelming for a new player. The premise is kinda neat (cows!), but it really could've been anything. Perhaps the part I enjoyed least was the second half of the game though -- by that point, everyone was locked into the engine they had created, and it was a matter of playing out many more turns (for almost another hour...) to calculate your final score.",
    "timestamp": 1757887200
  },
  {
    "username": "Scifi66",
    "rating": 5.0,
    "comment": "GWT is a Group favourite. Whilst I know it well, other players can hamstring you and that is fun. 3–4p Euro.\n++++++++++\nEdited 220701 - back to an 7 as even with 2E changes the KC delivery is too good an auto double delivery at start of each game seems almost mandatory.\n\n++++++++++\nEdited 211022 - raised my rating to 9 after 20+ games (including 2nd edition). Fantastic decision space, its starts wide open, then constricts as the board fills up with buildings, stationmasters and employees are hired and strategies are deployed. There is great scope for clever play to stymie opponents and progress your own game.\n\nGWT gets better the more you play it. Initial plays left me scratching my head. It is more tactical than strategic as you have to play both board and the opposition.\n\nDisliked the Northern Rails Expansion it seems to make building too strong and adds in more complexity for little gain.\n\nNote I've updated my first edition for 2nd edition rules. Much prefer the bright but stark aesthetic of the original first edition so have modded it to play 2nd ed. I also feel these slight game changes were upgrade pack suitable but my comments are reflected in the 2nd edition listing (which is itself strange as the game is so similar BGG?).\n\nSolo: 7 Garth Automa is good.",
    "timestamp": 1756677600
  },
  {
    "username": "Iron_Salamander",
    "rating": 5.0,
    "comment": "It was better than I expected, but I expected to hate it, to be honest. The racism in this game has been brought up before, and it's a serious mark against it. Would play again if pressed, but would rather not.",
    "timestamp": 1755208800
  },
  {
    "username": "Steezish",
    "rating": 5.0,
    "comment": "3/16/25: This game feels like a miss for me. I just felt bland.",
    "timestamp": 1755036000
  },
  {
    "username": "Maglinkinpark",
    "rating": 5.0,
    "comment": "This game is right on the edge of “too much” for me it’s too much information to parse out on a given turn. I like heavy games a lot (vinhos, Lisboa, etc) but this game is just a WHOLE LOT of iconography and decision trees that I just don’t like calculating. I never feel like I have a focused strategy because the game yells at me to do one thing then to do another. You need to ignore the incentives of one path to do well in another, and I think my brain can’t do it. I want to cull my deck every time, and for certain strategies, that’s not what you should do, but I like doing it, and I somehow CANT fight the urge to do it... so I do the same thing every time, and I lose every time. I won’t refuse a game of it, but I’d rather play something else and I’ll probably sell my copy.",
    "timestamp": 1754431200
  },
  {
    "username": "silenceisgolder",
    "rating": 5.0,
    "comment": "Good, but not quite to my taste. Good play requires early commitment and then ruthless adherence to a pre-baked strategy. The interaction that drives the tactical decisions that follow feels too incidental for me to really enjoy.",
    "timestamp": 1753135200
  },
  {
    "username": "Blackhearted89",
    "rating": 5.0,
    "comment": "Nah...",
    "timestamp": 1749074400
  },
  {
    "username": "rcog",
    "rating": 5.0,
    "comment": "You can win by New-York spamming, you can win by flooding the map with building and preventing others from New-York spamming, the devil's in the details. Brutal on newbies, and more of an accounting exercise with experienced players.",
    "timestamp": 1744149600
  },
  {
    "username": "cicerunner",
    "rating": 4.5,
    "comment": "Too much, too long.",
    "timestamp": 1740006000
  },
  {
    "username": "HowitzerBug",
    "rating": 5.0,
    "comment": "This is a very nice combination of mechanics. It appears intricate and bloated to begin with, but the parts are actually quite simple when you get used to how many there are. The fact that the multiple ways to win are all legitimate (no single all-powerful strategy) helps.\n\n[Edit: Over the years since writing this I have found the \"Cowboy/Cows\" strategy wins the majority, and has made this game no longer replayable for me - as whoever does that pretty much always wins. Score dropped.]",
    "timestamp": 1739919600
  },
  {
    "username": "ketchupandcabbage",
    "rating": 5.0,
    "comment": "Weight: 3.70 TO SELL",
    "timestamp": 1739314800
  },
  {
    "username": "KingChrysanthos",
    "rating": 5.0,
    "comment": "I can see elements of a strategic game -- and options for different focuses such as the train, getting better cows, or investing in better buildings. Main drawback is the game taking a prohibitively long time, that I never got around to playing it much -- there were other strategic games that were better to do. Also cover was really grey and drab, at least they made it more colourful in the new version.",
    "timestamp": 1733007600
  },
  {
    "username": "TiNYTimIDFluffYBunnY",
    "rating": 5.0,
    "comment": "I love it but others have trouble understanding this one I will keep trying",
    "timestamp": 1731538800
  },
  {
    "username": "winolopez",
    "rating": 5.0,
    "comment": "Too long for what it is, multiplayer solitaire, played this about 6 times and I feel i have had the enjoyment i could have from it",
    "timestamp": 1731366000
  },
  {
    "username": "stenole",
    "rating": 5.0,
    "comment": "(3-4P) Alexander Pfister's most popular game features building a hand of cows to sell at the train station. Throughout the game you set up buildings along the trail to capitalize on the bovine traffic.",
    "timestamp": 1731020400
  },
  {
    "username": "Geoboffin",
    "rating": 5.0,
    "comment": "I just don’t see why people like this so much.",
    "timestamp": 1729720800
  },
  {
    "username": "Joey_A",
    "rating": 5.0,
    "comment": "This game didn't do anything for me at the two player count. Maybe with more players this game would be better...",
    "timestamp": 1729548000
  },
  {
    "username": "Valcurdra",
    "rating": 5.0,
    "comment": "This is an enjoyable and interesting Euro, one that landed really well initially, but was quickly eclipsed by new titles that did similar things better.\n\nThere are a lot of little things that could have been better, the components are fine the game looks decent but nothing special, the theme is wafer thin and pretty abstracted from the gameplay.\n\nMy main gripe is that there are a lot of things that you could possibly do, but some paths seem inherently much better than others, milling your deck is absolutely necessary for example if your wanting to win.\n\nOverall though it's not perfect, it's a good game I would play if other wanted to.",
    "timestamp": 1727215200
  },
  {
    "username": "SpaceSheep4",
    "rating": 5.0,
    "comment": "Not enough interaction for my taste.\nIt's a very \"flat\" game. There aren't any emotional highlights or lowlights. Its a very calculated, gradual game. Very heads-down calculating game, where everyone has individual objectives. Good but not for me.\n\nIt drags on way too long. Even a 3 player game on BGA takes more than 1:30 hours. Takes more like 3-4 hours in person, in my experience.\n\nThe weight didn't justify itself, imo.",
    "timestamp": 1724191200
  },
  {
    "username": "NoodleyOne",
    "rating": 5.0,
    "comment": "Great game with a lot of interesting decisions to make.",
    "timestamp": 1722376800
  },
  {
    "username": "nishikawa-collector",
    "rating": 5.0,
    "comment": "Pretty good Euro game but something does not exactly click like other games I play more.",
    "timestamp": 1716933600
  },
  {
    "username": "heathbarATL",
    "rating": 5.0,
    "comment": "(BGA) The action rondel is interesting, but the iconography is obtuse and scoring mechanisms aren't intuitive, and frankly anti-thematic at times.",
    "timestamp": 1716847200
  },
  {
    "username": "shmonkey",
    "rating": 5.0,
    "comment": "Played once at a brewery and enjoyed my first play. Point salad-esque in strategy, quick turns, reasonably short play time (2 hours). The game pace was player driven.",
    "timestamp": 1716674400
  },
  {
    "username": "kentrisk",
    "rating": 5.0,
    "comment": "You will find many people on BGG who will give you plenty of positives points about this game as it is ranked so high and I did really like playing it. For balance, I will give some negative points: The rulebook is about 15 pages. I didn't read the rulebook so I needed about 20 minutes of instruction. That is a long time to wait on having fun. There is a lot to see in this game and it is hard for someone to sit across from you and see the small print upside down. There is absolutely no way of knowing if you are winning this game. There are too many things to add up at the end for victory points (our game was very tight and with three players we only differed by a couple victory points). With three novice players, this game took over 3 hours to play. That is a little long for my taste. I personally would like to play this game again as it was fun, but I wouldn't buy it as I doubt I could get it to the table enough. Finally, there is no solo mode. A game of this complexity really needs a solo mode because there are not many people in a family willing / capable of playing this type of game.",
    "timestamp": 1713823200
  },
  {
    "username": "klebinaldo",
    "rating": 5.0,
    "comment": "versão antiga",
    "timestamp": 1709679600
  },
  {
    "username": "dderidex",
    "rating": 5.0,
    "comment": "Kind of too much going on, here, for my ability to track it - too many somewhat-disconnected development paths/systems, with too much complexity in determining what the \"right\" one is for a given game play. If the theme interested me I could probably push through and grasp it, but the theme just...doesn't do anything for me at all.",
    "timestamp": 1707606000
  },
  {
    "username": "Necroblaster3000",
    "rating": 5.0,
    "comment": "A very boring game, Pfister usually makes really interesting games but this one puts me to sleep. Mostly play this because my friends enjoy it.",
    "timestamp": 1707606000
  },
  {
    "username": "tscox87",
    "rating": 5.0,
    "comment": "Not for me.",
    "timestamp": 1707260400
  },
  {
    "username": "Starcadian",
    "rating": 5.0,
    "comment": "Very fun game with a solid theme. A real breeze to play after heavier Euros, and could see this being a nice entry into board gaming.\n\nEdit: Became kind of dull after a few two-player games.",
    "timestamp": 1705705200
  },
  {
    "username": "Fawkes",
    "rating": 5.0,
    "comment": "The main weakness of GWT is that you have to play it in a certain way, and at a certain speed, for the experience to be almost good. That makes it a flawed design at best, though it's one of the better \"rules salad\" games even if that's not saying much.\n\n(Sold when 2E base+RttN was acquired in a bundle trade - not that I wanted 2E.)",
    "timestamp": 1702767600
  },
  {
    "username": "Eliina_Kithira",
    "rating": 5.0,
    "comment": "BGA. Maybe the in person game is more fun.",
    "timestamp": 1702594800
  },
  {
    "username": "Lowengrin",
    "rating": 6.0,
    "comment": "I don't deny that Great Western Trail is a good game, but I just can't get that excited when playing it. As Pfister games go, I think I still prefer Mombasa. Although Great Western Trail allows different strategies and even encourages specializing in some and ignoring others, which is something I generally enjoy, I find the \"rondel\" mechanism inhibits and even frustrates specialization because there are so few opportunities each time down the path to take the action related to one's plans. And so I get distracted and do other things. (Yes, I'm not very disciplined.)",
    "timestamp": 1760652000
  },
  {
    "username": "RavenousCake",
    "rating": 6.0,
    "comment": "I was recommended this at a board game meetup, I was still new to board games, but the group I was playing it with made it enjoyable enough. Can't see myself owning it.",
    "timestamp": 1760479200
  },
  {
    "username": "wooloo1",
    "rating": 6.0,
    "comment": "Meh. I don't get all the love.",
    "timestamp": 1759874400
  },
  {
    "username": "elggun",
    "rating": 6.0,
    "comment": "I'm really tired.",
    "timestamp": 1759701600
  },
  {
    "username": "pupykises",
    "rating": 6.0,
    "comment": "just downgraded from '7.5'. 'am willing to play in the mood' seems to fit where i am with this one nowadays.\nbefore i first played this, i had it out for it. cattle do not work like this. cattle are noted for ranchers having the same kind. petty? totally! so? i live near a lot of ranches, and this really bugged me.\nthen i played it, and oh it had so many different avenues to explore. you could win in any number of them! fantastic design.\nbut, at this point, the annoying cost of passing through others tiles bugs me too much. and the more recently developed versions pretty much sends this one to the cornfield, rails to the north or not. the NZ version is really interesting to me now.\nGWT - i am breaking up with you. it's not you. it's me.",
    "timestamp": 1758837600
  },
  {
    "username": "Strewth78",
    "rating": 6.5,
    "comment": "3.2",
    "timestamp": 1757628000
  },
  {
    "username": "m0x50",
    "rating": 6.0,
    "comment": "120\nArcane Tinmen GLOSS\nMedium Size (57 x 87) (Maybe FFG?)",
    "timestamp": 1756936800
  },
  {
    "username": "Tom_Sandy",
    "rating": 6.0,
    "comment": "I`m having a hard time with this game.\nI can`t get it going.\nI`m working on it.",
    "timestamp": 1756764000
  },
  {
    "username": "Killi",
    "rating": 6.0,
    "comment": "Fun game!",
    "timestamp": 1756504800
  },
  {
    "username": "Sotislosky",
    "rating": 6.0,
    "comment": "aged poorly",
    "timestamp": 1756332000
  },
  {
    "username": "Paudie81",
    "rating": 6.0,
    "comment": "First Edition",
    "timestamp": 1755813600
  },
  {
    "username": "tmoiynmwg",
    "rating": 6.0,
    "comment": "Very annoying to learn, but the game loop is tight once you're familiar with the annoying symbology. This game needs a Race-esque reference sheet.",
    "timestamp": 1755468000
  },
  {
    "username": "voronwecalanon",
    "rating": 6.0,
    "comment": "Didn't really enjoy this one. To each their own.",
    "timestamp": 1754776800
  },
  {
    "username": "Epochend",
    "rating": 6.0,
    "comment": "It's a clever, balanced, and intricate design, with lots of different paths to victory; but it's incredibly mechanical and themeless (even by euro standards), which only makes it harder to absorb its ridiculous smorgasbord of fiddly little rules.",
    "timestamp": 1754690400
  },
  {
    "username": "eddy_sterckx",
    "rating": 6.0,
    "comment": "2017-02-11 : I don't get the hype over this game. It's complex - lots of little mechanics and intricacies - but offers very little depth and is seriously hampered by the rather high luck factor. Draw the wrong cards at the wrong time and you're hosed. For instance : you need a good hand to be able to unlock the hand-size increasing spot which you'll need to build the even higher hand values. And that's just one example. This game is that damning combination of complexity and randomness I simply don't like. Compared to Mombasa - also complex - but where you can formulate a strategy and execute it, The difference cannot be more clearly illustrated as that in Mombasa a card you buy goes into your hand, guaranteeing you can play it at the most optimal time - in other words : long term planning - whereas in this game it goes into your discard pile and you may never see it again. So overall, this is clearly the lesser game and a shining example of a game that is in dire need of a developer who should have streamlined it - a lot.\n2025-08-06 : Avoided this game for years. Just played the New Zealand one and found out that we played the original wrong all these years ago. All thanks to the game-owner not bothering to learn the game before game-night and a teach which consisted of him reading selected portions of the rules out loud. Ugh.",
    "timestamp": 1754517600
  },
  {
    "username": "ScotchYeti",
    "rating": 6.0,
    "comment": "Great game, loving the design with different paths to victory on a slowly shaping board. 8 stars for now until I have played more. The Solo bot is awesome,\n\n=====\nUPDATE January 2025:\n\nLast game felt more like work and it didn’t came together for me. I prefer my Rosenbergs.",
    "timestamp": 1754431200
  },
  {
    "username": "aresil",
    "rating": 6.0,
    "comment": "3p",
    "timestamp": 1754085600
  },
  {
    "username": "ForeverAFK",
    "rating": 6.0,
    "comment": "Don't get the hype",
    "timestamp": 1751839200
  },
  {
    "username": "maritn",
    "rating": 6.0,
    "comment": "Didn't make me feel like I was pushing cows through the wild west.\n\no Not too keen on the setting\n\n- Multiplayer solitaire",
    "timestamp": 1748988000
  },
  {
    "username": "NotThatSalem",
    "rating": 6.0,
    "comment": "It's fine.",
    "timestamp": 1747260000
  },
  {
    "username": "Noboe",
    "rating": 6.0,
    "comment": "Feels too basic after playing Argentina/New Zealand.",
    "timestamp": 1746482400
  },
  {
    "username": "schrifterz",
    "rating": 6.0,
    "comment": "Just not my game",
    "timestamp": 1746050400
  },
  {
    "username": "picapau",
    "rating": 6.0,
    "comment": "Very complex, which I actually like, but the game mechanics don't adequately reflect the thematic idea. some actions don't seem to make much sense. What's more, it's almost impossible for players who fall behind at the beginning to catch up - once the others have run off with their train, that's almost it.",
    "timestamp": 1745532000
  },
  {
    "username": "dhable",
    "rating": 6.0,
    "comment": "See notes on GWT: Second Ed.\n\n\nRating History:\n24 Apr 2025 - 7 (1 play)\n01 Nov 2021 - 8 (1 play)",
    "timestamp": 1745445600
  },
  {
    "username": "spencyrrh",
    "rating": 6.0,
    "comment": "2025-04-12 | 3 plays at 4p, 4p & 3p | eggertspiele English 1e | FiSw teaching:  6 \n\nYou travel along a single track with branching routes taking actions at spaces you choose to stop at along the way. You might buy cow cards; buy employees; construct new spaces; draw money; draw cow cards from your deck; cycle through your deck; remove obstacles; etc.. At the end, you sell whatever cow cards you have in hand and move a train for some reason. Lots of stuff gives you points.\n\nHeavier & slower than I expected. On my first play, I endured a grandiloquent lecture from this game's greatest advocate on its elegance and enduring rhythm. I struggle to see the setting and have it gel with the rules, especially around trains. I like the interaction through building and obstacle placement. Possibly, you could win with any strategy, but more likely, you do well if you adapt to which employees arrive cheap, and what engine you can construct around the initial layout of tiles. I think I like this better than other complex optimisation Euros, but the experience still turns me away and runs too long. I have to plan a proper strategy, think a lot about fiddling with my engine and not very much about my friends. I may not play again. I flirt with an epiphany that I only like tactical games.\n\nThe game looks too busy for me. I think the cows look nice on the cards. I don't consider second edition art an improvement.\n\nPlayer count affects things, but probably player psychology around pace and building placement matters more.",
    "timestamp": 1745272800
  },
  {
    "username": "MightyGeekPants",
    "rating": 6.0,
    "comment": "Large decision space, but systems are pretty basic. Can run quite long!",
    "timestamp": 1744322400
  },
  {
    "username": "graybeard76",
    "rating": 5.5,
    "comment": "Can't get past seeing if more than one person is vying for the train station master spots, someone gets burned. Even if the burned player tries to rush ahead to the next station, the other person can jump ahead of them again. Whereas the burned player was not able to use the player in the station to get a jump.",
    "timestamp": 1743202800
  },
  {
    "username": "Schmatkins",
    "rating": 6.0,
    "comment": "Played 2p irl and 2-3p on bga - I see why people love it and it is a good game, but for me the design is too bitty. So many things going on that do blend well together, but maybe just a tad overwhelming. And with all the different mechanisms/movig parts I guess I'd rather play less complex games that take parts of this game and deliver on the same feel. Because it's such a mesh of different mechanics, I don't have time to settle into the theme. Just feels a bit dry to me.",
    "timestamp": 1742252400
  },
  {
    "username": "Marcsalty",
    "rating": 6.0,
    "comment": "Cull\n\n2-4 player All blinged out",
    "timestamp": 1742079600
  },
  {
    "username": "whitehouse3001",
    "rating": 6.0,
    "comment": "Impression after 1 play with 3 players: I like the theme and mechanics of the game. The learning curve, setup, scoring, and teardown of the physical game is pretty awful (tedious and fiddly), so it's not a game I'd be excited to pull out very often, especially having to teach new players each time. It feels like there are several strategies to explore, but it feels more sandboxy and less of a powerful engine builder, although I haven't played it enough. There is not much player interaction other than taxing players at your hand buildings and jumping over train spots, so it feels pretty solitaire-ish. If I want a more solitaire game, I'd probably rather play Terraforming Mars or Ark Nova where the engine building feels more at the forefront; although, I'm not terribly excited to play those games either. I would like to play it some more on a digital version to explore more focused strategies, rather than doing a lot of things not very well.\n\nMight bump it up to a 7 after trying digital version to eliminate the fussiness.",
    "timestamp": 1741906800
  },
  {
    "username": "furrygoose",
    "rating": 6.0,
    "comment": "Just didn't enjoy this that much, I liked the cows, but often felt i was doing things for the sake of it",
    "timestamp": 1739314800
  },
  {
    "username": "Jedita",
    "rating": 6.0,
    "comment": "BGA",
    "timestamp": 1738882800
  },
  {
    "username": "Batareziz",
    "rating": 6.0,
    "comment": "Great game in concept, but too long and somewhat repetitive for what it is. Also I feel like should play better at higher player count.",
    "timestamp": 1737327600
  },
  {
    "username": "solanvp",
    "rating": 6.0,
    "comment": "Euro, Rondell",
    "timestamp": 1735945200
  },
  {
    "username": "aliakel",
    "rating": 7.0,
    "comment": ".",
    "timestamp": 1762640100
  },
  {
    "username": "ErgonomicJonze",
    "rating": 7.2,
    "comment": "Really fun game that becomes less fun the more you play it. Novel mechanics that don't have a lot of staying power. Very fun your first few plays though.",
    "timestamp": 1761084000
  },
  {
    "username": "Misha99",
    "rating": 7.0,
    "comment": "Great follow up to Mombasa. Long, complex game but satisfying.",
    "timestamp": 1760997600
  },
  {
    "username": "Ajohnny101",
    "rating": 7.0,
    "comment": "I'm assuming this is basically the same as the revised edition, so i'm giving it the same score.",
    "timestamp": 1760911200
  },
  {
    "username": "ImZhe",
    "rating": 6.6,
    "comment": "Farm cows\n\nGood game but I can't get excited for it",
    "timestamp": 1760911200
  },
  {
    "username": "Mr Mjeh",
    "rating": 7.0,
    "comment": "Decent euro game with tons of options and possibilities, but also tons of little rules. A little streamlining would've gone a long way.",
    "timestamp": 1760220000
  },
  {
    "username": "Elysian1196",
    "rating": 7.0,
    "comment": "A well made modern medium-heavy engine building euro. Most of the pros and cons I can say for most euros of this weight also apply to this one. Satisfying engine building, race conditions, point salad, lots of different mechanics smushed together, only indirect player interaction, so much iconography, a few variable main paths to score points. If you like this sort of game, you'll feel right at home. Definitely don't feel like it does anything new though if you've played a lot of these like me, and doesn't solve my general problem with many euros feeling very samey. I'd still play a Feast for Odin over this because that game at least has more uniqueness in mechanics.",
    "timestamp": 1759960800
  },
  {
    "username": "Tychose",
    "rating": 7.0,
    "comment": "E raptor insert",
    "timestamp": 1759269600
  },
  {
    "username": "sykano",
    "rating": 6.8,
    "comment": "complex rondel game with a bit of deckbuilding\nwith cattle wrangling theme\noverrated\n\n\n+ innovative ?\n+ mechanics ?\n+ materials\n- rather complex (lots of tiny numbers, symbols and small tiles), tough to learn and teach\n- ugly\n- questionable theme (bringing cows to the grinder)\n- gameplay a bit repetitive and limited in what you can do\n- a bit luck-dependent (drawing the good cows, cow diversity, able to buy right before reshuffling)\n- a bit too much point salad, odd distribution of points\n- balancing issues ?\n- takes a bit long ?\n\nI admit the mechanics seem sound and somewhat innovative, but somehow the game is not that appealing to me.\nThe train stuff seems odd and the workers stuff is a bit creepy (all those faces).\nAnd the things you can do are relatively limited (only one neutral cow market and buildings station and hazard removal, sometimes you can't build own ones, only small choice of buildings to build with few craftsmen, ...). Fringe strategies are seldom explorable in the few steps you have and because delivering badly is punished quite severely.\n\nSet up and tear down is a bit fiddly with all those small tiles with different backsides.\n\nA lot of the details in the game seem very arbitrary (paths, forest, actions on some buildings especially on the custom buildings, ...), it seems that there is no deliberate concept behind it.\n\nNormally I don't have problems with point salad, but in this game it is a bit harder to overview what to do to get points. The goal of what players are doing in the game is a bit unclear, because delivering the cows not necessarily gets you points. Sometimes you're even punished for it. You need to be a bit lucky to get some money out of it, which you then can try to translate into points or invest in better deliveries bringing more money to translate into more points.\n\nThe cow strategy is the most intuitive and I think you can't really go without buying at least a few higher value cows, which means you almost always want 2-3 cowboys early. If there aren't enough cowboys available, you're just out of luck.\nThe train strategy is weird and the payoffs aren't that good.\nThe buildings strategy is too strong. The points for the higher value buildings are too high. If you ignore buildings you probably lose.\nThe points from hazards are also not to underestimate.\nAll in all I have the feeling that you can't really focus on one thing, you have to do it all, more or less. That is fine, I like mixed strategies, but it feels samey that way.\nIt also seems to happen often that all players start more or less on the same spot and do similar things at the beginning of the game. ?\nThe starting mission cards are nice in that they give every player a different direction. Sadly after you done it, you can just go back to your usual strategy.\n\nWhat's positive about the game (and I had to search for a while):\n- The rondel building/enhancing is nice and even fits the theme of repetitive cow wrangling on the trail. The way the rondel is implemented in this game is fairly usual if not unique.\n- The hand management is sometimes tough which feels a bit thematic, like managing a cow herd!?\n- Every player starts with same stats on the player board, but can specialize differently by hiring workers and getting rid of discs. (Sadly the game doesn't utilize that more, e.g. 1-2 cowboys and 1 engineer are dominant basic setting, a +1 hand size is also very dominant.)\n- The deck building goes only so far, at some point it hurts you if you bought too many higher value cows or trashed too many lower value cows. That's oddly interesting.\n- the concept of auxiliary actions, enabling and upgradable",
    "timestamp": 1758664800
  },
  {
    "username": "berniethered",
    "rating": 6.5,
    "comment": "Sometimes, the cow card draw right before reaching Kansas can be so sweet and sometimes so horrible!",
    "timestamp": 1758578400
  },
  {
    "username": "slimy_asparagus",
    "rating": 7.0,
    "comment": "Finally played after avoiding it for years. Was fun.",
    "timestamp": 1758405600
  },
  {
    "username": "snoozefest",
    "rating": 6.5,
    "comment": "3 more plays at Whose Turn... 2017\n\nVery enjoyable game, best with 3 (or maybe 4 fast) players! Multiple paths (thin deck racing to Kansas, fatter deck optimizing slowly along the way, building or not, etc.) seem viable. Looking forward to trying the B-sides of buildings!\n\n---\n1 partial play\n\nThis is a pretty cool deck-building style of game. Your deck has a bunch of types of cattle. You're trying to optimize your hand in the time (several turns) it takes to get your marker from start to Kansas City. Along the way, you can stop at buildings (neutral ones, and those you build yourself) to take a variety of actions (e.g., buy more cattle, earn coins, thin your deck). At the end of your cattle run, the higher the value of your hand the further you can place your marker (worth more VP, earn more coins).\n\nOnce you understand the rules and the functions of the various buildings, the game SHOULD play very quickly. Very fun game, worth getting a copy!",
    "timestamp": 1758319200
  },
  {
    "username": "kwhite1",
    "rating": 7.0,
    "comment": "P",
    "timestamp": 1758060000
  },
  {
    "username": "lboucheron",
    "rating": 6.5,
    "comment": "English first edition. Box has mild shelf wear. Cards may have minor wear around edges. Rulebook has some light crinkling. All other components in excellent condition.",
    "timestamp": 1756850400
  },
  {
    "username": "DoctorPhil",
    "rating": 7.2,
    "comment": "Criteria (out of 5)\nRules complexity 2\nPlaytime/complexity ratio 3\nStrategic avenues 4\nMechanism strength 4\nThematic integration 4\nVariability 4\nReplayability 4\nFun factor 3\nSolo mode\nPlayer interaction 4\nElement of mastery 4\n\nOverall 7.2 out of 10",
    "timestamp": 1756072800
  },
  {
    "username": "Oddball_FR",
    "rating": 7.0,
    "comment": "mechanical (nice ones) but themeless ... 0 immersion",
    "timestamp": 1755727200
  },
  {
    "username": "dmwainw",
    "rating": 7.0,
    "comment": "BGA",
    "timestamp": 1755122400
  },
  {
    "username": "Korwin",
    "rating": 7.5,
    "comment": "Argentina is a little bit more interesting",
    "timestamp": 1762647540
  },
  {
    "username": "JT19",
    "rating": 8.0,
    "comment": "130",
    "timestamp": 1762383600
  },
  {
    "username": "kaepone",
    "rating": 8.0,
    "comment": "Lots of good mechanics in here. Tons of fun.\nThere is a lot going on and the symbology isn't 100% clear, even after extended time away from the game. But within a few turns it becomes clear and accessible. It probably would be rated a touch higher but I feel Rails to the North really elevates the base game and there is some luck of the draw that you must mitigate with your strategy in order to cycle your cards as you make your way along the trail in order to get the best payout and delivery location.",
    "timestamp": 1761692400
  },
  {
    "username": "hedisch",
    "rating": 8.1,
    "comment": "Martin",
    "timestamp": 1761606000
  },
  {
    "username": "BrutusA",
    "rating": 8.0,
    "comment": "Aesthetic: 2\nMechanism: 2\nInvolvement/length/fluid: 1\nReplayability: 2\nOther: 1",
    "timestamp": 1761519600
  },
  {
    "username": "bkevans",
    "rating": 8.0,
    "comment": "A little too long for me to give it a top rating, but it probably deserves even higher than an 8. It's an impressive game.",
    "timestamp": 1761519600
  },
  {
    "username": "Jesenberg",
    "rating": 8.0,
    "comment": "C",
    "timestamp": 1761256800
  },
  {
    "username": "jedipanda",
    "rating": 8.0,
    "comment": "sold to NK 10/22/25",
    "timestamp": 1761170400
  },
  {
    "username": "lethan",
    "rating": 8.0,
    "comment": "Owns the 2nd edition.",
    "timestamp": 1760652000
  },
  {
    "username": "Derianhorgen",
    "rating": 8.0,
    "comment": "SpielboxRating 8-9, av. 8,75",
    "timestamp": 1760047200
  },
  {
    "username": "bkunes",
    "rating": 8.0,
    "comment": "BK's Hardcore 10x10 in 2025 List\n BK's Hardcore 10x10 in 2020 List\n\n{:::8:11}",
    "timestamp": 1759874400
  },
  {
    "username": "Eduardo375",
    "rating": 8.0,
    "comment": "Had a great time, played 4 player.",
    "timestamp": 1759788000
  },
  {
    "username": "BoarderTerrier",
    "rating": 7.5,
    "comment": "5. May",
    "timestamp": 1759701600
  },
  {
    "username": "MorelliBuendia",
    "rating": 7.5,
    "comment": "Second edition with expansion.\n\nMogul Scale: 3/C.",
    "timestamp": 1759528800
  },
  {
    "username": "KaneSanders",
    "rating": 8.0,
    "comment": "Great Western Trail: Rails to the North\nGreat Western Trail: Promo Station Master Tiles\nGreat Western Trail: 13th Building Tile",
    "timestamp": 1759442400
  },
  {
    "username": "Wolcik",
    "rating": 8.0,
    "comment": "Digital version available (BGA Premium)",
    "timestamp": 1758751200
  },
  {
    "username": "Avid_Equinox",
    "rating": 7.5,
    "comment": "GWT 2nd edition improves on this to the point where I'd never play this one.\n2nd ed has some small balance tweaks and also a big thematic improvement by updating \"indians\" to \"outlaws\" (which are pieces which you remove from the board)",
    "timestamp": 1758751200
  },
  {
    "username": "ditterio",
    "rating": 9.0,
    "comment": "GREAT WESTERN TRAIL (2-4 players)\n\nSolo Great Western Trail: https://boardgamegeek.com/filepage/151608/garth-specialized-...",
    "timestamp": 1762297200
  },
  {
    "username": "sidefootstep",
    "rating": 9.0,
    "comment": "Great game, more variation to win the game and collect more points. high chance to repeat play.",
    "timestamp": 1761519600
  },
  {
    "username": "Lendengold",
    "rating": 8.5,
    "comment": "Gereon\n(geschenkt von Anne 28.02.2021)",
    "timestamp": 1761429600
  },
  {
    "username": "Xren",
    "rating": 9.0,
    "comment": "Nyomi's",
    "timestamp": 1761170400
  },
  {
    "username": "Mrs Meeple",
    "rating": 9.0,
    "comment": "2-4",
    "timestamp": 1760738400
  },
  {
    "username": "rkleopold",
    "rating": 9.0,
    "comment": "Keep",
    "timestamp": 1760738400
  },
  {
    "username": "fazermozg",
    "rating": 9.0,
    "comment": "+",
    "timestamp": 1760652000
  },
  {
    "username": "jet747",
    "rating": 9.0,
    "comment": "Superb game. My only criticism is that it's over just as you finally get things rolling.",
    "timestamp": 1760565600
  },
  {
    "username": "Demodiddi",
    "rating": 9.0,
    "comment": "own 2nd Edition",
    "timestamp": 1759356000
  },
  {
    "username": "eminency",
    "rating": 8.5,
    "comment": "Really good game, but it was hard to adapt and to understand its running mechanism which is a little complex at first play.",
    "timestamp": 1757541600
  },
  {
    "username": "Shark_2815",
    "rating": 8.7,
    "comment": "Easy to teach and learn, for the most part the iconography is easy to comprehend. Decision space is challenging, and the game flies by with quick turns once you've played the game a few times. When this comes up in the rotation, I always look forward to it. Another enjoyable Pfister hit.",
    "timestamp": 1756764000
  },
  {
    "username": "Bentley Mirrorshade",
    "rating": 9.3,
    "comment": "Rails to the North",
    "timestamp": 1755813600
  },
  {
    "username": "superspacedinvader",
    "rating": 9.0,
    "comment": "Brilliant Game, Love it! XXX Want to play it more!",
    "timestamp": 1755813600
  },
  {
    "username": "DeadDomino",
    "rating": 9.0,
    "comment": "Maybe I think I like this more than I actually do? Only more plays will tell, but it seems hard to get to the table.",
    "timestamp": 1755554400
  },
  {
    "username": "the_real_phibes",
    "rating": 9.0,
    "comment": "BLEIBT",
    "timestamp": 1755468000
  },
  {
    "username": "trainings_pl",
    "rating": 9.0,
    "comment": "Older, more thematic version.",
    "timestamp": 1755295200
  },
  {
    "username": "benschel",
    "rating": 9.0,
    "comment": "amber-vs-ben",
    "timestamp": 1755295200
  },
  {
    "username": "HugoCruzVilla",
    "rating": 10.0,
    "comment": "+ Great Western Trail: Rails to the North = 5 plays",
    "timestamp": 1761170400
  },
  {
    "username": "Nakira",
    "rating": 9.5,
    "comment": "Great Western Trail – Saddle up for a ride through the Wild West as a cattle driver with a herd on your back and plenty of decisions to make. You’ll follow a winding trail, stopping at various towns and landmarks, each offering unique actions and opportunities. Along the way, you build new buildings, upgrade your strategy, and aim to deliver the most valuable cattle to the train station at journey’s end. It’s a beautifully designed blend of deck-building, route optimization, and resource management that captures the spirit of frontier life with a satisfying crunch. If you want a strategic cowboy adventure that rewards clever planning and risk-taking, this is your ticket to the Old West.",
    "timestamp": 1759874400
  },
  {
    "username": "OGRussHood",
    "rating": 10.0,
    "comment": "My 2025 Top 250: #21\nMy 2024 Top 250: #25\nMy 2023 Top 250: #29\nMy 2022 Top 250: #31\nMy 2021 Top 250: #34\nMy 2020 Top 250: #36\nMy 2019 Top 200: #37",
    "timestamp": 1758492000
  },
  {
    "username": "FireManBearPig",
    "rating": 10.0,
    "comment": "Rails to the North, The Eleventh Building Tile, 13th Building Tile, At the Poker Table stored in base box.",
    "timestamp": 1758492000
  },
  {
    "username": "djsturz",
    "rating": 10.0,
    "comment": "A hodgepodge of mechanisms that aren't so difficult once you play. Very cool way to select actions and upgrade your player board.",
    "timestamp": 1758060000
  },
  {
    "username": "aaronrojo",
    "rating": 10.0,
    "comment": "Great game!!",
    "timestamp": 1756677600
  },
  {
    "username": "Straddllw",
    "rating": 9.5,
    "comment": "Played this on all player counts and loved it. The strategy definitely feels broader at 4 players, whereas at lower player counts, the building strategy feels underpowered. Great theming, great mechanics, Pfister is on a roll!",
    "timestamp": 1756245600
  },
  {
    "username": "bggmatje",
    "rating": 10.0,
    "comment": "[January 2022]\nThere exist many euro-style complex strategy games, but this is my favorite. There are many different mechanisms that tie into each other perfectly. It has a little bit of deck building, tableau building, and a rondel mechanism. It is that kind of game where you want to do everything but there is not enough time to do so, so you have to make tough choices. But player turns are pretty fast, especially with experienced gamers. There are many ways to score points, leaving you with plenty of strategies to try out.\n\nIn the game you are a rancher and are cattling your herd of cows to Kansas City to sell them. The theme may be a little bit dry, but it works.",
    "timestamp": 1755900000
  },
  {
    "username": "espoon82",
    "rating": 9.8,
    "comment": "Boy, did this game live up to the hype. I have considered it one of the Big Four of 2016 since, well, 2016. But for some reason I actually never got around to getting it till recently. The game is amazing and full of interesting, seemingly simple decisions that end up rending your brain into pieces. And it is such a unique theme! Loving it. I have a copy for trade (with the expansion) if someone is interested, because someone got me a second copy as a gift!",
    "timestamp": 1755813600
  },
  {
    "username": "Solamar",
    "rating": 10.0,
    "comment": "Can I look at my cards? Rules: You can look at hand and discard, not draw.\nMy opinion (and others): You can also look at draw, as long as you shuffle afterwards.\nReasoning (from thread): You're allowed to look at your hand and discard pile and you know every card you added, by definition you know what is left in your deck. We could make everyone get pen/paper and keep track of this information and slow the game down, but that is just unnecessary bookkeeping. So we allow anyone to check their deck then reshuffle. This game has zero deck manipulation (putting cards back in your deck in a specific order) so it only makes sense to allow people to look whenever they want. A random draw is a random draw.\n\nStrategy: Place 2a (Private Cattle Auction) in the water hazard area. Use your cash from Kansas to buy cows so you don't pay opponents fees, and discard 1 for ribbons.\nStrategy Beginning: I usually start with the premise \"I\"m recruiting two workers on my first stop at the worker tile. What do I need ($14-16) to do to accomplish that?\"\n\nLess Variable Variant (More for 2 player):\nWith 3 players, remove 16 tiles from the game (before the setup):\n- level 1: 2 green teepees, 1 blue teepee, 1 of each hazard tile\n- level 2: 2 of each worker\n- level 3: 1 blue teepee, 1 of each worker\n- Cows: 2 blue , 2 red, 2 yellow, 2 brown (3,5), 1 purple (7)\nWith 2 players, remove 32 tiles from the game (before the setup):\n- level 1: 3 green teepees, 3 blue teepee, 2 of each hazard tile\n- level 2: 4 of each worker\n- level 3: 1 green teepee, 1 blue teepee, 2 of each worker\n- Cows: 3 blue , 3 red, 3 yellow, 4 brown (3,3,5,5 vp), 2 purple (5,7)",
    "timestamp": 1755727200
  },
  {
    "username": "duanewulf",
    "rating": 9.9,
    "comment": "Expansions owned:\nGreat Western Trail: Rails to the North",
    "timestamp": 1755554400
  },
  {
    "username": "GarazoGranie",
    "rating": 10.0,
    "comment": "nice soft western climate",
    "timestamp": 1755036000
  },
  {
    "username": "klaquemuffe",
    "rating": 10.0,
    "comment": "Excellent, à jouer absolument avec l'extension Ruée vers le Nord.",
    "timestamp": 1754085600
  },
  {
    "username": "damimi",
    "rating": 9.5,
    "comment": "2-3p",
    "timestamp": 1751925600
  },
  {
    "username": "kikaytete",
    "rating": 10.0,
    "comment": "Cañete\n5-2\n72%",
    "timestamp": 1751493600
  },
  {
    "username": "mathieulabelle73",
    "rating": 9.5,
    "comment": "Great Western Trail features a unique round structure where players move along a track, strategically choosing when and where to stop to take various actions, this is one of the core strengths of its gameplay. It excels as an engine-building game, where players develop both their personal board and construct buildings to enhance their strategy. Additionally, it incorporates elements of deck-building, making for a highly immersive experience. Overall, it’s a must-have for fans of the genre. Interraction could have been greater, you play a bit on your own.",
    "timestamp": 1751148000
  },
  {
    "username": "Gardamun",
    "rating": 10.0,
    "comment": "$50 - Daniel Goertzen",
    "timestamp": 1750975200
  }
]