[
  {
    "username": "mr_ben_jen",
    "rating": 1.0,
    "comment": "i hate this game more than i hate the idea of dying. terrible too many things happening crappy engine crappy game crap.",
    "timestamp": 1748469600
  },
  {
    "username": "christjuha",
    "rating": 1.0,
    "comment": "Awfully voring game, if you wanna waste your time for nothing, you can play",
    "timestamp": 1745186400
  },
  {
    "username": "T1_Faker",
    "rating": 1.0,
    "comment": "白癡遊戲",
    "timestamp": 1744149600
  },
  {
    "username": "dontnickme",
    "rating": 1.0,
    "comment": "Just another \"group solitaire\" nonsense game. A pretty algebra equation. Why do so many people want to sit around a table in silence while doing disguised math?",
    "timestamp": 1733266800
  },
  {
    "username": "cotomel",
    "rating": 1.0,
    "comment": "75% of a typical euroslop design. Pick the largest number get resources for 2 turns convert them to VPs with the 3rd action repeat for 3 rounds.",
    "timestamp": 1732834800
  },
  {
    "username": "DonScovillo",
    "rating": 1.0,
    "comment": "Worst rulebook ever.",
    "timestamp": 1727992800
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "The game lied to me. Where's Harold and Kumar?!",
    "timestamp": 1720821600
  },
  {
    "username": "Darkhan90",
    "rating": 1.0,
    "comment": "first player has a huge advantage. the cards are pretty unbalanced and them changing in the middle of the round sucks, especially because turns are not a find the best choice but find a choice that feels a little bit good at all, and can take a very long time (even for experienced players), so when the action cards change now you have to recalculate everything you planned, therefore your entire strategy is basically gone down the drain, and also the downtime is huge. 80 mins advertised time, 4h actual gameplay time (as i said even for not prone to AP players). farmers are very OP to the point that's the strategy you should take or you loose. the iconography is not very intuitive. the theme is pasted, not relevant at all. just awfull.",
    "timestamp": 1706482800
  },
  {
    "username": "khepriq",
    "rating": 2.0,
    "comment": "too abstract",
    "timestamp": 1755900000
  },
  {
    "username": "fenadoruk",
    "rating": 2.0,
    "comment": "Player choices don't feel meaningfully different. The Dice mechanic is somewhat interesting, but the comboes feel quite dull and samey. Spatial puzzles feel extremely limited. Honestly it felt like fiddling with an Excel Spreadsheet, and the iconography is spread around poorly. UI is just too busy!",
    "timestamp": 1752012000
  },
  {
    "username": "oriad",
    "rating": 1.5,
    "comment": "rating 3 after 4 plays (one solo and 3 2players)\n\n\nI love red cathedral but white castle is just a failure of game.\nSUMMARY: MEH , really disappointing\n\nHonestly this game has really nothing exciting to me.\nThere is no interaction or dynamic events ( a part of some card are taken during courtisan action)\n\nCONTRA:\n\nYou cannot even have a strategy which is satisfing during the game.\nThe warrior and others stuff is just scripting the game more or less.\nIs just a meh game , and hyped one. (as usual nowdays in boardgame)\nOk you need some basis thinking but after that i can't find any enjoyement\nAt the end of the play, you are always stuck between 40/60 points.\n\nOnly PRO:\nTheme is nice, and is a small box with nice setup\nPlay fast but do we need such games? i would play an abstract or somehting else like cascadero",
    "timestamp": 1745445600
  },
  {
    "username": "TForever",
    "rating": 2.0,
    "comment": "It's just too light.",
    "timestamp": 1745359200
  },
  {
    "username": "tectactoe",
    "rating": 2.0,
    "comment": "I'm not sure how much longevity these sorts of games truly have. Takes the cascading-action effect to the extreme. You only have 9 official \"turns\" to take during the game, so in order to compete, you're forced to find ways to either extend your 9 turns, or effectively turn those turns into multiple turns (i.e., executing actions that combo into another subsequent action, which might then combo into yet another subsequent action, etc.). I like the idea, I had some fun playing through this and trying to suss out the puzzle. But ultimately it DOES end up feeling like more of a puzzle than a \"game\". Some of the scoring and advancements in the game (e.g. the Passage of Time track) seem underbaked and not particularly well thought-out. Lantern mechanism is cool.",
    "timestamp": 1736204400
  },
  {
    "username": "MikoML",
    "rating": 2.0,
    "comment": "This game is purely determined by the opening game cards. If you get a setup where 1 player gets a domain card, they are guaranteed to win. The pure amount of value those generate over lantern plays by far offsets any amount of offset of starting resources, and probably triples the amount of value if you get the seal. Horrid. What an awful game.",
    "timestamp": 1734735600
  },
  {
    "username": "xylantrax",
    "rating": 2.0,
    "comment": "Zero new mechanics, illusion of variability in the setup (because there are too few different actions in the game overall), total symmetry of players (in the age when we have so much asymmetric dice management games), absolutely \"on the rails\" gameplay, no sense of accomplishment of practically anything since there are only 9 actions per player.\nSince when does little box with low price and 0 interesting games inside deserve its place in the hotness?",
    "timestamp": 1734476400
  },
  {
    "username": "Bertuccia",
    "rating": 2.0,
    "comment": "I don’t understand all the hype behind this game. The art and the production are nice, but the gameplay is horrible. Being first player has an overwhelming advantage, the farmers are op compared to the other units, cards are unbalanced, and the game is both too slow for overall timing and too short to do anything meaningful.",
    "timestamp": 1705618800
  },
  {
    "username": "Ephorus",
    "rating": 3.0,
    "comment": "What I like:\n- The game to satisfy ones inner optimization monkey. Finding the moves that gives one the most bang for its buck can be pretty satisfying. The combos in this game are sick. Everyone mentions that this game has only 9 actions, but ultimately it's closer to 30 when taking the right spots at the right time.\n\nWhat I dislike:\n- This might be one of the worst offenders when it comes to multiplayer solitaire and point salad that I've experienced yet. There is zero interaction in this game besides the dice drafting. I was already taking more than enough time to plan my turn, I cannot imagine that people do the same for the opponent and then find the optimal dice and spot to both optimize their move and at the same time hurt the opponent. If you do this, respect but you're also crazy.\n- I only played this game IRL once with 2 opponents and waiting times were way too long. This was by no means a shared experience - more an exercise in patience and boredom. I several times started a conversation while someone made their turn since turns would noooooot stop.",
    "timestamp": 1758924000
  },
  {
    "username": "esayitch",
    "rating": 3.0,
    "comment": "I reviewed this: https://boardgamegeek.com/thread/3198058/hows-blank-castle",
    "timestamp": 1758664800
  },
  {
    "username": "Scifi66",
    "rating": 3.0,
    "comment": "Didn't expect to like it, but first play was enjoyable with lots of banter. It's a small-medium box puzzle Euro with dice drafting. Turn order is important as is plotting your end game path to a pile of points, you need to specialise to derive maximum benefit. Nothing you haven't seen before and the second game saw much reduced enjoyment.\n+With 2p it would be over quickly (=good)\n+Colourful board with the bridges.\n–Heads down and the board can change which means backup plans need to be in place.\n–Card replacement draw in palace is consequential\n–Would be a killer for AP players.",
    "timestamp": 1756677600
  },
  {
    "username": "geoffder",
    "rating": 3.0,
    "comment": "Pretty soulless dice drafting combo efficiency puzzle. Many options that don't feel meaningfully different until you've become invested in some combo paths. Multi-player solitaire with any blocking being largely incidental, you can't afford to not focus on your own efficiency with so few turns. At least it is over fast, looks pretty, and fits in to a small box.",
    "timestamp": 1750370400
  },
  {
    "username": "kolvorok",
    "rating": 3.0,
    "comment": "A themeless point-salad Euro where one really can get distracted by the sheer number of icons and symbols on the board and cards... and the game is over so soon. What have I just played?! It is frankly more engaging trying to put all the bits in the box to close the lid. It has an expansion... and it is madness to add further options to a game like this... just play an elegant OG rather than this sprawling mess in a tiny box.",
    "timestamp": 1745186400
  },
  {
    "username": "B_52",
    "rating": 3.0,
    "comment": "I usually play solo and this Game is too random to enjoy anything at all. Perhaps with a better automa... but with the one included in the game It is horrible.",
    "timestamp": 1740178800
  },
  {
    "username": "drewtimmer",
    "rating": 3.0,
    "comment": "6/10 I want to like this a lot... but still on the fence. Neat theme, a little too dicey for me, and how in the world are there only 9 TOTAL actions in a game?? Like, no time to actually develop a fleshed out strategy.\n\nEDIT: 5/10 I think I like this game less and less the more I play it. It's really just staring at the board over and over looking for action chaining combos. Not a lot of thrill, just a LOT of feeling like there's no good moves.\n\nEDIT: 4/10 I keep trying to give this game another chance, but between decision paralysis and feeling incredibly stuck with no good options, you kinda know who will win after about 3 dice in. Just too clunky or rigid or something for me. Not a lot of fun to be had...\n\nEDIT: 3 STARS.... I can't tell you how many times I've tried this game, but keep losing miserably. Why is this game insanely frustrating??",
    "timestamp": 1739401200
  },
  {
    "username": "ultimoratio",
    "rating": 3.0,
    "comment": "Respectable qualities on how it can deliver mid weight Euro gameplay in such a small box.",
    "timestamp": 1735513200
  },
  {
    "username": "Astronomos",
    "rating": 4.0,
    "comment": "Overrated garbage. None of the actions feel particularly interesting.",
    "timestamp": 1759960800
  },
  {
    "username": "Killi",
    "rating": 4.0,
    "comment": "Too combo-y. Not for me.",
    "timestamp": 1756504800
  },
  {
    "username": "Hinmatt",
    "rating": 4.0,
    "comment": "The White Castle is a dice placement and worker placement game with many possible options on your turn and the possibilityto build an effective engine. It has the typical eurogame feeling of having to play as efficiently as possible to get many points while the theme is not relevant.\nIt's not my kind of game. The many different options can feel overwhelming and the game doesn't look appealing. And verbal communication between the players is low, it can be quite a silent game.\nIf you were into challenging, puzzly eurogames, you might like this one though.",
    "timestamp": 1754431200
  },
  {
    "username": "Zaungast",
    "rating": 4.0,
    "comment": "Box still too big for soulless combos of icons.",
    "timestamp": 1752444000
  },
  {
    "username": "Weirdsalmon",
    "rating": 4.0,
    "comment": "4/10: The White Castle is absolutely unique and absolutely gorgeous, I just hate the gameplay.\n\nIt’s simply too tight for me that’s the easiest way to say it. Truly unforgiving at two player, perhaps I would dislike it less at a higher player count. It feels like this game take forever considering how little I feel we do throughout the game.\n\nAt the end of the day I’d just like to play other games.",
    "timestamp": 1751925600
  },
  {
    "username": "nhjelmberg",
    "rating": 4.0,
    "comment": "If you enjoy choosing between many different resources to combine many different actions into many different victory point sources in a limited number of rounds as efficiently as possible, you will love The White Castle. Personally, I don't.",
    "timestamp": 1747087200
  },
  {
    "username": "Qhorin",
    "rating": 4.0,
    "comment": "Excellent balanced strategic choices with few actions, but completely flavorless.",
    "timestamp": 1747087200
  },
  {
    "username": "leszekomega",
    "rating": 4.0,
    "comment": "Gra sucha do bólu! Nudna, o ograniczonej liczbie ruchów, braku interakcji między graczami. Słowem, łączy ze sobą niemal wszystkie najgorsze możliwe cechy gier planszowych.",
    "timestamp": 1746655200
  },
  {
    "username": "quietcorn",
    "rating": 5.0,
    "comment": "Incredibly tight game. You get nine actions to get everything you need to do done. It's impossibly tight. You desperately need to set up moves that combo into other moves. The game has a nice tension between building up an action's effectiveness for later vs actually banking points. It's a good puzzle with very little player interaction other than they'll take the dice you need to resolve your actions, or bank the card that held the action space you were counting on activating. Indirect, semi-accidental messing with each other.",
    "timestamp": 1762297200
  },
  {
    "username": "globetrotter",
    "rating": 5.0,
    "comment": "Nice game in the beginning, but frustrating after a few games, because there are so few total actions.\nTime to sell off....",
    "timestamp": 1760911200
  },
  {
    "username": "dj_koen",
    "rating": 5.0,
    "comment": "Im not a fan of this game actually even though it looks nice\n\nThe game mechanics feel inconsequential and the gameplay is way too finicky in that its mostly about overcalculating minute details",
    "timestamp": 1760133600
  },
  {
    "username": "Cocoabine",
    "rating": 5.0,
    "comment": "5/10: Lots of combo-making (combo-wombos), over-thinking, thumb-twiddling waiting for other players to finish their turn, multiplayer-solitaire. Not really for me.",
    "timestamp": 1759528800
  },
  {
    "username": "Bayernfan",
    "rating": 5.0,
    "comment": "Nagy csalódás nekem ez a játék, talán a túl nagy hype miatt vártam tőle valami extrát, de igazából a szabálytanulás közben már elvérzet, mert egyszerűen ezek a mechanikák nem érdekelnek engem és a témája sem menti meg (ami ugye gyakrolatilag nincs). Ennek elenére azért játszottam vele, van egy flowja a játéknak, de nem én vagyok a célközönsége.",
    "timestamp": 1758664800
  },
  {
    "username": "FranzK",
    "rating": 5.0,
    "comment": "I enjoyed trying this game - there are lots of options to combo, and I like the action card variability throughout the game. There is not enough here for me to want to play this over so many other games, though.",
    "timestamp": 1758405600
  },
  {
    "username": "pitonowie",
    "rating": 5.0,
    "comment": "- Castles of Burgundy make it way better -\nMake combos game and foremost it's mostly solo game - not my cup of tea - but dice drafting and worekr placement make some interaction, so I rate it as a 5.\nFor me it's a game like many others and in fact quite easy to make combo chains. No desire to play.\nBut, as it is - works OK, no complain about (solo & combo) mechanics. For fans of that genre it should be a good game.",
    "timestamp": 1757368800
  },
  {
    "username": "Kirbite",
    "rating": 5.0,
    "comment": "BGA",
    "timestamp": 1756936800
  },
  {
    "username": "TheGoddamnDuke",
    "rating": 5.0,
    "comment": "Not my style of game, interaction is very poor.",
    "timestamp": 1756764000
  },
  {
    "username": "silenceisgolder",
    "rating": 5.0,
    "comment": "Against my usual inclinations, I really enjoyed scanning the board for opportunities to chain together actions and make the most of my limited turns in this game. The White Castle is one of the nicest games in its idiom that I've played: pure efficiency, mostly non-interactive, and all about squeezing the most out of each opportunity that comes your way.\n\nUpdate: I finally played Troyes for the first time and it soured me a bit on this game. This was still good, and I'd play it, but I think my estimation of it really benefitted from my not having played the seminal game in the genre.",
    "timestamp": 1756677600
  },
  {
    "username": "FinalArrow",
    "rating": 5.0,
    "comment": "Not sure about this one. Played it 3 times and it left me with a \"meh\" feeling. The setup and teardown take longer than playing the game itself. It's a game of \"let's see who can find the best combo possible\", and thus leading to all players just sitting there in AP planning their optimal turn, until the player before them takes the die they wanted, and then they have to AP some more. Also, performing minor actions (going to the well, or a simple action which does not trigger any combos) just feel bad because of the small number of overall turns. I really expected and wanted to love this game, given that I absolutely adore The Red Cathedral, but I was left somewhat disappointed.",
    "timestamp": 1756677600
  },
  {
    "username": "Jclancy15",
    "rating": 5.0,
    "comment": "Does a good job of being a tight pure euro.",
    "timestamp": 1756332000
  },
  {
    "username": "waterborg",
    "rating": 5.0,
    "comment": "Solo: never a win.\nSeen the White Castle. I have been there.\nToo complicated",
    "timestamp": 1755640800
  },
  {
    "username": "Joeristoef",
    "rating": 5.0,
    "comment": "Geekmarket",
    "timestamp": 1754517600
  },
  {
    "username": "jeremysprofile",
    "rating": 5.0,
    "comment": "worker placement with dice constraints. Constraint implementation was unique, but was not interesting enough to make it better than the average engine builder.",
    "timestamp": 1750629600
  },
  {
    "username": "maritn",
    "rating": 5.0,
    "comment": "Too much of a typical modern eurogame. I'm just cross referencing icons and placing dice without a sense of theme.\n\n+ Setting...\n\n- ... but theme not coming through. Felt mostly abstract.\n- Multiplayer solitaire",
    "timestamp": 1748988000
  },
  {
    "username": "CarsonChandler",
    "rating": 6.0,
    "comment": "Ended up being a little too brain-burny for me. I prefer more interaction, although the combos are a lot of fun. One of my favorites to play async online.",
    "timestamp": 1762649100
  },
  {
    "username": "sorcretic",
    "rating": 6.0,
    "comment": "Why I culled it (Sep. 2024): I liked this fine, but not enough to keep it. I need a strong hook to hang on to a midweight Euro and I didn’t find one here. There's low interaction and low theme. To its credit, it does have a tight action economy, but I wasn’t compelled by what the actions accomplish: Move up a track here, gain a bonus there, standard Euro stuff that I found somewhat uninspired.",
    "timestamp": 1762621260
  },
  {
    "username": "curtc",
    "rating": 6.0,
    "comment": "1 play. Been a while so I forget the details.",
    "timestamp": 1762297200
  },
  {
    "username": "heathbarATL",
    "rating": 6.0,
    "comment": "(TTS) Very interesting mechanisms. Also, a very tight game, with only 9 actions. I like it, but it is too constrictive. Variable setup can create weird game states.",
    "timestamp": 1761692400
  },
  {
    "username": "mr_minning",
    "rating": 6.0,
    "comment": "Only played online",
    "timestamp": 1761429600
  },
  {
    "username": "shoemoney",
    "rating": 6.0,
    "comment": "Oustanding production, middling rulebook, excellent design. The dice drafting twists of dice stacking and having other dice in the sequence shift down into emptied spaces are inspired and lift the game even another notch. And yet. There is a small but not insignificant part of the game that remains unsatisfying. The game is so short and so tactical (as opposed to strategic) that it lacks, just a little but enough to matter, a sense of progression. And the nine turns allow for only the smallest amount of engine building (from your domain dice spaces or lantern tableau), which lacks the fulfilling frisson associated with similar mechanisms in longer games. Still, the game never claimed to be anything but what it is: a short, punchy, well-developed euro.",
    "timestamp": 1760911200
  },
  {
    "username": "CanSolo",
    "rating": 6.0,
    "comment": "Just not for me solo.",
    "timestamp": 1760565600
  },
  {
    "username": "Takhyon",
    "rating": 6.0,
    "comment": "Aight so this is a weird one. It’s mechanically a rock solid game, there’s fun to be had with the tight efficiency puzzle of only getting nine turns the entire game and chaining actions together - even though this is pretty much pure JASE for me. I’m not usually even that bothered about innovation per se, but for some reason this game was so obviously a yet another riff of this genre, and I was just doing the typical “euro stuff” I’ve already seen so many times before.\n\nThe fact that it’s very mechanical and themeless probably didn’t help, I don't know how to explain it, but all the pretty components and colours weren’t enough to hide the math behind it all. So while my euro brain finds entertainment in seeing gears turning and comboing different icons together, I wasn’t particularly invested in anything I was doing. However the amount of gameplay it packs to such a small box and short playtime is something to be commended these days, and I would definitely be up to playing this if asked despite it lacking a spark for me.\n\nAlso this game just came out at the wrong time for me, two years ago it would’ve probably been exactly my jam. Nowadays I just find myself tiring of these “you only get X turns the whole game!” -designs, which give you a very limited amount of turns but involve constant comboing all over the place in ridiculous bonus chains, with the fiddle and the downtime ballooning to outrageous proportions. I don’t understand what designers have against micro-turns these days. I swear one of these days someone is going to unironically come up with a design where you only get to take one action the entire game.",
    "timestamp": 1760392800
  },
  {
    "username": "shmonkey",
    "rating": 6.0,
    "comment": "You only get nine turns. But in probably half or more of those, you'll be able to do a cascading chain of combos. So you have an idea of one main thing you want to do and then you have to scan the board hard to see if there's a way to get like three more things out of it. It's one of those games where everyone's going to just be intently staring at the board because they're trying hard to figure out how to do their next turn.\n\nIt's short, it's thinky, I simultaneously liked and disliked the intensity. I think it's a great game, but I also don't know how often I'm up for that level of mental effort.",
    "timestamp": 1759874400
  },
  {
    "username": "Legomancer",
    "rating": 6.0,
    "comment": "Worker/dice placement game that isn't bad but also nothing particularly captivating.",
    "timestamp": 1759183200
  },
  {
    "username": "Mayasty",
    "rating": 6.0,
    "comment": "Classic euro with all cons of the genre and few general pros:\nPros:\n- Surprisingly compact box to what it contains. It can compete with e.g. Raiders of Scythia, Pax Transhumanity, Pax Emancipation, Pax Illuminaten.\n- Short playtime: 70 minutes for 4 players\n- Easy rules\n- Although dice management has been successfully implemented in other euros like Grand Austria Hotel, Troyes, Fishwater Fly this one is still original.\nCons:\n- Zero interaction. Solitaire like experience on collecting VPs from everywhere. Probably the best in solo mode. Not for my temperament.",
    "timestamp": 1759096800
  },
  {
    "username": "midnightfaerie",
    "rating": 6.0,
    "comment": "2025",
    "timestamp": 1757628000
  },
  {
    "username": "mybiggestanemone",
    "rating": 6.0,
    "comment": "I played it quite a lot on BGA. I'm suprised this is mainstream considering it's a pasted on theme and it has this complicated scoring.\n\nThe daimyo track is only a viable route in the few games that you see the 3 daimyo thing on the right side of the board.",
    "timestamp": 1756764000
  },
  {
    "username": "arutgers03",
    "rating": 6.0,
    "comment": "PAX West 2025\nMaybe a bit too heavy -- slow tempo throughout",
    "timestamp": 1756677600
  },
  {
    "username": "frotes",
    "rating": 6.0,
    "comment": "Initial Impression:\n\ngreat mechanics. i like the dice/worker drafting, randomized cubes/start seems good too. those are the main draw for me\n\nthe theme doesn't speak to me so it all feels a bit abstract. minor but kind of wish there was a bit more to building up your lantern stack. the initiative track is good in-game but odd that it has a seal req and the endgame vp from it stinks\n\ncan play fast enough but overall I'd prefer other games in this space",
    "timestamp": 1756591200
  },
  {
    "username": "uniquegino",
    "rating": 6.0,
    "comment": "It's a textbook medium Euro with nice components and good-looking art., but nothing feels new or cleverly fun. Solid game, just lacking charm to stay in my collection",
    "timestamp": 1756591200
  },
  {
    "username": "keighleyrob",
    "rating": 7.0,
    "comment": "It’s fine.\nCan’t see the hype behind it, I found it a bit boring.",
    "timestamp": 1762383600
  },
  {
    "username": "Suleckja",
    "rating": 7.0,
    "comment": "A lot to do in the game but very cool with tons of variety, just need the right group for this one as it is pretty complex to teach (and learn).",
    "timestamp": 1762124400
  },
  {
    "username": "Neluran",
    "rating": 7.0,
    "comment": "Very good dice worker placement game. It's fast, combos are great but something feels off. On paper I should like it more than I do and I'm not really sure why that is.",
    "timestamp": 1761951600
  },
  {
    "username": "sebastiansong",
    "rating": 7.0,
    "comment": "A highly interactive nine turn game where players try to economize their actions asap. AP can be a slight issue as players don’t want to FOMO. But the dice rolling and setup cards allows high replay ability",
    "timestamp": 1761519600
  },
  {
    "username": "hoffswell",
    "rating": 7.0,
    "comment": "Bday 2024",
    "timestamp": 1761343200
  },
  {
    "username": "Razcar",
    "rating": 7.0,
    "comment": "Initial Rating: 7\nFirst game of the con. Would like to play this again at 3P to see how the board may open up. Was starting to get in the groove of the game and then it ended. It did the opposite of overstaying its welcome. I felt like I played a demo and was told to end the game. This could have some good replayability since there seem to be many paths to victory and you can't just dabble in a few. I dabbled in the first game, I would go into it with a set strategy and focus on that the next game (only focus on moving up the castle, only focus on the gardeners, etc)",
    "timestamp": 1760911200
  },
  {
    "username": "FiveEels",
    "rating": 7.0,
    "comment": "Solid game, super pretty. Just found the decision space tricky to wrap my head around and maria found it miserable + frustrating.",
    "timestamp": 1760824800
  },
  {
    "username": "ooogene",
    "rating": 7.0,
    "comment": "My one play on BGA was enjoyable. Some tight decisions once I figured it out. I could see this being a hit IRL as well if I get opportunity.",
    "timestamp": 1760652000
  },
  {
    "username": "YoLYcmqZ",
    "rating": 7.5,
    "comment": "Thoughts: This doesn't look it, but it's a heavy dice placement euro. A bit fiddly to setup but plays quick—too short to be honest. Can be hard to see the strategy before it's too late. Setup is very random, turns are very random. BGA improves setup but can be harder to see combos. When it clicks it's brilliant, just wish there were more turns to execute your plan.\n\nTag(s): Dice Placement, Heavy Euro, Quick\nBest Player Count: 1-4, {3}\nRating: 8, -0.5\nOwn: Physical\n\nFor Sale: $25, including 3DP insert.\n(Amazon: $39, GN: $32)",
    "timestamp": 1762693260
  },
  {
    "username": "mOCHU035",
    "rating": 8.0,
    "comment": "*The White Castle: More Than Just Sliders!*\nLet me be clear: I like White Castle, the slider joint. But I love The White Castle, the board game, a whole lot more! This game packs an incredible punch, and here's why:\n\n*Smart Package*: It comes in a reasonably small box with a great price point.\n*Quality Components*: The components are nice, perhaps even a touch overproduced in places.\n*Deep Yet Accessible*: It boasts amazing strategic depth and meaty player interaction, yet the rules are surprisingly easy to explain (around a 2.5/5 complexity).\n*Engaging Decisions*: The decision space, however, is incredibly deep (I'd rate it a 3.5-4/5).\n*Efficient Playtime*: It plays satisfyingly quickly, typically between 45-90 minutes, across just 9 turns (or 12 with the expansion).\n*High Replayability*: Fantastic setup variability and enough round-to-round twists keep you constantly engaged.\n*Great Expansion*: There's also a solid expansion available when you're ready for more.\n*My only minor quibbles?* The scoreboard annoyingly caps at 40 (requiring you to track \"40 + something\"), and the turn order marker is comically oversized.\n\n*The Goldilocks of Dice Drafting*\nThe game features one of the best implementations of dice drafting I've encountered in a Eurogame. I've often felt frustrated by games like Castles of Burgundy, where dice rolls can feel overly impactful on your fate. While skill is definitely involved, a single rough roll can significantly swing your score in a game often decided by tight margins. On the other end, games like Crystal Palace let you choose any die face but you have to pay for the die value. While this is quite elegant, in actual play, it slows things down a lot because it front loads a significant amount of decision making and removes a significant bit of intrigue from the game.\n\nWhite Castle hits the sweet spot. Dice values absolutely matter, but crucially, they're rolled into a common pool from which players draft in turn order. Lower value dice offer different advantages compared to higher ones, and the three dice colours matter in specific situations. This simple concept of a shared pool with meaningful trade-offs is brilliant – many other games that have dice drafting as a core mechanic could learn from this! (Incidentally, Saltfjord is another game that does this quite well - but not as well).\n\n*Emergent Strategies and Endless Variety*\nWhat else shines? The setup variability is phenomenal. You only perform a small handful of actions (just nine throughout the game, spread over three rounds with income phases), but the way the board is set up each game dramatically alters strategies. In our initial plays, reaching the end of the initiative track seemed impossible. Then, one game, the setup allowed me to max it out with actions to spare! Actions or paths that seem weak initially can suddenly become incredibly powerful depending on the game's configuration. The emergent gameplay patterns are diverse and consistently interesting.\n\n*Final Thoughts*\nIn summary, White Castle is a fantastic game. It has firmly cemented its place in my all-time Top 10.\nA quick note on the expansion- it definitely adds layers, turning 3D chess into 4D chess. I enjoy the added complexity, but I can see how some might find it a bit much initially. Honestly, the base game offers so much replayability; you could easily get 50+ plays out of it before feeling the need to mix in the expansion.",
    "timestamp": 1762664820
  },
  {
    "username": "Bethobrien",
    "rating": 8.0,
    "comment": "Very good game - quick and strategic",
    "timestamp": 1762640820
  },
  {
    "username": "torero2024",
    "rating": 8.0,
    "comment": "Rating based on BGA only.",
    "timestamp": 1762470000
  },
  {
    "username": "ingg",
    "rating": 8.0,
    "comment": "ㅎㅅ미플 스티커",
    "timestamp": 1762470000
  },
  {
    "username": "Jesenberg",
    "rating": 7.5,
    "comment": "C",
    "timestamp": 1762383600
  },
  {
    "username": "siddhig",
    "rating": 7.5,
    "comment": "+ Matcha",
    "timestamp": 1762383600
  },
  {
    "username": "Scibelius",
    "rating": 8.0,
    "comment": "Bought this little game because of its small size. And for its size it doesn't disappoint at all. It houses a lot of strategic choices. Play it solitary most times.",
    "timestamp": 1762297200
  },
  {
    "username": "Papinek",
    "rating": 9.1,
    "comment": "Un brainburner par excellence ! Avec l'extension encore mieux ! La durée pour une partie ne se prolonge pas vraiment à 2 ou 3 ! Une vraie réussite ! Le mode solo est magnifique ! Un Highlight 2023",
    "timestamp": 1762598460
  },
  {
    "username": "Bigroux",
    "rating": 9.0,
    "comment": "Pros\n\n+ Love the pacing; 3 rounds of 3 dice placements making it quick, tight and every move counts!\n+ High variabilty of setup keeps it fresh and engaging through repeated plays.\n+ Nice production for a low-cost small box Euro game.\n+ Easy to pickup but hard to master.\n+ The bridge (dice drafting) mechanic is quite clever and definitely leads to agonizing decisions and cool interactions.\n\nCons\n\n- I like smaller boxes, this one is a tad too small and it can be a struggle to fit everything back in.\n- The gardeners are stronger the earlier you place them, kind of pulling you into a certain strategic path which I don't love in games.\n- The game can be quite punishing if you aren't careful with your money/resources.",
    "timestamp": 1762297200
  },
  {
    "username": "Fleax",
    "rating": 8.5,
    "comment": "essen 2023",
    "timestamp": 1762297200
  },
  {
    "username": "WindSoul",
    "rating": 9.0,
    "comment": "@ jobbet",
    "timestamp": 1762297200
  },
  {
    "username": "mthomashow",
    "rating": 9.0,
    "comment": "Elegant,wonderful art, tight, tactical, and very appealing.",
    "timestamp": 1762210800
  },
  {
    "username": "Apollox5280",
    "rating": 9.0,
    "comment": "I like it a lot! A really tight euro, with fun and satisfying mechanics. Really hits a sweet spot in length, and as a bonus it plays really nicely at 2 players. The worst part about it is the inconveniently small box that really needs some kind of insert. Other than that, I can't wait to get it to the table again, which should be easy considering the length. A buttery smooth, razor-sharp game.",
    "timestamp": 1762210800
  },
  {
    "username": "Kumarl765",
    "rating": 9.0,
    "comment": "Solo mode is very good!\nNotice:but I playing Rules of BGA Easy mode.",
    "timestamp": 1762038000
  },
  {
    "username": "Ryyva",
    "rating": 9.0,
    "comment": "I do find myself\nRather quite fond of combos\nIn a small package",
    "timestamp": 1762038000
  },
  {
    "username": "Anks",
    "rating": 10.0,
    "comment": "Edited Solo Mode",
    "timestamp": 1762383600
  },
  {
    "username": "juampiok",
    "rating": 9.5,
    "comment": "Juego remil combero, tiene bastante dinamica, varias cosas por hacer con 1 solo turno, me parece un juego increible con un diseño hermoso!, tiene su complejidad, ya que quien espera el turno, no puede diseñar su partida ya que si le colocan un dado donde el queria jugar, se va a tener que replantear todo su turno.",
    "timestamp": 1762383600
  },
  {
    "username": "mathieulabelle73",
    "rating": 10.0,
    "comment": "9 tours c'est peux, mais ca fait bien reflechir et aux final plutot sympas, des combos et beaucoup de choix.",
    "timestamp": 1762038000
  },
  {
    "username": "mtafti",
    "rating": 10.0,
    "comment": "A bit confusing at first, but fun to play once you know the rules",
    "timestamp": 1761519600
  },
  {
    "username": "el_crosso",
    "rating": 9.8,
    "comment": "Great production, love the setting and solid gameplay too.\n\nI will need to play it more to give this air to grow on me. I should have loved it, but I did not yet.",
    "timestamp": 1761084000
  },
  {
    "username": "GabrielMarmol",
    "rating": 10.0,
    "comment": "\"The White Castle\" is everything online reviewers have talked about since its release and more. Just loved it since the first time I played it! Don't forget to purchase the \"Matcha\" expansion to add a good layer of strategy to your gaming session.",
    "timestamp": 1760824800
  },
  {
    "username": "abaloo",
    "rating": 10.0,
    "comment": "Expert, placement d'ouvrier / dés : 3,4 joueurs",
    "timestamp": 1760479200
  },
  {
    "username": "ShinyUmbreonTCG",
    "rating": 10.0,
    "comment": "Such a great efficiency game. Solo is very hard, but makes me want ti play it even more. Playing 2p is also a lot of fun. Cannot wait to try the expansion soon.",
    "timestamp": 1760392800
  }
]