[
  {
    "username": "AthenaDog",
    "rating": 1.0,
    "comment": "No Longer Own\n\nCompleted Box 1, then stopped playing",
    "timestamp": 1746655200
  },
  {
    "username": "kenh1967",
    "rating": 1.0,
    "comment": "This is perhaps the worst game that I have ever played - considering how many hours my gaming group put into this. Cannot believe that we slogged our way through till the end. We all enjoyed Season 1 so much that we kept hoping for just a little bit more of the magic.\n\nBut Season Two never delivers. Just a mush mash of rules, a confusing storyline, and an entirely brutal ending that is nearly impossible to win.\n\nThis game was a frustrating disaster. And, for the record, we logged ten wins. But when we won, it was mostly not even fun. And when we lost, especially at the impossible end, it was like, “No kidding, we had zero chance.”\n\nI cannot understand how people can score this above a two. I get that we all have different tastes, but didn’t think anyone liked eating a rotten fish. And this game is a rotting fish.",
    "timestamp": 1746223200
  },
  {
    "username": "Elaundar",
    "rating": 1.0,
    "comment": "Our group absolutely LOVES Pandemic and enjoyed every moment of S1. It deserves all the praise that game gets. It is balance is razor sharp. Your actions matter, your characters are meaningful.\n\nHowever, that is season 1.\n\nSeason 2 is honestly one of the poorest designed games I have ever played. From prolog to points at every stage we wished we were playing something else. It is unapologetically mean to the players and will never let you forget that you are supposed to lose (and a vast majority of you will lose).\n\nUnlocking areas often punish you, the mechanics introduced that seem to help you can hurt you later. If you are too lucky or too quick in the early games you can get yourself into a situation towards the end that is nearly impossible to overcome. If you are too unlucky or too late in the early game you will paint yourself in just as punishing of a corner.\n\nThis is BEFORE you take into account that the entire game requires a running spreadsheet to calculate where and when the next unavoidable card that really hurts you will be.\n\nAt no point, none, did it feel like we were ahead of the curve. At no point were we able to develop a rhythm or get a sense of achievement. It was so bad that ultimately when the twist came, our table was like \"yeah, that explains why we suck so bad\".\n\nBut its not us, it is the developers. If you love pandemic, skip this - is isn't pandemic, its a card resource management game where deviating slightly from the optimal path will result in failure. If you love S1, go play that again - you will have more fun.\n\nWhat ever you do - DO NOT PLAY WITH 4 CASUAL PLAYERS. If you still want to give it a try, then when you start, play the prolog 10 times. It will be the most fun you will have - and odds are you won't have any fun.",
    "timestamp": 1712959200
  },
  {
    "username": "uduhno",
    "rating": 1.0,
    "comment": "No solo and a legacy game. All games should be easily able to be reset.",
    "timestamp": 1709506800
  },
  {
    "username": "TOOMUCHGOOD",
    "rating": 1.0,
    "comment": "I though they could make it better, I was wrong.",
    "timestamp": 1700521200
  },
  {
    "username": "VariousArtist",
    "rating": 1.0,
    "comment": "Destroying my game? Not an option. Terrible dev decision.",
    "timestamp": 1699830000
  },
  {
    "username": "Ajax2112",
    "rating": 1.0,
    "comment": "I just finished the campaign with my dad. I won't spoil the game out of respect, even though the game has shown no respect at all to its players.\n\nThe gist is: You have no sense of end goal/direction till OVER half-way in. The game punishes you for literally everything you do. And I mean basically everything. Once you do figure out what you were supposed to do you have no time to do it. I could go on and on. It's actually awful. Truely the worst game (Board & Video games included) I have ever played.\n\nWhat you do need to know is, if you manage to put up with the game don't expect to win. Seriously. I don't think Matt and Rob could have designed a more forced-to-lose ending if they tried. I was actually pissed and yelling when I read how you are supposed to \"win\". Trust me, it's rigged. Hated the game all the way through, will never play it again.\n\nOh and story? Your leaders left and it's up to you to stop racism.",
    "timestamp": 1658613600
  },
  {
    "username": "Shadow89",
    "rating": 1.0,
    "comment": "Disliked this game pretty much the whole way through. The story was bad, there was no direction throughout the game as to what you needed to do and the ending was just stupid and completely anticlimactic. I tried to give it a chance but our whole group hated it by the end and it was a slog to even get it to the table at the end.",
    "timestamp": 1630706400
  },
  {
    "username": "Juanabis",
    "rating": 1.0,
    "comment": "Fuera del top 100.",
    "timestamp": 1620597600
  },
  {
    "username": "IvanGrimm",
    "rating": 1.0,
    "comment": "Jokingly predicted the surprise twist a few months in. The story was so uninteresting I couldn't even remember it between games (even games on the same day). Terrible. Turned me off on legacy games and nearly erased my love for the Pandemic series as a whole.",
    "timestamp": 1599170400
  },
  {
    "username": "Cowtippa",
    "rating": 1.0,
    "comment": "I hate this game as much as I love s1.",
    "timestamp": 1594936800
  },
  {
    "username": "Ddcutlet",
    "rating": 1.0,
    "comment": "liked this even less than the last legacy game",
    "timestamp": 1593295200
  },
  {
    "username": "ryanlhjess",
    "rating": 1.0,
    "comment": "Great follow up to season one looking forward to season 3",
    "timestamp": 1581634800
  },
  {
    "username": "Meltzy",
    "rating": 1.0,
    "comment": "This game is way too hard for my taste. Punishing.",
    "timestamp": 1576882800
  },
  {
    "username": "kackarschen",
    "rating": 1.2,
    "comment": "2-4 Spieler",
    "timestamp": 1575673200
  },
  {
    "username": "SrFinn",
    "rating": 1.0,
    "comment": "Not a game.\nIt's a puzzle.. which you are expected to do over and over..",
    "timestamp": 1574895600
  },
  {
    "username": "sykano",
    "rating": 1.0,
    "comment": "yes, big twist on the \"Pandemic\" game core\nbut legacy, story-driven and not that good\nnothing what I would want",
    "timestamp": 1571868000
  },
  {
    "username": "Omertron",
    "rating": 1.0,
    "comment": "As if the original wasn't bad enough, they made another? sheesh.\nSomeone needs to stop wringing this cash cow and come up with an innovative game.",
    "timestamp": 1557439200
  },
  {
    "username": "mellman99",
    "rating": 1.0,
    "comment": "This game did not resonate with us AT ALL. We played 22 times because we did so poorly. We felt misguided, and it felt so different from other pandemics that we felt like we were constantly doing it wrong. We played this over the course of 12 months almost to the day, occasionally getting 2 plays in a session. It was just rough. The story was not engaging.\n\nFor the record pandemic is not one of my favorite games, but I loved Season 1. My group (same group we played season 1 with) also loved Season 1 and did not enjoy Season 2 at all.",
    "timestamp": 1544223600
  },
  {
    "username": "skifreak737",
    "rating": 1.0,
    "comment": "Just lost March 4x in a row between the two games I'm running -- lost 2x last night and 1st try in April, 2x today with Faye, even knowing what needed to be done all too well. I HATE games in which you have lost due to the opening shuffle of the cards but don't know it until you've played it out, your actions cannot possibly do more than delay the defeat, and that is what happens in this game in this month. It's rating and ranking have just taken a MAJOR dive.\n\nEDIT: Just lost May 2x, again due to the opening shuffle, defeated on the 4th turn due to 8 Incidents with no way to stop them. FINALLY were able to get to Lost Haven & get more cubes -- too late. Were never able to draw enough cards to Recon Europe, either. Rating now down to a 3. I'd lower it to a 2, but I'm not going to quit on Faye.\n\nEDIT: Just got slaughtered in both tries of December. The game IS broken. Utterly impossible to win without massive cheating or an unbelievable string of good luck. I don't think you'd have better than a 1/10 chance of winning even if you KNEW everything you needed to know at the beginning of the campaign. Words cannot describe my outrage and feeling of being ripped off.\nThis game is a textbook example of throwing in mechanisms that, as delightful and innovative as they may be, simply do not work well together -- in this case, because you do not have TIME to do what you need to do. And WORST OF ALL: you are often screwed from the opening shuffle of the cards, but you will not know it until you've wasted your time trying to overcome the impossible.\nThe last condition of forcing the carrier to ALSO have the necessary collection of cards to make way to Johannesburg is unfathomably stupid in concept -- unless you're trying to ensure a loss.\nWill not likely trust this designer any time soon.\nFINAL RATING = ZERO!\nWe will enjoy the game burning party...",
    "timestamp": 1539295200
  },
  {
    "username": "Bonjour374",
    "rating": 1.0,
    "comment": "Has to be the dumbest thing I have ever played!",
    "timestamp": 1537912800
  },
  {
    "username": "Gamear",
    "rating": 1.0,
    "comment": "Very expensive game, but cheap shabby plastic material. The innovation is, compared to Season 1 and standard Pandemic, you take away cubes rather than putting cubes on the board. We played until May and then gave up totally frustrated. You can´t win this game without having a lot of luck. Afterwards, I read, you need to scratch free a certain card to have a chance to make it. Well, we scratched free a lot of cards, but eventually not this one. Unplayable game!\nIf you want to play a good cooperative game, try out Robinson Crusoe, The Dwarves, Magic Maze, Talisman Legendary Tales or Gloomhaven!",
    "timestamp": 1532469600
  },
  {
    "username": "erc1971",
    "rating": 1.0,
    "comment": "By far the worst board game I have ever played, which is surprising because our gaming group found Season 1 to be the best board game they have ever played.\n\nThe difficulty on this game is so ridiculous it is impossible to even begin to get going before you lose. More often than not, the game was over before we got around the table two times, meaning after all the time spent in set up and strategy talk, some players got 1 turn before the game ended.\n\nAvoid at all costs, play season 1 instead!",
    "timestamp": 1532210400
  },
  {
    "username": "tompa",
    "rating": 1.0,
    "comment": "First of all, Pandemic was always one of my favourite games. Until I played first legacy season. Continuous changing of rules, hundreds of new rules and almost no consistency made me dislike the game. It became torture.\nSecond season managed to top this by defying every possible logic. It actively demoralizes players and managed to make me dislike Pandemic altohether. HThanks guys, for ruining it all!\nAddition after August, II season: I seriously suspect the authors of this game designed it to deliberately make you hate Pandemic! WHY????",
    "timestamp": 1523743200
  },
  {
    "username": "Tiggz",
    "rating": 1.0,
    "comment": "Legacy games are an affront to God.",
    "timestamp": 1523397600
  },
  {
    "username": "Mar2828",
    "rating": 1.0,
    "comment": "Legacy...Yak..Boardgames should NOT be disposable...",
    "timestamp": 1518649200
  },
  {
    "username": "Gaborpesti",
    "rating": 1.0,
    "comment": "The original cards and the ones at the boxes have different background color....",
    "timestamp": 1514761200
  },
  {
    "username": "Luds",
    "rating": 1.0,
    "comment": "Same issues as season 1.",
    "timestamp": 1514588400
  },
  {
    "username": "RaffertyA",
    "rating": 1.0,
    "comment": "A crass commercialism game that is designed to be destroyed as it is played will always merit a 1 from me.",
    "timestamp": 1511391600
  },
  {
    "username": "Vasto4Lorde",
    "rating": 1.0,
    "comment": "Legacy==1 .Also, balance for obvious reasons.",
    "timestamp": 1509228000
  },
  {
    "username": "sh0s",
    "rating": 2.0,
    "comment": "Awfull production quality (Dutch version), crappy transaltion, scratch surface that you can't scratch without damaging the card.... boring/repetitive gameplay...",
    "timestamp": 1748124000
  },
  {
    "username": "dzyosh",
    "rating": 2.0,
    "comment": "Didn't survive the fire ritual ?",
    "timestamp": 1731884400
  },
  {
    "username": "Maced",
    "rating": 2.0,
    "comment": "Started off fun but about halfway through the game, the rules and extra crap you have to keep up with turn it into a terrible experience.",
    "timestamp": 1729288800
  },
  {
    "username": "cbflyer",
    "rating": 2.0,
    "comment": "Complete flop for us. Didn't make it through. Large rules overhead. We must have missed a few rules that made a very significant impact in our games and by half way through we just stopped as it didn't make sense to continue. Season 1 and season 0 were awesome and some of my top gaming experiences with the same group - unfortunate that this one didn't sit well with us.",
    "timestamp": 1689544800
  },
  {
    "username": "mvoltaire",
    "rating": 2.0,
    "comment": "This game was a christmas present. I have never played Pandemic or Pandemic Legacy Season 1, so this is a rating purely based on this game.\n\nWe played the game with 2 players. To us, it seemed far too easy. We lost 3 times in total, all other games we won. Maybe we missed something in the rules or we just had a good combination of characters and the right ideas at the right moments, I don't know. After we found our strategy, it felt quite repetitive - every game was basically the same all over again with a few different objectives. Therefore, it took us quite a while to finish all months and the last one we only played to be done with the game.\n\nThe quality of the components is nice, but so many things get destroyed and in the end, you can basically through out the game. That seems like a total waste. I wonder, if you couldn't have the same experience of a legacy game with resettable components. Then you could pass on the game to someone else after you had finished.\n\nThis was very disappointing and I am not interested in playing it again.",
    "timestamp": 1688940000
  },
  {
    "username": "V omax",
    "rating": 2.0,
    "comment": "As of 11/11/17 we've played nine total games.\nPrologue: 2 plays, both wins\nJanuary: Win\nFebruary: Win\nMarch: Win\nApril: Loss/Loss\nMay: Loss/Loss\n\nGetting the feeling that there's no choices that actually affect the story (also realizing that that was true with Season 1). The most important things and major mechanics will get revealed whether you win or lose. The game has been very punishing with a bland, forgettable story so far. The fact that you can get a plague cube DURING SET UP is one of the worst mechanisms I've ever seen in a game. I do want a challenge but I also don't think getting demoralized right off the bat is fun in the slightest. Makes me not want to even waste my time. We crushed the first season in four days, season 2 is going to get shelved after these nine plays and we'll see if we ever finish it. Not sure that Legacy games are for me after all.",
    "timestamp": 1685656800
  },
  {
    "username": "Irsaan",
    "rating": 2.0,
    "comment": "After only 2 plays, I have to rate this much lower than Season 1. Makes less sense, is less fun, and the component quality (specifically the stickers) is absolute garbage. Barely sticking actions, the *incredibly tiny January spoiler* 'Mandatory Objective' sticker not lining up with the creases on the board even if you line it up with the Latitude and Longitude lines. Don't get me wrong, we'll still 100% finish it, but we are NOT impressed.\n\nUpdate after 4 plays: components are actually worse than I originally thought, and the massive increase to difficulty is majorly taking away from the fun of the game. I'm no longer sure we'll even bother to finish.\n\nUpdate after 3 more plays: I actually can't believe the way this game piles difficulty on top of difficulty. We've lost more games so far by April than we lost in the entire playthrough of Season 1. We're going to make a few changes to the game to see if it even becomes possible. The action economy is completely untenable.",
    "timestamp": 1685224800
  },
  {
    "username": "Crovax20",
    "rating": 2.0,
    "comment": "The RNG in this season is just lame. Multiple losses just because of unlucky draw making it impossible",
    "timestamp": 1677970800
  },
  {
    "username": "Daijoubu",
    "rating": 2.0,
    "comment": "My group found it punishingly difficult. So much so, that it just wasn't fun. It's a shame because we enjoyed season 1.",
    "timestamp": 1676761200
  },
  {
    "username": "TroyNyne",
    "rating": 2.0,
    "comment": "Let's be honest here, this game has great ideas but suffers from one major flaw - it is WAY too hard. We played through S1 and were able to keep our funding level at 2-4, a fun win/loss ratio. In this game we have played 3 months and lost 5/6 games. This is not fun, and the game introduces way too much to screw you over and you can't recover. I'm not having fun, my group is not having fun, we are done. What a disappointment.",
    "timestamp": 1672441200
  },
  {
    "username": "phil_nw",
    "rating": 2.0,
    "comment": "Played to June, but whole group generally found it a slog and not enjoyable, losing most months twice to what seemed like punishing mechanics. We found it very difficult to complete recon objectives and keep the board state healthy at the same time. A big disappointment after enjoying season 1 so much.",
    "timestamp": 1668380400
  },
  {
    "username": "MenendezdeAviles",
    "rating": 2.0,
    "comment": "Won’t play ever again.",
    "timestamp": 1667516400
  },
  {
    "username": "Mentat1231",
    "rating": 2.0,
    "comment": "Up to April... This game is MEAN! It is really really hard, unless you get some lucky draws from the both decks. But, the story is starting to evolve, so it's very interesting. We'll see.....\n\nWe give up. It's not fun to just keep getting beat up like this. I don't understand how anyone enjoyed this game, unless they just had substantially better luck with it.",
    "timestamp": 1664920800
  },
  {
    "username": "DrWildcat",
    "rating": 2.0,
    "comment": "I thought this was a dramatic step down from Season I (and I was disappointed with it). Even with a great group to play with this game stunk.",
    "timestamp": 1654380000
  },
  {
    "username": "Goldrodor",
    "rating": 2.0,
    "comment": "This game is hot garbage. Long setup, tedious play and a statistically negligible chance for any outcome besides total failure. Two stars for the satisfaction of throwing this piece of shit in the trash when it was over.",
    "timestamp": 1635026400
  },
  {
    "username": "sparkydvl",
    "rating": 2.0,
    "comment": "Couldn't hate this game more. What a let down after season 1. So ambiguous about goals and brutal when not making those goals that we just kept failing and could never break the cycle. No fun at all, ended up destroying it for parts after 5 games.",
    "timestamp": 1630706400
  },
  {
    "username": "Grahamboni",
    "rating": 2.0,
    "comment": "The first legacy game that my group has ever played that we decided not to finish. The mechanics are totally broken for 4 players, and the beats of the story did nothing to help. Just bad.",
    "timestamp": 1627855200
  },
  {
    "username": "dibrain",
    "rating": 2.0,
    "comment": "So - I wasn't overly enthused with Season 1, but I figured I'd still give Season 2 a shot. This was rough. I rage quit after the early September month back in 2018 and could only bring myself to finishing it now in 2021. Basically, everything I love about Pandemic makes the legacy version of it a complete pain to play for me. The rules were overly convoluted, the manual became less usable over time, mistakes or bad luck magnified into making subsequent games tougher, etc. In the end, we actually did fairly well - won with 740 pts - but I feel it was more luck than anything else. We could have just as easily lost the last game. It was unsatisfying and I really wish I wasn't a completionist and had just tossed this in the trash a long time ago.",
    "timestamp": 1627768800
  },
  {
    "username": "FutureSpec",
    "rating": 2.0,
    "comment": "Made me hate Pandemic (and I loved season 1!). Too many stickers. Too many rules to remember. Too difficult. Misery simulator that gets harder and harder. TOO MANY STICKERS. The game-end upgrades and the rationed events don't feel powerful enough to compensate. Core theme and mechanics not different enough from season 1 to be interesting. My win rate was 25%. Avoid.",
    "timestamp": 1619560800
  },
  {
    "username": "Wilco_13",
    "rating": 2.0,
    "comment": "What a disappointment this game was for me. The normal pandemic I like and understand the objective. Having played through September and lost most games except January and February I was done with it. Constant changing and adding rules makes it difficult for me to understand what my main objective is and those may not be the goals for that month. This was my first legacy game and while I like the concept, I now know legacy games are not for me.",
    "timestamp": 1617660000
  },
  {
    "username": "Serge0118",
    "rating": 2.0,
    "comment": "Such a letdown after season 1. March and april were just afwul. We won all other months first try until october (!) but it just wasn't fun at all. The balance seemed totally off. Way too many actions, winning only just, not leaving room for exploration, so so many annoyances... So we stopped and skipped november and december. We were eager to buy and play season 0, but not anymore. Plenty of other fun games around...",
    "timestamp": 1610146800
  },
  {
    "username": "Pursuatngecko80",
    "rating": 2.0,
    "comment": "Aesthetics - 1/2\nMechanics - 0/2\nInvolvement - 1/2\nGame length - 0/2\nOther - 0/2 (clearly a failure of a legacy game)",
    "timestamp": 1606345200
  },
  {
    "username": "gradman2k3",
    "rating": 2.0,
    "comment": "Not nearly as good as season 1. More difficult that it needed to be and it could not keep my groups interest. I dropped the box when I was taking it out of my car and the box split causing all the components, including the legacy deck,to fall all over the garage floor.\n\nI decided it wasn't worth the effort to put the legacy deck back together so I picked it all up and threw it in the trash.\n\nI will have to think hard before trying season 3 if it is released.",
    "timestamp": 1601416800
  },
  {
    "username": "junesen",
    "rating": 2.0,
    "comment": "I love Pandemic. I disliked the Legacy idea. I hate destroying board games. So I kept away from this series. I finally tried Season 1 on the Tabletop Simulator. We liked it. So I chanced acquiring this since I got some credit at a game store.\n\nWe tried a couple of the prologue games before diving into the campaign. I thought the prologue game was dull. I wouldn't play it if it weren't for the campaign. I would rate the prologue game a 4 (whereas Pandemic is a solid 9).\n\nSomewhere around the middle of the year, we started losing and everything looked bleaker and bleaker. It was taking a long time to set up and we would often lose in 3 turns (10 minutes). Often we had 3 incidents before anybody had a turn. Everybody was discouraged and wanted to give up. It wasn't fun.\n\nWe persevered until September. We then noticed that I placed a sticker in the wrong place (100E instead of 100W). This totally screwed up the campaign.\n\nIt is perhaps wrong to have the rating so low for a mistake on my part. But that is what the Legacy idea is selling. You play it once and you destroy things. The experience is the whole thing. Our experience was horrible and thus the rating. Mistakes happen in games. Sometimes it takes several plays to get the rules right in a complex game. Pandemic Legacy is complicated and it is compounded by having an evolving ruleset. An awful experience caused by a mistake is totally valid and should be counted.",
    "timestamp": 1598824800
  },
  {
    "username": "xmanden",
    "rating": 2.0,
    "comment": "Basically unwinnable if the randomness is against you. After a fantastic time with season 1, we were expecting more, but came away disappointed after 6 losses in a row. No desire to play again.",
    "timestamp": 1597701600
  },
  {
    "username": "NoyoTheKnight",
    "rating": 2.0,
    "comment": "Initially I was positive to the game, but the inability to win the game because we did to good is rediculously bad.",
    "timestamp": 1594677600
  },
  {
    "username": "JasonSaastad",
    "rating": 2.0,
    "comment": "finite fun via legacy litter",
    "timestamp": 1579734000
  },
  {
    "username": "Pmhaasiu",
    "rating": 2.0,
    "comment": "The game is broken and prevents you from finding the map based on the bottleneck that is Black cards.",
    "timestamp": 1579129200
  },
  {
    "username": "starwarior",
    "rating": 2.0,
    "comment": "Low fun/hour. Completed the game, but never an enjoyable session.",
    "timestamp": 1569708000
  },
  {
    "username": "Pura_Vida",
    "rating": 2.0,
    "comment": "Theme is basically Pandemic, which I like, but more expensive and more marketing and totally not sustainable; it' s too exclusive, which means it shuts out other players after the first time; and after 12 games you throw it away. Not my kind of game, I refuse to buy or play it.",
    "timestamp": 1568152800
  },
  {
    "username": "Nonceaux",
    "rating": 3.0,
    "comment": "We were glad it's over",
    "timestamp": 1752876000
  },
  {
    "username": "rws2029",
    "rating": 3.0,
    "comment": "My group enjoyed Season 1, and appreciates Pandemic games in general, but Season 2 has serious problems.\n\nCompared to season 1, season 2 is more complex with no corresponding benefit; the rules are harder to track as the game progresses, and the goal is constantly obfuscated making it difficult to discern a coherent strategy. We completed the game but did not enjoy season 2 in the end. Overall it was a very disappointing experience, and not worth the price in time or money.\n\nAnnoying + will never play again = 2 (rating by definition)",
    "timestamp": 1749938400
  },
  {
    "username": "Oninohugo",
    "rating": 3.0,
    "comment": "Pandemic is great, reverse Pandemic is the opposite of course. Not only they flunked and buried the main mechanic, there's barely anything happening and the last month plays itself.",
    "timestamp": 1737414000
  },
  {
    "username": "doormat",
    "rating": 3.0,
    "comment": "Loved S1, hated this. Became unplayable (as opposed to unwinnable) towards the end if you made the wrong choices earlier.",
    "timestamp": 1736118000
  },
  {
    "username": "tscox87",
    "rating": 3.0,
    "comment": "Certainly the weakest if the trilogy and I think this is full of unintuitive rules, fiddly steps, and much more work than fun. At one point you need to count the number of cards in the deck during the setup step which is just mind bogglingly unfun.\n\nUpdate: after 7 plays I really dislike this game and dread playing it. Each game gets longer and longer (and so does set up accordingly). We never remembered the rules and always had to refresh them.",
    "timestamp": 1735254000
  },
  {
    "username": "CorumCoram",
    "rating": 3.0,
    "comment": "Season 1 is INCREDIBLE.\n\nThis just strays too far and crumbles under it's own weight.",
    "timestamp": 1713218400
  },
  {
    "username": "cscottk",
    "rating": 3.0,
    "comment": "We loved season 1. It is one of my best gaming experiences ever. However, this season is not fun. We are not bad gamers, but this is just loss after loss (often times half way to losing just on setup). I am sure there is some efficiency to playing we are missing, but not that much.\n\nHow this got through playtesting with this type of experience is baffling. If it is part of the narrative they are trying to push, they could inform via story. If it is just bad luck and bad play, that's another thing, but we are struggling bringing this to the table any longer. I have only so much gaming time in my life, and right now I don't want this game to be part of it.",
    "timestamp": 1711494000
  },
  {
    "username": "svinepelz",
    "rating": 3.0,
    "comment": "Soooo done with this game, still two months to go. Kill me now.",
    "timestamp": 1704841200
  },
  {
    "username": "IrwinMFletcher",
    "rating": 3.0,
    "comment": "One of the most disappointing games I have ever played. For reference we have played over 200 games of Pandemic (all versions combined). Season 1 is a 10, full stop. Why do I hate this one? It feels broken. The difficulty curve is weird where it starts on the hard side, then, without any spoilers, it got way too easy for us mid game when it should have been ramping up. We played twice, and are certain we weren't playing wrong. For us it just feels nothing like Seasons 1 or 0.",
    "timestamp": 1701990000
  },
  {
    "username": "npocmo",
    "rating": 3.0,
    "comment": "Game was broken for us, after Month 4 we felt like we didn't had any chance to win. We lost a lot and we even didn't finished this game, because we didn't had fun at all.\nWe played a lot of Base Pandemic and Season 1. We still love Pandemic but I cant recommend Season 2.",
    "timestamp": 1701126000
  },
  {
    "username": "Maglinkinpark",
    "rating": 3.0,
    "comment": "Couldn’t even finish it. What a bland story paired with impossible game play (at 2 player). Terrible.",
    "timestamp": 1680386400
  },
  {
    "username": "iamspamus",
    "rating": 3.0,
    "comment": "Started out well, but we just never got a rhythm with it.",
    "timestamp": 1677538800
  },
  {
    "username": "lisakshortt",
    "rating": 3.0,
    "comment": "Hated it, especially the radical rule change at the end - made it feel like the entire game was a waste of my time.",
    "timestamp": 1658786400
  },
  {
    "username": "Rakuda1988",
    "rating": 3.0,
    "comment": "I know that this heavily relies on having the right playgroup to do these kinds of games but I haven't found that yet. I've tried to play this campaign twice with different playgroups (collectively 11 games) but we've always stopped the campaign and can't get any further in the story.\n\nThe gameplay is fun but if you keep losing it felt like we'd get nowhere in the story. We only got to March after 4 games. April took 2 more games. Since we would only play it once every 2-4 weeks we were always having to relearn the rules (or checking for new rules we forgot) it would take us too long to play. Our best guess was 1.5 more years and we didn't want to keep that experience for so long.\n\nThis was not for my playgrounds. That is for certain. The bare minimum of 12 games assuming that you won every single time is a bit too much for us.\n\nSo my recommendation is that if you think your playgroup can put in the time go for it. It definitely can be very enjoyable and rewarding.",
    "timestamp": 1646866800
  },
  {
    "username": "NTheYeti",
    "rating": 3.4,
    "comment": "The worst thing I have ever played. I don't know how you screw up Pandemic Legacy but they did. Most boring gameplay imaginable and impossibly hard. The setting is also really weird and no one gives a s**t about what happens in the story.",
    "timestamp": 1626040800
  },
  {
    "username": "arhan",
    "rating": 3.0,
    "comment": "Lo peor",
    "timestamp": 1609628400
  },
  {
    "username": "eddiecheung",
    "rating": 3.3,
    "comment": "Cooperative\nOwned by Jeffrey Tam & Howie Chan",
    "timestamp": 1609542000
  },
  {
    "username": "Jexhai",
    "rating": 3.0,
    "comment": "Snowball problem. People often point to the need to \"catch the clues,\" but my group found those trivial to discover. The problem is that if you get unlucky trying to unearth something (even if you've already figured out you need to do it), you can get into a snowball situation that screws the rest of the play. The campaign was depressing and oppressive. It took a couple years to finish because no one wanted to slog through the rest of it.",
    "timestamp": 1608505200
  },
  {
    "username": "Cone Defense",
    "rating": 3.0,
    "comment": "Took what made season one interesting and developed a convoluted mess. Enjoyed the game, but it all felt too heavy handed and over the top. Rules were nonsensical in spots and “rules for the sake of rules” rather than thematically tied.",
    "timestamp": 1603753200
  },
  {
    "username": "High Elf Andrew",
    "rating": 3.0,
    "comment": "No. See Pandemic 1\n\nLegacy. Co-op",
    "timestamp": 1597528800
  },
  {
    "username": "evlkeith",
    "rating": 3.0,
    "comment": "2020",
    "timestamp": 1592604000
  },
  {
    "username": "plagio",
    "rating": 3.0,
    "comment": "Really slow...6 months before changing goals, that is 6 months out of 12 doing the same game",
    "timestamp": 1585350000
  },
  {
    "username": "Rygel",
    "rating": 3.0,
    "comment": "I was truly looking forward to this game after playing Season one. Then after playing a few games I truly wanted to throw it away without even finishing it. Sadly this game is nothing like Season one. This game is tedious and punishing on the players. Losing 14 games in a row is not fun. Only to have the game punish you more for it. I only rated this a 3 because I know some effort went into making it.. This was a poor showing and will make me think before buying another Pandemic game.",
    "timestamp": 1584399600
  },
  {
    "username": "KawaiiSocks",
    "rating": 3.0,
    "comment": "Season 1 was a good game with a cool gimmick. Season 2 is the same gimmick, but without the actual game. Pass",
    "timestamp": 1583449200
  },
  {
    "username": "Aahz74",
    "rating": 3.0,
    "comment": "Our group finally finished Pandemic Legacy: Season 2. After loving Season 1, Season 2 was quite a let down. I don't know if it's just that Season 1 was great and this was so-so, or if it's also a function of now having played multiple other legacy games that were only so-so (or worse - looking at you, Seafall), that I'm kind of over legacy games in general. Fun for a bit - but not a great game by any stretch of the imagination. Play Season 1 for sure, but there are lots of better games to play than Season 2.",
    "timestamp": 1582239600
  },
  {
    "username": "roboman",
    "rating": 3.0,
    "comment": "(12/30/2017) - Received as a gift from Brad and Dana!\n\n(02/15/2020) - [3] - Other than some initial excitement over the new \"keep supplies on the board\" gameplay instead of the usual \"remove cubes desperately\" mechanic that Pandemic is known for, this one really fell flat for us.\n\nPainfully stale objectives that hardly ever changed. Anyone could have seen the \"Utopia is bad\" part of the story coming from a mile away. The other twist landed with a thud, due to us being largely sour on the game quite some time before the big reveal.\n\nThe need to not retcon Season 1 was handled with a large gap in time between the events of Season 1 and Season 2. While I see the reason for doing this, it also felt like playing two unconnected games. I never felt like I was dealing with the aftermath of CODA from Season 1. It just felt like a completely different story that happened to mention CODA from time to time.\n\nMaybe this is finally Pandemic fatigue setting in for me, but I think I'm done with this series, barring a complete overhaul and redesign.",
    "timestamp": 1581807600
  },
  {
    "username": "zosocoheed",
    "rating": 3.0,
    "comment": "Overall I found this game fell flat of its predecessor in a few ways.\nThe base gameplay of this game differs from classic Pandemic - and ultimately I feel this led to its downfall. Different by itself would not have been a problem, but the base gameplay of season two just isn't good.\n*spoilers ahead*\nTwo much of this game was spent on trying to put out fires while doing the same \"create 3 new supply stations\". That was the point of most months, create new supply stations - a mind numbing task to be building to for most of the game. Then many of the cool abilites that you could buy in season one were hidden behind searches, which relied heavily on randomness to come up in the deck.The game felt as if it took more away instead of adding more to it. A good example of what they could have done to elevate pandemic would be spirit island. Instead we ended up with a hollow version of a game. They focused on Legacy first and game second, and season 2 suffers greatly for it.\n\nEnded up with the second best ending, but I was just glad to be over with it. I'll not be buying season 3 at launch, if ever.",
    "timestamp": 1564956000
  },
  {
    "username": "thecondog3000",
    "rating": 3.0,
    "comment": "My gaming group had a blast playing Season 1, and then we started playing Season 2. We hated it. The games were all monotonous and we just lost over and over again to a crushing lack of supply cubes. I'm still scratching my head as to how the initial few months of the game are either fun or winnable. We persisted through April before calling it quits. It's not inherently a bad game (I'm guessing), but from what I can tell from the forums, you have to make certain things happen to the landscape of the board before any big breakthroughs occur, which I think we just didn't achieve. How could we when there were already 5+ exposed cities after not even a few turns and no way to manage our resources to protect them? Losing on repeat with no end in sight and no means to improve one's lot for months on end? I'll go play something else.",
    "timestamp": 1556834400
  },
  {
    "username": "ke1den",
    "rating": 3.0,
    "comment": "After playing season 1 and loving every intense moment, we went into season 2 excited! But now just finishing June, we've lost the game more times than we can count and most of the time we felt like there was nothing we could've done better. And sadly, the story isn't as gripping to me as I'm not invested in what's going on (probably because we keep losing). Maybe they were going for the hopelessness of a post-apocalyptic world but it's so hopeless than my group is struggling to keep invested. We just want to power through the game to say that we finished it.",
    "timestamp": 1550185200
  },
  {
    "username": "poisonivy",
    "rating": 3.0,
    "comment": "So disappointed with Season 2 after absolutely loving Season 1. We can't even muster up the will to finish the game. One of the things I liked about Season 1 is that it balanced out well -- the game had adjustments that made it harder or easier based upon how well you're doing. Season 2 doesn't have this -- we lost a game in the second round because of how our board is structured. We're halfway through and haven't had any big surprises when it comes to stories, windows or packages. I doubt we'll ever finish out the season.",
    "timestamp": 1549234800
  },
  {
    "username": "number_eight",
    "rating": 4.0,
    "comment": "(I love regular Pandemic and Season 1)\n\nI didn’t like it. It removed or changed my favorite parts of the formula. It took willpower to complete the campaign.",
    "timestamp": 1751148000
  },
  {
    "username": "El_rincon_de_javi",
    "rating": 4.0,
    "comment": "Quizá sea por las expectativas creadas después del Season 1, pero este juego no nos gustó nada y dejamos la campaña a medias",
    "timestamp": 1748556000
  },
  {
    "username": "Javi_2024",
    "rating": 4.0,
    "comment": "Not sure why, but this game does not feel at all like the predecessor. Boring.",
    "timestamp": 1748296800
  },
  {
    "username": "TertiaVigilia",
    "rating": 4.0,
    "comment": "Was fun to play, but gets repetitive very fast. Last game is impossible to win, that will be frustrating for a lot of people. Overall, Season 1 had the better story and more immersive gameplay.",
    "timestamp": 1747519200
  },
  {
    "username": "HadleighMoon",
    "rating": 4.0,
    "comment": "Didn't get on with this and did not finish. Subverting the core mechanic by placing cubes that the game removes did not work in my opinion.\n\nPlacing areas on the map via sticker despite having a narrative purpose felt like a gimmick.\n\nNever got captured by the story.\n\nThis had nothing on Pandemic Season One",
    "timestamp": 1736982000
  },
  {
    "username": "fuge67m",
    "rating": 4.0,
    "comment": "This fell flat for me. Love the creativity, but it didn’t resonate.",
    "timestamp": 1731106800
  },
  {
    "username": "darthmoeder",
    "rating": 4.0,
    "comment": "Akin to giving students an impossible test as a psychological experiment, not to see if they can pass the test, but to see how well they handle the stress of failing the test. (See also, Kobayashi Maru)\n\nThe Final Reckoning\nDelivered: 371 (Near Collapse)",
    "timestamp": 1730502000
  },
  {
    "username": "invervegas",
    "rating": 4.0,
    "comment": "Complexity √ - Each time I play this game, I become more disappointed after the masterpiece that was Season One. There are too many ways for your plans to come undone with no way to mitigate this. If you do win, it seems to be more by luck than design. We are grinding through it at the moment, but it is a grind, and we are only continuing (I suspect) because we have started it....\n\nEdit 29/01/21\nI couldn't see us finishing this. Probably because I don't like the way things have turned out. Everything appears to have gone wrong right from the first month in terms of our card draws, and there has been no way back. We have lost more than we have won. I have moved this on (= binned it)",
    "timestamp": 1725141600
  },
  {
    "username": "SGgrayfox",
    "rating": 4.0,
    "comment": "Trash",
    "timestamp": 1705791600
  },
  {
    "username": "infinitepeaks",
    "rating": 4.0,
    "comment": "A slog. Halfway through, I just started dreading playing the next session. Maybe the back half becomes stronger, but I couldn't bring myself to push through when there's so many other great games to play.",
    "timestamp": 1704236400
  },
  {
    "username": "Mistefire",
    "rating": 4.0,
    "comment": "I was very disapointed with this second season.\nI found that the mecanics were very punishing and directed to conter what the players may have built in the previous months",
    "timestamp": 1700521200
  },
  {
    "username": "Activesnoop",
    "rating": 4.0,
    "comment": "This was not nearly as fun as the others (which were my favorite games). I couldn't even finish this one.",
    "timestamp": 1699743600
  },
  {
    "username": "Locodrillo",
    "rating": 3.5,
    "comment": "Nada que ver con la magistral primera temporada. Sensación total de ir a ciegas durante gran parte de la campaña a merced del azar. Muy aburrido. No la terminamos.",
    "timestamp": 1693087200
  },
  {
    "username": "bjce",
    "rating": 4.0,
    "comment": "Only played half through the campaign. Not as lean and elegant as season 1 and the base game. Too much of everything (possible actions, rules etc.) so that playing becomes exhausting even though I have played pandemic for years.",
    "timestamp": 1684360800
  },
  {
    "username": "bainewedlock",
    "rating": 4.0,
    "comment": "Rating 4 = To someone with a simliar taste like me: Play this game if you don't have anything else to do.",
    "timestamp": 1679180400
  },
  {
    "username": "EarlofBronze",
    "rating": 4.0,
    "comment": "Not nearly as good as Season 1. Some weak design decisions made it all but impossible to win…",
    "timestamp": 1678489200
  },
  {
    "username": "MrWynter",
    "rating": 4.0,
    "comment": "Game is too swingy in the campaign - finding an event early allowed us to swing through several missions far too easily",
    "timestamp": 1673737200
  },
  {
    "username": "BrassMutant",
    "rating": 4.0,
    "comment": "It's fun, but I believe the game is trying to be something it's not. It's similar enough to Pandemic and the story is a logical continuation of season 1. But, it's just not as fun as season 1. Perhaps season 0 will be better.",
    "timestamp": 1664316000
  },
  {
    "username": "amitche1",
    "rating": 4.0,
    "comment": "It's not living up to the expectations. I find it very easy, and I'm not interested in the story due to the way it unfolds/reveals itself. We haven't really come close to losing, and it's been like a year since we played. Disappointing.",
    "timestamp": 1650146400
  },
  {
    "username": "magellan117",
    "rating": 4.0,
    "comment": "Season 2 isn't as good as season 1. But also, I was just very burnt out from playing season 1 to enjoy season 2 as much as it probably deserves.",
    "timestamp": 1648162800
  },
  {
    "username": "SeerMagic",
    "rating": 4.0,
    "comment": "Color me unimpressed. At it's gameplay core, I like it better than regular pandemic. However, this game just decides you are losing. Only 1 of our 5 losses I felt was because of decisions we made. It's a total crapshoot, and it's why I don't like base pandemic. However, atleast Pandemic season 1 had cool things going on with it's crap gameplay. So far 5 months in, this one does not. Story has been barely there. A lot of my turns are obvious and don't take much time or thought. I feel we've been spending more time fiddling with the game instead of playing it.\n\n5 months in thoughts\n New core gameplay is an improvement over pandemic\n\n Lack of story\n Luck based gameplay\n Game plays you\n More time fiddling than actual playing\n Nothing to justify the $20 price increase",
    "timestamp": 1646175600
  },
  {
    "username": "quetzal513",
    "rating": 3.5,
    "comment": "P: 1-4, T: 60 min, SdJ-S\nCo-op, legacy. After the first few rounds we've been really enjoying the implementation of Pandemic and the subtle improvements to the legacy system likely learned from the first season.\n\nWell... the bottom dropped out on this one (now @ November). We now realize that we missed a couple small, subtle rules and clues starting in the early months that caused us to fall behind, not develop an effective strategy, and be forced to reveal stickers/packages month after month b/c we couldn't achieve the objectives in time. Once we realized our problem (triggered by a new card we were forced to reveal that had a rule interaction that seemed incompatible with how we were playing) we realized there was no way we could Retcon the game back to its state in Apr/May.\nIt's so sad that one of our best gaming experiences (from Season 1 we had such optimistic hopes about this one) has been pretty bitterly ruined for us as we slogged month after month to do just enough to not have the world collapse but not be able to gain enough momentum to make any real progress. Its been a slog to get this far and I won't be surprised if we don't finish since we're likely facing several losses just to get enough cities connected; maybe we can get a win at the end of the last month. I appreciate some of the twists to the typical Pandemic formula that were introduced, and maybe it's all on us, but a couple key rules and wrinkles were missed by us and there was no recovering after that.",
    "timestamp": 1645311600
  },
  {
    "username": "George_Anderson",
    "rating": 4.0,
    "comment": "Finally finished this one, but had to force ourselves to do it. While we scored really well, we found this one was not as engaging as Season One was and play felt like a chore. We were glad to be done with it. Story was pretty predictable.",
    "timestamp": 1641855600
  },
  {
    "username": "Tevildo",
    "rating": 4.0,
    "comment": "After finishing the campaign, I can just say that the randomness totally killed the game for us. That we had to draw the exact cards that was needed in order to win several of the months, was just too much. Beside that, some months were fun. Some months we could discover stuff, but most months we could not.",
    "timestamp": 1614380400
  },
  {
    "username": "abernath",
    "rating": 4.0,
    "comment": "Well, I liked some of the months, but ultimately we felt it was impossibly hard and unfair. We didn't even play December.",
    "timestamp": 1611356400
  },
  {
    "username": "Acoidan85",
    "rating": 4.0,
    "comment": "Grinchitos",
    "timestamp": 1589752800
  },
  {
    "username": "PeleWebb",
    "rating": 4.0,
    "comment": "Way harder than Season 1 if you ask me",
    "timestamp": 1582844400
  },
  {
    "username": "Froh",
    "rating": 4.0,
    "comment": "The season two is okay, until it jumps in difficulty abruptly a few games in, so the game becomes stupidly impossible, and make your spent your entire month on only one objective : Recon (but you lose the game anyway). After that, either the game vary between extra easy and straightful unfair, and despite the interesting plot, never really shines in term of balancing the play.\n\nIt's a bit strange coming from Matt Leacock, which usually produces pandemic games that are very balanced in tension.",
    "timestamp": 1575500400
  },
  {
    "username": "Nafmi",
    "rating": 4.0,
    "comment": "The game end ruined it completely for me, extremely disappointed. We didn't want to play on anymore.",
    "timestamp": 1574290800
  },
  {
    "username": "pickboy87",
    "rating": 4.0,
    "comment": "**Spoiler Free**\n\nSo, this is Season 2 of Pandemic. Definitely a similar vibe, but the world is super tiny to start off with. The game has only 1 color of cubes to put out (Supplies) which makes setup and tear down a breeze and even just the general gameplay. I'm quite a fan of how this was handled. Plague cubes are placed when a city runs out of supply cubes and you draw that card again. They are unable to be removed and become a problem quickly as you can't begin your turn there or you'll take exposure, which may lead to your death. You can still place supplies in that city, but you want to get in and get out.\n\nI've found this version harder than Season 1 by far, but still not that difficult. Granted, I don't expect legacy games to be mind crushingly difficult as you don't want the game to be super difficult as you only have a limited number of times to play it. I'm also unsure on how to rate this game. I suppose when it comes down to it, it'll be rated as the experience I've had with it. I haven't seen any surprises yet, but I expect a few twists later on in the year.\n\nEdit: Err...the months of March and April were hella hard. Hopefully it gets easier because we went from doing alright to barely hanging in there. The massively increased difficulty was tough to swallow those two months.",
    "timestamp": 1571954400
  },
  {
    "username": "FranzK",
    "rating": 5.0,
    "comment": "Note: No legacy components have been used.\n\nI’ve only tried the prologue, which is pretty similar to base Pandemic, a game that is too simplistic and luck-driven for my personal taste. I’m not sure yet if I will play through the campaign.",
    "timestamp": 1758405600
  },
  {
    "username": "FrayedEdges",
    "rating": 5.0,
    "comment": "This was meh. Just okay in comparison to regular pandemic.",
    "timestamp": 1757887200
  },
  {
    "username": "gutrie_es",
    "rating": 5.0,
    "comment": "Terminada la campaña. Le hemos dado al juego 21 partidas, la puntuación para nosotros no es importante, nos tomamos el juego con tranquilidad y con ganas de explorarlo, pero por lo visto los diseñadores no pensaban lo mismo.\n\nDesde mi punto de vista es donde falla el juego como Legacy, yo este tipo de juegos lo veo mas como una experiencia de exploración narrativa.\n\nPor otro lado el juego va aumentando de complejidad y reglas según avanza la partida y creo que también es un error, creo que debe meter mecánicas nuevas o cambios de guión, pero la esencia y el cuerpo principal de reglas debería mantenerse.\n\nEl final no me ha gustado, muy gamey, la historia es simplona y poco atrayente.\n\nPor ultimo, cuando lo acabas, no sirve para nada, no puedes seguir jugándolo, es un museo o a la basura, es una pena y un gasto innecesario.\n\nno recomendable",
    "timestamp": 1749592800
  },
  {
    "username": "morvith",
    "rating": 5.0,
    "comment": "Segundo en la saga de Pandemic Legacy.\n2-4 jugadores.\n___________________\nNuevo: ₡69,800\nMi precio: ₡40,000",
    "timestamp": 1740006000
  },
  {
    "username": "BoardGamingCouple",
    "rating": 5.0,
    "comment": "5/5\nLegacy game is excellent with 3+ characters. The story is okay. This version has a lot of exploration & the game is very different (4/5).\n\nThere is no eternal game.",
    "timestamp": 1735167600
  },
  {
    "username": "dtmoney75",
    "rating": 5.0,
    "comment": "1 Play\n\nPlayed at: 4",
    "timestamp": 1729548000
  },
  {
    "username": "Lollipopper",
    "rating": 5.0,
    "comment": "Started out exciting with a new map you’re building up as you go, but got very repetitive. Didn’t really feel like I was playing to win a game, more like playing to not lose and the game just stopped being fun. Really enjoyed S1 but rather disappointed in this one and not sure we will finish it",
    "timestamp": 1728165600
  },
  {
    "username": "CaptainMalta",
    "rating": 5.0,
    "comment": "Love the original base game pandemic, and loved the full Legacy: Season One experience, but this one just wasn't the same. Too many new mechanics introduced, and an unconvincing storyline. The more hours we put into this, the franchise just felt progressively over saturated. I think we made it to July/Aug on this one and gave up, sadly.",
    "timestamp": 1725832800
  },
  {
    "username": "eatem",
    "rating": 5.0,
    "comment": "The finale was very disappointing. Dragged the whole game down. It was like watching a good movie with a terrible ending.",
    "timestamp": 1722204000
  },
  {
    "username": "_Calador_",
    "rating": 5.0,
    "comment": "Poorly written ambiguous rules. Only for hardcore players.",
    "timestamp": 1708297200
  },
  {
    "username": "JensG",
    "rating": 5.0,
    "comment": "Played through.\n\nWe thought Season 1 was great, Part 2 somehow didn't manage that. Maybe it's because of the time we played it (2023/2024). But maybe also because it was nothing new.\n\nThe story felt a bit better than in s1. Nevertheless, we had to cheat a lot (which I don't really like) to avoid losing the game all the time. We also just wanted to get it over with. I think that says a lot about how \"much\" we liked it.",
    "timestamp": 1708210800
  },
  {
    "username": "dhable",
    "rating": 5.0,
    "comment": "This was a tough game. All of the games were 2 players each playing a single character. This was different than our approach from Season 1 where we each played 2 characters for a total of 4 characters in each game. With half the characters, we lacked the ability to spread out and cover sections of the map. This was critically important towards the end of December. While the extra cards might make the game balanced, it did feel much more difficult with less characters in the game.\n\n\nRating History:\n22 Jan 2024 - 5 (22 plays)\n22 Jan 2020 - 6 (22 plays)\n12 Feb 2019 - 7 (22 plays)\n29 Jan 2019 - 7 (19 plays)\n26 Apr 2018 - 8.5 (13 plays)\n25 Jan 2018 - 8 (5 plays)",
    "timestamp": 1705878000
  },
  {
    "username": "Kottman",
    "rating": 5.0,
    "comment": "This is potentially unfair but we started this and didn't enjoy it enough to continue after the first quarter of the campaign. Strangely, we absolutely loved Season 1 so I'm not sure why this felt so much less interesting.",
    "timestamp": 1705878000
  },
  {
    "username": "jkach91",
    "rating": 5.0,
    "comment": "It was fun playing through it but at a certain point, the game became impossibly difficult for us to win.",
    "timestamp": 1705791600
  },
  {
    "username": "toppyoushimonai",
    "rating": 5.0,
    "comment": "I didn't enjoy Season 2 at all (which was an unpleasant surprise after Season 1). From the first game the story was kind of weird (our leaders left?) and the reverse Pandemic gameplay where we had to produce cubes instead of cleaning up disease felt off.\nThe game feels much harder than Season 1. The rules are overly complex and become harder to track as the game progresses.\nIn the end, we abandoned the campaign since no one was ever in the mood to play it...",
    "timestamp": 1705014000
  },
  {
    "username": "bobo_chacha",
    "rating": 5.0,
    "comment": "In progress winter of 23-24",
    "timestamp": 1703631600
  },
  {
    "username": "Ashaman Respen",
    "rating": 5.4,
    "comment": "This game was a disappointment after a wonderful time with Season 1. This game is extremely luck based as you have to wait for specific cards in the deck to do many of the goals. There is very little control or chance on the players ends for reaching goals for this reason. Season 1 took us a couple of weeks to play, we've being struggling to complete this for a couple of years.",
    "timestamp": 1703545200
  },
  {
    "username": "teenietinytiki",
    "rating": 5.0,
    "comment": "Jury is still out - we are experienced Pandemic players and have not won the prologue after 5-6 tries. Must be something to crack here that we have not/could not. Largely, the group has moved on.",
    "timestamp": 1701730800
  },
  {
    "username": "Teach101",
    "rating": 5.0,
    "comment": "Bought on Geekway VFM '19",
    "timestamp": 1698879600
  },
  {
    "username": "dylarson",
    "rating": 5.0,
    "comment": "Not nearly as good as Season 1, and we did not make it though the entire campaign, actually.",
    "timestamp": 1696975200
  },
  {
    "username": "reneqing",
    "rating": 5.0,
    "comment": "对美式是真的不感兴趣，直接拆完读了剧情，处理了。",
    "timestamp": 1691100000
  },
  {
    "username": "sean69",
    "rating": 5.0,
    "comment": "89.97",
    "timestamp": 1689976800
  },
  {
    "username": "robertoabr",
    "rating": 5.0,
    "comment": "Starts well, ends pretty nicely, but way too much repetition in the middle of this campaign. Overall , loved the first season, let down by this one.",
    "timestamp": 1685829600
  },
  {
    "username": "Gremlings",
    "rating": 5.0,
    "comment": "Love Pandemic, Loved Season 1, but this was a big letdown in comparison. We still did well score wise, but just didn't find this as interesting as Season 1. We only completed it because it felt like the right thing to do, but both of us were glad to move on to something else. If you loved Season 1, do not expect to necessarily love this. That said, it hasn't put us off buying Season 0, which we are hoping will reignite our love for the game.",
    "timestamp": 1681768800
  },
  {
    "username": "Stolen_Goods",
    "rating": 4.5,
    "comment": "Taking a break from this in the 2nd half of May after losing 4 games in a row. Will come back over winter break.\n\n+ Uncovering the world throughout a campaign is a fun mechanic.\n+ Strategically creating routes is similarly interesting as well, although it's pretty obvious where those routes ought to go.\n+ It's Pandemic - it's a fun enough game.\n- Soul-crushingly difficult, and I say this having nearly-aced Season 1 and Season 0 before this. We've lost 4 games in a row even while having cheated a little to give ourselves an edge due to this difficulty, and our victories have been very hard-won. If you find yourself low on supplies you can be *permanently* screwed over before you even take your first turn, and that's the polar opposite of fun in an already punishing game. God help you if you forsake a city that has a card you haven't scratched off yet, much less one that HAS A LOST HAVEN WITH PERMANENT EXTRA SUPPLIES ATTACHED TO IT. Thank god we found that, but even with those supplies and a new key sea route the game is still kicking us to the curb.\n/ The silver-lining to losing is that at least we've been making progress each game.\n- On paper, the game wants you to connect new cities to the grid, but in practice this comes with a very real cost for future games where you'll be punished by drawing isolated cities from the infection deck, which are extremely hard to manage. Your reward - extra player cards with scratch-off bits, and *maybe* an extra production unit if you can somehow keep all those cities from falling - is not enough to make up for this. The game is at odds with itself as far as this mechanic is concerned.\n- Setup time is the longest of the three Pandemic Legacy games, and in the middle of the usually boring setup process that one person can do, you need to make the VERY IMPORTANT strategic judgement call of disbursing supplies - something other people may want to chime in on - before going back to recounting the number of cities you have in your player deck, which is not the same number as the number of cities on the grid, which is not the same number as the number of cities on the grid that count towards production units.\n- Perhaps it's just our luck but we've been hit with the classic \"draw an epidemic, get the bottom card, shuffle, then draw the card you just got from the bottom and immediately get punished permanently with no recourse\" Pandemic Legacy problem a LOT in this campaign. It's still as frustrating as ever.\n- Maybe it's just my old copy, but the stickers are unsticky and are curling up from the board. Also the scratch-off \"stuff\" is the most annoying crap to dispose of and gets everywhere and *stains itself into wood tables* if you're not extremely careful.\n\nI still want to finish it but the game is making itself very difficult to like through its many glaring flaws.\n\nEDIT: Gave it away not even half-finished. Can't recommend over the other two seasons or other great Legacy games like Clank!",
    "timestamp": 1681509600
  },
  {
    "username": "Dadmin",
    "rating": 5.0,
    "comment": "Not as engaging as Season 1 and way too difficult for most players. Every victory felt like luck and not like good planning and player choices.",
    "timestamp": 1678057200
  },
  {
    "username": "fwkruger",
    "rating": 5.0,
    "comment": "A couple of small decisions can lead to this game derailing itself without much warning. If you happen to get those right, you'll have a good game.\n\nAmbitious attempt, but likely pushed the flexibility too far and couldn't quite get the balance right",
    "timestamp": 1675119600
  },
  {
    "username": "Fongstar",
    "rating": 4.5,
    "comment": "After playing pandemic legacy season 1 and absolutely loving it, I was very excited to play season 2. After playing the entire S2 campaign, I really liked the exploration focus; a nice change of pace using stickers to uncover new parts of the game However, that's where things fall apart drastically.\n\nFirst, the quality of the stickers are awful. They peel, don't stick to the cardboard and player cards and, if you're OCD, you'll be annoyed the entire way through the campaign until you use tape. All annoyances with scratching (and in many ways ruining) the cards is maintained from S1. But what really disappointed was the clearly unbalanced, swingy, and seemingly guaranteed losses in a few specific months. Additionally, unlike S1, the game was far too linear on character development. For example, we barely ever changed characters until all of a sudden without notice you're screwed due to luck of the draw from the massive card deck.\n\nAll in all, this game is a far cry from S1, so buyer beware. If you're completionist this game will be a slog but after it's done you'll feel fulfilled you made in through to the end, win or lose. That said, this game is great value for money: 16 plays and 20+ hours later was still worth it. I just can't rate this higher because the gameplay was mediocre at best.",
    "timestamp": 1670108400
  },
  {
    "username": "selcos21",
    "rating": 5.0,
    "comment": "Didn't finish, and nothing of value was lost. Seemed way harder and more punishing in comparison to season 1",
    "timestamp": 1667257200
  },
  {
    "username": "Feluwelt",
    "rating": 5.0,
    "comment": "I played through this with my group. We won about half the missions. It was fun but it made me never want to play pandemic ever again.\nI also instantly threw the game out after completion.\nOut of all the legacy games I have played this was my least favorite.",
    "timestamp": 1662242400
  },
  {
    "username": "Burton Lovell",
    "rating": 5.0,
    "comment": "Had a great time playing at first. Unfortunately, we got to a point where the losses and poor choices on revealing the map made the game impossible to win and no fun to play.\n\nWe threw it out before we finished our campaign.",
    "timestamp": 1659996000
  },
  {
    "username": "Highbrow",
    "rating": 5.0,
    "comment": "Legacy Game",
    "timestamp": 1638745200
  },
  {
    "username": "mmrempen",
    "rating": 5.0,
    "comment": "Pandemic Legacy Season 1 was my gateway game and my group and I were nuts about it. So of course we were crazy excited when this came out. We played three games or so and never came back to it. Dunno why exactly, the theme and backwards map building seemed cool. Maybe there’s just such a thing as too much Pandemic. It does get old.\n\nIt bothers me a lot that this half-played game is now essentially a useless item unless we want to come back to it. At least a regular board game can be gifted or sold off if it doesn’t really work for you. But nobody wants a half played legacy game. So now it’s Schrodinger’s Board Game: not a game, but not garbage, either. It’s in limbo between both states.",
    "timestamp": 1638572400
  },
  {
    "username": "caryy",
    "rating": 5.0,
    "comment": "my group got too bored and frustrated to finish; I have no motivation to play it again.",
    "timestamp": 1625695200
  },
  {
    "username": "bneffer",
    "rating": 5.0,
    "comment": "More pandemic without the explosive surprises of Season 1. Maybe Season 0 will have more?",
    "timestamp": 1619128800
  },
  {
    "username": "cjmizanin",
    "rating": 5.0,
    "comment": "After playing Pandemic Legacy: Season 1, I was excited to see what Season 2 had to offer.\nI enjoyed the story of Season 2, and had a fair amount of fun with it, but toward the end I was actually looking forward to it being over. Knowing that I wouldn't have to \"deal with it\" once it was over was a kind of relief.\nUnlike Season 1, I feel like in order to be successful in Season 2, you have to keep a spreadsheet of cards (their colors, how many there are, etc) and although it's not impossible to do, it's not what I signed up for.\nI don't regret my purchase, or the time spent experiencing the game, but I also wouldn't be missing anything had I never played it.",
    "timestamp": 1612566000
  },
  {
    "username": "dpc47",
    "rating": 5.0,
    "comment": "For most of the time we played this, it just wasn't fun. We actually took a two year break in the middle because we didn't want to continue. We did come back to finish.\nIt's grueling. Winning still feels like losing, and maybe you really are losing. There are things you should be doing, and you get hints, but it's not really clear what's important. Worse, sometimes if you haven't done what you needed to do, it just happens anyway to keep the story on track, and you take a small penalty, meaning it really didn't matter what you did. You feel like you can explore but you actually just get yanked back onto the rails, and you may have wasted a lot of time on things that weren't important.\nThe endgame is just silly and leaves players with turns in which they can't do anything useful. Also, late in the game there are just too many different mechanisms, possible actions, and modifications to remember.\nVery disappointing after season 1, which I still consider one of the best games ever made. I can tell what they were trying to do but it didn't work.",
    "timestamp": 1607727600
  },
  {
    "username": "AlexFS",
    "rating": 5.0,
    "comment": "6 plays - 4p\n\nNo spoilers.\n\nIt's still Pandemic, but inverted with pick up and delivery. There is a lot more asymmetry in cities connectivity, which has important strategic consequences. I'm way more interested than I thought I would be.",
    "timestamp": 1606258800
  },
  {
    "username": "stvnritch",
    "rating": 5.0,
    "comment": "Same issues I had for season 1. If it wasn't a legacy game or was at a cheaper price point i probably would enjoy it much more.",
    "timestamp": 1605135600
  },
  {
    "username": "mcmiln",
    "rating": 5.0,
    "comment": "The plot is great, and I'm happy I played it, but the mechanics were not great imo. Overall it was very predictable and formulaic. This gave less agency over your own choices and made things uninteresting.",
    "timestamp": 1599688800
  },
  {
    "username": "kimifly",
    "rating": 5.0,
    "comment": "Season 1 was fantastic, but season 2 fell flat in our group. It seemed like a lot of randomness, you could make one mistake and never be able to recover from it, and our priorities were never clear.",
    "timestamp": 1597528800
  },
  {
    "username": "hightouch",
    "rating": 4.5,
    "comment": "We abandoned ship before starting June (9 plays) only having won 2 games. Long strings of bad draws and bad timing of epidemics meant that we never had enough sets of single-color cards to unlock anything. Played through a few more months solo, but hit the railroaded path through the rest. Gave up and read through the rest of the cards.",
    "timestamp": 1596837600
  },
  {
    "username": "tilikumc",
    "rating": 5.0,
    "comment": "Very disappointing.",
    "timestamp": 1596319200
  },
  {
    "username": "NakedBuddha",
    "rating": 5.0,
    "comment": "did not enjoy this one as much as the first season. felt broken at places - discovery and saving cards",
    "timestamp": 1594072800
  },
  {
    "username": "Tjouneaze",
    "rating": 5.0,
    "comment": "Last 2 months are awful designed! Just drawing cards and hoping for the right ones...",
    "timestamp": 1592517600
  },
  {
    "username": "WestSideBilly",
    "rating": 5.0,
    "comment": "Several game sessions of demoralizing losses just for the sake of it, followed by a good evolving story. Didn't feel like any decisions made had a meaningful impact.",
    "timestamp": 1591653600
  },
  {
    "username": "Timothy Taufeek",
    "rating": 5.0,
    "comment": "Campaign",
    "timestamp": 1589493600
  },
  {
    "username": "Pasel",
    "rating": 5.0,
    "comment": "Far inferior compared to Season 1, not sure if wel'll ever finish it.",
    "timestamp": 1587420000
  },
  {
    "username": "Nextphase",
    "rating": 5.0,
    "comment": "To hard simply.\nAnd i Will never play season 2 again\nBut season 1 i Would glady play a New Copy of.",
    "timestamp": 1586642400
  },
  {
    "username": "eliteone",
    "rating": 5.0,
    "comment": "Not as good Season 1.",
    "timestamp": 1586210400
  },
  {
    "username": "Chuck Singer",
    "rating": 5.0,
    "comment": "Sort of disappointing after S1. The December month was pretty fun though. Most the game seemed aimless and it was lacking in plot which I thought made the first one so good.",
    "timestamp": 1586210400
  },
  {
    "username": "EnumahElish",
    "rating": 5.0,
    "comment": "Not enjoying this at all. Too difficult. Too brutal. Too punishing. To many games in a row where I felt I had no control, no agency, no chance of winning. 3 of the games we lost in less than half an hour.",
    "timestamp": 1584313200
  },
  {
    "username": "skraem",
    "rating": 5.0,
    "comment": "3+ Plays. Have not finished the campaign, but we have not enjoyed it that much - while the first season was an amazing experience.",
    "timestamp": 1581721200
  },
  {
    "username": "Awong1214",
    "rating": 5.0,
    "comment": "Never finished. Game is a slog compared to season 1. It's not even Pandemic.",
    "timestamp": 1578092400
  },
  {
    "username": "leohuertas",
    "rating": 5.0,
    "comment": "Staerted playing it and in around May I didn't feel anything was really much better that S1 so stopped playing it.\n\nNot sure if I'll ever finish it. It's at a friend's place so not worried about it taking my space",
    "timestamp": 1574031600
  },
  {
    "username": "ooba",
    "rating": 5.0,
    "comment": "Made the mistake of playing PL2 a few months after PL1. My wife and I would look at the box every week and just play Concordia instead. Gutted the game for parts and threw it out after three months finished in the campaign.",
    "timestamp": 1569794400
  },
  {
    "username": "hongdavid94",
    "rating": 5.0,
    "comment": "A disappointment after the Pandemic legacy season 1. Game depth is not there and the theme is much less interesting.",
    "timestamp": 1568239200
  },
  {
    "username": "mothoc",
    "rating": 5.0,
    "comment": "The choices you make have no effect on the end of the game. Highly railroaded. Socially wonderful game, but terrible game design in the last 1/4 of the game.",
    "timestamp": 1562191200
  },
  {
    "username": "miror",
    "rating": 5.0,
    "comment": "After legacy 1 who was an EXCELLENT game, saison 2 punish the players , no more skill needed but luck became the factor number 1 for win, specially after 3th month. Today i give 6.2 but maybe less in the future if the next months does not offer more things.",
    "timestamp": 1559512800
  },
  {
    "username": "monkeychucker",
    "rating": 5.0,
    "comment": "I just haven't enjoyed Season 2 as much as Season 1. There are way too many things to keep track of and the entire game to me (and the rest of the group that's playing with me) doesn't seem Pandemic-ish. Perhaps if there was an app that kept track of the current set of rules, that might improve our experience. We're in September and we've already accidentally either cheated or not done something that would have improved our chances of success. This has happened at least 5 times. Granted, we play maybe every month and a half so that contributes to those issues. However, that was about the frequency we played Season 1 and we never ran into those problems. We've talked about whether we'll continue with Season 3 when it comes out, or move on to something else after we complete Season 2. I think right now the consensus is we'll move on (but perhaps it will get better).",
    "timestamp": 1559080800
  },
  {
    "username": "Marusidze",
    "rating": 6.0,
    "comment": "Such a frustrating game. Even if you do everything right, the luck element can and will destroy you",
    "timestamp": 1759960800
  },
  {
    "username": "Derianhorgen",
    "rating": 6.0,
    "comment": "Gespendet an das Jugendhaus Worzeldorf",
    "timestamp": 1758751200
  },
  {
    "username": "manuelxhoracio",
    "rating": 6.0,
    "comment": "Otra vuelta de tuerca al Pandemic. En cuanto a narración y evolución del juego (o del mapa), la sensación es genial; sientes el progreso desde el primer momento. Pero llega un punto que la campaña en que se hace demasiado difícil y se endurece y desmoraliza un poco. No está a la altura de la primera temporada, pero está bien",
    "timestamp": 1753480800
  },
  {
    "username": "ranzelbart",
    "rating": 6.0,
    "comment": "Loved the first season - the objectives felt hard but achievable with the correct strategy. Compared to that reference, season 2 felt extremely luck-dependent and unrewarding. This might be especially due to the fact that we played with four different characters. This massively increases the difficulty for the final objective (heavily reccommend playing december with only 2 characters for better odds). We somehow managed to win it (got very lucky), yet it did not feel very rewarding knowing it was mostly luck.",
    "timestamp": 1752703200
  },
  {
    "username": "horusz",
    "rating": 6.0,
    "comment": "Nagyon nehéz, főleg úgy, hogy az első és a nulladik évadban is alig vesztettünk küldetést. Első nekifutásra májusig jutottunk, ott feladtuk. 5 év elteltével újból nekiálltunk ezúttal 4 fős csapattal. Eddig január-február nem is könnyen, de sikerült.\n\nJúnius után újból feladta Lara. És talán igaza is van, mert unalmas volt hónapról-hónapra ugyanazokat a küldetéseket csinálni.\n\nVégül ketten fejeztük be négy karaktert használva, de csak azért, hogy legyünk túl rajta. A végén végre volt egy kis ötlet, egy kis érdekesség, de az biztos, hogy ez a Pandemic Legacy sorozat leggyengébb darabja. Ami azért rossz, mert sokaknak elvette a kedvét az ezt követő nulladik évadtól, ami viszont jól sikerült.",
    "timestamp": 1745791200
  },
  {
    "username": "nargles6",
    "rating": 6.0,
    "comment": "We took a 7 year break in the middle of the campaign. It's light, easy, and quick to play. We did feel like we were constantly behind (in terms of unlocking things) and the game had to give us everything; I guess we weren't Searching enough? Also, the scratch off stuff is really crap after 7 years so maybe avoid this?",
    "timestamp": 1745618400
  },
  {
    "username": "DexGeek",
    "rating": 6.0,
    "comment": "Owner: Dex",
    "timestamp": 1744754400
  },
  {
    "username": "electricalwell",
    "rating": 6.0,
    "comment": "We enjoyed this way less than Season 1. Some of the new mechanics were cool, but we found there were too many games in a row that featured the exact same objectives. We were ready for more stuff way before the game gave it to us, and won't be finishing it.",
    "timestamp": 1743030000
  },
  {
    "username": "sireeshaaluri",
    "rating": 6.0,
    "comment": "Up to 4",
    "timestamp": 1742425200
  },
  {
    "username": "KvdBergh",
    "rating": 6.0,
    "comment": "Only 1 play in, but so far so good.",
    "timestamp": 1739487600
  },
  {
    "username": "krit1789",
    "rating": 6.0,
    "comment": "Pandemic with an evolving narrative",
    "timestamp": 1736118000
  },
  {
    "username": "imaginaryforce",
    "rating": 6.0,
    "comment": "Good although must be played with 4 players. It's basically impossible at 2 or 3 players.",
    "timestamp": 1734044400
  },
  {
    "username": "Jarekk82",
    "rating": 6.0,
    "comment": "Fällt meiner Meinung nach im Vergleich zur ersten Season etwas ab. Die Kampagne packt mich nicht so - und das Gefühl der Hoffnungslosigkeit - das zu dieser Waterworld-ähnlichen Story durchaus passt - war immer mal wieder Begleiter in den Spielrunden. Ich war froh, als die Kampagne durch war. Es ist per se kein schlechtes Spiel, mit vielen Wendungen in der Story und gut funktionierenden Mechaniken. Einfach nicht so mein Ding.",
    "timestamp": 1729461600
  },
  {
    "username": "qgelfand",
    "rating": 6.0,
    "comment": "Really hard. I am not really interested in playing more (i got to May or June, I think). It's Pandemic.",
    "timestamp": 1729202400
  },
  {
    "username": "lancefriday945",
    "rating": 6.0,
    "comment": "Didn't enjoy this one as much as Season 1. Required much more note taking and the system wasn't as clean. Would still recommend if you are a fan of the Pandemic system.",
    "timestamp": 1726696800
  },
  {
    "username": "leleyx",
    "rating": 6.0,
    "comment": "Completed.",
    "timestamp": 1724277600
  },
  {
    "username": "HiveGod",
    "rating": 6.0,
    "comment": "“Well slim-slam there, racker! Cop a squat an’ I’ll skivvy you a tell of some sick bashers who went all AWOL up on the cargo catch...”\n\nSo begins the pilot of Sick Patrol: 2089, an “edgy” 2002 reboot of the cult favorite Sick Patrol, an unintentionally comedic medical drama from the late 1980s.\n\nMuch of it was shot on leftover Waterworld (1995) sets that had been cut loose after principle photography and drifted to the center of the Great Pacific Gyre, where they were subsequently populated by a contingent of rogue Pinoy merchant marines and their Brazilian \"girlfriends\". This population was used as enthusiastic extras for the duration of the show, leading to online outrage as the main cast was, without variation, made up of snow-white Europeans and Americans. While problematic from a racially tone-deaf angle, it actually enhanced the (again, unintentional) comedic milieu.\n\nOf course, the aggressively hip \"future-speak\"—sounding like a cartoon character from a 1990s snack commerical—didn't help.\n\nAfter 19 plays: Just not as good as Season 1. More of the mechanical gyrations felt less connected to the narrative, which somehow felt thinner, leading to a lack of immersion. I sat down ready to experience a story, had trouble finding the narrative thread, and stopped caring nine games in. The rest were a slog that I powered through for completion's sake because I like hanging out with my friends.\n\nWin, with a final score of 568.\n\nOur thinly annotated plays.",
    "timestamp": 1724277600
  },
  {
    "username": "arkeangel",
    "rating": 6.0,
    "comment": "Season 2 just didn't live up to what Season 1 accomplished. The game felt less polished and more disjointed. I had a lot of fun playing it because of my group but the game itself was a bit disappointing.",
    "timestamp": 1720821600
  },
  {
    "username": "Innsbruck",
    "rating": 6.0,
    "comment": "Player Count: 1 to 4\n Co-Operative Game: Everyone wins or loses together.\n\nWe were about 2/3 of the way through this when the campaign got interrupted by the real pandemic. We haven't continued it yet.\n\nDesigned by Rob Daviau and Matt Leacock.",
    "timestamp": 1719266400
  },
  {
    "username": "DanBunting",
    "rating": 6.0,
    "comment": "Honestly, where the original is a 10, this game suffers from imbalance caused by how open the game is, and how much choice the characters have.\n\nThe game was fun, but at times it felt like a slog and there is a lot of opportunity for players to put themselves in an impossible situation.\n\nI get why the designers made the choices they did, but giving players the breadth of choices they have in season 2 ultimately makes for a worse game due to pacing and balance issues.\n\nPlay if you're great at Pandemic AND your group is too, but if you're only going to play one in the series, this should not be it.",
    "timestamp": 1712527200
  },
  {
    "username": "akjrabe21",
    "rating": 6.0,
    "comment": "Left a lot lacking after season 1, but it can be tough to top something so great. Felt that the story telling fell short of season 1, but gameplay was still good",
    "timestamp": 1712008800
  },
  {
    "username": "bbulkley",
    "rating": 6.0,
    "comment": "Played the entire season with a good group. I found the game itself boring and unsatisfying. The legacy elements were fine but didn't add anything for me.",
    "timestamp": 1709420400
  },
  {
    "username": "D Erasmus",
    "rating": 6.0,
    "comment": "We lost interest in this one half-way thru. Gloomhaven took over as the legacy game.",
    "timestamp": 1708642800
  },
  {
    "username": "BGteamawesome",
    "rating": 6.0,
    "comment": "slechts een schim van de eerste",
    "timestamp": 1706396400
  },
  {
    "username": "LeBaston",
    "rating": 6.0,
    "comment": "Main issue: The narrative isn't less interesting, motivating and konsistent in comparison to Vol. 1. There is no twist and our playing group hadn't those thrilling moments in the infection phase.\nThe development of the characters are nicely done though. Making strategies is still fun.",
    "timestamp": 1693346400
  },
  {
    "username": "hexpixy",
    "rating": 6.0,
    "comment": "Interesting mechanics and it still feels really unique compared to a lot of other games. I think this one suffered from being compared to the original but it was interesting to play a sequel to a legacy game",
    "timestamp": 1692828000
  },
  {
    "username": "MJF_Durham",
    "rating": 6.0,
    "comment": "Just found it too unforgiving when started to fall behind, became a case of just getting through to the end after May/June. Much preferred S1.",
    "timestamp": 1692655200
  },
  {
    "username": "Gibbo",
    "rating": 6.0,
    "comment": "We'll get this started someday.",
    "timestamp": 1690927200
  },
  {
    "username": "blankfrancis",
    "rating": 6.0,
    "comment": "Having completed the campaign, I found Season 2 to be a bit of a letdown compared to Season 1. Part of this, I'm sure, is just that the novelty of the Legacy format has worn off somewhat, but I think there are some genuine problems with this game. Chief among those is that, rather than starting with the familiar base of vanilla Pandemic, the game starts out feeling quite unfinished, like we the players are meant to \"unlock\" the full game by opening the various mystery boxes that are dangled in front of you at every step. Getting new stuff to add to the game is cool, of course, but at some point I began to feel like that was the only reason I was playing. I found Season Two less engaging than I've ever found Pandemic before.",
    "timestamp": 1689112800
  },
  {
    "username": "Yves1981",
    "rating": 6.0,
    "comment": "20",
    "timestamp": 1688335200
  },
  {
    "username": "IkariOri",
    "rating": 6.0,
    "comment": "2-4",
    "timestamp": 1681423200
  },
  {
    "username": "TylerND",
    "rating": 5.5,
    "comment": "We couldn't even finish this one. Hard to pinpoint why it could not capture the magic of Season 1, but it just did not come close.",
    "timestamp": 1681250400
  },
  {
    "username": "Stevemould",
    "rating": 6.0,
    "comment": "Why is putting things on the board not as satisfying as taking them off?",
    "timestamp": 1678402800
  },
  {
    "username": "elitegamingsociety",
    "rating": 6.0,
    "comment": "Nick",
    "timestamp": 1677798000
  },
  {
    "username": "Quietthunder79",
    "rating": 5.9,
    "comment": "Too hard. Too many rules. Too fiddly. Finished game with unopened doors with no reference from when those doors should be opened. Added elements and rules that only added to complexity and not to the gameplay, story or experience. I really wanted to like this game, but alas...",
    "timestamp": 1677798000
  },
  {
    "username": "NormaNehren",
    "rating": 6.0,
    "comment": "Mark & Andy, Kirk & Norma Jan 2021 finished it in 2022, only took a year!",
    "timestamp": 1674946800
  },
  {
    "username": "visard",
    "rating": 6.0,
    "comment": "Takes it further away from the original Pandemic. Same structure, you get two tries for each month, and after the whole year the game is unusable.",
    "timestamp": 1674601200
  },
  {
    "username": "Jadlak",
    "rating": 5.5,
    "comment": "Don't even know if you can sell a partially completed legacy game...",
    "timestamp": 1673305200
  },
  {
    "username": "betasub",
    "rating": 6.0,
    "comment": "Après une saison 1 géniale, on a enchaîné sur la saison 2. Elle a démarré très bien, c'était plein de surprises et de bonnes idées. Mais ensuite, les défauts du 1 (mise en place longue, règles qui s'accumulent au fil de la campagne...) nous ont paru plus flagrants encore et dans ce cadre, impossible de laisser 1 mois entre 2 parties car il fallait se souvenir de toutes les petites règles ajoutées, certaines (le vaccin de mémoire) laissant beaucoup de place au flou.\nAu final, on n'a pas fini la campagne, quel dommage!\nSi on y joue assidument et sans temps mort, je pense que ça peut être une aussi bonne expérience que la première saison.",
    "timestamp": 1670194800
  },
  {
    "username": "Tempuro",
    "rating": 6.0,
    "comment": "Very, very swingy game, poorly balanced, and poorly produced sticker sheets. Would not buy again, whereas I'd happily play through 0 and 1 again.",
    "timestamp": 1668207600
  },
  {
    "username": "axiombee",
    "rating": 6.0,
    "comment": "I need to play this more to rate it higher but it doesn't have the same charm as season 1z maybe that's nostalgia but I don't think it 100% is.",
    "timestamp": 1667343600
  },
  {
    "username": "Mestremuten",
    "rating": 6.0,
    "comment": "Rating:\n3/5\nProduction value:\n3/4\nIs the game in my collection/Love to have?:\n0/1",
    "timestamp": 1664575200
  },
  {
    "username": "wleen",
    "rating": 6.0,
    "comment": "I don't know. I liked it, but no one else from the crew (which also played S1) did. Without a word, we stopped playing it about a third in, like it's taboo or something. In the end, we added another player and switched to the King's Dilemma, without ever mentioning how we abandoned Pandemic Legacy: Season 2.\n\nI feel like this is a proper review of the game.",
    "timestamp": 1663020000
  },
  {
    "username": "macgruff",
    "rating": 6.0,
    "comment": "185",
    "timestamp": 1659391200
  },
  {
    "username": "Thure_Halvason",
    "rating": 6.0,
    "comment": "I played and liked the first pandemic legacy very much.\nThe explorable and open world of this one was a bit too ambitious. We lost a good amount of games but managed to achieve to unlock the game contend on our own without the games help.\nThat was what were expecting: quiet a challenge but doable and having a great time.\n\nBut we were not prepared for the extrem tough endgame. The last two to three months felt very repetitive with no really new information.\nThe game should have used these last months to introduce us slowly to what to expect from the final stage.\n\nFor our group the whole experience was ruined by the unfair endgame and mediocre ending.",
    "timestamp": 1659391200
  },
  {
    "username": "JaakkoK",
    "rating": 6.0,
    "comment": "It is a good game but one season would have been enough of pandemic.",
    "timestamp": 1659304800
  },
  {
    "username": "Zaleo",
    "rating": 6.0,
    "comment": "Owned 1/3",
    "timestamp": 1658872800
  },
  {
    "username": "Allenthar",
    "rating": 6.0,
    "comment": "I like how the map slowly expands as you play, but I feel like the core mechanics of the game don't change enough to keep it exciting while playing the many games necessary to complete the campaign. If you really enjoy the core mechanics of Pandemic, this would probably be quite enjoyable.\n\n(Only completed ~6 games of the campaign)",
    "timestamp": 1657576800
  },
  {
    "username": "KkingOSU",
    "rating": 6.0,
    "comment": "Gift - Scudds",
    "timestamp": 1655848800
  },
  {
    "username": "Bursar",
    "rating": 6.0,
    "comment": "The different mechanics from standard Pandemic / Season 1 are interesting, but we've been losing a lot more often than in the previous season.\n\nUpdate: After completing it, I'm putting this in the \"Previously Owned\" section. We messed up a rule that drastically changed our last few games, and made things much much harder on ourselves as a result, and it was too late to rewind and undo changes. All in all, this left a sour taste in our mouths, though the rampup to the finale did build some satisfying tension.\n\nI don't know if I particularly like the rules for the last game, but I'm not going to explain why because it's spoilers. But when you're done with the year, the game itself is absolutely unplayable afterwards, screwups or not.",
    "timestamp": 1655071200
  },
  {
    "username": "scubajacobs",
    "rating": 6.0,
    "comment": "Haven't finished it yet.",
    "timestamp": 1654812000
  },
  {
    "username": "Greenflash21",
    "rating": 6.0,
    "comment": "HAvent gotten past the intro. VERY different game than Season 1",
    "timestamp": 1652306400
  },
  {
    "username": "Zypher_One",
    "rating": 6.0,
    "comment": "Good follow on from Season 1, but seriously struggle on the success rate.",
    "timestamp": 1651096800
  },
  {
    "username": "Elandil84",
    "rating": 6.0,
    "comment": "Didn’t have the pop of season 1, although that may have been due to not being “new”.\nOverall, playing this one felt drab and my group never felt we were having fun. Played into April or may, lost interest, and the idea of diving back in after years of separation from a changing rule set seems daunting.",
    "timestamp": 1650146400
  },
  {
    "username": "edubvidal",
    "rating": 6.0,
    "comment": "Jugado a cuatro jugadores. Nos costó terminarlo quizá porque estábamos más enganchados a los juegos de mesa y preferíamos probar otras novedades.\nEs original sobre todo la manera en la que empieza pero perdimos el interés.",
    "timestamp": 1648504800
  },
  {
    "username": "lewelen",
    "rating": 6.0,
    "comment": "Story was good. Best part was puzzling out optimal turn for all players, then getting that plan blown up. Good mix of success and failure. Ultimately didn't grab me, it again felt like some games there simply just wasn't anything you could've done, and lacking agency in a legacy game feels like burning money.",
    "timestamp": 1647903600
  },
  {
    "username": "MrAiDz",
    "rating": 6.0,
    "comment": "ITS PANDEMIC, continued a Pandemic playing this. Only down side is that I’ve played Pandemic style so often I think I need a 10 year break.",
    "timestamp": 1647126000
  },
  {
    "username": "phildoh8",
    "rating": 6.0,
    "comment": "This game fell flat with my group. I liked that they tried to do something different with the Pandemic system, but it was no where near as good as season 1.",
    "timestamp": 1645398000
  },
  {
    "username": "metalnmath",
    "rating": 6.0,
    "comment": "I found season 1 to be much better. Put it this way, my group played through season 1 and worked through season 2.\n\nWe completed season 1 in about a calendar year. It took us about 4 years to complete season 2. Part of the slowdown was the real-life pandemic. Another part of it was this game simply wasn't as compelling as the first one. The storyline was less intriguing, and the reversal need to add cubes wasn't as fun.\n\nFrom a design perspective, the \"strategize as part of setup\" aspect was kind of interesting. As a player, though, I hated that aspect. If it'd been a while since you last played and needed a refresher on how to play, that mechanic is merciless. Setup on its own could take an hour. Even if you'd played recently, the need to strategize to get the game set up made it feel like work. Decision fatigue was a big factor in this game, even compared to season 1.\n\nThe aspect of season 2 I most enjoyed was the recon. Unveiling larger parts of the map was cool.",
    "timestamp": 1640559600
  },
  {
    "username": "rytrepanier",
    "rating": 6.0,
    "comment": "Very disappointing compared to Season 1. The idea of being able to control which parts of the map you want to explore was interesting, but because the game can't know where people are going to go, there was a lot of redundancies built in to the game, and a lot of cards meant to \"catch you up\" if you're not progressing fast enough. I appreciate that they tried something new, but it didn't pay off. I did, however, like the mechanic of pick up and deliver more than the traditional pandemic mechanic.",
    "timestamp": 1638745200
  },
  {
    "username": "oldmanshreds",
    "rating": 7.0,
    "comment": "Out of the three Pandemic Legacy games, this was our favourite. Very intense and well balanced experience.",
    "timestamp": 1760047200
  },
  {
    "username": "Daniel50",
    "rating": 7.0,
    "comment": "If anything, an even better story than Season 1. It can be quite challenging, however, and making certain discoveries in a timely manner is important. Ultimately our group tired of this one, and I had to finish it myself.",
    "timestamp": 1759183200
  },
  {
    "username": "GeminiWeb",
    "rating": 7.0,
    "comment": "Includes 4 prologue games",
    "timestamp": 1754863200
  },
  {
    "username": "DrHummer",
    "rating": 6.5,
    "comment": "Not as tight and exciting as it's Season 1 big brother. Still one of the best legacy games out there.",
    "timestamp": 1754344800
  },
  {
    "username": "jojondro",
    "rating": 7.0,
    "comment": "Revisado\nIquique",
    "timestamp": 1751234400
  },
  {
    "username": "rkaski",
    "rating": 7.0,
    "comment": "Have barely touched for a variety of reasons. Looks amazing. Have played the first mission.",
    "timestamp": 1750716000
  },
  {
    "username": "lpcheng",
    "rating": 7.0,
    "comment": "Okay, it got better after March & April.",
    "timestamp": 1749420000
  },
  {
    "username": "Ressik",
    "rating": 7.0,
    "comment": "Not as compelling as Season 1 and we stalled out on this one.",
    "timestamp": 1748728800
  },
  {
    "username": "cheshire_cat",
    "rating": 7.0,
    "comment": "It was amazing while it lasted. Now it has ended.",
    "timestamp": 1747778400
  },
  {
    "username": "Jackdanielgta",
    "rating": 6.9,
    "comment": "Condition : Played all the way through, No cards ripped.\nBox: Yellow edition",
    "timestamp": 1746482400
  },
  {
    "username": "drlowdon",
    "rating": 7.3,
    "comment": "Co-Op/Legacy\n\n2 Player: 7.5\n(Best Player Count: 3-4)\nComplexity: Medium\n\nThe additional mechanics make this harder to explain to less experienced gamers than season 1, but it's still a fun co-op experience.",
    "timestamp": 1744408800
  },
  {
    "username": "carnodingo",
    "rating": 6.7,
    "comment": "Legacy Narratif/Tactique\n\nPremière défaite au mois de Mai.\n\nType: Legacy\n\nCategorie: Medium\n\nThème: Survie\n\nMécaniques: Coop, legacy, pandémie.\n\nSimilaire dans ma collection: Coop legacy, peut-être Mech vs Minions\n\nTaille de la boite: Tombal",
    "timestamp": 1744149600
  },
  {
    "username": "Mone83",
    "rating": 7.0,
    "comment": "completed twice",
    "timestamp": 1739833200
  },
  {
    "username": "Batareziz",
    "rating": 7.0,
    "comment": "My one and only legacy game. Liked getting the new components in the first several plays, but than it quickly got tiresome. Not going to buy games like that anymore. Also, confirmed I am not a fan of the Pandemic-style games.",
    "timestamp": 1737414000
  },
  {
    "username": "bcsteeve",
    "rating": 7.0,
    "comment": "Not as good as Season 1, but better than season 0.",
    "timestamp": 1737241200
  },
  {
    "username": "megsherman",
    "rating": 7.0,
    "comment": "Art & Components: 1\nTheme: 1\nRules & Game Play: 2\nReplayability: N/A so 2\nEnjoyability: 1\nTotal Rating; 7",
    "timestamp": 1735858800
  },
  {
    "username": "mgoddard",
    "rating": 7.0,
    "comment": "Completed. The change in taking cubes off took a while to get used to. The story was ok but not as intriguing as Season 1. Still the family enjoyed playing through.",
    "timestamp": 1735426800
  },
  {
    "username": "emilcavan",
    "rating": 7.0,
    "comment": "Era de Lorenzo. Ya lo jugamos",
    "timestamp": 1734476400
  },
  {
    "username": "setropo",
    "rating": 7.0,
    "comment": "Aburrido. Apenas pasan cosas entre partida y partida. Bastante más difícil que el S1",
    "timestamp": 1733785200
  },
  {
    "username": "Neokarasu",
    "rating": 7.0,
    "comment": "The S2 gameplay loop is more frustrating to play than the normal Pandemic system. Since you're required to \"predict\" where the infections will happen and put cubes there to prevent it, sometimes you just get screwed by making the wrong prediction.\n\nThe Legacy elements of the game like the exploration are the main thing carrying the rating for me as without them, I would rate the game a 4.",
    "timestamp": 1733785200
  },
  {
    "username": "cenealon",
    "rating": 7.0,
    "comment": "2024 — Why It Didn’t Make My Top 100",
    "timestamp": 1731193200
  },
  {
    "username": "Bjarvid",
    "rating": 6.5,
    "comment": "Quite the dissapointment imho.",
    "timestamp": 1729980000
  },
  {
    "username": "LincolnjCrockett",
    "rating": 7.0,
    "comment": "A big shake up from Legacy 1, I like how they took pandemic, and made something new from it. the surprises are great too, how it feels like you're on the verge of something big.",
    "timestamp": 1726610400
  },
  {
    "username": "Victory652",
    "rating": 7.0,
    "comment": "Great campaign game.",
    "timestamp": 1725660000
  },
  {
    "username": "jond",
    "rating": 7.0,
    "comment": "Struggles in comparison to both other Pandemic Legacy outings.\n\nThe story was so-so with a super obvious reveal and everything seemed very 'safe' whole areas of the board went unused, the game was quite easy and things that were hinted at on the board just never played out.\n\nplay the others first.",
    "timestamp": 1724191200
  },
  {
    "username": "dr4gonfly",
    "rating": 7.0,
    "comment": "excellent",
    "timestamp": 1722636000
  },
  {
    "username": "advurt",
    "rating": 7.0,
    "comment": "Not as good as season 1 (it takes too long to get to do interesting things in my opinion), but still a fun time.",
    "timestamp": 1721512800
  },
  {
    "username": "MichielTummers",
    "rating": 7.0,
    "comment": "Solid Pandemic title. My first introduction to a true legacy game. It pained me to see cards being ripped up and stickers being put on a map  Thats part of the experience imo.",
    "timestamp": 1721340000
  },
  {
    "username": "Luke_HS",
    "rating": 7.0,
    "comment": "I love the scope of this one, but compared to the other pandemic legacy games the story is a little less focused and there is quite a bit going on mechanically. Still only 2/3 of the way through due to group related factors.",
    "timestamp": 1718316000
  },
  {
    "username": "Identitycrisis1917",
    "rating": 7.0,
    "comment": "Cooperative",
    "timestamp": 1717279200
  },
  {
    "username": "OscarBismarck",
    "rating": 8.3,
    "comment": "Must-have; way better than the first one, however, it is not as groundbreaking as the first one.",
    "timestamp": 1762558080
  },
  {
    "username": "bella20m",
    "rating": 8.0,
    "comment": "I really enjoyed the first half or so, especially when we get to add to the map,then the rules and things you can do started to get overwhelming. Really like the art and the world/setting though.",
    "timestamp": 1758319200
  },
  {
    "username": "TheMiddleAgedGamer",
    "rating": 8.0,
    "comment": "balance wise it felt a little off at times - a cou-pel months we absoltuely thjrased because of somethning we had unlocked previously./ that siad it didnt feel bad to do that, it felt GOOD. but it did miss a little tension sometimes. overall though, i thought it was awesome. we real;ly loved the explortaion.",
    "timestamp": 1756504800
  },
  {
    "username": "bnordeng",
    "rating": 8.0,
    "comment": "Just played the prologue so far and it seems like it has a lot of potential for the map to expand. I like how it's almost anti-Pandemic in that you are cooperating to keep supply cubes on the board so that plague cubes don't show up. We're looking forward to see where this one takes us....\n\nA couple months into the real game now and so far, so good. We're enjoying how the game changes as you go... like Season 1. But, it the overall flow and changes feel quite a bit different than the first one. I want to see where this goes.",
    "timestamp": 1752530400
  },
  {
    "username": "camaradacarvalho",
    "rating": 8.0,
    "comment": "Scrapped for Parts",
    "timestamp": 1751407200
  },
  {
    "username": "Dardura",
    "rating": 7.8,
    "comment": "Sin necesidad de enfundar, jugado entero (habitación)",
    "timestamp": 1750284000
  },
  {
    "username": "mmychal",
    "rating": 8.0,
    "comment": "The story is better than Season 1 but the game is much harder. SOmetimes it feels a bit impossible to beat a scenario with no random events to help.",
    "timestamp": 1749592800
  },
  {
    "username": "LabRat002a",
    "rating": 8.0,
    "comment": "The Pandemic Legacy games are still the best legacy games there are. It's amazing they came out so early and nailed it. I love regular Pandemic and the legacy version is even better. Even though Pandemic has the risk that a bad starting shuffle could wreck a game. Its strength is that you need to be clever to do well, and switch up your strategies as the game changes, which it does in big ways despite always following the basics of Pandemic. Your decisions feel incredibly meaningful. The fact that it is fully cooperative really helps. A lot of legacy games that aren't fully cooperative have to make changes that aren't so meaningful to avoid throwing off the balance of the game, or they do throw off the balance of the game and aren't fun to play as a campaign. Without giving much away, as you play Pandemic Legacy, you will get lots of new cards, goals, rules stickers, characters, and other game components. There are 12 missions, and you get 2 chances to beat each. There is a deck of cards you progress through with each mission, win or lose. There are dossiers panels to open containing stickers. You will be putting stickers all over the rules, board, and cards, forever changing them. There are boxes to open during certain triggers, giving you bigger components. And after each game, win or lose, you can make choices to upgrade different things, making your team stronger. The game will tell you to destroy components, but I just saved \"destroyed\" components in a separate bag as mementos. This game is a one time play through, but the game is so good that it is still worth it even though it's pricey. That said, if you don't like puzzles or don't quickly adjust to change, this game is probably not for you. If you do well, the rewards will compound. If you do poorly, you get some help, but probably not enough to make the game fun for you. And if characters die, you might get a lot weaker. Also, the game is cooperative and you will need to make decisions as a group. For me, the game is fantastic, one of the best ever, but I can see how playing it with the wrong group could ruin it. Because the game is so unique and uses stickers, it's very important to read things carefully, and you will need to look up some rules clarifications online or just make judgement calls as a group. If you make a mistake, it can be impossible to reset from it. These are not reusable stickers, and they don't peel off. But you can punish or aid yourself to make up for mistakes, but agreeing on what is a fair correction is a challenge. We did screw up one big thing and caught it after a game, and then punished ourselves even harder for it. Just make sure multiple players are reading the rules and keeping an eye out for mistakes. Double and triple checking before placing stickers. The game quality is great, but it can be difficult to write on the character sheets. Some pens work better on them than others. It can be tricky to peel the stickers from their backings too, and lay them down straight. It's not for the obsessive compulsive. So far, I have played season 1 and 2. Season 1 is my favorite. The theme & gameplay is great in both. Though the artwork is better in season 2, especially the character art which is more customizable, in a post apocalyptic theme where you start on floating cities in the ocean and must discover the map as the season goes. Season 1 has the traditional Pandemic look, with the full map revealed from the start. But I felt like season 1 ended really well, taking into account your overall progress to give you a final score that was more meaningful, while season 2 pinned all your success on a final gauntlet. Season 2 had more randomness because you had to make decisions without knowing what was hidden in the map. We put off going to some places thinking we were doing ourselves a favor, but instead ended up hurting ourselves considerably. But both are great games and you could start with either. Note that season 1 and 2 come in 2 box colors each. There is no difference to the gameplay in the 2 colors. It is basically so you can play 2 campaigns simultaneously and tell them apart.",
    "timestamp": 1747000800
  },
  {
    "username": "ClintAchilles",
    "rating": 8.0,
    "comment": "Thrown away after completion. Purchased and played through 2 copies.",
    "timestamp": 1744581600
  },
  {
    "username": "RadicalDog",
    "rating": 7.5,
    "comment": "More swingy than other seasons. Our campaign went well, which meant we got good outcomes, and things went even better, and so on.\n\nStill, memorable and good fun.",
    "timestamp": 1741993200
  },
  {
    "username": "lowkey2_2",
    "rating": 8.0,
    "comment": "Worthy successor of a great game that fails to surpass it, but great nonetheless.",
    "timestamp": 1741388400
  },
  {
    "username": "killanowski",
    "rating": 7.5,
    "comment": "It's hard not to compare the previous chapter to this one, since that would make this definitely 2nd place. On its own, however, it's still a solid campaign with new mechanics and a fresh story. Won't spoil the ending, but unfortunately the game design makes it possible for a large gap to occur that players can fall into, if they haven't discovered a particular place (which was never mandatory and is suddenly crucial). We house ruled that flaw and moved on past it.",
    "timestamp": 1740524400
  },
  {
    "username": "burgundy90",
    "rating": 8.0,
    "comment": "3/9/23 Retrospect. The experience is very much a 9 still. I'd happily replay with a new group (since I forgot so much of it already).\n\nVery much enjoyed the experience, the permanence of legacy aspects here, and the story.",
    "timestamp": 1740524400
  },
  {
    "username": "Grimshwiz",
    "rating": 8.0,
    "comment": "Half way through and our play group just absolutely loves this.\n\nEdit: Finished this on Feb 22, and dropped my rating to an 8. I would play it again, but the ending was pretty meh, the reveals were ok, but kind of suspected.\n\nOverall, we enjoyed our 22 hours of play.",
    "timestamp": 1740438000
  },
  {
    "username": "jyhuh35",
    "rating": 8.0,
    "comment": "신선한 시도가 많았다.\n같이 플레이한 팀원과 싸움이 날 정도로 몰입했다.",
    "timestamp": 1739660400
  },
  {
    "username": "kittenboo321",
    "rating": 8.0,
    "comment": "Never finished, got too hard",
    "timestamp": 1737759600
  },
  {
    "username": "I Hendrycks I",
    "rating": 8.0,
    "comment": "Not as tight as Season 1",
    "timestamp": 1737500400
  },
  {
    "username": "stevepwalker",
    "rating": 8.0,
    "comment": "Keep",
    "timestamp": 1735945200
  },
  {
    "username": "GameDuck",
    "rating": 8.0,
    "comment": "Campaign with wife and kid",
    "timestamp": 1735686000
  },
  {
    "username": "Athex",
    "rating": 7.5,
    "comment": "Definitely the worst of the pandemic legacy games. I think it is a new and interesting take on pandemic though. The exploration was the best part of the game, but overall it was not as good as season 0 or 1",
    "timestamp": 1735686000
  },
  {
    "username": "DagnyJ",
    "rating": 7.5,
    "comment": "From Dave for Janie's birthday 2017.",
    "timestamp": 1734476400
  },
  {
    "username": "genoboard",
    "rating": 8.0,
    "comment": "I didn’t enjoy the game as well as season one, but the storyline was excellent. There’s a reveal about halfway through that just killed me. If you get this game, don’t give up until the end. And if you can’t bring yourself to play it all the way through, at least open up the boxes and read the cards till the end. Great story, a triumph of the human spirit.",
    "timestamp": 1732057200
  },
  {
    "username": "Headlex",
    "rating": 8.0,
    "comment": "good game but not that unique of an experience like the first part",
    "timestamp": 1731798000
  },
  {
    "username": "Beqs",
    "rating": 8.0,
    "comment": "A really good successor to Season 1. They made a really good job changing the gameplay. It neither feels the exact same nor like a totally diffrent game.",
    "timestamp": 1730156400
  },
  {
    "username": "zsknight",
    "rating": 8.0,
    "comment": "Complete 1 legacy campaign cycle",
    "timestamp": 1730156400
  },
  {
    "username": "SnirN",
    "rating": 8.0,
    "comment": "The most innovative of the series. It may be very difficult, depending on the choices done in the early games. Very interesting but our least favorite from the series.",
    "timestamp": 1729893600
  },
  {
    "username": "skeil",
    "rating": 8.0,
    "comment": "Need to be Sleeved\nReviewed on Mounted Cloud",
    "timestamp": 1729634400
  },
  {
    "username": "horrorofthedark",
    "rating": 7.5,
    "comment": "finished campaign",
    "timestamp": 1728597600
  },
  {
    "username": "1arska",
    "rating": 8.1,
    "comment": "First season was great, so we just started this game and seems promising.",
    "timestamp": 1727128800
  },
  {
    "username": "SteveLikeGame",
    "rating": 8.0,
    "comment": "Season 2 focuses more heavily on story rather than gameplay. You really need to play Season 1 before this season, and in close timeframe. Years pass between my plays of Season 1 and 2 and I was a little lost on some of the story references in Season 2.\n\nWhile Season 2 is an amazing experience, Season 1 felt more open and had better surprises, twists, and turns. I also felt that Season 2 opens up too slowly and feels more linear compared to Season 1.",
    "timestamp": 1727042400
  },
  {
    "username": "xilia",
    "rating": 9.0,
    "comment": "one shotgame, so only o of 10",
    "timestamp": 1761951600
  },
  {
    "username": "Elwenion",
    "rating": 9.0,
    "comment": "⏳Season2",
    "timestamp": 1761343200
  },
  {
    "username": "david_os",
    "rating": 9.0,
    "comment": "I was skeptical of legacy as a thing but am totally sold on this, which we are having loads of fun with. Saying that, I don't think it's a 'bolt-on' thing you can pull off with every game. It depends totally on the base game having 'good bones' which Pandemic certainly does. What legacy adds to Pandemic is stakes that feel like they matter, something I think the base game lacks.\n\nCompleted the campaign in July 2024 and enjoyed it right to the end, even to the point of wanting to lose some more games so we'd get to play a few more - although my group was not convinced by this logic!\n\nAs it neared the end the game had become very complicated, so much so that it's important to keep up momentum and play every week or two so you don't lose track of all the new rules that have been added to the system.\n\nThe final task to win the last month was appropriately challenging - to the point of almost feeling unfair, but we pulled it off and it was so much the better for being difficult... we do not do these things because they are easy, etc.",
    "timestamp": 1760306400
  },
  {
    "username": "hockeyjones",
    "rating": 9.2,
    "comment": "Played in 2021",
    "timestamp": 1759615200
  },
  {
    "username": "blake33",
    "rating": 9.0,
    "comment": "Just as good as the first season - great game!",
    "timestamp": 1759269600
  },
  {
    "username": "jerevinan",
    "rating": 9.2,
    "comment": "포스트 아포칼립스 배경의 펜데믹\n조금더 음모론적인 스토리가 나온다",
    "timestamp": 1757455200
  },
  {
    "username": "Ober25",
    "rating": 9.0,
    "comment": "Auf dem Schrank",
    "timestamp": 1753480800
  },
  {
    "username": "Cerberus777",
    "rating": 9.3,
    "comment": "My Best Legacy Game!\n My 2nd Best Thematic Game!\n My Best Pick-up and Deliver Game!\n My 3rd Best Coop Game! (Tied with other Pandemic games)\n My 4th Best Multi-Use Cards Game! (Tied with other Pandemic games)\n My 5th Best Variable Player Powers Game! (Tied with other Pandemic games)\n My 2nd Best Point to Point Movement Game! (Tied with other Pandemic games)\n\n\n IMPORTANT NOTE: This rating is completely spoiler free.\n\n\nLegacy Campaign Game Played = 19 times (Total playtime ≈ 38.0h)\n(Usually around 60-90 minutes of playtime, but with 15-30 minutes, sometimes more, of briefing, upgrading and discussing afterward)\n Great Purchase! (Less than 4$ per hour!)\n\n\n\n COMPLETE RATING\n\n\nSCORE  CRITERIA       WEIGHTING       ------- STAR RATING SCALE -------\n\n(10!) FUN             (x15):         BORING  REALLY FUN\n\n(10!) GAMEPLAY         (x5):       NO DEPTH  LOT OF DEPTH (FOR THE WEIGHT)\n(9.0) GAME FLOW        (x5):         FIDDLY  SILKY SMOOTH\n(10!) DOWNTIMES        (x2):         LOT OF  ZERO\n(8.5) RANDOMNESS       (x2):      PURE LUCK  PURE SKILLS\n(10!) MECHANICS        (x2):         BORING  INTERESTING / INNOVATIVE\n\n(0.0) REPLAYABILITY    (x5):           ZERO  INFINITE (Not applicable)\n(9.0) SCALABILITY      (x3):           POOR  GREAT AT ALL PLAYER COUNTS\n(5.0) PORTABILITY      (x1):          BULKY  SUPER EASY TO PLAY ANYWHERE\n\n(10!) THEME            (x1):   UNATTRACTIVE  ATTRACTIVE\n(8.0) AESTHETICS       (x1):           UGLY  GORGEOUS\n(9.0) COMPONENTS       (x1):    LOW QUALITY  HIGH QUALITY\n(8.0) VALUE            (x2):  TOO EXPENSIVE  REALLY CHEAP(LOW COST FOR WHAT WE GET)\n\n(7.5) SETUP TIME       (x2):           LONG  ZERO\n(9.0) GAME LENGTH      (x2): TOO SHORT/LONG  JUST PERFECT\n(9.0) RULES COMPLEXITY (x1):        COMPLEX  SIMPLE\n\n\nTOTAL = 419.0/45 = 9.31\n\n\n POSITIVE POINTS:\n\n++ Pandemic is a great cooperative game, so a better version with a legacy story-driven campaign to it is an awesome gaming experience (this is how we must approach this game, as a gaming experience and not just a game, so the non-replayability after the campaign is more acceptable this way).\n++ I really like that they did something completely different than just another Pandemic Legacy Season 1, with a new basic mechanism.\n++ The evolving story of the legacy campaign, which leads to evolving game rules, increase the fun to solve the ever-evolving puzzle of this game (and really needs players to change strategy sometimes).\n\n\n NEGATIVE POINTS:\n\n-- I hate buying a game that have a finite shelf life. You can play one full campaign of 12 to 24 games and then you're done with this game (you can no longer play it with the full Legacy experience).\n-- On the point above, I would have like that the designers would include a sealed envelope that would have official variants to play the game using your own unique board afterward (to mitigate the one time use aspect).\n-- This is a lower value game (strictly speaking, because of the lack of replayability of the Legacy campaign), but still a great value gaming experience.\n-- (Not a concern for me, but an important recommandation) This game should always be played with the same people and individual games should be played relatively close together (ideally at least a game every week, max every two weeks) to keep the additional rules fresh in your memory.\n-- This game has a strong memory aspect to it (since there are multiple copies of each city cards in the Propagation deck), so I suggest to new players to keep a log of the cities in the Propagation deck, in order to help plan the strategy instead of trying to remember what's in there (as planning is fun, but forcing to remember something you know you should remember but doesn't, isn't).\n-- Like many legacy games, the play time is longer than written on the box, especially on certain months.\n\n\n OTHER GAME INFO:\n\nGame Weight = 3.2/5\nRelease Date = 2017\nNumber of Player = (1)2-4\n2-player length = 60-90 min (playtime) + 15-30 min. (briefing, upgrading and discussions) = 75-120 min.\nPlayer Count Preference = Best at 2, probably great at 3 and 4 too!",
    "timestamp": 1752444000
  },
  {
    "username": "koutynhu",
    "rating": 9.0,
    "comment": "HYBRID\nSubtype: Legacy\n\n- Cooperative Hand Management & Set Collection Game (2-4 Players) [Best:2]\n- Theme: World Epidemic\n- Legacy\n- Complexity:3.22\n\nSummary: Same recipe for success (following season 1), great game!\n\n**Played and not replayable copy of a Legacy Game\n\nPlaying my second Copy",
    "timestamp": 1748383200
  },
  {
    "username": "Unicorniest",
    "rating": 9.0,
    "comment": "The only downsides to the excellent Pandemic Legacy series is that it's not really playable or sellable after completing campaigns. My partner and I played through all three seasons each using two characters at a time, it remains my favorite gaming experience.",
    "timestamp": 1748383200
  },
  {
    "username": "shawnmackay1593",
    "rating": 9.0,
    "comment": "Fantastic game! I found that it dipped a bit in the middle (I think around May/June) but it picked again and my wife and I really enjoyed most of the campaign. Many games were close including the last game where we barely won.",
    "timestamp": 1747000800
  },
  {
    "username": "SinterHead",
    "rating": 9.0,
    "comment": "I don't think Season 2 is as good as Season 1, but there's a lot of great game to be had here. It feels more difficult and that you're always fighting a losing battle, which I'm less of a fan of. But it's still Pandemic Legacy and I love it.",
    "timestamp": 1745964000
  },
  {
    "username": "diosuke",
    "rating": 9.2,
    "comment": "Modo Solo 10, setup rápido/campaña/IA Sencilla/entretenido",
    "timestamp": 1744927200
  },
  {
    "username": "IvoryDaggers",
    "rating": 9.0,
    "comment": "All the fun of Pandemic Legacy, plus a \"dystopian future\" narrative? Yes, please!",
    "timestamp": 1743890400
  },
  {
    "username": "Banbeck",
    "rating": 8.5,
    "comment": "Nuevo Cerrado\n1600 pesos",
    "timestamp": 1742252400
  },
  {
    "username": "loon",
    "rating": 9.0,
    "comment": "As with Season 1, this is not a 10 only because you can't really play it again.",
    "timestamp": 1741820400
  },
  {
    "username": "natlas",
    "rating": 9.0,
    "comment": "While Pandemic Legacy: Season 2 doesn’t quite capture the same magic as the first season, it still offers a solid, engaging experience for fans of the series. The storyline takes a new direction, introducing fresh mechanics and challenges that keep things interesting, but it might feel like a step down from the emotional intensity and suspense of the original. That said, if you enjoyed the first season, it’s still a highly enjoyable and rewarding experience—just with a slightly different vibe.",
    "timestamp": 1741734000
  },
  {
    "username": "FuzzyLlamaReviews",
    "rating": 9.0,
    "comment": "Ongoing playthrough/review thoughts below. There will be spoilers so read at your own risk.\n-------------------------------------------------------------------------\n\nI have to say, I am REALLY loving this one! I went in pretty apprehensive because we just finished Season 1 and it left me a little \"meh\". So, I am only 4 games into this one thus far and will continually update this (and the score) as I progress and have new thoughts about it, but as it stands right now, it's a 10.\n\nThe things I am loving: Absolutely love the board design and artwork. It's really giving me a \"Fallout\" feel with the colors and how the board looks like some kinda metal map thing with the rust around the edges. The gameplay, although similar, is a fun little twist on the original Pandemic formula where you are trying to ADD cubes (supplies) to cities instead of remove them. But at the same time there are these Plague cubes that can pop up and spread which cannot be removed.\n\nThe legacy aspects are more fun than season 1 as well. Now you have cards that can be scratched to find stuff with the new \"Search\" action. The board itself is discovered over the course of play with new stickers being placed on the board to fill out the land as you discover it. It's a really neat system that I think does it better than Clank Legacy (which is newer).\n\nBetween the post-apocalyptic theme (which I will admit I am extremely biased towards), the artwork, the board design, the new legacy elements and the interesting gameplay, this is a MASSIVE improvement on season 1. And to be honest, this is a contender (so far) for beating out my current favorite legacy game, Betrayal Legacy.\n\nUpdate:\n\nWe just finished with April and our next game will be the start of May. We lost both games in April, the first one was due to some extremely bad luck card draws and we couldn't control the plague. The second game was VERY close and we would have won on our next turn but alas the last plague cube got us yet again.\n\nStill loving the game. Nothing really revolutionary happened with the story or play but the WAY the game plays out is very fun. Exploring and discovering new lands and how you are trying to keep cities supplied is just flat out fun to me. Still a 10/10 game.",
    "timestamp": 1741042800
  },
  {
    "username": "onesones",
    "rating": 9.0,
    "comment": "通关",
    "timestamp": 1738882800
  },
  {
    "username": "Jmccue",
    "rating": 9.0,
    "comment": "Many say this one isn't as good as the Season 1, but I'll say they are tied. I like the way this one makes you discover the map and has twists unique and different from Season 1. Overall I'd say if your group loved Season 1, go for Season 2 and you won't be disappointed.",
    "timestamp": 1737500400
  },
  {
    "username": "Quayde",
    "rating": 9.0,
    "comment": "5 Prologues may be a bit much, but two were learning, two were demoing and one was teaching. PLS2 is like an inverted Pandemic, which is a good basis and the designers make a lot of game out of an initially small map. The character upgrades are overall weaker than PLS1, although some remain complete no-brainer choices. I was disappointed that S2 didn't change things up as much as S1: I felt I was pretty much playing the same game for 10 months this time, whereas previously we had to change tactics a lot more. Due to irregular sessions, we missed one huge strategy that would have made things much easier but, after a terrible November, we rallied for the win in December. 796pts IIRC.",
    "timestamp": 1736204400
  },
  {
    "username": "vacekrae",
    "rating": 9.0,
    "comment": "Played this all the way through. Did the same with Season 1. Both are excellent games, and I liked how this one built on some of the legacy mechanics of the first one.",
    "timestamp": 1735945200
  },
  {
    "username": "Gemay",
    "rating": 9.0,
    "comment": "The game was great, and as a follow up to Pandemic Legacy: Season 1, it held up to the expectations.\n\nThere were a few cards with scratch off sections that were almost unusable - creating a difficulty in discovering what it says.",
    "timestamp": 1735254000
  },
  {
    "username": "Gia187",
    "rating": 8.7,
    "comment": "Geen spoilers:\nDeftige verhaallijn wanneer je klein begint en ergens mag eindigen.\nLegacy betekent echt wel, 1 keer door spelen en het spel is finito.\nZonder te spoilen:\nhet speelt gelijkaardig aan pandemic maar het is een echte legacy die je 1 keer volledig speelt (12 tot 24 keer afh van je aantal verliezen).\nNadeel: pandemic kan swingy zijn in zijn randomness.\npositief: je hebt hier veel meer mogelijkheden om in te spelen hierop. Van maand tot maand en je goed voorbereiden en weten waarnaar je wil is cruciaal en kan helpen tot je succes.\nJe kan ook niet alles gedaan hebben in deze game en daar moet je over kunnen kijken. Op het einde heb je wel wat een overzicht over wat je mogelijks gemist kunt hebben in grote lijnen, want de game zelf helpt je wel goed op weg en stuurt bij als het echt fout gaat en je ergens niet goed hebt opgelet.\n\nHet spel zelf heb ik solo gespeeld (4 handig) aangezien er bij het cooperatieve toch geen verdoken info is en je dus evengoed samen hierover kunt nadenken, of in mijn geval alleen over de 4 handen.\n\nOp het einde blijft er vooral een verhaal hangen.\nVoor mij overtreft dit pandemic owv de avontuurlijke aard, de verhaallijn erachter en het feit dat er wel randomness is, maar dat deze te minimaliseren valt als je risico's durft nemen om je beter op te stellen voor je volgende maand die er dan aankomt.\n\nThematisch: 8/10\nStrategy: 8/10\nComplexity: 3/5\nverhaallijn: 9/10",
    "timestamp": 1733785200
  },
  {
    "username": "gabrielcohn",
    "rating": 8.5,
    "comment": "This was my favorite of the Pandemic Legacy series. More room to explore than the others.",
    "timestamp": 1732143600
  },
  {
    "username": "Alliterato",
    "rating": 9.0,
    "comment": "Közös",
    "timestamp": 1731538800
  },
  {
    "username": "p0rtugalvii",
    "rating": 8.7,
    "comment": "LEGACY: COMPLETED",
    "timestamp": 1731366000
  },
  {
    "username": "MiloXCoco",
    "rating": 9.0,
    "comment": "aesthetics: 8\nquality: 8\nvalue: 8\nconsistency: 10\norganization: 10\n\nsmoothness: 8\nstrategy: 9\naccessibility: 9\n(re)play-ability: 10\ninteraction: 10\n\n90/100\n\n16 plays",
    "timestamp": 1731106800
  },
  {
    "username": "wingeekbrett",
    "rating": 9.0,
    "comment": "45€",
    "timestamp": 1730415600
  },
  {
    "username": "brodieman",
    "rating": 9.0,
    "comment": "Disassembled after played",
    "timestamp": 1726264800
  },
  {
    "username": "irmela_smartie",
    "rating": 10.0,
    "comment": "I'm one of the few who prefer Season 2 over Season 1. I like the futuristic elements.",
    "timestamp": 1762470000
  },
  {
    "username": "JGMTFreedom",
    "rating": 10.0,
    "comment": "Players: 2-4\nCo-op\nLegacy",
    "timestamp": 1761519600
  },
  {
    "username": "Har0ldinh0",
    "rating": 10.0,
    "comment": "Another great pandemic legacy. Lives up to the heights of the first",
    "timestamp": 1761084000
  },
  {
    "username": "RougeHemlock",
    "rating": 10.0,
    "comment": "One of my favorite board gaming experiences I've ever had. That being said, it was so good that my family and I didn't really care to go back to the original pandemic anymore after playing this. Great cooperative campaign. Play season 1 first though.",
    "timestamp": 1760824800
  },
  {
    "username": "guyzou",
    "rating": 10.0,
    "comment": "Where's the eleventh star?",
    "timestamp": 1760652000
  },
  {
    "username": "CyberDany",
    "rating": 10.0,
    "comment": "Mi juego favorito hasta ahora. El mejor de la saga por mucho, el nivel de dificultad y la cantidad de cosas a tener en cuenta es increíble, no basta con cumplir el objetivo, hay que ir avanzando en muchas cosas a la vez anticipando lo que se viene el siguiente mes. El ir expandiendo el mapa y trazando tus propias rutas es una pasada. Un must play en toda regla.",
    "timestamp": 1760220000
  },
  {
    "username": "RenaissanceMom",
    "rating": 9.5,
    "comment": "2-4. 60m, 3.3\n(Rob Daviau, Matt Leacock)",
    "timestamp": 1757541600
  },
  {
    "username": "srfdevotee",
    "rating": 9.5,
    "comment": "Highly enjoyable, though relative to Season 1, it has a bit less compelling and more convoluted story. There are also more ways to break the game flow, such as when player-driven events happen in an order the game design didn't necessarily expect. These nick-picks aside, this is still an immersive, fun, and interesting thematic experience. Few games are like it.",
    "timestamp": 1753826400
  },
  {
    "username": "JohnGrimes",
    "rating": 9.5,
    "comment": "Legacy",
    "timestamp": 1750802400
  },
  {
    "username": "ReeseBoyy2",
    "rating": 9.5,
    "comment": "Rules: Read through 10/13/24\nMissing Pieces: None",
    "timestamp": 1746396000
  },
  {
    "username": "thespaniardsteve",
    "rating": 10.0,
    "comment": "Completed!",
    "timestamp": 1745445600
  },
  {
    "username": "Jreliane30",
    "rating": 10.0,
    "comment": "Expansion.",
    "timestamp": 1742511600
  },
  {
    "username": "runarm",
    "rating": 10.0,
    "comment": "Revized rating Jan 2021: 10\nCollection: B-Shelves",
    "timestamp": 1737586800
  },
  {
    "username": "Minsc1610",
    "rating": 10.0,
    "comment": "CMPG",
    "timestamp": 1737241200
  },
  {
    "username": "Husmenaga",
    "rating": 10.0,
    "comment": "Very good continuation to the pandemic legacy series. Personally I liked season 2 more than season 1. New theme of the game is refreshing. Creating and distributing supplies and rediscovering the world territories is a well thought touch. I hope we get an another season for this series. (A different season than season 0)",
    "timestamp": 1732230000
  },
  {
    "username": "lovethebomb",
    "rating": 9.9,
    "comment": "Played through the campaign over the better part of a year with the same crew as Pandemic Legacy: Season 1. A superb board gaming experience, though a tad more fiddly mechanics-wise, and it takes longer to get up to speed narratively compared to Season 1. That said, I treasure the memories playing it.",
    "timestamp": 1730242800
  },
  {
    "username": "orangecharger",
    "rating": 9.9,
    "comment": "Just parts left",
    "timestamp": 1728597600
  },
  {
    "username": "mattcharlton1984",
    "rating": 10.0,
    "comment": "Absolutely phenomenal. *just* better than S1.",
    "timestamp": 1727992800
  },
  {
    "username": "ghorron",
    "rating": 10.0,
    "comment": "Different from S1 but great once you get used to the playstyle required.",
    "timestamp": 1726610400
  },
  {
    "username": "wjxway",
    "rating": 10.0,
    "comment": "Almost finished, love it even more than season 1.\nVery fresh game mechanism, the discovery part is cool. More intense all the way through if you have some perfectionism (We MUST NOT trigger the event cards!).",
    "timestamp": 1726351200
  },
  {
    "username": "funnyfishman",
    "rating": 9.5,
    "comment": "Cooperative Games - https://boardgamegeek.com/geeklist/340582",
    "timestamp": 1724882400
  },
  {
    "username": "Tchomur",
    "rating": 10.0,
    "comment": "Fantastic! So much more interesting than pandemic while still being as accessible to newbies (pandemic can still be too much for some non-gamers though). Love!",
    "timestamp": 1724191200
  },
  {
    "username": "Matryyxx",
    "rating": 10.0,
    "comment": "Played with Mom & Dale",
    "timestamp": 1720562400
  },
  {
    "username": "mike_sz",
    "rating": 10.0,
    "comment": "Legacy, co-operative, strategic, thematic",
    "timestamp": 1717884000
  },
  {
    "username": "emanuele81an",
    "rating": 10.0,
    "comment": "Gioco meraviglioso, è uno dei miei giochi preferiti in assoluto.",
    "timestamp": 1717279200
  },
  {
    "username": "carloschagas94",
    "rating": 10.0,
    "comment": "to jogando o sessao 0 e adorando vou apostar nesse inovador jogo",
    "timestamp": 1715378400
  },
  {
    "username": "Isaiah_Stuart",
    "rating": 10.0,
    "comment": "My personal favorite in the series. I love the exploration elements. This game really sets itself apart from the other pandemic games, while still being recognizably part of that lineage. I loved the ability to create your own characters too.",
    "timestamp": 1712959200
  },
  {
    "username": "Nordlicht85",
    "rating": 10.0,
    "comment": "1",
    "timestamp": 1708815600
  },
  {
    "username": "Philipp Klarmann",
    "rating": 9.5,
    "comment": "Excellent",
    "timestamp": 1708383600
  },
  {
    "username": "Morgonio",
    "rating": 10.0,
    "comment": "played through",
    "timestamp": 1708297200
  }
]