[
  {
    "username": "zmartianov",
    "rating": 1.0,
    "comment": "The game glorifies conquest without asking",
    "timestamp": 1754604000
  },
  {
    "username": "NavayaTCG",
    "rating": 1.0,
    "comment": "Could be good, but it's just bad for new players, players have no idea what's good or bad",
    "timestamp": 1752012000
  },
  {
    "username": "lililililil",
    "rating": 1.0,
    "comment": "Automata / Eurojank",
    "timestamp": 1747432800
  },
  {
    "username": "liquidsn8ke",
    "rating": 1.0,
    "comment": "shit game",
    "timestamp": 1744927200
  },
  {
    "username": "ManEatingHippo",
    "rating": 1.0,
    "comment": "This is just the reimplementation of a puzzle game. Learn the puzzle. Win the Game. Repeat. Boring.",
    "timestamp": 1733266800
  },
  {
    "username": "cotomel",
    "rating": 1.0,
    "comment": "Uninteresting rehash.",
    "timestamp": 1732748400
  },
  {
    "username": "Beedun",
    "rating": 1.0,
    "comment": "I can't get behind any game that is a re-implementation of Terra Mystica, even if it has an awesome space theme to it.. Still the same shitty Terra Mystica underneath..",
    "timestamp": 1714341600
  },
  {
    "username": "Arnaud3013",
    "rating": 1.0,
    "comment": "0 fun. Played at 2 players. Seems a game where you intend to block others players (we hate that), complexity for the sake of complexity.",
    "timestamp": 1699743600
  },
  {
    "username": "kounabi22",
    "rating": 1.0,
    "comment": "not my taste",
    "timestamp": 1680213600
  },
  {
    "username": "Bilajz",
    "rating": 1.0,
    "comment": "Theugly clone of Terra Mystica",
    "timestamp": 1678748400
  },
  {
    "username": "Risvalvolo",
    "rating": 1.0,
    "comment": "Terra mystica forever..",
    "timestamp": 1671836400
  },
  {
    "username": "sunyushen",
    "rating": 1.0,
    "comment": "对不起，我尽力了。BGA打了20局还是一窍不通。不是我擅长的游戏，没法给我带来快乐，我只能打5分。",
    "timestamp": 1662242400
  },
  {
    "username": "X4_Commander",
    "rating": 2.0,
    "comment": "Brain pain",
    "timestamp": 1756072800
  },
  {
    "username": "Ginewra",
    "rating": 2.0,
    "comment": "bga",
    "timestamp": 1739660400
  },
  {
    "username": "lapja",
    "rating": 2.0,
    "comment": "As funny as it is doing your taxes",
    "timestamp": 1624831200
  },
  {
    "username": "Crawfgolf",
    "rating": 2.0,
    "comment": "Hard to understand, could of been bad teacher,",
    "timestamp": 1613948400
  },
  {
    "username": "VirontherunFrance",
    "rating": 2.0,
    "comment": "you can't really do much, every turn you play feels like \"I will do this ! ah... no I can't... Then this ! ah no, I can't either... then I guess I will just pass...\"\nAnd then all you manage to do brings you nothing at the end, it's just nonsense...\nAlso, the theme could be anything else.",
    "timestamp": 1600380000
  },
  {
    "username": "Merlin8888",
    "rating": 2.0,
    "comment": "Worse version of Terra Mystica which players up to 5.",
    "timestamp": 1590444000
  },
  {
    "username": "zachpas",
    "rating": 2.0,
    "comment": "nope",
    "timestamp": 1580252400
  },
  {
    "username": "Hanysonic",
    "rating": 2.0,
    "comment": "Really Boring and nearly no interaction with other players",
    "timestamp": 1572127200
  },
  {
    "username": "mindmgmt",
    "rating": 2.0,
    "comment": "Terra Mystica...in space. Slow build up and just as it starts to get going (2 hours in)? It's over. Messy graphic design - hard to read.",
    "timestamp": 1561672800
  },
  {
    "username": "VaultBoy",
    "rating": 2.0,
    "comment": "Incredibly fiddly with the spinning of energy, and lots of moving and removing of tokens and markers. There are multiple places you have to check for your income. The iconography is a poor substitute for text. The actions in the game are fairly straight forward, but the gameplay feels like a hot mess.",
    "timestamp": 1551567600
  },
  {
    "username": "Golden Aegis",
    "rating": 2.0,
    "comment": "Game is far too dry for my taste. Game design was interesting, but I could never really get into the game.",
    "timestamp": 1550444400
  },
  {
    "username": "rorodrisaz",
    "rating": 2.0,
    "comment": "over rated",
    "timestamp": 1532901600
  },
  {
    "username": "mickhah1",
    "rating": 3.0,
    "comment": "Not really enjoyable.",
    "timestamp": 1762210800
  },
  {
    "username": "Wolcik",
    "rating": 3.0,
    "comment": "Digital version available (Android and BGA Premium)\nToo complicated for me to make any meaningful strategy. I hate the 3 level magic from Terra Mystica in here as well.",
    "timestamp": 1757973600
  },
  {
    "username": "SJS1971",
    "rating": 3.0,
    "comment": "I love Terra Mystica but this game just sucks. The space theme really doesn't work when there are interactions based on adjacency. The map is ugly and lifeless, and every turn is a wearying calculation of distances, neighborhoods, currency, ore, QICs, and power moves. A lot of this mathiness is in Terra Mystica too, but for some reason the Gaia Project computations are not at all intuitive.",
    "timestamp": 1732230000
  },
  {
    "username": "kraedy",
    "rating": 3.0,
    "comment": "Worse in every way to Terra Mystica, especially the cheap components and less interesting theme. Really disappointed by this.",
    "timestamp": 1713650400
  },
  {
    "username": "chaoticgood4life",
    "rating": 3.0,
    "comment": "Compared to its predecessor, Gaia Project shifts the game’s focus away from the map and towards the newly introduced tech tree/track/space cults?.\nThe harsh competition permeating Terra Mystica’s map and cult tracks feels significantly less pronounced here. Instead, the mechanical puzzle plays an even bigger role but it has also been made more interesting by some clever additions, such as the more involved power management system.\nGaia Project still shares so much of Terra Mystica’s DNA that I do enjoy it quite a bit. However, I am a little sad that my favorite aspects of the original game have somewhat fallen by the wayside here.\n\nUpdate 2024: Not interested in revisiting this game. Terra Mystica is Ok but that is where I draw the line.",
    "timestamp": 1710716400
  },
  {
    "username": "Scifi66",
    "rating": 3.0,
    "comment": "Terra Mystica in Space. Much prefer the Mk1 version TM and the additional rules relating to technology and the Gaia Project simply make the game worse.\n- Missing the tension of the Terra Mystica land grab\n- Factions have less theme than TM\n- Tech tree symbology is a lot to process\n- Much longer than TM, over 4+ hours with 3p, which lowers the decision density to tedium",
    "timestamp": 1701212400
  },
  {
    "username": "jcoopersd",
    "rating": 3.0,
    "comment": "I just kept asking myself, why? Why should I care about any of this?\n\nIt's a game about making tracks go up and pushing cubes around. The tracks get you cubes. The cubes don't mean anything, other than how they let you make tracks go up and put down structures which let you get more cubes. The only interaction is the old euro standby of \"I got here before you did so you can't do it\" which I find mostly irritating.\n\nIt's very much a game in the vein of Everdell, Wingspan, Lost Ruins of Arnak, etc. - games that are popular on BGG. So if you want something like that, except with an annoyingly high rules / iconography / terminology overhead that makes teaching new players a pain, then get this.",
    "timestamp": 1697666400
  },
  {
    "username": "John Rogers",
    "rating": 3.0,
    "comment": "Won 134-103-96 against two experienced Terra Mystica players. I hear the two designs are largely the same but this one is supposedly more robust (read complex). Well, guess I can skip TM then.\n\nIn short:\n\nDo you like engine-builders? Overwrought tech-trees? Do you want a game that has nominal board presence, plastic bits, is set in space and has the appearance of interaction but deep down you’re still just playing an MPS-efficiency-point-salad? Well here ya go. Gaia Project to the rescue!\n\nLonger-take:\nGaia is an MPS-point-salad-efficiency-engine-builder with a somewhat-obfuscating-tech-tree. It does what it does well and once you get past the icons it’s just optimization and efficiency planning, which for me isn’t the kind of challenge I find fun.\n\nIf you dig perfect info and unmitigated planning this is very solid. This is one of those games that feels like it would be better as an app via bookkeeping, icons and optimization scores. You are already barely cognizant of others at the table anyways.\n\nThe variety here comes not from others but in the form of various factional choices (with minor differences between them), a random set-up of both round-to-round and end-game VP goals, and a variable board.\n\nRecommended to gamers who dig Pfister, Lacerda, and most modern complex Euros.",
    "timestamp": 1680386400
  },
  {
    "username": "junior_gracz",
    "rating": 2.5,
    "comment": "How can this game be top 10?\nI seriously can't understand how BGG features puzzles like Gloomhaven and Pandemic and a game like Gaia Project in top 10 ?\nTrolls at work?\n\nGaia project is the opposite of a streamlined game and equally the opposite of good strategy. Power Grid has equal strategy value as this with 10% of the rules and with a faster and intuitive game play. Actually: how can anyone even compare this game to a complex but elegant and polished game such as Brass????\n\nWant to play Gaia Project? Be prepared to spend hours asking \"So how does this mechanic/icon work?\" Then, after hours of setting up for a high scoring move (90% of the game), get a comment like: \"No, but this icon doesn't mean that / No, you needed this unrelated thing to do that one other thing you inted to do\". And my favorite \"ah you know, last round/game we played this wrong... from now on we should... \"\n\nThis is the result of fiddly rules - a large amount of, btw- bad graphic design, icons and too many convoluted mechanics forced together.\n\n\"Experts\" would say \"well you have to know the game better\" But a new problem arises: even between veterans, we're talking about a game where it's usual to have 1st place with a 15+ point lead over the second, and a 30+ over last. Those are signs of an overly complex, unbalanced snowballing bad game. Why bother?\n\n6+ unpleasant hours I spent in this: highly regrettable. I won one of those games and I have to say I never felt so unsatisfied. At least random short games like King of Tokyo give you an exciting satisfaction - even if you think you don't 'deserve' it. In Gaia Project you also don't 'deserve it' but the key difference is that you spent several boring fiddly hours to get that feeling\n\nEven the components are redundant (7 sets when you can only ever use 4..). Sad to say, I reckon the effort the designers put in this game and some ideals could have been great, but the final product is TRASH. A top 500 board game should be fun and polished, Gaia Project is not, sadly.",
    "timestamp": 1677970800
  },
  {
    "username": "natb0yce",
    "rating": 3.0,
    "comment": "I wanted to play a single player game and didn’t feel like waiting for a physical game in the mail. (Plus- I don’t have much room for a game box) so I got the steam version.\n\nThe steam version tutorial is sub par. I feel like it would be easier to pick up in person with an experienced player.\n\nIf I could get my money back I would.\n\nI don’t play many games by myself, so I don’t see myself playing this game often, if at all.",
    "timestamp": 1676588400
  },
  {
    "username": "onoborisan",
    "rating": 3.0,
    "comment": "Too complicated and long.",
    "timestamp": 1674428400
  },
  {
    "username": "omnitheus",
    "rating": 3.0,
    "comment": "Played once. More than enough for me.",
    "timestamp": 1640300400
  },
  {
    "username": "SteoanK",
    "rating": 4.0,
    "comment": "I'm not sure I'm going to end up keeping this. Overall our first play was just ok. Hadn't played Terra Mystica before, but the sci fi theme was more enjoyable. Need to try at more than 2.",
    "timestamp": 1760392800
  },
  {
    "username": "bclayj",
    "rating": 4.0,
    "comment": "Exactly the sort of low interaction, long play time Euro I have grown to love to hate. This is barely a game, it's an efficiency puzzle decided by the opening board state and race you are playing. After three plays I am done, no fun for me to be had here.",
    "timestamp": 1741647600
  },
  {
    "username": "tectactoe",
    "rating": 4.0,
    "comment": "A very good game, and one of my favorite examples of \"let me see exactly just how long I can extend my turn\". Factions are more balanced here than TERRA MYSTICA, which makes VP bidding less critical for casual (non-expert) players. Technology tracks and their respective benefits open up possibilities for massive combos. I like TERRA MYSTICA's crunchy, confined map, but I also appreciate the variability offered by GAIA PROJECT and the different approach required to traverse the map. The one thing I miss is \"partial\" terraforming.",
    "timestamp": 1740524400
  },
  {
    "username": "luisneto1996",
    "rating": 4.0,
    "comment": "Bad design. Bad iconography. There is better games in the the time that Gaia is played. Cant understand the hype around this game. Good ideas poor execution.",
    "timestamp": 1732489200
  },
  {
    "username": "cfarrell",
    "rating": 4.0,
    "comment": "Given my dislike of Terra Mystica I’m not sure how I got sucked into this. But I think what surprised me is just that it’s not very different at all from that game. I would have thought that if you’re going to change the setting and make a whole new game in a giant box with new components, there would be some interest in doing more to distinguish it, trying something different. Not that there aren’t a few changes, there are, but it just feels nearly identical to me. I do think the tweaks in Gaia Project make it better, but we’re all many games in on TM already and TM was a game with a pretty hard replayability limit. So … ?",
    "timestamp": 1723586400
  },
  {
    "username": "nishikawa-collector",
    "rating": 4.0,
    "comment": "Never like space games much. Boring design. Also not a Terra Mystica mechanics fan and just a copy of that largely.",
    "timestamp": 1716933600
  },
  {
    "username": "tbrofromspace",
    "rating": 4.0,
    "comment": "The perfect exemplum of how seemingly minor changes in the formula of a game (TM) can dramatically change the whole. GP trades the teeth and competition of TM for a \"feel good\" experience where you're never trapped and there's always a way to do what you want to do. Sure, you can have a 90-point spread in a game, but that's not because some other player blocked you or made your life difficult. Removing the track ranked scoring, tieing an entire economic engine to it, making range and building where you want trivial, the changes to the power bowls--ugh.\n\nI reserved judgment on this for a while because I thought I simply sucked at it, but it turns one of the greatest games of all time into just another economic snowball game. Just a perfect example of designers not understanding what was good about their original design and responding to stupid criticisms of the parent game.",
    "timestamp": 1716501600
  },
  {
    "username": "Animepops",
    "rating": 4.0,
    "comment": "There are some games I just don't understand the hype. Well, to be fair, there are some games I just plain don't understand. I plan to try it a time or two more, but this game just feels like you only have one valid choice each turn to make and the game just takes you for a ride, which I find kind of boring. (rating based on digital play only)",
    "timestamp": 1712181600
  },
  {
    "username": "janglemangle",
    "rating": 4.0,
    "comment": "for some reason, the actions don't feel good\n\ntoo much depth in the asymmetry that i don't want to explore",
    "timestamp": 1708988400
  },
  {
    "username": "marcuslind1",
    "rating": 4.0,
    "comment": "2023-07-11\nRating after first play, 3p (2 experienced): 5\n\nI played the bug faction with the little pink plastic rock for special power (Talkons?). Seems like a good intro faction. Humans looked to dull, although was probably best choice for the set-up\n\nMaybe this deserves a higher ranking from me, but that's the BGG ranking system for you.\n\nLots of variability in set-up with a modular board, 12 or something different factions and randomized bonus tiles for tracks and rounds, that you need to max out in combination with your faction powers (and those of your opponents!). The game is area control, collect and convert resources, build engine to get points, and about 10 different track races. Also quite a long play time. No conflict that I know of, but with an ok kind of discount/leaching system for building near opponents. In other words, not my kind of game nowadays. But I can recognize it for what it is, and that it's a great game of it's kind. Much much better than something like Newton or Lorenzo il Magnifico (apart from play time, which I'm sure speeds up when you don't have to guide the newbie).\n\nCan play again with the right people. Seems to play well with 3p.\n\n2023-07-16\nDowngraded to 4 after giving it some more thought. Set-up decides a lot, understanding what combos with what etc. Possible to learn/analyse though. A plus with this (choosing starting position etc) is that you get more control over starting factors than in a game like Scythe.",
    "timestamp": 1689458400
  },
  {
    "username": "swigo",
    "rating": 4.0,
    "comment": "I like Terra Mystica better, I think I would rate this game higher if I didn't compare it unfavorably to it's predecessor. I found it less interactive, and more complicated without being any more fun",
    "timestamp": 1683151200
  },
  {
    "username": "Gorgoneion",
    "rating": 4.0,
    "comment": "Very well done game, but also deep and heavily involved. Rating is based on the opinion I have of the mechanics, as for actual enjoyment it is a little dry for me, but definitely better than its predecessor.",
    "timestamp": 1679439600
  },
  {
    "username": "JSMA",
    "rating": 5.0,
    "comment": "sehr kindliche Grafik\nNur teck track",
    "timestamp": 1762038000
  },
  {
    "username": "gatchaman",
    "rating": 5.0,
    "comment": "So...it's OK. Bought it for solo play since it's so well-loved for solo, and it's OK. The Automa is not terrible, but it's not interesting. The game is a super-complicated set of interlocking mechanisms. Do this so you can do that, which lets you do another thing... All with no theme of course. It is what it advertises itself as, I just don't think these games are my cup of tea.\n\nIt makes me wonder, how did the evolution of board games work out such that this is where we end up, where the most highly-regarded games are the most intricate and complex set of mechanisms?",
    "timestamp": 1757541600
  },
  {
    "username": "apuity",
    "rating": 5.0,
    "comment": "Short of a euro masterpiece due to AI mechanic, where winning a game requires deliberately exploiting AI weaknesses and tendencies, rather than winning based on superior engine-building and adaptation to the emergent environment. The modular setup also often leads to lopsided asym powers\n\nin storage",
    "timestamp": 1754863200
  },
  {
    "username": "synthlord",
    "rating": 5.0,
    "comment": "4.31",
    "timestamp": 1753221600
  },
  {
    "username": "JFed01",
    "rating": 5.0,
    "comment": "with Folded Spaces insert",
    "timestamp": 1747260000
  },
  {
    "username": "capasso2300",
    "rating": 5.0,
    "comment": "1st play impressions. I loved the game. -Rated it a 7 at this time\n\nIts not an easy learn, and it's not helped by confusing iconagraphy, and a rulebook that could be organized better.\n\nafter 4 plays? I think it's run its course. At least at 2 player count. Theres lots of interesting decisions to be made, but your constantly strapped for cash and resources, so i feel like i'm constantly trying to find a way to earn a coin.....just to complete the plans i had. Sometimes this goes on for so long, you forget your plan.\n\nIt's also mostly solitaire at this player count.\n\nAnd in general, just not fun to play. More of a exercise, or math puzzle.",
    "timestamp": 1745964000
  },
  {
    "username": "Fuzzel",
    "rating": 5.0,
    "comment": "Sehr komplex, man muss zig Züge im Vorraus beachten. Mehr Arbeit als Spiel.\n< Puerto Rico < Great Western < Tzolkin",
    "timestamp": 1743890400
  },
  {
    "username": "yoyomanhihi",
    "rating": 4.5,
    "comment": "Big euro game, with a lot of strategy and depth, and brilliant mechanically. Gaia project doesn't bring anything new in itself, but it puts everything together nicely.\n\nPersonally, even though I definitely see why people love it so much, I'm not a big fan of these big euro games. Having to plan the next 5 turns is just too serious and not fun to me.\n\nAlso, even though there is some indirect interaction because you develop on the same space and compete for common objectives, it's still a low interaction game, where you focus on your own board. Again, this is a point that some people will love, and I'm not saying it's bad, but I personally prefer games with more direct interaction.\n\nOverall, even though the game is not for me, it's definitely one of the best big euro games. Therefore, if you like these kind of games (Ark Nova, Terraforming mars..), you will definitely love this one.",
    "timestamp": 1742338800
  },
  {
    "username": "machitis",
    "rating": 5.0,
    "comment": "The theme is cool and the game components are beautiful -- but I think I'm really learning, the expensive way, that euro games are not what I'm looking for.",
    "timestamp": 1742338800
  },
  {
    "username": "rendesm",
    "rating": 5.0,
    "comment": "one of the most boring games I have played.",
    "timestamp": 1741388400
  },
  {
    "username": "ultimoratio",
    "rating": 5.0,
    "comment": "UPDATE: Oct 2022 - \n\nEDIT: Hey! It's me from 2025. Me from 2022's thoughts are accurate upon more plays. Gaia now leans more towards player efficiency, rather than players navigating through opaque decisions due to positional problems.\n\nStill a heavy Euro with serious depth, but I don't get the same satisfaction that I get from other 5-star games. I had a think about this, and I think it's due to these factors:\n\n1.) the reliance on the tech-tree for strategic depth. While touted by gamers as an improvement from Terra Mystica, it actually made decisions more straight-forward and less opaque (this is bad).\n\n2.) The sparser map and the tight range have made fight over space blunted and with less edge. It is an aspect from Terra Mystica that creates disruption and causes decisions to become more opaque. Granted, spatial positioning in Gaia is still crucial\n\nDowngrade to 3 stars\n\n================\n\nUPDATE: Sept 2020: Heavy Euro with serious strategic depth. Prefer Terra Mystica as it is more balanced and more refined than the newish Gaia Project. However, I'm sure Gaia Project will also get the same treatment.\n\n================\n\nGaia Project captures the spirit of Terra Mystica so well. There are changes that I don't like and like. I love the modular board. The map, however, feels like it is too loose. I prefer the tightness of Terra Mystica. I hate the research track - made the temple track less competitive. Personally, I lean more on Terra Mystica every single time, but I don't mind playing this.",
    "timestamp": 1740265200
  },
  {
    "username": "honk3d",
    "rating": 5.0,
    "comment": "M",
    "timestamp": 1739228400
  },
  {
    "username": "Third_Era",
    "rating": 5.0,
    "comment": "",
    "timestamp": 1738710000
  },
  {
    "username": "kelvbrown",
    "rating": 5.0,
    "comment": "It’s not a game that plays to my tastes.",
    "timestamp": 1733439600
  },
  {
    "username": "hiimjosh",
    "rating": 5.0,
    "comment": "Saw this in a FLGS for a very reasonable price and decided to go for it. The automa system has gotten a lot of praise for this and I wanted to give it a whirl. I thought Terra Mystica was fine although it had some rough edges. Gaia Project is both a step forward and a step backward.\n\nI think it'd be best to drive this by talking about what is different from TM. First and foremost is the graphic design which I find very drab and \"poopy\" - a big difference from TM's eye-catching palette. To my surprise though I liked the plastic bits more than the wooden ones from TM and appreciated the extra detail plastic provided\n\nAnother difference is the boards. Gone are the rivers and intermediary spaces - and yet again I was surprised not to have missed either of these. Games still feel interactive in Gaia Project without feeling crowded. Maps are still tight but you're unlikely to get completely choked off as in TM\n\nThe tracks are also different in Gaia Project and are effectively a streamlined version of the upgrades in TM. Another welcome change\n\nGaia Project introduces a new resource which effectively doubles the number of Power-type actions you have. I found this to be a bit head-spinning but worth the effort\n\nThe last relevant change is the introduction of a \"Gaia\" phase. There are special planets which take dedicated resources to colonize and which are delayed a turn. This is where I think Gaia Project took a wrong turn. There are a bunch of extra rules and mechanics which are almost exclusive to this one planet type and it takes special cased rules a step too far for me\n\nOverall I think Gaia Project is better than Terra Mystica. It streamlines some things and does sand over some rough edges, however it also adds complexity (extra resource, Gaia phase) which counteracts some of the parts I like\n\nAs for the solo mode - it's really similar to Scythe's solo mode, and I didn't like it there. It works a little better here, but again the AI is a dumbed down player who doesn't take some actions. I know this is part of trying to keep things simple - it's just a bit unsatisfying to play an opponent which doesn't compete in some realms of the game. It's more of a problem in Scythe than here though as Gaia Project is primarily a race/optimization game with little interaction. The solo mode plays cleanly enough\n\nI would be remiss to not mention the rulebooks. They aren't very good. The solo rules are very terse and compact (for example, there are rules that are spelled out in the intro of the rulebook and not mentioned anywhere else) which I found frustrating. The core rules are fine - the Gaia phase felt hand wavy, but I just ignored it for now. The appendices and symbology references are there but a bit scatterbrained and I don't understand why some tokens weren't spelled out specifically but others were - the references feel kind of lazy\n\nIn the end I like this marginally better than Terra Mystica. It's even less elegant than Terra Mystica though which is a bit of a feat",
    "timestamp": 1732489200
  },
  {
    "username": "saccenti",
    "rating": 5.0,
    "comment": "It's not quite my thing (little too long, little too large a decision space).",
    "timestamp": 1723068000
  },
  {
    "username": "Zete",
    "rating": 5.0,
    "comment": "Maybe we weren't in the mindset but none of found it enjoyable. We will give it another go, but right now it's definitely a take it or leave it game. And I lean heavily on the leave it side of the scale.",
    "timestamp": 1720476000
  },
  {
    "username": "tmoiynmwg",
    "rating": 4.5,
    "comment": "Cool design, but too complex to feel worth the effort.",
    "timestamp": 1716156000
  },
  {
    "username": "yiechow",
    "rating": 5.0,
    "comment": "Frankly, I am not a fan of space games especially without a solid theme. Have to say some rules are too dumb to fit a heavyweight game that's why the designer abandoned theses in the new one age of innovation.",
    "timestamp": 1715205600
  },
  {
    "username": "Oezz",
    "rating": 5.0,
    "comment": "The tech tiles and research tracks are an improvement over the cult tracks of TM. On the flip side space is a less original theme and the art + graphics are still comically bad. Remains a pain to teach and lacks interaction for my tastes, it is quite difficult to hinder other players even slightly. Starting placement can lose you the game if chosen poorly (although good placement does not guarantee a win). Each game presents many tough choices, with multiple paths to victory such that subsequent plays feel different.",
    "timestamp": 1714946400
  },
  {
    "username": "Udai",
    "rating": 5.0,
    "comment": "It was interesting, but I didn't feel it was a special game. The system was just complicated and not beautiful, and the rules were not particularly impressive.\nThe asymmetrical abilities clearly limit efficient play, and the play feels rather cramped for so many options.",
    "timestamp": 1714428000
  },
  {
    "username": "Redwall",
    "rating": 5.0,
    "comment": "Good euro game. Seems more polished than terra mystica (TM), however I feel I would prefer TM for the flavor and the factions",
    "timestamp": 1705964400
  },
  {
    "username": "blanket221",
    "rating": 5.0,
    "comment": "遊戲畫風相當魔幻，可能對孩子來說稍微有點抽象，不過遊戲本身滿好玩有趣的，所有派係都可以提高他們在六個不同發展領域的技能——地形改造、導航、人工智慧、蓋亞成形、經濟、研究——從而獲得先進技術和特殊獎勵。為了做到這一切，每個小組都有特殊的技能和能力。",
    "timestamp": 1704668400
  },
  {
    "username": "sklipnoty",
    "rating": 5.0,
    "comment": "This game felt overly complex for what it is. It is a lot to take in. A more streamlined version of this would score a lot better.",
    "timestamp": 1700434800
  },
  {
    "username": "laserdeathray",
    "rating": 6.0,
    "comment": "Includes 3D printed organizer, great condition",
    "timestamp": 1762210800
  },
  {
    "username": "sutrebuh",
    "rating": 6.0,
    "comment": "Made more complicated! Gaia Project transports Terra Mystica into space without ever really arriving there. It has none of the elements expected of space games. It is not a 4X game. There is no exploration, no exploitation, no battles. There aren't even spaceships, diplomacy, or trade. The shift has merely resulted in the habitable fields now being planets that are often not located next to each other. This frees up the entire game and puts the focus on technological progress, which the cults had to give way to. Instead of the simple race in Terra Mystica, we unlock abilities here. In addition, there are now several different scoring options at the end of the game. The game has become more variable at this point, as has the game board, but it has also become more complicated. It has lost some of its elegance and intuitiveness. The need for planning and the factors to be considered have increased, while the struggle with the other players has decreased. The different abilities sometimes cancel out any significance of positional play.\nAll this, plus the greater time required, makes Gaia Project suitable for two players; beyond that, it becomes tedious. The thematic factions from Terra Mystica are sorely missed: witches, fakirs, cultists, etc. In Gaia Project, the names are constructed in the same way as the abilities: Hadj Halla, Bal T'ak, Taklons, etc. Somehow, space seems a bit detached. While the balance of the factions was reasonably maintained in the original, it seems to be out of whack in space. This impression is reinforced by the technology bonus tiles, where we always want to grab the same ones, but we have to raise the corresponding research bar, which is more or less interesting and easy to use for our faction. This sometimes results in very high-scoring constellations. The randomly drawn final scores also favor some races more than others.",
    "timestamp": 1760133600
  },
  {
    "username": "Eniven",
    "rating": 6.0,
    "comment": "I have yet to have this game really sing for me, but all the high praise makes me hopeful. I haven't played at a higher player count than 2, and I've heard it's more of a puzzle than a game at that player count. Hope to play this with a larger group. If I do I will adjust my rating accordingly once I get to experience \"the real game\".",
    "timestamp": 1759701600
  },
  {
    "username": "graybeard76",
    "rating": 6.0,
    "comment": "Very steep learning curve. watched a how to video and a play through and still had to constantly refer to the instructions. Overall could be enjoyable after several more plays, but don't think I have the patience.",
    "timestamp": 1759010400
  },
  {
    "username": "Imsevimse",
    "rating": 6.0,
    "comment": "There’s a lot bolted on, making it quite heavy and far too long. Even though the best options are often obvious, downtime can drag since you really have to min-max your resources, with little room for mistakes. The power management mechanic feels completely tacked on. In the end, it’s just not for me.",
    "timestamp": 1759010400
  },
  {
    "username": "dmwainw",
    "rating": 6.0,
    "comment": "BGA",
    "timestamp": 1758578400
  },
  {
    "username": "neomorder224",
    "rating": 6.0,
    "comment": "Overly and in some cases, unnecessarily complex. Named \"Gaia Project\" but didn't actually touch this mechanic at 2P counts. The space theme just doesn't connect with the feel you get playing either. Doesn't feel like a epic space game",
    "timestamp": 1751234400
  },
  {
    "username": "raggededge",
    "rating": 6.0,
    "comment": "Deep and rewarding gameplay with tons of strategic options. The learning curve is steep and the theme feels a bit dry, but the mechanics are top-notch",
    "timestamp": 1751234400
  },
  {
    "username": "maritn",
    "rating": 6.0,
    "comment": "Expected to like this more. Rating might go up with repeated plays, but currently I'm not so keen on playing it again.\n\n+ Setting\n\n- Too many actions",
    "timestamp": 1748988000
  },
  {
    "username": "bergmaal",
    "rating": 6.0,
    "comment": "PC Version",
    "timestamp": 1748210400
  },
  {
    "username": "Vinnichi",
    "rating": 6.0,
    "comment": "+ https://www.planszostrefa.pl/pl/p/Geekmod-Drewniany-insert-p...\n\n+ https://www.planszostrefa.pl/pl/p/GeekMod-Organizer-pasujacy...\n\n+ https://www.planszostrefa.pl/pl/p/GeekMod-Plecki-do-organize...",
    "timestamp": 1745532000
  },
  {
    "username": "Erboka",
    "rating": 6.0,
    "comment": "Friend's game",
    "timestamp": 1745013600
  },
  {
    "username": "kilianbognar",
    "rating": 6.0,
    "comment": "They basically put graphic design on accounting and called it a game.",
    "timestamp": 1742943600
  },
  {
    "username": "Patesco",
    "rating": 6.0,
    "comment": "This is a great game - very engaging!",
    "timestamp": 1740610800
  },
  {
    "username": "Michelsan",
    "rating": 6.0,
    "comment": "Ok mechanic, but the races are not that well balanced. Feels often frustrating because of the lack of ressourcess. Don't like the poor graphics ( ugly characters and pictos ) and the VP salad at the end. Bought it for the thematic, science fiction, a field where there are much funnier games.",
    "timestamp": 1738796400
  },
  {
    "username": "s_craig_zahler",
    "rating": 6.0,
    "comment": "I dig heavy games of this type--Vital Lacerda and Martin Wallace are my favorite euro designers--and I enjoy asymmetrical factions, but I do not like power discrepancies in the latter determining the outcomes of games, which is the case to some unknown degree with Gaia Project.\n\nI played with my similarly skilled girlfriend and had these results:\nI played faction A and she played faction B.\nB won.\nWe flipped factions. I played B and she played A.\nB won.\nWe changed to two factions said to be very evenly balanced by one of the many, many threads on Boardgamegeek dedicated to evening out this inherent game imbalance (a testament to the design flaw).\nShe played C and I played D.\nC won.\nWe flipped. I played C and she played D.\nC won.\n\nOur experiences and the many BGG threads on this topic show that faction abilities greatly affect the outcome of each game. For the same reason, we stopped playing Keyforge. Flashpoint: Fire Rescue also had a career (Imaging Technician) that broke the game and made it super easy.\n\nGaia Project has a lot of clever mechanics--especially the power charging and federation building--but there are too many good and balanced games out there for us to play a lengthy, thinky one with built-in and game-determining flaws.\n\nOh well...Sandra awaits us in Kanban E.V. (my favorite euro ever), our vineyards must be attended in Vinhos (2010), vikings need to eat in A Feast for Odin, deliveries await us on Railways of Nippon, and corn needs harvesting in Tzolk'in: The Mayan Calendar...",
    "timestamp": 1736636400
  },
  {
    "username": "Generalkhun",
    "rating": 6.0,
    "comment": "Feel a LOT better than its cousins Terra Mystica and Age of innovation due to more opening space but still need more plays to be skillful enough to tackle on board interactions. This family still facing \"overloaded perfect (tons of) information with 0 themes\" issues which is weird because usually rich rules come with rich themes because the designer may wants to tell some stories and make the information baked in easier, these games are however, opposite.",
    "timestamp": 1736377200
  },
  {
    "username": "Sugasi",
    "rating": 6.0,
    "comment": "I played it 4-5 times but never got good score. I am to dumb for it, does not mean it is a bad game but not mine.",
    "timestamp": 1735772400
  },
  {
    "username": "MATTtheGM",
    "rating": 6.0,
    "comment": "Soulless! Probably the best word to describe this. There are some interesting mechanics, and the increased random setup removes the solveability which was Terra Mystica's biggest fault. But why does it have to be so dry and boring?? Where is the excitement and fun? Euro's can be fun you know.... (Goes away to play AFFO instead)",
    "timestamp": 1735599600
  },
  {
    "username": "Jimmy71",
    "rating": 6.0,
    "comment": "Nederlandse versie",
    "timestamp": 1735426800
  },
  {
    "username": "ffosb22",
    "rating": 6.0,
    "comment": "Too many rules for its own good at times. There are seemingly limitless options and choices to make on every turn, but there are so many little nuances to remember that it can be difficult. Also a bit too much waiting around sometimes.",
    "timestamp": 1733612400
  },
  {
    "username": "Hibou77",
    "rating": 6.0,
    "comment": "Terra Mystica in SPAAAACE ! Slightly better than TM but essentially the same game.",
    "timestamp": 1732489200
  },
  {
    "username": "Silverman",
    "rating": 6.0,
    "comment": "No-chance game. Lots of different tracks and actions to score. Ideal for engineers/people with IQ 130+. It's a good game in its style, but it's not for me. Overwhelming.",
    "timestamp": 1732057200
  },
  {
    "username": "mhaze10",
    "rating": 6.0,
    "comment": "Played twice. In great condition, just not for me.",
    "timestamp": 1731625200
  },
  {
    "username": "MegaWestWolf",
    "rating": 7.0,
    "comment": "(2019): Finally picked it up, two years after its release. I'm afraid to play it because it has been called the \"Terra Mystica killer\". Terra Mystica is my favorite game of all time and I'm not ready for it to be dethroned.\n\nUpdate (2025): Finally got around to playing this. I'll keep playing Terra Mystica. I know people love this game more, but I preferred the charm of the original. The cult track didn't really bother me like it did everyone else.",
    "timestamp": 1761606000
  },
  {
    "username": "ImZhe",
    "rating": 7.0,
    "comment": "Definitely better/more interesting faction powers and tracks than terra mystica, but I sorta like Terra Mystica's fantasy faction themes more. Nice brain-burn with ton of options available and no rng, but since there are so many actions and they aren't straightforward, it's easy to make small mistakes while playing. Very obtuse and hard to understand how to optimize points well, not very intuitive to learn and play, but extremely deep.",
    "timestamp": 1761606000
  },
  {
    "username": "GameNightHero",
    "rating": 7.0,
    "comment": "Best 4 player games IGN, needs 4 hours plus extra teaching time at 4 players.",
    "timestamp": 1761343200
  },
  {
    "username": "DevOpsProDude",
    "rating": 7.0,
    "comment": "57x89 - 30\n\nPlayed on board game night.",
    "timestamp": 1760047200
  },
  {
    "username": "NateClark",
    "rating": 7.0,
    "comment": "Retheme of Terra Mystica with some extra paths to explore added in. I appreciate that the cult track is more interesting in this version. Still, probably my least favorite between this, AoI, and TM.",
    "timestamp": 1759442400
  },
  {
    "username": "walkie",
    "rating": 7.0,
    "comment": "Extremely similar to Terra Mystica, much moreso than I was expecting.\n\nI feel like this one is probably the slightly better design and my rating would go up if I played it more. But Terra Mystica is still a regular for us (mostly on BGA now), and Gaia Project didn't hook me or stand out enough for me to replace it.\n\nI find the board state much harder to read in Gaia Project for some reason, but that'd probably also ease with experience.",
    "timestamp": 1758146400
  },
  {
    "username": "LeBao",
    "rating": 7.0,
    "comment": "It's a fun game, a true testament to german game design philosophy, but turn take too long and some time feel tedious",
    "timestamp": 1757368800
  },
  {
    "username": "NegativeZer0",
    "rating": 7.0,
    "comment": "Includes Exp",
    "timestamp": 1757368800
  },
  {
    "username": "Matc2",
    "rating": 7.0,
    "comment": ". Conn grupo de juego",
    "timestamp": 1756332000
  },
  {
    "username": "yxd20250823",
    "rating": 7.0,
    "comment": "各种不同种族能力区别很大，发展路线不同，规则很复杂，需要上手很久",
    "timestamp": 1756159200
  },
  {
    "username": "ousgg",
    "rating": 6.8,
    "comment": "The game forever fated to be called 'Terra Mystica in space'. I like TM, but I find that bolting on a daft sci-fi theme and tweaking a few rules is cynical publishing at best. The current trend of designers 'improving' games for re-release is worrying and illustrates the narrowness of the market sometimes.",
    "timestamp": 1754776800
  },
  {
    "username": "eddieb",
    "rating": 7.0,
    "comment": "Terra Mystica in Space. Just lost the charm of the OG game.",
    "timestamp": 1754690400
  },
  {
    "username": "bullfrogggy",
    "rating": 8.1,
    "comment": "Players: 1-4\nBest: 3-4",
    "timestamp": 1762611900
  },
  {
    "username": "invader_sAu",
    "rating": 8.4,
    "comment": "3p",
    "timestamp": 1761778800
  },
  {
    "username": "cinnzel",
    "rating": 8.0,
    "comment": "Siempre me apetece jugarlo. Rejugabilidad casi infinita y múltiples estrategias viables para alcanzar la victoria. Es de esos juegos que se empiezan a disfrutar cuando empiezas a descubrir las sinergias menos evidentes. Es duro y complejo, pero ¡cuánto lo disfruto!",
    "timestamp": 1761692400
  },
  {
    "username": "Evertore",
    "rating": 8.0,
    "comment": "tbp",
    "timestamp": 1761519600
  },
  {
    "username": "Mistrallique",
    "rating": 8.0,
    "comment": "It's an excellent game. A bit too dry for my liking though. I am normally very happy with these very strategic games and I don't really know what I am missing.",
    "timestamp": 1761519600
  },
  {
    "username": "Kensemir",
    "rating": 8.0,
    "comment": "2-3 P\n□",
    "timestamp": 1761429600
  },
  {
    "username": "SkyeHalon",
    "rating": 8.0,
    "comment": "painted buildings",
    "timestamp": 1761084000
  },
  {
    "username": "alialkabah",
    "rating": 8.0,
    "comment": "SOLD\nonly played through BGA, and feel like i dont need to own the physical copy,, im sore with more plays this could go up",
    "timestamp": 1760565600
  },
  {
    "username": "Drez",
    "rating": 8.0,
    "comment": "Very cool game based on Terra Mystica. Solo mode is quite well designed and variable map setup is an improvement on Terra Mystica.\n\nProjected 6/7 on Cindometer - while she might enjoy the gameplay, the theme is not her favourite and the art is fairly uninspiring",
    "timestamp": 1760133600
  },
  {
    "username": "RussPSmith",
    "rating": 8.0,
    "comment": "Clean and straightforward, Gaia Project is one of those ‘heads up’ games which makes you constantly push-and-pull against your opponents. Every move counts, it runs just the right length, and it offers decent variety due to random elements in the setup. Personally, the art is a sizeable turn-off, but that is of course very subjective and only loses the game a half-point from me.",
    "timestamp": 1758664800
  },
  {
    "username": "Colombian85",
    "rating": 8.0,
    "comment": "Verkaufen: 30€\n30€",
    "timestamp": 1758405600
  },
  {
    "username": "peterlevi",
    "rating": 8.0,
    "comment": "3-4 (2)\n(open)\n\nOnly two plays at 2p. The potential is visible, but I need to play more, and with more people.\n\nTurns can get very combo-ish and this makes the game feel a bit slow sometimes. It's also quite long.",
    "timestamp": 1758060000
  },
  {
    "username": "Karahkwa",
    "rating": 8.7,
    "comment": "Gaia project has rich decision making with complex design. The games mechanics interweave for an elegant production that has unbelievable polish. Gaia takes some time to learn, but fortunately, all the rules will begin to make perfect sense. I'm still just a tadpole in a large sea of decisions, but everything makes sense mechanically. Now its just about taking the time to improve my skills. The game does not give you hand out. You have to work for everything. Squeezing out every morsel to extend your turn. The game is super competitive and the strategy pool seams endless. Every game gives you a new set of challenges to adjust to. My one complaint is that I'm not a big fan of the space civilization concept (the theme is not pasted on), its just not something that interests me. Other than that Gaia Project does everything masterfully and is a work of brilliance.",
    "timestamp": 1762665600
  },
  {
    "username": "Rudbeckia144",
    "rating": 8.5,
    "comment": "I still need to bring this beast to the table, but I've been really enjoying my plays on BGA so far.\n\nThere are plenty of asymmetrical factions to pick from. It's a challenge to constantly balance which buildings to put out and try to avoid affecting your income to your disadvantage. The technology track is interesting and it's always difficult to choose what to prioritize at the given moment. Colonizing new planets can be hard if you don't have planets within your reach - so it is if you lack recources or if the terraforming cost is too high.\n\nYou can always see what actions might bring you some extra points during each round and what goals will potentionally reward you with a big (or small) chunk of points at the end of the game, so you can try to plan accordingly.\n\nAll in all, it's a tight and fun puzzle to crack!",
    "timestamp": 1762627320
  },
  {
    "username": "ditterio",
    "rating": 9.0,
    "comment": "Solo Helper: https://brdgm.me/gaia-project/#/\n\nYet to win with these characters:\n\nGeodens\nBal T'aks\nFiraks\nBescods\nNevias\nItars\nTerrans\nLantids\nXenos\nGleens\nTaklons\nAmbas\nIvits",
    "timestamp": 1762297200
  },
  {
    "username": "validcat",
    "rating": 9.0,
    "comment": "Perfect!",
    "timestamp": 1762038000
  },
  {
    "username": "funandfunky",
    "rating": 9.0,
    "comment": "Love it!!!!",
    "timestamp": 1761951600
  },
  {
    "username": "Exodusland",
    "rating": 9.1,
    "comment": "The 2 player game was a blast. We have played Star Wars Rebellion for space theme, and Brass for its strategy style. Gaia Project is the best game for us, no luck, no cards (except for Automa) and easy tracking of resources (I like this better than taking tokens or cubes like in It's a Wonderful World).\n\nThe hungarian rulebook (from BGG) was pretty straightforward and easy to understand. It took 1.5 hours to get through it and understand most of the stuff. We have 4 games already (one after another, without pause) and it is fun. Both me and my wife won and lost, the factions are interesting. The space theme is good to look at, for us the game looks far more better than Brass Birmingham for example.\n\nPros at 2 player count:\n+ 2 hours gameplay\n+ 10 mins setup\n+ the icons are easy to understand\n+ rules are straightforward\n+ plenty of replayability\n+ no luck factor\n+ easy resource tracking\n\nCons at 2 player count:\n- not many interaction in the sense that our paths are not always crossing\n- easy to understand the rules but hard to master the game (this is not a con though  )\n- we happen to forget to track round bonuses as it's a lot to pay attention to\n\nOverall, it's a great game, made for us, we like it a lot. I'm already getting the expansion, the Lost Fleet.",
    "timestamp": 1761865200
  },
  {
    "username": "Noboe",
    "rating": 9.0,
    "comment": "Not for the faint of heart. If not feeling like taking a challenge, go play something else. Gaia Project is not a leisure activity.\n\nGameplay is interesting and demanding, with significant level of interaction. However, a mistake during first turn may turn your game into torment. You will be spectating other players taking their turns. For hours, with no chance to come back.\n\nIt is not like Terra Mystica is a forgiving game. But Gaia Project feels like having additional constraints on your possible game plan.\n\nIf you feel confident after playing a few games, beware. You may pick up a new faction and do that first round mistake again.",
    "timestamp": 1761865200
  },
  {
    "username": "Kater_Inna",
    "rating": 9.0,
    "comment": "4",
    "timestamp": 1761778800
  },
  {
    "username": "ccmonter",
    "rating": 9.0,
    "comment": "A great re-implementation of a great game.\n\nINCLUDED:\nGaia Project: Drawstring Bags",
    "timestamp": 1761692400
  },
  {
    "username": "Crumputer",
    "rating": 8.5,
    "comment": "Great game. Very clearly explained rules, good iconography. Rules don't get in the way. So many options for victory points in the game and the factions are all so different.\n\nOnly played solo. It's an excellent game, but at the end of the day, I learned that BYOS is just not exciting to me.",
    "timestamp": 1761519600
  },
  {
    "username": "JHristomilo",
    "rating": 8.8,
    "comment": "Pedazo de juego, y eso que las dos primeras partidas, el automa me ha destrozado malamente. Parece simple, pero es tremendamente complejo de dominar.\n\nAhora empiezo a ver cómo ir avanzando, aunque me temo que eso solo es una sensación y que depende enormemente de la facción elegida.\n\nLa asimetría de las facciones es tan grande que cada una exige cosas distintas. Dominar una no es dominar el juego. De momento he jugado con los Terranos, los Ícaros y los Emasesianos. Solo estos últimos me han parecido fáciles de llevar. Con los otros, aún no sé qué hice mal.\n\nActualización: cuanto más domino el juego, más grande me parece. Los Akbots me parecen una facción muy poderosa. Es cierto que abuso de AP, pero, como juego en solitario, no tengo mayor problema.\n\nEl automa está muy logrado, siendo más o menos fácil de llevar y simulando bastante bien las sensaciones de otro jugador.",
    "timestamp": 1761343200
  },
  {
    "username": "Magumarus",
    "rating": 9.0,
    "comment": "+The lost fleet",
    "timestamp": 1760824800
  },
  {
    "username": "Thalassios",
    "rating": 10.0,
    "comment": "My favorite game of all time.\n\n+ lost fleet",
    "timestamp": 1762210800
  },
  {
    "username": "richy81",
    "rating": 10.0,
    "comment": "Einstiegshürde: sehr hoch (5)\nSpielerische Tiefe: sehr hoch (5)\nGlücksfaktor: nicht vorhanden (0)\nLangzeitmotivation: sehr hoch (5)\nMaterialqualität: gut (4)\n2 Spieler Eignung: sehr gut (5)\nDauer 3-Spieler-Partie: 120 Minuten\n\nKonsequente Weiterentwicklung von Terra Mystica, vor allem dank der Tech-Leisten. Große Variabilität und durch den modularen Spielplan skaliert es besser je nach Spielerzahl. Auch zu zweit und solo sehr, sehr gut.",
    "timestamp": 1761865200
  },
  {
    "username": "GoldenOlaf",
    "rating": 10.0,
    "comment": "App",
    "timestamp": 1761865200
  },
  {
    "username": "apax",
    "rating": 10.0,
    "comment": "H",
    "timestamp": 1761519600
  },
  {
    "username": "Hooloovoo42",
    "rating": 10.0,
    "comment": "ST20 2025 #05\nST20 2024 #05\nST20 2023 #07\nST20 2022 #02\nST20 2021 #03\nST20 2020 #02",
    "timestamp": 1761256800
  },
  {
    "username": "BoBmArleY181818",
    "rating": 10.0,
    "comment": "I honestly can’t believe that Gaia Project isn’t currently ranked number one in strategy and overall worldwide — it’s impossible!\nWhat more could we possibly expect from a board game?\nA fully strategic experience, with diverse factions, excellent end-game objectives, logical city-building, and a deep focus on developing economy and science.\nThis game is pure joy, and I don’t think any other board game deserves to be ranked first besides Gaia Project.\nIt’s an absolute masterpiece — I’ve played at least 300 games, and even now, I’m still learning new things and enjoying its incredible replayability.",
    "timestamp": 1760997600
  },
  {
    "username": "bdavid0127",
    "rating": 10.0,
    "comment": "H",
    "timestamp": 1760738400
  },
  {
    "username": "Lovinitnz",
    "rating": 10.0,
    "comment": "A complex play through the first time- worth the deep dive into such a fantastic game- lovin' the strategy and peaceful game play. Super helpful player aids.",
    "timestamp": 1760738400
  },
  {
    "username": "Auroric",
    "rating": 9.5,
    "comment": "I love the Terra Mystica system, and Gaia project uses it in some new and interesting ways. It's a more variable, freeform, looser version of TM, with a few extra tidbits sprinkled in. Games feel more sandboxy - instead of looking at a setup and thinking \"this is a mermaids game\", each faction has more opportunity to do well. This can be a pro or a con depending on what you prefer, and this is still a crunchy challenge. The things you want will be taken, and you must pay attention to your opponents - a trait that for me, elevates this series above other modern euros.\n\nI personally prefer TM however. The art and theme don't appeal to me quite as much, although the retro sci-fi is charming. By adding more board space and tacking on more mechanisms I find it loses some of the tight elegance of the original, and the factions aren't as memorable or thematic for me, making them much harder to learn. That said, it's a new sandbox to explore after hundreds of plays of TM, which is fresh and exciting.\n\nIf Terra Mystica didn't exist this would be a 10/10 for me. It's a fantastic game, and many people prefer it to it's older brother, for valid reasons. It's slightly more accessible, but has the same never ending skill ceiling. The perfect game for a lean collection: it just gets better with every play.",
    "timestamp": 1760565600
  },
  {
    "username": "Neso91",
    "rating": 10.0,
    "comment": "221024 Love this game! It's not a 4X (no eXtermination at all), but rather an euro with a bit of exploration.",
    "timestamp": 1760479200
  },
  {
    "username": "neural_net",
    "rating": 10.0,
    "comment": "My brain is melting.\n125% Terra Mystica.\n\nUpdate: get the expansion too!\nStill the best heavy euro since it's release.",
    "timestamp": 1760479200
  },
  {
    "username": "nwmistborn",
    "rating": 10.0,
    "comment": "EXPANSION MUST",
    "timestamp": 1760306400
  }
]