[
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "My suspicion is that people love this just because there's an income tracker and WHEE they get stuff automatically. Even though the income is usually a trap. I kinda get why the random demand tokens are in as a mechanic, but the theme is completely backwards with people flipping them first. And the ships just do nothing?\n\nThe rules are kind of a mess, and the game mostly rewards railroad-building in era 2 anyway. It's more of a quick train game first, with a long goods-selling phase that isn't nearly as profitable.",
    "timestamp": 1721685600
  },
  {
    "username": "soy1bonus",
    "rating": 1.0,
    "comment": "Don't like it",
    "timestamp": 1680732000
  },
  {
    "username": "General Amadeus",
    "rating": 1.0,
    "comment": "Herman",
    "timestamp": 1625954400
  },
  {
    "username": "mdean",
    "rating": 1.0,
    "comment": "I had fun with my play but didn't really see the magic, don't know if I had enough fun to put in the reps to get it though.",
    "timestamp": 1589234400
  },
  {
    "username": "chrboesen",
    "rating": 1.0,
    "comment": "Multi-player solitaire. Played 1 time.",
    "timestamp": 1583276400
  },
  {
    "username": "airjudden",
    "rating": 1.1,
    "comment": "I played this once, and I won it, so don't call me a sore loser when I say this sucks.\n\nThis is what you need to know: there is only enough wood in the world to build one ship and if I build it this turn, you cannot.\n\nI will never understand Eur-ah-gah-mers.\n\nThis game lacks theme. It's so un-fun that it's a black hole sucking the joy out of everything around it. If you are the next table over from a group playing Brass, your game isn't going to be as fun. Just pick up your game and move.\n\nBut you know what would make this game fun? Dinosaurs. If they were carrying laser guns and flying space ships, this game would be awesome. I could overlook this games many flaws. But you see, dinosaurs do those kind of things. Unfortunately, this game has no dinosaurs. Maybe an expansion will take care of that deficiency.\n\nOne can only hope.",
    "timestamp": 1552863600
  },
  {
    "username": "Biscotti",
    "rating": 1.0,
    "comment": "Nothing wrong with game. I'm sure its a splendid affair. However after watching run through and or reading reviews, absolutely no desire to play.",
    "timestamp": 1481238000
  },
  {
    "username": "misterw",
    "rating": 1.0,
    "comment": "Really stuffy and boring game. Just takes hours to play. FRules have some flaws. Much exceptions in the rules.",
    "timestamp": 1255730400
  },
  {
    "username": "BoardGamingCouple",
    "rating": 2.0,
    "comment": "2/5\n\nboring dull game with a yucky theme. ticket to ride, concordia, and power grid are all similar gameplay wise, but much quicker & better.",
    "timestamp": 1735254000
  },
  {
    "username": "asfhgwt",
    "rating": 2.0,
    "comment": "Too hard, no fun. For me, at least.",
    "timestamp": 1696370400
  },
  {
    "username": "elgin_j",
    "rating": 2.0,
    "comment": "Uninspiring theme, dire artwork, little interaction, boring gameplay, probably being played by the most boring bastards in the room - no thanks.",
    "timestamp": 1656712800
  },
  {
    "username": "sgosaric",
    "rating": 2.0,
    "comment": "After 1 play: I liked it less than I thought I will.\n\n- No, the historic quirks and fiddly rules are fine, no issue with these.\n- No, the card play is fine, no issue with \"randomness\"\n- No, the supposed \"unforgiveness\" of Lancashire (vs Birmingham) was actually welcome. I like games that don't overburden me with similar options, I can tell quite quickly which one's the best one. From what I read about Birmingham I think I would enjoy Lancashire better. [Edit: tried Birmigham and, yup, I like Lancashire better.]\n- No, I noticed nothing \"counterinuitive\". I felt the logic of the game is, well, logical. Coal and iron get used by others connected to network and so on.\n-\nBTW - The visuals of new version are horendous, would want the original ones, but not the issue I had with the gameplay (though having multifocal inocular lenses I couldn't see crap till somebody turned lights in the cafe up. Contrast is good for graphic design, you Roxley incompetents. Being able to distinguish important stuff from the background enables the gameplay to exist.)\n\nThe issue: it's just too procedural and euro-ey with too little psychology. The whole amount of stuff to be build and the levels and the development... Why? Just streamline and throw half of the stuff away. Oh, you mean I'm supposed to game the system and find \"different routes to victory\" each game? I thought so, This is just dumb ... I mean, it's what all euros do nowadays. I thought this game will be more \"old school\". Basically I expected to like this better than Power Grid and ... no. PG has auctions, grpupthink, more direct tug of war between players.\n\nI'm not impressed by interaction in this game. What interaction? I mean, there's blocking of locations, but this is interferance, not interaction. Taking somebody else's coal or iron, meh. It wasn't mine. Or his. Or hers. It belonged to the network and somebody took it and owner got cash. I see some people are impressed how we're all building this big interlocking engine and think this is interaction. Not impressed.\n\nThe game isn't current type of popular engine building euro, though there are individual development paths. So, it's a dull type of euro, done in bit old timey way. Plays very similar to current euros, but is different in style (being an older design). Which is probably why gamers think the game is cool, now that it had been adorned with murky chiaroscuro which has a case of horror vacuii to boot, plus the extra poker chips und stuff. Yay!\n\nAnyhow, I'd be willing to play this again. The person who taught me really helped ease the learning curve with all the details explained and a nice relaxed session. I just thought I'd be more crazy about this game.",
    "timestamp": 1597615200
  },
  {
    "username": "shizzane",
    "rating": 2.0,
    "comment": "Uh uh. Nope. Never. So bland. So booooooring. And long!",
    "timestamp": 1563228000
  },
  {
    "username": "tlarraya",
    "rating": 2.0,
    "comment": "Brass Lancashire is a truly gorgeous game and those clay chips are the bomb! (I'm looking forward to using them in other games) but the gameplay isn't my cup of tea. Too complicated for me I'm afraid.",
    "timestamp": 1544310000
  },
  {
    "username": "roadkill1977",
    "rating": 2.0,
    "comment": "Played game 3 times...didnt like anything about it.",
    "timestamp": 1486681200
  },
  {
    "username": "djberg96",
    "rating": 2.0,
    "comment": "After a couple plays, not impressed. I'm not really sure how much variation there's going to be. It sure seems like building in the center, both in terms of buildings and canals/rails is the way to go, and that building ships should only be done when you're out of options. This is the strategy I used in my second (and hopefully last) game and won handily.\n\nFrankly, this is the worst kind of euro. This game epitomizes the \"spreadsheet as a game\" criticism that so many euros have come under. It's a bean counting exercise with no interaction between the players. At least in most euros you can use denial as a tactic or form long term strategies. That doesn't even exist here. To add insult to injury the theme is thinly pasted on, and there's unnecessary chrome for one of the locations.",
    "timestamp": 1350856800
  },
  {
    "username": "stephenfalconer1",
    "rating": 3.0,
    "comment": "key scoring should not have a strong random element",
    "timestamp": 1757368800
  },
  {
    "username": "Laurentiu",
    "rating": 3.0,
    "comment": "I just don't have the stomach for games with this type of complexity. There are too many elements that operate in non intuitive ways. If I want an economic game, I'll pick others (Age of Steam, Powergrid, Puerto Rico).",
    "timestamp": 1699052400
  },
  {
    "username": "jcarvin",
    "rating": 3.0,
    "comment": "I've only played almost a dozen times now. While the rules are not that difficult to figure out, getting everything to work together and leaving yourself some elbow room to do it can be tough. Once you've played the game a few times you can better work out a plan when you play.\n\nI went back and forth on Kickstarting the new version and ultimately decided against it. Why? Because I'm completely happy with this version and it rarely gets to the table as it is.",
    "timestamp": 1691013600
  },
  {
    "username": "Entropology",
    "rating": 3.0,
    "comment": "Meh, not the sort of game I enjoy. Also I think there needs to be a REALLY good reason not to have money count as the win condition in any market economic game. The extra track of VP just adds complexity for the sake of complexity in my mind.",
    "timestamp": 1682632800
  },
  {
    "username": "germanggek",
    "rating": 3.0,
    "comment": "Pure Arbeit; komplexe, nicht-intuitive Regeln. Trocken. Sehr trocken.",
    "timestamp": 1515884400
  },
  {
    "username": "saabee",
    "rating": 3.0,
    "comment": "Első nekirugaszkodásra lepattantunk a játékról \nBorzalmasan érthetetlen volt a szabálykönyv...azóta sikerült szerezni egy jobb, magyarázatokat is tartalmazó variációt, viszont egyelőre a játék még várja az újra próbálást.\n---\nMásodjára (=első teljes játék) már tisztult a kép. A szabálykönyv minősíthetetlen továbbra is (thaur munkája nélkülözhetetlen!). Rengeteg apró kivétel, finomság, stb. Az érzésem az, hogy két-három parti után fog igazán letisztulni. Egyébként a játékmenet egyáltalán nem bonyolult. Viszont meglepett, hogy a dicsért gazdasági játék (meg, hogy átjön a tematikája) mivolta egyáltalán nem érvényesült. Számomra eddig csalódás. Igaz, hogy full gémer a játék, de szerintem túlságosan agyonbonyolított (akkora a cselekedetek közötti választási lehetőség, hogy teljesen átláthatatlan emiatt). Jobban szeretem a sallangmentesebb játékokat. Azért még kell vele párat játszani, hogy hitelesebben ítélhessem meg.\n---\nTovábbra sem hozta azt, amit én vártam tőle. A játékszabály borzadalmas, ill. az apró kivételek miatt nem elegáns, nem könnyed a játékmenet.\n---\nErőltettem-erőltettem, de ez a játék nem jó. Csak a helyet foglalta, ezért túladtam rajta.",
    "timestamp": 1513638000
  },
  {
    "username": "lacreighton",
    "rating": 3.0,
    "comment": "This is a luck of the cards game that is so well-dressed up as an economic simulator that it will take you several plays to notice that this a a luck of the cards game. I have the German version, Kohle, but that ought not to matter. Making player mats for it was fun ....",
    "timestamp": 1501884000
  },
  {
    "username": "catjuggler",
    "rating": 3.0,
    "comment": "The only game I know of with a perfect review in the last 3 letters of its title.",
    "timestamp": 1488236400
  },
  {
    "username": "Thatsnotme",
    "rating": 4.3,
    "comment": "14",
    "timestamp": 1755554400
  },
  {
    "username": "Stingrayy",
    "rating": 4.0,
    "comment": "For some reason considered to be a good game with economic theme, but it just does not make sense in soooo many places: transport routes vanish, resources others produce can be for free, loans don't hurt. I like to work the mechanics when sitting on the table, often because I can profit from bad play by others, but that does not make for a good game. Or, to put it another way, Feld could make a Roman or Saxon game out of the mechanics.",
    "timestamp": 1732575600
  },
  {
    "username": "Faolain",
    "rating": 4.0,
    "comment": "I played the app several times if you are wondering how I am rating a game with no plays. Hansa Teutonica is everything Brass wishes it could be.",
    "timestamp": 1676847600
  },
  {
    "username": "RyTracer",
    "rating": 4.0,
    "comment": "Overbuilding rule is terrible.",
    "timestamp": 1636585200
  },
  {
    "username": "ryansmum2008",
    "rating": 4.0,
    "comment": "Not for me",
    "timestamp": 1618351200
  },
  {
    "username": "BurnBabyBurn",
    "rating": 4.0,
    "comment": "Played the game for 5 turns and hated it, sold it the next day. I think its to long and dry.",
    "timestamp": 1612220400
  },
  {
    "username": "Jdcnl",
    "rating": 4.0,
    "comment": "I played the ugly original version a couple of years ago. We played this game twice. The first time we had to stop halfway because we ran out of time.\n\nThe people I played with were experienced 18xx players. So they have a soft spot for building routes and trains. All I remember of this game is how bored I was when playing it. I didn't like the semi restart for the second part of the game. But I guess that was just a personal thing since the others really enjoyed it. I guess I just have to take one for the team when I play this.",
    "timestamp": 1590184800
  },
  {
    "username": "Thies",
    "rating": 4.0,
    "comment": "Good but not great. As much a logistics exercise as an economic game, but I like both aspects. The limitations of the cards are a bit annoying for a game of this type. While I enjoyed it, I wasn't captivated. Maybe more plays will change this impression.",
    "timestamp": 1582153200
  },
  {
    "username": "whitecatplays",
    "rating": 5.0,
    "comment": "Sooty, bleak. It might be your thing.",
    "timestamp": 1760738400
  },
  {
    "username": "rws2029",
    "rating": 5.0,
    "comment": "• The art in the Roxley version is excellent but the color palette is far too dark, making the board and cards difficult to read if the room is not brightly lit.\n• The game can induce Analysis Paralysis if you're not on guard for it.\n• One mistake early on and you’re doomed. Players are often straitjacketed in their choice of options, which can greatly diminish one’s enjoyment of the game.",
    "timestamp": 1759096800
  },
  {
    "username": "Glanzmuecke",
    "rating": 5.0,
    "comment": "Why play Brass, when you have so nice interactive titles by Martin Wallace? Gavan Brown just produced a \"brand\", a \"board game commodity\".",
    "timestamp": 1756332000
  },
  {
    "username": "invervegas",
    "rating": 5.0,
    "comment": "Complexity √",
    "timestamp": 1755468000
  },
  {
    "username": "lexen",
    "rating": 5.0,
    "comment": "",
    "timestamp": 1749506400
  },
  {
    "username": "Forgeforgeforge",
    "rating": 5.0,
    "comment": "Tried this only years after playing birmingham 40 times.\nit's weird to me people stan OG brass over birmingham when it's significantly more card dependent and random.",
    "timestamp": 1745791200
  },
  {
    "username": "dancing rob",
    "rating": 5.0,
    "comment": "Original comment from 2008\n\nI didn't like this one at all on the first play, but subsequently discovered we had a rule incorrect.\n\nit's much better with the correct rules, and after 3 plays I feel I'm finally getting to grips with the strategies.\n\nThere are still a couple of small fiddly bits that prevent this getting a higher ratings, noticably the turn order mechanism\n\n2023 update\n\nIf ever you wanted an indication of how games have changed in the last 15 years this is it. What at the time seemed fiddly with a few ‘rules for the sake of having rules’ elements now looks like a pretty streamlined game with a couple of thematic rough edges.\n\n2025 update\n\nActually, it's still much fiddlier than I like - too many little elements that just work very slightly differently from each other. One where I can see why it's highly rated, just not for me.",
    "timestamp": 1745359200
  },
  {
    "username": "SkyGlad",
    "rating": 5.0,
    "comment": "Not the best at two. In particular, the trading mechanism feels way out of place. Would give it a go at 3 or 4 to see if it feels better. Seems to have a good set of mechanisms, just perhaps not at 2.",
    "timestamp": 1739746800
  },
  {
    "username": "U is for Unicron",
    "rating": 5.0,
    "comment": "The preferred version of Brass by your smug friend that enjoys crushing inexperienced players.",
    "timestamp": 1738623600
  },
  {
    "username": "Delphinium",
    "rating": 5.0,
    "comment": "We are fans of Age of Industry and BB but this is probably too cut throat for our tastes - the terrible shortage of Iron means that there is goingto some overbuilding of opponents Iron Works and it can be quite punishing if you are caught in that.",
    "timestamp": 1729461600
  },
  {
    "username": "ultimoratio",
    "rating": 5.0,
    "comment": "Downgrading to 4 stars. In comparison to other games that utilises shared incentives, this is one of the fiddliest and the weakest. In fact, it puts more emphasis on efficiency than on shared incentives. Indeed, when comparing this to Imperial or Chicago Express or The Great Zimbabwe (and so on and so on), it's looking pale in comparison.\n\nNeed more plays to see if I want to keep it or not.\n\n=======================\n\n\n\nThis is the better version of Brass. Birmingham has some issues I cannot ignore.\n\nLancashire is cleaner and streamlined. The port mechanic is way better than the highly annoying brewery. Beer also promotes solitaire play, which I found bizarre on a game like Brass.\n\nThere is only one industry - cotton, but that means you can easily mold your tactics based on the random cards, unlike Birmingham's 3 types of industries. The 3 types of industries gives the idea of various strategic paths, but in practice, it really restricts creative plays by nudging you heavily on some areas on the board.\n\nThe loan in Lancashire is more flexible and also satisfying. Learning the need on how much money you need to loan is crucial, and can lead to good plays.\n\nThe double build action is also just better than Birmingham's fiddly wild cards.\n\nI will still play Birmingham, but Lancashire is just way better. It will be a permanent part of my collection, and I would rather play Lancashire every time.\n\nLess is more.",
    "timestamp": 1728856800
  },
  {
    "username": "iplaybgnaked",
    "rating": 5.0,
    "comment": "Excellent economic euro with a wealth of depth and strategy to it. The card play keeps it fresh on repeated play while not being random enough to prevent consistent strategies. Overall a much better game than Birmingham at exactly 4 players but unfortunately doesn't scale as well with lower player counts.",
    "timestamp": 1722636000
  },
  {
    "username": "sbsimp1",
    "rating": 5.0,
    "comment": "DTE 2024",
    "timestamp": 1720303200
  },
  {
    "username": "swigo",
    "rating": 5.0,
    "comment": "i'm not saying this game isn't a work of staggering genius, but i am saying it's pretty miserable\n\n4 more plays follow-up; it's still got miserable parts, but it's got neat parts too. maybe in another four plays i'll bump it up another 2 points who knows",
    "timestamp": 1703977200
  },
  {
    "username": "Citery",
    "rating": 5.0,
    "comment": "A tight and unforgiving euro/economic hybrid with decent interdependency and entanglement between players. I should love this, but after a dozen plays, I still don't\n\nI'm still unconvinced that the cards are a boon to the system. I appreciate that they provide variety and require some look ahead to manage well (and that the game simply wouldn't function without them in its current state), but many times in Brass there are fairly obvious tactical opportunities that open up on the board (overbuilds, high demand for a resource, newly opened connectedness to a building site), and no amount of hand management can save you from just not having the right cards in hand to take advantage of it. Being able to dump two cards as a wild also doesn't feel like enough of a solution to this problem, as the opportunity cost / tempo loss is often too much to justify. It feels like my hand of cards in Brass is primarily a device for telling me what I can't do on my turn, rather than what I can. This can go from frustrating to straight up ugly with Brass's meaner bits: I've seen the almighty cards dictate that someone behind in points is going to have their ironworks overbuilt (a devastating and sometimes unavoidable maneuver) instead of someone in the lead, and it sucks.\n\nMy real, deep-seated issue with Brass though is in the links. In the canal era, building links isn't a great move, but it's often necessary to access new building locations and make the most of your limited hand. They do provide a modest point payout, but canals are primarily a spatial networking tool, and striking a balance between link and industry actions is a compelling dilemma. But in the rail era, this delicate balance is completely upended, and links just become an unimaginative means of converting cash into VPs. Compared to the texture and nuance of the industry tiles, which usually require multiple turns and sometimes multiple players to set up, build, and flip for a payoff, building rail links is a unilateral, single-action payout that requires the bare minimum of planning for a frankly insane money/point return in most cases. Building two at a time in the rail era also means that the board fills up with them too quickly for spatial network considerations to mean much; you just go for the best spots while you can, and quickly! The ruinous possibility of being left behind in racing for these link points can also cause games to devolve into a boring late-game cycle of loaning and railing for many players. I genuinely believe rail links could be worth half their current value in points or the double build action could be removed entirely and the game would be far better for it.\n\nI want to be absolutely clear: my issue with links is not that they are imbalanced, it's that they are imbalanced for how boring they are. I have a soft baseline belief that the number of points provided by an action in a game should be proportional to the complexity or difficulty of performing that action, and Brass's links (in both the original and Birmingham) disregard that intuition entirely and pull focus away from its most interesting mechanics.",
    "timestamp": 1700953200
  },
  {
    "username": "miguelfranciscof",
    "rating": 5.0,
    "comment": "Frustrating first experience but it was my first \"medium heavy weight\" game. Might try it a second time and reevaluate.",
    "timestamp": 1694988000
  },
  {
    "username": "BeansForTrade",
    "rating": 6.0,
    "comment": "It's a classic for good reason, and I'd prefer to play this over most modern euros. In terms of economics and shared incentives, it doesn't stand up to The Great Zimbabwe or Container, and for an economic euro with spatial elements I'd take Age of Steam. I imagine this shines with experienced players well-versed in strategy, but I want to invest the time elsewhere.\n\n+ Shared incentives and plenty of interaction.\n+ Multiple viable strategies that players will pursue based on the moves of others at the table.\n+ Unique two-act structure that changes up the game halfway and keeps it fresh.\n\n- Lots of fiddly rules and edge cases.\n- Turns are long and can induce a lot of AP. The changing turn order can result in lengthy waits between turns.\n- More efficiency puzzle than shared incentives.\n- Distant market mechanic feels out of place.\n- \"Economic\" game that is really just a euro with money. VP seems to be much more important than growing income due to the loan mechanics.\n- Not very thematic in feel, and the theme isn't doing much for me anyways.\n- Setup is a horrendous chore.\n\n4p >> 2p",
    "timestamp": 1762383600
  },
  {
    "username": "quietcorn",
    "rating": 6.0,
    "comment": "This is an interesting economic game, where players build factories and ship goods. The game has elements of a logistics game, but the more crucial element is budgeting and timing. In essence, you get a hand of cards. On your turn you get 2 actions, with each action requiring you to play or discard a card. You can build in a city that matches the card you have, or build with a special card in a city you have a link to from your previous things. Most of the buildings get populated with cubes. The cubes get spent when you or other players take actions, and when the building is empty, it flips and generates points and income. Halfway through the game, all the connections wipe, and players have another chance to build connections. It really does a fantastic job of capitalizing on other player's work, but still advancing your own cause.",
    "timestamp": 1762297200
  },
  {
    "username": "dlestarge",
    "rating": 6.0,
    "comment": "How many flavors of vanilla are we gonna end up with?",
    "timestamp": 1760047200
  },
  {
    "username": "DaneTheBeast",
    "rating": 6.0,
    "comment": "Played (TTS)",
    "timestamp": 1759701600
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 6.0,
    "comment": "In the past I rated Brass more highly. I can still enjoy a match now and then. But I am not sure there is much left to explore here, for me.",
    "timestamp": 1758924000
  },
  {
    "username": "jubilant_decimeter",
    "rating": 6.0,
    "comment": "Same problem as Brass Birmingham where there's slightly too many boxes to check and motions to go through before you can do an action.\n\nI can get the same capitalist experience playing sidereal confluence, except it's a lot more streamlined and dynamic",
    "timestamp": 1757541600
  },
  {
    "username": "dodo84210",
    "rating": 6.0,
    "comment": "Déception, je ne trouve pas ce jeu très riche en possibilités",
    "timestamp": 1757196000
  },
  {
    "username": "kvarclovag",
    "rating": 6.0,
    "comment": "Mobil appal játszottam az eredeti Brasst. Szép és okos játék. Az új kiadások kevésbé tetszenek.",
    "timestamp": 1755381600
  },
  {
    "username": "Samuel Vriezen",
    "rating": 6.0,
    "comment": "After Birmingham (which I do like well enough) this is a so much clearer, tighter game.",
    "timestamp": 1747864800
  },
  {
    "username": "Clems80",
    "rating": 6.0,
    "comment": "slight issues fixed with Birmingham?",
    "timestamp": 1744322400
  },
  {
    "username": "esayitch",
    "rating": 6.0,
    "comment": "1) Compete during the dawn of steam to become the most prestigious.\n2) A very thematic, complex economic simulation. Players take turns playing cards to carry out one of 5 actions. They take 2 such actions every round. Actions include developing industries in various cities, connecting cities via rails and canals, doing RnD to unlock more advanced industries, shipping cotton, and finally taking loans. There is a high degree of interaction as most of the action is on the shared board.\n3) I loved: A lot of interesting ideas, multiple routes to victory, great player interaction, wonderful bits and components, a feeling of discovery every time I play, great satisfaction from flipping industry tiles, not as punishing as I was led to believe reading reviews about it, every game is different due to card draw, great in every way.\n4) Could be improved: Can some fat be trimmed here? I am not sure. I think if anything was changed in it, it would stop being the great game it is. Still, it takes long to learn and understand, and the first few plays will be difficult, so it is unlikely to see repeated plays with players who don't see the potential after 1 or 2 plays.\n5) A great game. Most of my plays have been on the app, and I've only played it once in person so far. The tedium in setting it up and teaching to players makes it hard to get to the table.",
    "timestamp": 1743458400
  },
  {
    "username": "alkorith",
    "rating": 6.0,
    "comment": "Good game, I just don't like how long it goes for me. My analysis paralysis is not helping that much either.",
    "timestamp": 1741561200
  },
  {
    "username": "dopebones",
    "rating": 6.0,
    "comment": "A fun tactical economic game but runs a bit long for what it is, and the randomness of the cards can constrain your options which is fine but sometimes frustrating, overall I like it better than any Euro and it lends itself to repeated play.\n\nAfter four plays here are some observations: a) take out loans, especially in the late game before Rothschild comes out and in the last turn of the canal era b) pay close attention to player order, c) do what no one else is currently doing (developing is important for this), d) be the first to ship in each era using the foreign market first (2 shipments is guaranteed, a 3rd is probable) and e) overbuild your opponents every chance you get.\n\nSo far the only strategy I have seen, as opposed to an opportunistic approach is loan/develop/cotton (with the occasional shipyard perhaps) which is a long-game strategy that is slow to start but powerful in the end game.\n\nI much prefer the original and simplistic Warfrog/Treefrog graphical design over the fancy dark board.",
    "timestamp": 1739746800
  },
  {
    "username": "BoardGaymesJames",
    "rating": 5.6,
    "comment": "\"Mechanics: 8: Strong - Well-balanced and fun.\nApproachability: 4: Challenging - Manageable but requires effort to understand.\nReplayability: 5: Average - Some variety, but it starts to feel the same. (Multiple Campaigns)\nTheme & Art: 6: Solid - Feels like it all belongs.\nEnthusiasm: 5: Mild Interest - Occasionally willing to play if others want to.\"",
    "timestamp": 1736809200
  },
  {
    "username": "camidon",
    "rating": 6.0,
    "comment": "There's a lot going on here. I enjoy the theme, which quite surprised me--it is rather historically stuffy, yet it works. Too deep for my group or wife. Was never going to hit the table.\n\nTRADED",
    "timestamp": 1734908400
  },
  {
    "username": "aaj94",
    "rating": 6.0,
    "comment": "I should not be commenting on Brass after only one play. It's a travesty, unheard of, absurd! And yet. . .\n\nFor a game this long and complex to stick in my collection, it has to blow me away. It has to present a gaming experience so rich that I want to keep it even though it's inconvenient to get it played, and I always wish I could play it more. Pax Pamir: Second Edition is a great example. Lisboa hung on in my collection for years getting only a play a year until I finally parted with it. And these games need to really thrill me, like the way I felt when Hansy Toots and Iwari showed me how smooth-playing the OG Euros could be.\n\nBrass did none of this. I know Brass is a classic. But if I want to play a game with great shared incentives, I'd play Concordia, or Shinkansen: Zero-Kei, or even new friend Free Ride. The card play, such as it is, feels a little vestigial, but offers no tension that Concordia doesn't also offer. Heck, Concordia is a top ten game for me and it's criminal that I don't get it played more often.\n\nWhat's the point of seeking out a new experience with a game when it's not excellent? I have a half a dozen excellent games that I struggle to play enough. Brass was...fine. I'd rather play the others, though, and there's no harm in selling a game off because it wasn't for me.\n\nInterestingly, Birmingham was super satisfying, which makes me want to give Lancashire another try.",
    "timestamp": 1734562800
  },
  {
    "username": "Pastor_Mora",
    "rating": 7.0,
    "comment": "Simpler version. Less variety. Foreign markets I didn't like. Same unhelpful dark art. Better stick with Birmingham.",
    "timestamp": 1762558560
  },
  {
    "username": "Nuvium",
    "rating": 7.0,
    "comment": "A fairly complex game requiring a lot of planning.",
    "timestamp": 1762297200
  },
  {
    "username": "sksksksmsm",
    "rating": 7.0,
    "comment": "버밍엄을 하고 난 이후에 한거라 다소 심심하다고 느꼈다. 그럼에도 불구하고 잔룰없는 깔끔하고 무난하게 재밌는 유로게임이다라고 생각한다.",
    "timestamp": 1762297200
  },
  {
    "username": "ImZhe",
    "rating": 6.6,
    "comment": "Brass is pretty good overall, but it feels a bit artificially limiting to be forced to take actions around the cards you have in your hand, otherwise you have to give up action efficiency to get wilds. I preferred the action mechanism in nucleum",
    "timestamp": 1760911200
  },
  {
    "username": "mmychal",
    "rating": 7.0,
    "comment": "Excellent game exclipsed by the re-release",
    "timestamp": 1760652000
  },
  {
    "username": "shmonkey",
    "rating": 7.0,
    "comment": "Plays tighter than birmingham, but the tradeoff is that there are fewer strategies to explore. I got rid of this because I could never really see myself prefering this title over Birmingham, even though they play and feel similar. Its the same reason that I rate Terra Mystica favorably, but will never buy it (due to the existence of Gaia Project)",
    "timestamp": 1759874400
  },
  {
    "username": "WhiteHairedKon",
    "rating": 7.0,
    "comment": "July 2018",
    "timestamp": 1759096800
  },
  {
    "username": "kwhite1",
    "rating": 7.0,
    "comment": "P",
    "timestamp": 1757973600
  },
  {
    "username": "Jesenberg",
    "rating": 8.0,
    "comment": "C",
    "timestamp": 1762383600
  },
  {
    "username": "smurfodeth",
    "rating": 7.5,
    "comment": "I enjoy the many ways players can interact and compete with each other, with the agency to decide how cooperative they wish to be, as well as the tight economic space everything exists in. Turns are fast, as is the overall playtime for the depth of decisions, although it has many quirky rules and irritating exceptions. Also, the hand management isn’t particularly interesting in and of itself, as it’s mostly just a way to limit the available possibilities in building one’s network.",
    "timestamp": 1762297200
  },
  {
    "username": "Eugeniosaracino",
    "rating": 8.0,
    "comment": "Esp) Excelente juego! Partida muy dura en donde me quedaron muchas cosas por entender. Aun así me pareció una maravilla",
    "timestamp": 1761778800
  },
  {
    "username": "cinnzel",
    "rating": 8.0,
    "comment": "Tanto Birmingham como Lancashire son dos juegos perfectos para quienes disfrutan de los eurogames con mucha interacción entre los jugadores. Me resulta más satisfactoria, elegante y menos compleja la edición Lancashire, aunque menos complejo no implica partidas más cortas o sencillas.",
    "timestamp": 1761692400
  },
  {
    "username": "Misha99",
    "rating": 8.0,
    "comment": "Rating after 1 4 player game, also several solo games. Interesting - takes a while to grasp strategy, quite a bit going on. Happy to explore it further.\nEdit: After 3 games, this one goes up to a 9. Several paths to victory are evident. Good mixture of reacting to events and having an overall plan.",
    "timestamp": 1760997600
  },
  {
    "username": "Alex_P_",
    "rating": 8.0,
    "comment": "Among the best heavy economic games. The way this encourages positive player interaction is super well managed.",
    "timestamp": 1760911200
  },
  {
    "username": "kajabbar",
    "rating": 8.0,
    "comment": "- 35e +2 player board (OOP), both in core box.",
    "timestamp": 1760652000
  },
  {
    "username": "MoMahili",
    "rating": 8.0,
    "comment": "Keep",
    "timestamp": 1759874400
  },
  {
    "username": "dreamzz",
    "rating": 9.0,
    "comment": "First edition",
    "timestamp": 1762383600
  },
  {
    "username": "whimsicaltyrant",
    "rating": 9.0,
    "comment": "#2 - 2025",
    "timestamp": 1762383600
  },
  {
    "username": "Imsevimse",
    "rating": 9.0,
    "comment": "Such a beautiful game. Superbly tense, tactical card play and clever resource markets. A leaner Brass in terms of building options, with sharp tension and real urgency in the race for key connections and high-scoring shipyards. A fantastic economic design with excellent player interaction throughout.",
    "timestamp": 1762210800
  },
  {
    "username": "ditterio",
    "rating": 9.0,
    "comment": "Great game but I like Brass Birmingham a bit better.",
    "timestamp": 1761692400
  },
  {
    "username": "clam16",
    "rating": 8.5,
    "comment": "60–120 Min\nPlaying Time\nWeight: 3.86 / 5\n\n\nHand Management\nIncome\nLoans\nNetwork and Route Building\n\n\nHEAVY STRATEGIC GAME\n4 players - ideal\n2 players\n3 players\n\nAUS\n2020\n\nBring Canada",
    "timestamp": 1761343200
  },
  {
    "username": "Korrs",
    "rating": 9.0,
    "comment": "Somehow it is still as good as other Brass.",
    "timestamp": 1761256800
  },
  {
    "username": "Scifi66",
    "rating": 9.0,
    "comment": "Great for 2p/4p. Good at 3p.\n+++++++++++++++++++\nOne of the best Eurogames in the hobby, way better than Birmingham.\n+ Highly interactive\n+ Markets drive gameplay decisions\n+ Tighter design than Birm\n+ Love the 2p / 4p double sided board more games should do this!\n- Dark board art/enhances the theme but it is very dark!",
    "timestamp": 1761170400
  },
  {
    "username": "CatDadKil",
    "rating": 9.0,
    "comment": "Good game, only a single playthrough so far. Difficult to determine what the best strategy is after just one game.",
    "timestamp": 1760997600
  },
  {
    "username": "Fleax",
    "rating": 9.5,
    "comment": "kickstarter",
    "timestamp": 1762297200
  },
  {
    "username": "Spezza",
    "rating": 10.0,
    "comment": "My only regret about this game is that it’s taken me this long to get around to it!\n\nYes it has some fiddly stuff that might need explaining to new players as they crop up in the game, but played this with 3 new to it players and everyone is keen to explore it and Birmingham more, so winner in my book.",
    "timestamp": 1762038000
  },
  {
    "username": "apax",
    "rating": 10.0,
    "comment": "H",
    "timestamp": 1761519600
  },
  {
    "username": "VigoCarpatian",
    "rating": 10.0,
    "comment": "3,8",
    "timestamp": 1760824800
  },
  {
    "username": "chateauzou",
    "rating": 10.0,
    "comment": "Wow, this game makes me reconsider everything I know about how a good game should be.",
    "timestamp": 1760220000
  },
  {
    "username": "identisick",
    "rating": 10.0,
    "comment": "Wonderful. Perfect blend of depth and low rules overhead",
    "timestamp": 1759788000
  },
  {
    "username": "nickvdb22",
    "rating": 10.0,
    "comment": "Replace my current edition",
    "timestamp": 1759269600
  },
  {
    "username": "timkrysko",
    "rating": 9.8,
    "comment": "Deluxe Edition\n+ Iron Clays\n+ Sleeved Cards\n+ 4x Player Aids",
    "timestamp": 1759010400
  }
]