[
  {
    "username": "Floating World",
    "rating": 1.0,
    "comment": "New editions should not be ranked.",
    "timestamp": 1754172000
  },
  {
    "username": "lililililil",
    "rating": 1.0,
    "comment": "Automata",
    "timestamp": 1747432800
  },
  {
    "username": "Normal_st",
    "rating": 1.0,
    "comment": "One of the most boring map in board games history. Cards itself looks fine, thematic and all.\n\nGameplay is very crisis like, other players can screw your turn, not in a fun way, in general, this is the ANTI-fun game, in my opinion, played couple of times, all the times it was from \"meh\" to \"Screw this I'm wasting my time\".",
    "timestamp": 1721512800
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "A design that seems flashy and flexible on the surface, but turns out to be really creaky and stiff. Most games go nowhere because one player accumulates most of the coins, freezing up the other players, ironically making this more pro-banker than Pax Renaissance. You could fight a war, but it takes way more actions just to move around properly. Once in a while there's some crazy tabletalk and bizarre deals, but they're very rare. The vast majority of games (especially when someone's learning) it just hums a little and then stops in the middle of the road. And then everyone says it's a nice design but never wants to play again.\n\nI think what bothers me most is how every card is a mishmash of icons, covered by the excuse that players don't know what's happening in this part of history. Hrm, I can't say anyone walks out of the game understanding that better either. Everyone's an intelligence/economic shadowy mastermind who doesn't directly get involved, and it's kind of weird indirect storytelling. If you just wanted to play a war or economic game, there's games that get to both ends faster, but here there's not even much overlap in the middle where they meet either.\n\nEven with players who know the game very well, there's not much theme involved. Just bean-counting. Yay.",
    "timestamp": 1720648800
  },
  {
    "username": "Blue_ocean_",
    "rating": 1.0,
    "comment": "Amazing in theory. In practice too hard to teach and get the game on the table.\n\nEven 1 person giving up midgame will ruin the game for all.",
    "timestamp": 1704063600
  },
  {
    "username": "Svkirk",
    "rating": 1.0,
    "comment": "For me this is the worst game I ever played.",
    "timestamp": 1694901600
  },
  {
    "username": "Derek999950",
    "rating": 1.0,
    "comment": "What a load of wank!",
    "timestamp": 1683928800
  },
  {
    "username": "adesireg",
    "rating": 1.0,
    "comment": "2nd Edition of Garbage",
    "timestamp": 1670626800
  },
  {
    "username": "Nomorepiratedgame",
    "rating": 1.0,
    "comment": "Chinese version of the game is only $40, why KS cost $70? Also, for working with Yoka, a company known for its plagiarism of Bang!",
    "timestamp": 1585090800
  },
  {
    "username": "Catemd",
    "rating": 2.0,
    "comment": "One of the dullest games I’ve ever played. I won by a 4pt lead but I had absolutely no plan for what I was trying to do the whole game. If I managed to get a few decent cards then they were instantly assassinated by the other players, felt like all I was ever doing was buying the least bad card in the market. Boring. Forced a dominance check because I just wanted it to be over.",
    "timestamp": 1757541600
  },
  {
    "username": "Glanzmuecke",
    "rating": 2.0,
    "comment": "The game is good. I hate the pax system",
    "timestamp": 1756332000
  },
  {
    "username": "Valcurdra",
    "rating": 2.0,
    "comment": "After 1 play this seemed right up my alley, lots of cool abilities, interesting and unique mechanisms, cool components.\n\nBut after playing again, this is a classic illusion of agency game, it's largely just random nonsense.\n\nCards come out giving a draft of limited agency. You will want to do very specific things on your turns, but unfortunately on you turn, good options for you may be available or they may not. They may be cheaper or more expensive, but this is out of your control.\n\nPlayer interaction is way too high, you can defend yourself to some extent, but defence is way weaker than attack and getting attacked can be utterly crippling.\n\nAll this boils down to, is a pure kingmaker game, the person who gets attacked the least will just win, the person who cops the most will just lose. What's even more miserable is that often people will attack you just because they can, not because they really need or want to.",
    "timestamp": 1752184800
  },
  {
    "username": "bishopxmxy",
    "rating": 2.0,
    "comment": "79 2024 29",
    "timestamp": 1734303600
  },
  {
    "username": "NotThatSalem",
    "rating": 2.0,
    "comment": "I'm genuinely surprised by the love for this game. It is bone dry dull and unnecessarily confusing which goes to show that historians shouldn't make games. In the game I played, two of us were taught by a third person who declared he had won the game after 3 turns, which tells me the game is also fundamentally flawed. Nope, never again.",
    "timestamp": 1733353200
  },
  {
    "username": "pulla",
    "rating": 2.0,
    "comment": "Like the 1st edition, this is still complete ship.",
    "timestamp": 1731193200
  },
  {
    "username": "JukkaMikael",
    "rating": 2.0,
    "comment": "Have to move this from 3 to 2 because of the theme.",
    "timestamp": 1706569200
  },
  {
    "username": "Bumbusia",
    "rating": 1.5,
    "comment": "nigdy nie byłam fanką, dla mnie przereklamowana i nie podobała mi się.\ndodatkowe 0,5 za piękne komponenty",
    "timestamp": 1690063200
  },
  {
    "username": "brownsound",
    "rating": 2.0,
    "comment": "Przerost formy nad treścią. Zbyt wydumane zasady. Po kilku partiach opuściło kolekcję i nie ma szans na powrót.",
    "timestamp": 1690063200
  },
  {
    "username": "X4_Commander",
    "rating": 3.0,
    "comment": "Too simple to be good area control or wargame",
    "timestamp": 1756072800
  },
  {
    "username": "minitj",
    "rating": 3.0,
    "comment": "1 партия на четверых за 55 минут.\nК счастью, закончили досрочно за два раунда, тратить больше времени на это не имеет для меня смысла.\n\nНа старте мы выбрали разные фракции, я выбрал русских, т. к. посчитать было не сложно, что к моему ходу останется на рынке и какие из этих карт «лучшие», я получил достаточно мощные карты русской фракции на войну и начал выставлять фишки. Соответственно, уже после второго/третьего хода менять сторону = отказаться от мощных карт + потерять деньги и действия, которые на эти карты были потрачены (ну т. е. сесть играть позже всех, когда все уже прокачались) = 99% проиграть в партии. Зачем играть в игру, если не пытаться в ней победить? Что делать оставшиеся 1-2 часа после такого суперхода, который лично по моему мнению 100% означает проигрыш? Заниматься кингмейкингом и просто руинить игру кому-то из игроков, осознавая что мне уже тут ниче не светит? Думаю этими вопросами задается каждый и чтобы не становится свинтусом, который просто по приколу руинит игру остальным, все продолжают гнуть свою линию до конца, а там уже как на карты повезёт, соответственно поэтому и результат такой.\n\nЛично мне в такое играть не интересно, я сделал всё возможное для победы, но всё это не имеет никакого значения т.к другие игроки не захотели делать тупые ходы и делать меня победителем, могли дать мне победить и я бы может быть сказал, что игра норм, а так получайте честное не предвзятое мнение.?",
    "timestamp": 1750456800
  },
  {
    "username": "AuroLamda",
    "rating": 3.0,
    "comment": "Oh gosh, not my game for sure. No sense.",
    "timestamp": 1743717600
  },
  {
    "username": "Ginewra",
    "rating": 2.5,
    "comment": "bga",
    "timestamp": 1739574000
  },
  {
    "username": "adel9591",
    "rating": 3.0,
    "comment": "Opaque, boring, decisions feel mostly meaningless, as it's the collective decision making that influences the game. But individual actions mostly feel like they accomplish nothing. Having two games going on is meaningless, not sure if I just don't get it but I wouldn't be surprised if there's literally just nothing to get. It almost feels like there isn't even a game here.",
    "timestamp": 1739055600
  },
  {
    "username": "Thatsnotme",
    "rating": 3.5,
    "comment": "1 til 2 timer\n\nMetalmønter",
    "timestamp": 1737846000
  },
  {
    "username": "wallisdavida",
    "rating": 3.0,
    "comment": "Recently played a 4p game. Rules were easy enough to pick up, decent components and nice table presence. I did enjoy utilizing the spies vs straight map interaction. However we all found the game to be rather lackluster.\nNo Afghan cards were drawn so the game came down to 2v2 between Russia and British control. Overall the game was very uneventful with no satisfying turns. The game ended in a very anticlimactic fashion. Wont be bringing this to the table again",
    "timestamp": 1728252000
  },
  {
    "username": "purplecow55",
    "rating": 3.0,
    "comment": "A political game where players are moving between factions to gain points, manipulate faction forces, and sabotage other players. Winner is the player with 4 more points than the 2nd place player OR most points if all rounds are played.",
    "timestamp": 1717538400
  },
  {
    "username": "bramadan",
    "rating": 3.0,
    "comment": "To Sell",
    "timestamp": 1706050800
  },
  {
    "username": "Noobidish",
    "rating": 4.0,
    "comment": "its a train game, sadly there are no trains",
    "timestamp": 1762383600
  },
  {
    "username": "EchoesR",
    "rating": 4.0,
    "comment": "SHIT",
    "timestamp": 1760652000
  },
  {
    "username": "smurfodeth",
    "rating": 4.0,
    "comment": "Way too long of an affair for how often a player is left with little to no agency while swimming amongst a broad array of ever-changing, yet often irrelevant and/or unappealing options. Unlike Arcs, which has a limited scope from round to round that can be strategized around with clever play and use of the tools provided, here it just feels like I’m along for the ride on the market, with little to no control, and a complete inability to plan for anything. If something is accomplished on my turn, it’s completely unsatisfying, both because what happened feels so arbitrary as to make me feel *I* didn’t really do anything, and because something else arbitrary is about to completely erase it.",
    "timestamp": 1758319200
  },
  {
    "username": "jerkman",
    "rating": 4.4,
    "comment": "This might be brilliant game for those, who really wants to get into a fight over dominance, calculating the costs against either against own benefits or harm to opponents. I see the potential, but I'm simply not in the targeted group of confrontational game players, other than competitive games. This might be read as a clear warning as well as a hint to invest in other opinions of players within the target group.",
    "timestamp": 1755381600
  },
  {
    "username": "Qumpelblase",
    "rating": 4.0,
    "comment": "An dieser Stelle bin ich ganz einfach nicht fair. Cole Wehrle ist für mich ein Meister seines Faches- ich liebe Arcs und Root ist sogar eines meiner drei Lieblingsspiele. Er steht für mich sinnbildlich für Eleganz in Spielen. Deshalb bin ich mit großen Erwartungen an Pax Pamir gegangen. Das Regelwerk ist vergleichweise kurz gehalten, aber hat bei mir für so viel Konfusion gesorgt, dass mir das Spiel keinen (und damit meine ich wiklich keinen!) Spaß gemacht hat. Andauernd gab es Restriktionen, Strafen und mir haben sich die genauen Zusammenhänge einfach bis zum Ende nicht erschlossen. Ja, das spricht eher gegen meinen Intellekt und weniger gegen das Spiel - aber ich wollte wirklich nur, dass es endet.",
    "timestamp": 1753135200
  },
  {
    "username": "kirillsulim",
    "rating": 4.0,
    "comment": "Too random to plan, to long to get fun of this random.",
    "timestamp": 1751493600
  },
  {
    "username": "Atagaka",
    "rating": 4.0,
    "comment": "Not a huge fan of this game, I don't really understand the love it gets. To me it's over-complicated, a bit dull plus the theme doesn't do it for me.",
    "timestamp": 1747951200
  },
  {
    "username": "halemasaki",
    "rating": 4.0,
    "comment": "A very interesting game I probably won’t play again.",
    "timestamp": 1747432800
  },
  {
    "username": "JohnMunsch",
    "rating": 4.0,
    "comment": "Felt like a constant game of tear down whomever is about to win. Turn after turn after turn. Seemed to me that it lacked the things that Root has to advance the game to a conclusion even though it can have that same situation sometimes.",
    "timestamp": 1745532000
  },
  {
    "username": "Dlearn",
    "rating": 5.0,
    "comment": "It's a good game with reasonable mechanics. It's just not for me. Too long. Too complicated. No comeback mechanism",
    "timestamp": 1761519600
  },
  {
    "username": "MattAndersson3",
    "rating": 4.5,
    "comment": "I had very great expectations for this game but I have to say I was quite disappointed after I finally played it. Even though graphics and components are really good and the thematic is appreciable, I found the game to be extremely repetitive and absurdly long. If I get the chance to play it again, I would think about it to see if my impressions are correct but I don’t think I’ll consider it for my collection.",
    "timestamp": 1760479200
  },
  {
    "username": "Avid_Equinox",
    "rating": 5.0,
    "comment": "Not sure if I'm missing something with this one. It feels like a very basic card driven game and quite random. It likely needs more commitment than I've given it to see it's value, but doesn't feel like a game I want to spend more time on.",
    "timestamp": 1759874400
  },
  {
    "username": "rayzor6",
    "rating": 5.0,
    "comment": "Not as mean as I thought, card play was enjoyable...very long",
    "timestamp": 1759528800
  },
  {
    "username": "Akado",
    "rating": 5.0,
    "comment": "An interesting game of positioning and semi-cooperative posturing, but it feels like it ultimately comes down to kingmaking by people who are not in a position to win. And while the game itself is fairly fun up to the final decision, I'm not sure it's fun enough to me to justify the playtime.",
    "timestamp": 1746223200
  },
  {
    "username": "silenceisgolder",
    "rating": 5.0,
    "comment": "Great design. Feels super tense and thematic in a way that reminds me of Twilight Struggle. It felt like every move was painful and even the most clever things were just enough to keep your head above water for a second or two. Maybe the one thing that separates it from Twilight Struggle (which I like) is that TS often gives you hope in the form of good cards or a good dice roll to mix in with the agony/despair, and sometimes you even get some good stuff on your opponents' turns. There's also the metagame of the fog of war cardplay that makes it feel more like a fun game. I'm not sure if there's anything in Pax Pamir that made me feel good or like I was having fun, which is still something that's pretty important to me when picking/playing a game.",
    "timestamp": 1743890400
  },
  {
    "username": "EconSean",
    "rating": 5.0,
    "comment": "I don't see how this game doesn't come down to pure and simple kingmaking. I don't mind games like root where kingmaking is a big part of the game if the other things that you do are fun and develop your own board state and have some kind of other skill expression, but I felt the mechanisms in this game did not justify the game experience and that it is going to boil down to kingmaking far too much of the time. Part of this is because of the family feud style scoring that doubles scores in the final round, making it more important than other rounds.\n\nI was glad that I played this game as it gave me some perspective into how both root and arcs came to be, which are both games that I appreciate and like a ton. I just think that I would rather play those games to get a better version of the experience that this game offered me.",
    "timestamp": 1743890400
  },
  {
    "username": "tbrofromspace",
    "rating": 5.0,
    "comment": "Review: https://www.meeplemountain.com/reviews/pax-pamir-2nd-edition...\n\nI have pivoted on my opinions about Werhle's designs, but I haven't formed a coherent idea yet. Regardless, I think the \"games are arguments\" thing is wrong.",
    "timestamp": 1743631200
  },
  {
    "username": "AhabXXX",
    "rating": 5.0,
    "comment": "Better choosing an other Pax: this is one of the worst!",
    "timestamp": 1743372000
  },
  {
    "username": "Mr More Dakka",
    "rating": 5.0,
    "comment": "Pros:\n\n- Has one of THE best board game bots I've ever experienced.\n\n- ^The bot is so good, that I recommend it as a must-include for when you only have 2 players, as the bot forces at least some intrigue with the coalition mechanics at lower player counts! The bot is seriously what makes low-player count Pax Pamir still work.\n\n- When all of the game's mechanics are firing on all cylinders, Pax Pamir is a very intriguing tableu builder/area control hybrid game.\n\n\nCons:\n\n- Has way too many easily forgotten fiddly rules that are meant to drastically change the game-state at a moment's notice.\n^^^^ This makes the game INSANELY hard to teach. Expect a lot of rules mistakes your first playthrough.\n\n- Excruciatingly difficult to teach- almost to the point of actually arguably not being worth it.\n\n- Feels rather tame at lower player counts (2-3) without the bot. If you're not playing with the bot, make sure you have 4 players at minimum.\n\n- Just because the bot is 'excellent' doesn't necessarily mean its challenging.",
    "timestamp": 1736809200
  },
  {
    "username": "bannanister",
    "rating": 5.0,
    "comment": "BGA",
    "timestamp": 1735426800
  },
  {
    "username": "makarren",
    "rating": 5.0,
    "comment": "A game in which I can't quite make sense of the actions that are carried out.",
    "timestamp": 1735254000
  },
  {
    "username": "LuisGomez",
    "rating": 5.0,
    "comment": "[Sleeved]\n\nI didn’t see the appeal of this game. Bought it partly because it's a Wherle game but the play feels very opaque.",
    "timestamp": 1732834800
  },
  {
    "username": "razorsharp11",
    "rating": 5.0,
    "comment": "elegant design but kinda boring",
    "timestamp": 1731711600
  },
  {
    "username": "identisick",
    "rating": 5.0,
    "comment": "*Rating based on 2p game",
    "timestamp": 1727820000
  },
  {
    "username": "Merlija",
    "rating": 5.0,
    "comment": "Wonderful production value and artwork!\n\nBut it went down in my rating pretty fast, due to its chaotic and very anticlimactic end, where someone just suddenly wins. And you can’t read all the card effects of your opponents (they are very small), which makes it annoying to play, if you like to „perfectly“ plan your moves, which is not even possible here, since the whole board situation changes each round.",
    "timestamp": 1725400800
  },
  {
    "username": "MissP1ggy",
    "rating": 5.0,
    "comment": "Intriguing game.",
    "timestamp": 1724191200
  },
  {
    "username": "dusteppe",
    "rating": 5.0,
    "comment": "This is not the Messiah many are claiming it to be...both Renaissance and Porfiriana are way better. However it is easier than the other 2, works at different player counts and lasts at bit more, making it a \"main dish\" game game.",
    "timestamp": 1721080800
  },
  {
    "username": "Silentz",
    "rating": 6.0,
    "comment": "Never got it to the table! Seems good but doesn't seem to inspire my friends.",
    "timestamp": 1761256800
  },
  {
    "username": "kilianbognar",
    "rating": 6.0,
    "comment": "I really love the Dutch auction system; it should be in far more games.\n\nCole Wehrle’s games, despite putting a heavy emphasis on theme and showing great care in the visual representation of them, can feel strangely unintuitive and even unthematic in certain places, despite his solutions are almost always mechanically very original. It's hard to describe, but somehow there’s one too many spins on the abstractions to easily make a thematic connection. I feel this even more in Pax Pamir than in his other games.\n\nOther than that, Pax Pamir is fine. It feels a bit too long and convoluted for what is largely a tactical tableau builder, and no one around me cares about the Great Game, so we won't play it. Probably there aren't that many people who care about it out there, so most people who will like this game will probably appreciate it for the clever mechanisms or the \"political\" veneer.",
    "timestamp": 1760306400
  },
  {
    "username": "Astrotron",
    "rating": 6.0,
    "comment": "This was alright to play. I'd play again, but I'm not necessarily rushing to do so. This was the first \"Pax\" game I played, and I did really like the market system, that was pretty cool. Overall this was a good game, it just didn't grab me for some reason.",
    "timestamp": 1759701600
  },
  {
    "username": "Beefy79",
    "rating": 6.0,
    "comment": "Played Mike's Copy",
    "timestamp": 1758146400
  },
  {
    "username": "LotrScaper",
    "rating": 6.0,
    "comment": "Great art and components complement a mind-bending tactical puzzle. The variety of cards make each game very different, but this is also a very frustrating experience in which players are actively breaking down or deactivating parts of your tableau. I don't have an issue with that in a quick game like Innovation, but in a game of this length, an opponent undoing several of your turns with only one of theirs is very disappointing. The King is Dead 2e does a very similar puzzle to this, in a much shorter time, without nearly the same amount of friction points. It also doesn't help that Pax Pamir's rules are very complex due to the interplay of systems, which makes revisiting the game infrequently a challenging endeavor.",
    "timestamp": 1757800800
  },
  {
    "username": "Killi",
    "rating": 6.0,
    "comment": "I do think Cole Wehrle is a genius, you can tell how much love he has put into this game and his other games, I just don't click with his designs.",
    "timestamp": 1756504800
  },
  {
    "username": "Jclancy15",
    "rating": 6.0,
    "comment": "I have only played at 3p so this may not apply at higher player counts. But I think the tableau-building is more important in this game than the map or player interactions? It's normally pretty easy to anticipate what the result of the round will be, so the most important part of the game is setting yourself up to be able to generate points with cheesy things like spitting out 3 spies. But it's still fun and there is something to be said for having an interesting theme and very pretty pieces.",
    "timestamp": 1756332000
  },
  {
    "username": "Ricosuarve",
    "rating": 6.0,
    "comment": "Includes wooden box insert",
    "timestamp": 1756245600
  },
  {
    "username": "Herakleitos",
    "rating": 6.0,
    "comment": "Still trying to figure out my thoughts about this. I've only played it once solo and once with 4 (or 5?) players. My one multiplayer session left me rather cold. It is clever, no doubt. But I was hoping for something a bit more punchy and political, I suppose. One thing that stuck out to me was how tame the card abilities were. I still want to give it at least one more go multiplayer before selling/trading it.\n\nSleeved + Metal Coins.",
    "timestamp": 1755900000
  },
  {
    "username": "krit1789",
    "rating": 6.2,
    "comment": "Tabkeay building, negotiation, and area control",
    "timestamp": 1747173600
  },
  {
    "username": "LloydGM",
    "rating": 6.0,
    "comment": "Have only played this on BGA, I think I need to play more in person to form a judgement.",
    "timestamp": 1747000800
  },
  {
    "username": "LordBobbio",
    "rating": 6.0,
    "comment": "A hell of a lot of push/pull/push/pull, some incoherence to what the tokens / provinces / cards represent, with the cardinal sin of tiny, tiny text on cards that is directly pertinent to what you need to do on your own turn, sitting on cards in someone's tableau across the table. With a redesign fixing those issues, my rating would go way up. But as is, there are other games I'd rather plan in this vein.",
    "timestamp": 1746482400
  },
  {
    "username": "machiavelli",
    "rating": 6.0,
    "comment": "I liked, but didn't love. I liked the faction building and card drafting. We had only three scoring rounds, so it was a really low scoring game.",
    "timestamp": 1744495200
  },
  {
    "username": "Technarius",
    "rating": 6.0,
    "comment": "Initial Impression after 3 Solo-Games:\n\nPros:\n+ Very interactive boardgame design\n+ Interesting and unique mechanics of influencing neutral factions and tableu building\n+ Game bot for the Solo game is good\n\nCons:\n- I don't like the artwork and the cloth gameboard\n- Too many fiddely, small rules, which are also similar to each other but on the other hand different enough to get you confused\n- This is a big one: VERY CONSTRAINED, NO STRATEGY POSSIBLE! Too little player agency due to action mechanic and high card draw randomness / card market order: You do actions through cards that have to be: available AND affordable OR through cards you already have in play (which, as just described, were acquired semi-randomly) OR through bonus actions through a trump suit, usually determined by other players. In short, you often choose the lesser of a couple of evils and you are unable to make your own plans. It's possible that cards you've planned to use are bought by others, or that not a single available card fits your plans and other cards are not affordable to buy or to play.\n- The game is way too chaotic for it's length\n- \"Killing / Capturing cards\" is a very frustrating kind of \"take that\" mechanic\n- During dominance check all the troops are wiped off the map so everyone has to start from the beginning. Of course it is important for preventing a runaway leader, but it doesn't feel satisfying for me.\n- The whole Gameplay tends to be a \"Tug of war\" with doing and undoing, i don't ussally like it. Beyond that the last Domination Check is doubled, so a lame tug of war game will be won by just dominating the last round? Really???\n- Diplomacy falls flat, because it is mostly about money\n- You constantly have to read all the card effects of your opponents written in small font, because this cards change too often so you can't just memoize them all.\n\n\nVerdict: The negative points described above say it all... not a game for me and my playing group.\nBetter Alternative: Imperial 2030",
    "timestamp": 1743372000
  },
  {
    "username": "dopebones",
    "rating": 6.0,
    "comment": "This is the most accessible game in the Pax series and the best production quality by far. The Pax engine is simply great, the character of each game is totally different and can change multiple times even in the same session. Loops commonly emerge that can cause the game state to be locked into a positive feedback cycle careening the game into a deterministic death spiral, which is fascinating and rewarding to engineer such effects if it can win you the game. The multi-dimensional nature of blocks on the map and spies on the courts and its indirect connectivity gives the game ample depth and many levers to pull to influence the nature of the struggle during gameplay and bend opponents to your will. Outside of the Pax system, how many other games feature such as sandbox-like fluid dynamism?\n\nUltimately it's a card game so there is luck of the draw involved, and like other Eklundian games, it is more tactical, or rather opportunistic, than strategic. Good play involves exploiting temporary relative imbalances or advantages, and if you are are not in such a position, steering the game into a new direction is a strong incentive. Sometimes it is possible to build an engine of sorts but it might only lasts for a few turns as a clever opponent can counter through various ways. In an apparent validation of chaos theory, you can inadvertently change the game state in drastic ways.\n\nWeird things happen when all players are aligned to the same power. The closed economy creates bizarre situations; without money, which can leave the game pretty quickly never to return, then gifts, betrayals, and builds are useless. Then again, with loans from the great powers (leveraged impact icons), money can suddenly boom into the economy and a purchase-build-tax cycle emerges. It might be best to have a court of non-patriots to maintain allegiance flexibility. Or sometimes you might need to betray one of your own courtiers to jump on the bandwagon of a surging coalition. A potent play is to manipulate the discard down to hand and court size rule, it is a great way to kill enemy spies, trash cards that you can use a single shot, so discarding is yet another mechanism for manipulating the game state. When every player is aligned to a different faction then it becomes a death match, as any player to achieve dominance with a faction will instantly win (five points immediately pushes a player above the victory threshold).\n\nUpdate: after 15 plays it seems like the scoring system limits the narrative and dynamism typical of the other Pax games, and allows for strategies and gamesmanship that seems to be against the ethos of the Pax series. I have a simple formula that seems unbeatable, the most likely outcome is no coalition is dominant, so get the most pieces in play (and have the most political cards to get a big tableau size to allow you to get more pieces out) and score the most by having the most pieces on the map, it's an effective and boring way to win.\n\nUpdate: 20 plays in and I have cooled on this game and probably Cole Wehrle's designs overall which are overtly opinionated, usually a scathing critique of British imperialism or capitalism, and I am not interested in discussing this during a board game. The game is beautiful and overproduced and though this a dumb reason, I think this is a draw back for me as I lean towards the Winsome or GaryGarison PNP aesthetic where good designs hide behind ugly and unassuming presentations. In a ranking of the Pax games I put this one close to the bottom: 1) Renaissance 2) Porfiriana 3) Lords of the Spanish Main 4) Transhumanity 5) Pamir 6) Emancipation.",
    "timestamp": 1740006000
  },
  {
    "username": "dieterminator",
    "rating": 6.0,
    "comment": "It was a strange experience for me, it is a war game 100% and the more I play war games the more I realize, that I am more into peaceful themes and that is more a personal thing than a judgement about the quality of games. I knew Cole Wehrle games are quite swingy, anohow my first impresion was, that this one is mor tactical and also it felt a little more luck based.",
    "timestamp": 1737932400
  },
  {
    "username": "okonomichiyaki",
    "rating": 6.0,
    "comment": "Ultimately left me feeling cold. The map is one of the blandest I've seen in a historical game, with no sense of geography or place, it was the weakest link in an otherwise beautiful looking game. The history tended to fade away while playing because it's mechanically a bit too abstract",
    "timestamp": 1735945200
  },
  {
    "username": "felipe1982",
    "rating": 6.0,
    "comment": "I have grown a little tired of it. It's still enjoyable and I won't turn down a game. I would rather play Pax Ren or Pax Po.",
    "timestamp": 1734735600
  },
  {
    "username": "Beercy",
    "rating": 7.0,
    "comment": "Played two games today, ngl Im impressed by design choices. I really enjoy the thematic aspect where you are changing alliance to fractions instead of leading the fraction itself. I really enjoy the shared banks mechanics in games as it makes the resource menagment even more important. The taxing and bribe mechanics to use or place cards on the dominated regions is pretty cool. The amount of choices and ways to get the advantage is very vast. Dominating a region with tribes aint enough when the leader card in your tablo ain't protected. You have to constantly balance many factors. The mechanic of buying cards outta market is also pretty interesting making you pay the price for something you want quicker. Actions menagment linked to just 2 action per turn + bonus action if suits matching cards is also pretty nice making the game very volitile for burst turns, also making people over reliable on one suit suffer. This game have few of mechanics I really like in one box, a big variaty in numbers of cards, and overall is a really great title. Definitly gonna grab a copy when possible",
    "timestamp": 1760997600
  },
  {
    "username": "okami31",
    "rating": 7.0,
    "comment": "Very interesting gameplay that allows for sneakiness with the faction loyalty switches. Gorgeous components.\n\nI need more plays to solidify my rating. I feel like I haven’t quite grasped everything it offers.\n\nUpdate:\nDidn’t like it as 2p, without the Automa, it is very chess-like and loses that typical Pax tactical nature; with Automa it becomes annoying to pilot a dummy that breaks game rules to make it competitive. I’m reserving this one for multiplayer affairs.",
    "timestamp": 1760824800
  },
  {
    "username": "BrazenLudorum",
    "rating": 7.0,
    "comment": "Best 4\nSolo option\n(Sleeved)",
    "timestamp": 1760392800
  },
  {
    "username": "toorwell",
    "rating": 7.0,
    "comment": "This is a very tactical game which I've played it mostly at 2 players (my favorite player count).\n\nAfter a few plays, you start to appreciate the emerging narrative and understand the themes of the game. That's, at the very least, a very nice cherry on top.",
    "timestamp": 1760392800
  },
  {
    "username": "Hartyfarty",
    "rating": 7.0,
    "comment": "Too easy for a player at the end with no chance of winning to kimgmake. But a complex and unique journey to get there",
    "timestamp": 1760306400
  },
  {
    "username": "Mr Mjeh",
    "rating": 6.5,
    "comment": "very good,but an awful lot of take that and the situation changes a lot between game turns, causing rather too much chaos for me",
    "timestamp": 1760220000
  },
  {
    "username": "Ddyraw",
    "rating": 7.0,
    "comment": "Beautiful game, excellent depth, but I think the grit is just a bit too much, though I can see the brilliant design, im not sure its a game for me. Got rid of it.",
    "timestamp": 1759356000
  },
  {
    "username": "Scifi66",
    "rating": 7.0,
    "comment": "Tactical fight of the Great Game.\n++ Beautiful presentation\n+ Incredibly absorbing tactical gameplay\n+ Manipulation of board position and preparedness is the key. Unlike Root the board state is clear at a glance due to top notch components/graphic design.\n+ Unusual historical theme\n+ Solo card deck is a challenging experience\n+ Great rulebook\n– Not the easiest teach but the easiest of the Pax games I've played to date\n– Can be swingy, too much with 5p best 3-4p",
    "timestamp": 1757109600
  },
  {
    "username": "Kaiserchico",
    "rating": 6.5,
    "comment": "Vote based on one match only.",
    "timestamp": 1756591200
  },
  {
    "username": "DarkJjay",
    "rating": 8.0,
    "comment": "Stored in Laser Ox insert.\n\nI'm assuming Pax Pamir basically because it's never getting to the table again. I've rarely played it with other people, despite me enjoying the game, and there's a large number of games I enjoy more when playing solo. Arguably Wehrle's masterpiece, but it's simply seeing the light of day too rarely for me to keep it.",
    "timestamp": 1762691160
  },
  {
    "username": "Papinek",
    "rating": 8.4,
    "comment": "Excellent game with wonderful artwork ! The theme is converted in an interesting way ! The box is a little bit too small ! The solo mode is great and even with 5 players we can set it in motion ! Really great !!! Thanks Cole",
    "timestamp": 1762598580
  },
  {
    "username": "iplaybgnaked",
    "rating": 8.0,
    "comment": "Great entry level Pax game that distills the system to its essentials without losing any of the depth, the cardplay though simple drives a wealth of interactions between player tableaus, the area control on the map, and the various faction alliances. Scales well and is great at any player count as well.\nThe more I play the more I feel like 3p is the best player count.",
    "timestamp": 1762038000
  },
  {
    "username": "yoyomanhihi",
    "rating": 8.0,
    "comment": "Great strategy war game. Should play more games to understand it better.",
    "timestamp": 1762038000
  },
  {
    "username": "Connduit",
    "rating": 8.0,
    "comment": "3-5\n\nCan do 2 if willing to play with \"AI\" deck",
    "timestamp": 1761951600
  },
  {
    "username": "Gaddo",
    "rating": 8.0,
    "comment": "Even if it is not a simulation the game is very immersive thanks to the incredibly well-crafted components:\n- the pieces are made of heavy resin, the game board is fabric.\n- tokens are crafted from wood.\n- the artwork on the cards consists of historical images\n- the map is made of fabric.\nPlaying solo against the automa can be a bit challenging/fristrating bit it is always a pleasure to play Pax Pamir.\nIt's not cheap, but absolutely worth every penny.",
    "timestamp": 1761778800
  },
  {
    "username": "MegaWestWolf",
    "rating": 8.0,
    "comment": "Still trying to wrap my head around this one, six years later. I get it, but trying to help other people get it is like explaining how to drive with some wire, a toothpick, and peanut butter.",
    "timestamp": 1761606000
  },
  {
    "username": "SiddGames",
    "rating": 8.0,
    "comment": "SoloX.\n\ng1 g2 b3 b4 g5\n45-120m\n\nOne play so far at 5p. I really like it, but need more plays to finalize a rating. It's both simpler and more complex than you think it will be. You need to pay attention to ALL the effects of the cards you are buying or you'll find yourself lacking in something - tribes, spies, influence, etc.\n\n.playlist.",
    "timestamp": 1761519600
  },
  {
    "username": "budkin",
    "rating": 8.0,
    "comment": "since 2019\nDD",
    "timestamp": 1761170400
  },
  {
    "username": "bamftw",
    "rating": 8.5,
    "comment": "P&P\n\n#5p",
    "timestamp": 1762124400
  },
  {
    "username": "mixmixmix",
    "rating": 9.0,
    "comment": "A game of card management, utilizing what becomes available (or affordable) to your best advantage, leveraging your alliance to one of three coalitions on the board. Outmanoeuvre your opponents in presence on the board or influence with a dominant coalition to seal a win. Intense interactivity between all the moving parts has players scanning the current board and player tableau states at every turn.\n\n+ Metal Coins",
    "timestamp": 1762038000
  },
  {
    "username": "Jakub01",
    "rating": 9.0,
    "comment": "It took some time but I've learned to love this game.",
    "timestamp": 1761692400
  },
  {
    "username": "thenneKP",
    "rating": 9.0,
    "comment": "The way everything is woven together makes for a very interesting puzzle. It's also interesting and plays very differently at different player counts. I would definitely play this if someone suggested it.",
    "timestamp": 1761084000
  },
  {
    "username": "Kubusta",
    "rating": 9.0,
    "comment": "What a lovely game!\nIncredibly deep, incredibly detailed - components are amazing, flavor texts on cards and the whole history background is astonishing.\n\nThe game seems really balanced; the closed economy is a really well-designed mechanic and everything just clicks together.\n\nI highly recommend this game, it is something unique for me and definitely it might become one of my top 5 games of all time.",
    "timestamp": 1761084000
  },
  {
    "username": "dcpepp",
    "rating": 9.0,
    "comment": "Really interesting game with lots of original ideas! Also: _so_ beautiful!!",
    "timestamp": 1760824800
  },
  {
    "username": "DrStockmann",
    "rating": 9.0,
    "comment": "Really good fun. Played it twice with 3 on our first run and both games were really good.",
    "timestamp": 1760738400
  },
  {
    "username": "AndiHOhneYpsilon",
    "rating": 9.0,
    "comment": "UV printed insert, sleeved",
    "timestamp": 1760565600
  },
  {
    "username": "RolandGaros",
    "rating": 8.5,
    "comment": "Better with every game, only trouble that hard to find players to play",
    "timestamp": 1760392800
  },
  {
    "username": "eboob",
    "rating": 10.0,
    "comment": "Wow. What a game. I am primarily a solo gamer. But if I would like to play with others, it would be a game like this. It's a game where the tension is constant and I feel like even you if are coming last you still have some agency and because the final dominance check is double points, you always have a chance to improve your positioning.\n\nThe solo is great, and having some options to increase Whakan's difficulty is good because the base Whakan becomes not too hard after a few plays.\n\nI'm not sure about 2p with Whakan, because if Whakan is like Lorena Wiebes in a sprint (cycling reference) then you end up with negative racing and a battle for 2nd and 3rd, and maybe you should just play without Whakan.",
    "timestamp": 1762633800
  },
  {
    "username": "Dr_IJ",
    "rating": 10.0,
    "comment": "really needs at least 4 players for game to shine. Weight of this game is dated and is somehwere on 3.3 spectrum. Amazing game and theme. Really a game that is hard not to fall in love with.",
    "timestamp": 1762561680
  },
  {
    "username": "Soapermania123",
    "rating": 10.0,
    "comment": "+Very tense, with board state shifting constantly\n+Indirect control and \"sharing\" of military units provides more depth than the standard area control \"my guys vs. your guys\" mindset\n+Sneaky wins and plotting clever plays feels great\n+2 action+bonus actions limit is genius, adds so much tension to your turns where you want to do just ONE more action\n+So much game in such a small box and short playtime (2-2.5 hrs for 4p)\n+My favourite victory/end game condition of all time. Just pure tension, yet incredibly clear on what needs to be done, who's ahead and needs stopping, etc.\n\n-Card luck in availability of cards constrains your options/strategies. Taking advantage of the dominant suit also feels more like luck rather than something you can plan for most of the time\n+/-Information overload leads to AP. Too much to consider, and too many cards to think about! But ultimately great for strategic depth.",
    "timestamp": 1762383600
  },
  {
    "username": "CGGGaming",
    "rating": 9.5,
    "comment": "(solo play)\n\nThe bot is pretty straightforward and the overall rules are pretty easy. There are just a few rules which are easy to miss. The player aids are very helpful and the game quality is amazing.\n\nMany negative reviews mention the randomness of the market and that you are not able to plan ahead. I don't think so. Yes, the market is random (which is a great aspect - every game is different), but it is always possible to plan with what you get and the bot/players getting in your way is part of the ride. But I see how that could get a bit too chaotic with too many players.\n\n(Negatives: some bot rules are easy to miss)",
    "timestamp": 1762210800
  },
  {
    "username": "sahelanthropus",
    "rating": 9.7,
    "comment": "I went into this game with very little awareness of the historical period, but with an appreciation for Cole Wehrle's design sensibilities. It has become a firm favourite.\n\nIts closed economy, shifting alliances, and a very intriguing point system always leave an impression. Reading the suggested material from the rulebook has further enhanced my enjoyment of the game!",
    "timestamp": 1761429600
  },
  {
    "username": "mudekk",
    "rating": 10.0,
    "comment": "I appreciate every game from this designer and this is his best work (that I've played).",
    "timestamp": 1761343200
  },
  {
    "username": "Chorume",
    "rating": 10.0,
    "comment": "Holy cow, this is good! And it's beautiful. Can't wait to try other Pax games since people whose opinion I trust think the others are even better. The only thing that gives me pause is the doubled scoring in the final dominance check.",
    "timestamp": 1761256800
  },
  {
    "username": "msucorey",
    "rating": 10.0,
    "comment": "Played over 100 times now and I can say this game is nearly perfect, especially in 4 player.\n\nI love the tension between the necessary short game, not letting anyone win by 4, and the long game, knowing the final dominance check counts double. Not to mention within each dominance check the tension between cooperation with another player under a nation flag or just focusing on your own tribes/spies/economy and not sticking your neck out.\n\nSo many different styles of play and so many ways it can grind to a (sometimes heartbreaking) finish as everyone waits for the last dominance card to make its appearance. Almost always a thrill.",
    "timestamp": 1760738400
  },
  {
    "username": "Arah",
    "rating": 10.0,
    "comment": "----------------------------------------------------------------------------------------------\nWhy a 10?\n111 plays - want to play more.\nDecisions - Elegant - Interconnectedness\nOnce you played enough games the rules become second nature and you are left only with interesting decisions and player interaction.\n\n*A digital implementation takes care of the stuff that can be overlooked like events that modify rules or like updating and enforcing region control and when you may have to pay other players. Is it worth it to play physically? Yes. Does digital improve some fiddly things? Yes. In that sense, it could have a score of 9 or 10 but, in this case, a 10.\n----------------------------------------------------------------------------------------------\nMicro Review:\nPax Pamir is a 'political intrigue' hybrid euro-wargame about Afghan tribes that seek to play 'The Great Game' to their advantage.\n----------------------------------------------------------------------------------------------\nPlayers:  to \nCompetitive Heavy Area Control\nInteresting decisions but restrictive.\nTheme:  \nSkill:  \nReplay: \nFun:    \nSim:    \n----------------------------------------------------------------------------------------------\nWhy I love it?\n-Gorgeous components.\n-Fun game to play.\n-Very interactive: decisions have ramifications that impact others directly or indirectly, with a nearly closed economy.\n-Thematic: the player feels the need to ride the waves of political (cards/cylinders) and military (blocks) change.\n-Elegant game with simple rules (the multiplayer rules) and interesting decisions.\n-Very replayable. While the strategy is quite static: just get more points, the turn to turn gameplay is very variable and presents unique decisions.\n-When all players are competent, certain advantages in different fields emerge (one may have more coins, another more influence, another more discs), and whoever leverages this best can win.\n\nSome of its limitations:\n-Looks like an area control wargame, but plays more like a political simulation in which there happen to be military units which can seldomly be used for combat. At times, there is more action with the spy cylinders that can attack, betray and even be discarded alongside a card.\n-Restricted actions: while there is little movement, you are limited to where you put your pieces, which in turn limits the scope of battles/betrays and taxes/bribes. The tableau and market allows you or does not allow you to make a specific play.\n-Build action is underpowered.\n-Best when all players are similarly strong and understanding of the implication of their moves. Bad players will be left behind and may ruin the game as they can serve plays in a silver platter for the stronger players (the most common being not stopping an imminent victory and leaving 3 star cards or strong 2 star cards for other players).\n-Player sitting order is important. Seating after a weak player is an advantage and after a strong a disadvantage, which is the opposite of a handicap.\n-In some games, a player can hoard coins. While a valid strategy in some cases and for a time, it can slow down the game and makes other players have way less options.\n\nPlayer Scaling:\nMore strategic, or at least a sense of it as there are less external influences at 3p, more chaotic at 5p, while the intended shifting alliances work better at 4-5p. Not a bad game at 2-3, just that it doesn't have that shifting alliances gameplay in focus. Player count specific disadvantages:\n-(1p) Bot has lots of rules and, for some, needs extra unofficial rules to be more of a challenge.\n-(1-2p) Shifting alliances impacting players is lost.\n-(1-3p) Combat is less common.\n-(3-5p) Kingmaking: no mechanisms to counter this. Even goes above with 'Kingpaving': bad moves by any player can give another a big advantage. Cards feel predetermined in the market.\n-(4-5p) Little control over the market. Reduced strategic play as the market and game state fluctuate more wildly between turns. If a player is too strong but it is away from you in sitting order then you can't attack their cards with spies easily.\n-(5p): A problem with 5p is that it is very susceptible to a flock behavior where everyone aligns with one faction and have no incentive/are punished to go against everyone else.\n\nAlternatives:\n-At 2-3p, it is like Ankh: both very deterministic area control games and euro-wargame hybrids. You can math out moves, especially towards the endgame. Both are more strategic at lower player counts and then become more tactical instead as player count increases.\n-The Expanse Board Game.\n-COIN games, like Fire in the Lake, with their semi-randomized victory checks.",
    "timestamp": 1760652000
  }
]