[
  {
    "username": "Fallow",
    "rating": 1.0,
    "comment": "Worst purchase decision ever. Lost money, lost time. How much NEW $#!/ did poots sell before fulfiling this?",
    "timestamp": 1752789600
  },
  {
    "username": "bcate22",
    "rating": 1.0,
    "comment": "Sick and twisted, with overt and intentional objectification of women, stupidly expensive, and ridiculously complicated. I have no idea why this game is so popular.",
    "timestamp": 1746482400
  },
  {
    "username": "ManEatingHippo",
    "rating": 1.0,
    "comment": "There is no reason for this.",
    "timestamp": 1742770800
  },
  {
    "username": "ultimoratio",
    "rating": 1.0,
    "comment": "I'm not averse towards dice rolling and happy to ride the narrative rollercoaster that some people will put their nose up on, but this game is just tedium. You can do better than this - there are better narrative-driven board games out there that are objectively better: both in terms of cost you have to pay and the quality of the game design and storytelling",
    "timestamp": 1742770800
  },
  {
    "username": "larrydurbin",
    "rating": 1.0,
    "comment": "Terrible theme.",
    "timestamp": 1740956400
  },
  {
    "username": "ShunterBill",
    "rating": 1.0,
    "comment": "You can have it for free if you pay the shipping costs. Box has been opened but all plastic parts still in shipping bag. Game as new with cards sorted. Otherwise game unused.\nGAME NOW DISPOSED THANK YOU FOR YOUR INTEREST.",
    "timestamp": 1727128800
  },
  {
    "username": "Whatupahlcg",
    "rating": 1.0,
    "comment": "Take the money but not send the product to me from Black Friday till now.Very disappoint f this board game due to their awful service.",
    "timestamp": 1705878000
  },
  {
    "username": "bernstein82",
    "rating": 1.0,
    "comment": "just play a decent computer-game",
    "timestamp": 1705273200
  },
  {
    "username": "RedMonkeyBoy",
    "rating": 1.0,
    "comment": "Full review at AlwaysBoardNeverBoring.",
    "timestamp": 1676934000
  },
  {
    "username": "Apocallur",
    "rating": 1.0,
    "comment": "1/10 for accessibility, business model and oversexualizing the models",
    "timestamp": 1675724400
  },
  {
    "username": "Emjaydot",
    "rating": 1.0,
    "comment": "Awesome game, abysmal company. Will update rating when I received my KS stuff from years ago.",
    "timestamp": 1643756400
  },
  {
    "username": "Kiviak",
    "rating": 1.0,
    "comment": "The box content is a wonderful illusion: you open the box, glance through the cards with their beautiful art, look at the huge number of mini assembly kits and marvel at their detail, look at the big ass cards (settlement and tech) and your mind starts running through all sorts of post post post end of a tainted, fairy-like world full of mysteries / legacies.\nHold on to those precious moments - that will be your highlight of the KDM experience. Write notes, start your secondary world creation based on that material.\nThe actual play experience will crush these moments and make you regret you ever played it (and mind the damage to your wallet too).\nYou're better off gathering as much lore as you can and use the material in an RPG campaign. I guarantee that the experience at the table will be more enjoyable. On that note I have nothing against crapsack worlds / theme / settings. What kills the user experience at the table here is the randomness (especially in connection to the lethality), the grind and the clunky combat system / equipment pr0n.\nI guess the designer wanted to \"subvert expectations\", which can never, never go wrong, right?\nIt's a shame, really. The design of the minis is superlatively good but the rest is profoundly disappointing.",
    "timestamp": 1641337200
  },
  {
    "username": "vinayplusj",
    "rating": 1.0,
    "comment": "The poster boy for all the issues with the Kickstarter process of game publishing. This game is tedious with too much to account for.\n\nThe game experience is a long drawn out train wreck. Great to watch as entertainment, horribly troubling to experience.\n\nAlso, the art is disgusting, disturbing, and pervy. Like a bad reality show where the writers and actors have stopped caring and only seek your attention through shock and aggravation.\n\nOverpriced (400+ CAD) with component creep. This game also serves as promotion for miniatures that have no gameplay purpose.\n\nThe creators and publishers seem to have spent more time in peddling the game and begging for good ratings in BGG and elsewhere than in designing and play testing.\n\nIf you are after disturbing or lustful miniatures, buy miniatures elsewhere. Even if you have/want to play, try the Tabletop Simulator mod.",
    "timestamp": 1633989600
  },
  {
    "username": "Sebslocker",
    "rating": 1.0,
    "comment": "Archaic mechanics and tedious gameplay. Not to mention totally sexist art.",
    "timestamp": 1629237600
  },
  {
    "username": "epyon346",
    "rating": 1.0,
    "comment": "The gameplay favors randomness above all else and you're just as likely to get screwed by theoretically doing some productive as you are to actually progress. There's a ton of bookkeeping before moving on and there's interesting mechanics, but the whole of the package is just bad to the point where I just couldn't play any more.",
    "timestamp": 1592344800
  },
  {
    "username": "The_Shepherd",
    "rating": 1.0,
    "comment": "jesse pick",
    "timestamp": 1587679200
  },
  {
    "username": "Haeretiker",
    "rating": 1.0,
    "comment": "Delays and empty promises",
    "timestamp": 1587333600
  },
  {
    "username": "Slycrow",
    "rating": 1.0,
    "comment": "I gave this rating because I disagree with the sexist visuals used in the game and to promote the game. Have never played it, it might be a great game.",
    "timestamp": 1566684000
  },
  {
    "username": "eatshootsandleafs",
    "rating": 1.0,
    "comment": "I can’t believe how lame this game is. It is as if the designer hasn’t played a single modern board game and came up with this outdated mess. The mechanism are so dull it could of come straight out of the 80’s! So repetitive and limited in scope, nothing at all innovative. Goes to show people can go gaga over miniatures.",
    "timestamp": 1565733600
  },
  {
    "username": "jj48",
    "rating": 1.0,
    "comment": "Very dark, disgusting, and disturbing. All the repetitious tedium of RPG grinding, without any of the fun of role-playing. Rather than interesting enemies and challenges, the makers went for pure shock and gross-out. I would not recommend it to anyone.",
    "timestamp": 1560636000
  },
  {
    "username": "chakayek",
    "rating": 1.0,
    "comment": "Ya, it defies game description. Maybe it can be a good activity if you really enjoy socializing with some specific people and you want to add some spice and die-roll into your chat. Otherwise, it's death-boring.",
    "timestamp": 1539208800
  },
  {
    "username": "thefloriantrout",
    "rating": 1.0,
    "comment": "the full 1* rating is because the costumer service sucks balls.\n\nthese punks strung me along for 8 months telling me they'd replace my damaged items (cracked/bulging inner tray - banana book with unattached pages) when they received stock.\n\nhadn't heard back from them since March so i messaged the \"Dark Mediator\" and he/she/it proceeds to tell me that they won't cover it.\n\ngood thing i can't get my hands on their throats.\n\n**********************************************************\nas far as the game goes, it was okay the first 2 times. then i realized it plays like a MMORPG. you get tougher/stronger and so do the monsters. rinse repeat. on a scale of 1-10 there is a strategy of 2. a whole bunch of dice rolls that determine everything. one of our guys fell in a fissure. because we rolled a number. Role Playing = ZERO.\n\nthis game is hype and nothing else.",
    "timestamp": 1530136800
  },
  {
    "username": "axioms",
    "rating": 1.0,
    "comment": "Tits & Death: Glorified. That's what it is. A glorified toybox of softporn material. No wonder young dicks and old wankers alike are drooling all over it. Demoralizing.",
    "timestamp": 1521327600
  },
  {
    "username": "Facebeard",
    "rating": 1.0,
    "comment": "Thankfully someone else's copy.\nLike Warhammer Quest (so not good) except also pervy and depressing.\nJust because some male survivors have a naked muscle chest does not balance out the rampant boobery of the whole range. Being a strong dude is also a male fantasy, not a female one.",
    "timestamp": 1515279600
  },
  {
    "username": "EpIII",
    "rating": 1.0,
    "comment": "Beautiful miniatures but gameplay is meh. Game struggles from identity crisis. Is it a role playing game, tabletop minis, or Boardgame? For the money you could buy most of the top 10 on this website, and have much better time.",
    "timestamp": 1514934000
  },
  {
    "username": "Tischel181",
    "rating": 1.0,
    "comment": "While I played this, some love for board games died inside of me.",
    "timestamp": 1513810800
  },
  {
    "username": "AlhoonRangoon",
    "rating": 1.0,
    "comment": "Great models, great flavor, but the gameplay is just the worst kind of garbage. Tons of cards and tables all serve only to obfuscate a complete lack of depth and player choice.",
    "timestamp": 1512255600
  },
  {
    "username": "Batariel",
    "rating": 1.0,
    "comment": "For the price, having a repetitive and random hunt track and the same fighting area is inexcusable.",
    "timestamp": 1511823600
  },
  {
    "username": "cbazler",
    "rating": 1.0,
    "comment": "The biggest time and money sink in all of boardgaming. For what amounts to just a bad, ugly game. No thanks.",
    "timestamp": 1511218800
  },
  {
    "username": "joecolade",
    "rating": 1.0,
    "comment": "Too bad. Kickstarters with all in over 250$ are not family budget friendly. I am out.",
    "timestamp": 1509490800
  },
  {
    "username": "tierdal",
    "rating": 1.0,
    "comment": "Crap game...takes my friends away from me.. don't like..bad (or sick)",
    "timestamp": 1490997600
  },
  {
    "username": "TeknoMerk",
    "rating": 1.0,
    "comment": "The Good: Interesting AI, campaign ideas.\n\nThe Bad: Too expensive!!! Over-produced, overly complex, tedious, dragging gameplay, too many mechanics and details Ambiguous rules without enough examples of play.\n\nThe game does not flow because it bogs down into excessive detail. This is overly brutal, punishing game where hours of play can be extinguished with a few bad die rolls/card draws. It seems like there are good ideas with Kingdom Death, but was not really playtested and tightened. It's kinda like a kitchen sink approach to a dungeon crawler. If some generous soul gave this game to me for free, I would still not play it again.",
    "timestamp": 1482102000
  },
  {
    "username": "216stitches",
    "rating": 1.0,
    "comment": "Misogynist",
    "timestamp": 1477692000
  },
  {
    "username": "JackyTheRipper",
    "rating": 1.0,
    "comment": "Big box with miniature puzzle inside. The game that was put around the minis is just as awful. Long, boring, overloaded and underwhelming. I enjoyed it as much as bookkeeping. Felt like it too.",
    "timestamp": 1461621600
  },
  {
    "username": "realityfoible",
    "rating": 1.5,
    "comment": "Barely qualifies as a game.\nLet's make something absolutely clear: when a game instructs me to draw a card, which tells me to roll a die and look up a reference table that then claims I have achieved or failed something, *I* have not achieved/failed anything. I haven't even participated.\n\nYou do not play Kingdom Death: Monster.\nYou are merely the flesh engine moving the components as the game plays itself.\nDecisions don't matter. Players don't matter. Free will is an illusion.\nOnly the capricious will of dice and shuffled cards.\n\nIt doesn't even have the grace keep my torment short.\nI have no agency and I must scream.\n\nI dig the aesthetic vibe though!",
    "timestamp": 1760392800
  },
  {
    "username": "mmychal",
    "rating": 2.0,
    "comment": "Way too much variance in this game - moreso than the typical GW \"crandom.\" The minis look good for the most part, except for the obviously sexism.",
    "timestamp": 1749592800
  },
  {
    "username": "jcoopersd",
    "rating": 2.0,
    "comment": "Barely any game here. Much better Ameritrash out there where you actually have some decisions and agency, this might be peak overrated Kickstarter mini bullshit",
    "timestamp": 1746223200
  },
  {
    "username": "psyven",
    "rating": 2.0,
    "comment": "There's so little game here for all of the fussy bits and minis. The art is pretty intense and if you're into it, it's cool... but it doesn't save this from being a terrible game / gaming experience.",
    "timestamp": 1722549600
  },
  {
    "username": "spacemanc",
    "rating": 2.0,
    "comment": "The value provided vs the price point of the game is very low IMO.\n\n2020 - This game can be very fun, but I still think that the price is ridiculous for the content you get.",
    "timestamp": 1721080800
  },
  {
    "username": "MotherMary",
    "rating": 1.5,
    "comment": "Highly overrated. Suffers from hype and overproduction, \"I need to like this because I blew so much money on it\" syndrome so many new games do these days. Problematic content becomes okay if people need to justify what they spent and how much hype they fell for.\n\nIt barely qualifies as a game. This was more of a social experiment to see how much wool could be pulled over the eyes. Played this several times because friends got so excited for it to come in. Several weekends later they moved on to other games. Several months later we all forgot the experience and any desire to play it again.\n\nAn extra .5 because someone on the team gave a darn for 5 minutes and wrote some interesting ai mechanics. I hope a better game/game company down the line takes some inspiration from them.",
    "timestamp": 1682460000
  },
  {
    "username": "Stuket",
    "rating": 2.0,
    "comment": "Kickstarter. Cooperative horror game for 1-4 players. Complex rules and a steep learning curve. I suspect I will only play this solo. If I ever find someone willing to play with me, I will almost certainly become the \"Alpha Player\" and dictate all actions in the game. That's frustrating both for me and the others. The game is hard. Really hard. Lots of random cards drawn and lots of dice rolled. Too much is random. And the outcome is quite often instant death for a character, without anything you can do about it. Extremely frustrating. It seems almost impossible to complete the game. And even if some extreme luck should bring victory in the final showdown it's gonna take hundreds of hours to get there. It'll never happen. It has nice miniatures but why must I glue them together myself? I'm not very skilled as a miniature builder and the results are \"acceptable\" at best. And why the juvenile sexist design? So I don't like this game at all. Normally I don't consider price a factor when I rate my games. But when a game costs this much it has to be considered. It's the most expensive game I've ever bought. I'm so sorry, but put it all together and it's the worst thing I have in my collection. Rating it as 1.\n\nEdit: I've added a few house rules to remove some of the worst frustrations with this game. It's playable now. But it still happens that you send four characters on a hunt. After several hours of fighting two of them return carrying some \"Love Juice\" they've recovered - only to roll a \"1\" on the intimacy table, instantly killing them both. Where's the strategy in this? Is it fun with a game that works this way? Way too random for me! Rating stays at 2, and will probably never rise any higher.\n\nEdit: Built all the monsters now. They're not that many considering that the box costs $400. I also tried playing it again this weekend. Just to be sure. And I still think it's crap. Apart from what I've already said I should add that drawing a card, which tells me to roll on a table, which tells me to draw another card, roll on another table, draw again, roll again, etc, until finally some (probably lethal) effect ends the cicle, is kind of boring. It isn't actually playing a game. It's just following instructions. I was lucky with the cards and dice this time, but I almost set the score back to 1 anyway.\n\nUpdate march 2023: Sold online for SEK 2600.",
    "timestamp": 1680040800
  },
  {
    "username": "Leylos",
    "rating": 2.0,
    "comment": "TIme to setup and teardown are massive. The amount of upkeep during a campaign is just as big.\n\nThe gameplay itself, follows along the same line. Everything is designed to take longer than it needs to. Yes the fights against monsters are epic, but once you fight the same monster over and over you wish they were shorter.\n\nThis is the kind of game that makes me think it would work well as a computer game, by having all the annoying stuff automated. But without that it's simply too cumbersome to play.",
    "timestamp": 1657058400
  },
  {
    "username": "Kaotiktaco",
    "rating": 2.0,
    "comment": "Game is repetitive, the rules are clunky, and the settlement phase is a huge slog. The art is pretty cool and the overall look of the game is great, but this doesn't redeem the overcomplicated gameplay.",
    "timestamp": 1651356000
  },
  {
    "username": "XShrike",
    "rating": 2.0,
    "comment": "The game feels like two different games smashed together. One game is a settlement and campaign game, where you have to make choices between short term and long term outcomes. The other game feels like a one shot dungeon crawl. Combined together and the game doesn't feel like an uphill battle, which I would be fine with. I have played enough games likes this and found paths to victory. Even losing those kinds of games can be fun because you can see what you did wrong or if one bad luck did it. Kingdom Death: Monster feels like a downhill slide where you hope random chance decides to somehow move you uphill. You will lose through no fault of your own and even worse, you will lose because you are doing too well.",
    "timestamp": 1647126000
  },
  {
    "username": "Leiye",
    "rating": 2.0,
    "comment": "Crazily overrated Kickstarter game.\nIf you pay the 100-150€ for Gloomhaven, you save several hundred €, while getting a significantly better co-op experience.\nIf you want, just can still spend that extra money to buy fancy miniatures.\nJust this time they aren't linked to a very mediocre rpg.",
    "timestamp": 1638054000
  },
  {
    "username": "tpelletier",
    "rating": 2.0,
    "comment": "Played at a convention. This game is terrible. I cannot understand how anyone justifies it as a quality game. So many better campaign games out there.",
    "timestamp": 1636153200
  },
  {
    "username": "Alyiz",
    "rating": 2.0,
    "comment": "Great things about the game: beautiful components, clear Berserk manga inspiration art style and dynamic enemies that feel like they are \"thinking\", which adds tons of replay value. The gear grid system and synergy squares really work well for the game. The feeling of helplessness like you're trapped in a bizarre post-Eclipse world of Berserk, building a settlement out of the weird alien landscape and monsters. Essentially, Monster Hunter meets Berserk.\n\nThe bad: This game either wasn't playtested enough or the designers just don't give a shit about math. I can tell when someone tried to make the math of their game work despite not being very good at it and when they just slapped whatever together and hoped it would work as long as things had numbers relative to each other. KD:M is a clear example of the latter as none of the probabilities seem to have been worked out ahead of time to ensure the difficulty was as-intended. Most things in this game have you rolling on a table (a bit outdated but okay, I can work with this). However, several tables are simply broken, skipping numbers like this:\n1-3\n4-6\n8-9\n10\nWhere is 7? This happens repeatedly since the designers want to have no more than 4 table rows on most of them and shoe-horn 10 by itself most of the time. The dice you roll are inconsistent. Sometimes it's 1d10, sometimes 2d10 additive, sometimes d%(aka d100) and sometimes d5?? Not only is this jarring but rarely do they have you \"check\" any of your skills. These rolls are just totally out-of-your-control randomness. I get that maybe they were going for a \"the universe is uncaring\" feel but the rest of the game brings that oppressively, so I'm not sure why you'd have players rolling on broken inconsistent tables which are independent of player stats. On top of this, half the time you roll on a table just to roll on another table, which usually means the only \"good\" outcome is roll a 10 to roll a 10 on another table, which is a 1/100 chance. Same for the worst outcomes. Meaning most of the time you end up \"taking 1 damage\" or \"getting a -1 token\" to some stat or whatever the generics are. Essentially the events in the book all feel like they're trying to grief players rather than challenge them. There are way too many random event rolls in this game. Just as an example, coming back to town where you are usually safe, there's a random event deck you draw from and then on one card you can draw there's a random table you must roll. Within that table there is ANOTHER random table you roll. You can also spend precious endeavor points (1 per player) to roll on tables, which usually have a 30% chance to screw you, 30% chance to do nothing, 30% chance to do nothing of note, and a 10% chance to do something insanely good for no reason.\n\nMost of the moral choices in the game come down to literally \"save baby or eat baby\" style that modern video games bring. I could go on and on about how bad the math is and how \"sacky\" the game feels with the monster traps and imperviousness. It seems the designers thought the only way monsters could live after a single upgrade session from players is to make them nullify half the players' attacks that actually hit; the other half always missing due to having a to-hit system followed by ANOTHER to-hit system a la Warhammer 40k. But this isn't a wargame and we aren't rolling buckets of dice. You're lucky to roll 3 attack dice early game for instance. Do the math:\nAt +1 accuracy and a target 7 weapon, you roll at a target 6. Of 2 dice, 1 will make it (50% chance each die). Of that 1 die, you now roll your +1 strength against a monster's 9 toughness, with a weapon strength of 2. Adding Str + weapon = 3, so you get +3 to your roll which averages at 6, so 9. Just barely a hit. So in other words, you have to do exactly the average on two different rolls which are subsets of each other. That means you need 4 dice to hit once. If one of those hit locations is First Strike, Impervious or a Trap, you're likely screwed. Don't get me wrong. I love the difficulty in the game as it provides a tactical challenge. But it relies way too much on griefing players who actually succeeded against all odds to make any difference.\n\nOn top of this, rolling a natural 10 and critting some areas requires then rolling another nat 10 to make the monster instantly die? So that's the probability that:\n-The player hit with at least one die\n-Then drew that hit location card out of 30 others\n-Then rolled a nat 10\n-Then rolled another nat 10\nWhy even have this effect when this is the least likely thing to happen ever? You're talking about 1/2 * 1/30 * 1/10 * 1/10 = 1/6000! You'd have to fight that thing 6000 times for it to happen, give or take since Hit Location decks increase the chances of seeing it as you go through but traps decrease the chances.\n\nOverall, FIX YOUR FUCKING MATH and you'll become an easy recommend from me. If you have a group willing to just ignore most of the non-effort put into the rolling and tables, then it can be an absolute blast. None of the \"horror\" theme is really evoked there. Tough decisions is what makes a horror theme. Randomness is the literal opposite of a decision. It's an intriguing game with a lot of potential and while not really worth my money, you should at least play with a friend if they offer.\n\nUpdate Sept 2019: Pretty sure the Strength +1 token depicts a man raping a woman. And is labelled \"Strength\". I think I might puke my entire skeleton. The game is already pretty shitty to women and I managed to exclude from my earlier comments that it disrespectfully reduces humanity to their ability to reproduce for the civ-management section of the game, which is just a ridiculous heterosexual fantasy. In our games, we just designate two types of women (there aren't any men in our play group) and the two different women types (Type A and Type B) suffice just like the \"Gender\" marker in the game for civ management. With humanity being sprung up from the earth in-lore, they should've ditched sexuality anyway as a concept. Humanity more resembles thinking plants in KDM so I don't see why there needs to be a strict gender binary role that mimics our *actual* horrorshow of a society today and forces you to be complicit in that by dehumanizing those bodies into reproductive factories.\n\nI'm not sure why I ever rated this a 6 given that RAW, the game is a broken unplayable mess and extremely annoying. I have to throw my rating down the toilet to a 2 especially given that every time I consider playing, even with a group that is fine ignoring some rolls/draws to keep the fun going, there's always some part of the game that tells me I'm not welcome as a woman. Instead, the game considers women only heterosexual and just meatbags for reproduction, violation, and tragedy. This differs from the general violation that exists to all genders in the game already and is extra and on top of that.\n\nUpdate Nov 2019: I started to suspect KDM is only enjoyed by people for the miniatures and paining, rarely for the gameplay so I dug into the community resources a bit only to find that most of my search results were how-tos on mini assembly/painting. Even when I specifically used terms like \"kingdom death primer\" it would link to paint primer tutorials or \"kingdom death beginner guide\" it would link to beginner painter guides overwhelmingly. I have a lot of disdain for the fact that what amounts to a pretty unfinished broken game with significant problems is being standarded above an 8 by a majority minis-enthusiast community. There's nothing wrong with liking miniatures, I just wish games could be rated based on their play experiences rather than colored by plastic pushing. This update was from a 7 (good but heavily flawed) to a 2 after I actually bought the game and experienced how indefensibly broken it is.",
    "timestamp": 1629324000
  },
  {
    "username": "chriskaspar",
    "rating": 2.0,
    "comment": "Lots of pieces. At one point, it just feels like a shock- horror movie. The artwork is good...but bits of obscenity turn me off; I can't play with certain people (my kids).",
    "timestamp": 1628719200
  },
  {
    "username": "DrPerkele",
    "rating": 2.0,
    "comment": "This game involved the most childish F-you ending I've ever encountered in a campaign and I'm so irritated that I simply can't recommend this game to anyone, ever, period.\n\nDid you hate the ending of Game of Thrones? Well, I hope you're looking forward to feeling the same way when this game ends. This is a game for people who hate joy and/or are masochists. Or who like spending exorbitant amounts of money only to be disappointed (rich masochists?).\n\nAnd we can all just agree that a lot of the art is sexist, pretty much towards both genres. I've said it, let's move on.\n\nWhile the time my friends and I had together with this game was great and creating your own minis was delightful, the game is too hard. Not in a fun way, in a F-you sort of way. You'll never figure it out on your first play-through, so be prepared to have a bad time and not finish your first campaign, because you realize you need to look everything up online to get anywhere. Then, prepare for the game to screw you over at every turn, regardless of successful die roles. It's not fair, like in DnD. No, you can still roll the equivalent of a Nat20 in this game and get boned. The game's default setting is \"unfair\" but not in a way like Dark Souls that's just hard. Even a victory feels like a failure but these failures don't follow any logic. If they did, I could accept it, but they don't make any sense whatsoever.\n\nThe pacing is terrible. Everything is too hard in the beginning, followed by a bunch of boring grinds of the same lion and antelope fights that only get harder but not more interesting, so the hunts get exhausting and longer as the game goes. While the events in the game can be fun and interesting, you need to have some sense of some reward coming that never really comes.\n\nAnd then we get to the ending (spoilers here on out)\n\nThe final boss is with someone called The Watcher. The idea is that the Watcher is like one of those angler fish, with the lantern being its lure. So the lanterns where you build your civilization are part of The Watcher, who awakens every once in a while and devours the civilization that is built there. Pretty cool, right? So we fight The Watcher and we won! Hell yes, but then we get the ending text which says, essentially, that no matter what you do, you don't have light anymore so you die. You can keep playing if you like, but you will die eventually.\n\nThat's the most childish \"lol F you\" ending to a game I've ever played.\n\nIf it had been left open, like \"you must go forward in darkness... will your civilization survive?\", I'd have been completely satisfied. After our victory, we were all amped up to celebrate, but after reading that, it sucked the wind from our sails. It essentially told us that we weren't allowed to imagine what happens next, but rather, that whatever we did, we're screwed. Truly, it felt like the ending of Game of Thrones.\n\nUltimately, there was a lot of fun to be had in the game, but all of it was rendered null by the ending. Poots is a creative guy but his storytelling is childish and simply bad.\n\nMaybe I'll do a DnD mod for this game and make this good...",
    "timestamp": 1619820000
  },
  {
    "username": "rhaydon",
    "rating": 2.0,
    "comment": "Very disappointing, but, admittedly, I fell for the roof-shattering hype this game emits. I should have also considered the fact that most of the energy and advertising is directed toward miniatures not gameplay. Funnily enough, when asking friends what their favorite mechanic of the game is, no one can really name one haha.\n\nThe events between showdowns are bland and obviously random, but that is permissible since the atmosphere is supposed to be chaotic and grim. However, the combat, the heart of its gameplay, is terrible. It has the complexity and dynamism of rolling to hit in D and D! Terrible luck mitigation for how much time you spend tweaking your item tableau and shopping, which is arguably the brunt of one’s efforts honestly. You know a game’s combat is bad when you can lock in a perfect configuration of weapons and tactics, only to get your head lopped off with a roll out of nowhere. As for ratio of originality in mechanics and interactive plot points to the price, it’s laughable.",
    "timestamp": 1614898800
  },
  {
    "username": "Hlorridi",
    "rating": 2.0,
    "comment": "Dont understand the Hype. Dark Souls Bossfights are way more polished and better designed.\n\nComponents are nothing but OK. There are many many games with much better components that doesnt costs 2000 Dollars.\n\nThis is like an Apple product.\n\nVery bad customer service if you have missprinted materials.\n\nGameplay is ok, but nothing special. Very repetetive and a pure random luckfest.\n\nIt is the Apple Product for Board Games. All about hype.",
    "timestamp": 1613689200
  },
  {
    "username": "ArborBarber",
    "rating": 2.0,
    "comment": "The purest distillation of Ameritrash.\n\nThe models and background fluff are completely bonkers and brilliant, but the game is overcomplicated nonsense. I want to love it but the mechanics make that difficult. Many better games to buy with this crazy amount of money. If you wants a tactical RPG board game experience, Descent / Imperial Assault is mechanically loads more satisfyingly.\n\nEdit: to be clear, the bizarre, profane monster models are tremendous and unique, but the callipygian \"pinup\" models with their ludicrously pendulous breasts are just embarrassing. Let's not perpetuate the stereotype that board gamers are all 40-year-old basement-dwelling virgins...",
    "timestamp": 1612393200
  },
  {
    "username": "Kirsdarke",
    "rating": 2.0,
    "comment": "A nice game except for the combat which is the worst system i have seen in a board game. The other parts are nicely done and if the game wasn't 90% combat and 10% town building etc it would be a good game.",
    "timestamp": 1611788400
  },
  {
    "username": "oldskoolgeek999",
    "rating": 2.0,
    "comment": "Lots of childish monsters. Extremely basic gameplay. Interesting base building element",
    "timestamp": 1598220000
  },
  {
    "username": "EtanMoonstar",
    "rating": 2.0,
    "comment": "Apologies in advance to all KDM fans, but I simply can't envision a scenario where I wouldn't rather play an actual rpg like D&D than spend my time playing another session of this game.",
    "timestamp": 1584658800
  },
  {
    "username": "wavewynder",
    "rating": 2.0,
    "comment": "After 12 plays I think I have had enough of this game. The theme definitely got to me, and I don't enjoy it. I mostly enjoyed the showdown and always have fun fighting something as a party. I'm not one for such a theme anyway, and eventually I just had enough. Thankfully I played with few friends and used a friend's copy, otherwise I would be bummed at having spent hundreds of dollars on it.",
    "timestamp": 1569967200
  },
  {
    "username": "skyzwalper",
    "rating": 2.0,
    "comment": "This is one of worst games I've played in the past 10 years. The only great thing are the miniatures...",
    "timestamp": 1557525600
  },
  {
    "username": "discomute",
    "rating": 2.0,
    "comment": "Zero roleplaying, very little tactics. It's a \"role and look up a table\" game. I found it very bording.",
    "timestamp": 1549494000
  },
  {
    "username": "Werbaer",
    "rating": 2.0,
    "comment": "Collection of mineatures, but not much of a game.\n$400 price tag?\nFor unassembled grey plastic in spruces?\n\nRating reduced by 1 point for expansion overload",
    "timestamp": 1548111600
  },
  {
    "username": "Alfare",
    "rating": 2.0,
    "comment": "most overvalued gameplay ever",
    "timestamp": 1539727200
  },
  {
    "username": "jshufelt",
    "rating": 2.0,
    "comment": "Just not a fan of this game. Important decisions with a lack of control. The game acts upon you, and you just laugh or cry. I would rather play Tales of the Arabian Nights for a storytelling experience, because at least with that I get to keep on going, and doesn't a have super fiddly combat system.",
    "timestamp": 1538949600
  },
  {
    "username": "Ug999",
    "rating": 2.0,
    "comment": "Boring....",
    "timestamp": 1514070000
  },
  {
    "username": "Myrmec",
    "rating": 2.0,
    "comment": "Oh cool it's a crappy RNG brutalizer with nice looking minis.....\n\nKeep the theme, keep the minis, even keep the build/hunt/fight phases and campaign story. But for the love of glob the mechanics are a mess. there's no reason players should do 2 hours of learning and another hour of setup, only to roll badly on the first turn and spend another hour doomed to fail... for $150.",
    "timestamp": 1503266400
  },
  {
    "username": "WRKRPLMT",
    "rating": 2.0,
    "comment": "the worker placement in this game is terrible",
    "timestamp": 1485644400
  },
  {
    "username": "Septyn",
    "rating": 2.0,
    "comment": "Mike, please don't make me play this again.",
    "timestamp": 1483398000
  },
  {
    "username": "hoffcorp",
    "rating": 2.0,
    "comment": "Terrible. This game is all hype and too much focus on the gonads. You can get injured in the sexual organs. Make a boring dice RPG fest with rapey looking monsters and content.",
    "timestamp": 1472853600
  },
  {
    "username": "EdwardConway",
    "rating": 2.0,
    "comment": "There is a phrase in role playing gaming that sums up this game perfectly: \"rocks fall, everyone dies\". This refers to situations where there is no choice or action, merely everyone being killed off due to either luck or an angry DM. Most games try to limit this, but this game makes it the main element. Roll a dice, and there is a 75% chance one or more characters will die.\n\nThe components, text, and setting of this game are extremely high quality. The creators did a tremendous job polishing the game, and the depth of the setting shines through.\n\nWhat they did not do was provide any kind of balance, any meaningful choices, or any way to mitigate bad luck. Crafting and experience both require your characters surviving. They won't.\n\nI played a game of this, and our group did four hunts. In three of those, all party members died. In the only hunt we won, only one party member survived. All hunts were against the easiest monster. Even with observing its tactics, our group still was unable to beat it more than once out of four hunts.\n\nThe encounters are randomly chosen, and have beautiful flavor text that really draws out the setting, but the result of the vast majority of these encounters is one or more characters is killed, with no chance to change the outcome and zero player input. For example: one event happened where a roll of the dice decided that one of my characters and one of another player's characters killed each other. No choices, no input, no meaningful interaction, it was simply: someone rolled a 63, two characters died.\n\nMost of the combats work the same way: the monster attacks, and most likely kills a character. Then characters attack, and either miss and get killed by a counter-attack, or hit, fail to wound, and get killed, or hit, wound, and then get killed. Roll poorly once? That character is dead. This game offers all the excitement of playing a group of unarmed peasants being killed by a dragon.\n\nThe odds are always stacked against anyone in the party surviving, and there is very little that anyone can do to change those odds. Your characters and your party will only last as long as everyone rolls improbably well. The only way to survive is to roll well, every time, because this game, beneath all its complex flavor, boils down to \"don't roll poorly\".\n\nWhile I respect the amount of effort and creativity that went into this game, I would never voluntarily play it again. I enjoy games where strategy and meaningful choices exist-this game has neither. I enjoy games where what a player decides has a meaningful effect-that is totally absent in this game.\n\nWhat this game does provide is endless variety in ways to die. For players that enjoy a good story, but don't like to take part, and for players who like to see their characters die over and over, this is the perfect game. For my part, I'll pass.",
    "timestamp": 1470261600
  },
  {
    "username": "ultrablue",
    "rating": 2.0,
    "comment": "I rally don´t know why everybody here is so overwhelming excited about this game and everyone shows only the first tutorial fight?\nI waited years to get my copy and i was so curious about our first game!\n\nYou will understand my deep disappointment after a few explanations:\n\n1. Ok, the artwork and miniatures are great... Thats why i didn´t only gave it 1 point of raiting!\n2. Why make a dungeon crawler / horror / surrvival game and only put heroes in the core box? There are only 5 different monsters in the box and over 20 survivors... after fighting the lion the third time it´s just annoying!\n3. Balancing - There is just no balancing... You can die in the tutorial and it says: \"Just start again and agin\"\n4. Settlement - Nice idea and good made, but absolut useless to define 30 - 45 Min. to craft your charakters when there are action cards in the game that say: \"Roll a d10 on a 1 your charakter is just dead!\"\n5. The monter fights are epic, genius...? I can´t understand this comments??? You allways place monster in the middle and survivors arround and roll dice until one fraction dies. The first 10 times it´s cool, but nothing on it is new or tactial.\n6. Why make 1.000 gear cards??? You have to write down what all of your charaktes have, if you end a session and on the next you have to recreate the charakter sheets. Why not just make a list of gear, without cards, and just write the items / skills direct on the charakter sheet? - We did after third session... don´t the the cards!?\n7. Like the campaign on kickstarter the only goal of the core game is for you to buy more expansions to make it better. That´s not what you have promissed us Adam!\n8. Really 400 dollar??? You can buy descent second edition für 60 dollar. There are more monsters, more scenarios and better gameplay in it!\n\nI could go on like that, but i hope you understand my frustration after playing the first sessions.\n\nBut for alle those, who don´t give anything about balancing, tactics, RPG-Elements and stuff that makes most survival games great is Kingdom Death Monster the best choice! Just let all of them die, ever and ever again.",
    "timestamp": 1447023600
  },
  {
    "username": "dead_eye_dodo",
    "rating": 3.0,
    "comment": "Overcomplicated? Yes, half of its features belong in a video game or an annual tax report.\nOverpriced? Hell yes.\nOverrated? To a degree.\n\nWe did have our fair share of fun with it, but the constant \"oops, you're maimed\", \"sorry, but your best gear is on fire\", or \"you're flat-out dead, screw you in particular\" events get in the way of character attachment - the kind that automatically happens if your models have names, nicknames, partners, parents and children, specs, quirks, etc., over a two-year campaign.\n\nAnd design contradictions like that are felt throughout the whole game. Sure, you can keep track of your crafting materials with cards - unless you want to fight the same monster twice, because then they run out. Sure, you can head into a new monster fight without reading up on it to avoid spoiling the mechanics and surprises - but then your characters will die and you might potentially ruin hours of progress. Sure, you can make plans for the next five hunts to get that one interesting synergy going - but they will be shattered when the first random event is revealed and your character falls into a chasm or switches places with a stone statue.\n\nThere certainly are interesting and unique boss fight ideas, but most of them are more micro-management-intense than they are actually fun to play against. That being said, the overall design of the monsters and miniatures and the world-building in general are awesome, no doubt about it, but that alone can't really carry the game. After all these nights, I feel like I would rather be buried in a Dung Beetle Knight’s tunnel system than play another two-year campaign in the foreseeable future. And still, it was an experience I don't want to miss.",
    "timestamp": 1755468000
  },
  {
    "username": "COBOLProgram",
    "rating": 3.0,
    "comment": "Too much to be enjoyable. It hit the table once when I first got it, and now it sits mostly unplayed in a room.\n\nFor sale/trade.",
    "timestamp": 1736463600
  },
  {
    "username": "Random_bloke",
    "rating": 3.0,
    "comment": "So the more I play this the less I enjoy it.\nIt doesn't help that I roll extremely poorly when it's my turn and very high rolls when it's the monster's turn, meaning all the battles are completely one-sided.\n\nSome people seem to have enough time to play thousands of thousands of plays of this and completely abuse the system. Myself I'm having miserable experience after miserable experience everytime this hits the table. This game does not respect your time if you do not 100% dedicate yourself to it. It's overall interesting but majorly flawed in several instances, extremely repetitive, very dependant on purchasing unreasonably priced additional content, and contains too many poorly designed cards and content that has never gotten fixed and that everyone admits to skipping.\n\nUnplayable for me without bypassing the attack roll altogether, as apparently I can never roll above 4 when attacking.",
    "timestamp": 1736118000
  },
  {
    "username": "Nimeroni",
    "rating": 3.0,
    "comment": "(For context, I did nearly one full campaign, which took us around half a year. We play at 4 players.)\n\nThe combat in this game is bad. The game can randomly kill you before you even play your first turn. And even outside of that, it's dull and repetitive.\n\nIt's a shame because the town progression and gear system is interesting, the worldbuilding is cool, the game is well produced... but combat take too much of the experience for me to overlook it.",
    "timestamp": 1732057200
  },
  {
    "username": "kiwipaul",
    "rating": 3.0,
    "comment": "painful, so much money for a complicated boss battler, much easier, more fun and cheaper games out there",
    "timestamp": 1722463200
  },
  {
    "username": "doomtrain707",
    "rating": 3.0,
    "comment": "The trap cards mechanic is just not fun. The game creates build potential which actively leads you into these traps, investing your very finite resources into something that actually makes the game harder and less enjoyable. The trap cards should not shuffle back in immediately, it leads to them being triggered on every players turn in some situations. Also, the RNG card draws where your people just die is not fun. While the game does have many positive attributes, it's overshadowed by these punishing and not fun mechanics. Our group got fed up after 3 sessions or so and we just quit, never to return.",
    "timestamp": 1695765600
  },
  {
    "username": "Housticus",
    "rating": 3.0,
    "comment": "really wanted to like this but turned out to be as dull as dishwater. Along slog of a set up. A weird random encounter thing followed by a random and soul crushingly difficut boss fight.\nI cant really put my finger on whats wrong with it because on paper it should work. Trouble is it just doesnt. Its dull , long and no fun at all.\n\nIm guessing like most games it has its fans who will defend it but its not for me. And lets not even talk about the price tag",
    "timestamp": 1680040800
  },
  {
    "username": "jjjooonnn",
    "rating": 3.0,
    "comment": "Game is ruined by bad rolls, screw you on purpose mechanics, and player down time.\n\nBoss miniatures are overpriced and most the time, stayed in the box.\n\nThe game board is essentially useless, aside for a place to count spaces and place obstacles.\n\nCharacter sheets are horrible, why use paper/pencil when it changes every turn? Good luck remembering what stats change when your eraser sucks.\n\nGlad I got to try it before ever considering it, way overpriced. $400+ is just sad. I hated it.\n\nRated 3/10 because boss mechanics are interesting -not fun, but interesting.",
    "timestamp": 1677798000
  },
  {
    "username": "Lephise",
    "rating": 3.0,
    "comment": "Good game, extremely hostile business practice",
    "timestamp": 1674601200
  },
  {
    "username": "RollForInitiative",
    "rating": 3.0,
    "comment": "A giant \"Boss Battler\" which suffers of various flaws : miniature arrive onto sprues, if you are not into glueing and modelling this is not for you since you'll need weeks before you can even start playing. Repetitive as hell, you can feel the grind nausea after 6 or 7 missions due to facing same bosses for resources over and over again. Rougelite playstyle which for a a campaign taking up to 60-80 hours is a no go, frustration to be planned. Not real coop multiplayer, the roles in the group are so tight that personalisation is not an option you need to min max. Luck component too high.",
    "timestamp": 1661637600
  },
  {
    "username": "Naouak",
    "rating": 3.0,
    "comment": "Tried out with the TTS mod.\n\nIt's fun for a few games but the randomness of the game is not making it a nice experience.",
    "timestamp": 1660773600
  },
  {
    "username": "deveh",
    "rating": 3.0,
    "comment": "Shows bare breasts, but can't show nipples, is publisher the white lion who lost his balls - goes out of their way to show breasts and hide nipples. What's up with that? And \"sex sells\" is something that 2006 marketing did, glad in 2016 game board designers caught up and are selling hentai figurines to neckbeards.",
    "timestamp": 1641942000
  },
  {
    "username": "Carter_Burke",
    "rating": 3.0,
    "comment": "Cardboard Reality Podcast call KDM one of the most overrated top 100 games for reasons I’m inclined to agree with:\n\nhttp://cardboardreality.libsyn.com/episode-56-get-outta-here...\n\nThere’s a reason 50+ people have this for sale on the geek market. :-/",
    "timestamp": 1641078000
  },
  {
    "username": "bneffer",
    "rating": 3.0,
    "comment": "Upon reflection, this is a grind of a game. The only entertaining parts are learning the combat system, and seeing what happened to you. But the random TPKs and and imbalance combined with the length of plays and actual grinding make this a game I will not be playing again. The story is also fairly weak and leans hard on just being 'weird' rather than well written.",
    "timestamp": 1635980400
  },
  {
    "username": "mmazala",
    "rating": 3.0,
    "comment": "If this is your kind of game (lots of dice, lots of stats, tons of theme) and you ignore the problems with the math, then you'll probably love Kingdom Death: Monster.\n\nI loathe games that I classify as Dungeon Accounting - I roll the dice, I check my stats, no wait add in this stat, and don't forget the modifier on this stat - and therefore I found this game to be a miserable experience. It reminded me of why I became a math minor instead of a math major - I got to a point where I exhausted the limits of my understanding and just couldn't fake competency any further.\n\nIn the words of Dr. Kita, who introduced me to the game: \"I can say that I've done it. And depending on how much I like the person asking, I can tell them what I thought.\"",
    "timestamp": 1633557600
  },
  {
    "username": "Ahellion",
    "rating": 3.0,
    "comment": "This game's great, if frustrating mechanics are let down by wildly inconsistent theming. One minute your fighting an enemy capable of warping time and space to age your characters out of existence, the next second it's sphincter explodes and suddenly your survivors are feasting on its droppings. That isnt an exaggeration - that literally happened when I was playing this game. Then you flip a page and you're faced with softcore rape porn. This game goes from genuinely terrifying to cringey toilet humor to misogynistic eroticism so quickly I have to imagine it was written by an angsty teenager.",
    "timestamp": 1615071600
  },
  {
    "username": "juuzzom",
    "rating": 3.0,
    "comment": "Beautiful production with pretty miniatures and exciting background story distilled into tactical fighting game on oversized board. Should be played as campaign, but that appears to be super repetitive. The game tries to be something more by adding the mechanical aspect of character development from tabletop rpgs and by having players develop a settlement. The settlement is however only some cards next to the huge board and what also reminds of rpgs is the constant consulting of the game book for die rolls. The monster AI has been done pretty neatly which is great because that is what makes the game have sense.",
    "timestamp": 1614207600
  },
  {
    "username": "GKoutentakis",
    "rating": 3.0,
    "comment": "A dice choose your adventure activity with a few game elements during the \"settlement\" phase. The only redeeming point of this is that I got reunited with an old friend from the university by playing this online during the quarantine",
    "timestamp": 1600552800
  },
  {
    "username": "codinh",
    "rating": 2.5,
    "comment": "Overhyped game. If you look past the shiny miniatures and the voluptuous female protagonists it's just a dice chuck fest.\nEvery game you roll dice and roll dice and roll dice just to see if you survive (it has the horrible mechanic of double dice rolling, typical of all miniature wargames: roll for hit and roll for damage, so you increase dramatically your chances to fail). Very little strategy involved and not that much of a game behind it. Interesting lore, for sure, but for such a pricey game it's not worth it. Buy it only for the minis, don't expect much beyond that.",
    "timestamp": 1569880800
  },
  {
    "username": "cotnob",
    "rating": 3.0,
    "comment": "Really didn't enjoy this game",
    "timestamp": 1560722400
  },
  {
    "username": "Droidtrooper",
    "rating": 3.0,
    "comment": "I only played a single session. But it was an incredibly lack luster combat simulator. It has tons of nice miniatures, but painting isn't my thing.",
    "timestamp": 1557957600
  },
  {
    "username": "Winter1338",
    "rating": 3.0,
    "comment": "Game is overly repetitive and overpriced. Hope you like going to the rule book non stop.",
    "timestamp": 1555365600
  },
  {
    "username": "Gaertner3031",
    "rating": 3.0,
    "comment": "Überproduzierter Ameritrash Schrott.",
    "timestamp": 1550530800
  },
  {
    "username": "hart3856",
    "rating": 3.0,
    "comment": "Overall bad game, great minis. To random and if you work on your survivor there are random encounters that “ground opens up and eats you!” I don’t mind dice in a game but this game and it’s totally unplanned randomness is a huge distraction to overall enjoyment.",
    "timestamp": 1540245600
  },
  {
    "username": "Mylon",
    "rating": 3.0,
    "comment": "Highly produced, poorly balanced. Many events are just random \"Lose a character\", which wouldn't be so bad if there was stronger narrative behind them and population wasn't such a limited resource. Power levels are all over the place. The entire game feels like a roguelike played in slow motion.",
    "timestamp": 1538172000
  },
  {
    "username": "Jeff",
    "rating": 3.0,
    "comment": "Yowsa. Talk about Kickstarter hype. At its core it's a mediocre skirmish game. At a non-ludicrous price point, it might be unremarkable at best. At the pricepoint it's garnishing, the game is a mindboggling example of FOMO (fear of missing out) and Kickstarter mania / hype. The out of combat settlement / campaign setting is compelling, but while it remains wrapped around such a dull skirmish game, it's not worth the dollar or time investment.",
    "timestamp": 1519599600
  },
  {
    "username": "winston91",
    "rating": 3.0,
    "comment": "Way too random for my liking.",
    "timestamp": 1514934000
  },
  {
    "username": "ovis",
    "rating": 3.0,
    "comment": "After hearing tons of (controversial) stuff about the game, I surprisingly had the chance to play the copy of a friend of a friend for a few \"years\".\n\nSo to get the theme/artwork part put of the way: I'm in general not huge on the horror theme, but afterall the general idea of fighting through and building somewhat of a society in this really horrific world actually isn't too bad and somewhat interesting and initially I even didn't mind some of the (let's call it) more \"mature\" parts, but after a while I personally found a lot of things to be on the \"teenagers faking their IDs to pretend they are of full age\" matureness level, which is unfortunate, because it pushed it over to the silly side for me.\n\nDespite hearing a lot about theme/artwork, I didn't actually know much about the gameplay and when tought the general idea and structure of the game I was REALLY intrigued. Slowly building up a civilization with resources you get from hunts and the RPGness of the whole thing just is a great concept.\nUnfortunatly in the end the gameplay had a similar impression on me as the theme: I started to be convinced by it as there are a lot of individual interesting things in there (the general idea to first hunt and then fight the monster and eventually use the resources to build up your settlement and gear, the AI cards of the monsters in the fight, the characters gaining abilities but also injuries and other flaws and probably lots of other small things i might be forgetting now) BUT eventually the game didn't really work for me when all of it came together. There was too much fiddlyness, randomness, repetition, grinding and \"rock falls, you die\" annoyance and too little actual choices. I actually kept thinking that the more interesting abilities and variation is on the part of the monster, so I almost got annoyed by the fact that it somewhat feels like \"the game\" itself is actually having more fun playing than me (which would be fine if the game would pay tons of for me to play, but if I do by a game, I kind of expect to have more fun than the cardboard).\n\nI've noticed that since I'm playing DnD on a more regular basis, games that try to emulate an RPG without a DM in boardgame-form fall flat for me maybe more now than they did before, because it just doesn't compare to the experience and in many cases it just makes me want to play either a \"pure\" boardgame or a \"pure\" RPG but not a weird mix of both.\n\nSo maybe the best way to express my thoughts on the game are speaking of it in terms of an actual RPG. Because it feels like my problem with KD:M is that you actually get two things in that box: An RPG system and a DM running that system. And while I think that I might actually enjoy the system itself quiet a bit, the DM that comes with it is just really horrible (focusing on the wrong parts of it, dragging out the least interesting parts and having a rock randomly fall on you whenever he needs to go and get a drink - and you better drink or the \"mature jokes\" get old very quickly).",
    "timestamp": 1499551200
  },
  {
    "username": "serverdude1",
    "rating": 3.0,
    "comment": "I like the cooperative element in the game but it is very difficult to progress and move forward.",
    "timestamp": 1482966000
  },
  {
    "username": "Flyboyman",
    "rating": 4.0,
    "comment": "Saw this game was in the top 100 and am on team \"it's not a good game\". Those of use who have played it know what it is and cheers to those who enjoy it. The ultra-horror theme is done well if you're into that kind of stuff. I have played 3 sessions of a campaign and find the gameplay and found it to be very repetitive and unrewarding. There's too many other games out there to waste my time on.",
    "timestamp": 1741302000
  },
  {
    "username": "Mystic_Mouse",
    "rating": 4.0,
    "comment": "Lost my campaign with the Twilight Knight in Training variation in a couple dice rolls before I even had a chance to move my characters. Shortest campaign I've ever played. These minis need almost as much green stuff to fill in the cracks as they do patience for the tiniest pieces I've ever seen to glue in place. This has a very good civ build to it, and the short hunt stories before the boss showdown are random but interesting. At any point a character will just die in a terrible way. For masochists, what's not to like? Personally, I'd rather smear my genitalia with fish paste and dangle it in a pool of hungry piranha.",
    "timestamp": 1719093600
  },
  {
    "username": "gian9959",
    "rating": 4.0,
    "comment": "It tries to be a lot of boardgames all at once and fails to be good on most of them.\nA lot of the game is just a random gamebook with random events and it gets boring quickly.\nDifficulty is very artificial, the game tries so hard to be hard and forgets to be fun and challenging.\nThe art is awkward and the atmosphere of the game ambiguous. The game is full of drawings of half naked women (but almost no men) that feel inappropriate with the dark atmosphere of the setting. The text of some cards tries to be funny with very immature humor and makes everything worse.",
    "timestamp": 1693087200
  },
  {
    "username": "jteslow",
    "rating": 4.0,
    "comment": "A real luckfest mess. Played it eight times. Had some fun, but everytime I play I look forward to playing it less. Some cool moments sure, but ultimately not for me.",
    "timestamp": 1691618400
  },
  {
    "username": "brapsmagic",
    "rating": 4.0,
    "comment": "there's some stuff to like but at the end of the day, the mechanics boil down to (mostly) unmitigated dice chucking which is made worse by the fact that the odds are always slanted heavily against you.",
    "timestamp": 1691359200
  },
  {
    "username": "Mayasty",
    "rating": 4.0,
    "comment": "This game is (nomen omen) real monster. With so many rules the only way to learn it smoothly is to read small portions of the rulebook and play them through immediately as proposed by the designer. Now I understand why none part of the rulebook is available to download from the internet. The rulebook is a mixture of campaign story intertwined with the rules on almost every page. So reading it before playing would have likely spoiled the fun.\n\nIt’s then the first game ever, I started playing without any knowledge about it. So first hour it was mostly reading and rare playing. The „First Story” episode went smoothly as we were being guided precisely by the rulebook. But the first regular episode „White Lion” was not that well guided. The rulebook left us in the middle of nowhere and only thanks to our mate who aleady did that part in the past we could go ahead. So the read & play concept of the rulebook is fine but it’s real shape is not as good as it should be.\n\nThe upkeep is horrible, longer than particular actions and to my taste spoils the fun. Tons of rules make this game unplayable for me. Besides after 2nd session in the campaign I see the game becomes too repetitive around the scheme: Settlement Phase, Hunt Phase and Showdown Phase. The more heros’ power, more weapons along with linear growth of monsters on the other side is something that can’t grab my attention for longer time. I had the same with „Gloomvaven Jaws of Lion”. The consecutive episodes were so repetitive that I didn’t finish the campaign being already bored enough with very predictible events. On the opposite side is „Cthulhu Death May Die” which is pure essence of the dungeon crawler combats. Fast and easy slaughter with minimum rules needed to deliver maximum fun.",
    "timestamp": 1684360800
  },
  {
    "username": "alepsycho",
    "rating": 4.0,
    "comment": "This game is so amazing, the battle system is nothing special, other games make good use of the monster intelligence, and this game makes a great job in this part, but nothing that draws too much attention.\n\nThe great part of this game happens when you return home from your hunt, that is when the magic happens, events and milestones that trigger in certain circunstancies put the players into a lot of interesting and philosophical choices that I didn't see in other games.\n\nThere is a great care in a lot of details, for example if a characters is deaf he is not affected by noisy events and a lot of connections that make sense.\n\nThe environment of this game is fascinating, great job. The only downside is that this game is absolutely expensive and, for me no game is worth so much.",
    "timestamp": 1679266800
  },
  {
    "username": "Clads",
    "rating": 4.0,
    "comment": "Kingdom Death Monster (KDM) is the originator of the Boss Battler Board game genre. The Boss Battler genre is basically Demon/Dark souls video games in board game form. Difficult and punishing. The game is broken up into 3 parts. The town phase, chase phase, and encounter phase.\n\nThe town and chase phase are great. Building your little village and gear with items you collect from defeating bosses. Chase phase is a little cat and mouse game which is just a little extra phase that adds to the hunting of the monster. The atmosphere and world that KDM provides is elite.\n\nThe problem for me with KDM is the actual boss fighting. The unique deck construction of the monster is great. Breaking body parts off the monster and affecting their future attacks is great. The issue is that the fighting is just boring. I should note I played with 4 people. Each with 1 character. I think if I had to go back the fighting portion of the game might be better if I played solo or atleast with 1 other person. It just takes too long for your turn to come around again. One can’t help feelings of boredom creep into your consciousness. Going into the game I thought it would be difficult. The game is punishing. But punishment and difficulty are not the same thing. I have nothing against the punishment of KDM. The difficulty of the monsters didn’t help alleviate any boredom. I could walk away from the table for everyone else's turn, come back and do my turn, and that's it. Not much thinking required.",
    "timestamp": 1674687600
  },
  {
    "username": "edgeseeker",
    "rating": 3.5,
    "comment": "The designer makes this game way worse than it could be.",
    "timestamp": 1665093600
  },
  {
    "username": "Lazylion",
    "rating": 4.0,
    "comment": "Overhyped. Seems like a great oncept but way too grindy and random.",
    "timestamp": 1665007200
  },
  {
    "username": "whoare",
    "rating": 4.0,
    "comment": "I don’t mind dice and I don’t mind randomness, but there is far too many event that can have significant influence on your settlement that it’s not actually that much fun.\n\nIt’s a bit like Dark Souls in that the ‘boss’ fights are great, but the rest of it, not so much.\n\nMinis are good, but can look really static and awkward with the lack of pose options.\n\nCould probably gain quite a bit from the implementation of an app to handle the settlement aspects.\n\nSadly, I do regret purchasing this game, as it’s just not that great.",
    "timestamp": 1647126000
  },
  {
    "username": "fraenrico",
    "rating": 4.0,
    "comment": "Putting the \"trash\" in Ameritrash.\nLiterally, everything bad about American games condensed in one product.\n\nThe game can be very fun at times, but it is dramatically unfair, based on pure randomness and a hell lot of book-keeping. A total lack of player agenda. The art design is very amateurish (and tacky), and the combat (most part of the game) is actually quite bland and repetitive.\n\nPlayed on TTS.",
    "timestamp": 1646521200
  },
  {
    "username": "Gethar",
    "rating": 4.0,
    "comment": "Needs house rules to make it playable, so I can't give it a great rating. With house rules it's closer to a 7.",
    "timestamp": 1644447600
  },
  {
    "username": "Kerrz",
    "rating": 4.0,
    "comment": "Massively overrated game. full of gotcha moments, with little to no mitigation (i.e. oh you rolled a 10 on a random table instant death)\n\nBase game suffers from limited hunts which get old fast.\n\nSettlement and hunt track feel tacked on as a way to get you to the next showdown.\n\nArt style is laughably in the vein of 14 year old trying to be edgy, i.e. look at this i put a penis and breasts on this model everyone will think i am so controversial.\n\nTBH i don't know why i keep it, any time i feel the urge to give it another go i find myself getting board of it in earlier and earlier game sessions.",
    "timestamp": 1641855600
  },
  {
    "username": "bearn",
    "rating": 4.0,
    "comment": "The game itself leaves a whole lot to be desired. It's just not very good but there is a reason for this if people actually decided to look into it further. The game is actually older than the 2015 date listed on BGG. It was on KS in 2012 into 2013 for funding. Most games from that time on KS were all flash and no substance. They were essentially peddling miniatures and not much more.\n\nThis is more art than it is a game. IF you are buying this for some kind of gameplay experience you are going to be disappointed.",
    "timestamp": 1636844400
  },
  {
    "username": "Kent",
    "rating": 4.0,
    "comment": "Overly detailed and convoluted. Over-produced and a ridiculously big box. Thematically complicated but shallow and dull game play. Virtually no in-game artwork.",
    "timestamp": 1630101600
  },
  {
    "username": "Growal",
    "rating": 4.4,
    "comment": "A luckfest with good atmosphere, great miniatures and overall good components. A lot of great details but very little strategy and tactics - many decisions are made by dice. Including instant death while performing actions, which you didn't want to perform. Not very complex, but often complicated, although in the end dice decide 80 % of the game.",
    "timestamp": 1619733600
  },
  {
    "username": "ryansmum2008",
    "rating": 4.0,
    "comment": "Not for Me",
    "timestamp": 1618783200
  },
  {
    "username": "iadena",
    "rating": 4.0,
    "comment": "Don't buy. Too graphic, brutal, and dark.",
    "timestamp": 1615071600
  },
  {
    "username": "AbyssalStalker",
    "rating": 4.0,
    "comment": "Satan level pledge, add ons, many promo figures from web store as well",
    "timestamp": 1612566000
  },
  {
    "username": "Erotikkorsar",
    "rating": 4.0,
    "comment": "Beautiful Artwork, great Narrative and promising ideas - Unfortunately, the idea of a \"hard\" game is basically to memorise AI cards and Wound card behavioral patterns of the bosses to mitigate pure randomness by d10. This is unfortunately not \"hard\" but just a timesink for \"learning\" - If a game punishes me for making mistakes or pushing my luck to far - that's one thing, but this game punishes you for not knowing stuff it hasn't showed you yet and rolling badly.",
    "timestamp": 1609282800
  },
  {
    "username": "bullno1",
    "rating": 4.0,
    "comment": "Too much book keeping",
    "timestamp": 1600034400
  },
  {
    "username": "Niallcam",
    "rating": 4.0,
    "comment": "Played via Tabletop Simulator - and I'm glad I didn't spend money on this game. I really like the emerging stories that can come from the game, and the world is super interesting. I really dislike high chance of random death in almost every situation leaving me and my group feeling cheated.\n\nArt: Pretty good; more consistency would have made this beautiful.",
    "timestamp": 1571176800
  },
  {
    "username": "Hornauer",
    "rating": 4.0,
    "comment": "I rated it higher (an 8) when we first started our campaign. But I realized more and more that a) I don't like overly long campaigns and b) I am first and foremost a mechanical player. Almost everything in KD is a D10. Yes, I understand that with knowledge about the behavior pattern of the various monsters and the campaign events, you can plan what to hunt and how to equip your survivors much more effectively, thus increasing your chances. Of course, it is not all luck. And don't get me wrong, I have no problem with luck in games.\n\nUltimately, KD is long, repetitive and random. Points (1 - long) and (2 - repetitive) I despise, especially when they occur together. The high amount of randomness might be fitting for the world of KD and at first even lead to silly/amusing results, but at least for me, it soon breaks down into frustration.",
    "timestamp": 1570831200
  },
  {
    "username": "RandomLetters27",
    "rating": 4.0,
    "comment": "Needed an editor to refine into something more playable.",
    "timestamp": 1568671200
  },
  {
    "username": "thereck",
    "rating": 4.0,
    "comment": "One thing that will kill a game for me is degenerate rules. Instantly before a hunt, you can literally just get flat out killed by a d10 roll. Guess what, no one is bring someone over for a 4 hour game and saying “yah you died on one dice roll you were forced to take, sit there and drink my bear for the next two hours while we play.\n\nSo the game is a complete bullshit degenerate mess. The monster fighting is fairly weighty, burn not engaging. It feels epic and the game invites people who will get drunk and high five, so it can be a great time.\n\nBut, here’s the thing, I think most people are just happy to try a 400-$1600 dollar game at all, it’s mechanically quite sparse, the story telling is fairly interesting, the models can get super sexist and lead to it being a Game only men play, and it’s really to long and repetitive for most owners I know to have finished a campaign and really use the dozen expansions that are out.",
    "timestamp": 1558821600
  },
  {
    "username": "vikings40",
    "rating": 4.0,
    "comment": "Sadly, a very mediocre game.",
    "timestamp": 1541977200
  },
  {
    "username": "-Johnny-",
    "rating": 4.0,
    "comment": "The story & mythology is pretty nice, but the gameplay is trash. Clunky & unintuituve mechanics, minimal interesting decision making, repetitive play patterns, extremely unpolished feel.",
    "timestamp": 1531087200
  },
  {
    "username": "deadwing",
    "rating": 4.0,
    "comment": "World building is really cool, but the combat absolutely do not do it for me, especially in a world where Gloomhaven exists.",
    "timestamp": 1523743200
  },
  {
    "username": "antiussentiment",
    "rating": 4.0,
    "comment": "Nice bits (or tits) but awkward and very unwieldy. Adam probably should have employed a writer to help him develop the story.\n\"Never has punching the balls off a lion produced so much paperwork..\"",
    "timestamp": 1510614000
  },
  {
    "username": "ZoeyWP",
    "rating": 4.0,
    "comment": "I played this on TTS and MY GOD the randomness. The game is fine until you get to the first hunt and have to roll a d% to figure out what horrible bull crap that happens to you. Almost all of which could end up being Nothing.\nAny fight that we ended up in after about the second was a cake walk. it was just the Random FUs that the game threw at you over a die roll.\nThis game cost to much to have the same basic game play as a random loot table from the much better RPG it could have been, but wasn't.",
    "timestamp": 1492466400
  },
  {
    "username": "Luds",
    "rating": 4.0,
    "comment": "This is basically an overproduced D&D without the need of a Dungeon Master. It simply isn't my type of game.",
    "timestamp": 1469743200
  },
  {
    "username": "soccastar001",
    "rating": 4.0,
    "comment": "I won a copy of this game through one of the BGG quiz contests. The game was on my radar already because I frequent Kickstarter and it got a lot of buzz for the amount of money this project raised. If not for winning the contest though I may have never played this game, it is not something I would even call a board game. It isn't marketed or geared towards boardgamers, which is what I am, and in that vein it is a big miss for me.\n\nThe game is prohibitively expensive for a board game. For miniature gamers perhaps this is not the case but this game tries to merge those two worlds and at least from a boardgamers perspective I have very little interest in the building and painting of admittedly EXTREMELY high quality miniatures, I'm interested in the game I get to play with them and there are very few games I want to spend that exorbitant an amount of money on.\n\nBut I won the game so the amount of money I spent for it is 0 so why the complaint...For me it is lack of content. The gameplay isn't bad, it is almost RPG combat where you roll dice to overcome defensive values and the AI deck that controls the enemies is nice. The settlement phase is a neat addition and I like the idea of harvesting enemies for the materials to make new equipment. But you don't get many scenarios to play or enemies to fight in this basic game box. For the price most people have to pay you have to really REALLY be in love with the miniatures for that. And I'm not going to pay the cost of the expansion content when I'm not that interested in the miniatures to play more. This reminds me so much of Myth, another Kickstarter juggernaut, that seemed to be selling their miniatures with a poorly planned game behind it.\n\nAs for the game component quality. While the art and the miniature are very high quality they are very off-putting. I don't mind the nudity and sexual content, I like being titillated, I bought a terrible game called Lap Dance after all. It's the more gruesome elements that have me not wanting to look at it...which is the antithesis of your goal when your artwork or miniature quality is this beautiful. I'm baffled that they included such high quality miniatures and then such poor quality cardboard tokens in the box. If you are going to have this kind of quality and price tag for a game those tokens should be made of a material besides cardboard.\n\nI just think this game misses the mark among a board game crowd. I wouldn't buy this game most of the time or have a reason to write these comments. But I did have a copy and tried it and those are my opinions based on my perspective as a gamer. You need to keep me interested in a game in ways besides gluing and painting plastic.",
    "timestamp": 1456441200
  },
  {
    "username": "indusguys",
    "rating": 4.0,
    "comment": "I just can't get over the fiddly nature of this game, totally wrecks any sort of flow this game might have. Checking the rule book every few minutes, changing boards, writing down info, erasing info, just too much \"work\". When I play a game I like to have fun, make fun decisions and get immersed in the gameplay. This game almost does that but ultimately falls short. If there weren't so many ambiguities with the rules I might have been able to get past this. What a bummer, $680 Canadian and now I have the most massive box on my shelf that I will likely never play again. I would stay away from this game and play the 100's of other games out there that are much much better!",
    "timestamp": 1454194800
  },
  {
    "username": "elricwulfgar",
    "rating": 5.0,
    "comment": "I was really excited about this game with the beautiful artwork and the amazing concept that it appeared to be... until I saw the cost. I missed the Black Friday sale, and even at $200, that is a steep entry level. This is like a GamesWorkshop-esque investment (Warhammer and 40k). There are a LOT of great games out there that don't cost $1,000 to get into. It is too bad, because I really would have enjoyed giving the game a try. If the new trend in game design is income level elitism, I'm out. I'll wait and see if it ever goes broader than the few that can afford it. If not, plenty of other games to play.",
    "timestamp": 1752444000
  },
  {
    "username": "Tygrone",
    "rating": 5.0,
    "comment": "Amazing world-building.\nVery very dark setting.\n\nGameplay and campaign-wise though, other games do it better. The combats are quite grindy too and you might still end up without that one piece you need to craft something with.",
    "timestamp": 1740006000
  },
  {
    "username": "GIBraag",
    "rating": 5.0,
    "comment": "Game is a potential 10. Way the game has been supported / 1.5 kickstarter handled a definite 1.",
    "timestamp": 1734476400
  },
  {
    "username": "FinalKefka",
    "rating": 5.0,
    "comment": "An adult-themed pen and paper in a box with emergent gameplay. Genre defining, but aged poorly.\n\nHas the potential to be a 10, but all the goodness is undermined by poor rulebook layout, fiddly-ness, and the severe consequences of the randomness. A single 1d10 or 2 can have game ending consequences 10-20 hours in, making this game very grindy. In addition, there is almost no dice mitigation, so roll good, metagame/cheat, or die. You can alleviate grind by spending $100-1000s on expansions, but you could also just buy better games.\n\nThe developer evergreens the game with update packs you need to better/fix the game. However, the only upgrade pack available is 1.5->1.6. As an owner of 1.0, I am hosed. This feels like Star Citizen's financial startegy in board game form.",
    "timestamp": 1725228000
  },
  {
    "username": "kaepone",
    "rating": 5.0,
    "comment": "Conceptually an interesting game. Start with pretty much nothing and build your colony of survivors. Over time go out and defeat more monsters to improve your civilization. The combat is a big part of the game and unfortunately just wasn't very interesting. Where it loses me though is the theme. It's just unnecessarily graphic and comes off as immature or comical, taking away from the immersion. And cutting minis off sprues and assembling them? Forget about it.",
    "timestamp": 1724277600
  },
  {
    "username": "HouseofDungeon",
    "rating": 5.0,
    "comment": "so weak in narrative very disappoint , the game more very expensive than other board game and give a kid story book in the box. why?\n\nbut battle is very fun i go to check 5",
    "timestamp": 1722895200
  },
  {
    "username": "MisterC",
    "rating": 5.0,
    "comment": "Festival of randomness. White Lion killed us all and this was quite interesting. During the second run one of advetureurs threw a rock. Critical hit and HL card says to roll 1d10. With the result of 10 the lion died instantly. That's it? Seriously?",
    "timestamp": 1717884000
  },
  {
    "username": "adel9591",
    "rating": 5.0,
    "comment": "One play only, felt pretty repetitive, and as many have pointed out, unforgivingly random. Interested to see if the settlement phase does anything for it, or if the game gets more strategic with later plays.",
    "timestamp": 1702767600
  },
  {
    "username": "DuppsQC",
    "rating": 5.0,
    "comment": "Gloomhaven + D&D + a lot of the randomness of a \"you are the hero\" book",
    "timestamp": 1697752800
  },
  {
    "username": "Gendedwend",
    "rating": 5.0,
    "comment": "2 showdowns solo on TTS. Imho, too much boring rolls, too expendables characters. May be, IRL in good company is better experience, this is why not 4-5.",
    "timestamp": 1690840800
  },
  {
    "username": "maximusGG",
    "rating": 5.0,
    "comment": "Game is ok. Slow progression is not everyone's cup of tea. If you include a few expansions the game becomes better but also even more expensive. The base game is way too grindy for my taste. And after killing the white lion the 10th time, you just put everything away and say goodbye.",
    "timestamp": 1678230000
  },
  {
    "username": "mochinac",
    "rating": 5.0,
    "comment": "Bloated production. Nice components. Overly expensive. Subpar and repetitive gameplay. town building aspects are nice but hunts get old fast.",
    "timestamp": 1674428400
  },
  {
    "username": "Starcadian",
    "rating": 5.0,
    "comment": "Dark and brutal game, but very intricately done, almost too much so. It's true when people say that the learning curve is steep, that you shouldn't get attached to your characters, and that you are bound to forget rules while playing. After about 15 hours of this, I needed to pack it away for a bit and play something lighter. It's psychologically challenging.",
    "timestamp": 1672527600
  },
  {
    "username": "phildoh8",
    "rating": 5.0,
    "comment": "Love it or hate it. If this is a game for you, then you need a lot of time to spend on it to get the full effect. Sadly, if you put all the time and money in it and it turns out you don't like it, then that sucks. So, while it's a top game for me, I would never tell someone to buy it. Do research, then forget about it, then research it again, then if you still think it's for you, then buy it.",
    "timestamp": 1671922800
  },
  {
    "username": "tjl200",
    "rating": 5.0,
    "comment": "I actually somewhat enjoyed the gameplay. We only played the first round. But the story is overly gruesome, not for me.",
    "timestamp": 1654380000
  },
  {
    "username": "Beckikaze",
    "rating": 5.0,
    "comment": "Ersteindruck: https://www.youtube.com/watch?v=p2Y22vF3660\n\nWarum es gehen musste: https://www.youtube.com/watch?v=5kCjGokCeQc",
    "timestamp": 1647903600
  },
  {
    "username": "kartoffelopa",
    "rating": 5.0,
    "comment": "Solid but not that great.\nPlayed 4 campaings with different modules so far.\nManaging stuff is really really tedious.\nThe game introduces a core gamplay loop of three phases (fight, manage city, search for next monster)\n\nContent is modular, but changing some parts of the game does not give it much replayability. Once you figured out the best strats and know most events it has not much value to play it again.\n\nRules are horribly wonky and unclear. It is just a complete mess.\nArtwork is good but too much sexualized. Every woman in the artwork must have gigantic boobs almost no clothes.\n\nRandomness is extremely high. Balancing is a mess as well.\n\nThe selling strategy in expensive small parts that take several years of waiting is horrible as well. Total price tag is completly out of line for the amounf ot content you get.\n\nIt is less than a 99$ Gloomhaven but costs you 2000$ and beyond.\n\nAlso there is a great tabletop simulator mod where you can play it for free with friends and most setup is handeled automatically.",
    "timestamp": 1642460400
  },
  {
    "username": "jellypantz",
    "rating": 5.0,
    "comment": "This is my brother-in-law's game and he is willing to do all the heavy-lifting almost like a DM who's also playing, otherwise I would not go near this monster. Otherwise, I've enjoyed the first couple plays with him running it.",
    "timestamp": 1638054000
  },
  {
    "username": "StalkingButler",
    "rating": 5.0,
    "comment": "Played for like 15 hours with 2 players on TTS. What even is this game? It's incredibly fun and it's incredibly frustrating. It's has some of the most unique ideas and mechanics I've seen in a game, and you might spend half the game trying to figure out the actual rules for certain interactions. It's got great, epic, dramatic battles that you end up grinding out over and over again, robbing them of what engrossed you in the first place. It's god big-ass detailed minis and a lot of art, but a lot of it is pretty uninteresting. It's got great storytelling and even pretty capable writing for a board game. It costs approximately 1 million dollars and will take up all your board game time.\nAfter playing 7 years into a campaign, I think it's unlikely that I'd want to ever play again. There's so much to like here, but ultimately I just can't see myself doing the chore of grinding out the beginning of the campaign over again as my settlement goes down to random terrible things happening. If the game cost less money, if it had a real wiki that clarified rules and interactions, and if there was far more monster variety (and mechanics that push you to fight different monsters rather than the same over and over), then I think this game would be for me. I love the settlement stuff and some of the battles. But there's too much here that just doesn't work.",
    "timestamp": 1622498400
  },
  {
    "username": "pallazzo47",
    "rating": 5.0,
    "comment": "- Meh. I don't think \"Boss Battle\" games are my thing.",
    "timestamp": 1621461600
  },
  {
    "username": "realfist",
    "rating": 5.0,
    "comment": "The components are great, and if you are into plastic minis these are outstanding. Seems they builds are very well done, and while appearing difficult especially identifying certain pieces that lends to the great process of building the models.\n\nThe gameplay offers decent tactics, while there are a deep rule set mostly it’s 10% of the rules 90% of the time ... just need to keep track of the details. The monster AI is a ton of fun ... and deadly.\n\nTons of content. Lots in the making. very late to the party ... delays ...",
    "timestamp": 1619128800
  },
  {
    "username": "shugiosha",
    "rating": 5.2,
    "comment": "To boggy. Not very streamlined. Best part of game is townbuilding, however the components for it are big, clunky and a challenge to use without becoming cluttered",
    "timestamp": 1614294000
  },
  {
    "username": "Mad T",
    "rating": 5.0,
    "comment": "Originally I rated this as an 8 but after a while the grind gets old and showdowns take too long and don't have very much player interaction",
    "timestamp": 1606863600
  },
  {
    "username": "stvnritch",
    "rating": 5.0,
    "comment": "I have to keep this review in the middle at a 5 because at this point I find myself questioning if the game even exists or if its the El Dorado of board games where I will spend my entire life searching for it just to wind up wasting away in a desert somewhere never having actually set sight of the mysterious item im searching for. I really want to play this game but it is super exclusive and not readily available especially around where I live and the copies you cant find are astronomically priced for a board game. Rating will probably go up if and when I ever get to sit down and play it but until then ill keep prodding through the desert searching.",
    "timestamp": 1605135600
  },
  {
    "username": "AZrugger",
    "rating": 5.0,
    "comment": "Cool ideas, but I just don't see this being something that I could play long term. It's a bit too \"gamey\" to be an RPG, and a bit too narrative to be a game.\n\nI'm just... really not into co-ops.",
    "timestamp": 1593554400
  },
  {
    "username": "Sr_Moreno",
    "rating": 5.0,
    "comment": "Repetitive combat with very limited tactics. Settlement phase offers many ill-defined choices. Mechanics in both all too often come down to “roll a dice and take your chances”.\n\nModels are well made and designed.",
    "timestamp": 1571608800
  },
  {
    "username": "O Dinas Powys",
    "rating": 5.0,
    "comment": "Played three games now and can't decide if I like it or not, but CRIVVENS does it take ages to set up, **LOTS** of table space and ages to play!\n\nSome of this might be down to unfamiliarity, but ...",
    "timestamp": 1568930400
  },
  {
    "username": "Bulwyf",
    "rating": 5.0,
    "comment": "Waaay too expensive for what it delivers. It's a neat game and if you're into miniatures, you'll love it. That price tag tho, brutal....",
    "timestamp": 1563487200
  },
  {
    "username": "Greywolf2001ca",
    "rating": 5.0,
    "comment": "This is one of the most overrated games on Board Game Geek. People think because that awesome miniatures makes a game good. Sorry, but good mechanics, fluidity and fun makes a game good. KDM lacks fluidity and has a few major flaws in game design.\n\nEven though the game seems to be an arena-like one, it is still interesting and worth trying... although, the price it will be at will be ridiculously high due to the great amount of miniatures unfortunately. \n\nGave it an 7 due to its replayability (especially if you add many different monsters and expansions in the main box) but less than a 10 due to the fact that it's a repetitive arena-like game.\n\nAlso, I removed a 0.5 because there are a few features that can be replaced with cards like the tables mentioned in the videos.\n\nEDIT : The worse part of this game is all the keywords that you need to refer to the manual to know what they are (abilities). The game designer should have written all the small rules and the abilities/drawbacks on the cards themselves so that you do not need to refer to the manual all the time (because there are plenty of those throughout the game)\n\nToo many tables to roll on. I have no idea why you do not have 100 event cards instead of table (same goes for all other tables). Rolling on tables is archaic and stalls gameplay, which is a big no-no in game design.\n\nReduced it to 7 because it it costs wayyy too much for the fun it gives not to mention all the mistakes in game design as I have mentioned.\n\nA PC version (30$-40$) with miniature packs / extension that can be bought (5$-10$) on steam would be nice. It would eliminate a lot of dice rolls and table consultation.\n\nI do not recommend buying this until the tables are eliminated and key-words are explained on the cards themselves, but it is worth trying. It is highly overrated. You buy this game for the miniatures, not the game itself (way overpriced and overhyped, pretty ordinary game mechanics).",
    "timestamp": 1558994400
  },
  {
    "username": "DC_Cowboy",
    "rating": 5.0,
    "comment": "Rating based on the introductory hunt only. Didn't feel all that engaging, but I need to give it an honest go by playing a short campaign.",
    "timestamp": 1557352800
  },
  {
    "username": "jwh3",
    "rating": 5.0,
    "comment": "The game itself was interesting and amazing. The miniatures detailed and a joy to put together. Setup was a pain, and the hidden knowledge of building a settlement both great and painful. In the end this game required investment, and it might have gotten it if the entire wrapping story and art didn't feel like a high school artist trying to be edgy for the sake of edgy. Random gore, nudity - it was there just for the sake of it, and didn't add to anything. In the end, it was so distracting I didn't want to play it. Any game that you want to share, but are almost too embarrassed to show off simply won't last. Sold it two months after acquisition.",
    "timestamp": 1543964400
  },
  {
    "username": "adamscott",
    "rating": 5.0,
    "comment": "After trying out the first scenario and learning more about the game, I don't think I'll be committing to a campaign anytime soon. While I'm interested in seeing where the story is going, I'm not sold on the gameplay. An awful lot of dice rolling and paperwork. Also, a 36 game campaign is just too long for me at the moment.",
    "timestamp": 1541199600
  },
  {
    "username": "nwhyman",
    "rating": 5.0,
    "comment": "This plays like an old-style D&D wilderness campaign with some settlement-improving thrown in. With no DM there is unfortunately no way of hiding the randomness. I didn't see how you could play \"well\" versus \"poorly\" in the battles - you either got lucky or you didn't. Real choices (ie game-changing choices) were largely restricted to what to do when back at base. But even there the outcomes of some choices were dependent on die rolls. Puzzling.\n\nI have to scratch my head at the limit of 4 \"survivors\" per battle. If you've built a robust settlement with a big population why not send 5? Or 6? or 10? Seriously, why would you send 4 at a time to their deaths when 8 together would win?",
    "timestamp": 1530828000
  },
  {
    "username": "LordAba",
    "rating": 5.0,
    "comment": "I like the game in theory, but too much random roll-or-die or needed a 10 followed by a 10 to unlock some events just kills it. A lot of tonal whiplash: you get serious events happening followed by \"you eat poop and everyone calls you poopy the poop eater\".",
    "timestamp": 1530223200
  },
  {
    "username": "RollingstoneCPT",
    "rating": 5.0,
    "comment": "Just not my cuppa tea",
    "timestamp": 1527544800
  },
  {
    "username": "Mistermelo",
    "rating": 5.0,
    "comment": "Ugly board, very repetitive and a little boring gameplay. Go to hunt, throw some dices, things happens, fight against a monster in an almost empty arena, die a lot, make some new weapons and start again...",
    "timestamp": 1523311200
  },
  {
    "username": "DegenerateElite",
    "rating": 5.0,
    "comment": "Sold it and moved on.\n\nGameplay was extremely repetitive focusing on min maxing for the future based on randomly encountering things in past plays.\n\nWay too many components for what amounts to a really simple game.\n\nThe minis also tended to be hit or miss. Some are very nice and beautifully designed others are just crap to build with lots of gaps that have to filled and really odd parts separation. The artistic design on many of them is pretty varied as well.\n\nBecause death was so common, there was ultimately no horror at all in the game, just a shrug and moving on to the next bit.",
    "timestamp": 1523224800
  },
  {
    "username": "Cut_Throat_Jake",
    "rating": 5.0,
    "comment": "Great downtime/settlement building sections spoilt by tedious combat.",
    "timestamp": 1522188000
  },
  {
    "username": "jgoyes",
    "rating": 5.0,
    "comment": "2017-11-27\n\nInitial Rating: 6.0 (November 2017)\n\nI finally played the fabled Kingdom Death monster. I initially pledged for it on KS, but later, I retired my pledge as I learned a little about the game and I´m very glad I didn’t support it. KDM is not a game I want to own or play.\n\nThe rules of the game are less complex that I was expecting, however, there are many rules so teaching the game takes at least 30 minutes. Playtime is very variable and it depends on the scenario.\n\nLove the theme.\n\nThe game´s components are AMAZINGLY good. The miniatures are incredible detailed, I love the art and in general, it has great production values. The game box is very big and heavy and the game is very expensive, but also overproduced and ambitious. It is gorgeous.\n\nTo me, KDM has a medium weight, I was expecting something much more difficult to play. The decisions needed to play the game aren’t very complex. I concede I have only played the prologue and it was hard to beat, but we didn’t have any issues with the decision making process, it is hard to pass due to luck considerations (you roll for everything). After you pass the scenario, there is another phase (I don’t know its name) but that phase is much more interesting to me. In that new phase new people are born, you distribute your loot, build equipment and buildings and you choose philosophies. In our game we became cannibals and we ate a fallen comrade, he was genuinely distressed about this, it was fun .\n\nAnother good thing about KDM is that you don’t own your character (besides killing you character seems pretty easy in the game). You can begin another scenario with a new character or you can use one created by a friend. This makes much more easy to play the game often. On the other hand, many players (scudding me) create a bond with their characters, and in KDM characters can and will die easily.\n\nKDM is an Ameritrasher dream game, but I have been drifting away from this kind of game. My tastes have become much more Euro these past couple of years. Still, I could have bought the game if it wasn’t for the unassembled miniatures. This is THE deal breaker for me. I never buy games in which I have to assemble the miniatures and when I do (by mistake) I have sold them unplayed. I hate this activity and I won’t ever do it.\n\nWhen we were playing the game, a friend said he really enjoyed the game, but he said that if he is going to play a game like this, RPGs do a much better job. I can understand his point of view but I don’t share it completely.\n\nThe luck factor seems very high, which isn’t bad in this kind of game (Cooperative Ameritrash).\n\nI have an inkling of desire to play the camping but I won’t do it. I think the game is very repetitive so I’m not sure how much game is really here, my gut says the game hasn’t the legs for me so I think it would bore me fairly quickly. I think the big appeal comes from the miniatures but they don’t work for me.\n\nBest with 4 players.\n\nBottom line, I recognize that Kingdom Death: Monster can be a great game for many players, but it isn’t for me. I have a low desire to play the campaign so I don’t think I ever will. There are many other games that really excite me and KDM doesn’t. I would have enjoyed a game like this when I was a teenager, or maybe when I first began playing boardgames (2010), but now I have moved far away from this genre, I feel the game is very repetitive and what I enjoy the most is the phase after the fight, not the fight itself. KDM comes with unassembled miniatures which is a no go for me, there is no way I’m going to glue them together. KDM isn’t as complex as I was expecting. There is also the consideration of the price, I feel there is a bias here toward liking the game just to justify the high price, this behavior isn’t that uncommon with KS games. I prefer Myth over KDM, but I already sold Myth. KDM has a very high luck factor.\n\nCurrent Rating: 5.0\n\nJgoyes´ Awards:",
    "timestamp": 1511823600
  },
  {
    "username": "Linvala",
    "rating": 5.0,
    "comment": "Too much dice-depending, therefore not my game, but I understand the high ratings. The game looks awesome!",
    "timestamp": 1498687200
  },
  {
    "username": "Acclamation",
    "rating": 5.0,
    "comment": "There are quite a few cool systems in place in this game but I have two major issues with it.\n\nFirst, spending multiple hours developing a character feels great! Climbing out of the dirt, dusting yourself off, and putting in the effort so that you finally begin to feel effective and cool in combat is awesome. Overcome the odds, become a hero, and feel badass, right!? It would be if it wasn't based on blind luck in the form of dice rolls. Then, once you manage to get lucky and start feeling that sense of accomplishment and satisfaction the game rips it away from you. Building up a character only to have him instantly killed by a settlement event against which I had no recourse is one of the most frustrating and unfun things to ever happen to me in a board game. I choose the phrasing \"happen to me\" in my previous sentence very deliberately. The player doesn't make things happen in KD:M, things happen TO the player.\n\nI understand that the characters are not the central focus of the game, the settlement and the narrative is. If my character had died in combat after bad rolls or poor decision making then I could shrug and move on, try and do better next time. Feeling as though I didn't even participate in my character's death is difficult to overlook, especially when 75% of the game is spent micromanaging your character in combat. You even get a bonus at the start of the game for naming them! They should matter more than they do. Maybe this part of my response to the game can be boiled down to \"the game is not for me\" or \"I, personally, don't have fun with this game\" but that's the point of a review.\n\nSecond, the whole experience feels more like I'm reading a disjointed novel in the form of cards and narrative blocks from the rule book than I am playing a game. There isn't any player agency outside occasionally choosing one of two options in a narrative which is, ultimately, decided by the group. As an individual, there are no meaningful, tactical choices. I feel like a kid reading Goosebumps again. In fact, that's the best way I can think of to describe this game. You are presented with limited options and told to read what happens. Then, occasionally, you die without any opportunity to respond. Who am I kidding? You have more agency with Goosebumps. At least you choose the path that kills you.\n\nIt's a game that asks the player to hop in a cable car and enjoy some gorgeous scenery. Except the entire ride an angry drug addict is repeatedly punching you in the kidneys. Playing through the first time I felt like I'd enjoy it more once I knew what I was doing. Playing it again I felt like I should have enjoyed it more the first time, when it wasn't repetitive. Ultimately, while KD:M has clever moments, I find it to be an overengineered exercise in excess and hedonism that, problematically, relies on arbitrary randomness to create drama rather than offering the player interesting decisions.",
    "timestamp": 1496095200
  },
  {
    "username": "Asherdad",
    "rating": 4.6,
    "comment": "STORY BASDED RPG\nQUESTING BASED\nFANTASY\nCIV BUILDING\nMinitures\nFighting",
    "timestamp": 1489273200
  },
  {
    "username": "ScaperDeage",
    "rating": 5.0,
    "comment": "My least favorite part of playing tabletop RPGs is getting into combat and this game is pretty much everything I dislike about common RPG combat systems. The whole settlement building thing is cool, and the theme is great, but I just find the combat way too boring and dragged out for my tastes.",
    "timestamp": 1479337200
  },
  {
    "username": "samblake",
    "rating": 5.0,
    "comment": "Outdated dice rolling combat. Repetitive campaign. Fiddly book keeping. Over-hyped kickstarter mediocracy.",
    "timestamp": 1457996400
  },
  {
    "username": "dbucak",
    "rating": 5.0,
    "comment": "Tactically uninteresting but fiddly and slow combat. I suppose the campaign is more interesting, but that would involve wanting to play the combat again.",
    "timestamp": 1455404400
  },
  {
    "username": "GhostShip Blue",
    "rating": 5.0,
    "comment": "Many of the minis look to be stunning. I opted out of the pin-ups, but am eager to see the largish collection of \"in game\" minis I Kicksarted for.\n\nGame play is an unknown at this point, but the photos of the minis presented warrants a 5, game play aside.",
    "timestamp": 1409176800
  },
  {
    "username": "Toolian",
    "rating": 5.0,
    "comment": "Because 5 is the real number of balance. =p",
    "timestamp": 1364767200
  },
  {
    "username": "Qhorin",
    "rating": 6.0,
    "comment": "Quite the experience. Very much a lifestyle game. Everything is huge - encompassing the development of man and nature of death. Epic hunting, settlement building, and boss fighting, with great story and art throughout. The random dice rolls and even bad card pulls during battles can ruin an otherwise good time.",
    "timestamp": 1762618320
  },
  {
    "username": "visard",
    "rating": 6.0,
    "comment": "Campaign driven miniatures battle game. Do not become attached to the characters, as they will die in the battles. Players try cooperatively to keep the settlement alive.",
    "timestamp": 1761084000
  },
  {
    "username": "ImZhe",
    "rating": 6.0,
    "comment": "Review from 15 sessions of play, fought White Lion lv 1/2, Antelope 1/2, Phoenix 1, Butcher, Kingsman\n\nThematically lot of cool things in this game, but the bookkeeping is really annoying. I swapped to digital after 1 play and I can't imagine tracking each survivor using a separate sheet of paper and tracking each settlement, managing and shuffling all of the decks, then having to reorganize everything after each campaign.\n\nNot enough tactical depth during battle for my tastes, most of the battle is just repeatedly rolling dice, at least for the core game monsters I went against. Positioning is pretty straightforward most of the times, once you know the monster's attacks you stand away from the areas that the most dangerous attacks hit i.e. don't stand in front of the lion or antelope, don't stand in the perfect thrust positions of the kingsman.\n\nFavorite part is the gear grid system, where matching colored edges on the gear grid gives you bonuses. Would love to see more games use this system.\n\nOverall interesting concept, creates some nice stories, but too much bookkeeping and effort to play for how much comes out of it, and battles take pretty long with low amount of decision-making.",
    "timestamp": 1759960800
  },
  {
    "username": "Tannerd",
    "rating": 6.0,
    "comment": "Too immature. Too disrespectful of my time. Too much paperwork for solo. Too much to keep in my head, once you get deep in.",
    "timestamp": 1759788000
  },
  {
    "username": "c0sMyc",
    "rating": 6.0,
    "comment": "Not my cup of tea. Played on Tabletop Simulator once and no care to play again.",
    "timestamp": 1755208800
  },
  {
    "username": "moneybee517",
    "rating": 5.5,
    "comment": "Only tried the opening scenario (lion) and died. Didn't leave a great first impression and my partner immediately said he wouldn't play it again.",
    "timestamp": 1754344800
  },
  {
    "username": "Bheowulf73",
    "rating": 6.0,
    "comment": "My personal upside: great setting, fantastic material\nDownside: less meaningful player turn. Settlement Phase with high repetition and time consuming.",
    "timestamp": 1754344800
  },
  {
    "username": "goyacorl",
    "rating": 6.0,
    "comment": "+Sunstalker\n+Gorm\n+Dung Beetle Knight\n+Spidicules\n+Flower Knight\n+Manhunter\n+Dragon King\n\n+Gambler chest\n\n+First Hero\n+Nightmare Ram\n+Gryphon\n+Abyssal Woods",
    "timestamp": 1750024800
  },
  {
    "username": "Gaiserik",
    "rating": 6.0,
    "comment": "i really dislike my survivors dying for events like murder, they kill giant lions and perform amazing feats, and they go to the town and die ridiculous deaths.\nps. my english sucks sorry",
    "timestamp": 1734562800
  },
  {
    "username": "taloskhaos",
    "rating": 6.0,
    "comment": "This game is impressively well produced, but it is extremely random and brutal. For a long time I also hated it for trying to be edgy by being one of the first Kickstarters to feature nudity in a board game, especially in some of the addons and such, but while it bothers me less now as we are far past its launch, this is still not a game I am rushing to play.\n\nStill, this game is well designed and well produced for those who want a brutal and long experience and some gorgeous production, artwork, and minis.",
    "timestamp": 1731366000
  },
  {
    "username": "Balleflass",
    "rating": 6.0,
    "comment": "I used to own everything from season 1 and 2, but I only played about 70% of the core box before I got tired of its flaws.\n\nThis game started as a 9/10 for me the first 2-3 fights, then it went downhill from there as the game just threw all kinds of negative effects on you until you just dies before even reaching a fight because of hunt cards and settlement events.\n\nThe rulebook is great and also has an awesome tutorial that eases you into the game.\n\nI love the monster reaction cards and that damage to the monster removes reaction cards to symbolize the monster being more tired/broken, which is a mechanic I find to be a simple and great solution.\n\nSome of my problems with the game is the huge swingyness and randomness with very few ways to mitigate it.\nYou do have \"survival points\" that allow rerolls and you do have some gear items that lets you look at and rearrange monster AI cards to kinda predict what it will do, but at the end of the day, it all depends on being somewhat lucky with the D10 die rolls, but this is not much different from other games.\n\nThe worst problem is the hunt phase where you often draw cards that is very crippling for your group right before you enter a fight where you don't really have a chance unless you start at peak performance.\nAfter having drawn a bunch of hunt cards and settlement events you'll grow tired of never having a fun boss fight as one of the players often starts with a huge negative effect making the boss fight kinda boring for that person.\n\nThis is a 1-2 player game IMO as that will let the players often have at least 1 survivor that \"works\".\n\nI dont like that you need to mine/gather materials during the boss fight. Why cant the items that are left on the board at the end of the fight be auto-gathererd/mined unless they gets destroyed by the fight itself?\n\nI prefer this over Aeon Trespass when it comes to the total package as I love the settlement phase where you build buildings and craft items.\nThe emergent storytelling is also fantastic.\n\nBut at the end of the day, this is a boss fighter, and it gets boring for me when all a fighter can do is move + swing weapon unless they have a headband that lets you peak on the next AI cards or dodge.\nI'm more into the Middara , Gloomhaven and Street Masters camp where every character has a bunch of different cool abilities/skills they can use every turn.\n\nSo I sold it.",
    "timestamp": 1722549600
  },
  {
    "username": "SirMarmight",
    "rating": 6.0,
    "comment": "The White Lion Showdown began with a SLAM… of Goolum’s intracranial haemorrhage.",
    "timestamp": 1722204000
  },
  {
    "username": "Innsbruck",
    "rating": 6.0,
    "comment": "Player Count: 1 to 4\n Co-Operative Game: Everyone wins or loses together.\n\nDesigned by Adam Poots.",
    "timestamp": 1719266400
  },
  {
    "username": "antholia",
    "rating": 6.0,
    "comment": "I will go straight to the negatives.\n- Very tedious game. Actually is a very very very slow game. Its takes A LOT for you to progress just a little in the game.\n\n- Somewhat unbalanced. It's close to Arkham Horror, once you miss your attack or defence or dice roll... Then it just becomes a slippery slope downwards. And becomes less and less enjoyable with very little game mechanics to level the playing field.\n- Unbalanced, random and luck based. *Did i say unbalanced already?* Very dice(y) game. Very exciting to roll dice in the beginning... Then become very tedious, then as the dice start not going in your favour, then becomes very unfun, then becomes more difficult, then its just unplayable and almost no progress with permanent injury that stacks even more against the players. Very very luck based, and little skill base.\n- more fun to have more players. Solo playing is very tedious and very unfun... Very fast.\n- Per Monster is sooooo very long and tedious to kill. Even at the very first encounter.\n- Rules are pretty long and can be difficult or tedious to read.\n- Requires a big space to fully enjoy the big boards and figurines (miniatures... Not mini at all)\n- Miniatures can be a little fragile. Be careful, should be ok.",
    "timestamp": 1718748000
  },
  {
    "username": "mgoddard",
    "rating": 6.0,
    "comment": "Played on Tabletop which helps is some of the bookkeeping. I can see the allure when the were not any \"boss battlers\" out there but it seems a little repetitive and grindy for the long experience.",
    "timestamp": 1717624800
  },
  {
    "username": "fisha",
    "rating": 6.0,
    "comment": "Nehéz értékelni ezt a darabot. Egyfelől számomra teljesen lenyűgöző, hogy ezt gyakorlat egyetlen ember szülte meg világostul, történetestül, grafikástul, figurástól, szabályostul. És igazából a zsánerében nem is biztos, hogy rossz. Nekem repetitív, ráadásul alig van benne döntés. Jópofa a hangulata, egyszer el lehet vele bohóckodni, de az ára, felépítése, mérete alapján ne erre találták ki. Szóval 10+ az életműnek. 4-5 a játéknak.",
    "timestamp": 1714082400
  },
  {
    "username": "adamsinger109",
    "rating": 6.0,
    "comment": "It's fun and interesting but it is more \"random\" than it is \"hard\". It can tell fun stories but the amount of dice rolling can become a chore, not to mention.\nIt's lame rolling a crit on some rolls does nothing. I would house rule rolling a crit on the \"hit\" roll to grant you with a free re-roll on subsequent toughness roll",
    "timestamp": 1713823200
  },
  {
    "username": "Michebugio",
    "rating": 6.0,
    "comment": "I have an extreme love/hate relationship with this game. I will give it a 6, but it's not even representative of my feelings for this game. I would it a 10 for the atmosphere, story and the materials; and a 1 for the game mechanics, so frustrating yet so appropriate to the setting.",
    "timestamp": 1709593200
  },
  {
    "username": "moosuey",
    "rating": 6.0,
    "comment": "Was favorite game. Burnt out on core & GC is just a disappointment",
    "timestamp": 1699570800
  },
  {
    "username": "Bethemey",
    "rating": 6.0,
    "comment": "Way to much buck for the band\nWent back and replayed it years later still think it was over produced no real need for a ton of sprues of various parts as part of the base game. Also, did we really need to pay for the ego stamp on the bottom of each base as well as duel layer bases? That being said its a decent game.\nOk commentary continued I saw some of the comments made by individuals about not playing the game due to the portrayal of women. I own the base game. After looking at the promos, I understand the comments now.",
    "timestamp": 1697407200
  },
  {
    "username": "FlussBurrito",
    "rating": 6.0,
    "comment": "Update: it is going nowhere....move on.\n+2 stars, some promised stuff got delivered gc…",
    "timestamp": 1693000800
  },
  {
    "username": "nucleartrask",
    "rating": 6.0,
    "comment": "Too much money for plastic when there are other amazing similar games such as Gloomhaven. Random roll dice result garbage. It's just DnD with minatures, if you like that kind of thing fine, but I play board games for strategy, so this is abysmal.",
    "timestamp": 1680472800
  },
  {
    "username": "youjon5",
    "rating": 6.0,
    "comment": "This game is cool and has a lot of interesting story/legacy elements. However, it has too little interesting decision making, especially in combat.",
    "timestamp": 1674687600
  },
  {
    "username": "staygeeky",
    "rating": 6.0,
    "comment": "https://youtu.be/nFkRV0xkLXc",
    "timestamp": 1668639600
  },
  {
    "username": "Glic2003",
    "rating": 6.0,
    "comment": "I've heard great things about this new hamburger restaurant in town. Not a lot of people have gone to it yet, since it's very expensive and hard to get a seat, but everyone who has gone says it's unusually good.\n\nThe big day arrives and I finally get a place in line to order. When I place my order for a hamburger and fries, the employee informs me I can't technically order a hamburger and fries, however, if the person next in line is willing to order a double order, I could have half of his order and I would just pay him part of the money. Seems a bit odd to me, but whatever, I'm willing to experience it the way it was intended. However, at this point, another employee emerges and starts arguing with the first one, explaining that yes, since this is a Friday, I am allowed to order a hamburger and fries but only if I use the special Deluxe menu that was located in a different room. I ask the staff why they didn't just put the two menus in the same room and I'm met with quizzical looks and insistence that it's because this is a \"boutique\" restaurant. I also ask why they don't just have a menu on their website - like every other restaurant in existence - and they tell me there would be too many \"spoilers.\"\n\nEventually, my order is placed. The staff appears to be taking a very long time to get everything ready, but the food does arrive. And indeed, everything looks stunning. I dive in and start eating. For the most part it seems to be a typical hamburger and fries, but the fries are much too big to fit in their container and tend to spill out all over the table. The hamburger also comes with five parts to its bun, instead of the usual two. There's some meat in there that's actually very tasty, but it's hard to get to because of the massive (albeit, impressive) bun. In particular, there's one bite of the hamburger that tastes remarkably, impressively good. I believe it's that part of the burger where the special sauce and pickle intersected in just the right way. Unfortunately, that moment passes quickly, and I continue on with the rest of the meal. I'm eating and eating, but the fries are just so huge I finally get tired of eating them and give up. Curiously, even though I've apparently eaten a lot, it doesn't feel like I'm getting very full and start to wonder if I missed some of the food inside the elaborate containers. But before I can resolve this latest mystery, a large, bizarrely-dressed man rushes out of the back of the restaurant and storms over to my table. Without saying a word, he grabs the table, violently upending it and scattering food and packaging everywhere. I conclude that the meal is now over.\n\nFinally I'm ready to go and need to clear my tray and garbage. I head over to the garbage can, which is absolutely overflowing with trash. I ask the staff why they don't empty their garbage. They tell me they can't empty it today because it is indeed a Friday and the garbage is emptied twice on a Monday, but not at all on any other day of the week. However, they helpfully suggest I cram all the garbage into my pockets and carry it home with me, because that's what most of their customers do.\n\nI leave the restaurant, intrigued, but confused. I take one final look back over my shoulder, admiring the glistening facade and gorgeous signage suggesting wonders within. I head back to my car, but remember I had to park it two lots over because the lot at the restaurant only had enough space for 3.5 cars. I often think about returning in the future, but decide I'd probably be better off just going somewhere that feels less like work.\n\nAnd that's what playing Kingdom Death: Monster feels like to me.",
    "timestamp": 1668466800
  },
  {
    "username": "Stainlezz",
    "rating": 6.0,
    "comment": "Not as good as the wipe",
    "timestamp": 1666821600
  },
  {
    "username": "LobyThePirate",
    "rating": 6.0,
    "comment": "Game is really hard until you discover how to cheese every enemy",
    "timestamp": 1664488800
  },
  {
    "username": "roood",
    "rating": 6.0,
    "comment": "Huge game with huge ideas and huge difficulty. Unfortunately, a lot of that difficulty, players have no control over. Aside from ignoring the results from some badly rolled dice during non-combat story type elements that might end your game then and there, it felt like a good game. But the swingyness of a bad dice roll completely ending your campaign, if you live and die by the rules, is a weak mechanic. Otherwise, the gameplay loop was fun enough. But there are definitely better boss battlers out there now.",
    "timestamp": 1660773600
  },
  {
    "username": "Ciaran",
    "rating": 6.0,
    "comment": "Not terrible, but not worth the cost for me. In my only play, our entire group of adventurers was wiped out in a single event, I don't know that I'd call that fun. There is also a lot of repetition in the monster fighting, and I think it would get old very quickly. I would much rather play a game centered around the town building portion, and just resolve the fights with a few dice throws.",
    "timestamp": 1658613600
  },
  {
    "username": "b4b8",
    "rating": 6.0,
    "comment": "AI decks are amazing, gothic pinup? theme is off-putting, miniatures are very detailed and well designed. Too punishing and too easy to get your party wiped and forced to start over",
    "timestamp": 1657749600
  },
  {
    "username": "xilconic",
    "rating": 6.0,
    "comment": "I consider combat to be okay. The same battle arena every time feels a bit lackluster. All monsters having their own deck and strategy is pretty cool; Feels like a boss-fight most of the times. However fighting during those boss-battles feels a bit lackluster too. The excitement in the initial battles got quickly transformed into a feel of going through a grind for materials?\n\nSome parts of the world building I find really attractive, but the colony management itself feels at times a bit dull. Perhaps this could be a group dynamic kind of thing? At times this felt a bit rushed, which is probably because some of the group member really tuned out in this phase of the game :/\n\nHowever, the miniatures are awesome. Very detailed and extremely original!\n\nI also recognise that while you probably want to play the game with 4 characters, you may want to play it solo controlling those 4 characters. Because I feel this game is not about playing your character. It's about managing the whole settlement as an entity. Due to the nature of the theming, injuries and all that, I don't think you should be playing this with a mindset of \"I have you own character(s) and you have yours.\". Which is something I tend to do. And I felt bad when I didn't get to play my people for whatever reasons.",
    "timestamp": 1653688800
  },
  {
    "username": "shmonkey",
    "rating": 6.0,
    "comment": "Its neat. its got a good character progression and item progression system. The bossfights are fun and engaging. 4player drags, its better to play 2p and control 2 characters each. Very little downtime.\n\nThis game feels like it would work better as a video game. There is a ton of bookkeeping to do. I don't mind the game but I'm also not eager to play future sessions.",
    "timestamp": 1652479200
  },
  {
    "username": "Lukashi",
    "rating": 6.0,
    "comment": "Cool story and world, some interesting elements and vision of the whole. 8/10.\nVery poor main fighting game, no meaningful decisions, everything full random, just roll and read what happened. Long and laughable from the wrong reasons. One player is enough to play the whole of it. 3/10.\n\nMaybe would try to explore it a bit more if in the right mood so 6/10 overall.",
    "timestamp": 1651356000
  },
  {
    "username": "romanbode",
    "rating": 5.5,
    "comment": "A great boss fight game, but with some worrying mechanics. Brutal, often illogical but immersing world. I'd lay it...but never own it.",
    "timestamp": 1648162800
  },
  {
    "username": "pha3drus",
    "rating": 6.0,
    "comment": "No, just too gruesome, and too much calculating math on the rolls. And too expensive. And too many naked women, and degrading religious icons. Just not something I want to support.",
    "timestamp": 1647385200
  },
  {
    "username": "MarlinBlue",
    "rating": 6.0,
    "comment": "that's a great great game only if:\nyou want to play a long campaign with 3 more friends.\nyou want to play solo.\nyou love horror games were you lose a looot of characters (called here survivors) to brutal monsters or lack of luck.\nyou love building set of armor, weapons, to power up characthers.\n\nBasically it's a game of survival of a few survivors against monsters. well the monsters are at the same time antagonists and resources, cause you farm monster to build up your settlement and make better weapons and armos.\n\nthe game go in turns:\n1 develop settlement (survivors are born, make weapons and armos from dead monsters, build settlement locations, play random events).\n2 hunt a monster. there is some casual card and dice rolling see what happen when you hunt.\n3 fight the monster. the fight can be pretty brutal.\n\nand it mix flavor from RPG, a strong background, and a story to follow.\n\nlast thing every campaign is always different, cause the monster beaviour is generated from specific deck. every monster have a deck of action, and is somewhat different every time you play.",
    "timestamp": 1647212400
  },
  {
    "username": "xeliassame",
    "rating": 6.0,
    "comment": "Kingdom Death needs more content. for 400$, what you get is a game with a great base, but that fails shorts everywhere. Some of the (expensive) expansion fix the game's problems, but even after spending a thousand dollar on the game, it won't feel complete.\n\nKingdom Death might be a great game, in a decade or so, after 2 or 3 more versions, alongside a curated pool of expansions.",
    "timestamp": 1640473200
  },
  {
    "username": "Benkyo",
    "rating": 6.0,
    "comment": "A slog to play.",
    "timestamp": 1619992800
  },
  {
    "username": "Bochi_Za_Rasu",
    "rating": 6.0,
    "comment": "Rating Downgraded from 8 to 6 because sometimes the game feels aimless, and the rules are so....much that if you don't play for a while you basically have to re learn half the rules.",
    "timestamp": 1610924400
  },
  {
    "username": "Pandorzecza",
    "rating": 6.0,
    "comment": "Nie wiem co o tej grze myśleć, droga, aż do przesady i jakoś mi nie zaimponowała",
    "timestamp": 1610838000
  },
  {
    "username": "tiagoVIP",
    "rating": 6.0,
    "comment": "There are games that are more an experience than usual, and this doesn't make them good, but sure turn them into memorable. I will mention two: Legend of Zagor and Sherlock Holmes Consulting Detective. The first isn't a good game - it has surpassed mechanics, great reliance on luck; still, when playing, one can have a great time with the computadorized voice, the result of encounters, etc. Many amerigames have strong thematic elements that go beyond the mechanics. Sherlock Holmes, on the other hand, creates a proper narrative not often found on board games - my favorite games, such as Arkham Horror and Sentinels of the Multiverse, aren't a good fit to deliver, after a game, a nice and coherent story. Sherlock do and you get to be part of it, to uncover the pieces and try to fulfill the puzzle.\n\nKingdom Death: Monster is one of those experience first games. Its base mechanics are rather simple: lots of random encounters, battles using several modifiers and possibilites that ultimely are decided by the whim of dice - in spite of having a neat IA, and learning couting for a good deal in how to handle enemies -, collecting stuff to turn into other stuff, do some work in your settlement, including some neat intimacy, and things like this. Simply put: the mechanics in Kingdom Death: Monster aren't all that great - it has bits and pieces of inspiration, but, overall, it just felt lackluster.\n\nNonetheless, the story isn't. Its not frequent that you see many of the situations that happen in the Kingdom Death: Monster plays. Isn't usal to battle a little and rip its leg off. Or to use its bones to make weapons and skin to turn into armor. Or to have your settlement to deal with the dead. The people start as nameless, and as more time passes, they get names, understanting, traits, form couples, and more. Suddenly you realise you're not just delevoping stats in sheet, but a way of behavior, of thinking - you get to make a micro-society.\n\nKingdom Death: Monster have very good components (though I dread assembling miniatures), but what makes it shine is how memorable, weird and off the beaten path many of the design choices made lead to.\n\nEven for games I rather enjoy, but have emphasis on mechanics and results, it is hard to separate one play from another over time. I do no expect the same from Kingdom Death: Monster. In the end, what I want more is to make a mark, to create memories and special moments, not simply win or lose.",
    "timestamp": 1602194400
  },
  {
    "username": "CrynusX",
    "rating": 6.0,
    "comment": "Game is fun, but can take a long time to get through a round and can get bogged down with convoluted rules.\n\nEncounter design isn't the greatest and mechanics can be hit or miss.\n\nMiniatures are a big problem here for me. The quality of the sculpt may be good, but assembly is bad. Pieces don't fit together properly, strange mold choices, like a wrist being two parts. No assembly instructions, though they have them online now, they aren't very good. I hate assembling and working with their models.",
    "timestamp": 1589493600
  },
  {
    "username": "Dan875",
    "rating": 6.0,
    "comment": "Pros:\n- Detailed Miniatures\n- AI Deck (Creates Suspense & Tension)\n- Unique & Abstract Theme (???)\n- Hunt Phase (Engaging & Decision Making)\n- Crafting (Decision Making)\n- Storytelling/Narrative Gameplay (Engaging)\n- Resource Gathering (Satisfying)\n- Character Creation (Investment)\n- Story Events (Engaging)\n\nCons:\n- Extremely Long Game Time ~4hrs\n- Long Set-Up\n- Large Amount of Game Components\n- Typos\n- Card Drawing/Dice Rolling (Random Element)\n- Expensive ($200)\n- Settlement & Character Creation (Relies on Player Group)\n- Recommended 4-5 Players Exactly\n- Player Elimination",
    "timestamp": 1587938400
  },
  {
    "username": "scjackson",
    "rating": 5.7,
    "comment": "Too swingy. It's on theme, but that theme is tough and random survival.",
    "timestamp": 1587852000
  },
  {
    "username": "mazzyfred",
    "rating": 6.0,
    "comment": "I had fun playing two campaigns for this game, even though this is not usually my kind of game.",
    "timestamp": 1587765600
  },
  {
    "username": "hardhead",
    "rating": 6.0,
    "comment": "Lo siento me parece un juego sobreestimado:\n\nLa fase de asentamiento es de lo mejor que he jugado, de ahí (mas otros aspectos) mi 6, pero es que el combate me aburre, no por el sistema de juego, que me parece bastante bueno, es que es un monster hunter en el que 4 heroes atacan siempre a un monstruo. Eso me aburre la verdad. Soy muy de dungeon crawlers, con lo que a mi me gusta enfrentarme a mas de una criatura. Al ser solo una, para mi la táctica me parece muy sosa. Ademas al ser solo un monstruo, ataca una vez y por ello da siempre con 2 o +, siendo pifia o pase... lo siento me aburre eso.\n\nSe que el sistema es buenísimo, no lo niego. La IA es de las mejores, tanto que ha sido ya copiada en varios juegos. Pero es que el combate...en fin...",
    "timestamp": 1587506400
  },
  {
    "username": "johnnyg007",
    "rating": 6.0,
    "comment": "Cult game, okay gameplay and mechanisms. Have no desire to play again due to distasteful themes and barrier to entry. Very lackluster board and content. Not impressed with visual appearance.\n\nIts 100% opposite of my liking but I respect its presence within the hobby.",
    "timestamp": 1576450800
  },
  {
    "username": "Thrylos",
    "rating": 6.0,
    "comment": "Heavy, deep, bizarre.",
    "timestamp": 1574290800
  },
  {
    "username": "SethroTall",
    "rating": 6.0,
    "comment": "The game is entertaining, I will give it that. Starting from nothing, fighting with only a shard of stone, and building up a small (albeit dysfunctional) civilization give a great sense of accomplishment.\n\nSadly, that's where my major gripes start. Pretty much everything in this game can be destroyed instantly at no more than a single bad roll of the dice. I could go into details, but I guess I'll leave this spoiler free. Just don't get attached to anything: upgraded characters, cool new crafted weapons, hard fought for legendary weapons, built-up stockpiles in the settlement, the list goes on and on. Being able to lose any and all of that stuff at the drop of a hat is brutal in a way that makes this game really border on un-fun. Yes, its a fresh and new feel for a game, yes, its funny at times, but its also really disheartening and at times very annoying.\n\nBut lets ignore that for a second and move onto combat. What will you do on your turn, well, you'll either attack or you wont, and most of the time that's based more on whether you are lucky enough to still be in range after the enemy has its way with things since your last turn. There just aren't many meaningful decisions. Maybe you want one character to go first to hopefully apply some weakness on the enemy that the others can exploit, but that's about it. Generally you have one weapon and no special abilities, so if your in range you attack, if you aren't, you probably move closer.\n\nOverall, it just seemed like the game was playing me more than I was playing it. If you're into having an extremely brutal experience and some funny and pretty good storytelling, this game can be alright. If you want to have meaningful tactics and strategy in your dungeon crawler, there are better options.\n\n(Side note: the artwork in this game, while done rather well, is regularly NSFW for no important reason. Not the kind of thing you want to play with the family. Not that my wife and kids are into this heavy of a game anyways... but just sayin'.)",
    "timestamp": 1573599600
  },
  {
    "username": "Nap16",
    "rating": 6.0,
    "comment": "Ambitious . . .",
    "timestamp": 1568671200
  },
  {
    "username": "littlechandler",
    "rating": 6.0,
    "comment": "After reading the rules, I thought I would really like this game's showdown's, but wouldn't like the settlement phase. Instead, so far after playing the first two lantern years, the opposite has been true.\n\nI had heard really good things about the monster AIs. However, so far fighting only the white lion, too many of them seem like just variations of move and attack. The slight variations adds upkeep of figuring out what the lion will do each turn, yet isn't enough to develop a feeling of variety. I also don't like how since you start with very few weapons against only one enemy, which so far makes there be very little variety in your turn to turn decisions.\nThis being early in the game and only the first enemy, these aspects may well change in the future. I know at least the game is trying to give a lot of different ways for you to use your survival points, although I'm not sure that is the way I wanted the variety to come from.\nWhat I disliked the most about the showdowns though is how often hitting the monster can backfire. In moderation, this mechanic makes thematic sense in terms of simulating inflicting enough pain to anger the monster but not actually seriously wounding it. However, this mechanic is instead fairly common on at least the lion's hit deck. The lion was doing more damage on the survivors' turns than its actual turns, which feels really counterintuitive (although this is partially because we could not plan around the hit deck effects).\nI also dislike that the monster's AI starts off very varied but gets less so as the game progresses, until it becomes one-dimensional at the end. It makes the fights sort of fizzle out at the end.\n\n\nAs for the settlement phase, I thought I would really dislike having to restart your characters, as doing so would kill off a sense of progression and growth you normally feel in games with fantasy dungeon fights. However, you still end up getting that same sense of progression and growth through the growth of the settlement instead, and while I would generally prefer the \"part of something larger\" feel of the settlement growth versus the more personal growth of an individual character, a settlement focus feels novel compared to the personal growth of other fantasy campaign games. While keeping track of everything in this phase is fiddly, it feels like the decisions here may make a bigger impact than the actual showdowns.\n\nThe story's plot isn't amazing, but the universe is unique for the board game world, and the phrasing of the story is better than most story-driven games I've played.\n\nI'm glad to see the art isn't as risque as the Kickstarter page made it seem to be. While there is a lot of grotesque and naked imagery in the story events, it is more lack of clothing due to being a stone age-level civilization in a bleak and barren land, rather than lack of clothing for the sake of being sexy.\n\nEDIT: As you get stronger, the monster failure effects aren't as prevalent. However, fighting the same monster multiple times even with different AI cards feels repetitive. Also, while fights can play out differently every time, since this wasn't caused by your strategic decisions, nor was it built up by the narrative, this can make things feel out of the blue rather than a sense of wonder and realism that anything can happen. In one battle, the monster got a bleeding effect that caused them to take damage every time they moved. While we had purposefully thrown multiple founding stones at the start of the combat to get crit bonus effects, the effect that we ended up getting felt like a random pull from the hat rather than the fruition of our efforts. That fight ended with us just scattering and letting the monster chase us around until it finished itself off.",
    "timestamp": 1568412000
  },
  {
    "username": "akimbonautilus",
    "rating": 6.4,
    "comment": "(none of us own)",
    "timestamp": 1567375200
  },
  {
    "username": "Kreahyde",
    "rating": 6.0,
    "comment": "Great experience, but kind of a sadistic game.",
    "timestamp": 1566597600
  },
  {
    "username": "MikeWhit",
    "rating": 6.0,
    "comment": "Kickstarter. A game that is also a work of art. Unfortunately the brutality of 3 total party kills in a row turns my group off. Sold via BGG marketplace.",
    "timestamp": 1565474400
  },
  {
    "username": "Zodiac 26",
    "rating": 6.0,
    "comment": "This game does everything it can to kill you.\nRules are biased against the players.\nExpect to die often on one bad die roll.",
    "timestamp": 1564783200
  },
  {
    "username": "SF_Thought",
    "rating": 6.0,
    "comment": "Way too much book keeping for me that doesn't really feel fun. Takes forever to unpack and breakdown.",
    "timestamp": 1560981600
  },
  {
    "username": "BertoldoBertoldino",
    "rating": 6.0,
    "comment": "only played a single campaign with a friend that ows it",
    "timestamp": 1553986800
  },
  {
    "username": "Xonim",
    "rating": 6.0,
    "comment": "The minis are absolutely fantastic. The box is super sturdy and is both huge not big enough because not all the minis fit once assembled. Components otherwise are also great. Unfortunately the gameplay didn't really draw me in as it's just a lot of \"roll the dice and see what happens.\" Admittedly, I only played the prologue and went through the first settlement phase, but that was enough for me to see that this game is not a great fit for what I'm looking for. The turns in the showdown were quick, which was good, but I didn't feel in control of what was happening. The settlement phase that followed could be renamed the \"bookkeeping\" phase, which I expected, but not to the extent that it is. I'd probably feel differently if I had 3 other people to play with regularly, but it's just way too much bookkeeping for solo play.",
    "timestamp": 1540504800
  },
  {
    "username": "spookymilk",
    "rating": 6.0,
    "comment": "Beautiful and elegant, but at times feels like there are too many components for a game where strategy is somewhat obvious and the best advice is \"roll a high number.\"\n\nSeriously, though, I adore the look and feel of the components.",
    "timestamp": 1532815200
  },
  {
    "username": "AHShole",
    "rating": 6.0,
    "comment": "Great theme, original setting, ridiculous amount of time adding and subtracting 10% bonuses/penalties on the dozen different skills/factors characters have, most of which are triggered by random card pulls and dice rolls. You could use half as many stats and have a much more streamlined game without losing meaningful decisions.\nRandom events killing characters (often at random) between battles can get tiring.\nI think the whole thing would work better as a straight up RPG.",
    "timestamp": 1524693600
  },
  {
    "username": "Webbe",
    "rating": 6.0,
    "comment": "Disappointing!\n\nAt its core its fun but super duper über random.\nI treasure game balance and I didn't get it here.\n\nI wish I didn't spend what I spent on it.\nWill probably sell before breaking the wrap of the expansions I bought.",
    "timestamp": 1524520800
  },
  {
    "username": "bryanious",
    "rating": 6.0,
    "comment": "I only played combat and found it ok. Combat didn't offer too much options, and it's very random. A lot too random for a campaign game imo.",
    "timestamp": 1514934000
  },
  {
    "username": "Baron_Fel",
    "rating": 6.0,
    "comment": "This game could really have used a lot of good editing and heavily needs streamlining of game systems, but it's great use of theme and immersion do a decent job making up for it's multitude of flaws.",
    "timestamp": 1514415600
  },
  {
    "username": "DreadPirateJabu",
    "rating": 6.0,
    "comment": "I'm of two minds of this game. On the one hand, the settlement phase of the game is nearly perfect. Exactly the type of trapping I like to see for a grind style game. Building up your town, people, and technology is incredibly satisfying and compelling.\n\nOn the other hand. I hate the combat, it feels very style over substance. There's a lot of really fun event styled things happening, but it always feels too punishingly random for such a large part of the game.\n\nThere may be ways to mitigate it and come out ahead, but the combat and hunt phases of the game bored me to tears. I've heard that Gloomhaven has elements of the settlement phase in it, and the combat in that looks far superior, so hopefully that'll give me the experience I was looking for here (when I can finally get ahold of a copy)",
    "timestamp": 1511996400
  },
  {
    "username": "Destrio",
    "rating": 6.0,
    "comment": "Great RPG elements in a grimdark world. Minis look to be a pain to assemble. Expensive game. Interesting combat cards but weak combat options for players. More of a story game than a tactical minis game.",
    "timestamp": 1511650800
  },
  {
    "username": "maxlongstreet",
    "rating": 6.0,
    "comment": "Equal parts genius, lunacy, and stupidity.",
    "timestamp": 1510873200
  },
  {
    "username": "leoleez",
    "rating": 6.0,
    "comment": "Arcane, Baroque, Freudian, Horrorific, Opulent.\n\nJudging purely based off the mechanics, and the production. The game is exquisite however, I cannot recommend it as it is probably one of the most difficult games to procure, and the theme will turn off anyone with a tinge of traditional values.\n\nFinding concrete information on the game is a quest of obverse investigation of outdated information as well as sparse videos. The creator will not release a copy of the rules in pdf format, grating against the conventions of the industry. The game capitalizes on the unconscious of the internet: anti-social, voyeuristic,\n\nThe mechanically from what I can tell the game is composed of layers of puzzles on top of puzzles. Risk-taking is built into every crevice of the game.\n\nThere are two main portions of the game, the settlement phase where the players develop their settlement, craft items, have relationships, learn technologies. The second portion is the hunt where players stalk prey and eventually will lead to a showdown where they fight for survival and loot.\n\nThe settlement phase provides an element of respite from the stress of combat. The combat is interlinked with the relationships and civilization developed from the settlement phase.",
    "timestamp": 1501538400
  },
  {
    "username": "Samthere",
    "rating": 5.5,
    "comment": "KDM has some cool features: the models, the artwork, the snippets of story and flavour you get. During the first few sessions, the flavour is great, and you get excited making characters, founding your town and seeing what happens. After a while, however, this starts to fade, leaving the core mechanics to hold the game together.\n\nThese core mechanics consist of about a half-hour of arranging equipment (this becomes more of a problem with a variable group, or with lots of character death), about a half-hour of rolling dice during the hunt (hoping you reach the fight without dying or being seriously disabled), about an hour of fighting (which is pretty good as a strategy exercise, but again random wounds can be instantly lethal), and then about an hour of figuring out what to do with your resources (after seeing who randomly dies when you get home).\n\nKDM is often praised for its brutality, but this is where the game falls apart for me. While I really appreciate the value of risk and major consequences, it needs to be meaningful to work. Unfortunately, KDM substitutes out meaningful player decisions for random, flavourful outcomes. Too many random events are simply \"roll or die\", instead of \"take no risk and a penalty, or a great (potentially lethal) risk for a reward. Too many times does half the party die arbitrarily during the hunt before the showdown, and have to sit out for the next hour.\n\nMy main problem with the game is that it lacks agency. When my characters die, I want to know that I could have made a choice to avoid it. Instead, the game makes most of the significant decisions for you. It's satisfying when a character struggles through a difficult fight, battered, broken and bleeding, defeating the foe that slew all of their allies to protect the village. It's less satisfying when they finally reach home, victorious, and the random settlement event is \"roll or die\" (or even \"straight-up kill your longest-surviving character, then roll or die for another\").\n\nThe game does play differently solo; nobody has to sit out, and the party benefits through being able to make optimal gear decisions, rather than trying to give everyone bits and pieces fairly. The solo game is primarly one of optimising combat tactics and optimising resource usage; a bit more of a puzzle to solve. It still suffers from lack of agency, but you can handwave it more easily and ignore events.\n\nOverall, KDM is okay, and enjoyable for a few sessions. I would enjoy it more if it was designed to threaten and pose risks, rather than kill arbitrarily. As it stands, there's a small degree of \"you could have avoided this\" and a huge degree of \"lol you're dead\".",
    "timestamp": 1496268000
  },
  {
    "username": "mi_de",
    "rating": 6.5,
    "comment": "Based on the rules read as, due to the cost, no likely to find an actual copy around here. I am opposed to plastic in general, so this is nuts. Making models not even used in the game is ludicrous.\n\n2/19: Now, this is a difficult one for me to discuss, and to rate in the end. The game mechanisms are actually quite fun: I enjoy the AI much more than Gloomhaven, and feel the storyline much more lucidly. The building up of the civilization is really quite good. I am 'into' what is going on, much more than the generic, repetitive Gloomhaven. The character development during the intervals is quite cool. The combat mechanism is fun, exciting and hilarious. Maybe do go a bit far with their 'tee hee' factors, with all the sex, genitals, and all that adolescent stuff.\n\nAnd yet...the game could have so easily been more accessible to be played by more people but instead was made excessively expensive by the addition of tons of useless plastic fluff. We played totally using counters and cardboard, and had a fine time. There is no need for it, and, ultimately, my judgement is severely affected by the preponderance of all this plastic crap. Did I enjoy the game? A lot more than expected. Do I want a copy? Not with all that polymer.\n\nFour of us played two scenarios. JeroenD was the first to die, being disemboweled and dragged around the map by the lion. Blargh (me) could not hit the side of a barn, but managed to avoid any real damage until a single blow punched a bone through my heart. In the second encounter we fared better, although Pinky (Bartel) cheated and should have died of a heart attack but, well, we bent the rules for Pinky, and Bianca was also deceased by flying clavicle. Perhaps we can go further sometime: I am not opposed, and would even enjoy it but the counters are all I need, thanks.",
    "timestamp": 1758578400
  },
  {
    "username": "tomdrake",
    "rating": 7.0,
    "comment": "In my opinion, it is a very good game. But too much luck. In points:\n+1 for the production quality of the game;\n+1 for the miniatures and monsters, a really great and crazy world;\n+1 for the development of the settlement and the choices involved\n+1 for the interesting character development\n+1 for gear\nMinus... a lot of dice rolls and hope for the best.\n\nFor me, it's a good game, but also an extreme simulation of rolling dice. If you roll an 8+, your team passes everything without any problems; if not, you die.\nHunting a monster before encountering it is a ‘mini-game’ where you roll the dice 4-8 times and see if you make it to the monster fight. There are no choices, just dice rolls. Often, it doesn't even make sense to start fighting the monster because half the team is already dead. It's a shame that we do not have more choices or some choice and test here.\n\nIf the game was intended to convey the horror of hopelessness, it succeeded, but not because of the game itself, but rather due to the exclusion of the player from making decisions and the replacement of those decisions with fate.\nBuilding settlements and crafting equipment is probably the best part of the game. Combat is fairly average, and we are mainly interested in what the AI will throw at us as a form of attack and how we are going to survive it. The combat tactics themselves only come into play later in the game. At the beginning, it's really just movement, attack and hope for good rolls, without any strategy or depth.",
    "timestamp": 1758405600
  },
  {
    "username": "mlbdude",
    "rating": 7.0,
    "comment": "Lifestyle 3",
    "timestamp": 1756418400
  },
  {
    "username": "Pevsfreedom_",
    "rating": 7.0,
    "comment": "Very ambitious. A bit too grindy, dice combat is lame IMO, but I enjoy a lot of it. Card based combat it would be near perfect. I decided to stick with just the core box instead of going down the rabbit hole with expansions. If this was the only game I played it'd be worth it, but as it is the core box is enough. I did own and sell all 12 of the first expansions.\n\nIn-progress house rules:\n\n- Plague SE: does not automatically return on 1/2.",
    "timestamp": 1753048800
  },
  {
    "username": "paulastoria",
    "rating": 7.0,
    "comment": "Ok",
    "timestamp": 1751925600
  },
  {
    "username": "Druaightagh",
    "rating": 7.0,
    "comment": "There's a decent amount in this game to like, but there's also enough bad to keep me from loving it. E.g. I understand it's a roguelike but a character dying in the Hunt phase having to sit there through the Showdown is not fun.",
    "timestamp": 1748383200
  },
  {
    "username": "w33t",
    "rating": 7.0,
    "comment": "Fun gameplay and lore but characters are oversexualized and there’s too much gore.",
    "timestamp": 1748383200
  },
  {
    "username": "Son_anders",
    "rating": 7.0,
    "comment": "The main big box is up for trade. The starting characters and the first three monsters are painted goldish bronze.",
    "timestamp": 1745359200
  },
  {
    "username": "JediMaster0310",
    "rating": 7.0,
    "comment": "A good game with a dark theme and art. Campaign management can feel overwhelming. However, it is worth it to watch your survivors grow stronger and the settlement grow (or burn right back down into the ground). A relatively straightforward combat system once it sticks, but with plenty of strategy and depth. Expect a lengthy time commitment for an entire campaign.",
    "timestamp": 1745272800
  },
  {
    "username": "Matindo",
    "rating": 7.0,
    "comment": "Awesome theme and legacy-style settlement management system. Combat is fun but a bit too much dice rolling for my tastes.",
    "timestamp": 1744322400
  },
  {
    "username": "benprsn",
    "rating": 7.0,
    "comment": "Building and painting the miniatures is 10 out of 10. Playing solo is a bit tough with all the upkeep. I don't like full party wipes.",
    "timestamp": 1740438000
  },
  {
    "username": "ghbutton",
    "rating": 7.0,
    "comment": "Very unique, interesting, thematic game. You start out with nothing and try to work your way up to interesting weapons and characters. A lot of characters die along the way, do not get too attached to any one. And the game is super punishing, kind of like dark souls in a board game, and we have team wiped many times. If you are a glutton for punishment and like the theme and the combat then this game is for you",
    "timestamp": 1736031600
  },
  {
    "username": "actiondan87",
    "rating": 6.5,
    "comment": "Overrated. It's a decent boss battler, but overall the campaign is repetitive, often cruel, and frequently plays itself. Much of the events your survivors will undergo are entirely random and occur with little or no input from the players. For example, the infamous \"Murder\" settlement event kills your most experienced survivor and there's nothing you can do about it. Furthermore, that same event will randomly determine if another survivor (the \"murderer\") will also die immediately. If the murderer is not executed, they will live to kill again, meaning the Murder event will occur again during the next settlement phase. Although not all events are quite so devastating, you will frequently encounter situations where your survivors will be maimed and/or killed due to no fault of your own.\n\n\"But Dan, that's what this game is supposed to be about! It's called Kingdom Death for a reason: lots of people are going to die and you have to deal with it.\" While I completely understand that the game is designed to kill you, I would have preferred to be a bit more involved in, you know, actually playing the game.",
    "timestamp": 1735858800
  },
  {
    "username": "Invisible_Lemons",
    "rating": 7.0,
    "comment": "Awesome game but very hard to get to the table. The share scale, numerous minis etc. makes it hard to transport so ideal if you're the host. I'd recommend only for someone with a consistent group wanting to play it, solo play or if you're interested in the minis for hobby/painting reasons.",
    "timestamp": 1734908400
  },
  {
    "username": "nargles6",
    "rating": 7.0,
    "comment": "The game is too brutal. There needs to be more death mitigation; like give out more disorders or something.",
    "timestamp": 1733007600
  },
  {
    "username": "Doomfarer",
    "rating": 7.0,
    "comment": "Very cool and very, very random as well. I knew it would be random, but wasn't really prepared for the level of it. I hope there are ways to mitigate this somewhat further into the game. Anf this from someone who normally loves a bit of randomness.\n\nThe models are nice but a pain to assemble for an amateur like me. I'm getting better, but could probably have lived with somewhat less advanced models that were easier to assemble.\n\nAfter the first settlement phase and having read some guides on-line I'm more comfortable with the game. Very disturbing world, but I like it so far.\n\nCore + Gambler's Chest + Gorm + Dragon King + Dung Beetle Knight + Flower Knight + SunStalker.",
    "timestamp": 1726437600
  },
  {
    "username": "slp2dream",
    "rating": 7.0,
    "comment": "KDM website\n\nPainted",
    "timestamp": 1719352800
  },
  {
    "username": "KvdBergh",
    "rating": 7.0,
    "comment": "+++ Unique theme\n+++ Fantastic production\n+++ Infinite replayability\n+++ Fast to set up and play\n+++ Constant tension and excitement\n+++ Each survivor develops a unique skill set and personality\n++ The luck and dice rolling becomes a positive\n\n- Expensive\n-- Box and miniatures take up a lot of space",
    "timestamp": 1715032800
  },
  {
    "username": "Twyker",
    "rating": 7.0,
    "comment": "RPG in a box. The Dark Souls of board games. Call it what you want. It's a marvel.",
    "timestamp": 1709506800
  },
  {
    "username": "cosmolsmith",
    "rating": 6.5,
    "comment": "Pros:\n- Most intense dice rolls I've experienced in a game because there are a lot of rolls where a lot is at stake.\n- Encountering a monster knowing nothing about it and learning/being surprised by its move set is interesting. The way the cards are discarded might also mean that monsters can surprise you later by pulling out a card you never saw.\n- Lots and lots of potential to explore character builds, settlement builds, etc.\n- Tons of content, so you can invest tons of hours into this game if you love this style.\n\nCons:\n- A lot is at stake on dice rolls. Some of it is too random for me (especially not being able to mitigate certain rolls)\n- Once you've learned a monster, going on the same hunt becomes pretty grindy.\n- The battle mechanics aren't very intuitive. Once you've played a decent number of scenarios they become engrained, but if you're in a campaign that doesn't meet super frequently there is often relearning of mechanics.\n- You need to be willing to really invest time in this game to get the most from it - probably hundreds of hours. It doesn't pull me in enough for that kind of commitment (I'm guessing I've played 20-30 hours at this point?).\n- You need well-organized book-keeping to run a full campaign of this. Lots to keep track of.",
    "timestamp": 1706050800
  },
  {
    "username": "laraky",
    "rating": 7.0,
    "comment": "It's a fine game, i guess. Not for me",
    "timestamp": 1703977200
  },
  {
    "username": "arandomcanadian1984",
    "rating": 7.0,
    "comment": "Played the first campaign. It was hard but we finally won.",
    "timestamp": 1701126000
  },
  {
    "username": "John Tenzer",
    "rating": 7.0,
    "comment": "Kingdom Death Monster plays like a Dark Fantasy version of XCOM: Enemy Unknown.\n\nYou start with 4 survivors with very rudimentary equipment and abilities and are thrown into a fight against a White Lion monster, where the monsters actions and attacks are determined by a decision tree on A.I. cards you have to draw.\nAfter defeating it, you loot its body for resources and return to your homebase, were you decide how to use the resources and battle experience to upgrade your settlements facilities, population and technologies development. You also build new equipment and manage your survivors' progresses, all the while a background event is happening, that can support or hamper your base camp operations.\n\nAfter that, you send out a team of 4-6 Survivors on a hunt, which plays a bit like these \"Choose your own Adventure\" books from Steve Jackson, where random events happen to your Protagonists, again buffing, damaging or killing them on the way to their hunts prey. All depending on your prior choices for character development and - of course - dice rolls.\n\nOnce you reach your target, it's a battle again.\n\nThis circle repeats itself, until you have defeated the final boss monster - the Gold Smoke Knight - or your settlement has died out.\n\nIn the former event you'll have spend about 50+ hrs playing that one single \"People of the Lantern\"-campaign. And contrary to Legacy games, you can actually play it again no problem.\n\nKingdom Death: Monster might feel a bit cumbersome and uneven sometimes (there are some actual Roleplaying parts (!) forced in there now and then - which might irritate pure boardgamers - but overall, as a sum of its elements, it is a very entertaining and immersive experience.\n\nWhile you can play it in Solo-mode, it is much better enjoyed (or endured) with friends accompanying you during the campaign, sharing all the ups and downs of it.\n\nThe miniatures of the Core Set are beautifully sculpted, once assembled.\n\nYet, assembly demands some experience in the use of hobby knife, files (sanding), model building plastic glue and Green Stuff/Liquid Green Stuff usage.\n\nHobbyists coming from the Tabletop Wargaming angle will tackle the hurdle no problem; amateurs, though, might feel it to be an overwhelming or sobering challenge to assemble the models, especially since some of them have a multitude of parts, which (depending on the model built) sometimes don't fit properly into each other or leave quite some noticeable and hence annoying gaps.\nHere you should take your time slowly, because once assembled and treated well, they are awe-inspiring sculpts to behold, well worth the price. True pieces of art, well like the rest of the core boxes content.\n\nYou can see, and feel all the creative love and energy that has been put into it in every corner of its design.\n\nThe game goes heavy on the time it demands from you:\n\nBe it assembling the models, painting them, or playing the game, it will ask for your full devotion, care and karma to maintain it right.\n\nBut if you are willing to give in to its demands, you will most definitely get back the money and time you have spent into it.",
    "timestamp": 1698444000
  },
  {
    "username": "Welding",
    "rating": 7.0,
    "comment": "A flawed masterpiece. There's nothing quite like it in terms of actually feeling like a freeform playground: I've never seen so many little unlockable gameplay systems, unique narrative events and such rolled into a single game.\n\nHowever, I couldn't quite deal with the amount of paperwork you end up having to do the later you get into a campaign. When a character dies it's painful mostly because you'll have to do so much paperwork getting a new character back on the table.\n\nStill, an amazing achievement of mad genius.",
    "timestamp": 1697407200
  },
  {
    "username": "ToBakai",
    "rating": 7.0,
    "comment": "Verstehe die Beliebtheit und falls man bzgl. des Themas als auch der düsteren Stimmung positiv gestimmt ist, so erlebt man hier wahrscheinlich eines der epischten Spieleerlebnisse.",
    "timestamp": 1696802400
  },
  {
    "username": "ooba",
    "rating": 7.0,
    "comment": "Very thematic. You grow to love your characters only to see them die.\n\nArtwork is sometimes on the juvenile side. The core game really needs variety in the opening bosses though. You will restart many times and will grow bored of the lion very quickly.",
    "timestamp": 1696197600
  },
  {
    "username": "Hoju22",
    "rating": 7.0,
    "comment": "It arrived.\nIt was big.\nIt was daunting.\nIt was sold.\n\nIt is not missed.\n\nUPDATE 1.30.21:\nBuuuut...I bought it again. I'll give it a solid try this time.\n\nUPDATE 8.29.23:\nToo big and fiddly, but it definitely clawed an itch!",
    "timestamp": 1693346400
  },
  {
    "username": "Giggity_Gremlin",
    "rating": 7.0,
    "comment": "Needs Organizer",
    "timestamp": 1692309600
  },
  {
    "username": "sairam71",
    "rating": 7.0,
    "comment": "played it a few times. Really only got past the tutorial which was fine and fun. Don't really feel like i need to dive into this more. I've played a number of games that pit a crew against a monster/dungeon/story. I generally want it to be fast. I think Gloomhaven / Too many Bones is still my favorite of those and would play that any day over this.",
    "timestamp": 1689544800
  },
  {
    "username": "arking_mark",
    "rating": 7.0,
    "comment": "English second \"1.5\" edition --- Condition: Very Good --- Notes:\n1. Kingdom Death 1st ed\n2. KD Update Pack 1.5\n3. Kickstarter Survivor Level Rewards\n4. Starting characters are assembled and painted\n5. White Lion, Screaming Antelope, Butcher, and Phoenix are painted.\n6. Everything is sleeved",
    "timestamp": 1687903200
  },
  {
    "username": "Gorgoneion",
    "rating": 7.0,
    "comment": "I finally tried this bloated thing of a game, and I have to say it had some fun creating the village and deciding the course of the survivors will take.\n\nI was slightly bored by the combat system. One must be patient, I guess. I hope that with new weapons things will be a little bit smoother. Also the rules could be laid out better. If the monster \"grabs\" some figures, does it do so when they are on the ground? Questions not easily replied in the heat of battle... which slowed to a grind.\n\nNonetheless I'm excited about this overproduced monstrosity, so I give it a temporary \"8\".",
    "timestamp": 1679439600
  },
  {
    "username": "HBBackstar",
    "rating": 7.0,
    "comment": "Very overhyped game which is far too expensive for the gameplay it offers. The whole civilization part is not my kind of game.\n\nThe hunt phase is boring.\n\nThe hero turns are very oldschool and do not offer deep tactical choices.\n\nThe AI system of most bosses is well-designed, but overall the game is not nearly as tactical as it could have been.",
    "timestamp": 1678230000
  },
  {
    "username": "Zakoholic",
    "rating": 7.0,
    "comment": "kickstarted",
    "timestamp": 1678143600
  },
  {
    "username": "taeco",
    "rating": 7.0,
    "comment": "Bought it as strictly solo experience. Put in a lot of work to organize it, printing terrains and painted many of the minis to get a full experience. But a single fight with the phoenix evaporated all my enthusiasm for the game as it wiped out most of my people. Didn't touch the game in several months before deciding to finally sell it.",
    "timestamp": 1676674800
  },
  {
    "username": "BirdfluNuggetz",
    "rating": 7.5,
    "comment": "One of my favorite games, for various reasons. All 20 lbs. of it.\n\nIs it the \"best\" game? Tightest game? Most balanced game?\n\nNo to all.\n\nBut it is still one of my favorites. Like playing Demon Souls with cardboard.\n\nDoesn't hurt that my wife bought me this for Valentine's Day 2016, as a surprise.\n\nPlayed it, sold it. Was just holding onto it for sentimental reasons. Got enough for it to take my wife and me on a 4-day cruise. I'll take it.",
    "timestamp": 1759442400
  },
  {
    "username": "Tacoscott",
    "rating": 8.0,
    "comment": "Playing this weekly with a friend. At this exact moment this is a great game, and it might actually end up in excellent territory.",
    "timestamp": 1758060000
  },
  {
    "username": "pedrowski",
    "rating": 8.0,
    "comment": "To be Painted",
    "timestamp": 1757541600
  },
  {
    "username": "Masu",
    "rating": 8.0,
    "comment": "Sajátos kampányjáték civilizációmegteremtéssel egy fantasy világban. Véres az egész...\n\nTrade info:\nPárszor játszott. Fekete doboz, ezen biztos látszik már ez-az-amaz...",
    "timestamp": 1755208800
  },
  {
    "username": "carnodingo",
    "rating": 8.4,
    "comment": "Tactique\n\nItem de collection\nWOW. Best RPG/settelment management/story telling/miniature game I have. Worth the pre-order price (40% off). It is dark, grim, horrific, mercyless ,and alot of fun.\n\nRecommand for heavy gamers who look for a story driven games.\n\nAchat kickstarter first run / pre-order\nUpgrade pack 1.5\n+ gambler chest(aout 2023), Gorm, Satan (decembre 2021)\n\nType: Ameritrash\n\nCatégorie: Medium\n\nThème: Horreur\n\nMécaniques: Ai par deck de carte, gestions de campement, combat par dés, référence de tableau pour conséquence, horreur, Soloable, Boss fight\n\nSimilaire dans ma collection: Oathsworn\n\nTaille de la boite: Tombal",
    "timestamp": 1755122400
  },
  {
    "username": "Sorlag_XI",
    "rating": 8.0,
    "comment": "STORY",
    "timestamp": 1754776800
  },
  {
    "username": "alvinsimms",
    "rating": 7.6,
    "comment": "While listed “For Trade,” this game will be listed for sale soon.\n\nVery immersive and uniquely styled board game. Great with 2 to 4 players. Five players make it a bit long in the tooth.\n\nKD 1.5 Core Game, Dragon King, Flower Knight, Gorm, Gambler’s Chest, & Pathfinders of Death Crossover.\n\nDec 2020 is the only shipment yet to receive. Everything else is new and still in shrink-wrap.\n\nLove it but don't ever plan to put together the minis and play it. Still awaiting the treasure box (?) and Pathfinder minis from the last Kickstarter campaign.\n\nAlso have https://foldedspace.com/product/forbidden-stars Folded Space insert. $50 value. And expansion Folded Space insert - $20 value.",
    "timestamp": 1752530400
  },
  {
    "username": "w1219",
    "rating": 7.8,
    "comment": "#core #tts (very high cognitive load)",
    "timestamp": 1752098400
  },
  {
    "username": "ManikMan",
    "rating": 8.0,
    "comment": "An experience that is certainly not for everyone. If you do want a random emergent narrative rogue-like thing, this is one of a kind.",
    "timestamp": 1748815200
  },
  {
    "username": "Chris Coyote",
    "rating": 8.0,
    "comment": "01/18: 10 - Great campaign style game.\n\n__\n\nUpdate 01/19: 6.5 - not so sure anymore. This promises much, but delivers rarely. Oh so very luck prone. Let's see what the gamblers chest does to this one.\n\n05/25: played much more the past year, and loving it with my gaming buddies.",
    "timestamp": 1746136800
  },
  {
    "username": "Hiko9k",
    "rating": 8.0,
    "comment": "i was going to give it a 10 but i cant with all the parts that need assembling i just don't have the time for it and when i do some parts don't need to be this hard to put together .\nthey need to rethink the building part of this game to make it more enjoyable ' for now it's just frustrating to do it",
    "timestamp": 1745445600
  },
  {
    "username": "Aruwen",
    "rating": 8.0,
    "comment": "just wow",
    "timestamp": 1745272800
  },
  {
    "username": "DexGeek",
    "rating": 7.8,
    "comment": "Owner: Dex",
    "timestamp": 1744754400
  },
  {
    "username": "dalembertian",
    "rating": 8.0,
    "comment": "https://boardgamegeek.com/geeklist/301669/essen-2022-no-ship...\n\nwelgen\n+49 151 232 707 56\n€350\nThu 15:00",
    "timestamp": 1744495200
  },
  {
    "username": "Lum_Lum",
    "rating": 8.0,
    "comment": "I don’t even know where to start. It is such an adventure and I like the part of building gears and principles, innovations the best. Fighting monsters is so fun too. I just want to fight the monsters and get resources to get the things I want!!! Oh building minis are so fun too except for the part that I always get superglue on my hands and my skin is stuck to the minis. I just made my favourite survivor and lets see how long she will last in the game. Hooray!",
    "timestamp": 1742684400
  },
  {
    "username": "Gnufie",
    "rating": 8.0,
    "comment": "Played a ton of this, if you enjoy a good failure and a dose of schadenfreude this is for you. Fairly difficult and a lot of random punishment can be frustrating but once you realize losing is a feature not a bug you really start to experience this game as intended.",
    "timestamp": 1741474800
  },
  {
    "username": "Fubuju",
    "rating": 8.0,
    "comment": "The theme and style aren't for everyone, but I love this game. I used to play Everquest and World of Warcraft, and this game feels like a board game version of those games. It appeals to my addiction for leveling up, acquiring new gear, and making big things die.",
    "timestamp": 1740870000
  },
  {
    "username": "Aelynn",
    "rating": 8.0,
    "comment": "MY PENIS JUST CUT OFF WHILE ATTACKING LION!",
    "timestamp": 1739142000
  },
  {
    "username": "Jutsus",
    "rating": 8.3,
    "comment": "All in pledge - still waiting for GCE and all new Expansions..\n\nI have played first 20 -ish lantern years. Game is one of the best, but sometimes I feel like it should have a little less randomness, and a little more of puzzle style moments. I dislike the dice system.\n\nedit: GCE received, but wont open until I have finished my first play campaign (win or lose)",
    "timestamp": 1738623600
  },
  {
    "username": "Captain_Cuttlefish",
    "rating": 7.5,
    "comment": "This really is something unique. I think I did a pretty good job at not letting all of the hype put me in a state of seeing Kingdom Death through an overly optimistic eye during the wait before receiving my copy of the core game -although, I probably never would have gone for it in the first place due to it's price point if it weren't for all of the buzz and the overall features being promised in the game. During that period, I even purposefully avoided looking into the rules very much so that it would be a fresh experience, and something that I'd get to discover in person and with my own reason. And I've got to say, WOW, this really is something unique!\n\nThe Models:\n+Made of excellent material and with an excellent process, as far as I can tell.\n+The fixed pose figures (the monsters, starting survivors, intimacy survivors, and young and old survivors) have excellent sculpts.\n+Assembling the models wasn't something I was looking forward to, honestly, but after I got into it, I just kept going! For like two days!\n-Are what make Kingdom Death so expensive. Like I said, I've enjoyed putting them together, to my surprise, but I personally would like the gameplay and experience just as much even if the figures were replaced with nicely illustrated tokens. Assembling (and painting, if you like) the figures kind of seems like it's own thing in itself - like a second hobby project that happens to come in the same box as a board game. If you've already tried it and know you don't enjoy assembling models, then sadly, I would have a hard time recommending this package to you. About 70% of what you are paying for is the plastic... Unless you know somebody that does enjoy putting together miniatures, whose skills you trust, and is willing to do it, then I'd say go for it! If you've never tried it for yourself before, and you have some spare time, then I'd also recommend giving it a shot. All you need is super glue, sprue cutters, an X-acto knife, and tweezers occasionally. Other things that will really help are patience, good closeup eyesight (or a magnifying glass), and dexterous fingers.\n\n(I've got a lot more to say about Kingdom Death, but not the time to do it at the present.)",
    "timestamp": 1736636400
  },
  {
    "username": "Draiken23",
    "rating": 8.0,
    "comment": "only played the first encounter",
    "timestamp": 1735167600
  },
  {
    "username": "Saduhem",
    "rating": 8.0,
    "comment": "The quality is incredible and the setup is not as long as one would expect from a game with so many moving parts. The universe is enthralling and shrouded in mystery, leaving the discovery and interpretation to the player.\nThings that prevent this from being scored a 10 are:\n- The recent focus on selling individual miniatures through holidays with a single gameplay card as an incentive\n- Some of the original content is just not worth exploring, as the rewards are not worth the risk of losing your settlement\n-Absolutely begs for a PDF version of the book. Creator is concerned with Piracy, but the amount of flipping you'll do through the book as the story unfolds and events are rolled means you're going to have to buy an extra one if you're lucky enough to be one of the first 100 people getting it when it's available about once every two years.",
    "timestamp": 1734044400
  },
  {
    "username": "Yves1981",
    "rating": 8.0,
    "comment": "47",
    "timestamp": 1733698800
  },
  {
    "username": "Reciclerishu",
    "rating": 8.0,
    "comment": "This is very tricky game to rate, as from perspective of art, concept and immersion it is very good and theme-full. From perspective on rules and streamliness it is at times clunky and flimsy.\nI like concept and idea of group having campaign where you can build your own miniature modules, but I personally at point where miniatures to me are waste of space and money, I would be perfectly fine with standees, though I can appriciate what this game does in niche of miniature building.\nIt is a passion project to group of people, who enjoy this distressed world with good world building.",
    "timestamp": 1730588400
  },
  {
    "username": "argente",
    "rating": 8.0,
    "comment": "Regalo Black Friday nov 2023",
    "timestamp": 1728684000
  },
  {
    "username": "LeGon",
    "rating": 8.0,
    "comment": "Upgraded to 1.6.\nPlayed once, sitting on the shelf since.",
    "timestamp": 1727733600
  },
  {
    "username": "Cinesra",
    "rating": 7.5,
    "comment": "to test",
    "timestamp": 1723932000
  },
  {
    "username": "Neokarasu",
    "rating": 8.0,
    "comment": "Love the settlement phase of the game. The dice combat isn't my favorite but after a certain point, a lot of it can be mitigated by the stuff you have. The game definitely has a lot of things that players can abuse for power so your experience can get skewed by whether you're okay with abusing them or not. Overall though, I enjoyed the game enough to play it every day for weeks.",
    "timestamp": 1722290400
  },
  {
    "username": "TukanSam",
    "rating": 7.5,
    "comment": "The game is designed to be unforgiving and full of chance. If you can accept that, then it's one of the best RPG/civilization creating board games out there. Not to mention you'll get your money's worth. Stay away if you play a game once or twice and move on to something else. KDM is meant to be played over long campaigns.",
    "timestamp": 1720562400
  },
  {
    "username": "Hilted",
    "rating": 8.0,
    "comment": "I would play this game so much more if it was easier to get to the table. It's dark and Erie but man putting those minis together is not exactly my idea of fun",
    "timestamp": 1719871200
  },
  {
    "username": "frasti",
    "rating": 8.0,
    "comment": "Core, gambler, all monster and many survivor assembled, some painted\n\n24/06/17 nick fb",
    "timestamp": 1719871200
  },
  {
    "username": "Gaius",
    "rating": 7.5,
    "comment": "Wonderfully gritty horror themed fantasy RPG in a box. The hunt, showdown, and settlement phases are all exciting and immersive. Building new weapons, armor and tools out of the remains of your prey is particularly memorable. Really enjoyed our campaign, but while I wondered if the game will feel too \"samey\" fighting against the same old monsters the real danger was in the random events during the settlement phase. Our settlement was essentially wiped out within two lantern years. Also, would have liked to see the overarching storyline be more front and center in the early stages of the game. There are also some infamously crazy die rolls, but it's a genuine part of the experience.",
    "timestamp": 1719612000
  },
  {
    "username": "gixx",
    "rating": 8.0,
    "comment": "A true masterpiece for every ameritrash fan.",
    "timestamp": 1715292000
  },
  {
    "username": "ajewo",
    "rating": 8.0,
    "comment": "Kingdom Death: Monster is a relentless cooperative, skirmish game with a campaign and settlement building game.\n\nPros:\n+ Artwork: weird at times but quite unique. Clearly formatted cards.\n+ Atmosphere: world of survival and deposable heroes as well as the hillarious bosses.\n+ Cool, detailed combat system that offers a lot of possibilities.\n+ Players have to figure out what they are fighting (unknown).\n+ Fun monster AI, unique for each monster.\n+ Combat system: player control over the monster deck is the most fun part.\n+ Fun settlement phase due to progression. However, it is also the cause for grinding resources.\n\nNeutrals:\n# Plenty of random encounters and events (with unexpected, random deaths). Some random events can be quite devastating.\n# Very random / dice rolling / luck based / death (especially for the Hunt phase)\n# The Hunt phase is my least favorite phase. It is all about roll to resolve with some decision-making in order to determine how weak your party starts the upcoming boss fight. It takes too much time. However, for the first time, the events are very fun (novelty effect).\n# Sometimes repetitive (especially grinding resources)\n# Campaign-driven\n# Do not get attached to characters which will die sooner than later\n# All about combat\n# A lot of rule referencing\n# Long, time-consuming game\n# The course of the campaign is kind of a big optimization puzzle in order to win the game.\n# A lot of upkeep with constantly erasing and re-writing your character sheets\n# Very expensive game\n# Very big game box\n# Too many expansions????\n# Basically a solo game\n\nCons:\n- I do not mind the randomness in this game. For me, there is just too much time-consuming grinding for resources over the course of the campaign (fighting a boss over and over again). The battles also get samey after some time because there is not much tactical choices besides positioning, attacking, and manipulating the AI deck.\n\nSimilar games:\n* Aeon Trespass: Odyssey: Greek mythological setting, similar combat system, 7th Contentint inspired exploration., technology research.\n* Townsfolk Tussle: one-shot, easy-going boss battler\n* Kingdoms Forlorn: tweaked combat system by the same Designer of Aeon Trespass, narrative tile exploration adventure phase.\n* Oathsworn: narrative campaign game with boss fights.\n* Primal: The Awakening: focuses on boss fights and deck building. All about combat on an abstracted grid, no exploration phase.",
    "timestamp": 1710284400
  },
  {
    "username": "mquarmby",
    "rating": 9.0,
    "comment": "This game is pure genius, but a bit put off by poor release and communication. The GC addons are, in general, very cumbersome alternatives to the base game engine - a lot of extra work.",
    "timestamp": 1762383600
  },
  {
    "username": "Freya7351",
    "rating": 8.5,
    "comment": "This game is amazing, I love it. I would rait a 10/10, but the price is insane. I can't really recommend it too much, unless you hella rich",
    "timestamp": 1762297200
  },
  {
    "username": "MiMeu",
    "rating": 9.0,
    "comment": "(+)\nEmergent Narrative\n\n(-)\nGear Grid and Monster Control Panel material\n\n\nSurvivor Tokens\nLegendary Card Pack 1.6\nCore 1.6\nRulebook 1.6\nGamblers Chest\n(Preordered: Blackest Bundle)\n\nVignettes of Death:\nGigalion\n\nExpansions of Death Vol. I (Complete):\nGorm, Sunstalker, Slenderman, Lion Knight, Lion God, Dragon King, Dung Beetle Knight, Flower Knight, Manhunter, Spidicules, Lonely Tree, Green Armor Knight\n\n\nExpansions of Death Vol. II:\nWave 1 (Complete): Black Knight, Frogdog, Pariah, Red Witches, 4x Wanderers (Aeneas, Death Drifter, Candy, Goth), False Messengers, Percival\n\nWave 2 (Q4 2025 / Q1 2026): Campaigns of Death, Philosophies of Death Starbound, Philosophies of Death Heliocentrism, Honeycomb Weaver, Dead Armor\n\nWave 3 (Q2 2026): Inverted Mountain, Nightmare Ram, Gryphon, Oblivion Mosquito, First Hero\n\nWave 4 (Q4 2026): Silver City, Abyssal Woods, Pathfinders of Death\n\nWave 5(Q3 2027): Ivory Dragon, Super Survivors\n\nWave 6 (Q4 2027): Hypothetical slot for any further delays in releases",
    "timestamp": 1761429600
  },
  {
    "username": "duboiskk",
    "rating": 9.0,
    "comment": "There's nothing quite like it. It can become a lifestyle game obviously, especially so if you're into minis. But if you have the money and are interested in its selling points, the base game only is a unique experience with friends that I would not miss.",
    "timestamp": 1760738400
  },
  {
    "username": "b4retina",
    "rating": 9.0,
    "comment": "Kickstarter v1.5 Core Box, updated to 1.6\n8 survivors, butcher, lion, antelope, phoenix, Kingsman, The Hand, Watcher and Gold Smoke Knight painted\n\nStand alone sculpts;\nBlack Friday Ninja built\n\nSolo Campaign\n-People of the lanterns, had to restart, lost data\n-People of the Lanterns, The Wolf Den, LY18\n-People of the Dreamers, Wolf Dan,Gamblers Chest LY7\n\nCampaign with Lee,Jeff,Ken\n-People of the lanterns - started but never got past LY4",
    "timestamp": 1760133600
  },
  {
    "username": "TheLordsChips",
    "rating": 9.0,
    "comment": "Includes 1.5 Update and 1.6\n\n• 12 1.0 Expansions\n• Green Armour\n• 3D printed terrain\n• Gamblers Chest\n• Monster controller 3D Token\n• Extra Dice sets\n• Showdown Board Framed & Painted",
    "timestamp": 1759442400
  },
  {
    "username": "retlom",
    "rating": 9.0,
    "comment": "HARD AF narrated game and the models are excellent\nbut yeah EXPANSIVE 450€+ 50% during Black-Friday for the base game but contains a lot of content\n\nGamblers box Expansion Same price and content amount as base game\n\nNeeds a dedicated group to play it multiple times about 100h+ content in the base game also you kill a boss multiple times to farm resources and most likely you will wipe a bunch of times and need to start the grind over but it has multiple path choices so not to bad and keeps the game fresh",
    "timestamp": 1759442400
  },
  {
    "username": "Dspitzer",
    "rating": 9.0,
    "comment": "",
    "timestamp": 1759442400
  },
  {
    "username": "Trachten",
    "rating": 9.0,
    "comment": "Solo.\n12'19 thru 2'19: One failed settlement around L10, second one to L19.\n9/8/25-9/17/25: Restarted settlement at L20. Lost to Watcher.",
    "timestamp": 1758232800
  },
  {
    "username": "nathandbrown1",
    "rating": 9.0,
    "comment": "Roll dice, draw cards, get gear, level up. Really not as heavy as people say.",
    "timestamp": 1758146400
  },
  {
    "username": "ThumbOfGod",
    "rating": 9.2,
    "comment": "A UFO of a game. You love or you hate. The oversexualized content is unfortunate. Monster combat design and minis are supreme. Finding the right group for this can be a challenge. Solo play possible but not as satisfying.",
    "timestamp": 1757973600
  },
  {
    "username": "Valcurdra",
    "rating": 9.0,
    "comment": "This one is the masterpiece of a deeply disturbed mind. Unique doesn't even begin to describe, probably inconceivable is more like it.\n\nPredominantly a story driven game with a light dice chucking combat engine.\n\nAbsolutely dripping with theme and the story is incredibly creative.\n\nMinis are off the charts good, one for the serious modeller and painter.\n\nGive it a 9 because the actual combat is very light. Would be an 11 if more effort went into making the combat more interesting mechanically.\n\nEdit: Actually the combat is tactically light but strategically reasonably deep, after sinking into this game O enjoy combat a lot more and dying means nothing in the grand scheme.",
    "timestamp": 1756936800
  },
  {
    "username": "theradon",
    "rating": 9.0,
    "comment": "Co-op",
    "timestamp": 1756850400
  },
  {
    "username": "xCNapo",
    "rating": 8.8,
    "comment": "You can criticise this game a lot since it is very luck based and efforts a lot of bookkeeping. But man, the stories that this game tells just by playing it and the discussions that raise up within our group how to handle specific situations ... It offers the best coop experience I ever had in a game.\n\nI am a fan of heavy euros normaly, but this is by far the best slot machine I have ever played.  Excellent design and components, dense atmosphere and so much happening. Incomparable to other games. Love it!\n\n+ KD is the best looking board game that i know. A lot of games have nice single components and artwork (Scythe for example), but as soon as everything is on the table, they turn into a big colorful toyish mess. Whereas KD starts to look better, the more components you put on the table. Somebody put some serious thoughts in that. VERY well done!\n\n*Update 2021:\nPhew, I have to lower my score significantly. Whilst its a genious project, the most beautiful game out there and the best coop experience I ever had in board games, the game just grows so complex the longer a campaign goes (with all the innovations, disorders, fighting arts, families, partnerships) that its just impossible to track. Our last lantern year took 5 hours and settlement phase was a mess because there are just too many builds we could possibly do, not knowing which innovations were actually missing to progress for certain events.\nAt some point the game just misses to stay streamlined and begins to fall apart. That's very sad.",
    "timestamp": 1756677600
  },
  {
    "username": "Mageknight12",
    "rating": 9.1,
    "comment": "The cost is insane!!!\n\nThe best part of the game is the settlement when you build the innovation, craft a lot gear by resourse from monter hunt, build you grid gear. Module also is the thing make me play again but not another campaign game.\n\nThis not perfect game because a lot weird desgin, lot of word can change to icon for more cleaner like bleed token. Weakest part in this game is hunt phase, it can be more interesting. A Lot of event just lazy design - no have any option, some stupid event \"you die\" in game can change to ratio gain bleeding token without trouble.(this is almost way i play). Some event mabe have it or have choice ,but not just roll dice and dont have reroll.I think this problem can fix in future when they releasa all planned expansion.May be In KDM 2.0 ?",
    "timestamp": 1755640800
  },
  {
    "username": "jangopool",
    "rating": 9.0,
    "comment": "don't own but played several times with friend's copy. if you have a group you can commit to this game, it will be filled with memorable moments",
    "timestamp": 1754431200
  },
  {
    "username": "AzureDeath",
    "rating": 9.0,
    "comment": "Video Review: https://youtu.be/oGB81HDHvy8\n\nIncredible genre-defining game, even for solo. My only issue is the lack of digital rulebook PDF, and super fiddly miniature sprues.",
    "timestamp": 1753826400
  },
  {
    "username": "Borednomore",
    "rating": 9.0,
    "comment": "1.6 version..dont need to say anything much about this game.that hasnt already been said!..dark..very dark..brilliant game.",
    "timestamp": 1753308000
  },
  {
    "username": "DiggyDave",
    "rating": 9.0,
    "comment": "Loving this game. Definitely a hefty rules set, but once you get the hang if it you and a few friends will keep coming back for more.",
    "timestamp": 1749506400
  },
  {
    "username": "CasualGamer71",
    "rating": 8.5,
    "comment": "Very fun game. The settlement phase is very fulfilling and fun. The monsters are interesting, but I can see how it’d get a bit constraining only having a few to fight.",
    "timestamp": 1747778400
  },
  {
    "username": "Jeppelangaa",
    "rating": 9.0,
    "comment": "Might sell",
    "timestamp": 1746396000
  },
  {
    "username": "felipepelayo",
    "rating": 9.3,
    "comment": "9.4 with expansions. 8 for the base game.",
    "timestamp": 1746309600
  },
  {
    "username": "DonZaoli",
    "rating": 9.0,
    "comment": "One of the most epic games I ever played.\nThe miniatures assembly is sometimes a pain though \nThere is a model for every piece of equipment in the core box. Can't wait to purchase some addons if they will eventually restock them ^^",
    "timestamp": 1745532000
  },
  {
    "username": "Bartlett_",
    "rating": 9.0,
    "comment": "1.5 edition with upgrade pack.\nLaserox insert.",
    "timestamp": 1745100000
  },
  {
    "username": "MaxxoBass",
    "rating": 9.0,
    "comment": "Kingdom Death: Monster bietet außergewöhnliches emergentes Gameplay durch das Überleben in einer düsteren, gefährlichen Welt. Die Entscheidungen der Spieler haben große Auswirkungen auf die Entwicklung der Geschichte und die Verbesserung ihrer Charaktere.",
    "timestamp": 1743631200
  },
  {
    "username": "Cellardore",
    "rating": 9.0,
    "comment": "One of the \"Twenty\"\nNumber : 02\n350€",
    "timestamp": 1743631200
  },
  {
    "username": "mostlyfarmless",
    "rating": 8.5,
    "comment": "at Louis'",
    "timestamp": 1742684400
  },
  {
    "username": "metonymo",
    "rating": 9.0,
    "comment": "Great game, started loving minis too.\n1.6 update pack\n+ Dragon King, Dung Beetle, Slenderman, Flower Knight, Gorm\n+Gambler's Chest",
    "timestamp": 1742338800
  },
  {
    "username": "RkMaster",
    "rating": 9.0,
    "comment": "Nothing like it, only reason its not a 10 is the miniature assembly, personally not a big fan of it.",
    "timestamp": 1742338800
  },
  {
    "username": "leonso",
    "rating": 9.0,
    "comment": "My only complaint is that I struggle to find people to play with consistently.",
    "timestamp": 1741388400
  },
  {
    "username": "Mandor",
    "rating": 9.0,
    "comment": "An amazing grail game where individual lives are cheap and it's all about building your settlement. This great coop game has a rich theme, entertaining monster fights with AI and hit location cards, and plenty of randomness that makes each campaign different.",
    "timestamp": 1741215600
  },
  {
    "username": "DonPerizoma",
    "rating": 9.0,
    "comment": "sborro!\nNon avrai altro Dio al di fuori di questo.\n\"Per molti ma non per tutti\" come recitava una famosa pubblicità..\nN°1",
    "timestamp": 1739574000
  },
  {
    "username": "Cicerone",
    "rating": 9.0,
    "comment": "Best Boss Battler with a lot of Modularity. I will never play everything!",
    "timestamp": 1739142000
  },
  {
    "username": "BonzO24",
    "rating": 9.0,
    "comment": "French Rules Fanmade 1.6 - All in saison 1 & 2 - Expansion legendary pack 1.6 + Gambler chest (règles VF) + frogdog (règles VF)+ Black Knight (règles VF)+",
    "timestamp": 1738191600
  },
  {
    "username": "Soontir Fel",
    "rating": 10.0,
    "comment": "Pros:\n- What I like the most about boardgames? Thinking about a game, even when not playing it. And that´s exactly what KDM has to offer. What gear should I craft next? What would help in my next showdown against monster xy? Does a rearrangement of the gear I have, make that specific Survivor better? And so on. I love it!\n- Beautiful Artwork\n- with expansions you get a lot of modularity to customize your campaigns\n- The Monsters are very thematic (more than in Aeon Trespass: Odyssey) and building the AI deck random every time makes them feel different, even when fighting them multiple times\n- lots of options for the Survivor gear layout, experimenting with Synergies is fun\n- Survivors get individual over the course of the campaign (fighting arts, disorders, Injuries, and other stats)\n\nNeutral:\n- you need a custom storage system and a table where you can leave the core components of the game. Otherwise it´s a lot to set up and teardown every time you play. Same goes for ATO.\n\nCons:\n- I played this solo in the beginning. It is harder to play and not forget things (Disorders, Severe Injuries, Gear abilities, temporary modifiers etc.) than ATO. I can manage to play ATO Solo without any problems, but KDM is better for 2 players.\n\nI used a few quality of life add-on´s to make it easier to handle solo. I use the wooden player dashboards from fancybutfunctional, a 3d printed Monster controller board from etsy, custom tokens from Klutz studio and the very useful Scribe for KDM app.\n\nDon´t get me wrong, I think that KDM has the cleaner Ruleset. ATOs rules make me question and look on the Internet more than KDM. But KDM makes me forget things more and I have to be more focused during the showdown, if that makes sense.",
    "timestamp": 1761519600
  },
  {
    "username": "Koszubson",
    "rating": 10.0,
    "comment": "Darkest dungeon on steroids",
    "timestamp": 1761256800
  },
  {
    "username": "vites",
    "rating": 10.0,
    "comment": "2028-C",
    "timestamp": 1761170400
  },
  {
    "username": "toarukun",
    "rating": 9.5,
    "comment": "Collector Edition $700, heard many good things, Carson said it's amazing.\n\nGood story! Great imagery! Easy to play!",
    "timestamp": 1760997600
  },
  {
    "username": "cswgordon",
    "rating": 10.0,
    "comment": "There are few games that I would recommend to players who love the DND and tabletop experiences that last beyond one session. Kingdom Death: Monster is a board game that all serious TTRPG should attempt to own or play at least once in their lives. I, personally, am looking forward to the time where I can purchase this game again and play with all my friends.",
    "timestamp": 1759874400
  },
  {
    "username": "astroposer",
    "rating": 10.0,
    "comment": "Best one 10/10, love the art.",
    "timestamp": 1759528800
  },
  {
    "username": "Wrathchilde",
    "rating": 10.0,
    "comment": "Expacs: Gorm, Flower Knight, Sunstalker, Slenderman, Green Knight Armor, Dragon King, Lion Knight, Lion God, Dung Beetle Knight, Manhunter, Gamblers Chest, Red Wiches, Aeneas, Goth\nType: Turn-based Strategy/Boss Hunter\nReview: The game has an amazing ability to combine the experience of levelling up, base building with a narrative gameplay that doesn't overshadow the recurring boss fights.\n\nIt is a system that brings the gameplay of computer games like Heroes of Might and Magic to the tabletop. There is a lot of bookkeeping, which can be streamlined with use of an app, a good deal of randomness, and a very, very rich gaming experience.\n\nPersonally, I love the fact that every time a survivor has evolved and gotten new gear, I have the opportunity to model and paint a new interesting figure with a story to it.\n\nI highly recommend it.",
    "timestamp": 1759269600
  },
  {
    "username": "Robg028",
    "rating": 10.0,
    "comment": "A work of art…you've got to come to terms with the grind. It's a genre defining game for boss battlers & there is a lot of upkeep in the settlement phase. It's art is disturbing in the best possible way…",
    "timestamp": 1759096800
  },
  {
    "username": "fitech",
    "rating": 9.9,
    "comment": "My latest obsession since July 2024. A lifestyle game that makes me not play the rest of my collection.",
    "timestamp": 1757023200
  },
  {
    "username": "kabelrambo",
    "rating": 9.6,
    "comment": "+ Expansions of Death Vol. 1\n+ Gamblers Chest Expansion\n+ Black Knight Expansion\n+ Frogdog Expansion\n+ Red Witches Expansion\n+ Pariah Expansion\n+ Legendary Card Pack (1.6)\n+ additional 1.6 Rulebook\n+ Vignette of Death - White Gigalion\n+ Vignette of Death - Killenium Butcher\n\n+ 10th Anniversary Survivors\n+ 10th Anniversary White Speaker\n+ 15th Anniversary Survivors\n+ Aya - Lantern Armor\n+ Aya the Survivor\n+ Before the Wall\n+ Beyond the Wall\n+ Allison Twilight Knight\n+ Badar\n+ Black Friday Ninja\n+ Black Friday Ninja Variant 2021\n+ Detective Twilight Knight\n+ Devil Satan\n+ Echoes of Death I-IV\n+ Erza of Dedheim\n+ Early Survivor - Zelda\n+ Halloween Devil Satan\n+ Halloween Survivors Series II\n+ Halloween White Speaker\n+ Indomitable Survivor Greatest Gaxe Morg\n+ Indomitable Survivor Gusk Knives Grimmory\n+ Indomitable Survivor Longclaw Lenore\n+ Indomitable Survivor Lordsruin Titus\n+ Indomitable Survivor Thumping Timpani Ledla\n+ Legendary Character - Glow\n+ Legendary Character - Lantern Armor Aya\n+ Paul the Survivor\n+ People of the Sun - Sunlantern Armor Aya\n+ Pinup Order Knight\n+ Pinup Wet Nurse\n+ Pinup Warrior of the Sun\n+ Pinup Easter Twilight Night\n+ Pinups of Death Vol. I-V\n+ Reapokratis\n+ Ringtail Vixen\n+ Screaming Sun Armor\n+ Seed Pattern Jackel\n+ Seed Pattern Willow\n+ Skrelle\n+ Stampede Glaive\n+ Survivors of Death I\n+ Swashbuckler\n+ Till Death do us part\n+ Vitanox\n+ White Speaker\n+ White Speaker Sword Hunter\n+ White Sunlion Armor\n+ Willow\n\n+ Black Friday Death Dice\n+ Golden Bat Death Dice\n+ Holiday Death Dice\n+ Winter Death Dice\n\n+ RollinMats Kingdom Death: Monster Playmat v1 - Slot Version\n+ Xelaser Kingdom Death Inlay\n+ Xelaser Gamblers Chest Inlay\n+ Xelaser Settlement / Hunt Board",
    "timestamp": 1756936800
  },
  {
    "username": "wduke99",
    "rating": 10.0,
    "comment": "My all time favorite game.",
    "timestamp": 1756418400
  },
  {
    "username": "muuntautuja",
    "rating": 9.9,
    "comment": "Almost a 10/10 as a preliminary rating after five plays. Don't know if it'll beat Aeon Trespass: Odyssey as my favorite boss battler, but it's close.",
    "timestamp": 1756418400
  },
  {
    "username": "hwki",
    "rating": 9.7,
    "comment": "Kingdom Death (Backerkit)\n2022-01",
    "timestamp": 1755813600
  },
  {
    "username": "ChthonicKnight",
    "rating": 10.0,
    "comment": "Production Quality  [9]\n➕Great looking models\n➕Artwork and direction is fantastic\n◾Packaging is functional but not perfected (outside organizer is preferred)\n◾Most components are solid\n➖Model assembly required for play\n➖Cards easily damaged outside of sleeves\n\nTheme and Setting  [10]\n➕Story is short and sweet, leaves interpretation up to the players\n➕Dark and gritty atmosphere brings players into the game\n◾An 18+ setting with explicit scenes\n\nRules and Instructions  [9.5]\n➕A good tutorial to the combat basics of the game\n➕Rulebook has decent structure grouped by phases to help find details more quickly\n➕The rulebook contains a moderate and competent index for reference\n◾Complexity of the mechanics make the rules sometimes hard to follow\n\nGameplay Mechanics  [10]\n➕Combination of strategy, combat mechanics, and dice rolling create a well crafted boss battling game aspect\n➕Victory over monsters create an exciting and choice filled advancement and structure phase\n➕Plenty of options and diverse mechanics make the whole game stay exciting over various plays\n➕Game is well balanced once you get the hang of the difficulty and advanced combat mechanics\n◾Difficulty may be off-putting for some players\n◾Game management gets tedious the fewer players you have under 4\n➖Random acts may kill off characters or even the entire game and can cause a lack of enjoyment\n➖Death in a combat encounter or hunt can cause a player to sit out of the game\n\nTime and Cost  [9]\n➕Just from the base game there is hundreds of hours of gameplay and much replayablity.\n◾A single game session will always be around an hour or two minimum\n➖Very expensive game\n\nOverall: 10.0\nThis is one of my favorite games of all time, the depth, combat, variance, difficulty, RPG elements, story enrichment all come together to bring this game to the ultimate survival game that surpasses any before its time. Players may find the game difficult if they do not understand the nuances of combat or priority of the settlement over individual characters. However once realling digging into the game and its hands off story telling and in depth mechanics will not be disappointed at what they come to discover within Kingdom Death.",
    "timestamp": 1755813600
  },
  {
    "username": "thetruedworkin",
    "rating": 10.0,
    "comment": "Best boss battler yet. Yes, it's quite complicated, but I still love playing it every chance I get. Gets the adrenaline pumping.",
    "timestamp": 1755036000
  },
  {
    "username": "Haine",
    "rating": 10.0,
    "comment": "GOD",
    "timestamp": 1754776800
  },
  {
    "username": "ChristosStergianidis",
    "rating": 10.0,
    "comment": "I am totally addicted to KDM.\nBOARD LIFE GAME",
    "timestamp": 1754172000
  },
  {
    "username": "bridablink",
    "rating": 9.5,
    "comment": "AA",
    "timestamp": 1753999200
  },
  {
    "username": "natlas",
    "rating": 10.0,
    "comment": "An absolute masterpiece of board gaming, Kingdom Death: Monster combines brutal tactical combat, deep character progression, and rich storytelling into an unparalleled experience. Every choice matters in this dark, nightmarish world where survival is a constant struggle. The stunning miniatures and detailed world building make it feel like more than just a game, it’s a full-blown adventure. If you love deep strategy, cooperative play, and immersive narratives, this god-tier game is worth every moment!",
    "timestamp": 1751407200
  },
  {
    "username": "kingdomdeath",
    "rating": 10.0,
    "comment": "This is my favorite game and yes, I created it.",
    "timestamp": 1751407200
  },
  {
    "username": "magicman6173",
    "rating": 10.0,
    "comment": "**storage**",
    "timestamp": 1751148000
  },
  {
    "username": "LelandPalmer",
    "rating": 10.0,
    "comment": "10/10 if you are into this kind of game (not for everyone).\nIs a game to play a campaign once in a while but the stories we live when playing this are worth of a book.\nEverything was a problem: building the minis (some came with errors so they wont fit) some sleeves are impossible to find where i live and lots of other stuff, in the end i think it was more of a “feature” than a problem, the entire thing wants you dead.",
    "timestamp": 1751148000
  },
  {
    "username": "nyclipper",
    "rating": 9.5,
    "comment": "DEAD! The first campaign ended in year NINE with a TPK\nTAKE TWO: Lantern Year 12. about to hunt a Antelope",
    "timestamp": 1751148000
  },
  {
    "username": "ruindavidson",
    "rating": 10.0,
    "comment": "My first boardgame and the one, which changed my life.\n\nA true King of the boss battler genre and a great source of inspiration for lots of similar projects.\n\nHigh-quality HIPS, unique and attractive art style without any AI, tons of expansions, and dice-driven combat create an exciting and memorable personal stories of struggles and survival in the grimdark world of Kingdom Death.\n\nBest game for the fans of grimdark fantasy genre like Berserk or Dark Souls with the elements of Monster Hunter.",
    "timestamp": 1749247200
  },
  {
    "username": "JudgeJacket",
    "rating": 10.0,
    "comment": "I’m intimidated... utterly seduced, and fascinated.\n\nEasily my favourite board game ever.",
    "timestamp": 1749074400
  },
  {
    "username": "Nickeddy01",
    "rating": 10.0,
    "comment": "Ghastly and Glorious. Half way through my second campaign and I am loving it! The stories this game creates are enthralling and consuming.\nI have deluxified it in a few ways to enhance the experience.\n(e.g. I've made my own custom character sheets with space for gluing on character portraits, generated from AI image creators. I want the players to really connect with their characters before they are brutally killed.)\n\nIf you are thinking of getting this game, buyer beware; miniature assembly and painting can be very time consuming, but also very rewarding if you're like me and get into it.\nIt also takes a lot of shelf space, especially if you have expansions.",
    "timestamp": 1747000800
  },
  {
    "username": "C3Gaming",
    "rating": 10.0,
    "comment": "1-4 players\nBest: 2-4\n30-90m\nNo core\nExp.: Gambler's Chest\nAnonymous Survivor\nDeath Drifter x2\nGoth Amy x2\nLY3 Candy & Cola x2\nPathfinders of Death x2\nSuper Survivors x2\nAbyssal Woods\nCampaigns of Death\nDeath Armor\nFirst Hero\nFrogdog\nGryphon\nHoneycomb Weaver\nInverted Mountain\nIvory Dragon\nNightmare Ram\nOblivion Mosquito\nPariah\nRed Witches\nScreaming God\nThe Silver City",
    "timestamp": 1746568800
  },
  {
    "username": "sebawrc",
    "rating": 10.0,
    "comment": "Great game.",
    "timestamp": 1744668000
  },
  {
    "username": "PainMerchantGaming",
    "rating": 10.0,
    "comment": "Version 1.6",
    "timestamp": 1744149600
  },
  {
    "username": "ckohlmeier",
    "rating": 10.0,
    "comment": "Amazing experience. Brutal. Great models.",
    "timestamp": 1743631200
  },
  {
    "username": "Gez_Plissken",
    "rating": 10.0,
    "comment": "Painted",
    "timestamp": 1743458400
  },
  {
    "username": "Tazzro",
    "rating": 10.0,
    "comment": "Its a lifestyle game. The gear grid system and innovative monster systemet and sandbox nature, makes Kingdom Death: Monster an outstanding experience, that no other game have come close to yet.\nWith a system like this, that are things that are not perfect (yet), but does not change the overall score.",
    "timestamp": 1742252400
  },
  {
    "username": "dhaeman",
    "rating": 10.0,
    "comment": "Not sure I'll ever play a campaign without forgetting some rules, but it's a blast.",
    "timestamp": 1741474800
  },
  {
    "username": "Tillyvanilly49",
    "rating": 10.0,
    "comment": "Es saugt mich in diese Welt ?",
    "timestamp": 1740610800
  }
]