[
  {
    "username": "Glanzmuecke",
    "rating": 1.0,
    "comment": "I will never understand how people are enjoying this (again: I am not the target group for this game). Even from a thematic point of view it is just awful to play the Gods, who do play against the natives. Seeing people playing this over and over again makes me sad.\n\nThe game tries to be anti-colonial, but in my opinion, it fails miserably. If you want to play an anti-colonial game, you should definitely check out Tindaya.",
    "timestamp": 1756245600
  },
  {
    "username": "JasonMerosa",
    "rating": 1.0,
    "comment": "In my attempt to play, I had some sort of panic attack. Every awesome idea I had was ruined with energy, slow reactions, or bad range. The frustration got to me, I had to walk away.",
    "timestamp": 1755727200
  },
  {
    "username": "pieffem",
    "rating": 1.0,
    "comment": "Worst 3 hours of board game I ever hand. Yes, I don´t like coop, but this was horrible. It felt like just adding badies to the board and try to get rid of them. Material is cardboard, plastic and wood but I like the way to build the map. Everything else I dont understand this rating, its more a puzzle than a game.",
    "timestamp": 1755036000
  },
  {
    "username": "zmartianov",
    "rating": 1.0,
    "comment": "This game glorifies European colonialism",
    "timestamp": 1754604000
  },
  {
    "username": "Marinejock1970",
    "rating": 1.0,
    "comment": "No. Horrible game. What a waste of time.",
    "timestamp": 1753999200
  },
  {
    "username": "stevebein",
    "rating": 1.0,
    "comment": "The worst boardgaming experience I've ever had. The rulebook explains almost nothing. I tried playing solo and couldn't even figure out what I would want to do on my turn or why I'd do it. Then an expert taught me how to play, and now I can say the game isn't incomprehensible, it's just a chore. Type-2 fun for the fans, I think. No fun at all for me. Worker placement is right, but emphasize the *work*.",
    "timestamp": 1752012000
  },
  {
    "username": "jqh928",
    "rating": 1.0,
    "comment": "I rated this originally a 6 because it is one of those games I seriously have to be in the mood to open the box and play. Well, it's taken a year after my first review to get back in the mood and oh boy, I wish I had not.\n\nI really just do not get the hype about this game. It's not that complicated but the rules make it hard to pick up - again. It has a great living FAQ because it needs it. The rules are very poor and make the game seem more complex that it is.\n\nAfter playing another three games to try and see what everyone else sees in it, I gave up being bored with the repetitive nature. Yes, the different spirits alter things, as do the scenarios. But it's still the same old boring rhythm and fiddly admin.\n\nNow rated just 1.\n\nSOLD",
    "timestamp": 1746050400
  },
  {
    "username": "liquidsn8ke",
    "rating": 1.0,
    "comment": "shit game",
    "timestamp": 1744927200
  },
  {
    "username": "xtraturn",
    "rating": 1.0,
    "comment": "I’ve played it twice—once with three players, and once with four. Maybe this is a fundamental issue with cooperative games, but in this one, I feel that experienced players tend to make the decisions for the group. In Spirit Island, there are Spirits that support or empower others, which allows for more collaboration. Here, you're constantly trying to solve the \"puzzle\" of the game. Invaders are everywhere, and they explore or build, adding pressure. Primarily, you want to prevent Blight so that the lands don’t collapse. As a group, you identify problems and try to coordinate what actions to take. This happens in several iterations, with different approaches being explored, but ultimately, it’s the more complex Spirits that decide what should be done because, of course, you don’t want to lose the game. You repeat this for several rounds. At times, you feel overwhelmed and the game seems like it’s about to be lost, but eventually, there comes a point when you’ve survived the worst, and you just want to \"finish\" the game. Often, at that point, nothing exciting happens anymore, and you win the game. Sorry, but I can't recommend it at all.",
    "timestamp": 1742857200
  },
  {
    "username": "Alb1979",
    "rating": 1.0,
    "comment": "Horrible experiencia disfrazada de juego molón. Aburrido, enrevesado y tedioso como él solo. Cooperativo que se siente prácticamente como solitario y de los pocos cooperativos sin información oculta que me ha parecido un dolor jugar en solitario. Lo empecé a jugar con mucha ilusión pero cuanto más lo jugaba, menos ganas tenía.\n\nEso sí, queda muy bonito en mesa, las ilustraciones son chulísimasy la idea está muy bien. Pero al final la dureza de la gestión de la mano hace que todo se venga abajo. Dado puerta tras 4 partidas.",
    "timestamp": 1734476400
  },
  {
    "username": "Ksmith30",
    "rating": 1.0,
    "comment": "I would push through the long play time and the convoluted rules if it weren't for the theme. Don't appreciate it when the designers of a game try to be antagonistic and preachy with their own agenda in a not-so-subtle way.",
    "timestamp": 1734303600
  },
  {
    "username": "dontnickme",
    "rating": 1.0,
    "comment": "Its really just a solo player game. Horrible as group play. Too long and group solitaire and randomness",
    "timestamp": 1733266800
  },
  {
    "username": "peterzuel",
    "rating": 1.0,
    "comment": "Por su contenido negrolegendario antiespañol. Los conquistadores españoles son convertidos en demonios invasores. No al antihispanismo. No al racismo.",
    "timestamp": 1732921200
  },
  {
    "username": "SilentNSly",
    "rating": 1.0,
    "comment": "A single-player game disguises as a co-op. It's just not my kind of game.",
    "timestamp": 1732489200
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "What if SPIRITS could also ENGINE BUILD and form ECONOMIES? Now we can appeal to every generation at once!",
    "timestamp": 1722463200
  },
  {
    "username": "Leppry_Khan",
    "rating": 1.0,
    "comment": "It's like someone took Pandemic and thought, \"How can I turn this game inside-out and make it the most overly complicated play possible?\"",
    "timestamp": 1714600800
  },
  {
    "username": "ZacBobisKing",
    "rating": 1.0,
    "comment": "WHY IS THE APP 20 DOLLARS",
    "timestamp": 1707606000
  },
  {
    "username": "Magrot",
    "rating": 1.0,
    "comment": "I feel like I'm in Bizarro world. How so many people rate this slog fest uninspired piece of trash so high here on the Geek makes my head want to explode. Thank god I didn't pay for it, it was given to me as a gift. Its boring, preachy, ugly to look at, and turns don't feel like they matter at all because they pretty much play themselves. In fact I wouldn't even call it a game. Its more of a puzzle, and not a fun one at that.",
    "timestamp": 1702249200
  },
  {
    "username": "Slashdoctor",
    "rating": 1.0,
    "comment": "Never again.",
    "timestamp": 1701730800
  },
  {
    "username": "MotherMary",
    "rating": 1.0,
    "comment": "Saving this spot for a second game, willing to raise, but doubt I am missing anything.",
    "timestamp": 1682460000
  },
  {
    "username": "salom_bottle",
    "rating": 1.0,
    "comment": "if you like spending 3+ hours on your first session with a game still not understanding the rules, and not only not understanding your strategy but also trying to manage other players who don't understand their strategies, spirit island might be the perfect game for you. throw away this game and buy a few decks of magic: the gathering.",
    "timestamp": 1675810800
  },
  {
    "username": "tierdal",
    "rating": 1.0,
    "comment": "really boring choices, way too much finnicky upkeep, dry gameplay...hard pass",
    "timestamp": 1674946800
  },
  {
    "username": "xmanden",
    "rating": 1.0,
    "comment": "Frustratingly tedious game that promises more fun than it delivers. Gameplay needs some streamlining and the rule book could be better. The plastic components are decent quality, but I'm not a fan of the sculpted plastic bits for the invaders and then have colorless wooden mushroom bits for the island people.\nThe artwork is good.\n\nI like co-op games and solo games in general. For me, this one misses the mark completely. I wonder if an expansion will bring this to life.",
    "timestamp": 1673132400
  },
  {
    "username": "Tegarend",
    "rating": 1.0,
    "comment": "Terrible components, terrible game experience. No clue what the hype is all about.",
    "timestamp": 1671318000
  },
  {
    "username": "CJE1111",
    "rating": 1.0,
    "comment": "What a ridiculously patronizing concept especially so because of the fantastical elements.",
    "timestamp": 1667775600
  },
  {
    "username": "illusionDS",
    "rating": 1.0,
    "comment": "awful, boring, overrated, co-op, least interesting theme imaginable",
    "timestamp": 1662069600
  },
  {
    "username": "Wombat24",
    "rating": 1.0,
    "comment": "Tedious, repetitive, overly complex. Two hours into a game you have no idea if you're winning or losing, and after two hours you just don't care.\n\nThe rule are incredibly poorly written and you need to expect to waste 4-6 hours just to try to make sense of them, and then another 2-4 hours playing the game, only to find that you don't understand the point of the game.\n\nThe parts are very small and hard to handle, and the two board play space, plus the amount of supply you have, mean you need a big table to play this on. I played it with 1 other player. I could not imagine 4 players trying to play this game, it's impossible to get a common understanding of what you're supposed to be doing.\n\nI liked the novel concept, but execution is bad.",
    "timestamp": 1643670000
  },
  {
    "username": "Wolvercote",
    "rating": 1.0,
    "comment": "Perhaps more fun than waterboarding but debatable.",
    "timestamp": 1624917600
  },
  {
    "username": "PTN19",
    "rating": 1.0,
    "comment": "The theme is stupid, and the gameplay is very tedious.",
    "timestamp": 1562709600
  },
  {
    "username": "MatthewJohnsonApps",
    "rating": 1.0,
    "comment": "Absurdly long and complicated. Most co-op games use artificial mechanisms to ensure they aren't just a solo game. This one seems to use complexity and exhaustion to make sure that nobody is able to alpha dog.",
    "timestamp": 1557180000
  },
  {
    "username": "DavidAC",
    "rating": 1.0,
    "comment": "I don't get why such a boring game is so popular!?!",
    "timestamp": 1553727600
  },
  {
    "username": "copcopps",
    "rating": 1.0,
    "comment": "Mechanically, two words: Needs streamlining. Apart from the theme I don't see what draws anybody in with this Ferngully with numbers filed off board game apart from it being not similar to Pandemic. I don't see why there would be slow powers and fast powers apart from the fact it's a game. Ironically this game is designed to prevent quarterbacking but the convoluted rules of this game would insist on quarterbacking. Also why would spirits of the land get MORE powerful when the colonists get more influence on the map? Shouldn't it be reversed? If that was the case this might actually be good and interesting but nope.",
    "timestamp": 1550012400
  },
  {
    "username": "Frozen Flesh",
    "rating": 1.0,
    "comment": "I came here, because of all the people rating mature themed games like KD:M or Hate with a 1, just because of their mature them.\nThis games theme is boring!",
    "timestamp": 1547074800
  },
  {
    "username": "AdmiralCrunch",
    "rating": 1.0,
    "comment": "Pure trash. Best used as kindling.",
    "timestamp": 1519772400
  },
  {
    "username": "Peepser",
    "rating": 1.0,
    "comment": "Don’t enjoy coops, as they are not games, they are puzzles. Ooo! It has hard levels. Relentlessly flailing over and over to beat a game is the epitome of pointlessness to me. Yay! I won. I can stare at the box cover and gloat, then immediately throw it out. If you like solving puzzles and gaining some kind of strange, inherent satisfaction from fighting a game opponent that doesn’t care if you win or lose or leave it on the shelf, then have fun! Best part about the board game hobby is that there are more and more co-ops and solo games coming out all the time which means I’m saving a lot of money by not buying any more games.",
    "timestamp": 1519599600
  },
  {
    "username": "BunnyGer",
    "rating": 1.0,
    "comment": "Way too much book-keeping. 75% more streamline would be appreciated.",
    "timestamp": 1516402800
  },
  {
    "username": "rick3623",
    "rating": 1.0,
    "comment": "Terrible. Misguided design. Nonsensical theme.",
    "timestamp": 1514156400
  },
  {
    "username": "MYKERAN1965",
    "rating": 1.0,
    "comment": "One of the worst mosts needlessly complicated games I've ever played.",
    "timestamp": 1504216800
  },
  {
    "username": "arad70",
    "rating": 2.0,
    "comment": "Not for me, didn't like the game",
    "timestamp": 1753912800
  },
  {
    "username": "zasizo",
    "rating": 2.0,
    "comment": "Erős Pandemic utánérzés, csak nem olyan letisztult.\nEgyesek szerint az előd játéknál könnyen kialakul az alfa játékos probléma, itt meg nem, de ez intelligencia kérdése is, nevetséges a játékra fogni, mint hibát.\n\nSZELLEMEK SZIGETE:\nA természetvédelmi téma önmagában nagyon érdekes. Egymással kooperálva, ősi szellemekként kell segítenünk egy sziget őslakóinak a betolakodó telepesek építkezéseivel és természetromboló terjeszkedésével szemben. A játékmenet viszont ehhez képest mechanikus, elképesztően monoton, nagyon ismétlődő és végtelenül sokáig tart. Borzasztóan unalmas. Az egymást követő játékfázisok periodikusan ismétlődnek, amíg ki nem tanuljuk az egyedi képességekkel bíró szellemek erősségeit és gyengéit, ehhez azonban legalább 4-5 alkalommal kéne a játékkal játszani, de nem kapcsolódik hozzá izgalmi faktor, tehát az kizárt.\nNem hiszem, hogy játékosként 4x3 órát kéne rászánnom arra, hogy utána majd az 5. játéknál talán majd kialakul a jó élmény. Nevetséges. :-)\n\nNekem nem sikerült átélni a telepesek ijesztő terjedését, mint előtte sikerült a vírusok terjedését a Pandemic játékban, pedig a két játék között \"kísértetiesen\" sok a hasonlóság. A Szellemek szigete azonban tényleg csak egy túlbonyolított Pandemic klón, és sokkal jobb az.\n\nA tervezők sokféle variálhatóságot belevittek, mégis egysíkúak a kijátszott lapok adta lehetőségek. Ahogyan az is, hogy milyen döntések mentén tudjuk kordában tartani az egyre intenzívebben terjeszkedő telepeseket.\nA legnagyobb hátrány az irreálisan hosszú játékidő. Az ember érzi, hogy ugyanazokat a köröket rója, ugyanaz történik, és sosem lesz vége.\n\nHa annyira fanatikus gémer lennék, hogy azt gondolnám, nem a játék van értem, hanem én vagyok a játékért, biztosan több időt adnék neki, hogy megszeressem, talán tetszene is a végére, de így csak azt látom, hogy egyáltalán nem eredeti az ötlet, a Pandemic által bevezetett mechanika visszaköszönése pedig kifejezetten zavaró.\nA hasonló mechanizmus a Tiltott-sorozat darabjainál még ötletesen tért vissza, ott nem csap pofán az érzés, hogy teljesen ugyanazt kapom már megint, csak más köntösben.\n\nDe a fő negatívum, hogy szinte csak úgy lehet megnyerni a játékot, ha a félelem lapok mind elfogynak a félelem pakliból, azok meg nagyon nehezen akarnak sorra kerülni. 2 fővel ez nagyon monoton, és mint említettem, túl hosszú az egész.\n\nNagyon szerettem volna szeretni a Szellemek Szigetét, de pont az ellenkezője történt. Életem leghosszabb szabályértelmezése, legvontatottabb és leginkább monoton játékmnenete, valamint legrosszabb játékélménye. Kifejezetten elhibázott játéknak tartom.",
    "timestamp": 1753221600
  },
  {
    "username": "GuySamstag",
    "rating": 2.0,
    "comment": "Game aside, I suspect the people who praise the theme of this as refreshing and subversive and whatever are the same pop culture addled brains who call pith helmet \"explorer hat\".",
    "timestamp": 1753135200
  },
  {
    "username": "DaSnow",
    "rating": 2.0,
    "comment": "I understand why people love and praise it, but after playing the game at least 10 times I'm just not into the wack-a-mole aspect of it.\n\nI had really high hopes for this one considering how much it was hyped. After playing the game solo so I can better teach the game for the first time, I understood that there was a lot I could improve on which made me excited to get better at it.\n\nI tried to teach this game to my fiancé, and we had to stop early because she was not having any fun with the game. She was just not into it, and honestly, neither was I. We have a friend who got really into the game after I taught him, but unfortunately I couldn't match his energy.\n\nSpirit Island is very prone to quarter backing as well. There are optimal moves that you should make, and if you're not familiar with it's system, you're going to need a lot of help just to survive.\n\nThere is enjoyment that is earned from the game on learning your sprit, and how it interacts with other spirits, but personally I just couldn't get into it.",
    "timestamp": 1752616800
  },
  {
    "username": "veve33",
    "rating": 2.0,
    "comment": "The most frustrating experience trying to learn a game I have ever had. It might just be me. I am too scarred to try again.",
    "timestamp": 1748210400
  },
  {
    "username": "larrydurbin",
    "rating": 2.0,
    "comment": "Played and played and just couldn't find any fun , which is why I play board games. Sold it.",
    "timestamp": 1744495200
  },
  {
    "username": "Gamma68",
    "rating": 2.0,
    "comment": "The theme doesn't appeal to me. The game tells no story and is just extremely hard. After doing the same thing for two hours, you just want to finish the game, no matter what.",
    "timestamp": 1737154800
  },
  {
    "username": "bennschie",
    "rating": 2.0,
    "comment": "Sold",
    "timestamp": 1736118000
  },
  {
    "username": "DaytonBoardGamer",
    "rating": 2.0,
    "comment": "It was overly heavy and complicated for our enjoyment. The rulebook was too much to digest.",
    "timestamp": 1734649200
  },
  {
    "username": "aaj94",
    "rating": 2.0,
    "comment": "It's fun, and challenging, but if you can gut it out the fear cards will win you the game. 2 hours of doing the same thing on repeat gets old after a while. I didn't feel the deck-building aspect of my spirit and the game dragged on, even though we ultimately won.\n\nOverwrought and overhyped  I might try Horizons again sometime, but why invest more time in a game I bounced off of so hard?\n\n(Get a life and don't bother geekmailing me to berate me for having an opinion: you know who you are)",
    "timestamp": 1734562800
  },
  {
    "username": "hiimjosh",
    "rating": 2.0,
    "comment": "This game is good but not exciting. The spirits are certainly fun and the cardplay is good, but the game itself has similar tempo/arc issues to Pandemic. The fast/slow nonsense melts my brain a bit. Call it petty, but I also hate how you lay building on their side - was there not a better way to track this?\n\nEDIT: Tried to come back to this, but I hate it. Too complicated and slow without enough compelling decisions to make up for those faults. I’d rather just play Pandemic.",
    "timestamp": 1732921200
  },
  {
    "username": "stacie_everdell",
    "rating": 2.0,
    "comment": "The jury is still out on this for me which is why I haven't rated it yet. It's taken quite a while for me to go from frustrated to slightly curious. To be honest, it's usually not a good sign for me when it takes some time to 'get into' a game. But I am going to hang in a little longer to explore different spirits and play at least a few times double-handed. I've been playing solo, one-handed only.\n\nUPDATE: Played my first 2-player game today and I am quite certain at this point that this will be leaving my collection. The deck building is slow and tedious, the board shifts slightly but essentially is an unchanging onslaught of invaders. There are no epic moves. Wins are not too difficult, but just anti-climatic and not fun.\n\nSOLD on BGG",
    "timestamp": 1715032800
  },
  {
    "username": "kimbelov",
    "rating": 2.0,
    "comment": "Нот май кап оф ти.",
    "timestamp": 1712095200
  },
  {
    "username": "AmzyWumzy",
    "rating": 2.0,
    "comment": "This was a game that my family was recommended to play by a sales assistant in a games shop, as we explained we are fans of interesting co-op games. To our dismay, after having read the rule book, watched several YouTube tutorials and given it a go, we were able to play the game, but barely. My family is quite accustomed to playing complex games, however this one was on another level. First off, the instruction booklet lacked fundamental information. For example, when told to “populate the island boards with invaders, dahans, and blight, as indicated by the icons in each land” there was no key in the instructions as to what each symbol meant. It was only after the fourth video I watched, that I learnt what each symbol meant. I only happened upon the key when looking at my quick-reference cards of which it was on the back. Furthermore, this game, in my opinion, was complicated for the sake of being complicated. Each new rule, special ability and sub-clause, did not add to the game, it merely added to my confusion and\nannoyance. Overall, it is unlikely that we will be trying the game many more times, if again at all, which is unfortunate because we had such high hopes for it.",
    "timestamp": 1704409200
  },
  {
    "username": "prancingPWNy",
    "rating": 2.0,
    "comment": "Edit: played a couple more times and I just can't enjoy it. I am perplexed at the high rating. I would sell it but unfortunately Wife enjoys it.\n\nThis game makes me feel like I'm trying to clean my room while little gnomes run around messing it up at the same time. Progress made is constantly undermined. There are few if any points in the game where you feel like you've reached a milestone - it's just a constant dance of pieces moving around the board until the game ends. There are some cool ideas in the game though. I do like the \"roles\" of each spirit, which makes teaming up and cooperating fun. And the complexity of the game is such that quarterbacking is greatly diminished in the game, though highly experienced players can probably read the game state easily enough to slide back into the quarterback role (just tell em no thanks!).",
    "timestamp": 1698444000
  },
  {
    "username": "gamerdoge",
    "rating": 2.0,
    "comment": "bad experience with 5p. game doesn't feel to flow smoothly even though I have a good GM. setup is too long. very fiddly: too much moving parts. typical coop. nothing exciting.",
    "timestamp": 1689544800
  },
  {
    "username": "Beedun",
    "rating": 2.0,
    "comment": "I am not sure why this game gets so much love. We tried, but my group never asks to play this one again. Meh.",
    "timestamp": 1682287200
  },
  {
    "username": "LOVE_2_PLAYERGAMES",
    "rating": 2.0,
    "comment": "Really awful game. Set up takes forever, rule book is bad and needlessly complex and expensive on top. Game not meant for casual or intermediate game players.",
    "timestamp": 1673737200
  },
  {
    "username": "Victoria_hermit",
    "rating": 2.0,
    "comment": "Pandemic. Spawning monsters that you have to stomp on before they get too numerous. You need to spread out to gain powers/energy while mini-maxing your hand of cards for special powers. This is better than pandemic insofar as you get more choice in your actions so it is a deeper tactical game. Not something I care for but willing to play if if given no other choice (whereas I refuse to play pandemic).",
    "timestamp": 1667689200
  },
  {
    "username": "PhilSchwarzmann",
    "rating": 2.0,
    "comment": "Ameritrash cooperative game of wack-a-mole. Less of a game and more of an activity. Clearly not my cup of tea.",
    "timestamp": 1666130400
  },
  {
    "username": "Vase",
    "rating": 2.0,
    "comment": "Bleh, classic Euro experience that feels more like a chore than a game. Tried it because of all the rave reviews and high rating, decided after three plays I never needed to play it again.",
    "timestamp": 1656972000
  },
  {
    "username": "acegammer5",
    "rating": 2.0,
    "comment": "Quite honestly, we didn't even finish this game. This might a very highly rated game here, but I did NOT get the hype. Which is sad because I've been waiting for it for a while, only to be majorly disappointed by it.\n\nFirst off, to me, this game felt very Dark Souls. In that, I felt like things were stacked against you from the get go, you had to do things perfectly and rely on a certain amount of luck (2 of us drew power cards 3+ times that not one option would feasible aid us) in order to succeed. I had the same issue with \"Battle for Greyport\" when played that. People did not have access, even gated, to enough tools to make it work. If I'm going to play something that PvE, I need to know that I have access to tools or success, even if I don't have them right now.\n\nAdditionally, there are a lot of elements to it that aren't intuitive at all, and we sought clarification multiple times via online, which isn't unheard of, but they were for basic elements. My best example is the innate traits. I'm not sure the publisher knows what innate means, but it certainly isn't how they have the game setup, and it was a significant frustration (If I can never get traits to fulfull the needs, then you can't use them, and since it requires power draws to do it, and then cards played, you just don't get access to those.)\n\nI don't really care to go on though as this is just a whisper in the wind compared to everyone's glowing reviews. I just know I've played much better co-op games recently in \"Paleo\" and \"Return to Dark Tower\" so I'm more than happy to let this dud go without a second playthrough.",
    "timestamp": 1656367200
  },
  {
    "username": "bbolch",
    "rating": 2.0,
    "comment": "The current king of heavier Co-Op game. If you love cooperative gaming this is definitely a game you should try. For me the game felt like work and it just wasn't enjoyable.",
    "timestamp": 1655330400
  },
  {
    "username": "Bazzisbazz",
    "rating": 2.0,
    "comment": "Tried the app, but it is just not for me. It is just a large puzzle with cards with powers not a board game. Several video games I'd prefer over this even with the app.",
    "timestamp": 1653948000
  },
  {
    "username": "Polgara",
    "rating": 2.0,
    "comment": "didn't like it. too fiddly, we got stuck doing the exact same thing for several rounds, we couldn't change our strategy because we'd have lost instantly, so now we lost after several more turns instead.",
    "timestamp": 1647817200
  },
  {
    "username": "Greenflash21",
    "rating": 2.0,
    "comment": "This is a theme that is right up my alley. Love the mythology behind this. However after set up for 1 hour I was already tired of it",
    "timestamp": 1640559600
  },
  {
    "username": "mogcaiz",
    "rating": 2.0,
    "comment": "Eager to play because of the hype with 3 of my friends. We were left confused and puzzled if this was \"it\". Every player turn is all about pushing a rock to the top to see it tumble it down because enemy/AI turn said so. Then rinse and repeat till you finish the last round.\n\nI get this is a cooperative survival game, but this is by no means my first experience with survival type board games, and I get it is supposed to be about striving to overcome. It's just that the mechanics feels extremely cheap, especially the enemy/AI turn, resulting in feeling that your previous actions was completely pointless.\n\nIn this game, it means using player abilities to remove enemy tokens from the island you protect, either directly or indirectly by cooperating with friendly tokens and cooperate with your friends. Then to have the game make the very same enemy tokens spawn back into the island, while claiming insultingly; This is fun!! And in the next enemy turn we will spawn even more! No, its not fun. To stay afloat you have to either kill some enemy tokens or upgrade your cards/abilities, so you can get ridd of more enemy tokens in the next turn. That's basically your options. It honestly feels like a job and the joyous part is you survived till the end; its finally Friday and no work tomorrow.\n\nI sold the game for half price the very next day.",
    "timestamp": 1639782000
  },
  {
    "username": "jrrightmyerjr",
    "rating": 2.0,
    "comment": "Not for me. Too many bits and bobs and too complex for casual folks.",
    "timestamp": 1633644000
  },
  {
    "username": "Peter Loftus",
    "rating": 2.0,
    "comment": "This has easily been one of the least pleasurable learning experiences I have had. The rules are quite poor. They leave a lot of questions unanswered. Actually playing the game, is pretty rough too - you'd need some good player aids to keep track of what you are supposed to be doing. I really was on the verge of just selling this on. Maybe I will keep it and give it one more session...",
    "timestamp": 1629324000
  },
  {
    "username": "Mangelk",
    "rating": 2.0,
    "comment": "Slightly better than most coops. But it runs longer, so you are wasting your time for a lot longer.\n\nCould not be convinced to play it again.",
    "timestamp": 1622152800
  },
  {
    "username": "thegeorgeh",
    "rating": 2.0,
    "comment": "DIGITAL EDITION",
    "timestamp": 1618956000
  },
  {
    "username": "skytostar",
    "rating": 2.0,
    "comment": "Really don’t understand this is rated such a high geek ratings. It makes people very tired and extremely repetitive, stupid, dry , huge bookkeeping, artificial mechanism, feel suck even after winning game ,makes no sense story and rules. What else do you need for a terrible game?\nI would prefer playing snakes n ladder to this because S and L is more fun.",
    "timestamp": 1613084400
  },
  {
    "username": "h4angel",
    "rating": 2.0,
    "comment": "I was so hyped about this game, especially for solo. This disappointed a lot. The game is just not fun, and the production quality poor. There are much better (cooperative /solo) games.",
    "timestamp": 1588543200
  },
  {
    "username": "Goldron",
    "rating": 2.0,
    "comment": "work together, it wont be easy to succeed.\nfeels a bit mathematical, dry.",
    "timestamp": 1585951200
  },
  {
    "username": "orange",
    "rating": 2.0,
    "comment": "Another overwrought coop game with an extremely stupid story. Waste of time and cardboard. This game pollutes the world.",
    "timestamp": 1576710000
  },
  {
    "username": "tnec",
    "rating": 2.0,
    "comment": "This game is not beautiful, and not immersive.",
    "timestamp": 1562104800
  },
  {
    "username": "Joghurt",
    "rating": 2.0,
    "comment": "Horribly clunk, missing any elegance and not solving quarterbacking at all.",
    "timestamp": 1558994400
  },
  {
    "username": "neuroblaster500",
    "rating": 2.0,
    "comment": "Convoluted, bad rulebook, boring, so much opportunity for quarterbacking, overhyped.",
    "timestamp": 1550012400
  },
  {
    "username": "Telaz",
    "rating": 3.0,
    "comment": "My rating(50%): 3\nMy “want to play-again” rating(50%): 3\nMy overall rating: 3\nPlays: 1\n\nMy favorite part about this game is the complexity. If I’m going to play a coop game, I like there to be a real challenge.\n\nI don’t like the cards at all, I think the options you can get for cards are just pretty bad. Several times I would draw 4 cards and like none of the options and choose one of 4 bad/boring options.\n\nThe decision space is super high for cards you do choose and reminded me of choosing cards in Jaws of the Lion. A system I just don’t enjoy.\n\nAnd it was very long. I can’t imagine I’d ever want to play again.",
    "timestamp": 1761865200
  },
  {
    "username": "dj_koen",
    "rating": 3.0,
    "comment": "Ome of the worst games i played\n\nEspecially its theming is horrible, the gameplay is passable but still boring",
    "timestamp": 1759528800
  },
  {
    "username": "MagicMicha",
    "rating": 3.0,
    "comment": "Its a cooperative game and this is one of the problems. Long periods of discussion as a team leads fast to a supervisor sub team in the players group. The rest is set back and following orders.\n\nYes this is black and white.\n\nIf all are actively discussing the right strategy it might be interesting ... but it is just not my turf.",
    "timestamp": 1758751200
  },
  {
    "username": "Colnics",
    "rating": 2.5,
    "comment": "Boring",
    "timestamp": 1757714400
  },
  {
    "username": "doerrhb",
    "rating": 3.0,
    "comment": "Way too many restrictions on what you are allowed to do, along with an enemy that spreads like an epidemic. It was a frustrating slog, at least for my group.",
    "timestamp": 1756591200
  },
  {
    "username": "utexgrad",
    "rating": 3.0,
    "comment": "We are rating this the way we are simply because we don't typically gravitate towards punishing games, which this one absolutely is. The design is great, the components are good and all of the variable powers between the spirits means you really have to take the time to find the right combination so that everyone can work together as best they can to accomplish the goal.\n\nRest assured that thought is definitely required, along with an understanding that you are likely to get absolutely crushed. I'm guessing if we played more games we would get much better at it. We'd probably still lose quite a bit, but the wins would be more frequent and satisfying.\n\nSo if you are willing to take a beating over time to get to that point, you are going to love this game. We're just not sure yet if we are willing to put in the effort to get this game to the table more often to get there.\n\nUpdate: After playing this game more, we just don't like it. My wife really, REALLY hates this game. She told me she would rather never play board games again than play this one.\n\nI am not hating on it quite that....demonstrably, but I am totally fine getting rid of this game and never playing it again. I love co-op games generally, but this one is just not for me.",
    "timestamp": 1750370400
  },
  {
    "username": "pinkzeppelincult",
    "rating": 3.0,
    "comment": "Truly great fun to learn; but once you get the hang of it and start increasing the difficulty, it reveals itself as strategically prescribed, fairly random, and extremely fiddly. Also takes an age and a half to set up, play, and tear down, even with a good organizer—and too much of that playtime is spent counting and recounting bits and symbols. Just not a satisfying experience after the novelty wears off.",
    "timestamp": 1748901600
  },
  {
    "username": "dreamer1789",
    "rating": 3.0,
    "comment": "Just didn't have fun with this one. It wasn't the teach: we had a good teacher. But there was so much admin for the settlers and then our teacher just ended up telling us what to do the whole game. We were not 'clicking' with the game, we didn't have fun and it took hours.",
    "timestamp": 1748383200
  },
  {
    "username": "Destrio",
    "rating": 3.0,
    "comment": "First impressions\nHyped up cooperative game, but it sort of delivers for me. I'd much rather play it than others because it is easy to let each player be the owner of their turn.",
    "timestamp": 1745964000
  },
  {
    "username": "iamDragoncat",
    "rating": 3.0,
    "comment": "Was sorely disappointed by this game. I had such high hopes, but playing this game is basically impossible. No matter what you do with your friends against the invaders, they just spread too quickly and spawn in such high numbers that winning this game feels impossible, coupled with the fact that getting new powers is so difficult and time consuming. Destroying towns and cities is incredibly unsatisfying because you know that next invader phase they're gonna spawn more than you ever had a chance to destroy.\n\nThe spirits look and sound great in theory and in their descriptions, but the core gameplay feels strained and essentially like Sisyphus pushing his round boulder for eternity. Every action and power (aside from some major ones) feels like nothing and even some slow powers feel just underpowered and useless in stopping these invaders. The real problem, however, is the blight, which ended our games more than once. And yes, we've tried using many blight removal cards, and then the invaders multiplied and we had no chance. There is just no fun in this game, it feels like there's nothing you can do no matter how hard you try.",
    "timestamp": 1745704800
  },
  {
    "username": "MorelliBuendia",
    "rating": 3.0,
    "comment": "I don't get all the praise for this one. It is cool to try the different spirits, but it is pretty underwhelming. It is a decent puzzle but it never really makes me excited and the end is the most anticlimactic ever. You play a power or turn a fear card and that's it, you win. No matter how close you are, it's always a \"oh, okay, it's over\".\n\nI rate it a 7 for now because it is a decent design, the spirits give it a lot of variability and I feel like I can get quite a few games in before I decide to sell it, but the feeling of epicness and character development is zero as compared to something like Mage Knight.\n\nEdit: Sold after 9 plays. It's just boring. I gave it a chance and tried several scenarios but I was just torturing myself. It's not a 7, I was being too generous.",
    "timestamp": 1745359200
  },
  {
    "username": "AnnaNishimiya",
    "rating": 3.0,
    "comment": "Glorified single prayer chess",
    "timestamp": 1739142000
  },
  {
    "username": "Ndholl01",
    "rating": 3.3,
    "comment": "I don't understand the appeal this game was not excited nor did we feel like ever playing it again. Quite possibly one of the worst games I've ever played.",
    "timestamp": 1738882800
  },
  {
    "username": "dr glaze et al",
    "rating": 3.0,
    "comment": "If co-op games are your thing and you want something a little more involved that also discourages playing one another’s turn: this is the game for you! I was tolerant of its excesses.\n\nIf you prefer elegant or robust games with more choice and less fiddling detail and laborious setup, look back to classics like Pandemic. My girlfriend’s eyes were glazed over before we’d even set it up for a trial play.",
    "timestamp": 1738537200
  },
  {
    "username": "PaniGrazynka",
    "rating": 3.0,
    "comment": "I've put a lot of effort into liking this game, but it just doesn't click for me. I read the rules, watched videos, and even tried to play the digital version on a tablet, to be sure I was not missing the \"magic sauce\", that makes this game such a well-rated title. The problem is, that once I got beyond the trenches of understanding the rules and everything, nothing was waiting for me on the other side. Spirit Island feels more like a puzzle, than a game for me, and apparently, it's not my cup of tea, although I understand some people may love it. So I recommend giving it a try, preferably digitally, and check for yourself. If it's your thing, then ok, go with it. But if it's not, then don't feel bad, you're not alone.",
    "timestamp": 1735513200
  },
  {
    "username": "tscox87",
    "rating": 3.0,
    "comment": "I don't really like coops on general, and I found this too heavy and complicated for me on top of that.",
    "timestamp": 1735254000
  },
  {
    "username": "tectactoe",
    "rating": 3.0,
    "comment": "Another \"digital only\" game for me—I've no interest in trying to engage in this level of upkeep and general rules over the course of a 3- or 4-hour game. That said, I'm largely in awe of the mechanics here and how the game generally plays, even if it can be unforgiving and difficult for beginners. Perhaps a bit anticlimactic the way some of the games can end (e.g. when you acquire enough fear to deplete the deck to a specific condition) but the look-ahead puzzle it creates is almost always interesting and deliciously brain-burning.",
    "timestamp": 1734822000
  },
  {
    "username": "Kdvanderpool",
    "rating": 3.0,
    "comment": "Just don’t like it. It’s simply not fun to play\n\nWe spend 75% of the time managing the “bad guys” move, 24% strategizing our moves (which ends up being the best player telling everyone else what they should do) and 1% actually executing our strategy just to start all over again.\n\nHonestly don’t understand why this game has gotten so much great press.",
    "timestamp": 1732230000
  },
  {
    "username": "Sobotka",
    "rating": 3.0,
    "comment": "This game just doesn't do anything for me. I just straight up do not like it.\n\nSold 11/13/24",
    "timestamp": 1731452400
  },
  {
    "username": "FrAnkX0r88",
    "rating": 3.0,
    "comment": "Usually I dont give low ratings but here I have to make an exception. It seems overrated to me, but thats not my problem with the game. Its the theme and mechanics combined that i strongly disliked. It so fiddly and gave me nothing back. My first game felt like wasted time. Do not see myself playing that one again. I have to admit I'm not a coop player at all most of the coop games I play because friends want to.",
    "timestamp": 1730329200
  },
  {
    "username": "Zaungast",
    "rating": 3.0,
    "comment": "Reminded me of the wheat and chessboard problem, so many fiddly white pieces on a board. Definitely did not feel any spirit.",
    "timestamp": 1729375200
  },
  {
    "username": "Ika0",
    "rating": 3.0,
    "comment": "this is a flawed game. an overhyped monster. one of the most boring games I had chance to play, and I wanted to like it, I adore the theme.\n\nIt's Entropy the Game. you are fighting entropy. You can call it France, Sweden, Russia or England, but simple rules that generate exponential growth, very similar to Pandemic, is not the kind of mechanism I enjoy playing against.\n\n\n1. when the scales tip and you are 100% certain to lose, there can be an hour left to play out. bad design.\n\n2. it does not scale well with player counts, you are disallowed to tell what you have in your hand, but should cooperate and coordinate with other players? bad design.\n\n3. variety is illusion. you have similar actions with different symbols and names and deck composition, but it all boils down to same 10-ish stuff you do on the board. bad design.\n\n4. a huge part of the game is left to be bought in the expansion for the game to be complete. bad consumer practice.\n\nI don't like the art design either. The main side of the boards seem like a quilt, not like a representation of the island features. The other side if pretty, but it has different settings and is not interchangeable. Cards have mushy art which is too small. Upgrade is foiled player boards. Why? who needs foiling when there are other cosmetic upgrades that would be much more valuable. seems like a cash grab.\n\non the top of everything, the game is boring to me. it's extremely rules heavy, it is a chore to play, mechanisms are not fun to play out. It's not a top 500 game for me, let alone top 10.",
    "timestamp": 1725141600
  },
  {
    "username": "Drrabbits",
    "rating": 3.0,
    "comment": "tedious, dry and devoid of fun. Tried playing with three different groups, none of them enjoyed it. I fail to see how this is such a hit.",
    "timestamp": 1724968800
  },
  {
    "username": "Apaal",
    "rating": 3.0,
    "comment": "Analysis Paralysis: The Game.\nTo mention this game in the same sentence with mage knight is an insult. This is the only game in my collection which feels like work. Awful expirience. Overrated game.",
    "timestamp": 1723845600
  },
  {
    "username": "Fawkes",
    "rating": 3.0,
    "comment": "Bad game. Super dry puzzle-solving procedural co-op that overstays its welcome and is thoroughly unfun and uninteresting. Way too complicated for its own good; needed a lot more development to simplify and streamline, and add more fun to the proceedings. Knizia's The Lord of the Rings is the gold standard and this doesn't come anywhere close to that experience.",
    "timestamp": 1722549600
  },
  {
    "username": "poclaude",
    "rating": 3.0,
    "comment": "I had high hopes for this game, but it’s not my cup of tea. I don’t think it’s a bad game, just not for me. If you look at my collection, the difficulty can’t be the reason. In fact I don’t think the rules are difficult once you get to know them. This made me think why I don’t like it. In my opinion (so this is subjective) it’s a lack of choice. Yes, you can choose your character, which cards to play and keep, how to progress your spirit,… . But if I ( again my point of view) want to win the strategy is always the same. Avoid expansion as much as possible, try to clear the island from the inland while accepting some damage along the coast, finally attack the coastal land. This with a bit of luck with the cards is my concept. But I can see why others like the game.",
    "timestamp": 1720735200
  },
  {
    "username": "WolfgangofChrist",
    "rating": 3.0,
    "comment": "fun idea",
    "timestamp": 1720476000
  },
  {
    "username": "brownsound",
    "rating": 2.5,
    "comment": "Próbowałem dwukrotni i dwukrotnie nie pykło. Nie czuję tej gry i nie zamierzam na siłę się do niej przekonywać.\nWysoka ocena na bgg - dla mnie niezrozumiała.",
    "timestamp": 1712959200
  },
  {
    "username": "DoenselWashington",
    "rating": 3.0,
    "comment": "Terrible and long manual, took ages to start playing. Everyone was exhausted when we finally got the hang. Not impressed by the game mechanics.",
    "timestamp": 1712872800
  },
  {
    "username": "Tjorriemorrie",
    "rating": 3.0,
    "comment": "Very difficult game. Always lost. Sold.",
    "timestamp": 1711321200
  },
  {
    "username": "TheMob",
    "rating": 3.0,
    "comment": "Very difficult to rate, since this \"is a good game if you like the complexity\" but it's a bad game if you don't. This was too heavy & complex for me.",
    "timestamp": 1710889200
  },
  {
    "username": "hacklan07",
    "rating": 3.0,
    "comment": "Great mechanics, well designed, and even interesting puzzle, but the fun factor is so low I honestly don't ever need to play this game again. There's plenty of other games that give a similarly satisfying decision space but with good fun factor.\n\nThe sandboxy-ness of this game also reduces the score for me, I'd much rather know that every combination of thins is winnable than some combinations being simply impossible to win. why have that combination exist at all? At least provide some type of difficulty guide so folks know what they're getting into when they setup.",
    "timestamp": 1709247600
  },
  {
    "username": "Cheryllion",
    "rating": 3.0,
    "comment": "I tried, I really tried. This was not on my wish list because I never liked the artwork, but hubby got it for me on a whim. The rule book sucks; there's too much flipping around in it to find what I need, which is a total turnoff. I keep missing steps because it's not intuitive. And it just seems like I'm adding an invader and I'm taking off an invader I'm adding an invader and I'm taking off of an invader. It does nothing for me. For a game that has English written all over the place, it still relies too much on icons. Just tell me what to do, step by step. Even the videos don't help because everyone's set up seems to be completely different. I tried dyed, but they have the horizons version on there which is seemingly exactly the same but because it's just different enough, it wasn't helpful. Setup is a drag.",
    "timestamp": 1703890800
  },
  {
    "username": "wanne",
    "rating": 3.0,
    "comment": "ausgeliehen",
    "timestamp": 1698012000
  },
  {
    "username": "AnnaKonda",
    "rating": 3.0,
    "comment": "do not like",
    "timestamp": 1697752800
  },
  {
    "username": "donathos",
    "rating": 3.0,
    "comment": "Clearly this is a game for a specific kind of player. That player may be you, but after several games (many more than shown here), I have come to the conclusion that it is not me.\n\nSpirit Island is awash with fiddly little mechanisms and minor powers that, in theory, ramp up over time. But because it is cooperative, and consequently the challenge for any given player and their board is random, it can overwhelm you immediately, far beyond your powers to prevent... or it can leave you with a completely unchallenging experience.\n\nIn theory, players can thus work together to balance out the state of things, but in practice, this is often not possible. Mostly every player simply inhabits their own little world, at least until the late game. And often the late game is anticlimactic -- if you're winning generally, then you're REALLY winning late; and if you're losing generally, well... suffice it to say that the outcome can be obvious well before the actual end of the game.\n\nSome of these complaints could probably be applied to many or most cooperative games. But where a game like Pandemic has an elegance to its rules, Spirit Island overcomplicates everything. If you'd like a higher difficulty experience, you don't simply add an extra Epidemic card, for instance, but rather you have to apply five new separate difficulty conditions at various points in the turn sequence, and contend with a new lose condition, and modify the effects of certain cards, and on and on. This game comes straight from the \"more is more\" design school.\n\nMaybe none of this would matter if the gameplay itself were more enjoyable, but it isn't. You're never really pursuing any grand strategy, but mostly it's very narrow-range, tactical decision-making... and that can be fine, but... the best way I can describe it is, you're like a middle-management grunt at McDonalds. You're putting out fires as they pop up (oh no! we're out of Coke syrup, send someone out to replace it fast! oh no! the bathroom needs cleaning because someone puked before reaching the stall! oh no! the ice cream machine is broken again!), just waiting for your fifteen-minute break, hoping that the shift manager doesn't wander by. Your cards/powers are often quite limited, especially early game (and just as fiddly as anything else), so the grand promise of being a powerful spirit never really seems to come to fruition.\n\nIn the end, this game is complicated, but does not seem to me to be all that deep. It's more work than it is fun.",
    "timestamp": 1688076000
  },
  {
    "username": "Joakley815",
    "rating": 2.5,
    "comment": "- Terrible. Will not play again.\n\nI am not the biggest fan of card games with lots of weird card abilities (like Sentinels of the Multiverse for example).",
    "timestamp": 1679439600
  },
  {
    "username": "ggruetze",
    "rating": 3.0,
    "comment": "Definitely not a game for me",
    "timestamp": 1675638000
  },
  {
    "username": "GMTLover",
    "rating": 4.0,
    "comment": "We wanted to like it.",
    "timestamp": 1760997600
  },
  {
    "username": "jwebert1346",
    "rating": 4.0,
    "comment": "Have played this a few times, and have found that it isn't for me. I feel that it plays similar to many other cooperative games but just adds more means to the same end.\n\nThe combos are cool and the characters are unique, but to me a lot of this game feels like fluff that makes turns hard to track and annoying to read (sheer volume of text).",
    "timestamp": 1760565600
  },
  {
    "username": "414448",
    "rating": 4.0,
    "comment": "Challenging, thinky game with some clever mechanisms. It surprises me to find this on the thematic list,* though, and frankly, it also surprises me that the game is so popular.\n\nI like how Spirit Island turns the cluesess eurocentricity of euro game theming on its head (whitewashed colonial administration is, sadly, a thing in euro games), but cartoon spirits operating on a cardboard quilt are really hard to engage with for me and I don't find this game immersive at all. It's more of an abstract puzzle than a story.\n\nThis game, however, has some aspects to it that, combined, made me appreciate the cooperative challenge somewhat. Firstly, the different spirits are VERY different from each other. That means that the different players will contribute in their own, very unique way. Secondly, there's so much to keep track of that it might be hard for a single person to gauge the entirety of the game state and always know what to do. For these reasons, Spirit Island could be an interesting challenge. It's decent from a mechanical point of view, but it's not an adventure, not a story - more of a dry euro. The looks definitely don't help, either.\n\nI'd play Pandemic over this any day, as it does more, or at least as much, with less and feels less abstract and is more likely to be experienced as a narrative.\n\n* This seems no longer to be the case.",
    "timestamp": 1758492000
  },
  {
    "username": "DunkDaTrunk",
    "rating": 4.0,
    "comment": "It didnt work for me",
    "timestamp": 1757714400
  },
  {
    "username": "Sorlag_XI",
    "rating": 4.0,
    "comment": "CO-OP",
    "timestamp": 1756764000
  },
  {
    "username": "ShelfScan",
    "rating": 4.0,
    "comment": "Comment",
    "timestamp": 1755036000
  },
  {
    "username": "Arnar146",
    "rating": 4.0,
    "comment": "Gisli",
    "timestamp": 1754517600
  },
  {
    "username": "Satireaside",
    "rating": 4.0,
    "comment": "Very complex game that has a host of scenarios. The different spirits are neat, but it can become a slogfest if even one player isn't tuned in closely to the flow of the game.",
    "timestamp": 1754258400
  },
  {
    "username": "DWilson11",
    "rating": 4.0,
    "comment": "Retail Edition with Branch & Claw",
    "timestamp": 1751148000
  },
  {
    "username": "rharn",
    "rating": 4.0,
    "comment": "Embodies several elements I don't enjoy in board games -- tons of rules, heads-down engine building, 2+ hour playtime, vulnerability to co-op quarterbacking. Won't seek out further plays.",
    "timestamp": 1750111200
  },
  {
    "username": "NotThatSalem",
    "rating": 4.0,
    "comment": "Whack-a-Mole. I'd rather play real whack-a-mole.",
    "timestamp": 1749592800
  },
  {
    "username": "chaniatreides",
    "rating": 4.0,
    "comment": "2019-2024/10",
    "timestamp": 1749420000
  },
  {
    "username": "ourmove123",
    "rating": 4.0,
    "comment": "The base game feels like a predictable, yet difficult, whack-a-mole game.\n\nThe invaders (opponent) do the same things over and over again, and you are tasked with using spirits to destroy/remove them.\n\nThe game loop is very repetitive, so the game feels more like a puzzle.\n\nThe co-op aspect feels non-existent for the most part.\n\nThe components are decent.\n\nThe artwork is okay.\n\nThe theme is meh.\n\nThe naming of spirits and cards is excellent.\n\nSetup and teardown feels tedious.\n\nVictories feels unrewarding and anti-climactic.\n\nI feel there's excessive cognitive load trying to remember adversary/scenario rule changes, relative to the reward. The app is better in this regard as it keeps track of all the necessary information/rules.\n\nThere's minimal tools to track the game's state.\n\nThe game is marketed as a cooperative game, which I was hoping for, but I feel it plays significantly better solo.\n\nI prefer the digital app MUCH better than the board game because you don't need to set up or tear down, and the app keeps track of all the data points.\n\nThere's a lot of complexity and tedious setup/teardown, and all without a rewarding feeling!",
    "timestamp": 1748988000
  },
  {
    "username": "Hinmatt",
    "rating": 4.0,
    "comment": "I usually don't like cooperative games unless they have a cool twist that pulls me in, e.g., a possible traitor element, the theme or they are rather short and easy to learn.\nIn this game I could not find such a twist. Some people like the unique theme of nature/spirits against settlers in the game. I didn't find that interesting. The game itself felt pretty heavy and long and it was not easy to understand how to play well.\nI didn't like it, but you might.",
    "timestamp": 1748642400
  },
  {
    "username": "Elden7",
    "rating": 4.0,
    "comment": "j'ai trouvé ce jeu tres moyen...je comprend pas l'engouement.",
    "timestamp": 1748556000
  },
  {
    "username": "beep_beep",
    "rating": 4.0,
    "comment": "This isn't really a game at all; it's a highly customizable kit for cranking out zillions of variations of the same basic optimization puzzle. It's great for what it is, but I just have no interest in it, especially given how fussy and time-consuming it is. I also don't enjoy the look or feel of the components.",
    "timestamp": 1744840800
  },
  {
    "username": "Shaybebe",
    "rating": 4.0,
    "comment": "Spouse loves this game so I play occasionally but not personally a fan.",
    "timestamp": 1741820400
  },
  {
    "username": "Vernalis",
    "rating": 4.0,
    "comment": "I absolutely hate this game",
    "timestamp": 1741302000
  },
  {
    "username": "spaghettibolegdeh",
    "rating": 4.0,
    "comment": "Top 10 overall is insane.\n\nBGG top lists are basically the same type of game.",
    "timestamp": 1740783600
  },
  {
    "username": "shmonkey",
    "rating": 4.0,
    "comment": "Very solid cooperative game. The complexity is a great way to avoid quarterbacking that can be an issue in coop games like pandemic. Very Well designed game, I just dont have a lot of fun playing it. I think the upkeep is high and the complexity is too high for what the game offers.",
    "timestamp": 1738191600
  },
  {
    "username": "iluvswatches",
    "rating": 4.0,
    "comment": "Okay this game wasn't bad but it just wasn't for me.",
    "timestamp": 1737673200
  },
  {
    "username": "Jaxgirl007",
    "rating": 4.0,
    "comment": "I bought this with the intent to play solo and there isn't a solo automa or adjustment. Two spirits is more work than I want to coordinate alone as this game is pretty fiddly to me. I've seen others outline how you can win with any one spirit but after two tries I'm ready to admit it's not for me.\n\nI'm sure I'll play in a group, but plenty of my friends have a version to play so I'll sell mine and just play someone else's copy when the urge arises. A shame…and my fault for not reading up before I bought. Rating might go up once I play in a group.",
    "timestamp": 1737500400
  },
  {
    "username": "SkyGlad",
    "rating": 4.0,
    "comment": "Overly complicated. Too fiddly. Too on rails by which spirit you’re playing as. Much too long. Would always rather play Pandemic.",
    "timestamp": 1734476400
  },
  {
    "username": "Bal_505",
    "rating": 4.0,
    "comment": "It feels like the type of game I could get really interested in, but for some reason it just didn't grab me. The card iconography is thematic, but a little hard to distinguish.",
    "timestamp": 1731625200
  },
  {
    "username": "boettler",
    "rating": 4.0,
    "comment": "Complexity=4.06. (Expansions are even harder). Pandemic like, but easily 4x harder. I can see the appeal for some people, but my mind can't take all of it in to be efficient at this game. It is not for me.",
    "timestamp": 1724709600
  },
  {
    "username": "jswenson91",
    "rating": 4.0,
    "comment": "I wanted to love this game but didn't find it's puzzle engaging, at least for my group. I really wanted to love this game but it just didn't click for me.",
    "timestamp": 1722808800
  },
  {
    "username": "MissP1ggy",
    "rating": 4.0,
    "comment": "Very well designed game. Only played once and game play still is a bit foreign. Not interested in trying again.",
    "timestamp": 1722722400
  },
  {
    "username": "legolasegb",
    "rating": 4.0,
    "comment": "The algorithm for how the board game plays against you is pretty transparent. I've only had one play, and there was some combo-tastic goodness that took place at one point, which was fun, but mostly it was taking a lot of pretty obvious actions. Meh.\n\nJust has no appeal to me, but take into account I don't really like coops.",
    "timestamp": 1718748000
  },
  {
    "username": "myszywur",
    "rating": 4.0,
    "comment": "boring",
    "timestamp": 1717884000
  },
  {
    "username": "ajoberstar",
    "rating": 4.0,
    "comment": "I don't think I've ever enjoyed playing this.",
    "timestamp": 1717365600
  },
  {
    "username": "joseverdin10",
    "rating": 4.0,
    "comment": "Not the game for me. Too much brain burn made this game tiresome and not a chiller. Great for those that like heavy on thinking crunchy games.",
    "timestamp": 1708297200
  },
  {
    "username": "OurMrMajestyk",
    "rating": 4.0,
    "comment": "A cooperative game for people who don't like cooperative games.",
    "timestamp": 1705705200
  },
  {
    "username": "disposable.superhero",
    "rating": 4.0,
    "comment": "Top 10 WL",
    "timestamp": 1700607600
  },
  {
    "username": "duodora",
    "rating": 4.0,
    "comment": "I love the theme and setting of this game, and I do like that it's a \"quarterbacking-free\" cooperative game, but I'm just not generally a huge fan of cooperative games. I also have limited patience for games that require significant coordination/communication between turns, which this one seems to require. It's probably a hair more complicated and longer than I'd like, so for me this is a package that doesn't quite work, although I do understand why folks really love it.",
    "timestamp": 1698012000
  },
  {
    "username": "whimsicaltyrant",
    "rating": 4.0,
    "comment": "Incredibly overrated. Obvious turns, lacks the puzzle feel of other Co ops. It seems like you know if you will win or loose at the midway point and then still have to play it out. Maybe this would be fine as a solo experience. Also the game is ugly, the miniatures are low quality and the theme is forced. Pretty shocked this is popular.",
    "timestamp": 1695160800
  },
  {
    "username": "individyouall",
    "rating": 4.0,
    "comment": "A bad teach left me with no idea what was really happening. Plus then I also felt that the decisions I made were pretty much dictated by a a small number of influencing factors. As a result I came away utterly underwhelmed and deflated. I should probably play it again, but in truth, I really can't be arsed.",
    "timestamp": 1694383200
  },
  {
    "username": "Youngdog",
    "rating": 4.0,
    "comment": "This was a huge disappointment for me. The board is so ugly and the opposite side was a little better looking but then harder to read/delineate what land was what. The spirit art and sudo translated names are great. This game is so ugly otherwise. The Card design seems like something designed in the early 90s before modern design cards.",
    "timestamp": 1693260000
  },
  {
    "username": "vitordp",
    "rating": 4.0,
    "comment": "I don't like how hard it is to use the cards. You want to use x card, but it is slow, but you can use the Y card, but it doesn't have the symbol you need.... A game full of (I might not use this card). So I just feel tired and highly limited playing it. Maybe someone who likes to focus on a game to perfection, but that's not me.",
    "timestamp": 1692741600
  },
  {
    "username": "PreensPeter2",
    "rating": 5.0,
    "comment": "Tried several times but was not fun.",
    "timestamp": 1761692400
  },
  {
    "username": "kataclysm",
    "rating": 5.0,
    "comment": "It's too long and heavy for me.",
    "timestamp": 1761084000
  },
  {
    "username": "hyde_70s",
    "rating": 5.0,
    "comment": "I haven't been this mind-boggled about a game in a long time. This is an interesting game, but... Top 10-20 material? Really? Almost completely deterministic, deprived of joy of a random challenge which could spice the game up. I can't imagine why would I ever want to play something like this instead of any FFG lcg.",
    "timestamp": 1760824800
  },
  {
    "username": "btasam",
    "rating": 5.0,
    "comment": "I’ve always enjoyed Spirit Island to a certain extent except for that one time we played a 4 player game.\n\nThe mechanics are genuinely satisfying and there’s a ton of joy in learning a spirit much like one would with a faction in Root. The theme in tandem with the writing and artwork is simply beautiful and the components are exactly what they need to be. I love programming actions at two different speeds, and Spirit Island feels like it's on an echelon by itself.\n\nThe cooperation has never really felt organic to me. Usually I don't care about what other spirits are doing because everyone is simply managing their own board and the interaction is filled with moments like, Who’s gonna take care of that? Can someone push them over here? Who wants me to turn a slow power into a fast?\n\nAdditionally, the pace creates a very anti-epic experience almost every time I've played. Basically, the game starts off tense and players have access to very few actions, etc. As the game progresses, you can do more on your turn, but the more you do inevitably sparks fear which just makes the game easier and easier with random events and a softening endgame trigger. It always seems to end right before it could have been hilarious.",
    "timestamp": 1760392800
  },
  {
    "username": "Loneroller",
    "rating": 5.0,
    "comment": "Expansions:\nBranch & Claw",
    "timestamp": 1759356000
  },
  {
    "username": "jinxbit",
    "rating": 5.0,
    "comment": "Spirit Island is playful and stakeful, but its correspondence with its subject matter is hollow — it delivers an anti-colonial skin wrapped around a Euro-style tower-defense puzzle, which ironically strips the natives from their role as the true protagonists of the drama.",
    "timestamp": 1755727200
  },
  {
    "username": "Moosetoo",
    "rating": 4.5,
    "comment": "4+ plays\n\n\"Quarterbacking\" in games is something that really bugs me, so I don't tend to enjoy \"play by committee\" games. I've heard people say that Spirit Island solves quarterbacking by just being too complex for one player to manage. After several plays, I've come to feel that this is not an effective solution.\n\nIt is true - when I've played, we've not optimized every turn, because that would be long and exhausting. But I don't find this feeling of \"giving up\" to be very satisfying either. Ultimately, this game isn't for me, but I can still appreciate some of the strengths of the design.\n\nSpirit Island has one of the best-managed difficulty curves I've seen in a co-op game. In the end, you are typically on the razors edge of winning and losing - no hopeless defeats or surefire victories. The different spirits all feel unique and interesting. The way the game frames colonization stands as a stark (and welcome) challenge to boardgaming norms.",
    "timestamp": 1754172000
  },
  {
    "username": "WBRP",
    "rating": 5.0,
    "comment": "Too fiddly and over-expanded for what it is.",
    "timestamp": 1753221600
  },
  {
    "username": "Naomania",
    "rating": 5.0,
    "comment": "Mediocre gameplay experience. Again it has the alpha player problem.\nFelt more like work than an a fun game. Too puzzly for me too less unpredictable",
    "timestamp": 1751666400
  },
  {
    "username": "The_Philosophers_Die",
    "rating": 5.0,
    "comment": "Heavily prone to the alpha player syndome.",
    "timestamp": 1751234400
  },
  {
    "username": "Gshegosh_B",
    "rating": 5.0,
    "comment": "Did not hook me.",
    "timestamp": 1751234400
  },
  {
    "username": "CotB",
    "rating": 5.0,
    "comment": "Awards\nCooperative Game of the Year 2021\n\nRankings\n61st Best Game 2021",
    "timestamp": 1750888800
  },
  {
    "username": "Born-of-Ashes",
    "rating": 5.0,
    "comment": "Total alpha gamer territory. Game looks alright, the names of the spirits are the best part. The mechanism is pretty much lifted from Pandemic. Surviving long enough until you auto-win is never exciting for me.",
    "timestamp": 1748642400
  },
  {
    "username": "Hrontajkpa",
    "rating": 5.0,
    "comment": "Not a bad game, I feel like I'm just missing something. When a game is going poorly, it's pretty hopeless, when it goes well, it's just ends with a \"huh, ok, I guess we did it\". Even when it's a struggle that we manage to come back from and win, the end is always more anticlimactic than it is a thrilling comeback.",
    "timestamp": 1746914400
  },
  {
    "username": "FrankRyan",
    "rating": 5.0,
    "comment": "Good enough. Overrated in my opinion.",
    "timestamp": 1746828000
  },
  {
    "username": "poleary238",
    "rating": 5.0,
    "comment": "The lightly muddled set of rules and effects, and the low player interactivity always seem to turn this into a game where everyone is sort of mumbling at each other more than playing a game together.\n\nIt’s a baseline game for me - happy to play it, happy to leave it - but that's a little disappointing because the theme and artwork are great.",
    "timestamp": 1744840800
  },
  {
    "username": "ciceroni",
    "rating": 5.0,
    "comment": "I like the setting of the reversed colonization and the puzzle is interesting as well, but the gameplay is such a slog with multiple players that it never felt exciting at any point. I would only ever play this solo or with a very dedicated partner, but both of those options are not an option for me at this point in life.",
    "timestamp": 1744149600
  },
  {
    "username": "Icedstoat",
    "rating": 5.0,
    "comment": "Meh. It's a pretty standard coop with extra complexity that adds nothing.",
    "timestamp": 1741561200
  },
  {
    "username": "Scholle80",
    "rating": 5.0,
    "comment": "Cool idea and an interesting variety of player powers, but compared to Pandemic, I find this game weirdly unfun. Each round is a deterministic optimisation exercise with a variety of symbol-matching to be done and a clunky damage/defence mechanic (you have to remember numbers which are added up in the middle of the turn).\n\nThere's no dramatic moment like an outbreak in the middle of a game of Pandemic or a die roll to determine your fate. Instead, the game just becomes a bit of a grind.\n\nAlso, the pieces are tiny and don't look very good on the board, and the game takes ages to finish.\n\nIn terms of rules, the basic mechanics are quite streamlined and the game is fairly easy to learn, but it's death by a thousand cuts because there are so many variations to the basic rules. The rulebook even contains a paragraph basically saying \"if you miss one of the many fiddly rules, don't worry about it. just carry on as best you can\" which frankly is rather telling!",
    "timestamp": 1741474800
  },
  {
    "username": "Katielou",
    "rating": 5.0,
    "comment": "Not sure what all the fuss is about.",
    "timestamp": 1738105200
  },
  {
    "username": "Jorerbor",
    "rating": 5.0,
    "comment": "Dissatisfying and overly challenging game play. Often ends in frustration/ heart break (and typically I love getting stomped in co-ops). But it is exciting and typically works well.",
    "timestamp": 1736722800
  },
  {
    "username": "MrMuzzled",
    "rating": 5.0,
    "comment": "Jan 1 2025. Overrated. Easy to learn but heavy to play. Solo play, so far, is just meh. You are always playing catch up and there is no fun in that. The theme feels a bit tacked on--you end up ignoring the theme and just looking at the the actions you can perform and this erases the theme.\nDo not attempt to play solo with 1 spirit, it seems nearly impossible to win--you just do not have the resources. Losing is not fun.\n\nI'll try playing solo using 2 spirits which I expect will be better. I will come back and revisit my rating later, but so far the effort to play the game when a loss is usually certain is just not fun.\n\nFor solo, a good alternative is Mage Knight. It seems far less hopeless.\n\nFor cooperative, Nemesis is great. You will usually lose, but the game tells such a great story, that losing is still fun.",
    "timestamp": 1736290800
  },
  {
    "username": "tolhs",
    "rating": 5.4,
    "comment": "2024:+1\n\ntbp:30-40",
    "timestamp": 1733958000
  },
  {
    "username": "stiivburns",
    "rating": 5.0,
    "comment": "Art and production are pretty good, but the plastic figures seem out of place.\n\nFeedback swings seem to be exponential -- the majority of the game, you're either (A) getting crushed by the AI (B) crushing it. This makes the moment of the swing very satisfying, but the outcome -- which can be drawn out -- pretty lackluster.\n\nI think Spirit Island is most fun as a solo game. It plays fine with 2, but with 4 (or even 3) becomes unwieldy.\n\nAlso, there is a little too much going on for my taste in a co-op game. It is far too easy to miscalculate element counts or energy income to the players' advantage. This kind of \"fudging\" became really commonplace in my sessions, which took the satisfaction out of already-unsatisfying victory.",
    "timestamp": 1733871600
  },
  {
    "username": "XNeo",
    "rating": 5.0,
    "comment": "CORE\nSPIRIT ISLAND",
    "timestamp": 1733439600
  },
  {
    "username": "fsnam",
    "rating": 5.0,
    "comment": "It was ok and I love the theme, but had nothing to curb Alpha player from trying to dominate all the planning and leaving some players with \"why am I here\" moments.",
    "timestamp": 1732057200
  },
  {
    "username": "winolopez",
    "rating": 5.0,
    "comment": "unfortunately was not a hit to us. the brain burn it gives doesn't equate to the happiness we're getting",
    "timestamp": 1728597600
  },
  {
    "username": "escaldada",
    "rating": 5.0,
    "comment": "6800￥\n\nTheme: Natives VS Colonials\nComplexity: High\nPlayer Interaction: Co-op\nPlaying Time: 2h\nPlayer count:1-4\nBest Player Count: 2\n\nGood game, but not easy to teach or play, with a lot of analysis paralysis, doesn't feel very cooperative sometimes.\nIt will stay in my collection only because of its good production value and the possible solo plays.\n\nPoint of interest:\n-Cooperative Game\n-Variable Player Powers",
    "timestamp": 1727301600
  },
  {
    "username": "Valcurdra",
    "rating": 5.0,
    "comment": "I can see why people would love this game, there is a lot to sink your teeth into here, an extremely thinky heavy co op that is probably best played solo.\n\nThe deck building is pretty cool, combining cards in interesting ways can be rewarding and you can pull off mega turns with awesome results at times.\n\nThe problem with this game for me is that it is just another classic \"whack a mole\" style co-op like pandemic and whilst it's better executed, it still feels the same as that tired old genre. Plus your adding a massive amount of extra rules bloat and fiddliness with only occasional intermittent payoff.\n\nThe first expansion saves it adding events which make the game WAY more interesting and you really want all the promo spirits or you risk getting bored quickly.\n\nPersonally if I want a challenge, I play episode 1 or 2 of The captain is dead on max difficulty it's a lot more thematic and fun and just as interesting. Much better games than spirit island.",
    "timestamp": 1727215200
  },
  {
    "username": "bboston",
    "rating": 5.0,
    "comment": "Nornally does not like co-op game and this game is not that fun. it is so unforgiving lol.\nAfter our second play sold it. not my style but I can see why other like them.",
    "timestamp": 1727042400
  },
  {
    "username": "emetzler87",
    "rating": 5.0,
    "comment": "Great co-op game! I didn't not enjoy playing solo as much as I would have hoped.",
    "timestamp": 1726005600
  },
  {
    "username": "excalibur2099",
    "rating": 5.0,
    "comment": "Tedious and cluttered. Extremely puzzly. Long downtime and play time.",
    "timestamp": 1725746400
  },
  {
    "username": "Darklord2160",
    "rating": 5.0,
    "comment": "Too much optimization demanded from players made this very dry and quite strict experience , super prone to alpha players or unsatisfied losses from bad plays of someone else. This may work as 2p or solo game.",
    "timestamp": 1725400800
  },
  {
    "username": "invervegas",
    "rating": 5.0,
    "comment": "Complexity √",
    "timestamp": 1725314400
  },
  {
    "username": "Scifi66",
    "rating": 5.0,
    "comment": "Great design. If you are a solo or co-op player than this has to be on your list to try. In the end co-ops are not my cup of tea.\n+ Lots of content, with heaps of different Spirits and levels to play against.\n++ Love the inversion of typical colonialist themes\n++ Dual sided game boards (love it) and invaders/Dahan components\n+ Great rulebook\n– Dislike some of the card and Spirit board art. I'm probably in the minority but this drags it down as you spend quite a bit of time looking at cards and character boards.\n–The puzzle became a bit same-same. Immersion wasn't deep enough for my solo experience.",
    "timestamp": 1724796000
  },
  {
    "username": "Zenji",
    "rating": 5.0,
    "comment": "Storage Location: Pune",
    "timestamp": 1723068000
  },
  {
    "username": "Arcum",
    "rating": 5.0,
    "comment": "Sold.",
    "timestamp": 1722290400
  },
  {
    "username": "laman132",
    "rating": 5.0,
    "comment": "Sold\n\nAh, Spirit Island. It's a combination of being very complex, and feeling like you're being punched in the gut constantly for hours. Never feels good; you might wipe invaders from here and here, but I can look forward and see they're about to build here and ravage here, so it's just one emergency after another. Never feel good, just that I've barely prevented catastrophe and now need to deal with the next crisis. Feels anxiety inducing, and then it's over.\n\nPandemic at least lets you momentarily bask in your victory by obfuscating how it's going to wreck you next turn.",
    "timestamp": 1721253600
  },
  {
    "username": "Kaffedrake",
    "rating": 5.0,
    "comment": "A co-op of the \"stomp out the spreading wildfire\" type, but most things are considerably more granular and variable than in something like Pandemic. The invaders are on a sort of parabolic curve, and you must prevent it from hitting a ceiling (which ruins the island) and instead bend it down to the ground (whereupon they leave) before it goes too far to the side (at which point, in a massive thematic collapse, \"time runs out\" and you must use your imagination, maybe aliens blast everyone). Could be fun, I wouldn't mind playing a bit more properly to find out. There's nothing particularly strange about the theme, but it will always seem strange to me when people say things like it's great that we now get to murder homesteaders and hinder development but it's a shame there were no fantasy natives on the production team.",
    "timestamp": 1720908000
  },
  {
    "username": "legion170",
    "rating": 5.0,
    "comment": "I want to like this game, but it just isn't for me nor my wife, with whom I play the most. It was punishing to even get to a point where we thought we knew what was going on or what we needed to do, and even then the highs just weren't rewarding enough for us to endure the crunch. Would be willing to play with others, but not something needed in our collection.",
    "timestamp": 1720648800
  },
  {
    "username": "mschlat",
    "rating": 5.0,
    "comment": "On a first play, I'm not sure this is the game for me. It feels like the coop game for MtG players: it is a heavily tactical experience where you are focused on combat and how to work the specific cards for your spirit to maximize damage and support. I'm not an MtG fan, so those appeal factors don't appeal much to me. It didn't help that I found the combat system baffling for a while. On the plus side, the puzzle aspects are interesting, and I see potential for spirits to help each other. The problem for me is that the tactical detail and the need for upkeep obscured much of the narrative.",
    "timestamp": 1718920800
  },
  {
    "username": "Aphexia31",
    "rating": 5.0,
    "comment": "More upkeep than gameplay.",
    "timestamp": 1718748000
  },
  {
    "username": "francobollus",
    "rating": 5.0,
    "comment": "Have bought the Dutch version (finally here) in the supposition that I would have a lot of fun with this game, when playing solo. Played it five times until now, and until now I recognize the elements why so many players love this game, but...I can't come to the right tickling of my brain. I cannot solve the puzzles it offers until now, but I am not giving up! I will make some more efforts, so the rating may rise. But for now, to my disappointment, a 5.\nHave tried it twice once more, but no, it does not win me over.\nAfter 5 plays: it stays clinical and dry. Sold it and do not miss it.",
    "timestamp": 1718661600
  },
  {
    "username": "AmassGames",
    "rating": 5.0,
    "comment": "Disappointed, abstract with light theme. We won as a 2, could try harder modes, drags a little, bit of downtime\n\nGoogle AmassGames for 2,500+ more",
    "timestamp": 1718143200
  },
  {
    "username": "tommayj",
    "rating": 5.0,
    "comment": "I should start by saying that - aside from one solo game - I haven't truly played through an entire game of SI. Players keep abandoning it out of frustration and a feeling of unfun. I like complicated games, but I feel like the high ratings must be from the types of people that LOVE math homework. What I mean is there's a ton of upkeep, like all the time. There's also just so much number-crunching... overwhelming complexity in the name of 'solving co-op quarterbacking.' And while I appreciate the theme, it's honestly pretty meh, and paired with terrible graphic design, this game never excites a single person I show this to. Oof.",
    "timestamp": 1718056800
  },
  {
    "username": "FiveEels",
    "rating": 5.0,
    "comment": "Didn't find it rewarding enough given the complexity. Lends itself to more to players who don't think too much or best with 2. Plays of more than 2 have been actively painful.\n\nCould see myself really enjoying this (w. 2) after more plays. Still feels like complexity is just a notch too high for me.",
    "timestamp": 1717365600
  },
  {
    "username": "Farvoz",
    "rating": 5.0,
    "comment": "solo\nbest 2\n\nнравится\n- Прикольно сделана природная способность - значки определённой стихии: Удобно считать по количеству карт\n- Прикольное развитие персонажа. Карты из сброса можно снова использовать\n- Прикольно, что 3 секции действий : для создания новых персонажей (?)\n- Прикольно, что есть одна пассивная способность и активная (природная)\n- Прикольный трек захватчиков (сначала исследование, потом строительство, а потом атака)\n- Карты страха и буфер страха - пользоваться ими, условия победы становится проще\n- Стратегии : через прямое уничтожение, через страх, через доханы\n\nизменить\n- Решать, куда скверна двигается - если думать что сопротивляешься и отводит, то норм\n- Сложно выбирать в начале одно из 3 действий, неинтуитивно\n- порядок не совсем интуитивен - сначала решаешь какие способности применять а уже потом только какое действие выбрать. а ещё сложнее если берёшь новую карту и надо заново думать что же играть\n- неприкольно что фаза «до» и «после» : сложнее думать, нарушается ритм\n- не нравится выбирать : расширяться в способности(неизвестно куда) или фиксированна увеличивать параметры\n- нет уверенности, могу ли расчитывать на способность из-за постоянного сброса\n- не очень думать ещё о переносе энергии из раунда в раунд\n- размывается фокус между полем и картами на руке\n- ненужное ограничение на количество карт. только ради 0?\n- сложно прогнозировать приход из-за выбора перед приходом\n- нет ощущение развития - постоянно лезут враги. количество способностей не сильно добавляет ощущением развития\n- действия сложны и ну них нет общей канвы - разные\n- слишком большую последовательность надо продумать сразу",
    "timestamp": 1715983200
  },
  {
    "username": "CHOCOxMOES",
    "rating": 5.0,
    "comment": "Too complicated for me",
    "timestamp": 1715292000
  },
  {
    "username": "Allein",
    "rating": 5.0,
    "comment": "Just not my cup of tea =\\ Very abstractive and too heavy for coop.",
    "timestamp": 1714428000
  },
  {
    "username": "adamsinger109",
    "rating": 5.0,
    "comment": "I see a fun game here, but the fiddliness it asks to get there is just too much",
    "timestamp": 1713823200
  },
  {
    "username": "purplecow55",
    "rating": 5.0,
    "comment": "A heavy coop that requires a game master to handle the AI turns.",
    "timestamp": 1712872800
  },
  {
    "username": "janglemangle",
    "rating": 5.0,
    "comment": "super chill puzzle and great little stories. very slow until players are familiar with their spirit. this is a huge problem for me. it's not easy to get into\n\nlong and anticlimactic based on setup, but the main problem... is that i need spirit island friends to play! cool to experiment solo, but i'll always prefer coop for the combo potential\n\nthe variability is meaningful and game changing, and destroying tiny men is endlessly satisfying. every card, component, and character ooze with theme, supported by a world you could keep imagining down to the details. core loop and combos give me reason to come back, though i might never try to beat the level 6 adversaries",
    "timestamp": 1709074800
  },
  {
    "username": "Ryucoo",
    "rating": 5.0,
    "comment": "Great theme, Beautiful looking and a clever set of cogs in this machine but it ultimately played out the same way each time. The cards always brought a sense of disappointment and frustration at what they couldn’t do, rather than excitement about what they could, and the more players you add beyond 1, the more a convoluted headache the game became. Over-designed in a lot of areas (card speeds? Card ranges? Shrines? Symbols? All unneeded bulk) and under-designed in others (no variation game to game, repetitive puzzle in-game, no real arc) - shame, there is something in this game but it needed more development and editing. I have no issue with complicated games, but I’m not a fan of needless complexity and here it feels like a symptom of trying too hard.",
    "timestamp": 1708383600
  },
  {
    "username": "ucacuscus",
    "rating": 5.0,
    "comment": "Quick setup, intuitive basic rules, and a gorgeous theme and artwork. But it is an optimization puzzle disguised as a board game. There is too much fiddiliness (especially involving cards satisfying certain conditions) and the different phases feel disjoined (sometimes making you forget what you had spent 5 minutes planning to do). Ultimately, there is no big, fun payoff during the game or at the end either. Strictly for people that like to spend lots of time on a puzzle and get satisfaction just from the fact that they solved it.",
    "timestamp": 1707692400
  },
  {
    "username": "ptm_junk",
    "rating": 5.0,
    "comment": "for more complicated for a coop game.",
    "timestamp": 1705100400
  },
  {
    "username": "Snake86",
    "rating": 5.0,
    "comment": "This game was way to complicated to be an easy coop. It did not like it.",
    "timestamp": 1704409200
  },
  {
    "username": "edubvidal",
    "rating": 5.0,
    "comment": "Un euro complejo con un tema que encaja a la perfección, pero que no llega a engancharme.",
    "timestamp": 1703372400
  },
  {
    "username": "JePaPix",
    "rating": 5.0,
    "comment": "Area control",
    "timestamp": 1702940400
  },
  {
    "username": "kingkhaos",
    "rating": 5.0,
    "comment": "\"I love it when the Tehan jump people\"",
    "timestamp": 1702335600
  },
  {
    "username": "GreyCrane",
    "rating": 5.0,
    "comment": "Great theme, but difficulty curve + hidden power marketplace made it unenjoyable.",
    "timestamp": 1701730800
  },
  {
    "username": "beppsta",
    "rating": 5.0,
    "comment": "While the game is cleverly designed, it feels more like work than fun. Didn’t click with me?",
    "timestamp": 1699743600
  },
  {
    "username": "Applin_Sauce",
    "rating": 5.0,
    "comment": "Rules felt really bad to read. Game play was confusing. Would try again maybe.",
    "timestamp": 1699743600
  },
  {
    "username": "Housticus",
    "rating": 5.0,
    "comment": "finally got to play this. Not really sure what to make of it .\nI can see why some people like it, its crunchy and difficult and has some cool ideas.\nIm not sure its for me.",
    "timestamp": 1698706800
  },
  {
    "username": "Luds",
    "rating": 5.0,
    "comment": "(MultiZone, 2018-02-08)\n\nSpirit Island is cooperative game with a nice theme of spirits trying to rid themselves of colonists on their island. The game contains a lot of unique spirits to play and lots of different powers. It may not be intuitive at the start but is somewhat entertaining and challenging. However even with the amount of variability I felt like I covered the whole game after about 5 plays and didn't care to play anymore. After a few plays the game became very bland and uninteresting.\n\n(Sold on 2019-08-25)",
    "timestamp": 1696024800
  },
  {
    "username": "Jak3yB0i",
    "rating": 5.0,
    "comment": "I can see the appeal of this game, unfortunately it was a bit too confusing for me and with 4 of us playing it took 3 hours to complete. About an hour or so in I had lost interest of the game.",
    "timestamp": 1695160800
  },
  {
    "username": "JohnBandettini",
    "rating": 5.0,
    "comment": "It must be me, I think its OK, everyone else seems to love it",
    "timestamp": 1692741600
  },
  {
    "username": "Grundhest",
    "rating": 5.0,
    "comment": "Co-op",
    "timestamp": 1691359200
  },
  {
    "username": "acidpizza",
    "rating": 5.0,
    "comment": "Tabletop Simulator",
    "timestamp": 1691186400
  },
  {
    "username": "cannoneer",
    "rating": 5.0,
    "comment": "Update August 2023. Ultimately this was too frustrating for us. I imagine that the first expansion may have made things slightly easier, but I'm not for throwing good money after bad. I traded this away for Cascadia and Welcome To...\n\n\nThis is quite fun. I've only played 2 solo games and one 2-player, and enjoyed each one. The organization of the rulebook is pretty bad, and it's a little hard to wrap your head around the sequence of play at first, but it quickly becomes second-nature.\n\nI was surprised at the importance of spacial placement/movement (but it was a pleasant surprise). I doubt I'll play much 4-player as I fear the game would run WAY too long, but we were able to do our first 2-player game in about 75 minutes. I even had my 2nd solo game last only 30 minutes.\n\nI can see what they say about surprise wins at the base level, and we're going to want to increase difficulty with the scenarios or adversaries pretty soon in order to have a challenge.",
    "timestamp": 1690927200
  },
  {
    "username": "jrubin1",
    "rating": 5.0,
    "comment": "I'm not a huge co-op player, but for a co-op it's one of the best.",
    "timestamp": 1690581600
  },
  {
    "username": "TwiznessAsUsual",
    "rating": 5.0,
    "comment": "REAL-TIME CO-OP \\ ASYMMETRICAL POWERS / ACTION RETRIEVAL \\ TIMING \\ PLANNING GAIN POWERS/LOSE POWERS ~ protect the island by vanquishing invaders. I'd really like to try this game with 1/2 players (or, 3 again). Mainly becuz there are so many possibilities going on at once ~ Emily owns & Brian (Thu/Rev) owns",
    "timestamp": 1686607200
  },
  {
    "username": "bneffer",
    "rating": 5.0,
    "comment": "This is a good game with an interesting concept, sort of flipping the script on 4X game and having the land repel the explore and exploiters. It is also a \"gamers\" co-op game.\n\nI would play again, but honestly this co-op felt similar to Aeon's End and I would much rather play Aeon's End. This is because I like the mechanics, art, and theme more in Aeon's End.\n\nIf Spirit Island had chosen a more attractive graphic design process and enjoyable theme it may have grabbed my attention better.\n\nEdit 2023 - I have no desire to return to this game.",
    "timestamp": 1686520800
  },
  {
    "username": "ToreDenmark",
    "rating": 5.0,
    "comment": "Way too complex for a co-op. Solo game for some gamers",
    "timestamp": 1686348000
  },
  {
    "username": "Iain33333",
    "rating": 5.0,
    "comment": "I love coop games, I love the theme behind this game, I love the card mechanics, I love the structure, I just don't like playing this game.\n\nEvery game is anti-climatic. In most co-op games you have a goal, you can see how to get there, and the hurdles to get over, and you know more hurdles will arise, so the challenge is to get there with the resources you have.\n\nIn this game you know where the enemy are coming from, where they are building, were they are ravaging, the aim of the game is to basically optimise your card uses to clean up strategically chosen spaces to minimise enemy growth and manage their presence until you create a fear that changes the game state and means you just won.\n\nIt is a little too much like work but without the salary, and the game just ends abruptly with little sense of having earned the win. Other comments suggest that if you increase the difficulty it gets better, but then the losses occur more often, the wins still feel anti-climatic, and often it just feels like there is a little too much going on.\n\nI really wanted to like this game but it just repeatedly fell flat for me and my group.",
    "timestamp": 1686088800
  },
  {
    "username": "OxfordCalc",
    "rating": 5.0,
    "comment": "Digital edition on Steam. Don't like the theme.",
    "timestamp": 1684792800
  },
  {
    "username": "theotherone209",
    "rating": 5.0,
    "comment": "Co op with solo components",
    "timestamp": 1684015200
  },
  {
    "username": "TrevorJr26",
    "rating": 6.0,
    "comment": "So I can completely see why this gets the praise it does. The theming is a novel and refreshing reversal of typical colonial themes, and it ties in perfectly to the gameplay. If you're a solo gamer there are about 15 levers you can pull to tweak the difficulty to your liking and keep it challenging. Even as a co-op I'm sure there are plenty of spirit combos that really encourage working together (though you can quite easily pick two that smash up the invaders on their own, and ignore your partner all game). But for my taste, the complexity but predictability of the systems that make it a solo favourite are sort of what kills it. You can absolutely burn your brain out on this system, working through the possibilities of what will happen on the invaders turn. And do you know what you're doing when you're in your own head crunching it out? Not talking to your friends. Throughout my play I kept thinking, 'if this was pandemic we'd never have a single turn where we didn't discuss anything', and yet for many turns of spirit island no discussion was required at all. We both took care of our area and crunched out our most effective use of energy and cards. Which to me puts it with Daybreak as a co-op game that is really a solo modern euro where you share points. But once again, yeah I get the hype. But I'm not a solo gamer. I'm also not sold on the art and graphic design, it's a bit dodgy and dated considering it's from 2017.",
    "timestamp": 1762297200
  },
  {
    "username": "SirGrenadealot",
    "rating": 6.0,
    "comment": "Played at Essen 2025. Very nice looking game with a great theme. The asymmetry is also nice to keep the game fresh, however it is not my type of game and a bad combination of spirits might just make it unreasonably difficult.",
    "timestamp": 1761343200
  },
  {
    "username": "Fuzzygreentits",
    "rating": 6.0,
    "comment": "Good, but hard to get on the table over more manageable games.",
    "timestamp": 1760392800
  },
  {
    "username": "Dice Mage",
    "rating": 6.0,
    "comment": "1",
    "timestamp": 1758578400
  },
  {
    "username": "mjhm",
    "rating": 6.0,
    "comment": "1 play (philly)\nneed to play again, bad group",
    "timestamp": 1758319200
  },
  {
    "username": "IAMCACKIMON",
    "rating": 6.0,
    "comment": "2 plays. I only played this at 3p.\nI came into the game with very low expectations since it didnt seem appealing to me at all. The box cover was a turn off for me. Every review i saw said this game isnt the best at more than 2p.\nMy buddy bought the game and I ended up playing it.\n\nI actually enjoyed the game far more than expected and requested to play a second time. However it did become a bit of a cluster F as the scenario went on as reviews mentioned. I definitely got the impression the game would have been more manageable and fun if Played solo or at 2p. I wouldnt seek out the game but id be willing to play it occasionally with a buddy if he asks.",
    "timestamp": 1758232800
  },
  {
    "username": "FaytParkour",
    "rating": 6.0,
    "comment": "I've tried so many times to get into this game. I just don't seem to find it as compelling as other people. The powers are cool - but maybe a little confusing at times. It has a slow ramp up to winning against the colonists or loss.",
    "timestamp": 1758232800
  },
  {
    "username": "iplaybgnaked",
    "rating": 6.0,
    "comment": "I don't usually enjoy coop games but this one managed to work for me as the card combos and their interactions between players makes it an engaging experience to collectively solve the puzzle of the game. The modularity and variability of the content keep the game fresh and enable you to tailor it to your preferences, which in my case let me ratchet up the difficulty in a way that is fair while still being challenging.\nFor being as big of a coop hater as I am, I'm still impressed at how well this game has held up for me over the years. I think it is because Spirit Island manages to do hand management and tableau building better than the bulk of Euros out there.\nFeel like I've exhausted the game's potential for me at this point, all that's really left is grinding games with the high complexity spirits to get good enough to suceed against level 5 and 6 adversaries which is making me question just how much I enjoy this system.",
    "timestamp": 1758060000
  },
  {
    "username": "DiceMind",
    "rating": 6.0,
    "comment": "Base game: 6/10",
    "timestamp": 1757887200
  },
  {
    "username": "dvhill",
    "rating": 6.0,
    "comment": "Almost had an anxiety attack playing this. I get why it’s popular, but I can’t do it.",
    "timestamp": 1757887200
  },
  {
    "username": "kevinartinowwe",
    "rating": 6.0,
    "comment": "I DON’T RECOMMEND FOR SOLO PLAY ONLY.\n\nOwn both Jagged Earth and Branch and Claw (I suggest you take only the first one, second one doesn’t really add anything new except two spirits)\nThis game is good, but I feel like it is overestimated.\nI play it solo. One hand solo is the best way, but it’s not really fun. Two-hands solo ONLY works if you play with easy level spirits, otherwise it’s a heavy brain burner. Love the thematic powers and the thematic side of the island (though it raises the difficulty). It’s a very thematic game but the theme isn’t that interesting (to me). Might be better to play with friends, since cooperation is the only way to win the game.",
    "timestamp": 1757368800
  },
  {
    "username": "Mentatgamer",
    "rating": 6.0,
    "comment": "Complex euro style coop with asymmetry. Anti colonialism theme. Needs more plays",
    "timestamp": 1756850400
  },
  {
    "username": "Killi",
    "rating": 6.0,
    "comment": "It's in the top3 of some of my close ones, and they keep asking me to play it with them. But for some reason this melts my brain even when playing with medium difficulty spirits, sometimes even easy ones. The upkeep puts me off a lot from playing this more.\nIt is a great game and probably best co-op out there with the highest skill ceiling, just not for me.",
    "timestamp": 1756504800
  },
  {
    "username": "macUladh",
    "rating": 6.0,
    "comment": "I'm both impressed and underwhelmed by Spirit Island. It plays well, neatly balancing the burgeoning threat of invaders against the swelling powers of the spirits. The conclusion of the game can be awesome, cataclysmic... empty. I love the system, enjoy the gameplay, and find the conclusion consistently anticlimactic. That may not be the fault of the game. I have experienced similar dissonance in other solo and cooperative games.",
    "timestamp": 1756159200
  },
  {
    "username": "corry26",
    "rating": 6.0,
    "comment": "Good game design but not my jam, this game has a lot of maintenance and small details that makes the barrier to entry complex for newer players and also the asymmetry between factions adds to this. I wouldn't look to play this more, actually sold my copy there are just better streamlined coops out there",
    "timestamp": 1756159200
  },
  {
    "username": "quash2772",
    "rating": 6.0,
    "comment": "You have to think of a future state of the board as most powers happen after the invasion. Very brain burny. A bit much to factor whilst trying to work together",
    "timestamp": 1755381600
  },
  {
    "username": "realityfoible",
    "rating": 6.0,
    "comment": "I'm absolutely not a fan of cooperative \"a bunch of semi-random stuff happens, react to it or lose\" type games, but unlike Pandemic or Arkham, I enjoyed my time on Spirit Island.\nThe theme is beautiful (and wonderfully morbid), and there's just enough mechanical meat for me to sink my teeth into.\n\nI would happily recommend this for anyone exploring their interest in co-op games, even if it's not directly in my taste range.",
    "timestamp": 1755381600
  },
  {
    "username": "marpaj123",
    "rating": 6.4,
    "comment": "christmas gift 2023",
    "timestamp": 1753394400
  },
  {
    "username": "dcsdiving",
    "rating": 6.0,
    "comment": "steam version",
    "timestamp": 1753135200
  },
  {
    "username": "SoMi713",
    "rating": 6.0,
    "comment": "Egy nehéz és nagy kooperatív játéknak ilyennek kell lennie. Rengeteg lehetőség, nehézségi fok, kombó lehetőség. A különféle variációk száma hatalmas. De miért kap tőlem alacsony értékelést? Mert túl sok az ízlésemnek. Sok benne a szabály, ezért arra, és nem a játékra és nem a játékosokra figyelek (ha találok hozzá játékost). Túl hosszú idő előkészíteni és játszani, ezért nem kerül elő. Ez engem így nem szórakoztat. A végére teljesen elfáradok. Nem elegáns tervezés.\nDE! Tetszik a háttértörténet és különösen a szellemek változatossága. Mindegyik egy egyéniség. Ha valaki egy kooperatív monstrumot keres, annak feltétlenül ajánlom.\n\nA difficult and large cooperative game should be like this. Lots of options, difficulty levels, combo options. The number of different variations is huge. But why does it get a low rating from me? Because it's too much for my taste. There are a lot of rules, so I focus on those, and not on the game or on the players (if I can find players for this). It takes too long to set up and to play, so it doesn't come up. It just doesn't entertain me. By the end I am completely tired. It's not an elegant design.\nBUT! I like the backstory and especially the variety of spirits. Each one is an individual. If someone is looking for a cooperative monster, I definitely recommend this.",
    "timestamp": 1753048800
  },
  {
    "username": "Samchan",
    "rating": 6.0,
    "comment": "太難了，唔適玩，比較難贏的合作桌遊，在香港買，可2人玩",
    "timestamp": 1752876000
  },
  {
    "username": "aresil",
    "rating": 6.0,
    "comment": "coop",
    "timestamp": 1752530400
  },
  {
    "username": "Brother Abe",
    "rating": 6.0,
    "comment": "April 2022\nTraded to BoardGameCo for 100 points:\nGave up (100. Spirit Island, 24. Ulm, 11. Kraftwagen) received from BoardGameCo in trade 135. Grand Austria Hotel\n\nJuly 2021\nLast played 4/5/2020\n\n My gaming group - 7 Good game, happy to buy/own it even if it only periodically gets played.\n\nAny Cooperative gaming group that wants heavy games- 9 Excellent game, no complaints, group would often ask to play.\n\nNotes:\nJuly 2021: This one is one I keep mostly because my wife still can imagine that we will find a group for it. I have my doubts, but we will keep it for now. I think I prefer Aeon’s End, although both are great, I think the rules in this game get in the way of my enjoyment. Although I think once we get it down we would have to play it more often to really enjoy it.\n\nAugust 2020: we got this to the table several times on several days in a row. We enjoyed the puzzle and that as a coop we liked that you really can only manage your side, lending a hand only occasionally.\n\nApril 2020-I really love this game. It plays great as a solo game!\n\nA couple years ago I played it as a multiplayer and felt it was too chaotic. But I thought maybe I just didn’t understand what was going on. I realize now that its just a complicated game and the manual is crap. You should check this link out if you want to learn the game, really great work.\n\nhttps://boardgamegeek.com/thread/2141334/teaching-spirit-isl...\n\nIts a great puzzle to solve.\n\nSeptember 2019\n$46.74 BoardGameCo",
    "timestamp": 1752444000
  },
  {
    "username": "GamingMaine",
    "rating": 6.0,
    "comment": "Not sure about this game...",
    "timestamp": 1752098400
  },
  {
    "username": "SpaceSheep4",
    "rating": 6.0,
    "comment": "Feels like a very well engineered system. Best suited for 1 or 2 players, imo.\n\nThat said, it can be too much. I feel like you always have to juggle so many things at once, that it can feel tedious just to keep track of things. The best way I can describe it, is to say that I feel like my brain doesn't have enough RAM for this. Once I've gone through all the things to check before choosing a card, I have forgotten what I wanted to do in the first place. So, clear recommendation to the smarter boardgamers, but not for me.\n\nAnother problem for me, not necessarily a critique of Spirit Island, is that the system is transparent enough, that you can sit there and math out the perfect turn, for a long time. But that's no fun, not for me nor anyone I play with.\n\nAll in all, Spirit Island is a good game. If you like heavy coop games, you will like it. For me, it's more exhausting than fun.",
    "timestamp": 1751925600
  },
  {
    "username": "willbeplayin",
    "rating": 6.0,
    "comment": "One of the only co-op games I really like.",
    "timestamp": 1751839200
  },
  {
    "username": "franagor80",
    "rating": 6.0,
    "comment": "Plateau d’action un peu petit en jeu solo avec beaucoup de monde sur les cases\nSûr de n’avoir omis aucune règle et de fait souvent submergé par l’automa : parfois, très frustrant car difficile de gagner",
    "timestamp": 1751752800
  },
  {
    "username": "farsidehobbes",
    "rating": 6.0,
    "comment": "I enjoyed my play of this. I like puzzley games and this one delivered.\n\nDave and I each took a beast-centric spirit, Sweden country at level 2, Events, and all of the extra bits like beasts and fist tokens.\n\nSince our spirits were very compatible, we were able to combo a few things together. The fear and event cards helped at just the right time.\n\nI would only ever play with 1 or 2. I can see that repeated play is rewarded but I doubt I'll ever get that many plays in.\n\nWould play again.",
    "timestamp": 1750716000
  },
  {
    "username": "mrdollar11",
    "rating": 6.0,
    "comment": "Fantastic theme, but I think the spirit cards ending up very generic and fiddly removes the fun of choosing to play the different spirits as much, which just leaves me not that excited to get this game off my shelf. I'll play it on occasion but I'm never excited to do so.",
    "timestamp": 1750197600
  },
  {
    "username": "M_Krikke",
    "rating": 6.0,
    "comment": "We played this with 4 and it was really (too) slow with everyone discussing to optimize the moves of all the characters simultaneously.",
    "timestamp": 1750024800
  },
  {
    "username": "MrWoodrow",
    "rating": 6.0,
    "comment": "A game that EVERYBODY else seems to love, but it didn't do it for us sadly. Stress and admin, it was like being at work....\n\nThe world building and asymmetry are fantastic, as is the component quality, but this felt like a slog. I'm genuinely sad that we couldn't find the fun in this one.",
    "timestamp": 1749592800
  },
  {
    "username": "maritn",
    "rating": 6.0,
    "comment": "Wanted to love this, but after 3 plays it still does not excite me at all.\n\n+ Variable difficulty\n\n- Felt much more abstract than expected\n- Everybody played much more heads down than expected, cooperation was minimal",
    "timestamp": 1748988000
  },
  {
    "username": "danrowe2011",
    "rating": 5.5,
    "comment": "Spirit island thrives as a two player challenge. With a dedicated friend who yearns to achieve mastery of the spirits with you, the game is a great deal of fun. But this game is true to it's weight and there is a lot to do, after every card played, every round, this moves there and that moves there and boy you better buckle up and pay attention. The game is inaccessible in this way, and that costs it. A more manageable game experience with stripped down mechanics could be a gem.",
    "timestamp": 1748556000
  },
  {
    "username": "CourtJesterCowboy",
    "rating": 6.0,
    "comment": "Spirit Island is good fun, but I honestly think that it works better as a digital experience. When I purchased the physical game, I had notably less of a fun time playing, trying to track all the parts, and haven't played nearly as much of it physically.",
    "timestamp": 1747519200
  },
  {
    "username": "Sinoc",
    "rating": 6.0,
    "comment": "Looked too difficult for me. I Tried solo but didn't like the experience. I was lost.",
    "timestamp": 1747173600
  },
  {
    "username": "Rubcar91",
    "rating": 6.0,
    "comment": "Took me some time to internalize the order in which the bad events were going to trigger. That was true of a lot of the game. One too many little phases and procedures and steps. I suppose that after one or two more playthroughs it would sink in, but it felt a bit clunky for what seems to be a pretty simple system. I also didn't feel that the spirits felt THAT different from one another, but again, it was a single playthrough and I was playing with the lowest complexity characters. Just seemed like much ado for what should be a straightforward game.",
    "timestamp": 1747000800
  },
  {
    "username": "baronAldred",
    "rating": 6.0,
    "comment": "Not such a great game.\nFirst, you have to play slowly and accurately.\nSecond, for me, it suffers from the Pandemic effect... Stress, stress, stress.\nThird, the gameplay isn't as immersive; you're so focused on making the perfect move that you simply forget you're carrying a fire spirit, or an earth spirit, etc.\n\nIn general, just like with Pandemic, the interest curve shoots upward and then starts to go down, down, down...\n\nGames like Stonehenge or Lost Ruins of Arnak are simpler, less stressful, and ultimately much more fun.",
    "timestamp": 1746655200
  },
  {
    "username": "heathbarATL",
    "rating": 6.0,
    "comment": "Neat variation between spirits. I like the theme and mechanisms. A bit too much AP for my tastes.",
    "timestamp": 1746396000
  },
  {
    "username": "sleip85",
    "rating": 6.0,
    "comment": "Too complicated for me at this point. Will review when I have more time to focus on it.",
    "timestamp": 1746136800
  },
  {
    "username": "kilianbognar",
    "rating": 6.0,
    "comment": "It's really clever, and the power curve is cool, but there's too much going on to provide a satisfying cooperative (figuring solutions out together) feel, which is what I'm ultimately looking for in cooperative games.",
    "timestamp": 1745272800
  },
  {
    "username": "King Bing",
    "rating": 6.0,
    "comment": "Would rather play:\n- Arkham Horror 3rd edition\n- Conquest of Planet Earth\n- Fate: Defenders of Grimheim\n- Unstoppable\n- Nemesis",
    "timestamp": 1744495200
  },
  {
    "username": "Tonks55",
    "rating": 6.0,
    "comment": "Very hard to learn.",
    "timestamp": 1744495200
  },
  {
    "username": "lydiasky",
    "rating": 6.0,
    "comment": "With folding spaces insert",
    "timestamp": 1744408800
  },
  {
    "username": "hungsu",
    "rating": 6.0,
    "comment": "Probably too complex for my gaming group",
    "timestamp": 1743289200
  },
  {
    "username": "Cicerone",
    "rating": 6.0,
    "comment": "We tried it twice but it never clicked with my group :/",
    "timestamp": 1742770800
  },
  {
    "username": "Blargandtart",
    "rating": 6.0,
    "comment": "I tried playing it a couple times with only one spirit. Did not resonate or feel good. Definite brain burner, definitely repayable it just hasn't clicked with me yet",
    "timestamp": 1742684400
  },
  {
    "username": "Grobbs",
    "rating": 6.0,
    "comment": "This is the only co-op I really want to play anymore. Many, many hours of fun spent with my wife and some friends here. Creating combos of Godzilla style spirits to terrorize the English has never been so fun.",
    "timestamp": 1742252400
  },
  {
    "username": "jvbren",
    "rating": 6.0,
    "comment": "Provisional rating.",
    "timestamp": 1741993200
  },
  {
    "username": "TyDeL",
    "rating": 6.0,
    "comment": "Do have to say, from someone who really does not care for co-ops, this is the best I've played. I'd be happy to play it... But I'd still never be one to ask to play it. I really enjoyed the buying and upgrading of new powers and trying to find a nice combo of cards to work off of your spirit's unique ability. The teamwork aspect really works well, definitely no alpha gamer issue. It's still just too much bookkeeping for me. And I will never get the same excitement from playing against a deck of cards as I do other players.",
    "timestamp": 1741734000
  },
  {
    "username": "woetly",
    "rating": 6.0,
    "comment": "Jon punya",
    "timestamp": 1741474800
  },
  {
    "username": "Redgarz",
    "rating": 6.0,
    "comment": "Arrakis Games panda de sinvergüenzas",
    "timestamp": 1741129200
  },
  {
    "username": "ithinkimasofa",
    "rating": 6.0,
    "comment": "This is a good game. I imagine it may be best played solo, I see why people love it, but I felt the options were a bit restricting. I do like the game, it was fun, but felt like it took too long for what we were doing.",
    "timestamp": 1740265200
  },
  {
    "username": "shackleford",
    "rating": 6.0,
    "comment": "Played exclusively solo.",
    "timestamp": 1739574000
  },
  {
    "username": "TheCrowLey",
    "rating": 6.0,
    "comment": "Coop, surévaluer selon moi",
    "timestamp": 1739055600
  },
  {
    "username": "MYZ4life",
    "rating": 5.5,
    "comment": "Not my typ of game",
    "timestamp": 1739055600
  },
  {
    "username": "LupusX",
    "rating": 6.0,
    "comment": "Fun but messy. The mechanics are very confusing, even though I'm a very experienced heavy eurogamer.",
    "timestamp": 1738623600
  },
  {
    "username": "Synthezoid",
    "rating": 6.0,
    "comment": "A laborious first game when I was still learning soured me on Spirit Island, but after learning to make concessions, I think it's a better game than I realized. Once you're a bit more familiar, managing the rules and the cards is better. It's still a lot of mental load, but I can see how it can be fun. That being said, it has some issues. Many spirits feel out of tune for solo play. Even the rulebook admits that the game isn't balanced around solo. Asking me to play two handed just to get a better experience is too much. While it seems that most spirits are at least somewhat viable solo, they occasionally lean too much toward support or specialist play to feel totally right. This could probably be rectified with more experience, but I feel that so much of the appeal of the game is the excitement of picking a spirit and exploring their playstyles, like picking your favorite character in a fighting game. Yet some of the ones that look or sound most interesting are just too brain-melting to be fun to play.\n\nThe component design is great, though. The way invader minis can be reoriented to track their health is ingenious, and the wood/plastic contrast is thematic (not just the jargon-y connotation where thematic=evocative of the setting, but thematic as in literally reinforcing the game's Themes). And the theme (common usage this time) is one of the coolest I've seen in a long time. Ultimately, though, it feels like Pandemic with a slightly convoluted card play system. I enjoyed it but don't love it.\n\nI still really want to try it with a group, as it seems to thrive on interesting synergies and combos--things you don't get as much of solo. One of the major strengths of its design, according to proponents, is the way it alleviates quarterbacking, but this too is irrelevant to solo play, and the complexity and asymmetry that makes alpha-gaming impractical is also the same thing that makes playing alone such hard work. I think I'd really like to try Horizons of Spirit Island, as the cheaper price and emphasis on more straightforward spirits might make it more appealing for solo play.\n\nBeaten with River, Lightning, Earth, and Wildfire--all feel fine for solo. Shadows was a mess every time, and did not feel built for solo. I've heard Ocean can be rough solo as well.",
    "timestamp": 1738537200
  },
  {
    "username": "MartynF",
    "rating": 6.0,
    "comment": "I only played once, with the Jagged Earth expansion.\n\nI am not fond of coop games, but this is interesting and works well. But it takes quite some time to play it. And the higher level cards plus events can make it very hard. Not only to see what is needed, but also what's going to happen.\n\nI had a good time playing it, but it wasn't exciting or anything. I can imagine this is a very good solo game.",
    "timestamp": 1737846000
  },
  {
    "username": "bluestem",
    "rating": 6.0,
    "comment": "Good cooperative premise, alas the art is so offensive to women and indigenous peoples that it's hard to bring to the table.",
    "timestamp": 1736895600
  },
  {
    "username": "djsturz",
    "rating": 6.0,
    "comment": "Very cool game with tons of powers that intertwine in unique ways, but ultimately not my style of game.",
    "timestamp": 1736204400
  },
  {
    "username": "mustafazirek",
    "rating": 6.0,
    "comment": "we played a 4 players game with suggested characters and cards. its not my style but it is a really good designed game.",
    "timestamp": 1736204400
  },
  {
    "username": "Argand",
    "rating": 6.0,
    "comment": "No me termina de convencer, me parece un rompecabezas en el que optimizar la secuencia de cartas del espíritu.",
    "timestamp": 1736118000
  },
  {
    "username": "Luminario",
    "rating": 6.0,
    "comment": "Updated",
    "timestamp": 1735945200
  },
  {
    "username": "drydoc",
    "rating": 6.3,
    "comment": "Spirit Island, tedium the board game, cooperative edition. Would you rather do your taxes or play Spirit Island? It's a hard choice, but finishing your taxes is quite satisfying.\n\nVerdict: Unsatisfying tedium, overhyped",
    "timestamp": 1735772400
  },
  {
    "username": "Fravoc",
    "rating": 6.0,
    "comment": "*Good at 2-3 players, feels like more would create too many simultaneous actions and effects, and time spent\n*Great design and feels balanced\n*Cool asymmetric player powers with each spirit, adds replayability\n*There is definitely crunch and brain burn in there, players prone to AP will feel it\n*Quite tough, the game does not hold back in making things difficult for you so you have to like that\n*I wish the components, the plastic explorers and towns as well as the huts would have more detail to them. The boards are also a bit uninspiring and could be richer in detail, higher production values",
    "timestamp": 1735686000
  },
  {
    "username": "MatroidX",
    "rating": 6.0,
    "comment": "Only played once (4p, won pretty handily). Pandemic on steroids.\nNeeds more plays to evaluate properly.",
    "timestamp": 1735686000
  },
  {
    "username": "Doerk",
    "rating": 6.0,
    "comment": "I actually don't like cooperative games and games with variable player powers. Moreover I don't understand why existing nation names are used in the game. I don't see any revolting new idea in this game.",
    "timestamp": 1735254000
  },
  {
    "username": "froggy0714",
    "rating": 6.0,
    "comment": "Sold-we just could not find a way to enjoy this game",
    "timestamp": 1735167600
  },
  {
    "username": "Pura_Vida",
    "rating": 6.0,
    "comment": "Bought it for the theme, which is very okay. But this game is too harsh, too predictible, too repetitive for my taste. And maybe I just don't like cooperative games.",
    "timestamp": 1735167600
  },
  {
    "username": "msalmon14",
    "rating": 6.0,
    "comment": "the reason I want to own a Co-Op game is so that I can invite people into a game that aren't as well versed in gaming and they don't feel like they're going to get smashed and we can all still have a fun time. This game is a little too weighty for the sole purpose of inviting someone 'new' to gaming to play. That being said I did like it a lot.",
    "timestamp": 1734044400
  },
  {
    "username": "Danzo",
    "rating": 6.0,
    "comment": "My rating is for solo play on the digital version on Steam. It's a challenging and interesting game, customisable difficulty levels are great, the spirits have a lot of variety. I'm not sure I could be bothered with the physical version though: all the admin, counting up elements, keeping track of range restrictions, it all seems like it would be very fiddly and add significantly to the length of the game.",
    "timestamp": 1733871600
  },
  {
    "username": "browneggie",
    "rating": 6.0,
    "comment": "steam online",
    "timestamp": 1733180400
  },
  {
    "username": "Sedd",
    "rating": 6.0,
    "comment": "Kurz: Definitiv ein Expertenspiel, obwohl alles in allem nicht so Komplex ist. Es gibt nur viel zu beachten, planen und abzusprechen. Deshalb gutes Spiel für 1-2 Spieler. Das Spielmaterial ist ziemlich cool. Thema mag ich auch. Mir ist es nur leider zu langatmig.\n\nLang:\nPro:\n-Spielidee/Thema: Als Urgeister die naiven, zerstörerischen Einwanderer/Siedler von seiner Insel vertreiben. (Gott sein dürfen)\n-Dessen Umsetzung/Material: Urgeister und alle Helfer (wie z.B. indigene Stämme), sind aus Nachwachsenden Rescourcen hergestellt, Invasoren (Entdecker, Dörfer,Städte) aus Plastik.\n-Spielgefühl, wird durch Mechanik+Optik gut umgesetzt: Invasoren erkunden erst, bevor sie bauen. Wenn z.B. Häuser zerstört werden, wird automatisch Furcht erzeugt. Genügend Furcht bringt zufällige Bonis wie z.B. das die Ureinwohner sich besser verteidigen.\n-Optik allg.: Von den Göttern /Spieletableau, über die Karten, bis zu dem allg. Tableau. (Lediglich die Karte( sehr Bunt auf der einen Seite,ggfl. unübersichtlich auf der anderen), sowie Furchtmarker(erzeugen bei mir keine Furcht) hätten besser sein können.)\nKontra:\n-nicht Einsteigerfreundlich, da viel beachtet werden muss. (Ablauf, Energie-Kosten, Initiativen, eigene Fähigkeiten, Einheitentypen(+Stärken), usw.)\n-je mehr mitspielen, desto schwieriger wird es. Das fängt schon mit der richtigen Wahl/Kombi an Geistern an. Außerdem wird die Insel mit jedem Spieler um 8 Felder größer. Schwächen von anderen Geistern, muss man mit eigenen Stärken wieder ausgleichen.\n-Solo ist es zwar tendentiell einfacher, aber dann kommt man nicht in den Genuss einer guten Symbiose von Geistern.\n-Aufgrund vieler Absprachen, dauert eine Partie länger wenn mehr mitspielen. 120min sind eigentlich nur solo oder zu 2. möglich",
    "timestamp": 1733007600
  },
  {
    "username": "Alfytos",
    "rating": 6.0,
    "comment": "It's just not my type of game since it's coop and there could be an alpha player.",
    "timestamp": 1732921200
  },
  {
    "username": "postarx",
    "rating": 6.0,
    "comment": "Spirit Island has fantastic theming and tells a good story -- but the fully simultaneous play makes it the most \"backseat driver\" of any co-op game out there. If your game works better solo, then why release it as a co-op game?",
    "timestamp": 1730329200
  },
  {
    "username": "ogzz",
    "rating": 6.0,
    "comment": "Owned by a friend",
    "timestamp": 1728252000
  },
  {
    "username": "CarsonChandler",
    "rating": 7.0,
    "comment": "Long for me, but always such a rollercoaster! I enjoy exploring the synergies between the spirits and am slowly getting better at this.",
    "timestamp": 1762653360
  },
  {
    "username": "Cerebral333",
    "rating": 7.0,
    "comment": "WantToPlay #8",
    "timestamp": 1762124400
  },
  {
    "username": "lorex888",
    "rating": 6.5,
    "comment": "Sold (Oct. 2019 Glass Die Sell/Swap)",
    "timestamp": 1761084000
  },
  {
    "username": "Denist",
    "rating": 7.0,
    "comment": "1-4",
    "timestamp": 1760911200
  },
  {
    "username": "Takhyon",
    "rating": 7.0,
    "comment": "Very cool co-operative game. Based on the BGG weight I was expecting a lot more rules but this is actually relatively easy to get into. I love that the complexity comes more from understanding the game flow and how to play it well, and that there’s so many different difficulty sliders you can adjust to tailor the experience to your liking. I definitely see what people love about it. There’s so much depth and interesting synergies to discover with the card powers and the asymmetry, which probably just gets better with multiple plays. Could see myself rating this higher if I get to play it more.\n\nAlso setting it apart from other games with the “players do good thing, game do bad thing” -dynamic is that the bad happenings are, with the exception of the exploration card flip, completely open and calculable information for players. Really makes a big difference to the overall feel of the game since you can appropriately plan for pretty much everything that’ll be happening two rounds before it does. Makes for some really crunchy decision space with how to use the powers and how they interact together, especially since depending on the power it can either trigger immediately or retrospectively.\n\nI just have a slight personal quibble with this due to the way my brain approaches games, as I often want to be aware of the entire picture, which isn’t possible here. This wouldn’t bother me in a competitive setting since I would mostly be focused on solving my own puzzle, but trying to solve a problem as a team when you’re not completely aware of what other players are capable of doing was difficult for me. It’s undoubtedly an effective way of eliminating the alpha gamer -problem from a game, but I would probably enjoy this the most solo.\n\nAlso in a more nitpicky sense, I think the production is kind of a mixed bag, the theme, the card artwork, and graphic design are top notch, but the board is very abstract, and the flimsy plastic pieces for the invaders feel like they’re components from a completely different game all-together, giving it quite the disjointed look. I get that people like it since “plastic = bad” but personally just was not a fan, though am definitely nitpicking here.",
    "timestamp": 1760392800
  },
  {
    "username": "campingdude84",
    "rating": 7.0,
    "comment": "This game was just too dense",
    "timestamp": 1760306400
  },
  {
    "username": "flpii",
    "rating": 7.0,
    "comment": "Good coop game. A bit too fiddly and too long, wouldn't play with more than 3.",
    "timestamp": 1759528800
  },
  {
    "username": "tjbizzle",
    "rating": 6.5,
    "comment": "I never thought that I would be one of the people that wouldn't like this game because it was too complex... but I am. I also am learning that I don't love cooperative games (unless it's a quick or party style game). The theme of \"more stuff coming at you ever turn\" is actually very stressful for me as well. The card play and asymmetric powers are absolutely the best parts of the game for me here.",
    "timestamp": 1759442400
  },
  {
    "username": "Nightdream",
    "rating": 7.4,
    "comment": "#pocztaplanszówkowa",
    "timestamp": 1759356000
  },
  {
    "username": "GamechangerWithHoney",
    "rating": 7.0,
    "comment": "Like the gameplay. Dislike Theme.",
    "timestamp": 1759183200
  },
  {
    "username": "toarukun",
    "rating": 6.5,
    "comment": "It's a great full co-op game, everyone needs to know their character. Having a functional team is important. Deck building.",
    "timestamp": 1759183200
  },
  {
    "username": "kwalzl",
    "rating": 7.0,
    "comment": "7A",
    "timestamp": 1758664800
  },
  {
    "username": "danielmleitao",
    "rating": 7.0,
    "comment": "Rated: 08/2020\nEdited: -",
    "timestamp": 1758664800
  },
  {
    "username": "Labrasolo",
    "rating": 7.0,
    "comment": "Bibliothek",
    "timestamp": 1758578400
  },
  {
    "username": "Hyp3rrr",
    "rating": 7.0,
    "comment": "On paper I like this game a lot, the variability, all the different spirits, the different opponents. On paper it is a great game. But in practice I just did not find this as fun.",
    "timestamp": 1757800800
  },
  {
    "username": "AndBobsYourUncle",
    "rating": 7.0,
    "comment": "Need to play more!",
    "timestamp": 1757541600
  },
  {
    "username": "Biker1999",
    "rating": 7.0,
    "comment": "Picked up primarily for solo play. Early comments are very positive.\n\nWhile I like the game, I don't pull it out very often as the brain-burn required tends to keep me from simply having fun with what I'm doing.",
    "timestamp": 1757455200
  },
  {
    "username": "deedee1504",
    "rating": 7.0,
    "comment": "I will play this if someone else is administrating it. For my tastes, it’s fiddly and takes a lot of mental processing to both play and admin. This is a result of not getting it to the table often enough to internalize everything. The expansions add so many small tokens and rules. If this fits into your regular routine, you might like it. If you might only play it every 3-6 months, I wouldn’t recommend it.",
    "timestamp": 1756936800
  },
  {
    "username": "unluckyprimes",
    "rating": 7.0,
    "comment": "FallCon",
    "timestamp": 1756245600
  },
  {
    "username": "SouthernGirl",
    "rating": 6.5,
    "comment": "Not my favorite style of game. When the invaders get out of control, it’s not fun and kills you like a cancer. When you win it seems uneventful and a tad boring. Similar to games like pandemic and Arkham Horror 2nd edition in that way",
    "timestamp": 1755900000
  },
  {
    "username": "Cam27",
    "rating": 7.0,
    "comment": "2017 Game with of powers and mayhem with solid mechanics.",
    "timestamp": 1755468000
  },
  {
    "username": "gamerdude53978",
    "rating": 6.5,
    "comment": "We've played this a couple of times. It's unique, but simply isn't as much fun as many of the other games we have at this level. If someone is playing it, we might consider it, but haven't been motivated to pull it out recently with the options we have.",
    "timestamp": 1755468000
  },
  {
    "username": "nanobastaddo",
    "rating": 7.0,
    "comment": "This game is not 4.5 weight. Maybe it is a 3.50. Yes the sequence must be learned and yes some spirits are more complex.\nIt can be difficult to win, but not difficult to play. You learn the sequence after 3 turns and some spirits are easy as a medium game. Anyway, medium game and funny game. Strategic and coop. Semi-abstract\n\nWhile the game became popular in its intention to put itself against stereotypes, it also seems to continue to uphold others, and this can create confusion in some players. Perhaps it's best not to think about that too much and remember its more fantasy than historical.",
    "timestamp": 1755208800
  },
  {
    "username": "cinnzel",
    "rating": 7.0,
    "comment": "Debo decir que es uno de los juegos cooperativos más difíciles que he jugado. Lo de las acciones rápidas y lentas en cada turno se hace un poco bola, al principio, pero, al final, es cuestión de costumbre. Para jugar en pareja o en solitario, con más gente es bastante caótico.",
    "timestamp": 1755036000
  },
  {
    "username": "VoxSkitarii",
    "rating": 7.0,
    "comment": "Tons of stratagy in this co-op games. Only downside in my opinion is the ammount of board state maintaining you need to do between rounds (i.e the exlporers moving/building ect.) Its mamagable for a small game but can take a bit of time at larger player counts.",
    "timestamp": 1754863200
  },
  {
    "username": "Aredan1528",
    "rating": 7.0,
    "comment": "It's ok again one that had a lot of hype where I just felt was ok at best.",
    "timestamp": 1754863200
  },
  {
    "username": "sykano",
    "rating": 6.9,
    "comment": "complex cooperative game with theme of elemental spirits trying to protect their island from colonist invaders\n\nThere is a lot to like, but also a lot to dislike!\nOn the whole this is a great design nonetheless!\nI admire the design and theme.\nMy rating is not higher because I still wouldn't want to play it all the time (too scripted, too much bookkeeping, not that much variation, takes a lot of mental energy to play).\n\n+++ theme is really nice (!)\n++ great mechanics (power cards, fast and slow, reclaiming cards, gaining new power cards, growth choices, presence, innate powers, element symbol activation thresholds, ...)\n+ asymmetric player powers is great, nice player boards\n+ simultaneous play\n+ very good game arc\n- quite abstract\n- difficult to play, difficult to win (at least in high difficulty levels)\n- thinky and AP-prone\n- lots of bookkeeping, easy to make mistakes\n- somewhat luck-dependent (fear cards, learning powers)\n- becomes quite complex in later rounds with more than 2 players\n- enemy too scripted and mechanical, spreads and grows too extremely, feels always the same despite scenarios/adversary rules/...\n- blight markers and invader figures overproduced (at least the explorers), fear markers shape impractical\n- graphics design of the cards (small images, predefined spaces for the elements that are always shown even when not needed)\n- replayability turned out smaller than expected\n- insert does not leave enough space\n- some spirits only as promos and extra expensive, hard to acquire all game contents\n- very expensive\n\n\nThe insert with trays is a fine gesture, but it is hard to fit everything back into the box. Card sleeves can also cause problems. So there went something wrong with the design of the insert.\n\nI really like the theme but the execution could have been a bit better.\n\nThe game is quite thinky. You have to like that to some extent.\n\nLess alpha gamer problem because of hidden information, is good.\nLots of complex stuff to do means a lot of communication overhead needed between the players.\n\nI really dislike that a town grows into town+city instead of just a city. Seems wrong and overpowered.\n\nThere is some odd luck-dependence in the fear cards (which too often tend to be useless) and when learning a new power from 4 random cards.\n\nAgain, the theme is really nice! Playing a cool elemental spirit is fantastic!\n\nThe arc in which the relative strength between spirits and invaders changes is great. At the beginning the spirits are relatively weak while the invaders come strong. It seems impossible to stop the invader flood. But over the course of the game the spirits become more and more powerful, while the invaders also become slightly stronger. If things go right the spirits will have a close edge at the end of the game and can win.\n\n\nFor me \"Spirit Island\" is a game of which I admire the design and theme but I just don't want to play it again, except maybe in very rare instances in which I could be persuaded to play it.\nI find it a bit too arduous to play, a bit too scripted and the system to increase difficulty feels too clunky.",
    "timestamp": 1754690400
  },
  {
    "username": "BlakeStreeter",
    "rating": 7.0,
    "comment": "Logan",
    "timestamp": 1754344800
  },
  {
    "username": "ZixXer",
    "rating": 6.5,
    "comment": "looks like it can be really nice once you dive deeper in the game, but seemd to be a bit to much on rules",
    "timestamp": 1754344800
  },
  {
    "username": "Draiqil",
    "rating": 7.0,
    "comment": "I have found that i can't enjoy this game the way it comes, and if i ever want to get into playing it, i am going to have to develop my own house rules. As it stands, there are so many interactions and things to keep track of that co-operating is very hard and is only successful when another player is reactive to another players action and sees synergy potential. I want to love it, and it is due another go, hopefully my mind can be changed.",
    "timestamp": 1753912800
  },
  {
    "username": "Collons2De1Deu",
    "rating": 7.0,
    "comment": "From 9.5 to 8.5\nAnticlimactic end.\nAP-prone game.\nHigh maintenance",
    "timestamp": 1753740000
  },
  {
    "username": "S04Niels",
    "rating": 7.0,
    "comment": "Bücherei",
    "timestamp": 1753653600
  },
  {
    "username": "bombotcg",
    "rating": 7.0,
    "comment": "Decent game but I don't enjoy the feeling of putting out fires",
    "timestamp": 1753567200
  },
  {
    "username": "Linvala",
    "rating": 7.0,
    "comment": "Very good complex game. Less appealing because of many components and phasing can be a bit confusing. Deck management and options for helping friends takes too much time if you want to optimize gameplay.",
    "timestamp": 1753308000
  },
  {
    "username": "Samustroid",
    "rating": 7.0,
    "comment": "It's cool to be on the right side of history. The pieces are really neat--the Dohan are wood and the Europeans are all plastic. I'm not nuts about Co-op games, but I keep this one around because I love the theme. It's neat to play a game that responds to Catan and other Eurogames that center on exploitation of labor, the environment, etc....It's also neat to play in a world where the Gods have agency.\n\nIt is also the Cadillac of Pandemic-style games.\n\nI will never probably play with all the expansion(s), but I have them all dumped in the base box (with some spillover in the Branch and Claw box).",
    "timestamp": 1752444000
  },
  {
    "username": "TS_unlaywin",
    "rating": 6.5,
    "comment": "Rating based on one play at beginner difficulty",
    "timestamp": 1752012000
  },
  {
    "username": "Drewborn",
    "rating": 7.0,
    "comment": "Branch and Claw and promo combined into base box",
    "timestamp": 1750888800
  },
  {
    "username": "lawmen",
    "rating": 7.0,
    "comment": "每位玩家扮演一個精靈，並藉由各自的法術合作拯救島上的原住民免於被人類侵害，玩起來蠻有難度，要控制汙染物又要控制敵人的單位不能太多，非常有緊張感，何時打甚麼法術卡也很重要，玩家間需要互相配合，但又不太會出現主導的情形，畢竟每個人的手牌資訊為未知，玩起來還不錯，難度可以調整又有很多精靈可以選擇跟搭配，變化性非常足夠",
    "timestamp": 1750888800
  },
  {
    "username": "fergaliciousMe",
    "rating": 8.0,
    "comment": "This is an excellent game with an innovative topic which rewards multiple plays. Admittedly, it was too brainy for us though",
    "timestamp": 1762583640
  },
  {
    "username": "High_Hopes_NC",
    "rating": 8.0,
    "comment": "First impressions. I can see the rating going up over time.",
    "timestamp": 1762580580
  },
  {
    "username": "Golgonooza",
    "rating": 7.8,
    "comment": "A cooperative game where explorers are spreading, settlements are being built, and blight slowly decimates the land. The system isn't that complex, despite the claims, and once you play it a few times, the admin isn't that bad (still a bit of a chore, though).\n\nI was initially intimidated by the folks who said the system is difficult/challenging to learn. There are a few moving parts, but it repeats the same three actions on the invaders' turn every phase.\n\nThe hardest thing is the actions of the various spirits. Each spirit is different from the other, and finding out how to play them and then play them well isn't usually picked up in one session. It took me a while to win the game.\n\nOverall, it is a fun game for people who want to figure out a longish game with some interaction (but not as much as I'd like).\n\nIt is a great game. It kept its initial rating of 8.5 since 1-21, but now that I've revisited it over the last few months, I can't say I'm that excited to get it to the table that often. It is a good game, and I'll play it if another person wants to. I might take it out now and again for solo plays.",
    "timestamp": 1762383600
  },
  {
    "username": "Dasoogle",
    "rating": 8.0,
    "comment": "It's very fun and immersive, but I would hate to do the admin",
    "timestamp": 1761951600
  },
  {
    "username": "FoxenCreator_",
    "rating": 8.0,
    "comment": "interesting idea",
    "timestamp": 1761692400
  },
  {
    "username": "merismo",
    "rating": 7.5,
    "comment": "I'm kind of conflicted on how to rate this. The gameplay itself is spectacular- lots of brain-burning team strategizing and edge-of-your-seat tension. The inability to directly attack the bad guys is frustrating, but it meshes perfectly with the central gameplay- as a Spirit, you are here to sway the odds in the favor of the natives, not outright interfere. It makes for some very tight turns, and plenty of sighs of relief when you just barely make it. The artwork is similarly high-caliber and the theme is just plain cool. It's a nice departure from the typical aggressive/invasion style games.\n\nBut man... is the ending sure anticlimactic. I've always had a swell time playing this game right to the very end, then its all- welp, we got enough fear tokens! The bad guys are all scared now! Ok time to put everything away.\n\nI know this is a common issue with a lot of cooperative games (and why I'm usually not too fond of them), but the post-win clarity hits especially hard with this one. It still ranks among my favorite cooperative games, but even then I am not usually clamoring to play it.",
    "timestamp": 1761606000
  },
  {
    "username": "AlbertoRavioli",
    "rating": 8.0,
    "comment": "85/100",
    "timestamp": 1761519600
  },
  {
    "username": "jonesy792",
    "rating": 8.0,
    "comment": "Engaging co op that presents the player with plenty of food for strategic thought. Apart from crushing new players, the difficulty is a big part of its high replayability and makes winning very satisfying.\n\nA resilient base game but with plenty of potential for expansions (and “Branch and Claw” is a great expansion). For me and my brother, this is probably a Pandemic killer. Albeit we do like heavier games.\n\nHowever, some shortcomings prevents this from getting a higher score. For a game of this weight, it has a fairly steep learning curve, as the gameplay is very punishing, at times a grind, and prone to analysis paralysis.",
    "timestamp": 1761429600
  },
  {
    "username": "Kucharuk",
    "rating": 8.0,
    "comment": "+ Folded Space Insert",
    "timestamp": 1761429600
  },
  {
    "username": "MegaWestWolf",
    "rating": 8.0,
    "comment": "I want to like this game so bad. It is fiddly, and has a lot of accounting going on from turn to turn. It also suffers from the same thing Vast does in my opinion...not only do you need to understand how the overall game works, but you need to understand how your individual spirit works. It rewards multiple plays, but this isn't a game that would get multiple for me anyway.\n\nYou are so focused on your own game, and how it needs to be played, that the worst thing that happens is when another player says, \"What should I do?\". I don't know, how about you figure it out and do your job!\n\nUpdate (10/25): Spent some time playing with someone who was able to translate this game into a really good time. Immediately went out and bought everything for it.",
    "timestamp": 1761170400
  },
  {
    "username": "07734",
    "rating": 8.0,
    "comment": "Main",
    "timestamp": 1761170400
  },
  {
    "username": "moonerie",
    "rating": 8.0,
    "comment": "Challenging co op game. Pretty fun",
    "timestamp": 1760911200
  },
  {
    "username": "cypar7",
    "rating": 8.0,
    "comment": "Complex, but fun!",
    "timestamp": 1760738400
  },
  {
    "username": "lortelars",
    "rating": 8.0,
    "comment": "this is a fantastic game. I love the base game so much I have had so much fun with it. if you ask me the expansion takes away from the perfect experience, like the new cards are great but I hate the event thing. anywho this is the best coop game I have ever played. it is not perfect since the main problem with the game is that it get quite lengthy with more than 2 players, 3 players are fine but 4-4+ is unbearable for my taste. but that is a problem that you can easily get around... but that was before I got my own version of the game and yes I still like it but it takes so long to set up, I much much prefer the online (tts) version of this game to the point I am thinking about getting rid of my own copi.",
    "timestamp": 1760392800
  },
  {
    "username": "Auroric",
    "rating": 7.5,
    "comment": "Need more plays. Solo this game didn't grab me as much as I thought it would. I should adore this game, but I find it a little... unsatisfying? Need to try multiplayer. Clearly a great game objectively, but a little fiddly and repetitive in it's whack-a-mole gameplay.\n\nI'm still determined to love this game, but I still don't. Going to play it more though and try the scenarios.",
    "timestamp": 1760392800
  },
  {
    "username": "honeybeast25",
    "rating": 8.0,
    "comment": "Probably one of the best co-op games there is.",
    "timestamp": 1760306400
  },
  {
    "username": "radsailor",
    "rating": 8.0,
    "comment": "fast and furious fun",
    "timestamp": 1760306400
  },
  {
    "username": "Harveymcglenn",
    "rating": 8.0,
    "comment": "Complex decisions. When you add in the uncertainty of coop, it is crunchier than gloomhaven but slightly less so than mage knight. What it does have above mage knight is the spirits are kuch more different than the characters in mage knight. Mage knight can be played the same with only slight differences with each character. In Spirit island each spirit requires drastically different decisions.\n\nMage knight is the funner game, but spirit island is a better coop.\n\nEdit: maybe the crunch is a little fiddly. I like the fiddlyliness in moving strategic parts when competitive, but in coop having to coordinate those moving parts is less fun.\n\nEdit: same as all coops....low on the dynamics that only player opponents can provide.",
    "timestamp": 1760306400
  },
  {
    "username": "heatbbx",
    "rating": 8.0,
    "comment": "+ Horizons of Spirit Island\n+ Branch and Claw\n+ Feather and Flame\n+ Nature's Incarnate\n+ Deluxe Token Pack 1+2\n\nRating Tracker:\nJan 2023 - 8.5\nMay 2023 - 8\nSeptember 2023 - I don't think this game is for me upon multiple plays. So many cool ideas but it just drags on too long for what it is.",
    "timestamp": 1760220000
  },
  {
    "username": "jandhi2",
    "rating": 8.0,
    "comment": "03-15-20 First time through, take all advantages the rulebook will give you, otherwise you will be beaten down til it may not be fun enough to want to play again. Brain-burning options, predictable enemy movements, but overwhelming odds. Too many things to keep track of eliminates the ability to alpha-game. Increased complexity characters don't feel cooler, just handicapped. Beginning characters are the coolest. The realistic terrain map clumps terrain types, so some spirits get into trouble sooner than others.\n11-22-20 Coming back to the game for the first time in 6 months, the first rounds seem toughest when you don't know yet where the colonizers are headed. Once you can predict that, you have some idea what to plan for. I like the struggle to choose between elements and card powers in the late game. In a solo game, most of the fear cards offered to do things I had already accounted for.\n10/10/25 The river spirit was tough to use to my advantage.\n(SK 63.5x88#119 & SK 45x68#15)",
    "timestamp": 1760133600
  },
  {
    "username": "turtol",
    "rating": 8.0,
    "comment": "Friend's copy, own it on steam\n\nPros: Definitely an interesting concept, fun to combo cards together to deal with invaders, not the biggest fan of putting out fires.\n\nCons: For most of the game until you unlock higher fear levels it feels like you aren't making any progress. If you have an easier spirit and your friends have more complex ones you can end up waiting for them to decide what to do.",
    "timestamp": 1759874400
  },
  {
    "username": "YoLYcmqZ",
    "rating": 8.0,
    "comment": "Thoughts: I play a lot of solo games and this is #1 on everyone's list. Just too difficult for me to grasp. Tried single and double-handed but it never clicked. Sold what I had and still have the digital game for that occasional itch, but it wasn't for my euro-loving heart. Respect what it does but couldn't get past the complexity.\n\nBest Player Count: 1-4, {2}\nRating: 9.5, -1.5\nOwn: Sold, Digital\n+ Spirit Island: Branch and Claw (Digital only)\n+ Horizons of Spirit Island (Digital only)",
    "timestamp": 1759788000
  },
  {
    "username": "Tannerd",
    "rating": 8.0,
    "comment": "Sold it, and then bought back. Determined to get it under my skin.",
    "timestamp": 1759788000
  },
  {
    "username": "dirtball",
    "rating": 8.0,
    "comment": "Contents: Very Good\nBox: Very Good\nVersion: English edition, thirteenth printing (2022)",
    "timestamp": 1759701600
  },
  {
    "username": "brootalatops",
    "rating": 8.0,
    "comment": "Great game. The theme and overall mechanics work well. I wish they would remake it with more consistent art and graphic design. It's a bit much when you also consider the overwhelming amount of iconography and terminology you need to keep track of. Thinking out the power combination possibilities with other players in this game to solve the problem of the spreading invaders makes my head spin sometimes but it is super satisfying when you plan out and pull off a game saving turn. Plays best with 2 or solo.",
    "timestamp": 1759615200
  },
  {
    "username": "logopolys",
    "rating": 8.0,
    "comment": "Cooperative Game / Team Game\n\nGreat coöp that tackles anti-colonialism and anti-imperialism as it ought to be dealt with: by killing off the Europeans. The sheer variety in the spirits is impressive; each one feels like playing a slightly different game, and that's one of the best ways to do variable player powers. My favorite so far is the Ocean; I find it to be thematic and powerful.",
    "timestamp": 1759442400
  },
  {
    "username": "ChriisP",
    "rating": 7.5,
    "comment": "Q1/20\n+ Ast und Tatze (Q1/20)",
    "timestamp": 1759269600
  },
  {
    "username": "mhinto",
    "rating": 8.0,
    "comment": "2-4 players",
    "timestamp": 1759096800
  },
  {
    "username": "dannyboyyy",
    "rating": 8.0,
    "comment": "brain go ow in i think a fun way",
    "timestamp": 1759010400
  },
  {
    "username": "KanChri",
    "rating": 8.0,
    "comment": "20",
    "timestamp": 1758578400
  },
  {
    "username": "zocl",
    "rating": 8.0,
    "comment": "Spirit Island with Horizons of Spirit Island: I really enjoyed the different spirits and the creativity of them and their stories. I played this solo. But something about the gameplay just never really connected with me, even after many tries. I did enjoy the card play and how different the spirits were. The pushing and pulling of the dahn, the slow powers and also the area control aspect of the game mechanisms were a bit of a barrier for me though. My mind just doesn’t work in the way that was needed for this game so I ended up gifting this to a friend. But I think it is a super game and I can see why it it is favorite for many.",
    "timestamp": 1758232800
  },
  {
    "username": "de_spieler",
    "rating": 8.0,
    "comment": "Spirit Island is a great coop puzzle game. I really love complex mechanics and combo potential with different spirits. It absolutely does live up to all the hype. The game provides an interesting puzzle and you really can feel like you are fighting an uphill battle against the greater force of the invaders.\nHowever I should note my personal nitpicks with SI.\nFirst of all, spirits are not that asymmetrical. In the end of the day, most spirits in the base game play kind of the same, just with emphasis on different mechanics (more direct removal or more moving the invaders, for example). The obvious exceptions are Ocean and Nightmare. Maybe DLCs provide more \"gimmick\" spirits and when I will play them I will change my mind.\nSecondly, Spirit Island on the base difficulty becomes really easy after like 1-2 games. So far I tried difficulties up to 3. It really is quite easy to \"solve\" the game in like 3-4 rounds up to that point. However I did not yet try the highest difficulties + I played only one game with the first expansion. So this part of the rewiew is absolutely a subject to change as I play and expirience more of Spirit island (I will!)",
    "timestamp": 1757887200
  },
  {
    "username": "blaklyte",
    "rating": 8.0,
    "comment": "Expansion:\n- Branch & Claw\n- Jagged Earth\n- Feather & Flame",
    "timestamp": 1757887200
  },
  {
    "username": "casualgod",
    "rating": 8.0,
    "comment": "$55",
    "timestamp": 1757800800
  },
  {
    "username": "s010010",
    "rating": 8.0,
    "comment": "2 Spieler",
    "timestamp": 1757628000
  },
  {
    "username": "kaepone",
    "rating": 7.5,
    "comment": "This is Pandemic 2.0. The various spirit powers and growing more powerful round after round are interesting. I don't really care for Pandemic because of how impactful the random stack of cards is on the game (it can make your game easy or impossible). Spirit Island seems to improve on that system substantially with a river of cards determining which map areas are affected by which actions. At the same time is takes the co-op puzzle of Pandemic and cranks it up to 11 with all the Spirits and power cards, different invaders \"units\" and building up fear.\nIt was super fiddly the first time I played. After \"downgrading\" to Horizons of Spirit Island, it was still a bit of a slog, but by my second game of that I feel a lot more confident in what is going on and how to play and teach the game. Looking forward to more sessions and exploring the other Spirits.",
    "timestamp": 1757455200
  },
  {
    "username": "adamphipps11",
    "rating": 8.0,
    "comment": "1-4 Players\nBest: 2",
    "timestamp": 1757455200
  },
  {
    "username": "beat9946",
    "rating": 8.0,
    "comment": "2024/12/24処分",
    "timestamp": 1757455200
  },
  {
    "username": "invertebrate_ooze",
    "rating": 8.5,
    "comment": "long, but that's my only complaint so far",
    "timestamp": 1762653480
  },
  {
    "username": "Jesenberg",
    "rating": 9.0,
    "comment": "B",
    "timestamp": 1762383600
  },
  {
    "username": "lebanesesqueeze",
    "rating": 9.0,
    "comment": "Co-op, asymmetric, invader cascade, strategy, 90-120 mins, 1-4 players",
    "timestamp": 1762297200
  },
  {
    "username": "doublecrocodile",
    "rating": 9.0,
    "comment": "10 plays so far and I like Spirit Island a lot. It can play surprisingly quickly which I appreciate. I'm not sure if I'm in love with it yet. but it could happen. I've only scratched the surface of the possibilities here",
    "timestamp": 1761778800
  },
  {
    "username": "abeheron",
    "rating": 9.0,
    "comment": "I mostly play this on Steam these days... easier setup . But it is a great co-op/solitaire game.",
    "timestamp": 1761692400
  },
  {
    "username": "heroboyzzz",
    "rating": 9.3,
    "comment": "4367팝콘/6590보드엠",
    "timestamp": 1761692400
  },
  {
    "username": "ditterio",
    "rating": 9.0,
    "comment": "SPIRIT ISLAND (1-4 players)\nJAGGED EARTH (1-6 players)\n\nFAQ: https://boardgamegeek.com/filepage/162937/spirit-island-faq-...\n\nPlayer aid: https://drive.google.com/file/d/1ct4cYB_5v9DV3KKWQakFN9Khn9j...\n\nRules reference: https://boardgamegeek.com/filepage/158564/spirit-island-rule...\n\nQuick rules Spirit Island Jagged Earth: https://boardgamegeek.com/filepage/235264/order-turn-quick-r...\n\nStrategy Spirit Island: https://boardgamegeek.com/thread/1822927/tips-early-plays-an...\n\nSpirits:\n\nA spread of rampant green (won)\nBringer of Dreams and nightmares (won)\nFractured days split the sky (unplayed)\nGrinning trickster stirs up trouble (won)\nLightning's swift strike (won)\nLure of the deep wilderness (won)\nMany minds move as one (unplayed)\nOcean's Hungry Grasp (won)\nRiver surges in sunlight (won)\nShadows flicker like flame (won)\nShifting memory of ages (unplayed)\nShroud of silent mist (unplayed)\nStarlight seeks its form (won)\nStone's unyielding defiance (won)\nThunderspeaker (won)\nVengeance as a burning plague (unplayed)\nVital strength of the earth (won)\nVolcano looming high (won)\n\nTremendously fun coop!",
    "timestamp": 1761692400
  },
  {
    "username": "BoardGameBananas",
    "rating": 9.0,
    "comment": "Long live the Dahan",
    "timestamp": 1761606000
  },
  {
    "username": "austintehguy",
    "rating": 9.0,
    "comment": "1-4; 1.5 - 2 hr",
    "timestamp": 1761519600
  },
  {
    "username": "mudville9",
    "rating": 9.0,
    "comment": "+promo packs 1 & 2\n\nHas surpassed Robinson Crusoe as my favorite Solo game. Spirit Island give me a \"tower defense\" feel with the constant swarms of invaders. There's a lot of content in the box with tall of the spirits and scenarios.",
    "timestamp": 1761519600
  },
  {
    "username": "Lemonstew",
    "rating": 9.0,
    "comment": "협력 게임의 정점\n1인플의 정점",
    "timestamp": 1761519600
  },
  {
    "username": "DTRMGiraffe",
    "rating": 8.5,
    "comment": "Will need to play more to confirm 9/10, but I'm really liking it right now",
    "timestamp": 1761519600
  },
  {
    "username": "wrandrall",
    "rating": 9.0,
    "comment": "Brain burner.\n\nThe spirits' progression and power rise are very enjoyable, and the invaders are truly mean.\nThe theme / mechanics integration is top notch.\n\nI certainly would not play it every day, but if we're in the mood, that's a blast.\n\nThe inserts are terrible, though.",
    "timestamp": 1761519600
  },
  {
    "username": "JammyDodger3579",
    "rating": 9.0,
    "comment": "I mean, what is there to say - a standout in co-op gaming. The asymmetry feels so flavourful, and the theming is such fun. So satisfying to finally get to wipe those invaders back. Avoids quarterbacking due to complexity, which is a bonus",
    "timestamp": 1761429600
  },
  {
    "username": "budkin",
    "rating": 9.0,
    "comment": "10x10 2025\n\nsince 2017\nsolo keep, 2018/11\nDD\n\nW/L\n\nLightning's Swift Strike - 2/1\nVital Strength of Earth - 2/0\nRiver Surges in Sunlight - 1/2\nShadows Flicker Like Flame - 2/0\nSpread of Rampant Green - 2/0\nThunderspeaker - 1/1\nOcean's Hungry Grasp - 2/0\nBringer of Dreams and Nightmares - 1/1",
    "timestamp": 1761170400
  },
  {
    "username": "LDRwillow",
    "rating": 9.0,
    "comment": "Oct '25:\n\nI play with the Co-op Group. Guru owns a copy, so no need to buy.\n\n$70 on Amazon US (https://www.amazon.com/Greater-Than-Games-Spirit-Island/dp/B...)\n\nCo-op for multiple and Solo.\nBecause I own Pandemic Legacy, I think I should get this instead of Pandemic.",
    "timestamp": 1761170400
  },
  {
    "username": "LoveTrain",
    "rating": 8.5,
    "comment": "The rulebook could have a better structure and plays tend to last just a little longer than I would prefer. However, it can't be denied that the amount of strategic options and variability is intriguing. This one is a keeper for me.",
    "timestamp": 1761084000
  },
  {
    "username": "Jixashi",
    "rating": 9.2,
    "comment": "Played 5 times, this is exactly what a coop game should be. This game doesnt have the \"you should do that\" aspect of other coop games. In this game you cooperate together to overcome the invaders. Highly strategic, low luck factor, extreme replayability to find out combos of spirits, has a nice theme and beautiful components.\n\nThe game difficulty can be tuned to be welcoming for new players, and for those who are experienced as well. One of my favorites.",
    "timestamp": 1760911200
  },
  {
    "username": "DeadFrog",
    "rating": 9.0,
    "comment": "Bulletproof co-op game with massive variety and replay value",
    "timestamp": 1760911200
  },
  {
    "username": "couchlife",
    "rating": 9.0,
    "comment": "04/29/25 - A game that I need to get more plays in, but is unfortunately shelved in favor of the faster set-up and play time of Marvel Champions.\n\nStill, undoubtedly a near-perfect game. One that I can see myself diving deep into.\n\n05/30/25 - I'm just not a solo gamer.",
    "timestamp": 1760911200
  },
  {
    "username": "ceart99",
    "rating": 9.0,
    "comment": "Currently one of my favorites. A bit on the heavy side of things for me, but just slightly.",
    "timestamp": 1760824800
  },
  {
    "username": "AndrewRK",
    "rating": 9.0,
    "comment": "Very fun, more players can take a long time but each game is dynamic and the core mechanics are really enjoyable and feel very interactive. Probably my favourite board game as of now.\n\nOct 18, 2025",
    "timestamp": 1760824800
  },
  {
    "username": "Edydex",
    "rating": 9.0,
    "comment": "Very well made game. Best with just 2 players imo.",
    "timestamp": 1760738400
  },
  {
    "username": "Spase",
    "rating": 9.0,
    "comment": "Base",
    "timestamp": 1760565600
  },
  {
    "username": "DoctorPhil",
    "rating": 8.6,
    "comment": "Criteria (out of 5)\nRules complexity 2\nPlaytime/complexity ratio 4\nStrategic avenues 4\nMechanism strength 5\nThematic integration 5\nVariability 5\nReplayability 5\nFun factor 4\nElement of mastery 5\n\nOverall 8.6 out of 10",
    "timestamp": 1760565600
  },
  {
    "username": "alcofa",
    "rating": 9.0,
    "comment": "Best coop ever. Takes the place of Robinson Crusoe in my collection. I love every single aspect about this game. Fabulous coop e a total blast to play solo.\n\n+ Spirit Island: Branch & Claw\n+ Spirit Island: Jagged Earth\n+ Spirit Island: Feather & Flame\n+ Spirit Island: Nature Incarnate",
    "timestamp": 1760565600
  },
  {
    "username": "bkunes",
    "rating": 8.8,
    "comment": "Cooperative game where players take on the role of island spirits collaborating with natives to protect against colonization by leveraging spirit powers and those on cards through hand management.\n\n BK's Solo 10x10 in 2025 List\n BK's Solo 10x10 in 2024 List\n BK's Solo 10x10 in 2023 List\n\n{Solo win:loss::11:12}",
    "timestamp": 1760392800
  },
  {
    "username": "My_BoardGames",
    "rating": 8.5,
    "comment": "Spirit Island completely exceeded my expectations. What was supposed to be a game night turned into a game morning—our first play lasted nearly 8 hours including setup and rules, and yet we were fully engaged the entire time. The game is heavy and demanding, but the payoff is incredible: asymmetric spirits, deep cooperation, and a theme that flips the usual colonization narrative on its head. Every decision feels meaningful, and the tension escalates beautifully as the invaders spread.\nIt’s not for everyone—the learning curve is intense and playtime can be long—but for groups who enjoy strategic, thematic co-ops, this is a masterpiece. Easily deserving its place among the top games on BGG.",
    "timestamp": 1760306400
  },
  {
    "username": "uzeeyo",
    "rating": 9.0,
    "comment": "I'll be getting the expansions. Me and my gf really love it and there's great interaction to be had.",
    "timestamp": 1760306400
  },
  {
    "username": "badassbr",
    "rating": 9.0,
    "comment": "Top jogo coop! O designer do jogo está de parabéns, fazer todos os personagens serem tão assimétricos assim e o jogo rodar do jeito que roda, é de tirar o chapéu.",
    "timestamp": 1760306400
  },
  {
    "username": "igor_f",
    "rating": 8.5,
    "comment": "1-4",
    "timestamp": 1760220000
  },
  {
    "username": "Greckobgg",
    "rating": 9.4,
    "comment": "My favorite coop game. Hard, beautifull, fun",
    "timestamp": 1760133600
  },
  {
    "username": "Roberoops",
    "rating": 9.0,
    "comment": "+ Branch and Claw\n+ Jagged Earth\n+ Nature Incarnate\n+ Promo 1 + 2\n+ token upgrades",
    "timestamp": 1760133600
  },
  {
    "username": "K_oroviev",
    "rating": 9.0,
    "comment": "This is my second favorite board game. Everything from the theme to the mechanics, the challenge and even the art just works for me. I also love how the game can be tuned to your liking by mixing spirits, adversaries, scenarios and (\"official\") variants; I don't know any other boardgame that is this customizable.\n\nI'd say that anyone who is even a little interested in this game should try and see if it works for them. If it does, it will likely become one of their favorites.\n\nKeep in mind that the game is difficult and kind of fiddly, specially after you add tokens and events to the invaders/scenarios. Also, although the first games can be fun, it really opens up after several plays. After 100 plays, I think I'm just beginning to really understand and appreciate this game's design.",
    "timestamp": 1759960800
  },
  {
    "username": "jorissuurmeijer",
    "rating": 9.0,
    "comment": "Very fun game with a very interesting idea, good enjoyable theme, very nice art and a superb play style. Like asynchronous games and this game made me like coop a lot, which I before enjoyed less. Would recommend",
    "timestamp": 1759788000
  },
  {
    "username": "vensy",
    "rating": 9.0,
    "comment": "+ Инкарнация природы\n+ Ветви и когти\n+ Перо и пламя",
    "timestamp": 1759788000
  },
  {
    "username": "einfach_Klaas",
    "rating": 9.0,
    "comment": "It can make your head spin, but when the spirits' abilities interlock and the intruders are thrown into the waves, it's a real treat.",
    "timestamp": 1759701600
  },
  {
    "username": "ETHANVAN",
    "rating": 9.0,
    "comment": "Very great game. The level of asymmetry is great as you don't have to totally learn a new game in order to play a different spirit. Each spirit is designed very well.",
    "timestamp": 1759615200
  },
  {
    "username": "GorillaWithABrush",
    "rating": 10.0,
    "comment": "Hands down my favorite board game ever. So well designed and so much replayability. The rare game where the more you play it, the more you WANT to play it. It is so deep, and it really rewards the time you invest into it.",
    "timestamp": 1762470000
  },
  {
    "username": "Geor9eX",
    "rating": 9.5,
    "comment": "4.08 Cmplx/2nd",
    "timestamp": 1762383600
  },
  {
    "username": "mativale",
    "rating": 10.0,
    "comment": "4.08",
    "timestamp": 1762210800
  },
  {
    "username": "josh2550",
    "rating": 10.0,
    "comment": "Unbelievably rich game. Even if you've played a high volume of games already, picking up a new spirit (there are 68 of them including expansions) often feels like you're playing a new and different game. Tons of different adversaries and scenarios, and a great blend of tactical and strategic thinking. Can be a bit heavy for some groups, but difficulty level is highly adjustable, and overall it is the best cooperative game I've ever played, by quite some margin. Solo with a single spirit is just as great. After over 1000 plays I'm still always excited to get it to the table.",
    "timestamp": 1762124400
  },
  {
    "username": "junes19",
    "rating": 9.5,
    "comment": "몰려드는 침략자와의 점점 파괴되는 섬,\n이기기 위한 수를 찾기위한 멈추지 않는 브레인 버닝\n\n여러 정령들의 능력을 활용해 침략자들을 몰아낸다는\n아주 신박하면서도, 특별한 게임\n\n기본 8종의 정령들 만으로도 게임이 풍부하고\n시나리오와 적대국까지 난이도 조절이 가능해\n하루에 4판 넘게해도 질리지 않는다.\n\n\n단점으로는, 에러플을 할 가능성이 높다.\n카드 한장에도, 정령 능력에도 신경써서 봐야할 요소가 너무나도 많다.\n\n익숙해지기까지 시간이 꽤나 걸리지만,\n그럼에도 너무 재밌고 뛰어난 게임이다.\n\n그 필요한 복잡함이 주는 재미가 너무 좋다.",
    "timestamp": 1762124400
  },
  {
    "username": "Connduit",
    "rating": 9.5,
    "comment": "2-4",
    "timestamp": 1761951600
  },
  {
    "username": "rywoods",
    "rating": 10.0,
    "comment": "Incredible asymmetric & thematic design. Variable adversary whack-a-mole, but you can evolve and plan to conquer the overwhelming threats.",
    "timestamp": 1761778800
  },
  {
    "username": "Napattack",
    "rating": 9.5,
    "comment": "4.07\n1-4\nBest at 2\n120 (1,200)\n#25",
    "timestamp": 1761692400
  },
  {
    "username": "shafaegalo",
    "rating": 9.5,
    "comment": "I've been in the campaign game kinda mood lately and have been looking at playing all the scenarios as a campaign in increasing difficulty.",
    "timestamp": 1761606000
  },
  {
    "username": "Palmblatt",
    "rating": 10.0,
    "comment": "gekauft: Dez. 2024",
    "timestamp": 1761606000
  },
  {
    "username": "ulysses11",
    "rating": 10.0,
    "comment": "my favorite co-op game!",
    "timestamp": 1761519600
  },
  {
    "username": "Frank_Ly",
    "rating": 10.0,
    "comment": "Theres not a lot of heavy co-operative board games, and this game sets a gold standard.\n\nThe difficulty is also very modular and the variety of spirits is very welcome.\n\n10 - Perfect\n9 - Perfect, doesn't hit my personal favorites though\n8 - Pretty darn good, it's worth the average online retailer price\n7 - Perfectly fine, would recommend getting if it is on sale\n6 - It's fine, maybe get if there's a heavy sale\n5 - Boring, the game is functional though, wouldnt recommend buying or playing\n4 - It only technically functions as a game\n3 - It's horridness is hilarious. Don't even think of taking this game seriously\n2 - Unplayable, literally\n1 - Purely hypothetical, unimaginably bad",
    "timestamp": 1761429600
  },
  {
    "username": "diamondinblue",
    "rating": 9.8,
    "comment": "2024 Feb: 10\n2025 Oct: 9.75\nRevising my rating for consistency with my ratings of other games.",
    "timestamp": 1761343200
  },
  {
    "username": "hubathehut1",
    "rating": 10.0,
    "comment": "Amazing game!",
    "timestamp": 1761343200
  },
  {
    "username": "Mimi0605",
    "rating": 10.0,
    "comment": "❤️ ❤️ ❤️ ❤️",
    "timestamp": 1761343200
  },
  {
    "username": "Hooloovoo42",
    "rating": 10.0,
    "comment": "ST20 2025 #01\nST20 2024 #01\nST20 2023 #01\nST20 2022 #01\nST20 2021 #01\nST20 2020 #01\nST20 2019 #01\nST20 2018 #01",
    "timestamp": 1761256800
  },
  {
    "username": "Entropist",
    "rating": 10.0,
    "comment": "Incredible dynamic game",
    "timestamp": 1761170400
  },
  {
    "username": "SkyeHalon",
    "rating": 10.0,
    "comment": "Sleeve cards\nFix up Insert situation",
    "timestamp": 1761084000
  },
  {
    "username": "winsrp",
    "rating": 10.0,
    "comment": "You are a nature force fighting off the colonizers from catan! The game is so fun and repayable that you can spend a every week playing a match and after a year you still haven't tried half of it! It's a heavy game, it's a complex game, but once you get it it's a master piece!",
    "timestamp": 1760997600
  },
  {
    "username": "Tedkka",
    "rating": 10.0,
    "comment": "Amazing game. Have played it so many times and it never stops being interesting. There are so many variations and ways the game could go.",
    "timestamp": 1760997600
  },
  {
    "username": "Tillis",
    "rating": 10.0,
    "comment": "Regal 9",
    "timestamp": 1760997600
  },
  {
    "username": "RougeHemlock",
    "rating": 10.0,
    "comment": "Asymmetric Cooperative cooperative game of protecting an island and its inhabitants from colonization, with a modular difficulty level and a lot of variety. Easily tied for my favorite game. Setup isn't too bad but not great. The only real complaint I have is that it has a lot of sequencing that can be complicated for a lot of players. Can be played 1-6 players with expansions, which is a really good range too.I generally only break this out with more experienced board gamers.",
    "timestamp": 1760824800
  },
  {
    "username": "geekymlee",
    "rating": 10.0,
    "comment": "[??] 47x70 boardm sleeve\n> 43x67 popcorn black label sleeve\n[??] 65x90 boardm sleeve\n> 63.5x88 popcorn black label sleeve",
    "timestamp": 1760738400
  },
  {
    "username": "nontoxicRV",
    "rating": 10.0,
    "comment": "with all expansions - 11/10, personal all-time favorite game",
    "timestamp": 1760652000
  },
  {
    "username": "armandtdv",
    "rating": 9.5,
    "comment": "So much replayability, only minor issue are that some wins can feel slightly unsatisfying when you finish a move and you're like 'oh, wait, we won'...",
    "timestamp": 1760565600
  },
  {
    "username": "zilmuss",
    "rating": 10.0,
    "comment": "This is my currently my favourite game, my TOP 1.\n\nEach spirit is a different puzzle. When playing coop each set of spirits has their own synergies.\n\nThe game forces you to plan ahead and design good strategies. Sometimes the events counter your plan, and you need to adapt.\n\nThe rules are fast to teach, with a easy main loop.\nPretty well balanced and tested that given the huge number of asymetric spirits is unbelievable. It's a superb design.",
    "timestamp": 1760565600
  },
  {
    "username": "domind",
    "rating": 10.0,
    "comment": "My gateway drug",
    "timestamp": 1760306400
  },
  {
    "username": "bnordeng",
    "rating": 10.0,
    "comment": "A cooperative game that seems more involved. There is a neat theme of spirits protecting an island and keeping away the colonists. The natives of the island will help, though the ultimate goal is to protect the island itself. There are interesting, unique spirits that can be played in this game with really good depth for a coop.\n\nI did spend to get a copy of this excellent game and I'm very glad I did. It is understandable why it seems to be so well loved as a heavier coop game.\n\nAfter plays with 2, 3 and 4 players, it is very clear that 4 players is a bad number and the other two are good.",
    "timestamp": 1760306400
  },
  {
    "username": "Pete_Boteman",
    "rating": 10.0,
    "comment": "Ελλάδα\n\nThis is the crème de la crème of cooperative boardgames for us. Spirit Island hits all the notes: customization in scaling the challenge level, extraordinary variability and replay value, elegant component design and rules, and a vibrant support community including extensive on-line databases and wikis and FAQs. Plays superb as a solo, as well.",
    "timestamp": 1760220000
  },
  {
    "username": "awpTilla",
    "rating": 9.9,
    "comment": "Base game is great solo or together with new players. most of my logged plays are with expansion branch and claw + jagged earth though.\nBuy this if you want big content for small money (and if you like coop-strategy with cool buildups and combos).\nIt's also very thinky, not for people who prefer light stuff.\n\nRating with expansion and promo spirits.\nthis lasts for a looong time.",
    "timestamp": 1760133600
  },
  {
    "username": "Erzangel",
    "rating": 10.0,
    "comment": "the perfect board game, but hard to teach to non-gamers. replayability fascinates me & keeps me coming back to challenge myself & experiment different situations. always intellectually satisfying to play, as long as you have time for set-up. easier when you have a friend addicted to it as well! TTS & the app are great for solo play",
    "timestamp": 1759960800
  },
  {
    "username": "TempestBlade",
    "rating": 9.9,
    "comment": "⭐️2019",
    "timestamp": 1759874400
  },
  {
    "username": "UnboughtStuffedDog",
    "rating": 10.0,
    "comment": "A wonderful game that I will never tire of playing – and that's coming from someone with a clear preference for competitive games. After more than 40 games, I still feel like I can learn and try out so much every time. If I had to express one criticism, I would have to admit that victories often feel anticlimactic, but this minor drawback does not prevent me from calling Spirit Island an absolute board game masterpiece. Ask me anytime if I'm up for a game, and my answer will always be yes.",
    "timestamp": 1759701600
  },
  {
    "username": "Minic00p",
    "rating": 9.5,
    "comment": "Fun and complex co-op with a unique theme. I can’t say I recommend this with a 4 player count. Best at 1-3.",
    "timestamp": 1759701600
  },
  {
    "username": "SergShuv",
    "rating": 10.0,
    "comment": "Great game! I play mostly solo. Simple rules. Asymmetrical characters. Every game is a challenge! You can adjust the difficulty level. The game gets an 11. I'm taking off a point for the process being a bit too brain-teasing for my liking. I don't always dare play it; only when I'm well-rested. Otherwise, the design is impeccable!",
    "timestamp": 1759615200
  },
  {
    "username": "GrandPseudonym",
    "rating": 10.0,
    "comment": "Best Solo\nBest with 2\nGood with 3\n~120 Minutes\n~150 Minutes\nHeavyweight\nCo-op\nStrategy\nThematic\nCombat\nDrafting\nPuzzle\nCardplay\nArea Control",
    "timestamp": 1759528800
  },
  {
    "username": "revloc06",
    "rating": 9.5,
    "comment": "I love this game, always seems to be slightly different on how it plays out and the variable spirit powers are all fun to play with, also getting new different power cards each game, and it's cooperative.\n\nLove to play with new or experienced friends alike, really can't get enough!",
    "timestamp": 1759442400
  },
  {
    "username": "magic_erwt",
    "rating": 10.0,
    "comment": "Expansions\n● Branch & Claw\n● Jagged Earth\n● Feather & Flame\n● Horizons\n● Nature Incarnate",
    "timestamp": 1759442400
  }
]