[
  {
    "username": "Tramba",
    "rating": 1.0,
    "comment": "Absolute Katastrophe Monster die so groß sind wie das ganze Spielbrett App Steuerung war auch schlecht",
    "timestamp": 1761519600
  },
  {
    "username": "DommyyJayy",
    "rating": 1.0,
    "comment": "no replayability after 5 stories except for fan made options which sometimes dont work. For the price of this game i would prefer more ability to replay without it being repetitive. Super long set up time too. Was not gripping enough to make it to the table for about 6 years since i got it.",
    "timestamp": 1760997600
  },
  {
    "username": "Milkmanlamp",
    "rating": 1.0,
    "comment": "Played",
    "timestamp": 1712354400
  },
  {
    "username": "carbon_dragon",
    "rating": 1.0,
    "comment": "Too swingy, investigators get battered to death no matter what they do. The app can't go back if you click the wrong button. If you do you probably will end up having to just stop the game having wasted your time.",
    "timestamp": 1710198000
  },
  {
    "username": "IrwinMFletcher",
    "rating": 1.0,
    "comment": "I don't care what fans of this game say, for what they are asking you can buy 2-3 really good games that actually have some replay value. For me saying this has replay value is simply trying to justify that you spent 100 bucks to play a game 4 times. If you like it great, you can spend another 4-500 buying expansions with similarly abysmal replay value. Then when they stop supporting the app you have an expensive paperweight.",
    "timestamp": 1708383600
  },
  {
    "username": "Bnl88888",
    "rating": 1.0,
    "comment": "Worse than betrayal",
    "timestamp": 1705186800
  },
  {
    "username": "aalljj0",
    "rating": 1.0,
    "comment": "Suck die",
    "timestamp": 1693346400
  },
  {
    "username": "Gurtegutt",
    "rating": 1.0,
    "comment": "The fact that fantasy flight stopped suporting the mandatory app that goes with xcom the board game makes that game and the bought expansion useless.\n\nDont buy games that require apps to play from this publisher.",
    "timestamp": 1689890400
  },
  {
    "username": "kellogg",
    "rating": 1.0,
    "comment": "Can't even bring myself to comment right now.",
    "timestamp": 1680904800
  },
  {
    "username": "marcopac74",
    "rating": 1.0,
    "comment": "the app does everything, you might as well play a computer game at this point. there is so much to read on the screen, again, might as well open a book and read that. extremely boring game, don't like it one bit",
    "timestamp": 1672354800
  },
  {
    "username": "JakeDave",
    "rating": 1.0,
    "comment": "Got for ~$50 Barnes & Noble day after Xmas sale (1/2 off)",
    "timestamp": 1672354800
  },
  {
    "username": "FutureSpec",
    "rating": 1.0,
    "comment": "mobile app BS",
    "timestamp": 1671404400
  },
  {
    "username": "Ilythia",
    "rating": 1.0,
    "comment": "So much potential, so little fun. Most adventures suffer from an imbalance of fighting/searching, but the by far most frustrating aspect is the lack of actual sense of progression paired with flat-out bad game design, inconsistent writing and glaring balancing issues for less than 4 players. I really wanted to like it, but my friends refuse to ever touch it again (for good reasons).",
    "timestamp": 1668985200
  },
  {
    "username": "Cone Defense",
    "rating": 1.0,
    "comment": "The assembly and quality of the miniatures overwhelms anything the game brings to the table. MoM being ranked in the top 50 is bad for the hobby, because if anybody buys it, unaware of what they're getting into on that front, they'll be turned off of the hobby.\n\nThat said, I thoroughly enjoy the game and the explorative storytelling. I’d happily play it but don’t like the components at all.",
    "timestamp": 1666562400
  },
  {
    "username": "Germflinger",
    "rating": 1.0,
    "comment": "First I will say that except for the wonky bases for the miniatures the production quality is good. The tiles are heavy and the artwork is excellent and the theme is a good fit for those who like the Eldritch Horror universe. However, this is were the fun stops for me. I honestly think this game is horrible. The mix of the app and the tabletop simply does not work well and should be one or the other but not both. Why do you even need a tabletop setup when everything could be done far more efficiently within an app? The components are numerous and almost of all of them are fiddly and time consuming, particularly the tiles. The small damage and equipment cards are practically illegible with very small print and grey writing over a grey background. The amount of randomness regarding dice rolling actions is ridiculous, frustrating, and unrealistic. For example, doing an attack action when firing a gun could require you to use any one of your character stats...really? Why would I make an influence roll to shoot a gun? The way the actions are rolled out make the character stats arbitrary. My last gripe is that the game is an over-textual railroad where players don't have much actual decision making and it takes forever to get through it. The next time this one comes up I think I will pass, sorry folks.",
    "timestamp": 1659650400
  },
  {
    "username": "PermaFrost88",
    "rating": 1.0,
    "comment": "This is a thematic co-op game where you, a bunch of heroes, are going through this miserable experience where everything is trying to kill you all.\n\nThe AI controlled by an iPad stacks the odds against the group, and we try to defeat the big evil.\n\nQuarterbacking is definitely an issue with this game.\nAt random times you are required to solve simple puzzles that have nothing to do with the game. Do you enjoy solving mastermind in the middle of a campaign? I sure am not one of them.\n\nOn the mythos phase? Roll to see if you get hit hard, or harder! The game does not feel good as you progress, just more and more frustrating.",
    "timestamp": 1646694000
  },
  {
    "username": "Mangelk",
    "rating": 1.0,
    "comment": "Garbage, boring, slow coop. With some lame 'narrative' which I couldn't give two f**KS about. Movement is tedious. Gameplay is dull.\nWaste of time. Really wanted to rate it 0 stars.",
    "timestamp": 1637190000
  },
  {
    "username": "vinayplusj",
    "rating": 1.0,
    "comment": "A game that believes that thematic means having lots of custom components and flavour text.\n\nThe thematic part comes solely from the flavor text and the pictures.\n\nSo, even with the app, this edition's box is bigger. Component creep is strong to mask a boring, slow, annoying game.",
    "timestamp": 1633557600
  },
  {
    "username": "Usmanov",
    "rating": 1.0,
    "comment": "This made me sick, wished I could take these 10-15 or so hours back. Plays slow. Confusing goal. Annoying story (it's like a fake role playing game – nothing you really interact with, just alot of reading)\nThe app is a blunt tool, even if from what I understand is an upgrade from the 1st edition gameplay.\nThe focus on the app really excludes the other players, there are alot of focus problems as you can do nothing while another player is doing his bit on the app.\nWinning or loosing really does not feel like any kind of reward or letdown. I found it impossible to invest myself in the story or game.\n\nAnd hey – I didn't even get into budget. It's very costly base game only includes four scenarios, the rest you have to buy. And likely also a tablet with larger display.",
    "timestamp": 1630274400
  },
  {
    "username": "GaiaHero",
    "rating": 1.0,
    "comment": "You need an app to play it sorry thats not a board game aka you failed, either make a video game or make a board game not this awful trend its bad enough when folk wont put their phones away when we play, I dont want any excuse for an ipad to be on the table. Trash.",
    "timestamp": 1623967200
  },
  {
    "username": "Michalq",
    "rating": 1.0,
    "comment": "It is not a boardgame supported by application. It is application supported with cardboard&plastic. Honestly - whole gameplay should be done in APP.",
    "timestamp": 1609196400
  },
  {
    "username": "ogunil",
    "rating": 1.0,
    "comment": "in the time of playing story driven game,you just kicked off by drunk driven car",
    "timestamp": 1602799200
  },
  {
    "username": "goblinking2020",
    "rating": 1.0,
    "comment": "I hate this game with a passion. Huge fan of Betrayal series, but this is a massive disappointment. Ended up giving it away just to get rid of it. Felt too guilty to resell it.",
    "timestamp": 1589925600
  },
  {
    "username": "SrFinn",
    "rating": 1.0,
    "comment": "Not a game.\nIt's a puzzle\nThe worst experience I ever had on the table: extremely long, uninteresting at every moment, futile attempts to be scary (how can it be if you are not interested?) and evident waste of good components",
    "timestamp": 1574895600
  },
  {
    "username": "mdean",
    "rating": 1.0,
    "comment": "Pretty long and has downtime issues. App is great but the puzzles are a little silly.",
    "timestamp": 1561240800
  },
  {
    "username": "Shooock",
    "rating": 1.0,
    "comment": "Needless to buy the expansions since the tiles will never be 100% exploited in the DLC ... I will change the vote when a DLC will be based on the tiles of the expansions.\n\nSo much money thrown away",
    "timestamp": 1535925600
  },
  {
    "username": "Luke the Flaming",
    "rating": 1.0,
    "comment": "\"app-driven board game\"... it's ironic, at least.",
    "timestamp": 1525384800
  },
  {
    "username": "Slapshot12",
    "rating": 1.0,
    "comment": "not a boardgame.",
    "timestamp": 1516057200
  },
  {
    "username": "mqstout",
    "rating": 1.0,
    "comment": "Not a board game. (See: \"mandatory app\".)",
    "timestamp": 1503352800
  },
  {
    "username": "metelo",
    "rating": 1.0,
    "comment": "I just do not like games that have Apps to play alomg Obsolescence is a big issue here.",
    "timestamp": 1497909600
  },
  {
    "username": "Kajo",
    "rating": 1.0,
    "comment": "Nice atmospheric game.\nOnly played solo vs the app and it's very good until now.\nThe app does a good job as the keeper, so you don't need one in your games (but i recommend assigning a person to interact with the app) Vote: 8\n\nEdit: During a game, the app bugged out not letting interaction with it anymore, then crashed.\nUpon reentering the game, i found it overwrote the save and you can't even load from a previous point.\nNope nope nope.\nWon't play again until it's addressed and patched",
    "timestamp": 1484694000
  },
  {
    "username": "Tjazz",
    "rating": 1.0,
    "comment": "Half a mobile game with some board game components, does not make a board game. It's so sad that this ugly Frankenstein monster of a game design, is what replaced the somewhat flawed but otherwise great 1st edition.",
    "timestamp": 1483052400
  },
  {
    "username": "Sheltem",
    "rating": 1.0,
    "comment": "Needs an app",
    "timestamp": 1482534000
  },
  {
    "username": "Werbaer",
    "rating": 1.0,
    "comment": "not playable out of the box.\n*requires* an app",
    "timestamp": 1481151600
  },
  {
    "username": "thesleeper7",
    "rating": 1.0,
    "comment": "First of all I am not against apps in board games. I loved the way Alchemists used the app, and looking forward on how\nFirst Martians: Adventures on the Red Planet and Rising 5 will use it.\n\nHowever, the problem with MoM's design, is that there is no real need for a physical component. The app could have handled the character movement, the rolls, the conditions.\n\nIt feels odd and fiddly to select the monster that I want to attack on the app, choose how I attack it on the app, roll the physical dice, and input the result on the app? Why? Physically rolling the dice, and physically moving the plastic dolls around the map dose nothing for the gameplay, on the contrary it just creates disconnection, as you keep switching context.\n\nAnyway, if you are running a Cthulhu RPG, than yes, the package is worth the money: you get some nice tiles and some nice plastic dolls, and as a bonus you get a decent board game, however if you are a board gamer, why on earth would you spend 100$ on a glorified app?\n\nIn the end there are some things that video games(and maybe rpgs) will always do better(theme, immersion), while board are better when it comes to creating interesting situations with tough choices. I think designers should understand that, and play to the boardgame's strength, rather than trying to do everything.",
    "timestamp": 1470520800
  },
  {
    "username": "Killi",
    "rating": 2.0,
    "comment": "Played once, and I most definitely won't ever play again.",
    "timestamp": 1756504800
  },
  {
    "username": "Gurkvatten",
    "rating": 2.0,
    "comment": "Played with people who had enjoyed it on previous playthroughs, we all had a dreadful time. In about three hours I rolled dice with poor results and never made any interesting decisions. Solved one pretty crappy puzzle.",
    "timestamp": 1754776800
  },
  {
    "username": "thptr",
    "rating": 2.0,
    "comment": "1st play amazing, 10th play terrible.\n.\nI played my friend copy.\nGameplay is boring, puzzles are boring, writings are boring.\nThe game doesnt feel thematic or create interesting story. Due to mediocre writing, not scary, not creepy, not wholesome, nothing interesting. They feel like pasted on stories.\nI dont find my decisions matter much.\nJust walking, takes random interaction and let rng decides.\nI couldnt play for the stategy nor for the stories.\nTons of better mechanics-light story driven games out there.",
    "timestamp": 1749420000
  },
  {
    "username": "bazyliszek10000",
    "rating": 2.0,
    "comment": "The game builds the climate very well, you feel the tension that increases with each round, when playing in our group we agree on different things, but the impression of one leader who manages all is not created. As for the pleasure of the game and the atmosphere, this is the top of this type of games, one of my favorites is not the best. Disadvantages are scenarios, most of them are too long and there are several, the repetition is large and you can play a maximum of 2-3 times. I can't imagine repeating scenarios that lasts over 3 hours. In a repeated scenario, everything is always the same, the same creation behind the door, the same layout of the rooms. The game is supported by an application that on the one hand cool simplifies all management and spreading, but it is wasted potential. The application should diversify the layout of the rooms, though through mirror reflection, draw creatures from the same level, but each time different, at least two in turns. On the one hand, this game is very cool, and on the other it is very one-time and profit-oriented, it is a \"cash jump\". The creators tried very hard to make the most of it. To sum up, in my opinion, the game is not worth the price, because the contents of the box are so small that there is nothing to play.\n\n[27.01.2020]\nAfter more than a year's break, I tried to repeat the scenarios and I can't play it, the number of actions this game performs in relation to the actions that players perform is too high. This game plays more than players. If I had to rate it now I would give 4 or lower. When I play this game for the second time, I don't feel the climate anymore, the game is going on, I have also played new scenarios, but they were not interesting, I do not know if this is not due to aversion to this game.\n\n[27.11.2024]\nThe distribution method of this game deserves a rating of 1. The cost of one scenario is $25, and I don't like half of the scenarios. This comes down to $50 for a good scenario. Even after more than 5 years (looking at the prices of current games), the cost of this game is definitely too high in relation to the content. Unnecessary figures that don't stick to the bases, the cardboard blocks that come with the game would be enough. The figures are so uncomfortable that I never take them out anyway.",
    "timestamp": 1741906800
  },
  {
    "username": "adamsinger109",
    "rating": 2.0,
    "comment": "I've played this so many times with an open mind to like the game and every time was a boring slog of randomly interacting with POIs and hoping its the right thing to progress",
    "timestamp": 1713823200
  },
  {
    "username": "Arnaud3013",
    "rating": 2.0,
    "comment": "No enought scenarios, app didn't help a lot. No surprise inside game, too much luck dependant.",
    "timestamp": 1699743600
  },
  {
    "username": "Shmarshmello",
    "rating": 2.0,
    "comment": "Played three missions, the tutorial was the most fun my group had. One mission was broken: we played a three hour game where there was no action at all, just roll and do sanity checks till the end. We were slowly turning insane which felt meeningless as there is very little we can do about it. We had more items then we knew what to do with and they all felt useless as there were no enemies to fight. Eventually the very end of the game had a large quantity of enemies spawn but it was pointless as we rushed the insanity made us loose. There was no satisfaction, just a slow game where we had little agency on solving problems. Quarterbacking was a huge problem because the movements and actions are pretty obvious. Exploring the mansions is pretty cool tho.",
    "timestamp": 1697493600
  },
  {
    "username": "AnlAir",
    "rating": 2.0,
    "comment": "I don’t feel the theme of this game at all. In my opinion very shallow but this is only my opiniom.",
    "timestamp": 1684188000
  },
  {
    "username": "Airkixer",
    "rating": 2.0,
    "comment": "Expensive and tedious. 4 scenarios come with the base game, most of which require meta knowledge for you to really understand what to do intially. Unfortunately, none of which are enjoyable enough to play through more than once.",
    "timestamp": 1679954400
  },
  {
    "username": "arthurcucumber",
    "rating": 2.0,
    "comment": "A lazy Cuthulu theme slapped onto a bland co-op game.\n\nIt takes far too long which only highlights the game's flaws. Which include randomness, dice chucking, zero meaningful decisions and the use of a buggy app. If I wanted to waste three hours of my life reading such turgid prose I would seek out some Twilight fan-fiction websites.\n\nI have yet to find the appeal in these Cuthulu games as most of them have been shocking.\n\n Components\n Artwork\n Mechanics\n Rules\n Replay Value\n Player Downtime\n Meaningful Decisions\n Total",
    "timestamp": 1677279600
  },
  {
    "username": "realityfoible",
    "rating": 2.0,
    "comment": "This game is absolutely not my jam.\nAfter 4 plays I have yet to encounter a narrative. puzzle, or decision that felt meaningful or engaging. What's more, by making the phone App central to interacting with anything and everything, Fantasy Flight have created an artificial bottleneck where players have to sit around and wait for each other player to resolve their uninspired mini-games or generic dialogue trees.\n\nDon't get me wrong, this is a very polished game with lofty ambitions. I applaud the hustle to build a board game with interactive stories and an expandable world...\nBut at the end of the day if a game focused on storytelling, puzzles, and combat consistently tells boring trope heavy stories, features banal uninspired puzzles, and uncontrollably random combat... then it is simply not a good game despite the novelty.\n\nFantasy Flight have shown us just how far we still need to go as designers and writers.",
    "timestamp": 1667257200
  },
  {
    "username": "Carnage50008",
    "rating": 2.0,
    "comment": "Just hohum..... Wanted to love this one so much. Theme it serves up unquestionably. The theme is just oh so yummy and thick. Regretfully gameplay becomes monotone after a few turns. The characters who you start off loving and feeling unique and interesting quickly lose all appeal to the game mechanics. Definitely worth one play through but loses it's shininess very quickly. Miniatures are cute but not necessary at all, and honestly I prefer to play with just the inserts. So much easier to deal with. App is \"nice\" but should have been much more audio. Most of the diminishing love could have been mitigated with a much more narrated app. Also would have been nice to be able to track characters on the app.",
    "timestamp": 1658181600
  },
  {
    "username": "dderidex",
    "rating": 2.0,
    "comment": "Impressions on first play - overall, it felt a bit like a needless complicated 'Betrayal at House on the Hill', without doing enough to address the popular criticism of that game (that you don't really know how to prep for the haunt phase during the exploration phase). Also, the app is AWFUL. Who decided that mini-games made sense to add to a board game? Really, really, just...AWFUL experience from the app, it adds nothing and detracts a LOT.",
    "timestamp": 1646002800
  },
  {
    "username": "xvatat",
    "rating": 2.0,
    "comment": "I have as much fun exploring the free app as I do with the 100$+ game on the table",
    "timestamp": 1645743600
  },
  {
    "username": "Peyote42",
    "rating": 2.0,
    "comment": "Too expensive compared to components quantity, considering app and miniature quality, the box is way bigger than what it might be.\nThis game is a no brainers, not fun to play, mythos stage is very annoying, its mechanics must me improved.",
    "timestamp": 1641682800
  },
  {
    "username": "tursel",
    "rating": 2.0,
    "comment": "Uninteresting choose-your-own-adventure with no meaningful decisions and zero strategy.",
    "timestamp": 1636671600
  },
  {
    "username": "corruptedcraft",
    "rating": 2.0,
    "comment": "The most boring game I have ever played. It was pulling teeth to get through 2 scenarios. I LOVE Arkham Horror and Cthulhu: Death May Die, but this was just dreadful to play.\n\nNothing exciting ever happened, not a single interesting decision was made, no major crux, no major difficulties with monsters (and even then only human type enemies were called), no climax, just all of the sudden you win or lose. Pacing was so slow I had to start painting miniatures during our game to keep from leaving the table.",
    "timestamp": 1631829600
  },
  {
    "username": "TheLimestoneCowboy",
    "rating": 2.0,
    "comment": "*T Cosmic",
    "timestamp": 1628200800
  },
  {
    "username": "lytbof",
    "rating": 2.0,
    "comment": "数据模型还有点意思，但试玩过了两个剧本后，我认为其剧本在逻辑性，节奏，情节，游戏性等方面都一塌糊涂。",
    "timestamp": 1618178400
  },
  {
    "username": "B3rthold",
    "rating": 1.5,
    "comment": "+ App als Dungeonmaster\n- man ist nicht mehr als Zuschauer\n- viel nerviges Tippen und Lesen\n- kaum Mehwert gegenüber einem Buch",
    "timestamp": 1617746400
  },
  {
    "username": "Hoestaake",
    "rating": 2.0,
    "comment": "God, this game me extremely overrated. No scalability, no real control over what's happening. Eventually, the game will punish you just because of laziness in game developement: the story Is not really integrated with what's happening on the board, so you end up suffering damages from \"cold breeze\" or the like (poor Lovevraft), even when you manage to strike down all enemies. Taking two actions in a turn Is ridicolous, especially when enemies are spawning everywhere. You investigate, or you fight. Since you have to wait 10 minutes downtime each turn for the AI to take its actions, which you basically suffer with no escape, the story Is complete background, you forget about It in a matter of few turns. There Is no progression for your character, no way to mitigate the suffering. The result: even when you win, you feel extremely lucky, rather than skilled, being unable to recognize which was the improvement, the moves that led your team to success. Let's be honest, there Is a funny idea behind this game. But this idea will take your money and your space more than It deserves. The best experience you can obtain Is a bitter smile for having wasted a couple of hours descending a downward spiral of hawkward, random events.",
    "timestamp": 1615676400
  },
  {
    "username": "Yoshmeister",
    "rating": 2.0,
    "comment": "Exhausting to play through repetitive phases, lots of pointless dice rolling, poor storytelling with nothing really to discover. Puzzles are childish and poorly connected to the game. The app is okay, but kinda makes the entire game material obsolete (except for the dice).",
    "timestamp": 1614985200
  },
  {
    "username": "Murdoch7",
    "rating": 2.0,
    "comment": "No idea what’s the appeal of this game.",
    "timestamp": 1612738800
  },
  {
    "username": "janolx",
    "rating": 2.0,
    "comment": "How did this game get so much praise? After 4 plays (two player) my conclusion is that the luck is 80% of this game which makes it a waste of my time. So selling it to someone that enjoys playing the same scenarios over and over waiting for the lucky rolls to kick in. Probably the game would be fixed if the dice had 4 successes instead of just 3. This was not fun.",
    "timestamp": 1611961200
  },
  {
    "username": "The Game Piece",
    "rating": 2.0,
    "comment": "This game is far from a $100 Board Game Experience. Another user said it best, \"This is a point-and-click adventure game.\"\n\nThe physical components are largely unnecessary, and could probably be replaced by their own player apps.\n\nAside from this being an app game with a board game element, the base gameplay doesn't offer many options during your turn. You're either going to search the available items or you're going to fight enemies if they are available.",
    "timestamp": 1603231200
  },
  {
    "username": "Whoolee",
    "rating": 2.0,
    "comment": "My score is based on SOLO play.\nRubbish for solo play, awesome for 3+.\nIn solo mode the game plays itself and you can play most of it just on the app, infact you could leave most of the components in the box and just have the tiles and standees.",
    "timestamp": 1598220000
  },
  {
    "username": "Mordliss",
    "rating": 2.0,
    "comment": "Unfortunate this game had high hopes coming to the table, and just absolutely disappointing everyone sitting around it. The game promised story, and monster fighting in a Lovecraftian world, it delivered both, but they were both awful. The story is abysmal and the flavor text begins to repeat long before the first mission is over, and the combat is basic. The App play actually serves to bog down the game speed significantly in this.",
    "timestamp": 1597701600
  },
  {
    "username": "AngusBull",
    "rating": 2.0,
    "comment": "Unfortunate what FFG has done to their big box games with this release. Hope this isn’t the harbinger of doom for everything I like about their other titles - namely lots of content and replayability right out of the box. Expansions and DLC are great if the core game stands up. Unfortunately this one players in comparison to all the predecessors. Might keep this if I run across a copy of 1st edition to supplement it with. Otherwise it’s on the trade list.",
    "timestamp": 1592085600
  },
  {
    "username": "RicPain",
    "rating": 2.0,
    "comment": "An awful, broken game. The events triggered by the app didn't seem to fit the scenarios, then after hours of playing, the finale of each scenario was a major letdown. I would strongly recommend people against playing this.",
    "timestamp": 1588543200
  },
  {
    "username": "dead_eye_dodo",
    "rating": 2.0,
    "comment": "Maybe I was overhyped by the idea of a coop Lovecraft Descent-like game. Or *maybe* its simply bad game desing that you:\n- are forced to explore and try stuff out, but get punished for every move you waste while doing so\n- need to know a level's every twist beforehand if you want to win it\n- spoil some stories if you read the original Lovecraft short\n- waste at least 4 turns to solve a mini-puzzle or alternatively have to waste them in order to bring the one team member over from the other side of the board who can solve the puzzle in 2\n- feel like you could flip a coin instead of making your various skill tests because they appear completely random in both exploration AND combat and can never be planned out for the right character\n- are forced to endure micro roleplay-like elements with absolutely no consequences that leave you even more in the dark then before and can't be played out beyond the first pseudo choice\n\nI understand this game's BGG rating almost as little as Pandemic Legacy. Bad games.",
    "timestamp": 1587506400
  },
  {
    "username": "cafin8d",
    "rating": 2.0,
    "comment": "In what seems to be a trend for Nikki Valens products, there is no game here. A computer tells a story to you and you push little bits around when it tells you. No player decisions, mechanically uninteresting, little to no replayability.",
    "timestamp": 1586210400
  },
  {
    "username": "ccarletti10",
    "rating": 2.0,
    "comment": "Like new. Only played once.",
    "timestamp": 1580598000
  },
  {
    "username": "martifer83",
    "rating": 2.0,
    "comment": "nunca mais!",
    "timestamp": 1571090400
  },
  {
    "username": "Fewzz",
    "rating": 2.0,
    "comment": "Terrible for one player, great for more than one, my rating is based on Solo play.",
    "timestamp": 1563314400
  },
  {
    "username": "Creso",
    "rating": 2.3,
    "comment": "list 0",
    "timestamp": 1547852400
  },
  {
    "username": "Shinako",
    "rating": 3.0,
    "comment": "Long and drawn out without very few meaningful decisions. You have a few decisions on where to explore at the start, but the rest of pretty much plays itself. The next decision is obvious and the app just tells you when to roll dice and draw cards. The app puzzles are interesting, but it's so little content compared to the rest of the time spend playing.\n\nAlso, why is this even a board game? The entire thing could easily be entirely done in an app, the only reason this has physical components is to give the game a physical presence, as it's entirely unplayable without the app.\n\nIf I'm going to play something that takes 2-3 hours, I want to play something that's actually interesting and isn't designed to be a background activity at a party.",
    "timestamp": 1761951600
  },
  {
    "username": "Aaron_Dangerman",
    "rating": 3.0,
    "comment": "Its a shame that so much production value went into a game that likes to punish the players so much.",
    "timestamp": 1757887200
  },
  {
    "username": "Arnar146",
    "rating": 3.0,
    "comment": "Selja",
    "timestamp": 1754431200
  },
  {
    "username": "PotatoKing_",
    "rating": 3.0,
    "comment": "성장하지 않는 캐릭터 + 너무 긴 시나리오 = 지루함",
    "timestamp": 1750629600
  },
  {
    "username": "au4au4g4",
    "rating": 3.4,
    "comment": "1200/3230",
    "timestamp": 1740870000
  },
  {
    "username": "Javi_budoka",
    "rating": 3.0,
    "comment": "Pese a disfrutar de la temática, tiene una mecánicas muy malas, lentas y farragosas, la narrativa se diluye por la mecánica. Existiendo AH 3ª Edición y LCG no comprendo cómo se sigue jugando.",
    "timestamp": 1736550000
  },
  {
    "username": "tristandevanthery",
    "rating": 3.0,
    "comment": "Nul.",
    "timestamp": 1736463600
  },
  {
    "username": "Alnav1",
    "rating": 3.0,
    "comment": "Se dice que es un juego inmersivo. No nos lo pareció. Nos resultó imposible creernos nada de lo que el juego propone. La app no ayuda, pero no cree que la experiencia mejorase sin ella. Una decepción",
    "timestamp": 1731452400
  },
  {
    "username": "Mack1993",
    "rating": 3.0,
    "comment": "The most frustrating part of this game is that it offers so many items that sound fun to interact with and use but you are punished for actually doing that as the game is on a timer that you frankly don’t have the time to explore.",
    "timestamp": 1720821600
  },
  {
    "username": "R_J_",
    "rating": 3.0,
    "comment": "Just didn’t work for me, I don’t think this has aged well as a dungeon crawler, there are many better games now.\nI found the puzzles and combat really boring. The rules were overly complicated to allow for more of a sandbox in certain scenarios, but many didn’t even come up in my plays of the game.\nI feel done with it and would avoid playing again.",
    "timestamp": 1720216800
  },
  {
    "username": "Ctrlalt",
    "rating": 2.5,
    "comment": "A game I strongly dislike and will try to avoid as much as possible.",
    "timestamp": 1719093600
  },
  {
    "username": "giallonut",
    "rating": 3.0,
    "comment": "I still have no idea why this wasn't just an app.",
    "timestamp": 1717279200
  },
  {
    "username": "LongRonSilver",
    "rating": 3.0,
    "comment": "In the beginning I really liked the game because it feels like a mixture of dungeon crawler and point & click adventure, plus it can offer real map exploration and branching within the adventures. With each game (and there were many), however, I lost interest more and more to the point that I simply no longer wanted to play the game at all - which is quite tragic for me, as it is one of the few titles in the genre that my wife enjoys playing.\n\nDespite fresh and appealing ideas from the expansions (especially Horrific Journeys), the adventures and plays feel very and too similar, the decision spaces are almost non-existent and relatively obvious, especially after several games.",
    "timestamp": 1712095200
  },
  {
    "username": "Gvvynbleidd",
    "rating": 3.0,
    "comment": "Highly disappointing. Expected it to be great based on reviews and my adoration for the Cthulu universe, but it's just an utterly frustrating and broken game.\n\nThis game suffers from a total lack of agency over your choices, and it's too random and tedious. The players have no meaningful decisions or any impact on what's happening. Just randomly running around, checking every question mark, hoping you find the right pieces before the timer runs out or you turn dead/insane by monsters or random unfair events that are impossible to avoid or deal with. It's not fun or challenging, it's just frustrating.\n\nAlso, the setup takes too much time, and revealing each room separately interrupts the game flow quite heavily.\n\nOh, and the miniatures are really bad quality considering the price of this game.\n\nI really cannot fathom why people like this game...",
    "timestamp": 1706569200
  },
  {
    "username": "SaltMachine",
    "rating": 2.5,
    "comment": "I did not enjoy playing Mansions of Madness so I'm going to start off with what I did like. I like the mansion rooms discovery mechanic. I liked the art. The miniatures are fine, though I very much dislike how sloppy the box is. There are plenty of minis and they are just thrown into a ziplock bag. From a roleplay perspective, I find having stats for each character is cool as, in practice, this would mean different characters would be better suited for different scenarios; however, stat checks are driven through sheer luck through dice rolls so the majority of the time if you have a bad roll, having 5 lore can be as useful as having 3 or less.\n\nNow, as you can see, I can't even finish talking about the good parts without having something negative to say too. Mansions of Madness is driven through an application you play on a tablet or similar device. This wouldn't be a problem if the gameplay wasn't a luck driven slog with little puzzles that have absolutely NOTHING to do with Lovecrafts Mythos. The descriptions of events and monster encounters are written the same way, all the time. The Mythos phase is terrible and completely disconnected from what's going on on the board, with stupid nonsensical horror checks. You make an app that doesn't keep tabs of where the characters are, their current conditions and what is surrounding them? Amateurish, to say the least.\n\nIf you decide to fully explore the mansion, you'll be bombarded by cultists and monsters which you need to spend you Investigator phase defeating, lest you're overwhelmed by their sheer numbers, all the while failing rolls for search or interact, which just drags the game on.\n\nThe worst part? The lore and clues you learn are meaningless. Imagine that. Stop the ritual by playing a game of mastermind after 3+ hours of trying to move through the mansion. Just terrible.",
    "timestamp": 1704582000
  },
  {
    "username": "CianciulliQc",
    "rating": 3.0,
    "comment": "Nop\n\nApp Driven\n\nNever Again\n\nSold",
    "timestamp": 1702422000
  },
  {
    "username": "DecaDice",
    "rating": 2.5,
    "comment": "I have played this game more than the \"Plays\" show. Before I had the BG Stats app I played this game a lot more. I like cooperative games and I like that aspect about this but I absolutely hate that when people go insane, they have separate win conditions that wastes the 2+ hours spent together, trying to win.",
    "timestamp": 1698012000
  },
  {
    "username": "flapJ4cks",
    "rating": 3.0,
    "comment": "Like New; played 2 times.",
    "timestamp": 1696716000
  },
  {
    "username": "CardboardStarship",
    "rating": 3.0,
    "comment": "A slog full of randomness. Eldritch Horror and Arkham Horror the Card Game are some of my favorite games of all time. This game does not stand next to those two titles in my opinion. You can never actively plan because the app chooses random ability stats for you to test when attacking/evading/searching etc. There's a ton of downtime. The puzzles are tedious and take everyone out of the experience.\n\nThe first mission is way too long for an opening, but does well at introducing mechanics. We played at 5 players and I would not recommend it. People will be actively bored.\n\nThe only saving grace is that the story was engaging. Maybe this is better at lower player counts? But I have no interest in returning, especially when AH:LCG and Eldritch Horror exist.",
    "timestamp": 1696284000
  },
  {
    "username": "legolasegb",
    "rating": 3.0,
    "comment": "No. Throwing dice to determine success over and over again. Really lame. And without having played the scenario before, I don't know how we could have been expected to find Craven. So, not only did we have to roll well to beat the game clock, but we had to luck out with our guesses to complete the mission.\n\nKind of hilarious at times with the guys I played with, but otherwise, the game itself doesn't stand up very well, at least to a Euro gamer.",
    "timestamp": 1693692000
  },
  {
    "username": "kaepone",
    "rating": 3.0,
    "comment": "I thought this was going to be similar to LotR: Journeys in Middle Earth, which I wasn't a fan of, due to the similarities of the app driven missions and actions like movement, exploration and of course, all the skill checks. It was much worse.\nIn the first mission, due to early face up damage, we were both stuck being unable to effectivley evade, or do any reliable or meaningful combat damage. It was a slog full of horror checks and skill checks and more skill checks. I'm just glad I passed the skill check when the lights went out and my character realized they forgot to open their eyes after blinking. No joke.\nWould never play this again.",
    "timestamp": 1690408800
  },
  {
    "username": "OnlyHeStandsThere",
    "rating": 3.0,
    "comment": "Super unimpressed",
    "timestamp": 1687125600
  },
  {
    "username": "JustAModestMan",
    "rating": 3.0,
    "comment": "With great story elements on top of a popular theme, Mansions of Madness seems very promising...until you're forced to play some old school phone games for far too long.",
    "timestamp": 1686780000
  },
  {
    "username": "King_Diamond",
    "rating": 3.0,
    "comment": "Too simplistic for a boardgame. Roll dice and apply modifiers ad nauseam. Very anemic gameplay mechanisms and 'combat'. The basic game design doesn't allow much player agency and is essentially a dice chucker with skill checks. Furthermore, fuck those inane non-thematic app puzzles.",
    "timestamp": 1684101600
  },
  {
    "username": "doosapil",
    "rating": 3.0,
    "comment": "boring",
    "timestamp": 1679180400
  },
  {
    "username": "Etward",
    "rating": 3.0,
    "comment": "Hard to rate this one, but I really do not ever want to play this game again. Initially, I would've rated this game an 8, but I've cooled so much on it. It gives you all these different scenarios, characters, tiles, and miniatures, but variety is kind of a facade. After about 5 plays, I realized all we were doing the same thing every game. By my 7th play it was so tedious to continue playing, we all decided to stop. Also, theres not enough ways to mitigate bad luck imo.",
    "timestamp": 1676329200
  },
  {
    "username": "BestBunza",
    "rating": 3.0,
    "comment": "Not fun.",
    "timestamp": 1671490800
  },
  {
    "username": "Smokababylon",
    "rating": 3.0,
    "comment": "Horrible par rapport à l'ancienne version. Retours innombrables a l'App mal fichue. C'est mou, on perd en immersion. Vraiment dommage de gâcher ce jeu qui avait précédemment pour gros défaut d'avoir une installation très longue. Je l'échange, pour les intéressés, état nickel, sorti qu'une fois",
    "timestamp": 1669503600
  },
  {
    "username": "crow13",
    "rating": 3.0,
    "comment": "Such potential wasted due to lazy scenarios and a greedy company that wants to move on to another game without putting the time into this game that it deserves. Scenarios that just waste actions until the Mythos effects damage you down to nothing are infuriating. You move through a scenario with ease and 1 damage card can destroy you. The damage card that limits your movement to 1 space per action is a game over card. Flipping damage and horror cards is a moronic mechanic.\nEdit: Awful horrible. Just played the easy 2 star scenario on the cheap but over priced expansion. Didn't understand what they wanted so I accused someone of murder not realizing it started an end game scenario. A ghost appeared with 32 hp. Three players cannot kill something with 32 hp before it does at least 1 character in. Impossible. Attacks from everywhere attacking everyone, horror checks for everyone, mythos effects every round, coupled with most of the time you being only able to attack once and do damage. Insulting. Everyone who plays this cheats. They house rule moving farther, doing more actions when interacting with npc's, trading, etc.\nI redo it guessing the right murderer for this Beyond the Threshold scenario. I then battle the three monster women which I figure is supposed to be easier. It is but I'm still cheating like a mutha cause I'm guessing the clues, horror, and damage I should have at the point this finale started. I still lost. I still lost while cheating. I realized after I killed the monsters that 1 pc had 6 horror and should've drew an insanity card. I drew the card which said if a search token was still on the board at the end you lose. Well I had search tokens so I lost. I cheated and still lost! This shows you how bad this game is.\nTried again. Gates of Silverwood. Had to fight 3 Thralls. Killed the 2 minions and damaged the main one that was a friend turned monster. He seemed to be fighting his evilness. Well that was wrong. By killing the minions it just summoned 2 more tougher ones. This would then make me have to make 6 more rolls before my next turn. NO! Im done. Just tell me what to do Dammit, or at least make sense! No way was I'm supposed to know to attack my friend first and ignore the others. We said screw it, we won. We just smashed the damage button on the \"main baddie\" and didn't even read the end text. Another dumb scenario by a game company that seems to delight in aggravating its customers.\nCan be fun just to play cheating often to manage any aggravating crap that comes up.",
    "timestamp": 1667257200
  },
  {
    "username": "Samuel Vriezen",
    "rating": 3.0,
    "comment": "The good scenarios are quite engaging, but I’m finding that a lot aren’t so good. You can still have a fun sort of game then, though I’m kind of done with all those stupid puzzles by now.",
    "timestamp": 1659045600
  },
  {
    "username": "SamLL",
    "rating": 3.0,
    "comment": "Just not an experience I'm looking for. The app makes most or all the consequences of your actions hidden and therefore makes it impossible to meaningfully strategize and optimize. Instead you pretty much just bumble around and see what happens. We realized a few hours into a scenario, Altered Fates, that we had basically softlocked ourselves out of being able to move forward by using our Summoning spell on turn 1 to unite the party instead of leaving one person on another map.",
    "timestamp": 1657144800
  },
  {
    "username": "Elanif",
    "rating": 3.0,
    "comment": "Huge disappointment. The game basically played itself through dice rolls and room exploration rng. Even worse is the lack of replayability and that only 4 scenarios come with the box, the other ones are DLC.",
    "timestamp": 1656626400
  },
  {
    "username": "KHMakerD",
    "rating": 3.0,
    "comment": "I did not have fun trying to play it and using the app. The figures cannot stand up on their own and kind of ruin the experience. This game made me dislike games with a lot of figures.",
    "timestamp": 1655330400
  },
  {
    "username": "callasmar",
    "rating": 3.0,
    "comment": "The app has too much room in this game. I can see it work as a PC game, but I don´t see ny reason for a board anymore. Nearly no decisions. Interactions not between players but between the app and a player. I perfect example why I dislike games that use an app.",
    "timestamp": 1652479200
  },
  {
    "username": "Forgeforgeforge",
    "rating": 3.0,
    "comment": "I bet there's an audience of 12 year olds from the 90s for this game but it's not me.\n\nFirst map I tried to minmax a brawler only for two of my fisticuffs rolls in a row to result in a failed persuasion check (!?). I then went deliberately insane and sacrificed my friends to the goat god for the solo victory.\n\nMurder mystery party vibes.",
    "timestamp": 1649714400
  },
  {
    "username": "Mageknight12",
    "rating": 4.0,
    "comment": "Not worth with this price",
    "timestamp": 1759183200
  },
  {
    "username": "Golgonooza",
    "rating": 4.0,
    "comment": "This was the first app-enhanced board game I purchased. All the folks I met and talked to were all overjoyed by the game. I was excited to play with the app because it could open up a whole new experience that would change the way games were played and updated.\n\nThis may be a case of setting my expectations too high for something the game didn't intend to do. From speaking with others, I was under the impression that each of the four scenarios was randomized in ways that would make each play unique. I was wrong.\n\nThe game is okay. I have no interest in playing it again, though. Many might enjoy the audio or the stories. Overall, it didn't work for us.\n\nUnfortunately, our first playthrough was cut short, so we decided to start over again the next day. When we restarted it, it was precisely the same game. No randomization. We futzed around, thinking it might be because we had stopped playing the story last night. We did eventually play a somewhat randomized game. You might not know where every item is hidden, and the monsters may change in some ways; however, the scripted dialogue and plot remain intact. So, it was a case of randomizing some minor details and playing the same basic game again. And the story was, for us, not a hit. We found it to be dull, and after discussing the pieces and the board, we decided that the cost of the physical pieces, boards, and so on, is not worth it. It would be just as good, if not better, as a standalone app. However, if you prefer having physical representations on a board instead of digital content throughout the experience, that's your choice and your fun.\n\nI have tried to leave it be and come back to it, but it just doesn't click for us (especially me). After experimenting with the four scenarios that come with the basic set we purchased, I don't think I'll be playing it again. I am incredibly dissapointed by the game. The minis are FFG quality, so don't expect them to be top drawer. At $100 at purchase, I found the emergent narrative of the less expensive Mage Knight (which I also didn't love) to be a little more engaging on replays (I'm going to have to revisit that game). I would recommend this as an experience for folks, but I'd recommend you play someone else's copy of it with them ;-)",
    "timestamp": 1756591200
  },
  {
    "username": "toothpickman",
    "rating": 4.0,
    "comment": "With Beyond the Threshold Expansion\nas well as Mansions of Madness 1st Edition\n4/7/2021\nSold, this game just wasn't a good game for us. It wasn't the app interface, which was ok, it was just the feel of the game. The puzzles weren't that interesting. The game had a plodding feel of barely scraping by, inspiring a feeling akin to the feed your people elements of other games. This combined with the lack of replayability once you succeeded at a scenario really made this one an easy one to get rid of for me. All my objections save for the lack of replayability are all strengths to those with different tastes and I'm glad they have this game.",
    "timestamp": 1749938400
  },
  {
    "username": "Darknlves",
    "rating": 4.0,
    "comment": "Has gotten worse overtime. Really limited on scenarios out of the box. Only one scenario that I trully loved the experience. This might have been great when it came out but, that's not the case anymore, at least not solo or for 2.",
    "timestamp": 1746223200
  },
  {
    "username": "Maced",
    "rating": 4.0,
    "comment": "The required app is lacking in many areas, like momster stats. Also the minis are terrible. The game still had some fun moments but I would not recommend it.\n\n4 plays at 5 players. Also double all expected play times at 5 players",
    "timestamp": 1742166000
  },
  {
    "username": "ExplodingSnail",
    "rating": 4.0,
    "comment": "Clever setup and components but there just isn't a game here.",
    "timestamp": 1731884400
  },
  {
    "username": "spanky777",
    "rating": 4.0,
    "comment": "This game 100% needs to just be an app game. Super random, monsters are everywhere and you have nothing to use. Whats the point of the board as you can do everything basically without the tokens. Not great.",
    "timestamp": 1726956000
  },
  {
    "username": "latschediwes",
    "rating": 4.0,
    "comment": "MoM 2e is mostly an App-game with cardboard and plastic attached to it. It feels like playing a simple point-and-click adventure with poorly written pre-planned narrative. Unfolding the plot is a tedious and rather shallow affair. At their best, the scenarios can be described as very directed.\n\nThe physical components have implications for immersion, but they are mostly used for repetitive and fiddly tasks to the point that it feels like a chore. The App provides micro-puzzles that don't add anything to the game and make no thematic sense. Along the way, a ton of non-essential skill checks are rolled. The soft plastic miniatures are wobbly and unpractical. It's all kind of superfluous.\n\nThe game feels more like simple version of Dungeon Crawlers in the spirit of Descent & co. than a RPG or adventure game, respectively. It all revolves around killing stuff and collecting stuff. That well may be so, but it does not seem that is exactly how the game is marketed.\n\nIt wasn't all bad - The good part was the initial wow factor and sense of discovery. But all things considered, it's an irresponsible product; approx. 90 - 100 bucks for four linear scenarios with the above mentioned characteristics, really?",
    "timestamp": 1725573600
  },
  {
    "username": "CannonFodderTed",
    "rating": 3.5,
    "comment": "Not a fan. The theme did not grab me and while the app for this was well made, I do not like that I had to use an app for this. In a multiplayer game, it just means one person sits on the app the whole game and tells others what is going on. And then if you are in a busy game store, you cannot hear it anyway. Yet, here we go again with another random encounter type of exploration game which, if you know me at all, are not my cup of tea. This game just fell flat for me. Give me something more euro style with some strategy and decisions and less about random chance encounters. Sorry, but I don't buy into the hype train on this one guys. This is a well regarded game amongst gamers but sadly it's not for me.",
    "timestamp": 1722549600
  },
  {
    "username": "Teslavstwain",
    "rating": 4.0,
    "comment": "This one is tricky. It seems like one I would enjoy, but I have tried to play it 3 times and had bad experiences every time. Not bc of the game, but bc of a player (and a different player every time). I really want to try it again with my usual crew to see if I like it when there is no drama, no whining, and no over-reacting/angry screaming and snatching of components when a first-timer makes a minor very mistake. I will update when I play again with my usual group if I do end up liking it when playing with mature adults that are not wound tighter than screw.\n\nEdit: found a copy for $20 so going to give it another go, maybe solo or with one of my regular ladies to see how it goes.\n\nUpdate: yeah, still not for me but I couldn't say why bc it should be one I like. Maybe those early bad experiences just colored my opinion of it too much to get past and enjoy.",
    "timestamp": 1717452000
  },
  {
    "username": "agutmann2530",
    "rating": 4.0,
    "comment": "1p",
    "timestamp": 1716501600
  },
  {
    "username": "btasam",
    "rating": 4.0,
    "comment": "While I'll happily play this under the right circumstances, the LCG was a far superior experience.",
    "timestamp": 1715205600
  },
  {
    "username": "AntKampino",
    "rating": 4.0,
    "comment": "I dont like coops. Oversll the game is ok.",
    "timestamp": 1714860000
  },
  {
    "username": "VultR",
    "rating": 4.0,
    "comment": "Cthulu Death may Die might be a better purchase, Narrative, mystery based, discovery, app driven\n\nPrice: $87.00",
    "timestamp": 1708210800
  },
  {
    "username": "bainewedlock",
    "rating": 4.0,
    "comment": "Rating 4 = To someone with a simliar taste like me: Play this game if you don't have anything else to do.",
    "timestamp": 1703545200
  },
  {
    "username": "LindarOlostur",
    "rating": 4.0,
    "comment": "Это слишком кризисная игра для меня, но кроме прочего у меня есть определенные претензии к самому геймплею. Мне не нравится что сложность игры достигается крайне подлым способом. Сейчас объясню: когда ты проходишь сценарий, ты видишь цель и идешь к ней, рассчитывая свои ресурсы, но когда ты достиг ее, игра тебе скажет извини, но надо было еще сделать кое-что. На следующую попытку ты скорректировал свой план, но сценарий тебе уже известен, и ты просто механически проходишь все то что уже видел в прошлый раз. Однако, когда ты достиг цели и с учетом прошлого поражения игра может запросто сказать тебе: \"молодец, все правильно, но там нужно было сделать еще кое-что\". И если у тебя есть терпение перепроходить сценарий снова, ты будешь пробовать и повторять все вновь, а если нет, то попробуешь новый сценарий где тебя ждать точно такой же цикл после первой попытки.",
    "timestamp": 1702162800
  },
  {
    "username": "AmandaDesignsGames",
    "rating": 4.0,
    "comment": "Of all of the FFG-mythos games I've played, this has been my least favourite. I'm not against app-integration, but this one seems to have the worst aspects of both an app game and a board game: it is tedious and fiddly to setup and maintain, as a mini-based board game is, but also annoyingly light, because the app managing everything means you're never sure what you'll be able to do.",
    "timestamp": 1701817200
  },
  {
    "username": "Entropology",
    "rating": 4.0,
    "comment": "Sigh, wanted to like this so much. Again, Cthulu theme not for me, but that is a known going in. Played through three scenarios and realized after the second attempt of the 3rd scenario, there are almost no interesting gameplay decisions. For a decision to be 'interesting' to me, you have to have a reasonable understanding of the consequences of said choice. But that is exactly what this game hides from you 90% of the time, otherwise the story wouldn't really work. Should I spend the time to search here? Don't know! You waste actions and you're certain to lose but you have little to no idea which actions are wasted until you finish. Then on second play through, you know the beats and it just becomes an action efficiency puzzle.\n\nIt's a great achievement of board/app integration, the writing is stellar and deserves to be recognized, but it just leaves me depressed. Hey! Theme worked I guess...!",
    "timestamp": 1701126000
  },
  {
    "username": "millsyboy",
    "rating": 4.0,
    "comment": "This isn't my kind of game, but it's an interesting concept nonetheless.",
    "timestamp": 1700175600
  },
  {
    "username": "Larixes",
    "rating": 4.0,
    "comment": "Biuro",
    "timestamp": 1699830000
  },
  {
    "username": "elongatedmuffin",
    "rating": 4.0,
    "comment": "Out of any game I've played that's been in the BGG Top 100, this is the one I understand the least. I suppose I'm very biased as I have never enjoyed rolling for skill checks, do not care about the Cthulhu theme, and tend to prefer competitive over co-op. But I'm confused about what is fun with the gameplay. It's a lot of rules and way way too long for what you get to do. There's very little strategic control. It does little to prevent quarterbacking. The difficulty scaling by player count seems pretty off. I suppose the app integration is well done, but I mostly resent the fact that you're paying this much money for only 4 scenarios. I guess people enjoy \"an experience\" more than me, but for that, I'd rather pick something that leans more into the semi-coop and is shorter.",
    "timestamp": 1697752800
  },
  {
    "username": "SittingGeorge",
    "rating": 4.0,
    "comment": "This game is beautiful and tells a cool story, but it just doesn't have enough strategy to it to justify its length. By the end, I always find myself wanting to cheat just to get the game over with. The monsters are throwing effects all over the place and no one cares about them after 3 hours. I'd rather lose the game halfway through from making a wrong choice than lose it 1 move from the end because a random monster effect made me take one more horror card than different odds may have allowed. Still, it's a fun almost roleplaying environment to engage with friends over, but not really my thing. In a way, I'm surprised this is in the top 100... but the \"cool factor\" is high, and it is a lot more approachable than many cooperative games of its kind, even wonderfully so. It's probably a great time with the right group. Actual plays, probably around 5.",
    "timestamp": 1697148000
  },
  {
    "username": "brownsound",
    "rating": 4.0,
    "comment": "To nie jest planszówka, ale gra komputerowa. Plansza i figurki do niczego nie są tu potrzebne.",
    "timestamp": 1690063200
  },
  {
    "username": "CJWF",
    "rating": 4.0,
    "comment": "Played it once, the first edition was fun playing the overlord. In this new edition I feel like it doesn't really matter what you do, You're just moving your mini from one door/cupboard/drawer to the next, solve puzzles when told so and fight huge abominations from the underworld with your bare fists when they appear. There's no real decisions and not much strategy either so I guess it's more for people who enjoy a fancy create your own adventure.",
    "timestamp": 1689458400
  },
  {
    "username": "badgeverine",
    "rating": 4.0,
    "comment": "Same mechanics as in Lord of the Rings game, which I played first and liked a lot more.",
    "timestamp": 1686175200
  },
  {
    "username": "SeraFlint",
    "rating": 4.0,
    "comment": "Annoying.\nPlayed once in 2P mode with BFF and we were utterly disappointed. Time runs out too quickly, no time for thorough exploration, you just need to run through the scenario or else you're overrun by monsters or the mansion crumbling apart.\nNot our cup of tea. Sold after one play.",
    "timestamp": 1681596000
  },
  {
    "username": "a39r39",
    "rating": 4.0,
    "comment": "The first gameplay of this game is interesting, It create a sense of suspense and horror to a certain extent. However, you may feel descriptions are always repeated when you continue to palying.\n\nAlso, the gameplay will be very clumsy if you play more than 2 players. The down time is very long. I tried 4 people to play scenario 2 and we played over 3 hours. We lost at the end!! This is so despair.\n\nI would say it is a good game if you are new into boardgame. The App helps you to modify the game play a lot. But my recommend is palying the core game would be enough. Spend money to try more worther games except buying expansion. you will gain more joyful in BG.",
    "timestamp": 1680127200
  },
  {
    "username": "Jalash",
    "rating": 4.0,
    "comment": "It need more scenarios, we are lucky someone had made Valkyrie:\n\nhttps://boardgamegeek.com/thread/1916430/fan-made-scenarios-...",
    "timestamp": 1678834800
  },
  {
    "username": "FlyNRyan",
    "rating": 4.0,
    "comment": "stolen by the devil",
    "timestamp": 1673218800
  },
  {
    "username": "bregus",
    "rating": 4.0,
    "comment": "have sold the game with all expansions at last. too boring and too easy on mechanics. lord of the rings is much interesting because of deckbuilding stuff.",
    "timestamp": 1672009200
  },
  {
    "username": "SaraM99",
    "rating": 4.0,
    "comment": "This game is not for me. I know it is suppose to be great and i should love it... but the few times i have started playing it i inmmediatly whish i was somewhere else!",
    "timestamp": 1671145200
  },
  {
    "username": "llopis",
    "rating": 4.0,
    "comment": "I really wanted to like it, but I've come to realize I HATE this kind of app integration. It makes things feel extra random and you spend a long time just keeping the app informed of what's happening.",
    "timestamp": 1669590000
  },
  {
    "username": "StormKnight",
    "rating": 4.0,
    "comment": "Somewhat nice theme bogged down by an overly convoluted way of doing things; essentially you need to look up a new random rule every time you do anything. Random on random. Seems to scale poorly for 2 player. Hard to know what to do; first scenario you MUST rush full speed after the clues and never deviate, second scenario you must completely ignore the clues and run around randomly.\n+co-op+ +Halloween+",
    "timestamp": 1665007200
  },
  {
    "username": "alexs34",
    "rating": 4.0,
    "comment": "After playing it once, I’m not impressed. However, I think we didn’t play it correctly.",
    "timestamp": 1660255200
  },
  {
    "username": "Rianane",
    "rating": 4.0,
    "comment": "This game would be good for a) solo players and b)) players who love the Arkham universe but have played every other game to exhaustion. This game is terrible for anyone else as the pace is way too slow, the story is interrupted constantly as you try to find the right floor tile (annoying) and place the correct markers.",
    "timestamp": 1655676000
  },
  {
    "username": "Udai",
    "rating": 5.0,
    "comment": "It was fun, but the process was so tedious. There is PC, I no longer felt the need to play this game on an analog game.",
    "timestamp": 1762124400
  },
  {
    "username": "Chibazkun",
    "rating": 5.0,
    "comment": "+ Sanctum of Twilight",
    "timestamp": 1761170400
  },
  {
    "username": "cenny",
    "rating": 5.0,
    "comment": "Okay, let’s start with the good stuff and what I like.\n\nThis game has great production values, I think the tiles are very nice and detailed.\n\nThere is also a lot of variation if you own a couple of expansions. The amount of tiles, items, spells, characters, scenarios, and enemies is amazing!.\n\nI love the insanity mechanic, it’s well done and a tiny part of the game but important.\n\nSo there is a lot to like here, but now too the stuff that is not so great.\n\nThere is little to no tension, the decisions are not interesting, and the games usually drags on and the ending can be anticlimactic.\n\nThe decisions in the games are you not fun for the most part and most stuff are dice rolls and random effects from cards or the app. There is little I can do that actually matters. The game is simple explore as much as possible but don’t take to long and hope you roll well.\n\nI want to like this game but the combat is boring, the mysteries are usually not that interesting, and it takes too long.\n\nI’ll still play it because it’s fun too see all the different scenarios and my friends like it a lot and some one once said it’s always fun to play someone’s else favorite game even if it’s not what you prefer.\n\nBut if you want a cool mystery game play Detective: city of angels instead.\n\nLast point, I’m a little tired of lovecraft, I love his short stories but lovecraft themed board games I’m a little sick of.",
    "timestamp": 1761084000
  },
  {
    "username": "nic7410",
    "rating": 5.0,
    "comment": "75 used, sleeved, boxed",
    "timestamp": 1757541600
  },
  {
    "username": "destro",
    "rating": 5.0,
    "comment": "s",
    "timestamp": 1756245600
  },
  {
    "username": "Meeplomat",
    "rating": 5.0,
    "comment": "Review here: https://boardgamegeek.com/thread/3551228/dispatches-from-the...",
    "timestamp": 1753999200
  },
  {
    "username": "boueverte",
    "rating": 5.0,
    "comment": "Meilleur que le précédent, plus narratif, plus travaillé. Les histoires sont un peu mieux écrites, plus diversifiées et un poil plus intéressantes - mais il y'a très peu de scénarios et ils ne sont pas forcément très élaborés.\nLe gameplay quoiqu'amélioré est toujours aussi poussiéreux et laborieux. Ce jeu mériterait un système d'actions et d'activations plus dynamique et fluide, avec de meilleurs combats, et des mécaniques de résolutions d'actions plus originales. ça prend trop de tours de traverser la map et de revenir en arrière, ça se traîne car les investigateurs ont des choix trop limités.\nQui plus est, les phases de puzzles sont une fausse bonne idée, ça cassait déjà bcp le rythme dans la première édition.\nC'est juste un peu mieux grâce à l'application, mais c'est toujours trop lourd comme fonctionnement. Et surtout on passe son temps à faire des tests dans tous les sens, et ça ne demande pas vraiment de réflexion, car c'est trop passif.\nAu final, ça n'arrive toujours pas à la cheville de l'écriture de Lovecraft, et on a plus l'impression de subir le jeu que d'être vraiment pro-actifs dans le gameplay. ça aurait pu être bien, mais c'est long pour ce que c'est et niveau ambiance horrifique, ça rappelle au mieux scouby-doo.",
    "timestamp": 1753567200
  },
  {
    "username": "Mug_of_Tetris",
    "rating": 5.0,
    "comment": "Interesting idea but the execution left alot to be desired.\nCore Game scenarios are not very good, specifically one scenario has a terrible design where the group are almost guaranteed to fail without knowing exactly what to do, feels bad to waste 3 hours.\nFar too often you'd have nothing interesting to do and have to spend your turn slowly moving across the board.\nMonster figures are terrible and get in the way of playing the game.\n\nValkyrie fan made scenarios are much better and several were very good, but in general I much preferred Eldritch Horror for my Lovecraftian coop action.",
    "timestamp": 1751925600
  },
  {
    "username": "Scifi66",
    "rating": 5.0,
    "comment": "25Jun->Played it again and had pretty much the same experience. My group likes it so it wasn't unfun.\n23Aug->No need to play it again, too long with too few decisions. Thematic and enjoyable experience. App is one of the best I've seen. Not sure about replay value although there are a number of scenarios.",
    "timestamp": 1751839200
  },
  {
    "username": "Xarges",
    "rating": 5.0,
    "comment": "App - nur 5 Stars",
    "timestamp": 1751148000
  },
  {
    "username": "S04Niels",
    "rating": 5.0,
    "comment": "70€",
    "timestamp": 1748296800
  },
  {
    "username": "Javi_2024",
    "rating": 5.0,
    "comment": "I love the theme, but the use of the app in this game completely takes you out of the experience. On the other hand, the stories, while interesting, are very linear and offer no real decision-making.",
    "timestamp": 1748296800
  },
  {
    "username": "cheshire_cat",
    "rating": 5.0,
    "comment": "Game is goodish. But it's like overpriced. Too low number of scenarios for this money. First edition is better to my taste.",
    "timestamp": 1747778400
  },
  {
    "username": "IJJusion",
    "rating": 5.0,
    "comment": "Meh, not for me - app games requiring re-runs when you fail a mission isnt enjoyable to me at all.",
    "timestamp": 1745964000
  },
  {
    "username": "FistTruck",
    "rating": 5.0,
    "comment": "Might have to come back to this game to dig it, but after a few plays, it hasn't been clicking. I am not against app integration in board games, but the app handles so much, that it does feel like having the physical board is just a formality. Also, having only 4 scenarios out of the box is way too few for me. I understand that the play time of the scenarios is very high, which makes up for it, but a 4-6 hour scenario is a bit much, I just start getting burned out.",
    "timestamp": 1745186400
  },
  {
    "username": "dylansofia",
    "rating": 5.0,
    "comment": "Played 2 hours of a 4 player game when 1 investigator died...and she went to let the app know and by accident pressed \"end game\" and our game was over....just like that. What kind of designer makes an app with no \"warning\" about the game ending or no \"back Button\"?? Are we in the 80's? I sold this clunker...not going to waste my time with this again.",
    "timestamp": 1744236000
  },
  {
    "username": "Mortiis69",
    "rating": 5.0,
    "comment": "I thought and hoped I will enjoy it more, but unfortunately it didn't happen. The game is rather boring and little exciting, the app is annoying, I just don't like it... and the absurdity of the final puzzle in the first scenario was simply brutal, way too difficult and made the whole over 2 hour long effort a complete waste of time, there was no chance to get a final answer with zillion possible variants. Miniatures are awful and I played without them, stands for the miniatures is the worst thing I've ever seen in a board game. What were they thinking?!!!!",
    "timestamp": 1740006000
  },
  {
    "username": "EllikTheren",
    "rating": 5.0,
    "comment": "Impressive thematic. Fun storylines. I like to explore the scenarios and figure out what is going on. I don't like how much luck is involved. Also the madness mechanic is annoying. I literally removed some of the insanity cards from the game because of how much they ruined the experience.",
    "timestamp": 1737759600
  },
  {
    "username": "Arrieus",
    "rating": 5.0,
    "comment": "Fun concept, but low replayability and very long game sessions - too long. I wish there were more than 4 scenarios in the base box.",
    "timestamp": 1737327600
  },
  {
    "username": "Aurora84",
    "rating": 5.0,
    "comment": "Sold.",
    "timestamp": 1736982000
  },
  {
    "username": "saoirseclerks",
    "rating": 5.0,
    "comment": "玩人而不是玩游戏的一个游戏",
    "timestamp": 1735945200
  },
  {
    "username": "INeverGame",
    "rating": 5.0,
    "comment": "The initial scenario is good. The second scenario was okay. After that it was too samey. Later scenarios are 2-4x longer w/o anything to make them interesting.",
    "timestamp": 1732057200
  },
  {
    "username": "BakosTacos",
    "rating": 5.0,
    "comment": "Wasn't a fan of the stories or gameplay",
    "timestamp": 1730588400
  },
  {
    "username": "Geekymamameeple",
    "rating": 5.0,
    "comment": "Ved ikke helt hvad jeg synes om det appbaserede, men er umiddelbart ikke vild med det her spil",
    "timestamp": 1730242800
  },
  {
    "username": "sr925713",
    "rating": 4.5,
    "comment": "This game didn't click with me. It felt like a somewhat generic dungeon crawler. I also didn't like the combat. That said, i would play rarely if someone else insisted.",
    "timestamp": 1729116000
  },
  {
    "username": "Ken49",
    "rating": 5.0,
    "comment": "Currently on Ebay.",
    "timestamp": 1728856800
  },
  {
    "username": "MichielTummers",
    "rating": 5.0,
    "comment": "Where to start  First of all i really wanted to like this game. The hype was real... This is also why i feel compelled to write this much about it.. I see so many glaring problems with this i can't recommend this ever over it's main competitor, Betrayal at House on the Hill\n\na) App usement is way too much. Why even use the boardgame pieces? Why not just invite friends and play a old point and click adventure together?\nb) One guy taking the tablet and solving Mastermind puzzles and easy 6 picture puzzles while the rest stares in the distance bored is not my idea of a fun game\nc) No \"back\" button on the App at all. One misclick and the entire game is void already.\nd) staring for hours on end to a tablet is not my idea of a boardgame\n\nFurthermore:\n\na) everything is the same. monster spawns, monster respawns, take action and nothing more. Zero meaningful decisions.\nb) Horribly prone to Alpha gamer syndrome. Betrayal solves this with a betrayer mechanic\nc) Where Betrayal lasts 1 hour this one can take 6 hours for the last scenario? 6 hours of dice chucking.. really?\n\nI have much more to say about it, but i was just bored. I hear people saying how this is the game that Betrayal was supposed to be , but i just don't see it. Im sorry \n\nWant to play this more though to see if i was mistaken!\n\nplayed one time again and it was much better with 3 players!!",
    "timestamp": 1728165600
  },
  {
    "username": "jqh928",
    "rating": 5.0,
    "comment": "I originally rated the game quite highly. I have played all the original scenarios and the DLC. However, things started to go down hiil with some of the expansions. This was primarily because of the robustness of the app, bugs and poor play testing to identify bugs and game glitches.",
    "timestamp": 1726696800
  },
  {
    "username": "VadymH",
    "rating": 5.0,
    "comment": "I don’t really like board games; I didn’t spare the tablet",
    "timestamp": 1723672800
  },
  {
    "username": "Abysmul",
    "rating": 5.0,
    "comment": "Box has some damage, minis just in bags, all serviceable but not pristine.",
    "timestamp": 1719266400
  },
  {
    "username": "Aphexia31",
    "rating": 5.0,
    "comment": "Just not fun",
    "timestamp": 1718748000
  },
  {
    "username": "Sgrhung",
    "rating": 5.0,
    "comment": "Non apprezzo l'utilizzo della tecnologia dei giochi da tavolo.\nAnche tralasciando questo, il gioco a mio parere non è un granché: è ripetitivo allo sfinimento e le statistiche dei personaggi sembrano non contare a nulla (quando combatti senza armi potrebbe capitarti il tiro su forza come il tiro su percezione o su volontà, totalmente random).\nLo sconsiglio",
    "timestamp": 1717624800
  },
  {
    "username": "PookaPuck",
    "rating": 5.0,
    "comment": "This can be a fun game with the right people and the right luck and the right scenario. But I have had more bad games then good.",
    "timestamp": 1717106400
  },
  {
    "username": "dogzilla99",
    "rating": 5.0,
    "comment": "I feel like the game is torn between whether it wants to be a board game or a video game. If I'm playing a board game, I don't want to be interacting with an app more than I'm interacting with the physical game components.",
    "timestamp": 1712959200
  },
  {
    "username": "pinchazumos",
    "rating": 5.0,
    "comment": "I hoped this would be the game that made me like ameritrash games, all reviewers were raving about it but man, what a let down!. Throw dice while I read you a story. And not even a good one! I'd rather read a book honestly.\n\nAlso (like with most FFG games) you can expect some wonky rules clogging up the game.\n\nPD: Component quality is kind of crap for such an expensive game.",
    "timestamp": 1712354400
  },
  {
    "username": "robertoabr",
    "rating": 5.0,
    "comment": "It’s ok. There are so many better app based story games now with smoother experiences like Forgotten Waters or Chronicles of Crime. And for story / an open world I strongly prefer Sleeping Gods. For a haunted house game , I prefer Cthulhu death may die.\n\nBasically I like the story and the exploration here , but the game here is too luck based and just not that clever. And I have also realized that it’s more fun to have the antagonist be a player (like in Betrayal) than when the computer plays that role.\n\nFurthermore, a campaign/legacy format is ideal with these story focused games. Mansions of madness feels too long to play ( it’s 3+ hrs per session) while at the same time it’s stories feel too short.\n\nOverall, I am not sure why this game is so popular.",
    "timestamp": 1711753200
  },
  {
    "username": "soki86",
    "rating": 5.0,
    "comment": "App",
    "timestamp": 1708297200
  },
  {
    "username": "CrackTheSky",
    "rating": 4.5,
    "comment": "It's very highly rated, and often mentioned on \"Top XXX\" lists. But I disagree:\nI owned the core and 2 expansions, played it less than 10 times before selling: 4 with a four player count, and about 5 times solo.\n\nPros:\n1. Outstanding board tile artwork\n2. Theme is properly dark and menacing, very engaging.\n3. App is excellent, adds quite a bit of theme and ambiance...can get repetitive tho.\n4. Overall component quality is excellent, except the minis - they're just meh.\n\nCons:\n1. No way to gauge progression during the scenario.\n2. Repetitive narrative when engaging enemies.\n3. Mini quality and the ridiculous Base design.\n4. Found a way to break the game.\n\nThis is a game with great potential. If the above Cons were fixed, and the accompanying App had a FULL narrative, I think this game would be an Essential. Perhaps in 3rd Edtion....",
    "timestamp": 1707001200
  },
  {
    "username": "dhable",
    "rating": 5.0,
    "comment": "It's a very interesting solo game as the computer takes the place of one of the players. That let's the game tell a compelling story. Despite this, I had to drop the rating. First, I've become less interested in solo gaming. Pulling a computer out on those occasions when I can get a group together isn't as fulfilling. Second, the game needs expansions in order to stay fresh. The cost of the latest expansion is more than I want to keep pumping into a gaming experience for myself. At the rate I'm spending on this game, I could buy a new game console and get the same number of plays out of a solo game.\n\n\nRating History:\n22 Jan 2024 - 5 (14 plays)\n22 Jan 2020 - 6 (14 plays)\n29 Dec 2017 - 6 (14 plays)\n05 Nov 2017 - 6 (14 plays)\nUnknown - 7.25 (10 plays)",
    "timestamp": 1705878000
  },
  {
    "username": "SerialGhost",
    "rating": 5.0,
    "comment": "+Theme is strong for people who enjoy the theme of it\n+App is well done\n+Unique characters\n-Gameplay feels dull\n-I dont like the theme at all\n-cant get invested in the story of the scenarios",
    "timestamp": 1699830000
  },
  {
    "username": "Johngallant",
    "rating": 5.0,
    "comment": "Be aware that while the companion app is very nice, there are only four scenarios included in the base game. Otherwise, you need to buy other scenarios or the expansions. The base game does NOT come with 22 scenarios.\nOtherwise, it is an interesting way to play with the app as the GM, but we would not replay the base scenarios.",
    "timestamp": 1698444000
  },
  {
    "username": "Azarel08",
    "rating": 5.0,
    "comment": "370 - 570",
    "timestamp": 1696629600
  },
  {
    "username": "Danielka7",
    "rating": 5.0,
    "comment": "Repetitive gameplay and very long. Nearing the end nobody wants to read those texts anymore. Rulebook could be much better. No player aids.\nEasiest way to win is to go mad and hope for some fun new objective.\nMiniature bases are unbelievably bad. Otherwise miniatures look great.",
    "timestamp": 1695938400
  },
  {
    "username": "wynarator",
    "rating": 5.0,
    "comment": "I am sorry but this game is mostly played on the app.",
    "timestamp": 1691791200
  },
  {
    "username": "hiimjosh",
    "rating": 5.0,
    "comment": "I've had my eye on this for a long time and a recent sale made this too cheap not to go for. I've never played the original and haven't liked most of the Arkham series (although I really like Arkham LCG). This game is kind of smack dab in the middle. It has a lot of elements of the LCG (like tight, focussed stories) but still has many core elements of the original Arkham (namely the dice chucking for tests).\n\nOverall I was pretty impressed with the design. The app works surprisingly well as a random generator, and there seems to be a lot of content in it. For example, you'll walk into a room and several random features of the room will become highlighted as something you can search. The way that the app adds variation between plays is really interesting. The app is also used for some other mechanics as well such as delayed effects or triggered effects that are tightly integrated with your current map layout\n\nThe game itself is pretty streamlined. I like the new clue system (you can use clues to upgrade roles rather than reroll) and the conditions/possessions here felt most at home compared to other Arkham entries. The damage and horror effects here are some of the best of the line as well; rather than just accumulating chits you draw cards which may have other associated effects with them. Insanity doesn't mean the end of the game but it does trigger some very interesting changes that can be almost Betrayal at House on the Hill-ish. The game was also pretty easy to learn as you can mostly follow along with the app and then transition to the Learn to Play manual\n\nThe combat is simplistic but it works. It drags on after a bit and I found myself no longer reading the flavor text just to speed things along. In the end my first game (including setup and some brief rulebook digging) took 3.5 hours which was way too long. I could maybe get this down to 2 hours, but there is a lot of drudgery and upkeep which gets old\n\nThe core game is good and the app does a lot to immerse you. Rather than shuffling decks of cards you can click a button and the stories the app generates are much better than your standard Arkham formula of generic nonsense. The game is way too long for what it is though so it's hard for me to unwaveringly recommend\n\nEDIT: The app integration is well-done in the sense that unexpected things will happen between plays. The combat is very, very random though and the scenarios play out similarly from game to game. It's also quite long and context switching between the game and the app gets old",
    "timestamp": 1691618400
  },
  {
    "username": "brapsmagic",
    "rating": 5.0,
    "comment": "very enjoyable and thematic, but you have to figure out how to approach it, and, at least for me, it requires a lot of house ruling to make it palatable. it's not a game so much as at atmospheric experience. I rarely enjoy that style of game but in this case, it works because Cthulhu is inherently so atmospheric and MoM (mostly) does a great job in capturing the feel. occasionally, it becomes too monster heavy but you can generally work around that. the worst part of the game is the \"Last 10% Syndrome\" (need a better name for that). You get through 85/90% of the game and then get killed by some random thing you could have only anticipated had you already played the scenario.\nthen you replay it and the same thing happens at the 95% point of the game, etc... this requires house ruling and/or simply ignoring the mechanics and just moving through the end of the game simply to see the conclusion.",
    "timestamp": 1691359200
  },
  {
    "username": "localghost8080",
    "rating": 5.0,
    "comment": "Limited control over your fate. Brutal random events will kill players out of nowhere. Approach this as an emergent story-driven experience and you will enjoy it more.",
    "timestamp": 1688335200
  },
  {
    "username": "krit1789",
    "rating": 5.0,
    "comment": "Not a big fan of Lovecraftian universe. Compared to Arkham Horror or Eldritch Horror, it is at least more convenient to play thank to the app.",
    "timestamp": 1685916000
  },
  {
    "username": "GeckoCream",
    "rating": 5.0,
    "comment": "I might just be the only person that thinks the first edition is better.",
    "timestamp": 1684792800
  },
  {
    "username": "DaniDCR",
    "rating": 5.0,
    "comment": "Cooperativo. Es como jugar a un videojuego.\nMe ha recordado un poco al Police Precinct aunque este último es más sencillo... te mueves, haces la acción (averiguas pistas, lanzas dados, etc) y sale evento; en cualquier caso, prefiero el PP por el tema policiaco.\nEl MM está chulo y tiene su encanto... la aplicación en la tablet mola.\nLo malo es que hay que leer mucho y eso en los juegos no me gusta.\nNo me importaría jugar otra partidilla ahora que ya sé más o menos cómo es.",
    "timestamp": 1679698800
  },
  {
    "username": "Ranior",
    "rating": 5.0,
    "comment": "For a big giant thematic game like this, it does it's job pretty well. I get people who don't want apps in their games, but this nicely helps. It gives you ambient and appropriate music, can give you varied clues and scenarios and map layouts, and it helps track such a fiddly game with less clutter and tokens and counters needed for the players.\n\nIn the end then you get a pretty great gothic horror experience of searching out a haunted place, gathering items and clues, and trying to beat down the monsters and figure out what's been going on.\n\nIt's not something I'll want to play too often, but a few times a year with the right group will give a pretty good time.\n\nThe main issue here is that the game doesn't quite know what it's trying to be though. It mostly tries to give you a feeling of exploration, as you are offered many choices to interact with objects and tokens and find new rooms, etc. However, the game doesn't give you enough time to interact and do everything in a scenario, so winning relies on doing the right things. Only it doesn't tell you for sure what those are. You have to sort of intuit it based on the flavor text and clues you've been getting. Which...like doesn't fully work, you have to intuit the same way the designers want you to, which isn't at all guaranteed, and now you can't just explore and check things out unless you want to repeatedly play a scenario, which is sort of what you have to do to learn how to win.\n\nWhich puts this close to my issues with Betrayal at House on the Hill, which also tries to be a good storytelling game but confuses itself and puts way too many rules and decisions on the players then that get in the way. If you want to be a strategic/tactical game with many meaningful choices, that's one thing, but you have to then inform players to allow them to make said choices. Otherwise if you want to allow exploration and story to take to the front, you've got to not put timer pressure or as many gameplay elements in the way. Trying to do both doesn't really work well here--you can't have a great strategic experience with so much obfuscated, but you can't have a great exploration experience with so much pressure from the game/strategy elements limiting what you have time to explore.",
    "timestamp": 1679094000
  },
  {
    "username": "ashkai",
    "rating": 5.0,
    "comment": "This has the same problem as a lot of fantasy flight coop games. The story is not very interesting.\n\nIt is a coop game that includes madness cards that make players turn on each other.\n\nThe puzzles are scenario based, so you can not pick to not have certain ones included that people do not like.\n\nSometimes you feel like you have a pointless turn.",
    "timestamp": 1678489200
  },
  {
    "username": "keekohmygod",
    "rating": 5.0,
    "comment": "Game Plus Tarot\nMayday Mini American",
    "timestamp": 1676674800
  },
  {
    "username": "Pevsfreedom_",
    "rating": 5.0,
    "comment": "The game is entirely (5-10x) too long for what it is. There are hardly any methods of dice mitigation. The stories are bad. The miniatures are beyond bad. I can't see why I'd ever play this over Arkham Horror LCG, or anything else in this canon to be honest. A nightmare to play.",
    "timestamp": 1676242800
  },
  {
    "username": "Herakleitos",
    "rating": 5.0,
    "comment": "I am disappointed. I should love this game. It just didn't go over well with my group. I'm not sure what to say about it, except that the AI was not swift enough in eliminating us. What resulted was an excruciating slog. I wonder whether we messed up some rules.\n\nI love the idea of the 'insane' traitors. I also dig the app integration. But it just didn't engage us when we tried it. Maybe I'll have to play someone else's copy in the future, in order to re-evaluate my thoughts about this game.",
    "timestamp": 1675119600
  },
  {
    "username": "Stylemys",
    "rating": 5.0,
    "comment": "I get what the appeal is, I just don't feel any of it.",
    "timestamp": 1674514800
  },
  {
    "username": "T3mb4",
    "rating": 5.0,
    "comment": "Koop",
    "timestamp": 1670886000
  },
  {
    "username": "KnittelMan",
    "rating": 5.0,
    "comment": "Very fun and easy to set up. Easy rules, yet feels deep. Only reason I don’t rate higher is because I feel like the “evidence” and “mystery” is kinda pointless. You don’t have to actually figure anything out. It feels like an app based version of Betrayal at house on the Hill in a way. I wish they could update the app to make it where the evidence you have plays more of a role to figure stuff out, make it so the options you choose actually matter, and make more puzzles.\n\nEasy to introduce people too and overall I love the app",
    "timestamp": 1670108400
  },
  {
    "username": "chriskaspar",
    "rating": 5.0,
    "comment": "It needs an app which is a cool idea, but I like board games that don't need digital. Hit snags installing the app. Very short for the amount of money you pay for it.",
    "timestamp": 1668294000
  },
  {
    "username": "Ardsami",
    "rating": 5.0,
    "comment": "Felt a bit too boring last time. I just sit there waiting for my turn and then all I do is walk into a room and reveal some secret or item. There is no strategy or fun elements.",
    "timestamp": 1663538400
  },
  {
    "username": "Railanbrandelero",
    "rating": 5.0,
    "comment": "Até traz uma atmosfera boa mas peca em prolongar demais a jogatina . Jogamos um caso durante 5 horas. No fim não aguentava mais jogar . Fico pensando que talvez seja o caso que pegamos. Penso em jogar novamente se mudar minha opinião aumento a nota",
    "timestamp": 1662760800
  },
  {
    "username": "D_whatever_kills_it",
    "rating": 5.0,
    "comment": "Wish it had a non-app mode like 1st ed.",
    "timestamp": 1661205600
  },
  {
    "username": "Puppet33r",
    "rating": 5.0,
    "comment": "Pros:\n-easy to get people to play\n-rather simple rules\n-pretty art\n-cool scenarios\n-fan scenarios(search \"valkyrie\")\n-love the insanity mechanic(although it can be hard to make some people actually play around it and not give it away)\nCons:\n-pretty bad scaling with player numbers. Basically app only increases hp values of monsters and that's it. Makes the game way too easy with full party of 5.\n-rather light on content without expansions and collections\n-not a big fan of player elimination rule. It is a horror game damn it. In horrors there is always one or very few survivors. But the game is balanced around it so it would become even easier without it",
    "timestamp": 1660773600
  },
  {
    "username": "Chigatterun",
    "rating": 5.0,
    "comment": "SOLD - Actually really enjoyed this game but impossible to play with two kids that sleep late",
    "timestamp": 1651615200
  },
  {
    "username": "ultimoratio",
    "rating": 5.0,
    "comment": "Good thematic game in which you explore the narrative more than the mechanisms. The lack of deeper gameplay is a con, but allows you to focus solely on the \"experience\" side of the game.\n\nMoM also made Eldritch Horror harder to play. EH is a game with 3 disconnected arcs that takes a very long time to play, offers little coherent narrative, and actually awful fundamental design. While it lacks the global map of EH where you travel the world and see different places, MoM, at least has solid narrative.\n\nThe time duration does take a while though, but I am now preferring an easy-to-grab-&-play pseudo RPG like Mansions of Madness, than to play a proper RPG session.",
    "timestamp": 1646262000
  },
  {
    "username": "brumcg",
    "rating": 5.0,
    "comment": "Loved it after the first play, but the next two... Woof. Too long, too convoluted.",
    "timestamp": 1645916400
  },
  {
    "username": "aggiefanatic95",
    "rating": 5.0,
    "comment": "Liked more than expected, but the all unique pieces, mandatory app, limited scenarios (ONLY 4!), too long play time, left a really leaves a bad taste",
    "timestamp": 1645138800
  },
  {
    "username": "Glic2003",
    "rating": 5.0,
    "comment": "I like how the app tracks some tedious stuff, like the enemy's turn. But I found myself looking at the app screen all the time, making me wonder what the point of the board game was.\n\nGot close to the end of the scenario and were left wondering if we were getting close to winning or if winning was impossible. Unfortunately there was no way to tell.",
    "timestamp": 1644879600
  },
  {
    "username": "Eltjo81",
    "rating": 5.0,
    "comment": "Although I'm a fan of Arkham Horror TCG, this one I couldn.t get into.",
    "timestamp": 1643842800
  },
  {
    "username": "SleepyMeeples",
    "rating": 5.0,
    "comment": "ITs not that the game isnt good, its very enjoyable. The cons are that its far too expensive, the base game only comes with 3 or 4 scenarios and theres only a small amount of purchasable ones that work with the core game. Outside of that you need to buy expansions which are equally expensive as the base game and they too have additional paid scenarios.\nNot to mention the quality of the minis are garbage for a high cost game, and the fact that they secretly remade the molds left a sour taste in my mouth that ensured I would never invest in extra content for this game again. I wanted to love this game and the app I think is very creative. My personal opinion is that its not worth the high cost.",
    "timestamp": 1643670000
  },
  {
    "username": "kesulin",
    "rating": 6.0,
    "comment": "Magnifica ambientación gracias a unos buenos componentes y a la app que narra los eventos. Crea una atmosfera de investigación que pocos juegos consiguen.\n\nPero... la App es demasiado intrusiva. Hay que sentarse con tiempo (3-4 horas) y dispuesto a vivir la película.\nHay escenarios que a determinado número de jugadores son inviables, y no te avisa de ello.\nDeterminadas tramas son aparentemente azar, no hay deducción posible, o yo no la he sabido ver.\n\nAñadir como contras:\n-Poca rejugabilidad\n-Precio exagerado\n-Mala traducción de algunos textos en la app.",
    "timestamp": 1762124400
  },
  {
    "username": "Masi2502",
    "rating": 6.0,
    "comment": "Solid, but not overwhelming.",
    "timestamp": 1762038000
  },
  {
    "username": "NagaFromGhana",
    "rating": 6.0,
    "comment": "I had massive expectations but the game really let me down. At the moment I have only played 2 scenarios so my change may vary with time. I enjoyed the first one (although my 2 games at scenario 1 went a bit longer that I had hoped for). The second scenario is completely broken at 2 players. It is just way too hard to win, even when you roll perfectly with dice (and often you won't). In my opinion this is not acceptable in a core set with only 4 scenarios at the price is being sold. The theme is delivered very well through the app but that's not enough for me with this gameplay.",
    "timestamp": 1761429600
  },
  {
    "username": "Antatrix",
    "rating": 6.0,
    "comment": "+ Beyond the Threshold",
    "timestamp": 1761084000
  },
  {
    "username": "manx1",
    "rating": 6.0,
    "comment": "Dungeon crawlers are too fiddly for me. I don't care for Lovecraft themed games in general. The app works well and elevates the game. Only keeping this because my loved ones enjoy it.",
    "timestamp": 1760565600
  },
  {
    "username": "pralat",
    "rating": 6.0,
    "comment": "A Lovecraftian horror experience you share with a group of friends. Only a handful of scenarios available in the core box. Mixed feelings about how much of the game happens inside the app.",
    "timestamp": 1759788000
  },
  {
    "username": "Saume",
    "rating": 6.1,
    "comment": "It's ok. It's a lot of dice rolling and a little bit of exploration and story telling, but it ultimately all always ends in dice rolls.",
    "timestamp": 1756764000
  },
  {
    "username": "adi_venturer",
    "rating": 6.0,
    "comment": "I don't this is a bad game by any means, I am big fan of this universe and games like Cthulhu DMD, Eldritch Horror, Arkham Horror LCG etc. This one however, may not be for me, mostly because it relies too much on the app. I am not opposed to companion apps in games at all. In fact, I quite like games that use them, but only when they use them in a supporting function - like Search for Planet X, Freelancers, any game using Foreteller, PostCurious games etc. These apps are mostly used for answer checking, looking up hints, and audio narration. MoM incorporates its app to the point where it feels like I am playing a video game and not a board game. This comes down to personal preference but I'd rather play any of those other games set in the Lovecraft universe.\n\n(Plays: 1)",
    "timestamp": 1756418400
  },
  {
    "username": "babimanis1",
    "rating": 6.0,
    "comment": "gift",
    "timestamp": 1756072800
  },
  {
    "username": "AwMar",
    "rating": 6.4,
    "comment": "The more I think about it the more I can't stop seeing all the ways this game is misguided in its design. I like it nonetheless.",
    "timestamp": 1756072800
  },
  {
    "username": "Txirristra",
    "rating": 6.0,
    "comment": "Steam",
    "timestamp": 1755640800
  },
  {
    "username": "quash2772",
    "rating": 6.0,
    "comment": "Mechanics need to be streamlined a bit, this one is a bit hard to get to the table. The app is amazing, we cast it to the tv!!",
    "timestamp": 1755381600
  },
  {
    "username": "ditterio",
    "rating": 6.0,
    "comment": "I don't like the app and I don't like the game. For me, it felt like the choices didn't matter. You walk into a room and something random happens.",
    "timestamp": 1755208800
  },
  {
    "username": "mpires",
    "rating": 6.0,
    "comment": "Pretty standard game packaged in a Lovercraft world. Components are so so, but functional. You play as investigators and suffer through physical and mental damage using hit points. An app generates events and the monster appearances. As time progresses the difficulty increases. All very mild, simple and boring after a few plays. All in all a very uninspiring game.",
    "timestamp": 1755208800
  },
  {
    "username": "memento_mori_92",
    "rating": 6.0,
    "comment": "I hate that you have to solve actual puzzles in this game. Totally removed the tension of the moment when you are in the midst of a horror setting and spend 40 minutes solving a puzzle on an ipad. Awful. Terrible disappointment.",
    "timestamp": 1755208800
  },
  {
    "username": "dabruuzer",
    "rating": 6.0,
    "comment": "Decent enough game, but the absolute worst minis I have ever encountered.",
    "timestamp": 1754949600
  },
  {
    "username": "jlwstone",
    "rating": 6.0,
    "comment": "I have to give this game a '6' because it's SOOOO BROKEN. But, I love it so much. Probably my most played game because everyone (kids, non gamer friends) asks to play it. They won't play anything else. Based on that popularity alone I left this at a 6 and not a 3.",
    "timestamp": 1754258400
  },
  {
    "username": "Katastrophy9",
    "rating": 6.0,
    "comment": "~ Own digital version on Android (Companion app)",
    "timestamp": 1753653600
  },
  {
    "username": "Alienimator",
    "rating": 6.0,
    "comment": "Played: Main Game -> 1x\nPlayers:   \n\n- Replayability:           -> \n\n- Fun:           -> \n\n- Social:           -> \n\n- Art:           -> \n\n- Theme:           -> \n\n- Components:          -> \n\nBonus:\n\n- Difficulty (Easy < - > Hard):          \n\n- Length (Short < - > Long):          \n\n—— Quick Notes:\n+ Atmosphere is quite thematic and engaging. Gameplay is intense and fun. App is very nice and easy to navigate.\n- Way too long and several dialogues get repeated way too often making the second half of even the shortest scenario boring. The boring samey art isn't helping either.\n\n-> Final Score:           -> \n\nBackpack is packing…",
    "timestamp": 1752098400
  },
  {
    "username": "authentic",
    "rating": 6.0,
    "comment": "Mansions of Madness is a good game that costs too much. I found it unused at a thrift shop with an expansion for a steal. The great part of this game is getting it to the table quickly and having a more accessible Lovecraftian experience than the Arkham Horror card game. The first hour or two of this game is really, really fun and nails the Lovecraftian vibe. But then most of them devolve into \"can you smack all the monsters in time,\" which just isn't Lovecraft. Another downside is that there aren't that many scenarios and you can basically get an identical version of a scenario when you set up the app again. This is especially a problem when some scenarios are easy if you know exactly where to go from the start, but very hard if you have to just explore. In the card game, you fail forward, but with these individual scenarios, you just reload it, and then are unhappy to discover it's super easy this time. These issues keep it from being a top tier game for me, like the Arkham Horror card game is.",
    "timestamp": 1751925600
  },
  {
    "username": "cornbreads",
    "rating": 6.0,
    "comment": "Gave it away",
    "timestamp": 1751752800
  },
  {
    "username": "Virlux",
    "rating": 6.0,
    "comment": "3d printed token holders",
    "timestamp": 1751666400
  },
  {
    "username": "bhudson1972",
    "rating": 6.0,
    "comment": "This does not live up to the hype. The app does a good job but not what I want. After a session, I felt more like I played a video game than a board game. The characters are not nearly as distinct as they are in the LCG. The gameplay just felt chaotic.",
    "timestamp": 1750543200
  },
  {
    "username": "finallyiamnoone",
    "rating": 6.0,
    "comment": "sorry, MoM, we just didn't click...",
    "timestamp": 1750197600
  },
  {
    "username": "The_LoneWolf",
    "rating": 5.8,
    "comment": "+ Really thematic and immersive experience\n+ Scenarios doesn't drag, felt variable and enticing, like \"what will happen next?\"\n\n= Still none of the base scenarios had any huge cliffhanger nor unexpected plot twist\n= Gameplay could start to feel redundant after a bit cause you are kinda repeating the same things, same tests for the same abilities check or combat check\n\n- Personally I really felt the gameplay a bit dull\n- Lack of interesting decision, it's almost a point and click adventure, but without interesting enigmas, there's a couple puzzle but whatever",
    "timestamp": 1749765600
  },
  {
    "username": "Robwest666",
    "rating": 6.0,
    "comment": "Seems like it would be a good game but not our cup of tea. Very similar to the Arkham Card game but with models and a app.",
    "timestamp": 1748556000
  },
  {
    "username": "El_rincon_de_javi",
    "rating": 6.0,
    "comment": "El uso de la app te saca totalmente de la partida. Historia lineal sin decisiones reales,",
    "timestamp": 1748556000
  },
  {
    "username": "pickboy87",
    "rating": 6.0,
    "comment": "Alright, where to begin with this one. I'm a huge Arkham Horror fan and while I enjoyed the original Mansions of Madness, it was a major pain in the ass to set up, less fun for the GM and if you fucked something up, you could break the game. This alleviates all of the set up, the app controls a lot of the game and everyone gets to play.\n\nI have a lot of positives for this and a lot of negatives. First off, the game is quite luck based. Everything comes down to a die roll. It's quite often click on a token, roll some dice, see if you succeeded or not. Do something else. That's fine as a concept, but the game is often like 2-4 hours long. In a 30-45 minute game, fine. But after 3 hours of basically clicking on a search token, rolling some dice and seeing what you get, it's gets a bit stale. Sometimes you'll have a twist, but it's often running around, grabbing search tokens and taking care of monsters if need be.\n\nYou only have 4 scenarios in the base game and each expansion that is included after only includes 1 (or 3 for the large) scenario. I'd be more than happy to buy some cheap DLC and just use the tiles/monsters that I have in the game already instead of paying $40-70 for a few extra of each. I'm unsure of how replayable each scenario is once you figure out the \"trick\" behind it even with the variability of the app randomizing some of the tiles and monsters, etc. The scenarios are also often incredibly long. I don't want every scenario to be 2+ hours long and it seems anything less than 2 hours just doesn't exist.\n\nThe game also focuses heavily on the app. Outside of having monsters and figures on the screen, the rest of the game is literally moot. You're so glued to the app, it's hard to focus on the board. I'd suggest keeping it to one person and having them control the app as a kind of DM. They'll still be invested in the game, but much less so than the other players.\n\nI've had a lot of fun at times with this, but it really is more of a light romp with very little thought behind it. Again, fine for an hour long game, less so for 2-4 hours. I'm curious to see how Valkyrie works in regards to how good the content is.\n\nI have all the expansion content, just need 2 more of the DLCs, but somehow I only have the investigators from suppressed memories. Fucking annoying, and technically I can fudge the tiles, but it's obnoxious. I don't even know how I ended up with those.",
    "timestamp": 1748124000
  },
  {
    "username": "H00T",
    "rating": 6.0,
    "comment": "I don't like games that boil down to dice rolling for successes and failures and this game is exactly that. The dice rolling becomes very repetitive and boring. Odd production choice with the miniature and base system. Finding the right tiles and correctly orienting them per the app is annoying. The app integration, while good, distracts from the board so much that the board almost feels unnecessary. Played twice with four players and felt like we were all just staring at a tablet screen, especially when you need to solve the app-based puzzles. I play board games to disconnect from screens, so this was an overall miss for me, even though I love the theme. [SOLD]",
    "timestamp": 1747605600
  },
  {
    "username": "eddy_sterckx",
    "rating": 6.0,
    "comment": "2024-11-16 : First play. I'm not really a fan of app-driven games, so I wasn't expecting much, but this game turned out to be a pleasant surprise. The scenario (Shattered Bones) had an internal logic to it, that we should have figured out sooner, but you can't fault a game for that. So we lost, but that was deserved.\n2025-02-08 : We played Cycle of Eternity and it was again a delight, some puzzles, some combat. We were well organized and prepared this time and actually won.\n2025-05-17 : The shine is wearing off - dropping this from an \"8\" to a \"6\" due to the game becoming samey and outstaying it's welcome.",
    "timestamp": 1747519200
  },
  {
    "username": "Drewkas",
    "rating": 6.0,
    "comment": "When I first left a comment here, i gave this game a 4/10 because I felt I didn’t get what I paid for. I mean, I’ve gotten games I didn’t like before, but that was because they were meant for a different kind of player—I don’t blame the publisher for that. But this game only comes with 4 scenarios, and since they seem to take at least 2x longer than listed, the scenarios listed at 2-3 and 4-6 hours seem unplayable. Moreover, all the plastic in the box is pointless. The cardboard tiles here just work so much better than the monster minis that I’ll never be using the minis. They should have been an optional add-on. I’ve been really happy with my Fantasy Flight purchases until now. This one, though, has me feeling ripped off.  If you get this, get a used copy at a good price (20-30$ might be reasonable). What I paid, $80, is insane for what’s included here.\n\nIt’s been been a very fun experience though. I like the integration with the app. I like the engagement. It’s got some fun puzzles and it’s not just a monster basher. The playtime is an issue though. The first few times we played, we got into the theme and read the flavor text, which was awesome, but that made the scenarios last 3x longer than listed!! — no joke! Apparently you have to skim past all that flavor text to even get close to going below 2x the listed play time.  They should have included many more shorter scenarios. If they did, this would easily have been a 8 or 9/10 experience. Unfortunately the publisher really missed their mark.\n\nI've increased my rating from a 4/10 to a 6/10 because of the fan-made scenarios which are accessible via the Valkyrie app available for free online. Definitely check this app out.",
    "timestamp": 1746396000
  },
  {
    "username": "Destrio",
    "rating": 6.0,
    "comment": "Like the option for full cooperative but despite how good the app is designed it can't replace a human opponent and the variable setup in the first edition for replay value. Feels like it may have less replay value than even the first edition.",
    "timestamp": 1745964000
  },
  {
    "username": "Aruwen",
    "rating": 6.0,
    "comment": "quite some potential",
    "timestamp": 1745272800
  },
  {
    "username": "goodjesse",
    "rating": 6.0,
    "comment": "I was staunchly opposed to app assisted games until I played this. Instantly one of the best and most memorable gaming experiences I’ve had.\nFantastic solo game, fantastic group game.\nI find the game to be too hard solo with only two investigators.\nThe game is too hard for 3 investigators too... and 4.\nOkay, the more I play this game the less I like it. Any difficulty rating above 3 stars is WAY too hard. There is no chance of winning on your first run and that sucks because the game is always most thematic and immersive on the first play of a mission. I find myself ignoring the theme on repeated play throughs, the objective is to meticulously memorize every detail of what is to be done on any given mission then play it repeatedly hoping for a perfect run to stand a chance to win.\nI'm either going to stop playing it altogether or house rule to give my characters more actions per turn.\nI initially gave this game a 10/10, it is slowly and steadily sinking.",
    "timestamp": 1744840800
  },
  {
    "username": "DexGeek",
    "rating": 5.8,
    "comment": "Owner: Dex & Katie",
    "timestamp": 1744754400
  },
  {
    "username": "Sanife",
    "rating": 6.0,
    "comment": "I really enjoyed this game initially and so did my friends. We played 3 different scenarios together and started to notice that despite the different setting and monsters, the game gets very repetitive. I found it frustrating that in scenarios where you hardly get to fight I got super strong weapons, and in scenarios that were combat heavy the weapons were usually laughable. We always opted for Tommy who starts with a gun with 4 damage.\n\nThe game is very unforgiving and you often end up needing one more action to get to do anything (you only get 2 each round) before the game starts getting difficult. Our last game we lost after being told that we took too long! We were getting rubbish dice rolls on tests and were one puzzle solution away from completing it. Needless to say, we are not playing again.\n\nOverall, I liked the app which made set up and mythos phase easier. I like some of the scenarios and the theme is great, but even at 3/5 difficulty the scenario felt really hard. The insane condition added an interesting twist which led to many a joke during our playthroughs where one of my friends had kleptomania as one of the horror cards and also had a similar condition when they became insane.\n\nFinal verdict: game with a great potential but very unbalanced, difficult and repetitive",
    "timestamp": 1744408800
  },
  {
    "username": "larrydurbin",
    "rating": 6.0,
    "comment": "Why do board game publishers think those silly globs of gray plastic are scary? They're not. Please publish your games in full color so we gamers can have an immersive experience. Had to sell this game , for that reason. If they ever reissue this game in full color. I'll rebuy it.",
    "timestamp": 1744236000
  },
  {
    "username": "lowkey2_2",
    "rating": 6.0,
    "comment": "Excellent ideas tainted by over-reliance on dice rolls and the app.",
    "timestamp": 1741388400
  },
  {
    "username": "jollypirate",
    "rating": 6.0,
    "comment": "More of an experience than a game, but the app is kind of neat and adds flavor to even combat and such. A once-a-year kind of game for me.",
    "timestamp": 1741129200
  },
  {
    "username": "jacobderosenoir",
    "rating": 6.0,
    "comment": "This is very good game that I had rated 9 on my first two scenario as the story was VERY engaging. Then I brought it down when I realized that there is a bit too much luck involved. If you do not open the right door early on and move out, missing one essential components, you end up at the other end of the board, not having enough time to trace back that door and have to restart the whole 2h00 scenario",
    "timestamp": 1740351600
  },
  {
    "username": "Hazlazm",
    "rating": 6.0,
    "comment": "UPDATE: I now find it quite boring and it's frustrating/exhausting having to keep adding tokens, finding the correct tiles while tapping \"continue\" on the phone constantly. Sold.\n\nI dig it! It's immersive, the app is easy to handle, love the background music/ambient noise, the theme is awesome and I find the gameplay solid.\n\nIt has some downsides though:\n\nI've only played 2 scenarios so far. I think replayability will be limited but we'll see.\n\nThe core box should have had more content due to its price.\n\nThe miniatures and the large, ugly bases are a big minus for me. You're required to glue some miniatures to their respective bases but most miniatures have a peg which you insert into a base. You should glue all of the miniatures though because the ones that has pegs easily fall off. You're also supposed to slide their respective tokens into the base. Some tokens are a good fit, some slide out of the base at a certain angle. Who thought this was a good idea? If they had to include miniatures, why not just create cards for the enemies? Or create solid miniatures with small bases, like most miniatures are, then place their token next to it when it's put on the map? The bases look like crap too.\n\nWhile I like the horror/damage mechanic I also find it quite clunky.\n\nBut all in all, as I said above, I dig it.",
    "timestamp": 1739401200
  },
  {
    "username": "sn00z",
    "rating": 6.0,
    "comment": "To slow",
    "timestamp": 1737068400
  },
  {
    "username": "gonza7alv",
    "rating": 6.0,
    "comment": "Mola, la falta un poco de ritmo con el tema de la app",
    "timestamp": 1736722800
  },
  {
    "username": "Valcurdra",
    "rating": 6.0,
    "comment": "Easily the best of the cuthulu themed investigation games.\n\nThe app really adds to the story telling aspect without taking over the board game feel. Also adds to replayability through some randomisation.\n\nLove the real puzzles and real investigation that the game requires.\n\nStill not much to combat, mostly just boring roll to resolve stuff. If they had come up with something more for combat this would have really made a difference.",
    "timestamp": 1736031600
  },
  {
    "username": "adrianlemess",
    "rating": 6.0,
    "comment": "1 - 5 players\nPortuguese",
    "timestamp": 1735340400
  },
  {
    "username": "SkyGlad",
    "rating": 5.5,
    "comment": "Too long. Puzzles take me out of the theme. Excellent theming otherwise, though. Don’t love how many of the insanity cards add a hidden traitor aspect.",
    "timestamp": 1734908400
  },
  {
    "username": "willport3",
    "rating": 6.0,
    "comment": "all boards and rule books in mansions of madness box, all minis and chits in large tackle box",
    "timestamp": 1734476400
  },
  {
    "username": "NurseRuben",
    "rating": 6.0,
    "comment": "Beautiful art and scary atmosphere. Unfortunately, it is too long and has a lot of components to keep track of, especially when you have all the expansions.",
    "timestamp": 1734303600
  },
  {
    "username": "PARTYTANK",
    "rating": 6.0,
    "comment": "An easy to teach and fun to play game. A Halloween spooky favorite.\n\nPros:\n- Easy to teach and play\n- The app is a neat way to interact with the game.\n- Each story has a pretty great theme.\n\nCons:\n- The minis and their chunky bases are the worst.\n- The puzzles can be downright awful at times.\n- The app can, at times, take away from the board play.",
    "timestamp": 1733094000
  },
  {
    "username": "Larry Chong",
    "rating": 6.0,
    "comment": "At its core, this design is similar to Arkham Horror. This version comes with an app (which any app-based game requires servicing for future growth). I think I like this design a little more since I love the scenario-driven dungeon crawl. When you take mental or physical damage, it is in the form of a card, which gives you limitations or requirements applied to your character (similar to Nemesis games).\n\nThe cons of this system is that it takes a lot of time to find & build out tiles, find cards when situations arise and organizing all the components/cards/minis takes quite a bit of administrative game time. Additionally, more players is more fun but also consumes more game time and thus the scenario takes longer to complete. But it really helps, when you're with the right crowd, who has the expertise to share the administrative workload, and cuts down the lag time. Bottom line: I love the immersive and thematic experience this type of game brings out so I'm usually in the mood to play it if I have the allotted time to finish.",
    "timestamp": 1730156400
  },
  {
    "username": "xixi_233",
    "rating": 6.0,
    "comment": "3,4",
    "timestamp": 1729461600
  },
  {
    "username": "magicfreak39178",
    "rating": 6.0,
    "comment": "Usually a good time, but its a little too heavy for most game nights, and not interesting or strategic enough for big game nights.",
    "timestamp": 1727992800
  },
  {
    "username": "utahman06",
    "rating": 6.0,
    "comment": "The experience was way too long. Some of the stuff we were investigating just seemed like arbitrary, random chance. Some of the components (minis) are horrendous. A classic FFG insert (i.e. not an insert). I'm also just not a fan of the skill check mechanism all these FFG Cthulhu games seem to be built with.\n\nApp was cool. There are some interesting ideas here. Very immersive game. It was overall a decent experience. I'd probably play again if someone really wanted to, but I'm not anxious to do that.",
    "timestamp": 1727820000
  },
  {
    "username": "dr4gonfly",
    "rating": 6.0,
    "comment": "good, uses app to manage story",
    "timestamp": 1722636000
  },
  {
    "username": "Balleflass",
    "rating": 6.0,
    "comment": "One of the best dungeon crawlers I have ever played as it's focused more on the solving of puzzles and mysteries in addition to a great app that randomizes a lot of things.\nThis leads to a great atmosphere as there are no physical or digital tracks that tells you how close to danger you are, and you build the \"dungeons\" while you play to not give anything away at the start.\n\nSold it as I've played through it all and it takes quite a lot of space.\nAlso, outside of the puzzles, the spellcasting mechanic and procedural map I found the combat itself to be a little bit too simple.\n\nThe replayability is low in my view even though you can play different investigators and that the app randomizes the map and items.\n\nI prefer playing Arkham Horror 2nd edition over MoM2 and AHLCG as it gives me more of the roleplay feel without having a DM (just like MoM2 and AHLCG), but it's more of a sandbox that plays fast even with more players.",
    "timestamp": 1722549600
  },
  {
    "username": "sighlance",
    "rating": 6.0,
    "comment": "With each play, I like this game less. Although it has the perfect theme for me, namely exploring a house of horrors, the mechanics of this game too often result in a disappointing experience.\n\nThe frequent attribute tests in the mythos phase are annoying and are a clumsy way to provide a timer for the game. When you have dropped an item 5 times in a game through some \"mysterious force\", it is no longer funny. Also these tests feel totally random, because they force a random character to test a random attribute, which you cannot influence except by spending clue tokens, which are also given out randomly. All the items you get that are supposed to help you performing those tests are also mostly random drops, so you might only get items that are useless to you, and there is not enough time in the game to do a lot of trading between the players. 3 of the sides of the 8-sided dice for attribute tests are blank, so you are rolling a lot of frustrating misses.\n\nIn some scenarios, you have investigated for 4 hours, only to hit a hidden threshold were the game transforms from an exiting clue hunt into an unwinnable, boring combat situation, still including those stupid random attribute tests in the mythos phase each round. We quit several scenarios after this point, because we were too disappointed and bored to continue.\n\nThere is no undo button in the app, so if you accidentally click on something, you might break your progress from the last 2 to 4 hours. You can't change the difficulty of the game and the difficulty rating for each scenario is not accurate for all player counts, so you might pick an \"easy\" scenario and still get destroyed with only 2 investigators. It needs a \"I want to experience the story\" difficulty like the Arkham Horror LCG and / or some better scaling.\n\nOn that topic: This game does not work well as a 2-player game with each player controlling a single investigator. All scenarios get much more difficult and you are just running around much more, as the number of places you need to go is basically the same as in a game with 4 investigators. So expect to loose often or just use 2 investigators each (which I personally don't enjoy).\n\nThe game has some really cool scenarios and the theme and replayability are great, but it is the game's mechanics, the huge amount of randomness and the annoying mythos events that kill this game for me.",
    "timestamp": 1722290400
  },
  {
    "username": "Dylanicus",
    "rating": 6.0,
    "comment": "I love Mansions and will rarely say no to a game. However, I have played all the scenarios I can play (I have not purchased the two expansions that are crazy expensive on ebay or the like). So it doesn't get much playtime anymore except with new people who have not experienced it yet. Also while I love miniatures, sadly the miniatures for mansions tend to live in the expansion box, and I just use the square tokens for them. It is too much of a hassle to pull them out and put them on bases, especially when most games only have a couple of monsters to pull out.",
    "timestamp": 1722204000
  },
  {
    "username": "ChillernChurchill",
    "rating": 6.0,
    "comment": "Its a fun experience, but its not often me or my playgroups first pick, but the experience is always good. There are just better games out there.",
    "timestamp": 1720908000
  },
  {
    "username": "aooz",
    "rating": 6.0,
    "comment": "I think the app-assisted piece of this game just makes it feel too clunky.",
    "timestamp": 1719352800
  },
  {
    "username": "redisher",
    "rating": 6.0,
    "comment": "Good Arkham Game but i hate dices",
    "timestamp": 1717279200
  },
  {
    "username": "Youngdog",
    "rating": 6.0,
    "comment": "This game's creators lacked just a dash more innovation in technology. App, the app is what I'm talking about. So this game takes longer than it should and this game could be twice as fast, half as long if in the app each player could on their device login and play simultaneously, especially if players split up. Giant missed opportunity, very disappointing.\n\nMiniatures suck, just use the tiles.\n\nOtherwise the game is great, really puts you in the theme.",
    "timestamp": 1716674400
  },
  {
    "username": "Stevemould",
    "rating": 6.0,
    "comment": "I've enjoyed my games of this, but I do think it's an expensive package for the limited number of scenarios. The app integration is about as well done as I've seen it and there are clearly a lot of ideas going on here. I'm generally positive on it as an experience, but am likely to move it one rather than invest in more content.",
    "timestamp": 1715292000
  },
  {
    "username": "frenchyoman",
    "rating": 6.0,
    "comment": "On cherche des indices, on est poursuivis par des monstres et on fait se qu'on peut, tout ça en équipe. Jeu plus collectif que coopératif, mais on se laisse porter.",
    "timestamp": 1713996000
  },
  {
    "username": "ksilobait",
    "rating": 6.0,
    "comment": "app doesn't track or give enough information (like what is adjacent, how far is the \"distance\" and so on)\n\nif I play solo with 2 players the game is too difficult (all scenarios I've tried - at the end the game just spawns a lot of monsters while I'm already on the brink of death)\nand if I add more players for solo game, it becomes more tedious to keep track who is where and which\n\nthe game could be more fun and fast but there are so many small issues (mostly how the game is not streamlined) that I hate but still like the game at the same time\n---\noverall: unique experience, too long, too difficult (random and uncontrollable)",
    "timestamp": 1712527200
  },
  {
    "username": "akjrabe21",
    "rating": 6.0,
    "comment": "Fun playing with an app guiding the game, can be a good social get together and team building game, but feel like there are better games out there with similar game mechanics. That being said the app piece is unique and makes it worth playing for many",
    "timestamp": 1712008800
  },
  {
    "username": "ShaggyDevil",
    "rating": 6.0,
    "comment": "Jul 2023: 7",
    "timestamp": 1711839600
  },
  {
    "username": "abnormalize",
    "rating": 6.0,
    "comment": "По сути этой игре не нужна игра, почти все происходит в приложении и это очень неудобно. Неудобно искать тайлы которые никак не пронумерованы, неудобно проходить проверки, которые каждый раз на разные характеристики, неудобно менеджить большое число врагов. Сами сценарии при этом не шибко интересные и с запасом проигрывают карточному ужасу аркхэма. В это можно играть, но желательно в TTS или если ведущим будет другой бедняга.",
    "timestamp": 1711062000
  },
  {
    "username": "Edualk",
    "rating": 6.0,
    "comment": "I know it's a classic, but I wasn't hooked at all. The problem lies with me, I simply don't like board games that require an app to play.",
    "timestamp": 1710457200
  },
  {
    "username": "Smeef",
    "rating": 6.0,
    "comment": "Fine but takes way too long for what it's worth",
    "timestamp": 1710284400
  },
  {
    "username": "yambab",
    "rating": 6.0,
    "comment": "75",
    "timestamp": 1707174000
  },
  {
    "username": "Creativenothing",
    "rating": 7.0,
    "comment": "The most thematic game I've played, feels like you're living inside the game world. It's story rich, easy to play and the hours go by quickly from being so immersed in the experience. The setup is slightly on the longer side but the game is a very easy teach. The app does the vast majority of the heavy lifting for you.\n\nThe game does have it's issues, some insanity cards end the game early, or are just not fun. I would suggest removing the 2 game ending ones + the 1 card that means a player can't speak for the rest of the game (not appropriate for a co-op game of this length). Most of the ideas the designers had for insanity are decent but these few cards seem like an oversight and should have been changed or removed on testing.\n\nMansions has its highs and lows, not everything is perfectly balanced, not all the scenarios are equal in their level of fun, but everything put together still creates some of the most memorable experiences in gaming.",
    "timestamp": 1762602900
  },
  {
    "username": "Shaunmood",
    "rating": 7.0,
    "comment": "This is one of those games that you cant take too seriously otherwise you will hate it. This is not a TTRPG with depth. Its more of a dungeon crawler with some bells and whistles and is fun way to introduce people into the deep end of real board gaming.\n\nProtip: DO NOT USE A CELLPHONE AS THE MAIN SCREEN FOR AN APP. You will kill thhe experience altogether. At the very least use a decent size tablet or if you're lucky enough to have a spare TV you can mirror a tablet or a cheap minipc which is the route I went and it adds a huge level of immersion.",
    "timestamp": 1762297200
  },
  {
    "username": "sparkgamer",
    "rating": 7.0,
    "comment": "Sold\n\nMy tastes have shifted over the years, and while this game is fantastic, and the theme pours through everywhere, I have found myself enjoying it less and less.",
    "timestamp": 1761865200
  },
  {
    "username": "tenthirteen",
    "rating": 7.0,
    "comment": "September 2016\nSold October 2025",
    "timestamp": 1761692400
  },
  {
    "username": "SkyeHalon",
    "rating": 7.0,
    "comment": "Beyond the threshold\nNeeds Custom Insert (could be solved with a specific container)\nPaint Minis\npad for including 1st ed.",
    "timestamp": 1761084000
  },
  {
    "username": "WaldoJeffers",
    "rating": 7.0,
    "comment": "5 Players",
    "timestamp": 1760652000
  },
  {
    "username": "MoMahili",
    "rating": 7.0,
    "comment": "Keep",
    "timestamp": 1759874400
  },
  {
    "username": "CosmoVibe",
    "rating": 6.8,
    "comment": "It's a decent Lovecraftian adventure game, about what you would expect from Fantasy Flight games, but the devil is in the details.\n\nFor starters, the game is pretty straightforward, it doesn't have the kind of strategic depth that the card game has, but the benefit of that is it makes the game much more accessible.\n\nI'm generally an anti-app kind of guy unless it offers something really unique to a game experience, and while the app is not bad here and does in fact take care of a great deal of interesting, balancing, and randomization options, it also leaves something to be desired. Why does the game only come with 4 missions? Why do I need to pay even more for DLC on top of that? In fact, why isn't the entire game just a video game to begin with? If the point is the tabletop experience, I still find that the app takes up quite a bit of attention and makes up most of the gameplay, which results in everyone trying to crowd around a screen. The miniatures are also kinda ugly (maybe because they're just not painted and people look forward to painting them?) and the bases are really bad quality and don't integrate well at all with the game. Fortunately, you can play without the miniatures entirely, but then why am I paying almost $100 for a massive box?\n\nSo while the gameplay experience is fine, it's hard to justify the value proposition here. The experience here is a bit more immersive than the card game, but then I don't really feel like I'm playing a board game. The card game has more depth and is a much better value.",
    "timestamp": 1757973600
  },
  {
    "username": "wingeekbrett",
    "rating": 7.0,
    "comment": "Eine Erweiterung der Ersten Edition?\nZunächst einmal sei vorweg genommen, dass du mit dem Grundspiel dieser zweiten Edition 5 neue Fälle mit Softwareunterstützung leicht von der Hand spielen kannst. Es gibt viele spannende Momente, da man hier auf Erkundung geht und Proben per Würfel bestehen kann. Mit diesem regelleichten Dungeoncrawler fängst du jeden Spieleinteressierten ein, der nicht gerade was gegen Kunststofffiguren ab hat. Beim Material ziehe ich einen Punkt ab, weil man die Füsse der Figuren noch präparieren sollte und diese optisch nicht richtig zum Spiel passen. ...\n\nFür den ein oder anderen könnte das beiliegende Upgradekid spannend sein, weil sich der Wert der ersten Edition erhöht. Wenn du die erste Edition besitzt, kannst du mit Hilfe dieser Erweiterung (Upgradekid bestehend aus Spielmaterial, wie Charakterbögen etc.) einen neuen Fall mit Softwareunterstützung spielen, und zwar Dearly Departed (Im Tode vereint). Die weiteren Fälle der ersten Edition spielt man jedoch ohne Software: 1)the fall of house Lynch 2)the inner sanctum 3)blood ties 4)classroom curses 5)green-eyed boy. Für die alten Erweiterungen der ersten Edition gibt es auch einen neuen Fall, und zwar \"Der Kult von Sentinel Hill\". Damit wird die ganze Serie zu einem Hybridspiel. Im Wesentlichen liegt hier eine Neuauflage mit neuem Spielmaterial und Softwareunterstützung vor, die aber dankenswerter Weise seine Vorgänger wieder mit ins Boot holt. ...\n\nWelche Vorteile hast du als Brettspieler mit der Software:\n- Die Software liefert dir zwei neue Fälle zum Grundspiel und eine Erweiterung (Call of the wild) für die erste Edition. Für die digital unterstützten Fälle mit der ersten Edition gibt es aber auch spezielle Erweiterungen (Recurring Nightmares und Unterdrückte Erinnerungen). Wenn du lediglich mehr Szenarien mit der Software spielen willst benötigst du also nicht das alte Grundspiel oder die Erweiterungen der ersten Edition.\n- auch für den PC verfügbar (großer Bildschirm)\n- stimmungsvolle Musik und Grafik\n- Schaden für die Monster merkt sich die Software\n- Du kannst alle Marker per Mausklick so oft du willst inspizieren, ohne in einem Questbuch nachzuschauen.\n- wesentlich weniger Regeln zu lesen, z.B. entfällt ein Questbuch, das Regelwerk über die Proben übernimmt die Software, der Aufbau wird von der Software gemanaged\n- Falls du mehrere Tage benötigst, genügt ein Photo über die Position der Miniaturen und ein Klick auf \"speichern\".\n- Die Software liefert alle möglichen Spachen.\n- Der Overlord/Dungeonmaster kann ohne Ablenkung mitspielen.\n\nWir haben nun mehr als ein Brettspiel. Aus meiner Sicht stellt die integrierte Software eine sehr gute Unterstützung dar. Mit einem vollwertigen PC-Rollenspiel solltest du den Hybriden allerdings nicht vergleichen, da hierin nicht der Anspruch liegt. Betrachte es als Brettspielzusatz. Für die rein analogen Fälle der ersten Edition gibt es noch keine Integration, sodass man sich durchaus auch diese Auflage anschaffen kann.",
    "timestamp": 1757282400
  },
  {
    "username": "el_sevi74",
    "rating": 7.0,
    "comment": "Escalofriante juego en el que la cordura y la sangre son muy valiosas",
    "timestamp": 1757023200
  },
  {
    "username": "Omnix",
    "rating": 7.0,
    "comment": "An absolutely amazing game which provides a great immersive experience.",
    "timestamp": 1756677600
  },
  {
    "username": "scorpiosue",
    "rating": 7.0,
    "comment": "Boardlandia\n$74.79\n11/10/2021",
    "timestamp": 1756504800
  },
  {
    "username": "Pinchinator13",
    "rating": 7.0,
    "comment": "Cooperative",
    "timestamp": 1756418400
  },
  {
    "username": "mocherill",
    "rating": 6.5,
    "comment": "First impression rating*",
    "timestamp": 1756072800
  },
  {
    "username": "Cam27",
    "rating": 7.0,
    "comment": "Atmospherics from app are great,lots of neat touches but game seems random and not enough guidance where to go.",
    "timestamp": 1755813600
  },
  {
    "username": "Archimicarus",
    "rating": 7.0,
    "comment": "It's like if they did Betrayal but actually curated each scenario to be a compelling experience.",
    "timestamp": 1755727200
  },
  {
    "username": "antonkartashov",
    "rating": 7.0,
    "comment": "2p, 3p, 4p, 5p\n\nComplexity: ●●○ (medium)\nDuration: 120–180 mins (depending on the scenario)\n\nA cooperative horror game based on the H. P. Lovecraft universe, a simplified version of the game “Arkham Horror” (2005).",
    "timestamp": 1755208800
  },
  {
    "username": "Zachfromohio",
    "rating": 7.0,
    "comment": "Great solo game. The stories are a lot of fun",
    "timestamp": 1755122400
  },
  {
    "username": "cinnzel",
    "rating": 7.0,
    "comment": "Lo de que el “máster” sea una app para tablet me parece un gran acierto porque, para quienes tenemos poca imaginación, le aporta profundidad al juego e incluso su propia banda sonora. Sólo lo he jugado una vez, pero me preocupa cuánta rejugabilidad puede tener.",
    "timestamp": 1755036000
  },
  {
    "username": "Marhault81",
    "rating": 7.2,
    "comment": "VENDUTO (con inserto di gommapiuma)",
    "timestamp": 1754863200
  },
  {
    "username": "Faltarf",
    "rating": 7.0,
    "comment": "I don't understand if I appreciate this game due to its app or for its mechanics. However, in my personal opinion, nowadays this is the best boardgame inspired by Lovecraft's work, due to the fact it offers to the players many of the aspects from his books. However, if you buy this game you must know that: 1) you need a Steam account in order to play the mandatory app; 2) for €90 of game, you can play only 4 scenarios; 3) if you desire the others 4 scenarios, you have to spend additional €20 from Steam («Is that you Electronic Arts?»); 4) the game is not balanced - like every Fantasy Flight Games - and it is better to play it with at total of 4 ore 5 players; 5) it could be frustrating due to the high failure rate. In addition, the app is good but there is not an \"undo\" button so you have to pay attention to not accidentally activating the wrong event.",
    "timestamp": 1754863200
  },
  {
    "username": "BoomDooger",
    "rating": 6.5,
    "comment": "Chels: 6\nAnt: 7\n\nIt's good to go back to Fantasy Flight Cthulhu games - there is every ounce of silliness, randomness, and thematic grandeur we've been accustomed to, but this is likely the best showing. The app runs smoothly, even if it comes with a lot of ready, and gives a fine flow to the proceedings. The two action system doesn't feel as stymying as other iterations outside of movement, though the shove mechanic comes in handy way more often than it might seem. One we will come back to if given the chance.",
    "timestamp": 1754776800
  },
  {
    "username": "P3t3 th3 H3at",
    "rating": 6.5,
    "comment": "Sydney No-Ship Auction",
    "timestamp": 1754690400
  },
  {
    "username": "Claytonious",
    "rating": 7.0,
    "comment": "Fun, but simply too challenging",
    "timestamp": 1753567200
  },
  {
    "username": "Tweed6",
    "rating": 7.0,
    "comment": "ES ver",
    "timestamp": 1753480800
  },
  {
    "username": "Grugnur",
    "rating": 7.0,
    "comment": "Very thematic. The music and imagery in the app is fantastic. Very puzzle solving, however very linear. I would give it a higher rating if and when they use a more sophisticated AI to allow more variables and outcomes. But is is so much fun.",
    "timestamp": 1752703200
  },
  {
    "username": "sikflux",
    "rating": 7.0,
    "comment": "In Peoria",
    "timestamp": 1751493600
  },
  {
    "username": "AndryWhite",
    "rating": 7.0,
    "comment": "Same feeling as Cthulhu Death may die but with every actions colorful nurrated and much longer.\n1 scenario -8\n2 scenario -9\n4 scenario -2 - very awful lazy scenario, long, repetative - shame on FFG",
    "timestamp": 1751148000
  },
  {
    "username": "Kokote",
    "rating": 7.0,
    "comment": "Dodatki:\n1. Za progiem\n2. Świątynia świtu\n3. Ścieżka węża\n4. Przerażające podróże\n5. Ulice Arkham",
    "timestamp": 1748728800
  },
  {
    "username": "Orsovico",
    "rating": 7.0,
    "comment": "Many adventures have an emotional setup but fail to deliver in the end. I highly recommend playing with as many people as possible for the best experience.",
    "timestamp": 1746396000
  },
  {
    "username": "Bybbax",
    "rating": 7.0,
    "comment": "Good game with unforunatley low replayability and high price. BUT it's a good gateway game for those who are seeking a coop adventure. App makes setup very easy, removes any fiddling and gives quite a good lovecraftian vibe. solid 7/10",
    "timestamp": 1745964000
  },
  {
    "username": "D3C6",
    "rating": 7.0,
    "comment": "Much better than the original. Far more enjoyable also , because you play against the game and not the player.",
    "timestamp": 1745704800
  },
  {
    "username": "AlanWH",
    "rating": 6.5,
    "comment": "This would be so much higher if I didn't have to play this game with the help of an app.",
    "timestamp": 1743544800
  },
  {
    "username": "Schnuck",
    "rating": 7.0,
    "comment": "gets a little to fidly, and the price with expansions is a little bit to much. Would absolutely love it with cardboard monsters for half the price",
    "timestamp": 1742943600
  },
  {
    "username": "arsonit",
    "rating": 7.0,
    "comment": "Love this game you can replay as u want",
    "timestamp": 1742338800
  },
  {
    "username": "Kasiopea",
    "rating": 8.0,
    "comment": "After first game, I like it, however I will always play now with the Insane cards given to each player so everyone may have different winning conditions. Really cool components, nice atmosphere and scenarios. Using the app all the time is a bit annoying but it also helps a lot and makes it easy to learn.",
    "timestamp": 1762617060
  },
  {
    "username": "bald_bull",
    "rating": 7.5,
    "comment": "- Calles de Arkham\n- Más allá del umbral.\n- El santuario del crepúsculo.\n\n+ No Enf. No nec.",
    "timestamp": 1762470000
  },
  {
    "username": "LordHorst",
    "rating": 8.0,
    "comment": "Nice story",
    "timestamp": 1761692400
  },
  {
    "username": "MegaWestWolf",
    "rating": 8.0,
    "comment": "Kim and I had a really good time playing this together. She basically played a fire hazard, not letting me get down the steps. I did all the damage to the final monster, then died, and Kim hit the kill shot and then ran out the door. Ruthless.",
    "timestamp": 1761606000
  },
  {
    "username": "adigallego",
    "rating": 8.0,
    "comment": "Cooperativo\nVídeo Altru no existe",
    "timestamp": 1761256800
  },
  {
    "username": "dedicatory",
    "rating": 8.0,
    "comment": "Awesome game, much better with all the expansion and DLCs. My top 3",
    "timestamp": 1761256800
  },
  {
    "username": "kagas",
    "rating": 8.0,
    "comment": "[J 1-5] [R 3-4] [P&P]",
    "timestamp": 1760565600
  },
  {
    "username": "Baloo12",
    "rating": 7.9,
    "comment": "After first play:\nI expected less, to be honest. Because we have played Eldritch Horror 25+ times and Journey in the Middle-Earth around 20 as well.\nBut, surprisingly, it was great!\nFirst, the easiest scenario, but pretty hard as expected.\nThe game left an expression of very atmospheric and this is what I like better than in Journey in the Middle-Earth. Also I like dice checks a little bit more.\nDespite of almost going mad on second turn, when we have had met a big snake-like monster, we managed to go to the end and win on the last round.\nAlso I like that every little weapon in the game is felt very important.\nOverall, a great game. Want to play more to explore its potential.",
    "timestamp": 1760306400
  },
  {
    "username": "ChaosXblade",
    "rating": 8.4,
    "comment": "Goal: Storylike/Complete the scenario. You are detectives. Explore rooms, fight off monsters, and work toward scenario goal (discover it as you explore).\n\nHas its charm. App DM and App makes it feel it comes to life. Some house rules with puzzles may be required depending on group",
    "timestamp": 1760306400
  },
  {
    "username": "DefLep7702",
    "rating": 8.0,
    "comment": "Mansions of Madness is a great \"mini\" Cthulhu D&D session, the app really streamlines the DM experience and while some sessions can have random unfair moments happen, its still a blast to play.",
    "timestamp": 1760047200
  },
  {
    "username": "LemonToAKnifeFight",
    "rating": 8.0,
    "comment": "Very unique game with great design. Only problem is that there are few scenarios in the box and expansions are quite expensive. Luckily you can find plenty of stuff on the internet.\n\nAlso the minifig stands are terrible",
    "timestamp": 1759960800
  },
  {
    "username": "Daoshifu",
    "rating": 8.0,
    "comment": "Great idea that disappointed me ultimately in theme.\nMansions usually ends in fighting this,that or the other.\nIn Cthulhu mythos you do not stand a chance fighting.\n\nOther than that one of the best app driven games out there.",
    "timestamp": 1759701600
  },
  {
    "username": "JQR_",
    "rating": 8.0,
    "comment": "My wife and I are really enjoying this as a 2p co-op (each controlling two investigators feels perfectly manageable and better balanced). I rate this as a 8-10 the first time through each scenario, but my enthusiasm is in the 6-8 range the second/third time through. There are many questions of replayibility/value. For me, it is worth it just to play through each scenario until we beat it, and then pull it out again when we have different player counts/groups, or it has been a long time (like rewatching a movie). Bonus value if you want to paint the minis (which my wife somewhat unexpectedly enjoyed, but she is the crafty/artistic one).",
    "timestamp": 1759701600
  },
  {
    "username": "Kerdan1986",
    "rating": 8.0,
    "comment": "Folded Space insert\nЗа порогом (2020)",
    "timestamp": 1759183200
  },
  {
    "username": "xWilcoXx",
    "rating": 8.0,
    "comment": "Theme theme theme",
    "timestamp": 1759096800
  },
  {
    "username": "Rubeus",
    "rating": 8.0,
    "comment": "Este juego es monstruoso, porque está lleno de criaturas lovecraftianas y es una caja muy grande. Preparar una partida es un tanto laborioso y es recomendable tenerlo todo bien ordenado en la caja, más aún si tienes alguna expansión. La aplicación digital oficial está muy bien. En casa lo solemos jugar en las fechas de Halloween y, por ahora, todas las aventuras nos han divertido, aunque una ambientada en un pueblo con un hotel y un puerto (no recuerdo ahora el nombre) es de un nivel de dificultad imposible. Con todo, es un juego muy temático, consigue meterte en la historia y vivirla. En general, es un juego muy caro, con expansiones muy caras, pero muy disfrutable si te gustan este tipo de juegos.",
    "timestamp": 1758664800
  },
  {
    "username": "pureair",
    "rating": 8.0,
    "comment": "Love how things never goes right in this game.",
    "timestamp": 1758492000
  },
  {
    "username": "G4rzilla",
    "rating": 8.2,
    "comment": "Exploration and narrative experience\n\n-Custom insert\n-Painted",
    "timestamp": 1758492000
  },
  {
    "username": "kwhite1",
    "rating": 8.0,
    "comment": "P",
    "timestamp": 1758060000
  },
  {
    "username": "Madleen",
    "rating": 8.0,
    "comment": "Solo player",
    "timestamp": 1757541600
  },
  {
    "username": "Udruga Kockica",
    "rating": 8.0,
    "comment": "KOCKICA 20%\nAl.S. 33%\nBid. 34%\nKut. 13%\n\nobojane figurice by BID",
    "timestamp": 1756936800
  },
  {
    "username": "Bufman",
    "rating": 8.0,
    "comment": "Wait to Play",
    "timestamp": 1756850400
  },
  {
    "username": "bradray",
    "rating": 7.5,
    "comment": "Co-op",
    "timestamp": 1756764000
  },
  {
    "username": "AtomicBomberman123",
    "rating": 8.0,
    "comment": "It will take a few play-throughs to get the rules straight (at least it did for us), but it is a great and atmospheric \"dungeon-crawl\". The app adds a lot of the atmosphere so keep the sound on for the games duration.\n\nThe production value is fantastic (board/cards/miniatures) but then again it is an expensive game.\n\nI would recommended this only to a group of \"role-players\" as some patience is needed. It's a solo mode: 9\n\nThe app \"puzzles\" bugs me a bit, as they seems a bit cheesy and repetitive.\n\nThis is the only game I have ever played solo, and for that it is great ... even the puzzles are ok in that 'mode'.\n\nIt's a solo mode: 9",
    "timestamp": 1756764000
  },
  {
    "username": "Song_of_Shield_Lady",
    "rating": 7.5,
    "comment": "终于久违的开了大黑屋，玩了黑帮剧本，游戏机制带来的探索风味很足，打架无功无过，挺好玩的。",
    "timestamp": 1755554400
  },
  {
    "username": "trilamb",
    "rating": 8.0,
    "comment": "GIVE AWAY",
    "timestamp": 1755468000
  },
  {
    "username": "KSSK34",
    "rating": 8.0,
    "comment": "Coopératif\n120-180 min\n2-4 joueurs",
    "timestamp": 1755381600
  },
  {
    "username": "gunnerCRO",
    "rating": 8.0,
    "comment": "***Expansions: Path of the Serpent, Horrific Journeys, Sanctum of Twilight\nMost thematic and atmospheric Cthulhu game out there. Scenarios are interesting and stories they tell are immersive and compelling hugely due to app (so beware).\nWhere the game lacks are mechanic and gameplay which, although not bad, are lackluster and uninspired. Still, this can be an amazing experience.",
    "timestamp": 1755381600
  },
  {
    "username": "Birdie86",
    "rating": 8.0,
    "comment": "Really good app based game",
    "timestamp": 1755381600
  },
  {
    "username": "oldschoolgamr",
    "rating": 8.0,
    "comment": "Call of Cthulhu RPG - no game master required\nGround breaking game by FFG that makes the app secondary to the board, while at the same time allowing it to provide THE MOST cinematic, thematic, immersive, emerging narrative experience I have had in a LONG time. Believe the hype.\n\nBOX INSERT: Homebrew foam board inserts for figure storage in base game box (lid extension + two additional nested trays) and component storage in expansion box (lid extension)\n\nSTORAGE LINER: Bahail Drawer and Shelf Liner (non-adhesive | Black) ~ Essential shelf liner so minis don’t shift when moving miniature trays ~\n\nCOMPONENT STORAGE: Plano Pro-Latch Utility Box 3500 (Tokens and Dice); Plano 6 Compartment Stowaway 3450 (Investigator Miniatures); The Broken Token Mini Size Card Case (Cards); Staples Kraft Expanding File (Board Tiles - organized per alphabetized Master Tile List)\n\nEXPANSIONS: Recurring Nightmares; Suppressed Memories; Beyond the Threshold; Streets of Arkham; Sanctum of Twilight; Horrific Journeys; Path of the Serpent; and all App DLC scenarios\n\nFAN CONTENT: User Created Scenarios Played via Valkyrie\n[Name | Rating (5-Stars)] Stress and Strain | 5/5; Possessed | 4/5; The Experiment | 3/5\n\n[MANSIONS OF MADNESS: SECOND EDITION LINE COMPLETED 2019]",
    "timestamp": 1755381600
  },
  {
    "username": "baranek84",
    "rating": 8.0,
    "comment": "Solo collection",
    "timestamp": 1755208800
  },
  {
    "username": "alshek",
    "rating": 8.0,
    "comment": "5 players",
    "timestamp": 1754863200
  },
  {
    "username": "freakball",
    "rating": 8.0,
    "comment": "x",
    "timestamp": 1754776800
  },
  {
    "username": "PanPlaySwe",
    "rating": 8.0,
    "comment": "3d printade komponenter\nMålade miniatyrer",
    "timestamp": 1754517600
  },
  {
    "username": "uglystru",
    "rating": 8.0,
    "comment": "Honestly a phenomenal game. The app makes each game you play completely different from the last. I've played the starting mission about 6 times and every playthrough has been a totally unique experience.\n\nSome people may not enjoy the app-driven gameplay but I think it adds such unique elements to the game that a standard board game would have a difficult time with.\n\nMy main complaint is that the minis/stands are just too bulky and don't fit right. If you like minis, this game includes some great quality ones. But I'm not particularly a fan and I think it just adds too much to the price of the game. I could do with just standees personally.",
    "timestamp": 1754431200
  },
  {
    "username": "Jade Cocoon89",
    "rating": 9.0,
    "comment": "everything are based to luck... 0 strategy, heavy object hit with charisma... too luck based, 0 intellect.\n3h of game but you lose or win just with luck...",
    "timestamp": 1762124400
  },
  {
    "username": "yoda844",
    "rating": 9.0,
    "comment": "G1",
    "timestamp": 1761519600
  },
  {
    "username": "mrssallyintown",
    "rating": 9.0,
    "comment": "Super fun to play with friends. Its a nice story driven game with lots of challenge and a good sense of tension.",
    "timestamp": 1760220000
  },
  {
    "username": "Nakira",
    "rating": 8.5,
    "comment": "Mansions of Madness: Second Edition – I’ll admit, I was skeptical at first. After loving the first edition — gleefully playing the Keeper and driving my friends into madness — the idea of a fully cooperative, app-driven version sounded risky. But oh, does it work. The app weaves an atmosphere dripping with Lovecraftian dread, eerie soundscapes, and unfolding mysteries that feel straight out of a classic point-and-click adventure. Together, you’ll explore haunted mansions, solve puzzles, and confront the unspeakable — usually right before it devours you. The app removes all the fiddly admin work, letting you sink fully into the horror and story. We’ve played every mission and expansion, and each felt like a full-blown descent into cosmic terror. A brilliant evolution of the original and an unforgettable Cthulhu-soaked experience.",
    "timestamp": 1759874400
  },
  {
    "username": "Dashychicken",
    "rating": 9.0,
    "comment": "Seriously fun and engaging game that isn't too tricky to learn or setup. The app is great but an undo feature would be awesome. (also the minis suck)",
    "timestamp": 1759788000
  },
  {
    "username": "CongratulatoryWisdom",
    "rating": 9.0,
    "comment": "Status: Double sleeved (Paladin premium) & ultra organised in wooden card holders, all figures painted and rebased, and most cardboard tokens replaced with wooden or resin tokens.\n\nOctober 2025 is the month. So, how has Mansions held up?\n\nFor a game often cited as being lesser in terms of replayability, I've played the official scenarios multiple times each, and that alone would make me rate this game highly. If you had to make it a number, an \"8\". It's genuinely brilliant and the right level of app vs. components on the table being important.\n\nThe fact Valkyrie -the fan app which allows for custom scenarios for Mansions of Madness 2nd Edition & Descent 2nd Edition- exists means that with enough digging you can find 20 of the best board game experiences of all time, if you have the right expansions that some of those fan scenarios require.\n\n20 seems specific, right? Yes. Because I have a handwritten list of the scenarios which are both replayable, largely well written, and do interesting beyond the core game. That, or they expand on the core tenets of the game in a way which feels so much more. Check out Nicola Zee's scenarios, they're all great even if my pulpy writing on Curse of Set is a bit much in retrospect - sorry everyone.\n\nThe three best Valkyrie scenarios to me as of 2025, with me trying them out again very recently, are Last Train to Arkham, The Encroaching Dread, and Curse of Set. Aren't I biased with Curse of Set? Yes, but I played & hosted the scenario several times before I contributed some ungainly pulp phrasing. That was also my opinion before I contributed! It's why I contributed!\n\nBut yes, Mansions official stuff is really great. With the fan scenarios you can find the most unbelievable quality.\n\n-----\n\nOLDER COMMENT: While it may lack the finesse of a human dungeon master, I'll take the short set-up time and co-operative fun over the 1st edition any day.\n\nWhile it may have issues during certain scenarios depending on how you approach them (being too fast & accurate/being too slow and unlucky) most of the time the official scenarios are good.\n\nThe Valkyrie app and the top tier scenarios are better than the official scenarios, and that's not an insult at the official scenarios, it's just that the fans of the game put a lot into it!",
    "timestamp": 1759269600
  },
  {
    "username": "Ryalyn",
    "rating": 9.0,
    "comment": "SO MUCH FUN!!!! Wasn't sure what would happen next, very thematic, totally absorbing. The main drawback though is that the play length is REALLY LONG for us.\n\nReplay value is kinda iffy with just the base game. From what I have seen (I started playing the same senario about 2 times before official game) there is not a whole lot of variety between plays. Same stuff, same monsters, roughly the same places. Rooms might change sides and the random rewards might be different but everything else is mostly the same. In order to improve replay, you need to get more expansions for the app to pull items, monsters, and rooms from.\n\nUpdate: The expansions give the game app more choices when setting up tiles and such for each scenario. Most of the key items of interest will still be there but some of the room layouts will change.",
    "timestamp": 1758492000
  },
  {
    "username": "lambo89",
    "rating": 8.5,
    "comment": "In his genre, it's amazing. A modern app that cuts the need for a master, different scenarios that are heavily replayable (And always a bit different), and perfectly thematic. VERY FUNNY with the proper group, this is a masterpiece for Lovecraft lovers (And i am NOT!)",
    "timestamp": 1758232800
  },
  {
    "username": "ivanxote",
    "rating": 9.0,
    "comment": "great game",
    "timestamp": 1757714400
  },
  {
    "username": "Segob",
    "rating": 9.0,
    "comment": "Very immersive experience. At times cinematic. Long live the app.",
    "timestamp": 1757023200
  },
  {
    "username": "Thaithos252",
    "rating": 9.0,
    "comment": "El primer juego de mesa con el que me aventuré. Y no me arrepiento. Un juego muy narrativo, inmersivo, eso si, es estar un bueen rato sentado, pero si estan dispuestos a una noche de risas, suspenso y una buena charla, es un juego apropiado. Bueno para jugones y no jugones, con este metí a muchos al mundo de los juegos de mesa.\nLas expansiones en su mayoría valen la pena y la aplicación fanmade muy bien lograda. Lo único que ya se nota que le están pasando los años al juego.",
    "timestamp": 1757023200
  },
  {
    "username": "bjackso3",
    "rating": 8.6,
    "comment": "1–5 Players\n120–180 Min\nPlaying Time\nAge: 14+\nWeight: 2.68 / 5Complexity Rating",
    "timestamp": 1756332000
  },
  {
    "username": "Superunknown1257",
    "rating": 9.0,
    "comment": "Scenarios Complete\n\nExpansions",
    "timestamp": 1756072800
  },
  {
    "username": "Joshbriggs",
    "rating": 9.0,
    "comment": "Very very fun game. I wish the app mixed and matched a bit more. But the game itself is incredible.",
    "timestamp": 1754863200
  },
  {
    "username": "yorinaga_k",
    "rating": 9.0,
    "comment": "Me encanta. Ya me gustaba la primera edicion aunque se hacia muy pesada la preparacion de la partida. en esta segunda edicion con la APP haciendo de Master es una gozada.",
    "timestamp": 1754776800
  },
  {
    "username": "Odegaard1999",
    "rating": 8.5,
    "comment": "3–4 Players\nPlay Time: 120–180 Min",
    "timestamp": 1754517600
  },
  {
    "username": "aiyanima",
    "rating": 9.0,
    "comment": "Have a excellent experience with it！",
    "timestamp": 1753912800
  },
  {
    "username": "Appa98",
    "rating": 9.0,
    "comment": "regalo",
    "timestamp": 1753826400
  },
  {
    "username": "ProfessorChaos",
    "rating": 9.0,
    "comment": "C4",
    "timestamp": 1752876000
  },
  {
    "username": "etherealblue23",
    "rating": 9.0,
    "comment": "Huddleston",
    "timestamp": 1752530400
  },
  {
    "username": "daanrutten",
    "rating": 9.0,
    "comment": "Traded at the PNW in 2024.",
    "timestamp": 1751925600
  },
  {
    "username": "maritn",
    "rating": 9.0,
    "comment": "A great dungeon crawler with the best sense of exploration in a pure coop I've seen so far.\n\n+ The setting is a big plus for me (Lovecraft Mythos).\n+ Thematic\n+ Background music of the app really gets you in the mood.\n+ Intro and outro are read out loud by the app.\n+ Beautiful tile art.\n\no After the first playthrough, the exploration part is not the same as during the first playthrough of a scenarion, even though the changing layout when including expansion material helps and even repeated plays are still fun, especially if you failed on your first attempt(s).\no I prefer games without the heavy use of apps, but the advantages (exploration, sound effects, etc.) make up for it IMO.\n\n- The miniatures of the base game are not what I had expected from an FFG production, especially when compared to Star Wars: Rebellion (which came out the same year). Also you have to replace these huge, ugly bases with clear acrylic bases if you don't want them to cover up all those beautiful tiles.\n\nAnyway, regarding the sense of exploring a mysterious mansion and the atmosphere it's the best of its kind.",
    "timestamp": 1749679200
  },
  {
    "username": "mmychal",
    "rating": 9.0,
    "comment": "Superior to the Lord of the Rings version because the theme is better and it has more surpises without the need to hunt for inspiration tokens to be able to succeed at actions.",
    "timestamp": 1749592800
  },
  {
    "username": "Pyromkid",
    "rating": 8.6,
    "comment": "App controlled scenario based game. Thematic and a great game to break out on Halloween. If you hate app based games I can see this one bothering you. If you enjoy fun little stories where you can make some choices and do some investigating I would give this one a shot.",
    "timestamp": 1748988000
  },
  {
    "username": "Exozik",
    "rating": 8.5,
    "comment": "Really great game to follow along a story when you want a simple experience that you can share with anyone.",
    "timestamp": 1748988000
  },
  {
    "username": "PMBorisStoke",
    "rating": 9.0,
    "comment": "The best marriage of a mandatory app with a board game. I haven't liked it anywhere else I've seen it.",
    "timestamp": 1748815200
  },
  {
    "username": "MrRadman11",
    "rating": 9.0,
    "comment": "Players: 2-5",
    "timestamp": 1747692000
  },
  {
    "username": "GopalaRed",
    "rating": 9.0,
    "comment": "Aquí tienes las reglas básicas de *Mansions of Madness* en 15 puntos:\n\n1. **Objetivo**: Los jugadores cooperan para investigar una serie de eventos misteriosos en una mansión. El objetivo es resolver el misterio y cumplir con los objetivos del escenario antes de que el tiempo o las amenazas acaben con ellos.\n\n2. **Componentes**: El juego incluye un tablero modular, miniaturas, cartas, fichas, dados personalizados y un libro de escenarios.\n\n3. **Preparación**: Elige un escenario (puede ser jugado de forma independiente o como parte de una campaña) y coloca las piezas del tablero según las instrucciones del escenario. Cada jugador selecciona un investigador con habilidades únicas.\n\n4. **Investigadores**: Cada jugador controla un investigador, el cual tiene habilidades especiales y se inicia con un equipo específico, representado por cartas.\n\n5. **Turnos**: Los jugadores se turnan en el siguiente orden: investigar, mover, atacar, interactuar con objetos o personajes, y resolver las acciones.\n\n6. **Movimientos**: Los investigadores se mueven a través del tablero, explorando nuevas áreas, interactuando con objetos y buscando pistas.\n\n7. **Acciones**: En su turno, un jugador puede realizar dos acciones, como moverse, buscar pistas, abrir puertas, atacar, usar objetos, o interactuar con personajes.\n\n8. **Dados de acción**: Las acciones del juego se resuelven usando dados de habilidad. Los resultados de los dados se comparan con las habilidades del investigador para determinar el éxito o fracaso.\n\n9. **Habilidades**: Cada investigador tiene diferentes atributos (como fuerza, agilidad, intelecto y voluntad) que afectan el resultado de las tiradas de dados.\n\n10. **Monstruos**: El escenario incluye enemigos (monstruos o criaturas) que los jugadores deben enfrentar. Los monstruos actúan en su turno y pueden causar daño a los investigadores.\n\n11. **Salud y cordura**: Los investigadores tienen puntos de salud y puntos de cordura. Cuando se quedan sin salud, se desmayan; cuando pierden toda la cordura, sufren efectos psicológicos negativos.\n\n12. **Objetos y habilidades**: Los investigadores pueden encontrar objetos o habilidades especiales durante el juego, que les ayudarán a avanzar en su investigación o a defenderse de los monstruos.\n\n13. **Fuego y oscuridad**: En Mansions of Madness, la oscuridad juega un papel importante en ciertos escenarios. Los jugadores pueden usar fuentes de luz, como linternas o velas, para iluminar áreas oscuras, lo que les permite explorar sin sufrir penalizaciones. La oscuridad reduce la visibilidad y puede aumentar el peligro, ya que algunos monstruos o eventos se ven potenciados en la oscuridad. El fuego, como una fuente de luz, puede también servir para atacar a los enemigos o iluminar caminos, pero su uso puede tener consecuencias, como la propagación de llamas que afecten a los investigadores o al entorno. El fuego en Mansions of Madness se extiende a todas las casillas adyacentes a la fuente de fuego. Esto incluye las casillas adyacentes en las direcciones horizontales, verticales y diagonales. El jugador puede usar una acción para apagar el fuego en una casilla en la que esté presente, eliminando las llamas de esa casilla específica.\n\n14. **Resolución de escenario**: El escenario tiene objetivos que los jugadores deben cumplir, y el resultado de la partida depende de cómo los investigadores resuelvan los misterios y enfrenten las amenazas.\n\n15. **Final del juego**: El juego termina cuando los investigadores completan sus objetivos o son derrotados (por perder toda la salud o cordura). El Guardián también puede ganar si los jugadores no completan su tarea a tiempo.",
    "timestamp": 1747000800
  },
  {
    "username": "Barbametallum",
    "rating": 9.0,
    "comment": "+streets of arkham, horrific journeys, path of the serpent, beyond the threshold, sanctum of twilight.",
    "timestamp": 1746396000
  },
  {
    "username": "vanrydergames",
    "rating": 9.0,
    "comment": "man I can't stop gushing over this game. AMAZING\n\nUpdate 7/2017... came back to make sure I had this as a 10... wish I could give it an 11!",
    "timestamp": 1746136800
  },
  {
    "username": "Eegice",
    "rating": 9.0,
    "comment": "Sleeved",
    "timestamp": 1745704800
  },
  {
    "username": "vazkez_javi",
    "rating": 9.0,
    "comment": "en mecatol\n\nsin enfundar",
    "timestamp": 1745272800
  },
  {
    "username": "Rickyard",
    "rating": 8.5,
    "comment": "Perhaps expensive, the amount of replayability is nice BUT not because you can choose a lot of scenarios, just because you can replay the few (four) you have in the core box for fun.",
    "timestamp": 1744495200
  },
  {
    "username": "Bart_H0ga",
    "rating": 8.5,
    "comment": "rating given for base game with expansions",
    "timestamp": 1743804000
  },
  {
    "username": "VictoriousOne",
    "rating": 8.5,
    "comment": "Campaign",
    "timestamp": 1743631200
  },
  {
    "username": "hans4rd",
    "rating": 9.8,
    "comment": "Dripping with theme and fun. App adds so much to the game for a change. You don’t even need the rulebook to get up and running. Fantastic. Bonus: The fan made scenarios are top notch.\nCan’t see this ever dropping out of my top 5.",
    "timestamp": 1761343200
  },
  {
    "username": "StrongbowGold",
    "rating": 10.0,
    "comment": "Top",
    "timestamp": 1760738400
  },
  {
    "username": "mutilatedlips",
    "rating": 10.0,
    "comment": "Been a while since even cared to log a game I own on here, but then i finally took a chance and bought MoM the other day. Feel really bad I see l waited this long to play as it reinvigorated our game nights. Bought all the expansions since then, but why are they still printing/selling everything except for the two of the expansions? Cmon' FFG, they cost hundreds on the second hand market!!! I'm not touching any more of your games if that's how your company works now.",
    "timestamp": 1759701600
  },
  {
    "username": "faldor",
    "rating": 10.0,
    "comment": "keep",
    "timestamp": 1758924000
  },
  {
    "username": "RavenousCake",
    "rating": 10.0,
    "comment": "Sleeved, Sleeve Kings. Successfully won in all 4 missions. Discs in 27mm coin cases.",
    "timestamp": 1758060000
  },
  {
    "username": "lonewolfhdr",
    "rating": 10.0,
    "comment": "- too expensive\n- tragic monsters' bases\n- not enough scenarios at the base game and at the app in general\n- no insert, they just have thrown everything inside, no respect to the customers who bye such an expensive game and expansions too.\n- not the perfect quality for the minis\n\n+ great app, it is here only to help the flow of the game and changes some things when you play a scenario again. Also, you don't find yourself like playing a video game. Perfect use of the app for me\n+ extremely thematic\n+ perfect game experience\n+ beatiful and high quality tiles\n\nConclusion: 1) if you mostly care about the money you spend then just don't buy it, It's not value for money, it's just the opposite 2) if you don't like hybrid games or games with lot of dice roll then it's not for you too\n\nBUT : if you want a horror experience, a greatly thematic game, with mystery, investigation, monsters and tension then it's for you\n\nFOR ME: it's the best game i have ever played, i never get bored of it, it has everything i like, investigators with different skills, weapons, spells, items and everything else you can imagine, in addition the perfect tiles also. In four words: THE BEST EXPERIENCE EVER",
    "timestamp": 1757282400
  },
  {
    "username": "theradon",
    "rating": 10.0,
    "comment": "Co-op",
    "timestamp": 1756850400
  },
  {
    "username": "AfarOca",
    "rating": 10.0,
    "comment": "PARTIDAS GANADAS/PERDIDAS\nOca 2/1\nNavir 2/1\nAlba 1/1\nEmilio 1/0\nPepón 1/0\nCondor 1/0\nDreamlandesa 1/0\nCarlos 1/0\nMariola 0/1",
    "timestamp": 1756159200
  },
  {
    "username": "Kubidi",
    "rating": 10.0,
    "comment": "Players: 01 - 05\nBest: 03 - 04",
    "timestamp": 1756072800
  },
  {
    "username": "Kamlut",
    "rating": 10.0,
    "comment": "My co-investigator couldn’t understand why… why was I trying to set myself on fire. But my sanity was long gone…\nSo, I wasn’t sure about getting this game—we were still in process of playing the Arkham Horror board game. BUT after the first play I just fell in love with Mansions of Madness! And I really enjoy playing with the app, which automates a lot of the mechanics. Great game!",
    "timestamp": 1755900000
  },
  {
    "username": "jangopool",
    "rating": 10.0,
    "comment": "i always enjoying this with friends - any new player i introduce this to ends up buying this game",
    "timestamp": 1754431200
  },
  {
    "username": "Sigurd1410",
    "rating": 10.0,
    "comment": "This game is the reason why I \"hate\" Fantasy Flight. Superb implementation of the App. Amazing game with great mechanics, superb tiles and unfortunately mediocre minis.",
    "timestamp": 1754344800
  },
  {
    "username": "wimpynoodle",
    "rating": 10.0,
    "comment": "Does what it intends to do perfectly. You are a scared, weak hunk of flesh, fighting for survival. Importantly though, you stand a chance.",
    "timestamp": 1753394400
  },
  {
    "username": "dalbinblue",
    "rating": 10.0,
    "comment": "Completed Scenarios:\n2. Escape from Innsmouth\n4. The Rising Tide\n5. Dearly Departed\n17. Murder on the Stargazer Majestic\n18. 10:50 to Arkham",
    "timestamp": 1753135200
  },
  {
    "username": "Sir_Mix_Alot",
    "rating": 10.0,
    "comment": "Outstanding - will always enjoy playing.",
    "timestamp": 1752962400
  },
  {
    "username": "PwnPlow",
    "rating": 10.0,
    "comment": "Une expérience narrative et immersive absolument magistrale. Chaque scénario est une plongée angoissante dans un univers lovecraftien où exploration, enquête et survie se mêlent parfaitement. L’application gère l’ambiance sonore, les événements et le suspense avec brio, laissant les joueurs se concentrer sur leurs choix. Le matériel est superbe, les histoires prenantes, et la rejouabilité excellente. Pour les amateurs de mystères sombres et d’aventures coopératives, c’est un chef-d’œuvre.",
    "timestamp": 1751234400
  },
  {
    "username": "ZenBananaSlug",
    "rating": 10.0,
    "comment": "Given to Eric Vu",
    "timestamp": 1749679200
  },
  {
    "username": "CarolusMS",
    "rating": 10.0,
    "comment": "Me gustó las primeras partidas, pero después de una a 4 jugadores, que se pasaron mas de 3 horas y no nos dimos ni cuenta...Inmersivo, complejo, excelente puesta en escena, a los que nos nos gustan las Apps, he de decir que a mi este me ha convencido. Dios Salve a Lovecraft.",
    "timestamp": 1749333600
  },
  {
    "username": "Boardgame_Twins",
    "rating": 10.0,
    "comment": "Love it! This game will never leave my collection.\nI can sit down with total newbies that only ever played UNO and we can play this within the first five Minutes of Rules Explanation.\nJust great.",
    "timestamp": 1747778400
  },
  {
    "username": "dargos86",
    "rating": 9.5,
    "comment": "5",
    "timestamp": 1746396000
  },
  {
    "username": "L_ach_Gummi",
    "rating": 10.0,
    "comment": "Mit Insert",
    "timestamp": 1745704800
  },
  {
    "username": "vikingowa",
    "rating": 10.0,
    "comment": "PAINTED",
    "timestamp": 1744322400
  },
  {
    "username": "malk1983",
    "rating": 9.5,
    "comment": "escenario 1 (perdido): William Yoric/Ming\nescenario 1 (ganado, Olga):Leo Anderson/Agnes Backer\nescenario 2 (ganado, Olga):Finn Edwars/Rita Young",
    "timestamp": 1744236000
  },
  {
    "username": "Adri_corr",
    "rating": 10.0,
    "comment": "(1, 5) #players\n\nJugado:\n\nEl ciclo de la eternidad (+)\nHuida de Innsmouth\nLazos inquebrantables\nMarea Creciente\nToque de Difuntos\nSecta de Sentinel Hill (+)\nLas puertas de la mansión Silverwood (+)\nLa venganza está servida\nAlquimia astral (+)\nGuerra de bandas\nAsesinato en el Stargazer Majestic\nA puerta cerrada (+)\nTren a las 10:50\nLa diadema del crepúsculo",
    "timestamp": 1743804000
  },
  {
    "username": "Albus123",
    "rating": 10.0,
    "comment": "Solo",
    "timestamp": 1743631200
  },
  {
    "username": "Melqui",
    "rating": 10.0,
    "comment": "Es uno de Los Mejores Juego que he probado. Me encanta.",
    "timestamp": 1743372000
  },
  {
    "username": "charmed_0215",
    "rating": 9.5,
    "comment": "Purchased 2022\n*** NOT FOR SALE OR TRADE ***",
    "timestamp": 1741647600
  },
  {
    "username": "AuVaN",
    "rating": 10.0,
    "comment": "Easy to play because of app, interesting scenarios",
    "timestamp": 1741561200
  },
  {
    "username": "Gvreerean",
    "rating": 9.5,
    "comment": "пнп",
    "timestamp": 1741042800
  },
  {
    "username": "yanick666",
    "rating": 9.5,
    "comment": "Great game but the figures and their bases are just atrocious.",
    "timestamp": 1740783600
  },
  {
    "username": "Evilaugh",
    "rating": 10.0,
    "comment": "This new mechanism that mixes app and board game together is so much fun.\nThe back ground sound effect plunge you deep into its horrifying atmosphere .\nIt shuffles the game layout and items so you cant replay the exact same scenarios twice. So many characters to choose from and items to find.\nI like the alternative goal conditions when your detective turns out banana. Unfortunately the game could be quite expensive and in order to have more replay value you need to get deep into buying expansions\nMy rating isn’t about pricing tho so I give it a 9.5",
    "timestamp": 1739660400
  },
  {
    "username": "Carlom9527",
    "rating": 10.0,
    "comment": "On my opinion Mansions of Madness is the best boardgame.",
    "timestamp": 1739574000
  },
  {
    "username": "cjmolloy1010",
    "rating": 9.5,
    "comment": "Cthulhu at its best, the app makes this game so well streamlined and easy to get into while also being able to soak in the thematic atmosphere.",
    "timestamp": 1739055600
  },
  {
    "username": "Draqings",
    "rating": 10.0,
    "comment": "Old Miniatures",
    "timestamp": 1736377200
  },
  {
    "username": "stevepwalker",
    "rating": 10.0,
    "comment": "Keep",
    "timestamp": 1735945200
  }
]