[
  {
    "username": "mickhah1",
    "rating": 1.0,
    "comment": "Played like 3 or 4 times, always trying to enjoy. But it is impossible. Boring as hell. Bag mechanic is clumsy, while game is slow and absolutely not entertaining.",
    "timestamp": 1762210800
  },
  {
    "username": "Ahikar",
    "rating": 1.0,
    "comment": "Sobrevalorado. La capacidad de elección es excesivamente limitada cada turno como para que merezca una nota aprobada, y es tanto el hype con el que es ridículo.",
    "timestamp": 1758060000
  },
  {
    "username": "sunix",
    "rating": 1.0,
    "comment": "An absurd game full of randomness – most of the time you can’t even do anything, just sit back and watch the game play you. You’re on a spaceship and suddenly your crewmates are out to kill you? But why? There’s a swarm of aliens hunting you down, and instead of fighting them, you’re supposed to kill your fellow crew members? Is this a joke?\n\nNow imagine this: you’ve spent half the game gathering resources to craft a flamethrower. You finally face an alien – mind you, it’s twice your size – and… miss? Seriously? You miss with a flamethrower in a 3-meter room. Even if you manage to hit, it deals one point of damage, and the alien has 4 health. In this game, your best option when facing a monster is to just run away. That’s ridiculous.\n\nTo sum it up, half the characters in this game are useless and unplayable. For some unknown reason, your crew wants to kill you even though there’s a literal alien queen loose on the ship. Fighting the monsters is pointless because they’re way stronger than you. You’re heavily dependent on the cards in your hand – and honestly, most of them are pretty useless too.\n\nMakes you wonder if anyone even tested this game.",
    "timestamp": 1753394400
  },
  {
    "username": "Sir Pent",
    "rating": 1.0,
    "comment": "So much potential wasted. Imagine Pandemic on a space ship with aliens attacking. It sounds cool but is destroyed by WAY TOO MUCH chance overwhelming strategic decisions.",
    "timestamp": 1729980000
  },
  {
    "username": "Fundle",
    "rating": 1.0,
    "comment": "The game is good if you like role playing social deduction games with a lot of randomness. It lacked the feel of playing a board game. I wanted to end the game as quickly as I could so I didn't have to participate anymore.",
    "timestamp": 1712527200
  },
  {
    "username": "KiviK",
    "rating": 1.0,
    "comment": "Plain ridiculous on so many levels and very procedural.",
    "timestamp": 1701298800
  },
  {
    "username": "Merlija",
    "rating": 1.0,
    "comment": "One of the worst gaming experiences of my life. Extremely luck dependent and a big waste of time for me.",
    "timestamp": 1698620400
  },
  {
    "username": "Baecore",
    "rating": 1.0,
    "comment": "5 hours of randomness and bad luck.. this game is for everyone how enjoys to be controlled by the game and having no options.\n\nPlayer elemination way to soon.",
    "timestamp": 1692309600
  },
  {
    "username": "daelhoof",
    "rating": 1.0,
    "comment": "Tried twice but found it very terrible.\n\nOn a randomness scale of 1-10 I rate this a 99. Pretty much impossible to plan anything meaningful in that context.\n\nAlso can be a long time waiting for your turn with 4 players for what is effectively a semi-solo game.\n\nEven something that hasn't 'happened' changes. For example you almost kill an alien which has 2 wounds, someone tries to kill it next turn but no, this round randomness says it now has 4 wounds. What?\n\nSomehow you know how to get to the engine rooms but you don't know where any other rooms are. Want to find a critical room? Who knows where it could be - in one game a player later found right at the other end of the ship, of course... And of course who knows if you'll actually be able to find anything useful when you get there, because you know, random chances of everything.\n\nOthers have mentioned the noise mechanic. I don't know why it doesn't die down if nobody is there. If you get stuck early on the noise tokens can make it extremely hard to get anywhere without risking imminent death.\n\nTwice had bad luck dying around half an hour into a 3 hour game. Snooze... Didn't want to play the Aliens either, that's just trying to make up for a broken mechanic and judging by reviews not at all an uncommon experience. Player elimination can be fine, but not when you can die SO early in into such a long drawn-out game without being able to do anything meaningful. It probably doesn't help if you're not into sci-fi horror theme either, which we are not.\n\nYou can have extremely good luck, extremely bad luck or anything in between.",
    "timestamp": 1677193200
  },
  {
    "username": "shad0w4life",
    "rating": 1.0,
    "comment": "Friend and I got the game, went to play it, plays extremely slow with a lot of waiting and isn't fun. Just a lot of table real estate taken up with so much crap.",
    "timestamp": 1676502000
  },
  {
    "username": "Kickbut101",
    "rating": 1.0,
    "comment": "Game production value is cool. Very strongly dislike the gameplay.",
    "timestamp": 1674946800
  },
  {
    "username": "Jessy C",
    "rating": 1.0,
    "comment": "Awaken Realms is a toxic pool of incompetence. They cannot do anything right for their customers.",
    "timestamp": 1663624800
  },
  {
    "username": "cn404",
    "rating": 1.0,
    "comment": "Chinese agent",
    "timestamp": 1660514400
  },
  {
    "username": "Lonelyman1001",
    "rating": 1.0,
    "comment": "Just boring and random game!",
    "timestamp": 1648936800
  },
  {
    "username": "telescopefish",
    "rating": 1.0,
    "comment": "So frustrating",
    "timestamp": 1645484400
  },
  {
    "username": "Anton_VL",
    "rating": 1.0,
    "comment": "Распиареная игра с нерабочими механиками",
    "timestamp": 1645311600
  },
  {
    "username": "Veraneio",
    "rating": 1.0,
    "comment": "A versão brasileiro veio recheada de erros absurdos e uso excessivo de linguagem neutra",
    "timestamp": 1642287600
  },
  {
    "username": "bobhope1999",
    "rating": 1.3,
    "comment": "Overbuilt Yates’s",
    "timestamp": 1636239600
  },
  {
    "username": "Joellenbecker",
    "rating": 1.0,
    "comment": "Sorry, but a 3-hour game with random player elimination is a clear 1/10, no matter how overproduced and stuffed with miniatures it is. Could have been a really cool game - but it is crap",
    "timestamp": 1632952800
  },
  {
    "username": "slickerdrips",
    "rating": 1.0,
    "comment": "I wouldn’t normally bother but there are 12 more rounds left and this has passed a couple of turns.",
    "timestamp": 1628287200
  },
  {
    "username": "PilotoBR",
    "rating": 1.0,
    "comment": "Galápagos Jogos made such a poor translation of this game, that it breaks the whole experience. What's even worse, is that they are doing nothing to remedy the situation. I'll leave the score as it is, untill Galápagos does something about it.",
    "timestamp": 1610233200
  },
  {
    "username": "Tiellet",
    "rating": 1.0,
    "comment": "The game itself is spectacular and super immersive!\nMy rate 1 is a form of protest against the sloppy work of translation and revision of the brazilian edition, which contains (so far) 18 errors at the rulebook and 5 errors on cards (according to the unofficial errata I compiled myself).\n\nGalápagos Jogos (brazilian publisher of the game) should have hired a quality team to translate and proofread a product that arrived on the market costing almost the value of 1 brazilian month minimum wage, instead of the ones she choose. And, since the product has so many errors, it should deign to replace the rulebook and corrected cards to consumers of the game.\n\nI hope Awaken Realms read the insatisfaction of brazilian costumers and take some action concerning Galápagos Jogos. AR, as a great and respectable company, should not have its reputation stained by the incompetence and indifference of Gálapagos.\n\nSad but true",
    "timestamp": 1607986800
  },
  {
    "username": "APonce911",
    "rating": 1.0,
    "comment": "PR-BR translator used his work to do a \"hidden\" protest against the use of binary genders, and it harmed the reading of the manual.\nThe translation overall was also poor, and there is a ton of reported translation errors, including gameplay rules.\nFor the price that is charged in BRL, this game doesn't correspond with the expected premium product. I really wanted to buy, but I refuse to support companies that simply ignore customers.",
    "timestamp": 1607900400
  },
  {
    "username": "w92viking",
    "rating": 1.0,
    "comment": "Nearly fell asleep. Disappointed as the theme is right up my street",
    "timestamp": 1607641200
  },
  {
    "username": "Thorium090",
    "rating": 1.0,
    "comment": "The game itself is spectacular and super immersive!\nMy rate 1 is a form of protest against the sloppy work of translation and revision of the brazilian edition, which contains (so far) 18 errors at the rulebook and 5 errors on cards (according to the unofficial errata I compiled myself).\n\nGalápagos Jogos (brazilian publisher of the game) should have hired a quality team to translate and proofread a product that arrived on the market costing almost the value of 1 brazilian month minimum wage, instead of the ones she choose. And, since the product has so many errors, it should deign to replace the rulebook and corrected cards to consumers of the game.\n\nI hope Awaken Realms read the insatisfaction of brazilian costumers and take some action concerning Galápagos Jogos. AR, as a great and respectable company, should not have its reputation stained by the incompetence and indifference of Gálapagos.",
    "timestamp": 1606950000
  },
  {
    "username": "Gattoni",
    "rating": 1.0,
    "comment": "The game itself is spectacular and super immersive!\nMy rate 1 is a form of protest against the sloppy work of translation and revision of the brazilian edition.\n\nI hope Awaken Realms read the insatisfaction of brazilian costumers and take some action conserning Galápagos Jogos",
    "timestamp": 1606950000
  },
  {
    "username": "Ftapias",
    "rating": 1.0,
    "comment": "The game itself is spectacular and super immersive!\nMy rate 1 is a form of protest against the sloppy work of translation and revision of the brazilian edition.\n\nI hope Awaken Realms read the insatisfaction of brazilian costumers and take some action conserning Galápagos Jogos",
    "timestamp": 1606950000
  },
  {
    "username": "paulsecond",
    "rating": 1.0,
    "comment": "The game itself is spectacular and super immersive!\nMy rate 1 is a form of protest against the sloppy work of translation and revision of the brazilian edition, which contains (so far) 18 errors at the rulebook and 5 errors in playing cards (according to the unofficial errata I compiled myself). They even translated the weapon \"PISTOL\" as REVOLVER, and the Captain SIX-SHOOTER as PISTOLA...\n\nI won't even discuss the merit here of two controversial issues: 1- the creation of a new word by the translater, when our language already contains a fully acceptable term for the word \"intruder\", which should have been translated as \"Invasor\"; and 2- the mutilation of the standard rules of our language to accommodate the political opinion of the translator, who decided to write the rulebook entirely in feminine and gender neutral words. Also, the translation of the word \"player\" as \"a pessoa que está jogando\" is almost ridiculous, when she should have used the word \"jogador\" instead.\n\nGalápagos Jogos (brazilian publisher of the game) should have hired a quality team to translate and proofread a product that arrived on the market costing almost the value of 1 brazilian month minimum wage, instead of the ones she choose. And, since the product has so many errors, it should deign to replace the rulebook and corrected cards to consumers of the game.\n\nI hope Awaken Realms read the insatisfaction of brazilian costumers and take some action conserning Galápagos Jogos",
    "timestamp": 1606950000
  },
  {
    "username": "myleshungerford",
    "rating": 1.0,
    "comment": "Having played this game, I honestly have no idea why other people rate it so highly. It's not a top 100 game, and certainly not worth $120. If you want to try it, definitely rent or borrow it ahead of time because it's not worth the price tag. If you like survival horror with semi-cooperative elements, try Dead of Winter instead. It's much better designed.",
    "timestamp": 1606518000
  },
  {
    "username": "farsidehobbes",
    "rating": 1.0,
    "comment": "Just awful\n\nMore is not more. Too many rough edges that needed to be sanded down for this game to shine.\n\nIt screams of a Kickstarter where not enough development/play testing was done to streamline the game play and make it fun. Too much left in for the sake of theming.\n\n\nOverall, this is an awful, thematic game that ripped off the Alien license. I don't have any desire to play again.\n\n5 new players took us about 3 hours to get halfway done and then we called it. One player survived on an escape pod, 2 players had died mid game, and 2 died at the end.\n\nNote that you will probably die, although if you're going in to it for an experience you may like it. If you're trying to min/max, it is not going to be that good.\n\nThings I'm fine with: moving around the ship, facing the bad guys, trying to get your objective done, etc.\n\nWhat I didn't like/would house rule:\n- the rules are just okay at best. They needed to be laid out better, with a glossary and some cross posting. E.g. one card let someone make another player retreat to a different room. Is that considered moving where they would have to make a noise check? There are a lot of these edge cases that could have been eliminated by rewording the rules, or using bolded keywords.\n- Random alien hit points was so annoying. The mechanic killed an Adult on a 2 health, but others needed 5 or 6. Just make a hit point chart already. You don't need fluctuating hit points.\n- It makes no sense that you have no idea where any rooms are on the ship, especially the ones that are adjacent to the hibernation pods. Those should start the game flipped over.\n- You don't know where any rooms are, yet know how to get to the bridge or engine rooms.\n- Trading should be free\n- No way to remove noise. It just sits there until you have an encounter. If no one has been in the room for a few turns, that noise should have quieted down. I've read discussions of this that come to opposite conclusions. 1. It's the aliens hearing things in the room, and the noise markers are actually where they think people may be. OR 2. It's where you think you heard aliens coming from. Yet in both cases, after time, those markers should disappear. Both you and the aliens are not going to remember that 'oh yeah, 2 hours ago I heard some faint sound coming from this air shaft.'.\n\n- There are too many extra rules that should have been eliminated or streamlined. This game screams for not enough taken out:\n-- Crafting should be gone. It is so situational such that you could have just made those crafted items be regular items that you search for\n-- The 2 different ways to get rid of Contamination cards depending on whether you were infected or not should just be a single method. Oh, you went to the Surgery room, scanned your cards but none are infected. Nope, you have to keep them all and go somewhere else to remove them. Why can't I just rest on the surgical bed?\n-- Search should be a basic action rather than a card\n-- Improving the bag needed to be different. Rather than a whole flow chart it should have simply been, you add the next higher alien type to the bag.\n-- There is no reason you should have to get rid of one of your objective cards. Once I had chosen, a turn later, another player hopped in an escape pod and left. Well, my objective couldn't be done.\n-- Why are items eliminated from the game when dropped but objects are not?",
    "timestamp": 1604530800
  },
  {
    "username": "Ranker",
    "rating": 1.0,
    "comment": "VN",
    "timestamp": 1602972000
  },
  {
    "username": "Dark_Knight",
    "rating": 1.0,
    "comment": "Bought it on a \"Cult of the New\" heat-stroke....opened it, punched it, set it up-and by the time the Queen came out?\n\nI was LITERALLY too embarassed to have that thing out on my game table if the wife ever came by.\n\nReduce ALL future games with 'dolls' by 1 full (1.00) pt from Avg....THEN consider the game.\n\nGot rid of it and even made a few dollars for the trouble.\n\nNo more \"doll\" games.",
    "timestamp": 1588629600
  },
  {
    "username": "Ed Sierpowski",
    "rating": 1.0,
    "comment": "Got mine EVENTUALLY! Played several shop bought copies months before getting it!!Fed up of seeing people review it and buy it in stores! Thanks for letting me fund FLGS. Could have bought this at reduced price a lot earlier!\nPlayed at con. Oh dear what a waste of money! A VERY BAD implementation of clank in space! Suffers from very illogical progression to create suspended. Just constant annoyance! Will probably use the minis for a homebrew massive table version of SpaceHulk or Zombicide Invader.",
    "timestamp": 1574895600
  },
  {
    "username": "aircastle",
    "rating": 1.0,
    "comment": "I would avoid Awaken Realms. They are always over a year late on KS game deliveries and usually have disappointing gameplay. Not worth it for how expensive these games are. 1 year late and never apologetic about it. LoH was 2+ years late.\n\nThey look amazing and that's about it.\n\nThey should stick to only painting mini's not making games and lying to customers about delivery dates and quality.",
    "timestamp": 1573858800
  },
  {
    "username": "Simone62",
    "rating": 2.0,
    "comment": "4.Platz von 4",
    "timestamp": 1756936800
  },
  {
    "username": "Schkitz",
    "rating": 2.0,
    "comment": "This game was way too complicated and honestly wasn't that fun. We ended up throwing it out.",
    "timestamp": 1752876000
  },
  {
    "username": "PeakMerovingio",
    "rating": 2.0,
    "comment": "You do not play the game, the game plays with you.",
    "timestamp": 1751752800
  },
  {
    "username": "ManEatingHippo",
    "rating": 2.0,
    "comment": "Why?",
    "timestamp": 1742770800
  },
  {
    "username": "jyhuh35",
    "rating": 2.0,
    "comment": "재미는 있는데 피규어 도색이 제일 재미있었음\n\n탈락자가 있는게 싫다.\n\n결국 배신자 찾기 게임인데\n\n배신자 찾기를 이렇게 길게 하면 피곤하다",
    "timestamp": 1739660400
  },
  {
    "username": "Creativenothing",
    "rating": 2.0,
    "comment": "Borderline broken. Early elimination means you could spend hours not playing an actual game.\n\nHas almost a complete lack of player agency and is far too random. Decisions lack any real weight.",
    "timestamp": 1737673200
  },
  {
    "username": "JakeJackPot",
    "rating": 2.0,
    "comment": "(Base game) It isn't a real game, it's not a good play experience. The semi coop is frustrating and easy to manipulate. Over all it's a broken game with a good theme.\n\nBecause this game is best at 4/5 players, it all feels slow. Not to mention that players can actively make your play experience hell and that is the main purpose of their time spent, this game just doesn't have any fun. It is slow, clunky, poorly explained, difficult to recommend and ultimately not worth the theme and experience that is promised.\n\nMany games can have bad experience play to play, but if the core of the game is fun than its worth playing even if you don't have the best session of your life. But in Nemesis if you don't have the best possible gaming experience, it will be a slow time. That is if you don't die early and have to watch your friends play for 2-3 hours more.\n\nThe theme almost alone which I also have problems with, and the components hold this game up to any reasonable score. I am convinced that people who love this game and rate it past a 6 are the only people having fun around the table and have not played this game more than 5 times or once a year. If you die early, or are being focused on my someone else or just struggle in your roles/ understanding the game, then it isn't fun.",
    "timestamp": 1735945200
  },
  {
    "username": "BoardGamingCouple",
    "rating": 2.0,
    "comment": "2/5\n\nsimilar to the other survival co-op games. pick the theme as your preference. expensive and overproduced. nice components. the semi co-op in this game does not work well. Very fiddly components and rules. setup is a nightmare.",
    "timestamp": 1735254000
  },
  {
    "username": "tetranitride",
    "rating": 2.0,
    "comment": "Way too long and random for what it offers. The game is brutally punishing to the point where success is reduced to a series of getting the right dice rolls and hoping your lucky streak never ends. Having potential betrayals in a five hour long game is just ridiculous and sours the entire gaming experience. Even if you manage to win, victory feels shallow and randomly determined ahead of time because the game sucks all the life out of you from making literally everything based on random chance. The game is overly complex for what it really is: a dice throwing simulator. The turns drag on for far too long, which makes an already grueling game even more painful. You have very little agency to actually enact meaningful change, and if you happen to pull a particularly action-heavy mission (like exploring every room, destroying the nest, etc), you're fucked. Just a completely unpleasant, boring, dreadful game that gets 2 stars for having good quality minis and a decent theme. Horrible. I would rather get all my teeth pulled out than play this again.",
    "timestamp": 1733094000
  },
  {
    "username": "Krionah",
    "rating": 2.0,
    "comment": "Nie rozumiem fenomenu tej gry. Siedzisz trzy godziny przy stole, starasz się wypełnić swój cel a przez przypadek/pechowy rzut przegrywasz. Lepiej niech każdy rzuci k6 i gracz z najlepszym wynikiem wygra a potem zagrajcie w cokolwiek innego. Szkoda czasu i kasy na ten tytuł.",
    "timestamp": 1731106800
  },
  {
    "username": "Aphexia31",
    "rating": 2.0,
    "comment": "The hidden traitor mechanic is just stupid, the actions are boring, the waiting for other people is boring, the decisions are stupid, what a lame game.",
    "timestamp": 1718748000
  },
  {
    "username": "rstites25",
    "rating": 2.0,
    "comment": "The premise is more intriguing than the gameplay. There's just not quite enough there to drive player decisions throughout the entire game. You can quickly get into a situation where the status quo of the ship seems ok, and thus you're pushed to not doing anything. Strictly speaking, maybe you should be doing something to increase your chances of winning, but you're also increasing your risk of running into an alien and getting infected.\n\nIt's so close to being something really good, but I think it ultimately misses. I really enjoyed the initial couple of turns, but then the game bogged down and became an uninteresting grind.\n\nOf course, then you have the player-elimination problem. It's a fairly long game to have a player be eliminated. That sort of thing usually doesn't bother me. And, in fact, for the theme characters, at least, need to die so that you feel the tension of being on a ship infested with aliens. But I'm not sure that Nemesis handles any of this in a way that really succeeds.",
    "timestamp": 1710025200
  },
  {
    "username": "pamahera",
    "rating": 1.5,
    "comment": "Nice production and theme but the gameplay is a little bit crappy. Full randomness, zero chance for strategy . A total mess. Stay away",
    "timestamp": 1702681200
  },
  {
    "username": "woda",
    "rating": 2.0,
    "comment": "This game is broken, it's random and so luck/player dependend... Suriously better watch any Alien movie than play this.",
    "timestamp": 1693432800
  },
  {
    "username": "lebryant",
    "rating": 2.0,
    "comment": "First of all, such IP rip-off is unacceptable and will never be tolerated by me. I personally know how hard it is to protect your own copyrights.\n\nAs of the gameplay - yet another dungeon crawler. It was supposed to be a semi-coop but it isn't and doesn't get anywhere close to a proper semi-coop like Dead of Winter. There's also a lot of randomness - rooms someone needs could show up either among the last ones to be discovered and on another side of the ship than themselves; while someone else could get lucky and find all the rooms they need on the first turn. Player elimination is another big red flag. You could be eliminated with hours of game left. It's not acceptable in modern boardgames. A lot of game mechanics logically don't make much sense. Especially the combat and fluctuating alien remaining health. It also seems it would get samey quickly too as all you do is move, discover, get out without any space left for tactics or strategy.\n\n---\nlebryant's TOP games of all time\n---\n[2022]: 286/294 (top 97%) | Rating - 1 | Overall Plays - 1\n[2021]: 284/288 (top 99%) | Rating - 1 | Overall Plays - 1\n[2019]: 252/256 (top 99%) | Rating - 1 | Overall Plays - 1",
    "timestamp": 1689112800
  },
  {
    "username": "JottHardy",
    "rating": 2.0,
    "comment": "Lengthy role-playing game in which it's more about things happening to you than strategizing.",
    "timestamp": 1673823600
  },
  {
    "username": "johnnytruant",
    "rating": 2.0,
    "comment": "Hype: The Game.\nUnfortunately, there's just no \"there\" there.",
    "timestamp": 1669849200
  },
  {
    "username": "jarkarussU2",
    "rating": 2.0,
    "comment": "Received the game and it is missing the Events, Intruder attack and Serious wounds decks. How absolutely RIDICULOUS!!!! Awaken Realms employs some pretty amazing QA teams. $150 to get an incomplete game.",
    "timestamp": 1655503200
  },
  {
    "username": "SebastianK",
    "rating": 2.0,
    "comment": "Really had a hard time with this game, spent too much money on it, and really dont think it is for me... sold my copy",
    "timestamp": 1652392800
  },
  {
    "username": "TwoDogsRadio",
    "rating": 2.0,
    "comment": "Dripping with theme, but hardly original. Guys, the more stuff you put in a box does not make a game better. Too many cards, too many minis, too many fiddly chits, too many rules, too many ways to die and still have hours left to play.\n\nYet another overproduced 'thematic' game galloping up the BGG ratings, but each to their own of course.\n\nVery much a case of the game playing itself with the players as onlookers.",
    "timestamp": 1645830000
  },
  {
    "username": "tempar",
    "rating": 2.0,
    "comment": "Looks great.\nGreat theme.\nThe game long, quite boring and too difficult in annoying way instead of a challenging way like ghost stories.\nThe player elimination is a deal breaker.",
    "timestamp": 1634508000
  },
  {
    "username": "Smsms",
    "rating": 2.0,
    "comment": "Setup and takedown take a long time and a lot of space. The figures, while fairly detailed, are far lower quality than several far cheaper games I own. Same with the cardboard tokens, they felt... almost squishy, definitely not solid. The fire and noise tokens were nice though. The cards are also not very high quality for the price. They would constantly stick to each other and several got bent corners/damaged edges after shuffling them once. Gameplay-wise, maybe I just had really bad luck, but both characters in my solo playthrough were dead by the end of the 4th turn with me only damaging one alien a single time and missing every other attempt. Every noise roll I had to do after turn 2 spawned at least 1 new alien, which meant I made no progress and took massive amounts of damage constantly. The rule book does not flow very well in my opinion, and even watching a gameplay video did not help much with some questions I have. In my opinion, this game is not at all worth the price I paid. It looked awesome, but my actual experience has been very negative and not even remotely fun. I donated my copy to a local game store and do not ever see myself playing this game again. I do not recommend this game.",
    "timestamp": 1633212000
  },
  {
    "username": "tasskaff",
    "rating": 2.0,
    "comment": "THE example of an overproduced but underdeveloped game. Can´t stress enough how much I loathe this cr@p. I think bottom 3 of worst gaming \"experiences\". How could AR f#ck up this awesome theme ???\nIt´s another proof \"semi-coop\" genre does NOT exist, whatever people say.\nDamn why did I KS this all-in ?\nWell, in space no one hears you yammer... :-(",
    "timestamp": 1632261600
  },
  {
    "username": "Mikeus",
    "rating": 2.0,
    "comment": "Random, plodding, tedious, one dimensional, and derivative. Its price adds insult to injury. No idea why there is such a following for such a boring experience. I might be able to find the joy in developing a narrative if the game were 30-45 minutes, not 2.5-3 hours of dice rolls and random card draws on top of a lengthy setup/tear down. If you want a “lol so random” game where you move from room to room until someone tries to kill you, play A House on Haunted Hill.",
    "timestamp": 1624917600
  },
  {
    "username": "pulla",
    "rating": 2.0,
    "comment": "The theme is nice, but it's rather brutal and the fights are a bit random.\n\nEdit: Rating down from 7 -> 2 (1-2019). Badly designed game with a good theme.",
    "timestamp": 1619647200
  },
  {
    "username": "wzsx4ed5r7c6t8f",
    "rating": 2.0,
    "comment": "When fighting aliens, draw each attack to determine how many hit points the alien has. The alien suddenly and inexplicably gets weaker and stronger during a fight. No point in planning since you have no idea how many hit points an alien will have even when you are already fighting it. Supposedly this idiotic \"design\" was meant to simulate grazing the alien, missing, gun malfunction, etc..., but the \"designers\" apparently did not consider using cards such as \"Grazing shot...\", \"Gun Malfuction...\", or something else actually representative of what is happening. I also love that noise never dissipates, it accumulates over time. Leave a hallway three turns ago? The noise you made is still there. This game is incredibly dumb.",
    "timestamp": 1610924400
  },
  {
    "username": "Woodland_Alliance",
    "rating": 2.0,
    "comment": "You can have your character doomed from the start due to blind randomness. Not fun sitting there for 2 hours knowing you have absolutely no possibility of winning.",
    "timestamp": 1604185200
  },
  {
    "username": "dedas1994",
    "rating": 2.0,
    "comment": "Kickstarter edition.\n+ Nemesis: Aftermath & Void Seeders",
    "timestamp": 1588888800
  },
  {
    "username": "blackcat1313",
    "rating": 2.0,
    "comment": "A brilliant take on the traitor mechanic, a game absolutely designed perfectly to emulate and create the kind of horror story of aliens 1 & 2... and I hate it with every fiber of my being. I hate horror stories, and being left on the sidelines twice for an hour and change while the game wrapped up is not at all fun.",
    "timestamp": 1583276400
  },
  {
    "username": "RayneUltimate",
    "rating": 2.0,
    "comment": "Didnt like it",
    "timestamp": 1580425200
  },
  {
    "username": "Foulben",
    "rating": 2.0,
    "comment": "Play for 3.5 hrs. Doing very well. Accomplish goal etc. Draw 1 card. \"Heart Attack\". You die and are out of the game with no chance for mitigation. Nope, not the game for me.",
    "timestamp": 1579734000
  },
  {
    "username": "maugli111",
    "rating": 2.0,
    "comment": "Sold after just 2 plays. Nothing original nothing new. Got tired of those coop crawlers for real.",
    "timestamp": 1578956400
  },
  {
    "username": "GarfieldKlon",
    "rating": 2.0,
    "comment": "A very thematic game. But I didn't like the fact, that at some point of the game you can't do much or are surrounded by aliens. Too much luck involved unfortunately. Dice symbols and drawing mechanism of aliens is complicated and not intuitive. In our play there were too many aliens in play and we could only kill very little of them. Fighting mechanism really sucks.\n\n\nTheme:           Great\nGameplay:        Ok\nInteraction:     Ok\nArtwork:         Nice\nLuck:            A lot of dice rolling and no mitigating\nStrategy:        You have your goals and working towards these\nComponents:      Kickstarter, nice minis and tokens\nPlay duration:   Too long\nEasy to teach:   A lot to teach\nRules quality:  not read\nSetup time:      Holy shit\nNo downtime:     Plays very fast\nReplay value:    Modular board, random goals",
    "timestamp": 1562191200
  },
  {
    "username": "Reenald",
    "rating": 2.0,
    "comment": "The game has a really cool thematic, basically copying Alien and I really wanted to like it and enjoy it... But feels completely unfinished, with mechanics that don't make sense, rules that don't fully explain all you need to know and a really chaotic first play through.",
    "timestamp": 1511305200
  },
  {
    "username": "Steinz",
    "rating": 3.0,
    "comment": "Really boring.",
    "timestamp": 1759615200
  },
  {
    "username": "Killi",
    "rating": 3.0,
    "comment": "Played once, hated it.\nPlayed a second time 2 years later, hated it again.\n\nProbably top3 of the most thematic games I played, but that is about it, there is nothing fun about this game's mechanics in what I consider fun. Will never play again and I don't get the hype.",
    "timestamp": 1756504800
  },
  {
    "username": "TomTaylor67",
    "rating": 3.0,
    "comment": "Player action : discard 1 card to move to an unexplored room.\nGame response:\n1.  Flip over randomly placed room tile.\n2. Flip over randomly placed exploration token with a random effect and random number of items.\n3. Roll the noise die (random result).\n4. If the noise token would be placed in a corridor with another token resolve an encounter.\n5. Draw a random intruder token from the bag.\n6. Check the (usually) random number on the back.\n7. If you get surprised draw a random intruder attack.\n8. Check if the intruder type is able to use the attack.\n9. If the intruder attacks, check if you get a heavy wound, if you do, draw a random heavy wound cards, and usually a random contamination card.\n10. If you aren't dead you may do your second action/pass or the next player may act.",
    "timestamp": 1755381600
  },
  {
    "username": "XeyneGaming",
    "rating": 3.0,
    "comment": "Random on random on random. Complete your objective and escape, but then you just lose anyway to effectively a coin flip, after 4.5 hours. Not worth the time.",
    "timestamp": 1752530400
  },
  {
    "username": "Beastly_Venturer",
    "rating": 3.0,
    "comment": "2 plays. Not terrible but just not for me. Ruleset kind of sucks. A game in which I was more than happy to die...",
    "timestamp": 1752357600
  },
  {
    "username": "BigspenderPL",
    "rating": 3.0,
    "comment": "To much downtime, to much rules, early player elemination.",
    "timestamp": 1749765600
  },
  {
    "username": "kilianbognar",
    "rating": 3.0,
    "comment": "This is not a game where you make clever decisions or experience tense social dilemmas, but it is a game you’ll play for a long time. I mean for a loooong time. And it seems like the designer tried to inject tension by making it really lucky. While it undeniably looks good on the table, I really don’t understand the appeal. I think people have to buy into the theme and treat it as a device for roleplaying Alien; that's the only way I can imagine they find enjoyment in it. Otherwise, I don't feel this game has much to offer. Am I missing something?",
    "timestamp": 1742943600
  },
  {
    "username": "haihappen",
    "rating": 3.0,
    "comment": "After playing it two times, I can say I don't like it despite having solid main mechanics in my opinions.\n\nExamples: One player's character died in the third round, by being infected at the end of the turn, then the event killed the character. Horror elimination game, alright. But the (in my understanding optional) method of keeping an early eliminated player in the game, i.e., them taking over the aliens, is poorly implemented/thought out. It would have been easy for the then-alien player to wipe the other players from the map, due to having drawn good cards for the current map state.\nIt feels very antagonistic and mean.\nIn the another game, two players evacuated early, then spend half an hour sitting next to the game until it finished.\n\nFor a game that came out in 2018, this feels like it was designed in the late 90s from how player interaction is handled.",
    "timestamp": 1739314800
  },
  {
    "username": "Meekered",
    "rating": 3.0,
    "comment": "Beautifully made game. However, the game envokes a lot of aggression which spoils the game play. Game play mentions up to 180 mins. Our group of 5 took 7 hours to play.",
    "timestamp": 1739142000
  },
  {
    "username": "Szymon_Archon",
    "rating": 3.0,
    "comment": "Honestly just seems really unfun, to me at least. I don't know if I'm just unlucky but every time I play this game I die almost instantly right out of the gate, even when traveling in a group.\n\nI understand the atmosphere the game is going for, but it's just not for me. Rather than being \"scared\", the mechanics just seem annoying to me.",
    "timestamp": 1736463600
  },
  {
    "username": "zackt",
    "rating": 3.0,
    "comment": "Very thematic, highly detailed miniatures, but WAY too swingy and lucky for how long of a game it is. Just not for me",
    "timestamp": 1734562800
  },
  {
    "username": "Elysian1196",
    "rating": 3.0,
    "comment": "I get why this game is popular. For its target audience, this game’s dripping, tense atmosphere is superb and is great for telling your own Alien story. But for me, Nemesis is just too random, too fiddly, too bloated, and too dang long with a bad player elimination problem to boot. It feels so awful if you get injured early or the queen shows up on top of you or an event screws you over for the rest of the game with no agency whatsoever. And nothing bests setting up the game for a half hour and waiting another half hour for the rules explanation only to die on turn three in a three hour game. This is an exercise in the worst type of frustration.",
    "timestamp": 1729980000
  },
  {
    "username": "Shmickwahoo",
    "rating": 3.0,
    "comment": "Only play was on TTS. So i have given it an extra point. Would be willing to try again in person if someone was keen only because i recognise TTS is not ideal. That said i saw nothing here that indicated it was worth returning to at all.",
    "timestamp": 1729980000
  },
  {
    "username": "zzodoo",
    "rating": 3.0,
    "comment": "This game is definitely not for everyone. The main problem for me personally is that it does not reward you and your decisions. You spend several hours to get no dopamine, regardless of whether you win or just die by accident.",
    "timestamp": 1729288800
  },
  {
    "username": "AileTheAlien",
    "rating": 3.0,
    "comment": "This game is *very* convoluted and complex. It took us half an hour just to set up. Some of the complexity is needed, to hide players' intents from each other, because some of them could have traitor goals. (For example, each player has their own deck of action-cards, for the pilot, scientist, etc.) However, some of it is needless. Cards that you draw, to just pick the different characters/jobs? You can just shuffle the big cardboard character-cards. Tokens that have meaningless symbols on them for each type of alien, just to use the grey unrememberable plastic figurines of each alien? Should have just been tokens with uniqueportraits on them. The board itself is also very loow-contrast, so if you've got poor eyesight or a lamp in a bad position, you'll have difficulty seeing what's where. My friends and I were just thinking of ways the game could be streamlined, for the two hours we struggled to maintain interest playing. :|",
    "timestamp": 1728597600
  },
  {
    "username": "HolyRayne",
    "rating": 3.0,
    "comment": "Overly complicated for a game so built on random chance. Difficulty is very high and on top of that you have traitor mechanics. Game seems to be geared towards creating a narrative experience rather than providing solid gameplay mechanics.",
    "timestamp": 1725400800
  },
  {
    "username": "mortoray",
    "rating": 3.0,
    "comment": "I felt the game sets you up to lose. It's mostly cooperative, as you'll just all lose unless you work together. The individual goals are hard to achieve. Overall I just found the endless fighting annoying, with no sense of adventure.",
    "timestamp": 1724536800
  },
  {
    "username": "GhostInside",
    "rating": 3.0,
    "comment": "I love the first Alien movies, and this does a good job of capturing the feel, but mechanically it feels pretty flat as a game. I love the idea of searching around and finding enough stuff to cobble together an upgraded weapon or specialized tool, but in reality it just doesn't happen because the pressure is so great all the time.\nMy local group picked this up and there is big excitement for it, so we'll see how it feels after another 10 plays.\n\nUpdate: Played again, lowered my score to 3. This thing is so poorly designed it is a crime. Sure, it is dripping with theme, but the mechanics are atrociously bad. I ended up with the scientist, played for 3.5 hour and only got to take 1 meaningful action... which was trading some medkits to another player. I got pinned on one side of the ship and by luck of the draw there wasn't a single computer and only green rooms. So I wasn't able to do any quest items, all objectives impossible, I took exactly zero computer actions, and 7 search actions yielded nothing but medkits and bandages. I basically sat around watching other people play the game.\nIt was incredibly boring and I have no interest to ever give it another chance. There are so many good games out there to be played, this one is a massive waste of potential.",
    "timestamp": 1718316000
  },
  {
    "username": "Anton_Knittel",
    "rating": 3.0,
    "comment": "If you are on a broken spaceship and there are carnivore aliens everywhere odds are you wont survive. So this game kinda fulfills its promise. But the fact that it takes almost an hour to set up and explain everything only to be slaughtered after the 2nd or 3rd turn is pretty frustrating. I tried it a couple of times with the same outcome. Doesnt matter if you are a survival game expert: you will die! I am a fan of challenging Coop games, but this feels unbeatable to me.",
    "timestamp": 1718229600
  },
  {
    "username": "yiechow",
    "rating": 3.0,
    "comment": "Semi cooperative game is really not my type. Only played once and probably won't play again.",
    "timestamp": 1715205600
  },
  {
    "username": "Geroid",
    "rating": 3.0,
    "comment": "The second game I played of Nemesis was a 4 player game. I thought doing nothing (passing) on 2 or 3 turns was best. When I rolled dice nothing bad happened to me, but lots of bad stuff happened to others. I won the game, but did I deserve to? The first game was even more luck based, as hard as that is to imagine.",
    "timestamp": 1713477600
  },
  {
    "username": "eunseob",
    "rating": 3.0,
    "comment": "Randomness for three hours only presents displeasure.",
    "timestamp": 1709766000
  },
  {
    "username": "warlock000",
    "rating": 3.0,
    "comment": "Played it once with 4 players and to me it felt like a boring slog with very little player agency and lackluster turns in terms of satisfaction from what you manage to accomplish when it is your turn to act. Everything was a chore to overcome. The theme is great, but it's not enough to save this game. Won't play this again, that's for sure.",
    "timestamp": 1703631600
  },
  {
    "username": "MatteAce",
    "rating": 3.0,
    "comment": "early player elimination in 2020?? are you guys kidding me??\n\nalso, the game is fun but completely and absolutely random.",
    "timestamp": 1703545200
  },
  {
    "username": "brownsound",
    "rating": 3.0,
    "comment": "Wyobraź sobie dwuosobową partię, z której jedna osoba odpada po trzydziestu minutach, a druga gra solo przez 3 godziny. Paranoja.\n\nMiałem z tą grą love-hate relationship. A teraz uważam, że jest po prostu popsuta. Nie. Po prostu nie.",
    "timestamp": 1702854000
  },
  {
    "username": "lexen",
    "rating": 3.0,
    "comment": "this is a ok game for a once experience not a good game",
    "timestamp": 1696629600
  },
  {
    "username": "byronator",
    "rating": 3.0,
    "comment": "It's probably good for what it is and what it is trying to do, but I'm not a huge fan of these story games. Played on TTS.",
    "timestamp": 1692050400
  },
  {
    "username": "JoeyD3579",
    "rating": 3.0,
    "comment": "I'm sure it's great fun multiplayer, but as a solo gamer primarily it really does fall flat",
    "timestamp": 1690927200
  },
  {
    "username": "aquaboy93",
    "rating": 3.0,
    "comment": "Pros:\n- Very thematic\n- Beautiful miniatures\n- Full co-op can be a fun experience sometimes\n- Components are decent\n- Can be quite tense and engaging\n\nCons:\n- Mechanically messy\n- Semi-co-op is borderline unplayable due to player elimination and other factors (underpowered traitor)\n- Multiple encounter systems make the games overly complicated without being more fun or interesting\n- Nemesis weakness system is not useful whatsoever (honestly most systems in the game are badly implemented)\n- Poor combat system",
    "timestamp": 1690668000
  },
  {
    "username": "AuroraBC",
    "rating": 3.0,
    "comment": "Way too easy to win once you figure it out!",
    "timestamp": 1689544800
  },
  {
    "username": "gamerdoge",
    "rating": 3.0,
    "comment": "played 5 for 4 hours. very fiddly. not streamlined. map not functional (very hard to see). Logic is broken (e.g. take two item choose one). there are way other better semi coop games. setup and teardown is annoying. definitely overhyped, people buy this just for the minis, and gave good rating because they already pay hundreds of dollars.",
    "timestamp": 1689544800
  },
  {
    "username": "Zengoeroe",
    "rating": 3.0,
    "comment": "How to waste precious time on a game that is not even a game. It's basically Russian Roulette with huge mini's to look at so that it seems that it is a great game.\nLowering my rating to a 3, complete luck fest, no fun whatsoever, little boys will always like big mini's and beautiful toys, it is however... not a game, it is a piece of art to look at on the table.\n\nFor those who do not understand why people do not like Nemesis?\nActions are meaningless, the chance of winning a game session is based on pure luck, there is no logic whatsoever in the game design and the fact that you can play it in different ways just shows that the designers did not know what they were doing (which is more and more a trademark of Awaken Realms), putting together lots of different game mechanics does not mean you are making a great game.\nIf you are a fan of the Alien-movie, just rewatch it, your time will be better spent unless you are a person that gets his kicks of watching his gaming group getting its ass kicked without even a remote chance of having a fair game.\n\nIf I want to get my ass kicked in gaming, I'd rather play Dawn of the Zeds solo, that way I do not have to waste precious gaming time of my gaming group.",
    "timestamp": 1684620000
  },
  {
    "username": "jibibgg",
    "rating": 3.0,
    "comment": "Roll and move choose your own adventure with Lacerda level rules but Munchkin level randomness.\n\nLike a horror house ride. You don't know where anything is but your path is still railroaded (go check engines, go check cockpit, try to hibernate, see if the dice kill you along the way, substitute random tile flips, chit pulls and dice rolls for actual substantive narrative).\n\nTo it's credit it's actually really quite fun the first play and then there's nothing else much there but you've still agonized over learning all these rules and you have to find players to sit through your teach and now you've got this huge $300 box with a shit game.",
    "timestamp": 1684360800
  },
  {
    "username": "Zenith123138",
    "rating": 2.5,
    "comment": "Blame this guy https://boardgamegeek.com/user/poggydude",
    "timestamp": 1680300000
  },
  {
    "username": "shmonkey",
    "rating": 4.0,
    "comment": "I like the freedom and flexibility of the game, and the combat and itemization feel fine. But because the story arc or cinematics don't do anything for me, the amount of variability in the random feels bad. I don't mind when randomness throws hurdles at a player, for example the contamination/infection mechanism. It loses me when stuff like the event card can just straight up kill a player with no dice roll, no interaction, just random status based interactions. I didn't mind being eliminated, but in principle I have a huge issue with a 4 plus hour long game that can completely fuck you over and completely derail all of your careful planning and actions in a way that can't be recovered from. Random chance made the map layout incredibly difficult for me, but that wasn't a problem. Turns out nobody won because nobody hit their objectives. I guess overall for my tastes, the game is too far dialed over to the \"cinematic experience\" side of things and not enough towards the game side of things. There's a huge disconnect because the rest of the game mechanics all very much point towards \"gamey\" elements, but that's kind of a bait and switch because ultimately what you do probably won't matter. It *can* matter, but I think the variability is a bit too large.\n\nI also feel like the game throws a little too much at you. Because you're constantly dealing with BS, the traitor mechanic is somewhat pointless. You don't really have the opportunity to follow up on whether or not the other players are being truthful. There's also a few unfun things, like ammo is too tight. I feel like the aliens should be a bigger threat, and give you more opportunities to combat them. Not sure if Nemesis had fire extinguisher items, but if not that's one thing I would definitely Port over from Adele and maybe even start each player with a single use extinguisher. The game doesn't allow you to choose what to do and where to go, it largely throws serious enough hurdles at you that you must address them.",
    "timestamp": 1759874400
  },
  {
    "username": "camille deveaux",
    "rating": 4.0,
    "comment": "On peut passer un excellent moment tout comme le jeu peut être une purge de plusieurs heures...",
    "timestamp": 1756591200
  },
  {
    "username": "Lazyladd",
    "rating": 4.0,
    "comment": "+Great Theme/ Vibe\n+Really makes you feel like you're in the movie \"Alien\"\n-Rulebook is all over the place (tip: check out the Community-made rulebooks)\n-Every Action I take leads to negative consequences (thematic, but just not my cup of tea)\n\nWorks fine if you're the right person for it.",
    "timestamp": 1754604000
  },
  {
    "username": "Draiqil",
    "rating": 4.0,
    "comment": "Due to dead of winter existing, i'm not actually going to ever initiate a play for this. I prefer working as a team and socialising and Nemesis really is \"your on your own\" and constant betrayal tension.",
    "timestamp": 1753912800
  },
  {
    "username": "perashaman",
    "rating": 4.0,
    "comment": "I have played twice. I think this is a truly poorly designed game. You are at the whims of card draws and dice rolls, which is generally fine. But the downtime and player elimination aspects take a mechanism that I don't like (draw/roll and pray) and make it unbearable. I have no idea how such a long game with so few meaningful decisions is so popular.",
    "timestamp": 1748728800
  },
  {
    "username": "HutvagnerJoska",
    "rating": 4.0,
    "comment": "Good choice if you would like to suffer for a few hours. Price tag is ridiculous for this board and components.",
    "timestamp": 1747951200
  },
  {
    "username": "Elm0__",
    "rating": 4.0,
    "comment": "Interesting premise, subpar delivery.\n\nEDIT: After reconsidering, I decided to lower the score further 2 points. The reason is my general tiredness with the culture of overproduced and underdeveloped kickstarters and this game unfortunately fits the bill.",
    "timestamp": 1738191600
  },
  {
    "username": "Wagemaker",
    "rating": 4.0,
    "comment": "played 4 times",
    "timestamp": 1735167600
  },
  {
    "username": "Rygel",
    "rating": 4.0,
    "comment": "Many like this game. It is rated very highly.\nI just didn't like anything about it.",
    "timestamp": 1732057200
  },
  {
    "username": "Akado",
    "rating": 4.0,
    "comment": "This is Ameritrash, with no floor or ceiling. I walked into a room, got slimed, and could either lose another turn to accomplish nothing (falling behind two turns to others) or continue forward alone (no one wanted to go through slime). I moved forward, and got eaten.\n\nTechnically, I made two decisions that whole game, but \"Which unknown room out of four do you want to go to?\" isn't really a decision in my book.\n\nWhile I'm not too unhappy about Ameritrash games having high randomness and impact, I simply would prefer to play other games (Cthulhu: Death May Die, Mansions of Madness 2e).",
    "timestamp": 1731366000
  },
  {
    "username": "latschediwes",
    "rating": 4.0,
    "comment": "Nemesis is one of those \"Serious Gamer’s Games\" coming from one of those \"miniatures-first\" companies. As much as I love miniatures and games that tell stories as well as the ALIEN franchise, I'm unimpressed by Nemesis in many ways.\n\nFrom top to bottom, it’s the way that the game is bloated that is really the heart of the problem.\n\nFirst, the game is overwrought and full of needless detail. That makes it tough to get to grips with the story, making it hard to invest properly. At the surface, Nemesis appears to be a traitor game (think of Aliens the movie, but everyone is playing Burke), but the social maneuvering isn't open, but hidden under layers of busywork. There is a plethora of stuff in this game, which makes it impossible to look at anything else but selected points here, but e.g. I don't see the need for five different Xenomorphs, for three different item categories and for multi-use action cards (because, hey, everything else would have been a far simpler, less convoluted approach, right?) and many more.\n\nSecond, the production is ridiculous. Nemesis certainly isn't the most overproduced game that ever existed, but I just can't agree that this game makes good use of its size to create a complete and holistic experience. I would argue that Nemesis probably benefits from miniatures, but it is the sheer scope and prize to it that makes me go on the warpath. Publishers are just throwing out shit left and right these days.\n\nYes, the game delivered on being a story generator. However, I would have wished for a more contained and refined product, that is less directed towards the consumer market and that comes with more direct and textured interaction.",
    "timestamp": 1729893600
  },
  {
    "username": "MartynF",
    "rating": 4.0,
    "comment": "I can understand why others love this game. It didn't appeal to me and my brothers. Mainly of the randomness with which the enemy shows up.",
    "timestamp": 1728424800
  },
  {
    "username": "thewamts",
    "rating": 4.0,
    "comment": "Betrayal on the House on the Hill but longer and with minis. Not my jam.",
    "timestamp": 1726783200
  },
  {
    "username": "arildoaim",
    "rating": 4.0,
    "comment": "Suprisingly unengaging. Shocked by the 8,3 rating!\n\nNot much agency, long downtime (at 5plrs), and greatly overstays welcome for what it offers. Basicaly haunted hill / mansion madness in space. Think i prefer xcom-style tacticals or even clank in space which feautres an evolving deck and plays alot faster.\n\nPluses:\n++ cool contamination scanner gimmick\n+ cool presentation (execept the drab board)\n+ variability\n++ hidden personal agendas\n+ smart tracking of searcable items with the rotating rooms",
    "timestamp": 1725832800
  },
  {
    "username": "deepskyblue",
    "rating": 4.0,
    "comment": "I’m sure this is superb for those looking for a thematic Alien-esque luck-fest, but unfortunately I’m not one of them.",
    "timestamp": 1723672800
  },
  {
    "username": "Neso91",
    "rating": 3.7,
    "comment": "221024 Good mechanics but I feel like, even if there's some strategy, in the very end surviving it's just a matter of luck.",
    "timestamp": 1721253600
  },
  {
    "username": "murph0499",
    "rating": 4.0,
    "comment": "Player elimination is awful. Because of the nature of the game, you are constantly getting kicked in the teeth. Game is fun when you’re not getting screwed but other than that, it’s not a fun time. I wouldn’t waste a game night on it as at least one player will have a bad time. Go with BSG or Unfathomable instead.",
    "timestamp": 1720908000
  },
  {
    "username": "kendallgrubbs",
    "rating": 4.0,
    "comment": "I’m not a co-op fan, nor that wrapped up in forced thematics. Options seem super limited, and the game more or less just happens with little incentive to work together. It has a dice chuck feel that just doesn’t grab me. It’s entirely too long for what it is, which is just a sub par experience.",
    "timestamp": 1717538400
  },
  {
    "username": "Kingsoby1",
    "rating": 4.0,
    "comment": "Best co-op/ hidden traitor game.",
    "timestamp": 1710630000
  },
  {
    "username": "Viedras",
    "rating": 4.0,
    "comment": "Great production quality and art, but the game itself is way way too random for my taste. Feels almost as it plays itself.",
    "timestamp": 1708210800
  },
  {
    "username": "Narlgoth",
    "rating": 4.0,
    "comment": "Nemesis (and it's various interations) is a bloated, miserable mess of KS funded board game spaghetti.\n\nPlayers are crew on a ship playing the Alien movie franchise. You have your own secret agendas you must complete, then get you ass off the ship to safety.\n\nOn paper it sounds great- the game looks like the movie Alien, the artwork is like what you'd get if you asked an AI art app to create a load of Cyberpunk 2039 themed Dead Space art, and it looks great. The character portraits have loads of character, especially the ones from later expansions.\n\nThe rules also have loads of good sounding stuff. The aliens come in Chest Burster through Alien Queen sizes, the ship is random and has many rooms with different functions for the ship. Each character has unique action cards that only they can do. The secret agendas make you feel like the company mole, sabotaging the ship, altering the ships course, trying to get people killed. There's an infection system that clogs your action hands, and if you escape you have to scan them all with a special colour filter, and if you are actually infected you die anyway, so you gotta go get cleared of possible contamination. There's power systems, fire protocol, a crafting system.. The list goes on.\n\nAnd that's the real issue. Nemesis is a hulking pile of Alien themed stuff poured into several boxes until they are all overflowing. The result is an overwhelming list of rules, systems and exceptions to teach and track. Every game half the rules need to be reexplained, usually a quarter of them three times, sometimes more even then that, because Nemesis is overly complex rules salad that even experienced players constantly struggle to keep hold of.\n\nI get why it's so popular. The various expansions and all the rules mean you have a sandbox of Alien/sci-fi horror stuff that can do a good job of capturing the oppressive and miserable tone of the source material quite well. Does it make a good game system? Eh..\n\nIts a 'losing by degrees' style game. The strongest you will ever be is in the first couple of turns whilst there's no enemies. As soon as event cards start queueing the game spirals into a mechanical beat down as you find yourself trapped in a room on fire, aliens in every room around you, your room's ability is malfunctioning, your weapons do next to nothing, you are bleeding out, contamination clogs your hand so you can't move, you are in darkness and you somehow aren't dead, but you can't do anything, so you just throw yourself mindlessly against the bad things, because it's either do and struggle on or die and finally get to go home and leave the other suckers to keep playing. None of these options are fun, just hopeless and demoralising.\n\nSome people will say that's a successful simulation of the genre. I say that when nothing feels fun it's a bag of dicks. Nemesis is an unfun, miserable bag of dicks.\n\nAt least if it's cooperative I can lament with my friends about our trials and tribulations.. Oh right, it's a semi-coop, so nobody is helping each other either as they are all worried about being in each other's crosshairs.\n\nThe expansions add various flavours of sci-fi horror, including Dead Space Carnophages, Pitch Black darkness monsters, Lovecraftian ethereal monsters, as well as new boards, etc.\n\nInterestingly I like Arkham Horror 2nd which can also be a random emotional beatdown at times, so what's the difference here? Maybe it's that sometimes you are actually winning in AH.. In Nemesis you are always on the back foot, with many mechanics that should be helpful often being irrelevant or ineffective, whilst the enemy systems are overwhelming and difficult to keep on top of.\n\nAll in all it's not the definitive Alien game for me. Think that's probably still Space Hulk for all it's simplicity.",
    "timestamp": 1706655600
  },
  {
    "username": "Onbase",
    "rating": 4.0,
    "comment": "I see the potential for really great, cinematic \"Alien\" experiences. Unfortunately, they don't seem to occur often enough to outweigh the setup/teach time and all of the unsatisfying endings.",
    "timestamp": 1699398000
  },
  {
    "username": "LonelyTree",
    "rating": 4.0,
    "comment": "Everything about this game is random. There is randomness in the room set up, the bag draw for the alien tokens is random, the draws for cards on attacks, events, and wounds is random. The draws for items are random. The destination and engine status are random. And then you have the dice. The only thing that isn’t random in all of the game is your starting cards for the abilities.\n\nWhile I tend to enjoy this game, it’s very, very long for the amount of randomness that is involved. You have no agency in this game. I like it less every time I play, and think it may be time to move it on.",
    "timestamp": 1699052400
  },
  {
    "username": "HeroicLeigh",
    "rating": 4.0,
    "comment": "Interesting concept and some good mechanics, but feels tedious just for tedium's sake. Gameplay quickly feels like a drag and you can go turn after turn feeling like you're accomplishing nothing. Most turns feel like taking a step backward, leaving you feeling punished no matter what you do. Yes it's meant to be hard, it's meant to represent a difficult situation, but other games manage this while making you feel rewarded by the gameplay. That is not the case with Nemesis.\n\nIt's a game that feels like counting change to buy either a burger or a drink from McDonald's $1 menu: no matter what you do, you lose.",
    "timestamp": 1686607200
  },
  {
    "username": "uduhno",
    "rating": 4.0,
    "comment": "The theme, atmosphere, and quality of the pieces are amazing. That said, the game is too random and feels more like an event than a board game. People can die completely randomly and be out for the whole game. Do not use the alternate rule to let them control the monsters, there is a reason the monsters have automated actions.",
    "timestamp": 1683237600
  },
  {
    "username": "medievalbanquet",
    "rating": 4.0,
    "comment": "See my session report.",
    "timestamp": 1682373600
  },
  {
    "username": "K Fay",
    "rating": 4.0,
    "comment": "Gabriel",
    "timestamp": 1681509600
  },
  {
    "username": "Virus1988",
    "rating": 4.0,
    "comment": "Coop better than classic version of gameplay.",
    "timestamp": 1679180400
  },
  {
    "username": "cromatoast",
    "rating": 4.0,
    "comment": "1 -play, 5-players - TTS: The theme and setting are quite appealing to me; and they do come through as you play. However, the gameplay is extremely incremental and the personal goals are very wacky - you can basically have someone else complete 50% of your goal for you without them even knowing. I sort of went off on my own and never felt particularly threatened or connected to everything else that was going on. My personal goal was for player #2 to die, but all I did was wander around and hope he got killed. I never felt particularly invested in anyone else's goals either.\n\nWe lost as a group because of some malfunctions and it was pretty anti-climactic. I think the experience suffered due to playing on TTS but I don't think the game quite comes together.\n\nA couple of the people I played with compared this to Dead of Winter (which I strongly dislike) - due to the semi-coop nature. Nemesis destroys DoW on theme and setting, but DoW is much snappier and playable, overall.\n\nNB: while we were playing this I checked the BGG page and was absolutely shocked that it was #31 overall. I no longer put much stock in the rankings but that was still surprising.",
    "timestamp": 1678834800
  },
  {
    "username": "tin_snips",
    "rating": 4.0,
    "comment": "Great production value doesn't hide the shallow mechanics and the unnecessary reliance on RNG. Could be great with some rule changes.",
    "timestamp": 1678230000
  },
  {
    "username": "junior_gracz",
    "rating": 4.0,
    "comment": "Talisman or this.\n\nNemesis is random, atmospheric and truly adventurous . It was great fun playing it up to 3 times.\n\nThe problem is: after that. You can be stuck with a VERY expensive game which you may not want to play anymore. Honestly, Talisman is better - but sure it's a different theme. Sadly it is a weird feeling that such an expensive game has not top notch components (the board is ugly and minis are subpar .. ugh ugly melted plastic everywhere) and offers you a repetitive, long experience. You will never play a 5 player game in 180minutes.\n\nMany are rating this game high because they WANT to like it. But I highly doubt they can play it much. -2 stars for another bad KS campaign.. this counts, the company is clearly going for agressive and constant millionaire projects, while leaving backers with a lot of missed expectations",
    "timestamp": 1677970800
  },
  {
    "username": "cgmg",
    "rating": 4.0,
    "comment": "It does a great job simulating an alien / predator type movie experience. Thematically fantastic. The game overall however is 9 types of RNG interacting and your \"tactical\" choices only mildly mitigate your risks doing literally anything. I've done \"everything right\" for a playthrough or two and still died first having accomplished no objectives, just subjectively not a fun play experience for me.",
    "timestamp": 1677452400
  },
  {
    "username": "Klausi300",
    "rating": 4.0,
    "comment": "4 IR",
    "timestamp": 1676156400
  },
  {
    "username": "Keahaw",
    "rating": 4.0,
    "comment": "A bit of a mixed bag. I liked the thematic elements and the broad structure. However, it’s frustrating in its execution. Maybe I could have the perfect game but I suspect too many plays will feel like blindly (and pointlessly) running around in the dark.",
    "timestamp": 1672182000
  },
  {
    "username": "Fried Egg",
    "rating": 5.0,
    "comment": "I felt like I had so little agency but maybe I would play a little better next time.\n\nVery long and fiddly ruleset didn't help either.",
    "timestamp": 1761519600
  },
  {
    "username": "Lemem",
    "rating": 5.0,
    "comment": "Nemesis is a semi-cooperative game that executes on theme and falters at pretty much everything else. It tells a great story but as a consequence the narrative hinders the gameplay. Movement is slow, items are scarce, and the action deck is repetitive and often times unexciting; these limitations are not fun despite the thematic accuracies they represent. The replayability seems questionable but perhaps the hidden objectives can facilitate enough different experiences from play to play. In the end, Nemesis is more of an experience than a game in my mind but to many that's exactly what they want.",
    "timestamp": 1760133600
  },
  {
    "username": "ImZhe",
    "rating": 4.5,
    "comment": "So much rng, much rather play stationfall",
    "timestamp": 1759960800
  },
  {
    "username": "f19971231",
    "rating": 5.0,
    "comment": "Too many details.I need to seek the ability of room before acting every turn.",
    "timestamp": 1756159200
  },
  {
    "username": "purplecow55",
    "rating": 5.0,
    "comment": "Players move around the ship exploring all hoping to complete the secret objective while monsters spawn and take over the ship.",
    "timestamp": 1746655200
  },
  {
    "username": "Grumpug",
    "rating": 5.0,
    "comment": "Tags: KS",
    "timestamp": 1746568800
  },
  {
    "username": "Majkl9102",
    "rating": 4.5,
    "comment": "+ Nice art, components\n\n+- atmosphere is only with new people and in first or second game... after that nobody build atmposhere no more\n\n- Game push you into \"coop\", but you can easly ignore that, no needs cooperete at all\n-- it is NOT semi cooperative and if you do not play it with coop quest, it is cooperative neither\n- A lot of luck involved\n- player elimination in beginnings of game is totally normal (almost every game)\n- Variable value of live of intruders, one turn have 2 lives and later that same figure have 4 etc\n---- Badly writed Rulesbook and no hint cards. I read 100+ rulebooks per year, and these one are really bad. If you check files on bgg, a lot of them are hint list, player aid, summary etc.\n\n---- example, one player escape, 3 died, last me wanted leave with escape pod. But due game, events and rules, from time when I trying escape: I musted kill 5 adults in same room, they show up and be killed one by one... after of 20 minutes of rolling dice without any movement foward or atleast backwards, I gived up and end the game. After that game we check rules and we played it correctly, that means I had no fun due game itself. Similar games ends we have often.\n\nWhat kill theme:\n- It is obviesly based on movie Alien, but NO, \"shhht\", it is \"not\"...\n- It makes no sense that you have no idea where any rooms are on the ship\n- You don't know where any rooms are, yet know how to get to the bridge or engine rooms.\n- Trading should be free\n- No way to remove noise. It just sits there until you have an encounter. If no one has been in the room for a few turns, that noise should have quieted down.",
    "timestamp": 1739660400
  },
  {
    "username": "FavnirLiorenth",
    "rating": 5.0,
    "comment": "let me just say I am very glad to have had someone explain the rules to me. and look up the rule book whenever something is unclear. which happens a lot.",
    "timestamp": 1736118000
  },
  {
    "username": "bane316",
    "rating": 5.0,
    "comment": "Long, tedious, unfair, relies on luck. not for me. The game is beautiful though,",
    "timestamp": 1735254000
  },
  {
    "username": "hiimjosh",
    "rating": 5.0,
    "comment": "This surprised me. I was expecting to kind of hate it, but I think I may have found my favorite thematic game? This is of a class of game that I have zero interest in owning, though I'm happy to play on occasion. This is the game that will take up the entire game night and not really leave any time for anything else. It fits in a category with BSG and Arkham Horror - old school FFG basically.\n\nSo Nemesis long. The teach is far from trivial. We had someone experienced teach the game. I would personally hate to do it, but they loved doing it and did a pretty good job only getting one minor rule wrong. While the game has a lot of (read: too many) rules, the flow is surprisingly easy. It uses a nice card mechanism that holds the whole thing together: use cards for their powers (generally speaking) or discard them for basic actions. Even on a learning game, it was easy to piece it together bit by bit because many things don't take effect until later in the game. Lots of rules yet approachable and drip-feeding.\n\nPlayers draft secret objectives which force players to make unusual decisions. This helps fuel the narrative of the game. Often times you will need several things to happen to win, so it's about trying to string together the pieces to enable them to happen. The semi-cooperative part works very well in my opinion. Players need to work together to have shots at their objectives which means they need to be open and honest about what they need. That, of course, allows for backstabbing and lies to come into play. There is a lot to talk about with the theme and how it comes into play. Some of my favorite moments: one player making a mad dash and escaping off the ship in the mid-game; three players deciding to cooperate and stick together only to have one break off from the pack to pursue their own objective (everyone died because of that), one player starting a grudge and locking someone in with the queen - another player breaking down the door - then the queen patrolling onto the begrudged player's square and killing him.\n\nOne of the coolest mechanics is getting contaminated - usually by being scratched by an alien. You don't know if you are infected or not, and if you are infected at the end of the game, then you automatically lose. You need to analyze the contamination to see or not, and you do so by sliding the card into a decoder which tells you. If you are infected, then you need to figure out a way to heal yourself before the end of the game - generally on top of whatever you were already trying to do. Swingy but very thematic and well-executed.\n\nThe only thing I didn't like about the game was how long it was once everyone was split up. I don't care what is happening on your turn if you are so far away from me, and with 5-10 minute turns sometimes - that adds up. Nemesis is overly long, but I enjoyed most of it and thought the story at the end of it all was worth it. This is Ameritrash done very well. Chromey but without the finicky rules.\n\nOkay - one more thing I don't like. The game has too many symbols and has some graphical design issues that could have been streamlined. They are minor, but things like using glass beads vs. using counters.\n\nEDIT: Follow-up play was nowhere near as cinematic but just as long. I think one issue with the game is how difficult the goals are and how little control you have in achieving them. The group needs to become convinced to play this as a cooperative game for the good guys to win. Down a notch.",
    "timestamp": 1732489200
  },
  {
    "username": "Honeypig",
    "rating": 5.0,
    "comment": "I didn't like the maps design and layout. I found the game was quite boring and stupid to me. Even I have finished my mission long long ago and already exited to the portal C. And waited everyone else to finished their turns. At the end, the last token killed us all. Wasted the 2 hrs of our times.",
    "timestamp": 1725919200
  },
  {
    "username": "watabean",
    "rating": 5.0,
    "comment": "too heavy, too expensive, and the game is easily broken. The theme is enjoyable.",
    "timestamp": 1723759200
  },
  {
    "username": "Ctrlalt",
    "rating": 4.9,
    "comment": "This game has a lot of wasted potential, but with substantial houseruling, it might become enjoyable.",
    "timestamp": 1719093600
  },
  {
    "username": "EugeneLiu49",
    "rating": 5.0,
    "comment": "sold the game after my first play. too much nitty gritty stuff that makes the experience not fun for me.",
    "timestamp": 1718056800
  },
  {
    "username": "Trevor03",
    "rating": 5.0,
    "comment": "This is certainly a divisive game. There are some who will put this in their top ten, as it has some great qualities like the thematic feel and ability for stories to emerge. I can definitely see the appeal for the right group.\n\nThematic, chaotic, and extremely long. I can enjoy randomness in games, but when that randomness involves player elimination (with the possibility of that occuring 30 minutes into a 3-hour game), I can't see myself wanting to return.\n\nYou don't go into a game like this with hopes of there being balance. There are at least four different randomness variables that are present - from scoring conditions conflicting, aliens appearing in rooms, end-game infections maybe being present, and attacks insta-killing you versus missing entirely.\n\nUltimately, if 3-4 hours of this sound appealing, then this will be a top tier game for you. I still had fun(ish) playing once, but can't see myself returning. I'd love if a game like this existed in a 1-hour format, where the randomness and player elimination wasn't so game-ruining for me.",
    "timestamp": 1717106400
  },
  {
    "username": "frenchyoman",
    "rating": 5.0,
    "comment": "Il n'y a pas d'évolution de personnage et pas de gestion. On subit beaucoup les aléas des jets de dés, des cartes tirées. On ne peut mettre en place aucune stratégique en étant obligé de s'adapter à chaque coup du sort. Et je n'aime pas le potentiel bluff.",
    "timestamp": 1713996000
  },
  {
    "username": "victorpalmer",
    "rating": 5.0,
    "comment": "As solit / coop / comp : 3 / 5 / 7 played only with base game\nThe 7 is thinking that is ameritrash and playing comp. mode, but if I include the other two modes the final score is 5.\n\nLuck based ameritrash game (impossible to win without luck) and very thematic (but no narrative and it is not a simulation because it has abstract mechanics). Better with 4 or 5 players (in the mode comp).\nI'm disappointed with solitaire and coop modes (excessive randomness and without difficult levels, towards less hard to win). Zero victories in these two modes (10-15 games). Very variability in the way to lose :-)",
    "timestamp": 1713823200
  },
  {
    "username": "gsiegele",
    "rating": 5.0,
    "comment": "Long game, a lot of randomness, lots of rules. Not worth the payoff for me. I like BSG better, but that has too many rules for me too. I prefer elegant, streamlined design.",
    "timestamp": 1712959200
  },
  {
    "username": "horodlbrodl",
    "rating": 5.0,
    "comment": "Very exciting idea, badly translated into clunky game mechanics. This game takes too long for what it delivers, randomness is unnecessarily high, balancing is beyond questionable (especially the quests!).",
    "timestamp": 1710370800
  },
  {
    "username": "Shanataha",
    "rating": 5.0,
    "comment": "It was a little less than 7. It wasn't that fun.",
    "timestamp": 1707001200
  },
  {
    "username": "individyouall",
    "rating": 4.5,
    "comment": "So little player agency. Secret objectives don't make sense on occasions and have players running around trying to do actions but unable to tell others because of the traitor mechanic. Add in the potential for player elimination because of bad random die rolls and this clearly isn't the game for me.",
    "timestamp": 1705618800
  },
  {
    "username": "leffe dubbel",
    "rating": 5.0,
    "comment": "One of the poorest physical presentations of a game in sci-fi survival horror - ergonomics more appropriate for aliens. In addition, a cut rate game system with all sorts of bizarre effects. (such as a soldier fires blindly down a corridor, trying to stop the alien advance - caused the poor physical condition of the ship , not some special rule for the first turn) Yes, I actually tried to play it and, no, I didn't think it worked.",
    "timestamp": 1705359600
  },
  {
    "username": "erdogandalf",
    "rating": 5.0,
    "comment": "After two plays I have to say that I don't truly understand the, at the time of writing, #21 on BGG.\n\nThe theme seeps through to the game beautifully, and that's really fun. However, player elimination can be really frustrating and even leaving the ship early because you managed to complete your goal and everything seemed to be going to shit means you're sitting there watching for a good while. Add in the fact that many things are quite random, so you can't really always even blame yourself if you are eliminated early.\n\nThe player controllable Alien faction is a bad solution to this too since it can easily make the game easier for some and harder for others based on how the first eliminated players feels the game went.\n\nAfter I had played this the first time, I received Stationfall from Kickstarter. The feeling is loosely the same, but with very little randomness, no player elimination, and surprisingly fun time even if you are doing badly. That said, the theme works better in Nemesis and it can evoke real feelings of desperation quite beautifully.\n\nIn any case, I think this is a very mediocre game and I sold mine.",
    "timestamp": 1704927600
  },
  {
    "username": "llopis",
    "rating": 5.0,
    "comment": "I absolutely love the theme and wanted to like the game, but the game got in the way of that. Card play is just annoying, combat is horrible, and coop mode is just an afterthought.",
    "timestamp": 1704063600
  },
  {
    "username": "zntznt",
    "rating": 5.0,
    "comment": "The game we played did not provide anything particularly interesting in terms of mechanics. While the theme is perfectly conveyed in form and function, the experience felt rather stiff and limited. I have to say it was very atmospheric and I greatly enjoyed the feel of the game, but not the execution.\n\nSetup time was toe to toe with Gloomhaven, which means I will never buy this game.",
    "timestamp": 1702249200
  },
  {
    "username": "shawn_low",
    "rating": 5.0,
    "comment": "Yawn. Form over function in this game. Very simple mechanics, limited actions and too much downtime between players.",
    "timestamp": 1701385200
  },
  {
    "username": "Archinerd",
    "rating": 5.0,
    "comment": "takes too long to play for what it is",
    "timestamp": 1698530400
  },
  {
    "username": "tom_q",
    "rating": 5.0,
    "comment": "It's basically Clank! in the Alien's clothing, with the caveat that things mainly happen to you, whether you do something or not. You could do almost nothing in the entire game and still win, or to run around, do a lot of different things and be killed in the process.",
    "timestamp": 1696888800
  },
  {
    "username": "Luds",
    "rating": 5.0,
    "comment": "Nemesis is a hidden agenda cooperative game of survival in space with lots of potential actions, lots of fiddlyness, a pretty bad laid out rulebook, really bad graphic design on the board, and some great minis. Be sure to have multiple people know the rules or you'll spend half the game verifying things in the rulebook. Thematically it's very nice. It may be a bit surprising to see how easy it is to get away from aliens and how difficult it is to find ammo, but after one game you get used to it. In short, the game sounds fantastic in theory, it's decent in practice and lacks real tension.",
    "timestamp": 1696024800
  },
  {
    "username": "Soapermania123",
    "rating": 5.0,
    "comment": "+Good theme and atmosphere. Literally \"Aliens\" the boardgame. Draws you into the theme better than any other game I've played.\n\n-Gameplay bit slow and plodding, with lots of down time due to fiddliness and unnecessary complexity. Could've done with an extra round of editing and streamlining.\n-Lots of luck, but that's part of theme. Don't expect a strategy game, more of a story and \"atmospheric\" game. But unfortunately means it felt very limited in player agency.\n\nThe first game was interesting, but after experiencing it once, further games offer nothing for me. I can see why others will like it (those who like story and drama in their games), but I'm mostly a strategy gamer so falls flat for me.",
    "timestamp": 1695420000
  },
  {
    "username": "Bumbusia",
    "rating": 5.3,
    "comment": "okazała się zepsuta. Emocjonująca, mam do niej sentyment\n\nedit. Po czasie stwierdzam, że chętnie bym do niej usiadła. Nie mam potrzeby posiadania jej, ale gra jest super pod kątem interakcji.",
    "timestamp": 1694988000
  },
  {
    "username": "kitwick",
    "rating": 5.0,
    "comment": "Not really my type of thing. The decisions didn't feel particularly interesting. Exploring the ship was fun but I didn't enjoy fighting the aliens, they just felt a bit annoying. The hidden objectives added a layer of interest, in never quite knowing what other people were up to, but that was also mildly stressful to me. Still, the mounting tension and the story that came out of it were enjoyable.",
    "timestamp": 1694383200
  },
  {
    "username": "barber2019",
    "rating": 5.0,
    "comment": "The epitome of theme over mechanics, if that's your preference then this is your game",
    "timestamp": 1692223200
  },
  {
    "username": "CowStriker",
    "rating": 5.0,
    "comment": "I can see why people like it. It's an amazing production but I just didn't feel like my actions were contributing in any meaningful way and didn't get the sense of tension that's supposed to be present in the game. Plus board readability was extremely difficult for my eyes.",
    "timestamp": 1689199200
  },
  {
    "username": "surfen",
    "rating": 5.0,
    "comment": "We didn't find the \"full climatic moments\" rewarding at all. Exceeding fire limit or malfunction limit may end your game unexpectedly, and there is typically nothing you can do to predict or prevent it. After 3 lost games I believe that winning depends mostly on luck (chance of winning is significanlty less than 50%, as if the game was not properly balanced).",
    "timestamp": 1683583200
  },
  {
    "username": "HackFin",
    "rating": 5.0,
    "comment": "Fun game, hopelessly overproduced. Those miniatures are far too big for the game board and pretty annoying because you can not properly see stuff anymore, so you move plastic crap around all the time. Would've been much better in a small box with paper-only content.",
    "timestamp": 1681509600
  },
  {
    "username": "Neeby",
    "rating": 5.0,
    "comment": "A whole lotta nothin' if you ask me.",
    "timestamp": 1681250400
  },
  {
    "username": "Irion1001",
    "rating": 5.0,
    "comment": "1 play. Really, really long game (6h). The theme is on point but some rules are horrible.\nIf I want to experience a similiar experience but better and in a shorter timeframe I would play Dead of Winter.",
    "timestamp": 1679785200
  },
  {
    "username": "Gorgoneion",
    "rating": 5.0,
    "comment": "Meh. For now a very frustrating game. I didn't think I would ever say this, but the board is too dark, and stark contrast in lighting would have probably worked better.\n\nUPDATE\nAfter having played some of this I got to know it a little bit more. It starts to be a bit better than what I thought as a first impression. Now I wouldn't disdain to explore this title a little bit more.",
    "timestamp": 1679439600
  },
  {
    "username": "firewood010",
    "rating": 5.0,
    "comment": "Not my type of game. I am not a fan of hidden identities and objectives, and this game doesn't make me enjoy them either.",
    "timestamp": 1679094000
  },
  {
    "username": "JimmyTwoHands",
    "rating": 5.0,
    "comment": "Bloated",
    "timestamp": 1678748400
  },
  {
    "username": "RogueTitan",
    "rating": 5.0,
    "comment": "Nemesis is way to random. Having to constantly drag yourself through the ship while battling noise is annoying. The damage to players is brutal. I know that the semi coop betrayal aspect is part of the game but it’s not fun. Having another player straight up kill you after a 2+ hour session sucks. Especially when you have zero control over it. I always leave this game in a feeling of “well… that sucked.”\nPlaying the full coop version would be much more enjoyable since the whole team is working towards a collective goal.\nOverall, the brutality of aliens and other game mechanics makes it too hard to be a creepy thematic game.",
    "timestamp": 1677193200
  },
  {
    "username": "Thorsten Binder",
    "rating": 5.0,
    "comment": "I would have loved to like this game. But sadly I can't. Artstyle, miniatures and atmosphere are amazing. But the game is way too random and just throws bad stuff in your direction without you being able to do anything about it. It tells great stories but if you are a person who wants to be in control over a situation and fail because YOU did something wrong then this is not the game for you.",
    "timestamp": 1676847600
  },
  {
    "username": "Sapporo",
    "rating": 5.0,
    "comment": "I found this a bit over hyped, a difficult teach but not so satisfying play. A lot of RNG.",
    "timestamp": 1676761200
  },
  {
    "username": "astomps",
    "rating": 5.0,
    "comment": "I need to play several more times to work out what an average game looks like but this one fell a little flat for me after wanting to play it for so long and really looking forward to the theme.\n\nThe good- asymmetric starting decks, hidden objectives, hidden information all make for a great game foundationally. The noise mechanic I have to say is quite clever in how it is implemented. Killing or escaping aliens is not impossible but it has the requisite difficulty to make it a focal point. Thematically it might actually be a bit too easy. The weakness mechanic is also very interesting but may not yield the output exceeding the input. Contamination cards are a really interesting idea but I am not so sure about the decoder in the context of gameplay.\n\nThe bad- Mansions of Madness does everything present here but better unfortunately. Say what you will about the Lovecraft theme but MoM pushes the theme and storytelling to the limit while keeping the gameplay tight and rarely over-complicated. Nemesis falls a bit short where thematically and narratively, it should be much stronger but it is much too mechanical and scripted. Too many turns feel wasted and while MoM has a very nice main arc that the game pushes you toward in a linear manner, Nemesis is more of a lateral span that all players traverse before being funneled linearly in a final, rushed, climax.\n\nThe engine and destination mechanics feel a bit pasted on and a bit too simplistic. It can take more than 25% of the game to safely reach them and to disrupt them is a matter of discarding a few cards and then if not positioned, no one will be able to stop or change that outcome. I think conceptually it is interesting, but a deck or cards or a bag draw or a dice or push your luck aspect would make both of these aspects more exciting.\n\nUltimately this game feels designed by 7-8 people who each designed a single mechanic and then they were all smashed together. There is not nearly enough streamlining and there are some wild scenarios where the setup and teardown could take longer than the game itself. It is not a very good \"board game\" but there is enough amusing randomness to warrant playing it from time to time.",
    "timestamp": 1676502000
  },
  {
    "username": "Fuzzel",
    "rating": 5.0,
    "comment": "Early elimination Problem, Glückslastig/unfair, unausgewogene Ziele, lange Spielzeit, zufällige Gegner Steuerung, teuer, ~ 120 €, im Prinzip zahlt man nur für die Figuren und die schöne Grafik, das Spielsystem selber ist mau, unzählige ebenfalls teure Addons, hype train... + Atmosphäre, schicke Aufmachung, Eventuell für Alien- Fanboys und passende Spieler Gruppen.\nLeider scheint das Standard-Rezept vom Hersteller AwakenRealms zu sein: Schicke Grafik, viele Miniaturen, unzählige Addons und StretchGoals, aber dahinter kein vernünftiges Spielsystem und unzureichendes Betatesting vor Veröffentlichung. Die Reihe setzt sich nahtlos fort : Lords of Hellas, Nemesis, Tainted Grail, Ehterfields und bald ISS Vanguard (?)\nÄhnliche Spiele, die nicht so gehypet wurden und daher deutlich günstiger sind: The Thing, Alien Fate of The Nostromo,",
    "timestamp": 1674687600
  },
  {
    "username": "tool",
    "rating": 5.0,
    "comment": "It implements the theme well and has some interesting aspects, but for me it's too long for the amount of narrative you get, and it's really about the narrative (it's not a strategy game).",
    "timestamp": 1670367600
  },
  {
    "username": "Eru25",
    "rating": 5.0,
    "comment": "Overrated. 1/3 games is pure magic. But 2/3 the game will and The Whole experience will be totally uneventful.\n\nThe rule book sucks!!! Game is not that hard to play and teach do not understand why the rule book is such a mess.",
    "timestamp": 1669590000
  },
  {
    "username": "TertiaVigilia",
    "rating": 5.0,
    "comment": "A very thematic and tough game, but it gets repetitive very quickly. In principle it's an exploration game, you try to explore the ship and execute minor tasks until you are discovered and eventually killed. There is no variation to this, every game is the same. If you like the Alien theme, give it a try. But it's definitely not a keeper…",
    "timestamp": 1667343600
  },
  {
    "username": "Paperweightgames",
    "rating": 5.0,
    "comment": "It does a good job of simulating the situation being presented, but it is abslutely overhyped. Much as I find with games like Dead of Winter and many social deductions, I feel this was created to cash in on a cultural icon or trend, rather than an effort to innovate in any way.\n\nIt's not difficult, the challenge level is fairly low, however the fairness seems poor. I'll admit it's possible I incorrectly approached it as you do most games, expecting to minimise damage an get things done.\n\nIn this game I can see that it's about flying low and taking risks, and I'm sure there are times that's plenty of fun. I just feel it's probably somewhat inconsistent, and there's also a few 'you can't play' mechanics that leave you unable to do much, which I rarely enjoy in a game.\n\nWouldn't play again, can see a lot of quality in design here, think the reputation is partially owed to the popularity of the Alien IP.",
    "timestamp": 1666908000
  },
  {
    "username": "balis",
    "rating": 4.5,
    "comment": "My second play was very frustrating and annoying because the room I needed to find was the very last one revealed. I didn't feel cooperative aspect of the game - the players have absolutely no motivation to do things not related to their objective.",
    "timestamp": 1660773600
  },
  {
    "username": "GeorgW",
    "rating": 5.0,
    "comment": "It definitely accomplishes what it sets out to do, it's a thematic, tense and exciting game! It's an ameritrash game, with all the thematic little details and randomness that entails, but it still feels like you have a lot of control. In part this is because you have a lot of actions on every turn so it's not as limiting as it first appears. Sure there may be aliens blocking your way with attacks you can't avoid, but there's always ways to heal those wounds later. The objectives aren't balanced and it's tough to survive if you're the only person that want the ship to survive, but I like the concept of the escape pods, so that even if people want to cause damage they have to stop at some point and make it out alive so you still have time to deal with it. I also like that there's a real possibility to actually beat back the alien threat because the tokens are limited.\n\nThe game and especially the miniatures look truly amazing, I really like the scale as it makes the intruders all the more intimidating.\n\nIt's a real shame about the player elimination. It's mitigated in some parts by being able to play as an intruder, but still sucks. Especially for such a long game, which is another big problem with the game. There's also not a lot of things you can speed up because there's going to be a lot of dice checks and item draws that take time.\n\nThe game reminds me of Battlestar Galactica. While the removal of teams makes the game more tense as you can only rely on yourself, it also lacks the spark that the straight out traitor role has. Since BSG is OoP this is a fine substitute, but it doesn't come close to the magic IMO.",
    "timestamp": 1659304800
  },
  {
    "username": "Nenananas",
    "rating": 5.0,
    "comment": "Funny, tense, incredibly thematic, gorgeous artwork, exciting... What else do you want? Even the rules aren't that hard! Aaaargggh, I want to play this some more!\n\nUPDATE: I'm not sure why but second time was a bit less exciting... still pretty fun.\n\nUPDATE2: Betraying seems harder then I imagined... I locked all doors and got a player stuck with an alien and he still survived. Not only that, ALL 3 players needed to kill the others, and none succeeded...\n\nBeginning of the game is really starting to get stale. Explore, explore, bla bla bla. The game seems to get worse with every replay unfortunatly :/",
    "timestamp": 1654293600
  },
  {
    "username": "JohnWaffles",
    "rating": 5.0,
    "comment": "I really enjoy playing this game, but I'm having a hard time coming up with a number to associate with that enjoyment. I think that Nemesis is definitely an experience of a game rather than something to appreciate for the tight mechanisms or design. I wanted to say something about how thematic our plays have been, but even that isn't entirely true. There are some poor mechanisms (dice-centric outcomes that can decide if you live or die with little mitigation, weird objectives that can end up in a Dead of Winter \"Why is he doing that strange thing he is doing?\" type situations) and just obtuse barriers to entry to play an actually rather straightforward co-op (the rule book explanations for some parts of the game as well as the overall layout of the rules are quite bad), but even then, everyone playing has enjoyed it, for the most part.\n\nEach play has told a story to be recounted later that is actually interesting to other people and I have convinced other people they need to try it based just on my interpretations of what happened during our sessions. And this is just running through some regular games, not the campaign or anything like that. I think what I'm trying to say is that the fun (and maybe funny, if you can laugh at yourself dying in a tragic and probably perfectly timed, horrible way) story aspect of this game is what makes it good rather than actually being a good game. And I don't think that is necessarily a bad thing, if you have a good group for it. I can't imagine the solo content being that engaging because of this, most of the good group dynamics are what have carried the game for me.\n\nEdit: I can't really picture myself playing this again, just too long for what it's worth.",
    "timestamp": 1653688800
  },
  {
    "username": "xylantrax",
    "rating": 5.0,
    "comment": "Immersion - 10/10,\nmechanics - 1/10,\naverage (rounding down) - 5/10.",
    "timestamp": 1652392800
  },
  {
    "username": "Mathjes",
    "rating": 5.0,
    "comment": "maybe",
    "timestamp": 1649541600
  },
  {
    "username": "ConnerG",
    "rating": 5.0,
    "comment": "This game is weird. There are elements of it that I really like, the semi-coop hidden objectives being one big example. However...I feel like the rest of the game is always trying its hardest to make sure I don't enjoy the good parts of the game. Movement causing noise is really interesting, but movement is also way too slow and cumbersome, especially if there are some aliens on the board. And I get that that feels 'thematic' but it also just feels bad. The action selection system with the cards also feels like it's one or two revisions away from being amazing, but just feels clunky in it's current form. And my least favorite thing by far in this game is the combat. Not only does it slow the game down to an absolute stop, but it also has so much randomness to it that only ever feels frustrating. Why does the health of the Alien fluctuate every turn? It's so stupid. It's an extra rule to remember that only serves to annoy. I really really want to like this game...but I don't.",
    "timestamp": 1647817200
  },
  {
    "username": "razorsharp11",
    "rating": 5.0,
    "comment": "strong theme but slow gameplay",
    "timestamp": 1647644400
  },
  {
    "username": "AmassGames",
    "rating": 5.0,
    "comment": "Straight forward, nothing majorly different when you play it , move, discover, get out",
    "timestamp": 1645052400
  },
  {
    "username": "royaljayhawk",
    "rating": 4.5,
    "comment": "I'll start by saying I was very excited to play this game and enjoyed playing it. However, it was far from perfect and contained a lot of annoyances- enough that it pushed my ranking down to \"Not so good - but could play again\" territory. This is #17 on boardgamegeek as I'm writing this, and I have to say... I'm not sure it's the 17th best game I've played in the last month. I think this is a game that has mostly thrived on hype, theme and the overall experience. It does provide a memorable experience.\n\nThe first and major issue to touch on is the luck/randomness factor. It's substantially too long for the amount of randomness it contains. The luck in this game is not only pervasive, but it is of the annoying, unmitigated kind. Things might arbitrarily just line up for you through no good choices of your own. Get the right cards in your hand at the right time? Great- you are going to do better than the person who can't time the appearance of cards with what they need to do..\n\nThe balance is another issue which has become apparent after a couple plays. The objectives can randomly be easy or very difficult based on timing of rooms, spacing and random effects. Your objective is to destroy the nest? It's revealed early and starts on fire? Congrats- the game decided your objective is easy. You need to analyze an egg or carcass and one falls into your lap right next to the laboratory? Yeah... These objective difficulties are wildly dependent on luck.\n\nThe infection cards and ways of dealing with them are near the top of my list of annoyances. Several things that scan those cards and/or remove them require you to have them in your hand. Line yourself up and then watch as you don't draw what you need, while someone else handles them with ease... Annoying.\n\nAnother issue- I dislike that some actions (like searching) aren't a basic action. There is no thematic reason for you to have to wait for a specific card to do that. It's just gamey crap to fill up a deck. I think I would have liked this game a LOT more if that deck of cards was just a worker placement style player mat. Have each action require a certain amount of time and give each player 5 time tokens. Let the players decide how to approach each turn instead of the deck. Maybe some actions take an extra turn to clear out (or something similar) to limit some of the more powerful actions- but give those choices and open that decision space to the players. Many of my annoyances with this game are directly tied to the action deck.\n\nAlso- a small irritation: sound lasting on the board indefinitely? Sound should be thematic, but this game treats it as a static, permanent landmine waiting for someone to step on it. Sound should go away over time, especially if there is no one near it.\n\nAll that and I haven't even touched on player elimination. Did I mention my first game I sat out for 1.5 hours waiting for the game to finish? (and that was a three player game I won after 2 hours). Ugh.",
    "timestamp": 1644793200
  },
  {
    "username": "Balleflass",
    "rating": 5.0,
    "comment": "I think I would rate it 8 if we hade some more ways to migitate bad combat rolls. Still a higly enjoyable game.\nVery high tension around mid game where noise markers are everywhere and aliens run amock. Late game can be cruising but is often very tense because of the addition of fire and maybe a dead player or two.\nLove it.\nBut, again, would love to have some way to mitigate some few bad rolls. Maybe give a player a re-roll token after missing 2-3 times in a row?",
    "timestamp": 1643670000
  },
  {
    "username": "Rhedik",
    "rating": 5.0,
    "comment": "It is a game that creates great stories by the end when you play with friends which is great BUT the issue is the gameplay itself is simple, repetitive and gets boring fast so after a couple fun stories, there is zero interest in playing again. Has a bit of \"the game plays you feel\". Can't believe this is #17 on BGG rankings. Purchased the gameplay all-in and sold it all after two plays. So disappointed because I LOVE the theme.",
    "timestamp": 1640732400
  },
  {
    "username": "charley2020",
    "rating": 5.0,
    "comment": "Just another Explosion Game. Nice and beautiful but nothing very special and more or less frustrating",
    "timestamp": 1640646000
  },
  {
    "username": "Percatron",
    "rating": 5.0,
    "comment": "Too much rules flipping, too random and too unbalanced.",
    "timestamp": 1638831600
  },
  {
    "username": "claudio212",
    "rating": 5.0,
    "comment": "Totally enjoyable, but really not my thing. On what was likely my only play ever, I did have the very enjoyable experience of sending the Queen, another monster, and my worst rival - he wanted to send the ship to Mars, when clearly it needed to go to Earth - out the airlock. So... fun yes. Good game, not really for me.",
    "timestamp": 1636326000
  },
  {
    "username": "dougadamsau",
    "rating": 5.0,
    "comment": "Played twice and will try and play it more even if I don’t really want to.\n\nPros: the theme and atmosphere, the components, the mostly clean game play.\n\nCons: an enormous rule book that you must refer to often, especially early on, but it’s so large it’s unwieldy and terrible as a reference. A lot of the notations are in a dark, minuscule font which on a black rule books is a terrible decision. The game is long and as far as I can tell, incredibly luck based. I’m not sure skill counts for much here.\n\nReally mixed about this one. You want to love it, especially for it’s cost, but there is no way it’s deserving of it’s 20 ranking here on BGG (Oct 2021).",
    "timestamp": 1635026400
  },
  {
    "username": "Paikea",
    "rating": 5.1,
    "comment": "first try was horrible - i mean, the alien miniatures look quite nice, but the gameplay, the cards, everything didnt catch me at all, against all expectations - nevertheless I´ll give it another try soon",
    "timestamp": 1634076000
  },
  {
    "username": "lmdrsk",
    "rating": 5.0,
    "comment": "If you're a fan of cinematic sci-fi horror (Alien, here's looking at you!), this game has enough theme to not just whet your appetite but absolutely drench it. This is a game built on cinematic moments and a narrative which unfolds differently each play. It rewards the imaginative. It's been over a year, but our group still remembers when the wheelchair-bound scientist threw a grenade at the ailing soldier to make a bolt for an evacuation pod...only to discover he was contaminated once the doors were locked and destined to a miserable fate.\n\nThe game really benefits from someone at the table being intimately familiar with the flow of the game and providing gameplay assistance to crew-mates.\n\nEDIT: After just four plays now, Nemesis has really lost its shine. Yes, the theme is excellent, but the gameplay feels dry and repetitive. We ended up just calling our last game off because everyone around the table felt they were just moving through the motions with no real excitement or strategy in any of the turns. There is very little 'game' buried within the theme here and Nemesis unfortunately doesn't reward replay-ability, which is a huge shame. I can't see this getting to the table for a very long time now.",
    "timestamp": 1633903200
  },
  {
    "username": "HighlanderPL",
    "rating": 6.0,
    "comment": "Really good survival horror. Random in many aspects, but gameplay with a good company is thematic and creates unique experience.",
    "timestamp": 1762677720
  },
  {
    "username": "bfrizb",
    "rating": 6.0,
    "comment": "2025-11-05: Rerated 8 => 6\n\n====\n\nGreat game!\n-0.5 point because game mechanics do not permit attacking other players directly.",
    "timestamp": 1762297200
  },
  {
    "username": "RougeHemlock",
    "rating": 6.0,
    "comment": "I want to get more expansions for this, it grows on me every time I play it.",
    "timestamp": 1760824800
  },
  {
    "username": "MattAndersson3",
    "rating": 6.0,
    "comment": "I think the game is hugely overrated. Artwork, miniatures and thematic are the best thing by far and they’re so well curated that I still think the rate cannot be so low. However, the gameplay is absolutely horrible, strongly based on luck and extremely punitive. You could die in 2 rounds and watch other players playing for a few hours. Definitely not what I want from a gaming experience. When I played, I just felt my plans were completely useless and I felt my choice were forced by the events that were happening. It doesn’t make sense to me to play a game where I basically cannot choose my actions.",
    "timestamp": 1760479200
  },
  {
    "username": "mudville9",
    "rating": 6.0,
    "comment": "I had a good time with this one. It's not something I would want to play all the time, but it definitely makes for a cinematic experience one in a while, even if you don't have a lot of control over it as you do in a more strategic euro game. The hidden agendas provide a decent amount of paranoia and mistrust around the table, which is fun. The rules are actually not too bad once you get the hang of the system. I'm confident a second play of it would be extremely smooth.",
    "timestamp": 1760047200
  },
  {
    "username": "vortelf",
    "rating": 6.0,
    "comment": "Glorified TTT. The theme is great but the game falls flat for me.",
    "timestamp": 1759010400
  },
  {
    "username": "P1rD",
    "rating": 6.0,
    "comment": "Kickstarter",
    "timestamp": 1756245600
  },
  {
    "username": "Doctor_Cowboy",
    "rating": 6.0,
    "comment": "Man. I really really want to like this game, but it's just so so finicky. Everything is reading cards and re-reading the rulebook every few minutes to double check that people are doing things right, or have the right choices they think they do, which might ruin their allegiance. Even after playing half a dozen times, it still feels too finicky to fully enjoy and embrace. Easy to get completely hosed on random alien rolls and random gear cards. Still, I've had a few great memories playing with friends.",
    "timestamp": 1754344800
  },
  {
    "username": "trkoll",
    "rating": 6.0,
    "comment": "Fun until one of your crew dies early has has to sit out for an hour.",
    "timestamp": 1754172000
  },
  {
    "username": "lowkeyloki",
    "rating": 6.0,
    "comment": "Boring if everyone decides or are able to to play nice. Prefer games where someone is forced to betray",
    "timestamp": 1753480800
  },
  {
    "username": "DaneTheBeast",
    "rating": 6.0,
    "comment": "Played (IRL & TTS)",
    "timestamp": 1751839200
  },
  {
    "username": "womanpacman",
    "rating": 6.0,
    "comment": "Despite the elaborate rules, I found that the game doesn't offer much in terms of strategic depth.",
    "timestamp": 1751234400
  },
  {
    "username": "NotThatSalem",
    "rating": 6.0,
    "comment": "It was fine, but dragged on a bit. Nowhere near as fun and tense as Battlestar Galactica.",
    "timestamp": 1750111200
  },
  {
    "username": "Zenfire",
    "rating": 6.0,
    "comment": "Not my type of game at all. I just do something and see what happens. I dislike the scifi theme in general.",
    "timestamp": 1749592800
  },
  {
    "username": "chadridgley",
    "rating": 6.0,
    "comment": "It's thematic and well designed, but I don't enjoy this sort of game. I've found there is too much going on for my tastes, or an opponent that eliminates me, and the time investment doesn't pan out for me in terms of the enjoyment i get out of it. There are other games I'd rather play.",
    "timestamp": 1749160800
  },
  {
    "username": "maalsc",
    "rating": 6.0,
    "comment": "Anticipated coop rating; semi-coop is a 4 for me (has (luck-dependent) player elimination (was out of the game for almost half of one game)).",
    "timestamp": 1748815200
  },
  {
    "username": "Soul_Turtle",
    "rating": 6.0,
    "comment": "Interesting, but mostly for the semi-coop nature. I would not want to play it in full coop, I think.",
    "timestamp": 1748469600
  },
  {
    "username": "DeSjeff",
    "rating": 6.0,
    "comment": "It's an interesting game. I like the theme and gameplay in itself. It only has 1 big downside; when a player is dead (or has escaped), they are waiting the rest of the game. (There is a gamemode however that allows the first killed player to play as the intruder which would make the game a bit harder for the rest of the surviving players but after that it is still waiting untill the end game is triggered).\n\nI do think it can be better prevented to get killed early on if the players learn how to treat this game more as a co-op game, which it is more or less, instead of playing for your solo objective.\n\nNevertheless, it is a game I would love to play more often to see how we as a group can play this game, and its mechanics, better.\n\nEdit: People naturally dont treat it as co-op, so as such its an elimination game. The base game without adjustment/modes have also too many goals that ask you to be the only survivor. I love solo objectives, but being the sole survivor should be one of the few objectives that should be rare. If 3 out of 5 players have that goal than it becomes hard to play together. I dont need it to be full co-op, I prefer hidden traitor stuff, but here its not well implemented if it can mean nobody co-ops and you can be unlucky and have to wait hours because you died early on.",
    "timestamp": 1748037600
  },
  {
    "username": "remescen",
    "rating": 6.0,
    "comment": "Chris",
    "timestamp": 1747951200
  },
  {
    "username": "Chroust84",
    "rating": 6.0,
    "comment": "Don't like cooperative games. It takes too long to put it on the table. When you don't know the game you usually lose.",
    "timestamp": 1744927200
  },
  {
    "username": "yoyomanhihi",
    "rating": 6.0,
    "comment": "Pure ameritrash, that I find it very long for what it is. Gameplay wise it's not bad, but there are so many random events after every action that it breaks the gameplay a lot and makes the game too random for me. However, I have to admit that there is a lot of tension in the game.\n\nOverall, the game is not bad at all and I can understand why people love it ans why it's si highly rated, but it's not for me.",
    "timestamp": 1744668000
  },
  {
    "username": "sion111",
    "rating": 6.0,
    "comment": "Beautifull, but far worse than even a mediocre rpg session.",
    "timestamp": 1743976800
  },
  {
    "username": "YoyoPL",
    "rating": 6.0,
    "comment": "Wersja z pierwszego KSa.",
    "timestamp": 1742943600
  },
  {
    "username": "DanKill",
    "rating": 6.0,
    "comment": "the player elimination is very harsh. the rule book is rubbish. Nice theme and fast to play once you know what you are doing",
    "timestamp": 1742770800
  },
  {
    "username": "Ragingpiano",
    "rating": 6.0,
    "comment": "Can be fragile, and game maintenance is too much",
    "timestamp": 1740438000
  },
  {
    "username": "KvdBergh",
    "rating": 6.0,
    "comment": "A very thematic game styled after the Alien movies. The game starts of easy but quickly ramps up once the noise tokens start to pile up.\nI don't like the semi-coop nature of the game. Fortunately the coop/solo mode works very well.",
    "timestamp": 1739660400
  },
  {
    "username": "EllikTheren",
    "rating": 6.0,
    "comment": "A game that creates amazing stories to share after its played. You will feel tension, pressure, urgency and either memorable defeat or greatly satisfying victory.",
    "timestamp": 1737759600
  },
  {
    "username": "saucybrendan",
    "rating": 6.0,
    "comment": "Donate",
    "timestamp": 1737414000
  },
  {
    "username": "K_oroviev",
    "rating": 6.0,
    "comment": "Strange game. Despite its look, price, production, and length, it can’t be taken very seriously. The game is almost pure RNG and is very unfair at times. Approached correctly it can be fun, just don’t expect any strategy or interesting gameplay.",
    "timestamp": 1735513200
  },
  {
    "username": "ShoddySleeper",
    "rating": 6.0,
    "comment": "Probably not my kind of game because of coop elements",
    "timestamp": 1734217200
  },
  {
    "username": "kurtrussell",
    "rating": 6.0,
    "comment": "\"Climactic\", \"rewarding\" are used in this game's description, but I'd prefer \"arbitrary\", \"unsatisfying\" as more dominant emotions.\n\nThe reality is, *most* of the games of Nemesis you play will end in a disappointing way. There won't be a cinematic moment or a fun story, you'll just die because some arbitrary mechanic hit and that's it.\n\nSkill is largely irrelevant in this game, your best play is probably to take an objective where someone else dies and try to escape with the minimum of actions.",
    "timestamp": 1733094000
  },
  {
    "username": "rickmir",
    "rating": 6.0,
    "comment": "Two plays. Great theme, some nice ideas but movement is a drag. Then randomness. To search for the room you want, then, when it pops up on the other end from where you are, to go there can take 2 to 3 rounds, with aliens popping up and combat. And that could, in a 5 player game, easily take 2 hours, just to get to a specific room that was anyway randomly placed. Possibility of and combat itself is too much luck based, as are many other things, like the items you draw, and on which, many times your objetives depend. Feels that it is not really cooperative but also not really competitive. Also too many rules too remember, you have to constantly check the rulebook and there are many instances where there are exceptional situations in which you're not sure what to do. Could be enjoyable, just based on theme if it was more streamlined and didn't take so long.",
    "timestamp": 1731625200
  },
  {
    "username": "Daniel109",
    "rating": 6.0,
    "comment": "I REALLY want this game to be better! The stories it creates are so memorable, and the theme is right up my alley. I love that this game is MOSTLY co-op but you can never fully trust your friends as their hidden agendas may conflict with yours.\n\nThe problem is, the game is far too bloated with rules, edge cases, and systems. About half of the game's many mechanics could be eliminated without impacting the core experience. (Do we really need crafting? Do we really need the enemy spawn rules to be so complicated?) Because of this, we don't play it often.",
    "timestamp": 1730588400
  },
  {
    "username": "IBashar",
    "rating": 6.0,
    "comment": "Great thematic, cutthroat game. Not to heavy on the rules, but long. There's a real tension, you're always wondering if you're going to survive each turn.\nNot my thing, though. I'm not into long thematic games",
    "timestamp": 1728770400
  },
  {
    "username": "Qumpelblase",
    "rating": 6.0,
    "comment": "Sehr thematisches Spiel, bei dem jeder Raum und jede Karte zur Immersion des Spieles beitragen. Cool ist, dass jeder Spieler eigene Aufträge hat und eben diese gut in das Semi-Kooperative Element eingebunden sind. Mir war das Spiel allerdings etwas zu kampflastig, da die Monster die eigene Entscheidungsgewalt zu stark einschränken. Meh!",
    "timestamp": 1728338400
  },
  {
    "username": "cho7",
    "rating": 6.0,
    "comment": "Fun game to play with a few friends, a few beers, and pizzes. A lot of rules, though, this game should have been streamlined a bit, imho.\n\nBut most importantly, it's not an eurogame : this game is all about luck. A festival of luck. Luck is everywhere, in every phase, in every mechanisms, in your cards, when you reveal a room, in how intruders behave, in your attacks and their resolution, in the event deck, and even in the final 4 cards draw when you think you have won but maybe not.\n\nAfter a solid 30min explanation for the rules, luck can kill you in 2 rounds.\n\nSo if you don't like luck, then run. Fast.",
    "timestamp": 1727992800
  },
  {
    "username": "POvidiusNaso",
    "rating": 6.0,
    "comment": "I’m trying to pin down what it is that irks me about this game. Part of it is that the rules are a tad convoluted and not smoothly written, so stops to check on things take a while. But if I cared enough I admit I’d remember the rules.\n\nPerhaps it’s that every success either feels meaningless or has such a high cost that the rest of the game isn’t fun. It’s a series of frustrations that always leaves suboptimal choices: melee attack to clear the room I need for equipment and get contaminated? Run away and (probably) bring on another alien? Sneak away, burning cards at twice the rate (which probably doesn’t matter because the corridors are filled with noise markers) to get to the one room halfway across the ship you need? And, by they way, it’s malfunctioning, so you’ll need to keep your Repair card handy and clogging your deck.\n\nNow that I think on it, there’s also this: I feel that even if I overcome a challenge, it was because of luck, not any sort of clever play or decision-making. (I guess this is a variant on “meaningless” above.)\n\nA positive? If you want to feel like you’re about to be creepily killed by xenomorphic entities this definitely captures the theme. But you’re not Ripley, you’re (at best), Vasquez, but more likely you’re colonist whose chest is burst open in Act II.",
    "timestamp": 1725400800
  },
  {
    "username": "Davven",
    "rating": 6.0,
    "comment": "I like games where I can make good combos. This is not that game. However, it has another good vibe: Every gameplay is like a movie and you make your own story. Even if all of you end up loosing that match. The half-cooperative part makes it spicy.",
    "timestamp": 1725055200
  },
  {
    "username": "MissP1ggy",
    "rating": 6.0,
    "comment": "An epic game! Feels like participating in an action movie.",
    "timestamp": 1724191200
  },
  {
    "username": "Nanomachinesss",
    "rating": 6.0,
    "comment": "Love the game, hate the randomness. With many, many house rules and alterations of gameplay, this has gone from a 5 to a 6. The fact that a player can be eliminated in the first few turns and then has to wait upwards of 3 hours for the end of the game is quite the killer of fun.",
    "timestamp": 1724104800
  },
  {
    "username": "siderealex",
    "rating": 6.0,
    "comment": "Had a game of Nemesis finally where people were cooperating and I had a bit more fun with it, so bumped to a 6 for now.",
    "timestamp": 1724104800
  },
  {
    "username": "tobytoast",
    "rating": 6.0,
    "comment": "Too much randomness for me.",
    "timestamp": 1722808800
  },
  {
    "username": "Kibald",
    "rating": 6.0,
    "comment": "Conseille par Thomas Garet coop avec un olé cache",
    "timestamp": 1721685600
  },
  {
    "username": "AndryWhite",
    "rating": 6.0,
    "comment": "Too chaotic, simple, big, random and long for what it delivers. Needs experinced harismatic moderator to run the party.",
    "timestamp": 1720994400
  },
  {
    "username": "Madworm721",
    "rating": 6.0,
    "comment": "Mediocre",
    "timestamp": 1718229600
  },
  {
    "username": "R_J_",
    "rating": 6.0,
    "comment": "Update, sold this on as no one in my group would play it. Set up and play time were just too long, with card play that only felt interesting for some characters, some of the time. A good sandbox game, but asks a lot of the players, and I’m just often not in the mood for it.\n\nSee the SUSD review on youtube. It really hits it on the nose imo. Dark story telling machine with friends! \nNote - can play reeeeaaallly slowly depending on who is at the table. Quick thinkers or experienced players make it better!",
    "timestamp": 1717884000
  },
  {
    "username": "Norbert Chan",
    "rating": 6.0,
    "comment": "This is a semi cooperative game where each player has a different objective, set in the Alien movie world. When you move, you try not to make noise, as that attracts Aliens. You explore the space ship which will give you access to different functions.\n\nThere is a lot of theme and the tension arises as you do not know the objectives of the other players - do they want to destroy the ship? There is a lot of luck as well, so some players might get turned off by that. Sometimes by circumstance, things will snowball and you will die. Some people won't like that mechanic either. Sure, you could argue, if you do enough to survive, you might be able to control you fate, but that appears very hard.",
    "timestamp": 1717884000
  },
  {
    "username": "jonesy792",
    "rating": 6.0,
    "comment": "Captures the claustrophobic, sci-fi horror atmosphere superbly with a stellar production (as you'd expect from Awaken Realms). Lots of interesting ideas and mechanics that fit well with the theme. Unfortunately, the gameplay was too bloated, fiddly and long. Randomness could also be very punishing in this game with early player elimination.",
    "timestamp": 1717192800
  },
  {
    "username": "Gaukli",
    "rating": 6.0,
    "comment": "Played it twice. Regarding theme it might be the best game I ever played. However, both times I played I felt stripped of agency towards the end. Didn't enjoy the last hour or so both times.",
    "timestamp": 1717020000
  },
  {
    "username": "DeemPl",
    "rating": 6.0,
    "comment": "Campaign (untold stories 1) - 4 plays",
    "timestamp": 1712959200
  },
  {
    "username": "cherdan",
    "rating": 6.0,
    "comment": "Merchanically, this game is just too dry. The theme is very cool and spooky. Trust me, I'm a sucker for stuck in space. There just isn't enough game here for me.\n\nUpon further in person plays, there is an undeniable charm to this game. It's clunky and broken but it's an experience to play.",
    "timestamp": 1712268000
  },
  {
    "username": "Jonny93",
    "rating": 6.0,
    "comment": "Het kan super lang, super kort of normaal zijn van lengte. Super lang en super kort zijn geen leuke ervaring. Als je missie gelukt is ligt de focus op overleven of ontsnappen, beurten en acties kunnen soms saai zijn daardoor. Samenwerken is beperkt, alleen winnen is toch moeilijk. Heel veel kleine regels, en veel spelmateriaal dat je eigenlijk niet elk spel nodig hebt. Desondanks alles een leuke spelervaring, de mechanica zijn vooral niet mijn ding.",
    "timestamp": 1710975600
  },
  {
    "username": "mantler",
    "rating": 6.0,
    "comment": "Full coop the game might be better\nWith semi coop the single goals are way to much luck depending on the room layout\nPlayer elimination also very frustrating for the guys sitting 1-2h till the game ends",
    "timestamp": 1710543600
  },
  {
    "username": "otysk",
    "rating": 6.0,
    "comment": "It's basically a rethemed and overproduced version of Drakborgen. I occasionally enjoy playing this because hidden traitor is a thing.",
    "timestamp": 1710457200
  },
  {
    "username": "Mofli_Mario",
    "rating": 6.0,
    "comment": "For me bit heavy with more than 3 people, I prefer others",
    "timestamp": 1710370800
  },
  {
    "username": "corbou",
    "rating": 6.0,
    "comment": "(caveat: not played many games yet (note: former games not tracked on BGG))\nouff… un- intuitive rules for managing the aliens. The rules are generally a bit of a mess (we frequently need to check the rulebook or consult our \"scrib sheets\"). And it takes WAY longer than 3 hours ( rather >4 with 4 players).\nI really (REALLY) like the concept and the immersion (and the table-talk and tension between the survivors, depending on each other, but not being sure if your \"mate\" will just lock you away next door with a hungry alien...), but somehow it feels just not smooth enough to endure the hourlong agony and final frequent death just in the last minute in front of that GRRRR*#°§*& escape pod. And it is REALLY hard to win if you diligently adhere to all the rules (we started to house rule). Especially the noise managing system is heavily punishing (you need to roll for noise whenever an adult is drawn in the intruder bag development - in addition to rolling for noise when you move, or when you want to enter that escape pod, etc etc). Also, moving \"silently\" also lets you place a noise marker (in a corridor of your choice) - so even that one fills the corridors with noise. Hence, soon, ailens pop up everywhere.\nI would not mind having tons of aliens to fight against IF there was at least a decent chance to find enough ammunition / weapons to at least have a REAL chance to kill one once in a while, but finding stuff (ammo) is completely luck-driven (you might not have a search card in your hand when you are finally in the right room where you still could search for it, or you might find stuff you really don't need. And you only move around in the ship quite slowly, so going back to the ammo room (maybe already flooded with noise tokens) to charge is also usually not a viable option.\n\nif we want immersion and fights against monsters, we rather pick the funny and easy Zombicide, or maybe Cthulhu Death may die.",
    "timestamp": 1709074800
  },
  {
    "username": "Ridicule",
    "rating": 6.0,
    "comment": "Survive an alien-infested spaceship but beware of other players and their agendas.\n\nType: Adventure, Horror, Semi Co-Op, Hidden Role, Hand Management",
    "timestamp": 1708988400
  },
  {
    "username": "ryanespin",
    "rating": 6.4,
    "comment": "halfsies with Squirrel",
    "timestamp": 1707260400
  },
  {
    "username": "FOTCH",
    "rating": 6.0,
    "comment": "Wanna play moar",
    "timestamp": 1706828400
  },
  {
    "username": "Jeroen vd Horst",
    "rating": 6.0,
    "comment": "Too fiddly, rules heavy, not intuitive, and too long with 4+. I prefer the coop above semi-coop..",
    "timestamp": 1705359600
  },
  {
    "username": "GeraFR",
    "rating": 6.0,
    "comment": "Not what I expected.",
    "timestamp": 1704236400
  },
  {
    "username": "FatMexican",
    "rating": 6.0,
    "comment": "Too long, too random, too much of a rip-off of Alien/Aliens.",
    "timestamp": 1703977200
  },
  {
    "username": "Vitho",
    "rating": 6.0,
    "comment": "Should give 7 to 8 for the game play.\n-1 for the box that deny to store sleeved cards,\nSold, too big game, unfortunately switched to smaller / more recent games.",
    "timestamp": 1702594800
  },
  {
    "username": "JustinRRizzo",
    "rating": 6.0,
    "comment": "I highly preferred this game coop. When played the traditional way I hardly ever cared what was happening with other players. It was a very solitaire experience. The game is also random in so many ways, which tends to lend itself well in coop experiences, but can be frustrating in competitive games. I would almost always play if someone asked, but I would ask for this.",
    "timestamp": 1701903600
  },
  {
    "username": "casimps1",
    "rating": 6.0,
    "comment": "Created some fun tension, moments, and player interaction, but the game was too fiddly and unintuitive for my tastes. And it was somehow both too long (I wanted it to end), and too short (I felt like I didn't accomplish much).\n\nWorst of all though, multiple players can be out of the game (literally unable to play) for over an hour before the game actually ends.",
    "timestamp": 1699830000
  },
  {
    "username": "Chump",
    "rating": 6.0,
    "comment": "Semi-cooperative, race against time and being overwhelmed by aliens game.",
    "timestamp": 1699398000
  },
  {
    "username": "Tycho",
    "rating": 6.0,
    "comment": "Provisional rating, one play. From that I have personal reservations about the length and the variability of the goals (combined with the set-up). I fully understand why people love the game but it's not for me.",
    "timestamp": 1699225200
  },
  {
    "username": "Decrisco",
    "rating": 6.0,
    "comment": "Played solo only (two handed):\n+ great art and components\n+ exploration\n+ nice alien minis\n- rulebook (watch Meeple University's How to Play instead)\n- small event deck\n- luck dependent (one game is super hard and the next too easy, depending on the cards/tokens drawn)\n- action cards a bit boring\n- repetitive after a while (and one game takes quite some time)\n- missing fear factor (all you do is go from room to room, fix the ship, and fight aliens but I never felt any tension or suspense)",
    "timestamp": 1699052400
  },
  {
    "username": "darkabolisher",
    "rating": 7.0,
    "comment": "Quite random, fiddly and long. However, it is thematic as hell and can be a lot of fun with the right people!",
    "timestamp": 1762633200
  },
  {
    "username": "Bayushi Sezaru",
    "rating": 7.0,
    "comment": "Nemesis has indeed a problem with too many tiny rules: it’s at the polar opposite to what I would call an “elegant” game. So, it’s a bit frustrating when you tackle it for the first few games: constantly perusing the rulebook for some details isn’t fun, in any circumstances.\n\nNevertheless, Nemesis is a wonderful story generator, sometimes epic and always claustrophobic, exactly like the first Alien movie.\nIt catches perfectly the atmosphere of the source material, both when it makes you terrified of the xenomorphs, and when it makes you paranoid of your fellow crew members…\n\nI love Alien, and I am trying to love Nemesis.",
    "timestamp": 1762210800
  },
  {
    "username": "tiagoVIP",
    "rating": 7.0,
    "comment": "Designer: Adam Kwapiński\nPlaying time: 90–180 Min\nWeight: 3.37 / 5\nPublisher: Awaken Realms\n\n\t      LOW\t\t\t\tHIGH\nCOMPLEXITY\t1\t2\t*\t4\t5\nCOMPONENTS\t1\t2\t3\t4\t*\nDOWNTIME\t1\t2\t*\t4\t5\nFUN\t        1\t2\t3\t*\t5\nINTERACTION\t1\t2\t*\t4\t5\nPLAYING TIME\t1\t2\t3\t*\t5\nLUCK      \t1\t2\t*\t4\t5\nREPLAY VALUE\t1\t2\t3\t*\t5\nSOLITAIRE\t1\t2\t3\t*\t5\nTHEMATIC\t1\t2\t3\t*\t5\n\nComments: Nemesis is a thematic game about achieving goals in a spaceship infested with aliens. It is heavily inspired by the Alien movies, but goes in a more generic route to allow some room for creativity and to not pay that sweet royalties.\n\nThe game comes with solo, competitive and cooperative modes. The cooperative has a campaign book, but there aren't many scenarios, sadly. In the competitive, players get two objective cards and once an encounter happens, they must choose which of the two to keep. These can put players at odds with each other.\n\nOverall, Nemesis offers a highly thematic experience with a great deal of interaction between players. The competitive scenarios, which include player elimination, may not sit well with everyone, but for those that don't mind this, nor a good chunk of tension and doubt among players, Nemesis could be a shoe in. Recommended.",
    "timestamp": 1762038000
  },
  {
    "username": "soloscrub",
    "rating": 6.5,
    "comment": "I feel like this game suffers massively by what type of group you are playing with. I personally have never played with a group who really enjoyed this game or where we had a memorable session. The game runs incredibly long and you really have to be bought into the cinematic, “it’s like a horror movie but in board game form” aspect to it, because the game can feel so punishingly unfun at times. I honestly hated the way combat was deal with in this game. While I understood it, it just never felt great. I feel like if you don’t play this with dedicated gamers who fully know what this is, you have a huge chance of turning people away who are interested in getting into the hobby because this game can just ultimately be a lot. I have backed Retaliation and am hoping it fixes some of my qualms. I really do feel like this game can be amazing with the right group of people, but I just have not experienced that and until then, this will really just be super overrated and bloated to me.",
    "timestamp": 1761519600
  },
  {
    "username": "Bagherra",
    "rating": 7.0,
    "comment": "Includes medic and aftermath",
    "timestamp": 1760306400
  },
  {
    "username": "AndyInJapan",
    "rating": 7.0,
    "comment": "Includes:\n- Folded Space insert",
    "timestamp": 1760047200
  },
  {
    "username": "Stejeh",
    "rating": 7.0,
    "comment": "This game is more about the memories and ebb and flow than the game play by itself.\nIt is one of those games that you are more cheering on the laugh you had rather than the cleverness of your play.\nIt is still cool to recreate a movie",
    "timestamp": 1760047200
  },
  {
    "username": "Aviad_Agam",
    "rating": 7.0,
    "comment": "Played.",
    "timestamp": 1760047200
  },
  {
    "username": "ESSIENNN",
    "rating": 7.0,
    "comment": "Too much luck and too less decisions, its just a betrayal game without a strategically deepness, that costs more than 100€. You play 4 hours and then you loose, just beacuse of an infected card, sooo Bohrung...",
    "timestamp": 1759701600
  },
  {
    "username": "Mauxel",
    "rating": 7.0,
    "comment": "I really wanted to like this game.\nWhat's not to love about a semi-coop survival horror game with an Alien-inspired setting and epic component quality?\n\nWell, it's too long and too pricey for what it is. Setting it up and explaining the rules takes more than an hour. Then you aimlessly run back and forth in the ship, chuck some dies and another 3-4 hours are gone. If you are especially unlucky you die 2 hours into the game and watch the rest of your group continue to play for another hour.\n\nThere is virtually no strategic depth apart from some hand-management. Even when it comes to theme and atmosphere, other games (like Dead of Winter, Cthulhu DmD or Sherlock Holmes Consulting Detective) are way better at telling a story you'll remember.\n\nI'm still giving this game a 6.5 as I haven't given up on it yet and would love to be as hyped about it as the rest of the community surrounding it",
    "timestamp": 1759615200
  },
  {
    "username": "goaliebrain",
    "rating": 7.0,
    "comment": "Glass die 2025",
    "timestamp": 1759528800
  },
  {
    "username": "atlas64gaming",
    "rating": 7.0,
    "comment": "AUGUST 2025: 100TH\nFEBRUARY 2025: 80TH",
    "timestamp": 1758492000
  },
  {
    "username": "Desiderata",
    "rating": 7.0,
    "comment": "A tense, exciting, action-packed cinematic alien survival game. It probably would benefit from some streamlining. Does there really need to be so many different types of intruders? And the bag development step could use some rework as well. The end game rules are also a lot for new players, even if they are thematic. That said, if you like thematic games, it's hard to beat this. Too bad playing as an intruder doesn't really solve the player elimination problem.\n\nThis game is overproduced by far. I wish there was a smaller box version without the minis--standees for characters (ala BSG) and just use the tokens (from the draw bag) as the aliens. Much less confusing than trying to match up the tokens with the minis. This would also allow for a more normal sized box on my shelf. As it is, I'm happy to play someone else's copy.",
    "timestamp": 1758232800
  },
  {
    "username": "warder57",
    "rating": 7.0,
    "comment": "Not necessarily the style of game I typically like but man was it well crafted. I really felt like I was creeping through an alien infested ship and something could jump out at any moment.",
    "timestamp": 1757800800
  },
  {
    "username": "RLFoster",
    "rating": 7.4,
    "comment": "Rating based on Solo Play exclusively",
    "timestamp": 1757541600
  },
  {
    "username": "Auroric",
    "rating": 6.5,
    "comment": "Nemesis is weird. I really should love it with all the backstabbing and interaction, but it just felt too random for me, too long, and a little janky at times. A tight, tactical version of this idea would probably be up my alley. Definitely need to give it more tries though, even with those critiques it's still fun, and I'm curious about the other entries in the series.",
    "timestamp": 1757541600
  },
  {
    "username": "JamieMulligan",
    "rating": 7.3,
    "comment": "The first play-through was great fun, but subsequent plays felt somewhat repetitive. The balance between personal and corporate goals seemed off, and they often didn’t lead to particularly engaging outcomes. While Nemesis is an enjoyable game overall, it has some significant design flaws that can make the experience feel a bit like going through the motions.\n\nIn my sessions, I never saw anyone get eliminated early on, but there were a few close calls. That said, it seems possible for a player to be eliminated very early due to a bad deck draw—for instance, being infected and then encountering a specific event card. This I envision could ruin the experience.",
    "timestamp": 1756159200
  },
  {
    "username": "Kiely",
    "rating": 7.0,
    "comment": "Einmal gespielt, dabei bleibt es auch. Nicht weil es schlecht ist, nur um die fantastische Erfahrung abzuspeichern. Kommt stark auf die Mitspielenden an. Auf keinen Fall zu empfehlen mit \"mechanisch\" spielenden Leuten. Da sollte schon eine Portion \"Rollenspiel\" und / oder produzierte Immersion mit rein, sonst bestimmt ein totalausfall.\n\nDie eine Erfahrung war im Prinzip eine 9 von 10, mega!",
    "timestamp": 1756072800
  },
  {
    "username": "Song_of_Shield_Lady",
    "rating": 7.0,
    "comment": "这种游戏玩起来很奇怪",
    "timestamp": 1755986400
  },
  {
    "username": "Faltarf",
    "rating": 7.0,
    "comment": "When Among Us meets James Cameron's Aliens.",
    "timestamp": 1755813600
  },
  {
    "username": "Ravensburg24",
    "rating": 7.0,
    "comment": "Best 4-5 player.\n\nBeautiful and wonderfully thematic, \"Alien\" the board game. No objective downsides, though the rulebook can be confusing to navigate and you need a group that is okay with distrust, randomness and the potential for sudden and brutal player elimination. If you're willing to brave those caveats though, prepare for a thematic and thrilling fight for your life!",
    "timestamp": 1755381600
  },
  {
    "username": "ThingsThing",
    "rating": 7.0,
    "comment": "3.47\nNot bad, will play if I'm in the mood\nNot a big fan of space themes, but this RPG semi co op kind of dungeon explorer game is in my wheelhouse",
    "timestamp": 1755295200
  },
  {
    "username": "xXSHAZAMXx",
    "rating": 7.0,
    "comment": "played didgital would like to try in person",
    "timestamp": 1755208800
  },
  {
    "username": "Vinceloke",
    "rating": 7.0,
    "comment": "New - bought RM540\nExpansion\nUsed - bought RM445\nRM985\n\nSold - RM750",
    "timestamp": 1755208800
  },
  {
    "username": "Abex17",
    "rating": 7.0,
    "comment": "Expansions: Void, Carno",
    "timestamp": 1754258400
  },
  {
    "username": "PikaPomelo",
    "rating": 7.0,
    "comment": "So far this has had a good success rate with our group. The games are decent length (still pretty long), but we've all had fun and there have been exciting / funny moments.",
    "timestamp": 1754085600
  },
  {
    "username": "RoyalEclipse",
    "rating": 7.0,
    "comment": "The game is solid. It is a rather heavy ameritrash game with a very significant emphasis on random chance and player death, more of a story generator really.\nWhat it also is, is heavily atmospheric and immersive, it genuinely evokes the feelings of despair, anxiety and/or fear and much more.\nThe feeling of flipping over the event card and genuinely dreading whats on it is phenomenal.\nI played solo once then thought better of it, the rest of my plays were three and four player games, which were much, much better.\n\nNow the stories this game creates are genuinely great, engaging and nerve wrecking, until they arent, and you get infected and pull a metamorphosis right after without any way to save yourself.\nThis is my biggest gripe with the game, the randomness is cool and no two playthroughs are ever the same, but it also means that the game is deeply unfair at times and you will die after spending two hours building up your character to something you genuinely cannot control or evade. In a game we had we lost three players to sheer chance three rounds in a row. The game went from this amazing feeling of \"We might just make it\" straight into \"well this feels meh.\"\n\nIts not a game i would play every day, or even often. But when you DO decide it is time for a game of nemesis, you will most likely get really into it and have a great time.",
    "timestamp": 1753740000
  },
  {
    "username": "selvalabelva",
    "rating": 7.0,
    "comment": "Brainburn         Longevity    \nLuck impact       Rules/Setup  \nInteraction       Involvement  \n\nAftertaste           Enthusiasm   \n\n As a co-op, experience is group dependant\n Rating inclusive of expansions gameplay\n Replayability improved with expansions\n Confrontation: direct\n\n Satisfying tactile and visual presence",
    "timestamp": 1753308000
  },
  {
    "username": "JesusChristIsKing97",
    "rating": 7.0,
    "comment": "Mit mondjak, nagyon jó persze. Lehet még kéne párszor játszani, hogy igazán tudjam értékelni.",
    "timestamp": 1752876000
  },
  {
    "username": "ajewo",
    "rating": 7.0,
    "comment": "Nemesis is a multiplayer survival game unofficially adapting the Alien movies by Awaken Realms.\n\nReplaced by:\nNemesis: Lockdown (aka Nemesis v1.5) is still 90% the same game, but it fixes some of the mechanical gameplay issues of Nemesis (see Cons).\n\nWhat makes it special?\n* Theme: the unofficial Alien game\n* Harsh, survival atmosphere\n* Combat against Aliens with unknown health\n* Semi-cooperative survival game: NPC against players and players against players with personal secret goals (similar to Dead of Winter). It is all about making sure that your character will survive.\n\nPros:\n+ Theme: Alien the board game\n+ Good artwork\n+ Components: plenty of detailed, gorgeous looking minis\n+ Modular board with random room set-up each game\n+ Exploration: players have to explore the rooms of the ship\n+ Fun combat due to variable Alien life (high uncertainty). Hits are based on dice (however, very little mitigation). Aliens are very strong, not easy to kill, and a real threat (especially because ammo is scarce).\n+ Harsh, tense, survival atmosphere (low ammunition, risky movement, push-your-luck dice rolls)\n+ Common goals (bring ship to earth intact) combined with conflicting secret goals\n+ Strategic semi-coop gameplay: stall your actions and wait for your teammate to trigger an encounter, help other players(???), selfish secret goals, self-destruction of the ship, keeping the ship intact: malfunctions and fire. Staying together has some advantages, however, secret goals give players reason to separate. The game feels more like an egoistic multiplayer solo game than a cooperative game.\n+ Secret objectives similar to Dead of Winter like \"player number 5 must die\" but you are not allowed to directly attack other players, so you have to sabotage or hurt them somehow indirectly (which is not easy to accomplish). Usually the Aliens will do the job for you anyway (without your help).\n+ Hard difficulty (the game can swing quickly into a downward spiral)\n+ Equipment is quite useful\n+ The high randomness sometimes lead to fun results and group experiences\n+ Scales quite well with most player counts\n+ Eliminated player may take over the role of the aliens that makes the game even harder for the other players and will end the game faster. This fact may encourage for more cooperation between players to prevent someone from dying.\n\nNeutrals:\n# Language dependent: text on cards\n# Solo mode available\n# Quite high luck factor, especially for combat encounters. Little opportunities for luck mitigation.\n# Luck of the draw (items, hand cards)\n# Due to randomness and erratic Alien behavior, some games feel rather lackluster (not enough is happening)\n# Aliens act very samey except for the face hugger (expansions adds new Alien types)\n# Escaping in an Escape Pod seems to be more safe and efficient than in stasis because of the uncertainty where the ship is headed\n# Potential player elimination: a player may either die or leave the ship very early. However, this player takes over the control of the Aliens which makes the game extremely hard for the remaining surviving players and will definitely end the game soon for everyone.\n# Plenty of tokens and cards to organize\n\nCons:\n- Rules require constant referencing and re-checking. The rules are not elegant and could be much more streamlined without losing anything gameplay-wise or atmosphere-wise (say \"hello\", Alien bag!).\n- Basic characters do not play very differently (nearly same deck of cards).\n- Using escape pods is way better than cryo stasis to win the game. Cryo stasis is a hail mary due to the very little chance of survival (repaired engines + correct course + ship does not self-destruct + no infection).\n- Some turns are not exciting: Do healing. Next player. Do repairing. Next player. Walk to room to re-check what another player has done. Next player. Most of the time the game feels like pick-up-and-delivery and it takes several turns to get somewhere or get anything done. Technically, Nemesis is a race game, where you have to play most efficiently against the time. And you also need some, no, a lot of luck.\n- Mechanically, the game is somehow contradictory... Sometimes it is better to do just nothing on your turn. It is often very risky to move because you likely trigger an Alien because the Noise markers never disappear otherwise. Instead, you may wait for your team mates, to do the dirty work, but this may not happen. :-)\nYou have to pass for the whole round, if you do nothing on your turn. This way, the game tries to force you to do something instead of stalling. Encounters are less dangerous when you end your turn early and still hold many cards in your hand (thus, do as less as possible and only what is absolutely necessary). So mechanically, it is better to do nearly nothing than to do something.\n- If you become infected you loses so many actions and rounds in summary, just to get rid of the Alien: you have to find and move to the operation room, heal yourself, pass for the rest of the round and..., oh, the game is already over?\n- Very few opportunities to mediate dice rolls. Luck-based events often cause harsh, brutal gameplay. Death may be sudden if you are already injured. There is tension to this: if you are weak, you tend to get bashed even more (downward spiral).\n- Not much cooperation or interaction between players in semi-coop mode. The game is based on efficient play. Often it takes too much time, to cooperate or interact with someone else directly.\n- The traitor mechanic is used as a key mechanic to promote the game, but I think it is often misunderstood. Nemesis is about exploring and surviving in the first place. Yes, it has a semi-cooperative mode, but you should not expect a Battlestar Galactica or Dead of Winter. The semi-cooperative mode is like a multiplayer survival solo game where each player first tries to make sure his/her character will survive and other players do the same while everyone is changing the state of the ship. E.g., resources are scarce and you may have to walk from one side of the ship to the other just to find maybe some left ammo if nobody else loots it before you do.\n- Some secret goals are too easy to guess after you know which goals exist in the game. Some goals are also easier to accomplish than others.\n- Rotatable rooms indicate the number of searchable resources - a neat idea but it feels clunky and my alignment OCD does not like it when texts are differently rotated on the main board.\n- I don't like square rulebooks/player's aids. They are unhandy!\n(-) Variability is rather low due to low variety of the items and player cards. However, the random map and secret goals as well as the random behavior of the aliens ensure a different game each play (maybe expansions and KS exclusives improves this).\n\nThoughts:\nI really like the setting and the general idea of the game. The biggest plus is the game's atmosphere of uncertainty and harsh survival. However, Nemesis lacks some elegance rules-wise and might feel repetitive over time. You usually have very limited actions each round.\nAlthough I am a fan of semi-cooperative games, I think I might like it more cooperatively, because Nemesis is already very hard and some secret goals make it even harder. I do not think Nemesis should be seen as a traitor game in the first place. It is all about exploring and surviving. The traitor mechanic is neat, but not as important as promoted. Sabotaging the ship's direction or engines sounds like fun but it consumes a lot of additional time for the other players to move through the ship and check what a player has done. Yes, it invites for trusting and lying which is cool, but gameplay-wise, I think it is too easy for the traitor and too hard for the other players to check and stop that player (besides your main goal which is surviving the game at all).\nDespite all the negative points, I still like Nemesis. I am mostly disappointed about the mechanical implementation of the game. The harsh survival atmosphere is great what makes the game stand out. Rewards are very rare in this game. The miniatures look great and Alien-like even without the official license. I am not inclined to play Nemesis every week but every now and then.\n\nSimilar games:\n* Lifeform (Alien theme, 1 vs many, no player elimination, similar card play, quicker playing time, no miniatures)\n* Dead of Winter (semi-coop survival game with more variation and player interaction)\n* Stationfall",
    "timestamp": 1752444000
  },
  {
    "username": "Weirdsalmon",
    "rating": 6.8,
    "comment": "6.8/10: Alien the board game that is SEMI corporative. My first playthrough of this was certainly with the wrong group of people and I could potentially see this moving if played again with the right people.\n\nA hate horror but something about this game just really intrigues me. Shit goes so horribly wrong so fast it’s comical. Trying to work towards your goal is fun and engaging. Combat feels hopeless in a way that seems correct.\n\nOne gripe I have is the indicator for the number of items in a room. This is difficult to read quickly, and causes rooms to be at all different angles making just reading which room you are in difficult.",
    "timestamp": 1751925600
  },
  {
    "username": "ProverbialLightbulb",
    "rating": 7.0,
    "comment": "Keeper",
    "timestamp": 1750629600
  },
  {
    "username": "fran76cz",
    "rating": 7.0,
    "comment": "It's fine. Too much fiddly rules, but fine.",
    "timestamp": 1750543200
  },
  {
    "username": "Geoboffin",
    "rating": 7.0,
    "comment": "Too much rules overhead, but the story potential is awesome.",
    "timestamp": 1750370400
  },
  {
    "username": "Tini",
    "rating": 8.0,
    "comment": "Alien, the movie, as a semi-cooperative game.\nIt creates memorable stories of epic fights and betrayal.",
    "timestamp": 1762038000
  },
  {
    "username": "ghost_sasquatch",
    "rating": 8.0,
    "comment": "+Aftermath\n+Medic",
    "timestamp": 1761865200
  },
  {
    "username": "janglemangle",
    "rating": 8.0,
    "comment": "simpler and better than i thought",
    "timestamp": 1761519600
  },
  {
    "username": "PapillonPaladin",
    "rating": 8.0,
    "comment": "Very Challenging!",
    "timestamp": 1761519600
  },
  {
    "username": "DarceVader1",
    "rating": 8.0,
    "comment": "Man I wish I had more people to play this with.",
    "timestamp": 1761170400
  },
  {
    "username": "hadsot",
    "rating": 8.0,
    "comment": "This game is really fun and thematic, really like the styling and how everyone feels and does during the game.\nThis isn't higher just because of the setup and teardown, and because of that some parts are not that streamlined which I would love to be more straightforward even though some decisions are probably just to be more thematic\nThe only grip is also can be very random , where you don't have that much control and die without you even having a decision, some parts could change that where the queen doesn't show one the first rounds or certain events should only appear more on the later rounds of the game\nBut overall was a really nice experience",
    "timestamp": 1760824800
  },
  {
    "username": "Rhythm_and_Blues",
    "rating": 8.0,
    "comment": "A thematic game with amazing production. One of the swingiest experiences you can have in a board game. I like this game, but my biggest gripe with it is that when things are going well, it's not very fun. This is such a large issue for a game, for me at least. When things are going bad, or situations arise where every decision has lots of risk, Nemesis feels great. But when things are going your way, Nemesis feels so empty. And one of the biggest reasons for this is because in these scenarios, you aren't usually being rewarded for clever moves or plays. It is almost always luck dependant. You happened to discover the one room that you needed to go to, or you happen to get the one item that you needed to get out of the ship immediately. I'm not sure how this problem could be fixed, but it does bring the game down a lot for me. It's also because it happens quite often. I've played this game six times or so, and nearly half of them had these issues. Still definitely a good game, and one with a unique feel to play. And I also love the fact that Nemesis is not boring even when it's not your turn. That's so crucial for a game that plays at 5, and the game does an excellent job there.\n\nNemesis is a weird one. It's a game that depending on the day, could be great or could be pretty whatever. And while it's definitely more likely to be a great experience, sometimes I think, why take the gamble? There are other games out there that are great every time you play.",
    "timestamp": 1760824800
  },
  {
    "username": "Dziubek",
    "rating": 8.0,
    "comment": "Plus dodatkowe karty celów, przedmiotów i ran z fanowskiego druku. Plus fanowska postać Robot (plansza, karty i figurka).(Karty w koszulkach)",
    "timestamp": 1760652000
  },
  {
    "username": "Robber91",
    "rating": 8.0,
    "comment": "Good Alien style board game. Cooperative",
    "timestamp": 1760479200
  },
  {
    "username": "epcineo",
    "rating": 8.0,
    "comment": "I like to atmosphere of the game. I more coop type guy, so I can accept the additional secret mission layer as well.",
    "timestamp": 1760479200
  },
  {
    "username": "Giors76",
    "rating": 8.0,
    "comment": "SOLO GAME 1-5 GG 8.3",
    "timestamp": 1760306400
  },
  {
    "username": "InvertedForce",
    "rating": 8.0,
    "comment": "Retaliation KS - plus Medic. Fulfilling June/July",
    "timestamp": 1760306400
  },
  {
    "username": "Tobias_H",
    "rating": 8.0,
    "comment": "with expansion (Voidseeders, Aftermath)",
    "timestamp": 1760306400
  },
  {
    "username": "Stingart",
    "rating": 8.0,
    "comment": "A lot of emotions.",
    "timestamp": 1759615200
  },
  {
    "username": "xoopams",
    "rating": 8.0,
    "comment": ";",
    "timestamp": 1759528800
  },
  {
    "username": "Zozobaltazar",
    "rating": 8.0,
    "comment": "Sukhy",
    "timestamp": 1759442400
  },
  {
    "username": "BaronEyeball",
    "rating": 8.0,
    "comment": "Additional play throughs with more cooperation between players and a player taking over aliens made me increase to 8",
    "timestamp": 1759183200
  },
  {
    "username": "brunogaia",
    "rating": 8.0,
    "comment": "OUTSTANDING!",
    "timestamp": 1759183200
  },
  {
    "username": "Ironclad_Board_Gamer",
    "rating": 8.0,
    "comment": "Very good",
    "timestamp": 1759010400
  },
  {
    "username": "Adri_corr",
    "rating": 8.0,
    "comment": "(1, 5) #players",
    "timestamp": 1759010400
  },
  {
    "username": "Cicerone",
    "rating": 8.0,
    "comment": "Less of a game and more of an experience: Its literally Alien/the Thing - The Game. The battle system is really frustrating though.\nSold it due to friend owning EVERYTHING",
    "timestamp": 1758751200
  },
  {
    "username": "angstyzebra",
    "rating": 8.0,
    "comment": "Semi-Coop/Story Based",
    "timestamp": 1758578400
  },
  {
    "username": "Ornios",
    "rating": 8.0,
    "comment": "Expansión “Sembradores del vacío”\nExpansión “Carnomorfos”\nExpansión “Trascendencia”\nExpansión “Terrain pack”\nPersonaje \"Médica\"\nTapete oficial",
    "timestamp": 1758405600
  },
  {
    "username": "FranzK",
    "rating": 8.0,
    "comment": "Super thematic and super fun. Looking forward to more plays. Strikes me as the perfect Ameritrash experience.\n\nFirst play was 3p and took about 3 hours. Second play was 2p and moved pretty briskly, taking a bit under 2 hours.\n\nFive plays in, I’m absolutely loving this. Probably the best Ameritrash game I’ve ever played. It shines multi-player and solo. Every game has had an amazing story.",
    "timestamp": 1758405600
  },
  {
    "username": "CKaefe",
    "rating": 8.4,
    "comment": "It took me a while to give this game a chance. After three plays, I can say I'm in love with it. The thrill that every dice roll gives. The highly thematic setting and mechanism. Even to teach, despite being massive, it is not a headache. By default, I only explain how the goal and movement works, and later, during the play, when a new mechanism shows up, I introduce the rules gradually. Right now don't see any point in grabbing any of the expansion. And since I do not see myself playing it solo, I can see that the base game provides a lot.",
    "timestamp": 1758319200
  },
  {
    "username": "Beefy79",
    "rating": 8.0,
    "comment": "Played Mike's Copy",
    "timestamp": 1758146400
  },
  {
    "username": "Nick_Kal13",
    "rating": 8.0,
    "comment": "Είναι ένα Cinematic παιχνίδι που βγάζει το θέμα 100% , έχει εύκολους κανόνες και ωραία ροη παιχνιδιού οι φιγούρες του είναι σε άλλο level! Το μόνο που θα μπορούσε να κάνει καλύτερα είναι το σύστημα μάχης είναι λίγο απλό όχι κακό.",
    "timestamp": 1758146400
  },
  {
    "username": "Tacoscott",
    "rating": 8.0,
    "comment": "Basically a perfect version of this type of game, but I have a strong bias in favor of pure co-op games.\n\nThis game works great for some groups I play with that favor competitive games, so I can get a best of both worlds type-of play session.",
    "timestamp": 1757541600
  },
  {
    "username": "414448",
    "rating": 8.0,
    "comment": "Strong emergent narrative game. Simple rules, and less clunky than my old favorite Arkham Horror 2ed.",
    "timestamp": 1757023200
  },
  {
    "username": "jauntys",
    "rating": 8.0,
    "comment": "Nemesis is the most immersive boardgame experience I have ever had.\n\nYou wake up in the cryochamber of a spaceship called Nemesis. Something is wrong, alarm lights are blinking and the crew woke up too early from cryo sleep. In the chamber there is a corpse lying around. The goal of the game is to check if the destination coordinates are still correct, engines are still working and complete a personal or corporate (evil) objective. Oh and before I forget, the ship is infested with alien creatures. With card-driven gameplay and rolling dice you explore the ship and exterminate the threat while trying to not get contaminated.\n\nIf you're up for a cinematic challenge, play Nemesis. You will not regret it.\n\nHowever, there are a few reasons why this isn't a perfect game. The rulebook is quite awful, no logical ordering of rules and a missing glossary. Also the game is extremely difficult due to it's randomness and the powerful capabilities of the aliens. This is the reason why I prefer playing full co-op (everyone has global objectives, not personal or corporate ones) to decrease the difficulty. Furthermore, to decrease the difficulty we always houserule that when searching and finding a weapon, it is loaded with ammunition.",
    "timestamp": 1756936800
  },
  {
    "username": "nhlln",
    "rating": 8.0,
    "comment": "Unsleeved, on purpose",
    "timestamp": 1756936800
  },
  {
    "username": "DaitanKoba",
    "rating": 8.0,
    "comment": "can be really random, but the emergend story from gameplay is good.",
    "timestamp": 1756850400
  },
  {
    "username": "parzi42",
    "rating": 8.0,
    "comment": "Alien the board game. As an alien fan its a must buy.",
    "timestamp": 1756677600
  },
  {
    "username": "Manzarak",
    "rating": 8.0,
    "comment": "FS Insert\nMINIS ANMALEN",
    "timestamp": 1755727200
  },
  {
    "username": "rfeldster",
    "rating": 9.0,
    "comment": "I’m only a few games in, but I’m really enjoying it. There’s a significant amount of complexity and upkeep, but the overall experience is well worth it. I’ll likely only play the game solo or coop, so it’s too bad that there aren’t more of those specific objectives included in the box. I’ve supplemented the 7 that come in the box with a total of 38 additional objectives that were fan-made and/or that I tweaked/created.\n\nI purchased the following upgraded components:\n- Item crates from BGG\n- Green slime bases and markers from Etsy\n- Intruder, Void Seeder, and Carnomorph injury cube bases from Etsy\n- 3D Technical corridors (8 red, 7 blue) from Etsy\n- 3D Computer terminals from Etsy\n- 3D Intruder eggs from Etsy\n- 3D Quest item toolboxes from Etsy",
    "timestamp": 1762619400
  },
  {
    "username": "Drainlife",
    "rating": 9.0,
    "comment": "nice theme, nice mechanics, tension every action matters, luck and bad luck but overall a wonderful gaming experience",
    "timestamp": 1762470000
  },
  {
    "username": "knapicrllr",
    "rating": 9.0,
    "comment": "Intruder pledge (all-in)\n\nhttps://www.kickstarter.com/projects/awakenrealms/nemesis-bo...",
    "timestamp": 1762210800
  },
  {
    "username": "0Kage",
    "rating": 9.0,
    "comment": "5P",
    "timestamp": 1762210800
  },
  {
    "username": "serscop",
    "rating": 8.8,
    "comment": "Gioco che mi ha conquistato ancor prima delle meccaniche per l'ambientazione chiaramente ispirata all'universo di Alien. A bordo di una nave spaziale che fa rotta sulla terra ogni giocatore ricoprirà uno specifico ruolo (capitano, meccanico ecc.) della crew... apparentemente uniti pian piano tutti al tavolo si scotenneranno in cerca di un miraggio: SOPRAVVIVERE. Gli xenomorfi piopperanno fuori da ogni dove e metteranno in grossa difficoltà tutti i giocatori... tradimenti, false alleanze, vane speranze! Nemesis è tutto questo se non di più. Un bellissimo gioco, unico neo l'abnorme setup. Andrebbe snellito in qualche modo per renderlo un vero e proprio giocone.",
    "timestamp": 1762210800
  },
  {
    "username": "latindog",
    "rating": 9.0,
    "comment": "As has been said before, this has the feel of the movie Alien in a box. Still dealing with some rules consultations in my first few games but the theme shines through nonetheless.",
    "timestamp": 1762038000
  },
  {
    "username": "SergeBabiychuk",
    "rating": 9.0,
    "comment": "Nemesis - When Losing is Fun and Epic // Board Game Review => https://youtu.be/5hRWp9zp9gY\n\nIn Nemesis, the odds are against you. Most likely, you will lose. Also, you might be frustrated with the amount of luck and randomness, long playtime, and player elimination. BUT, if you accept all this, you will be treated with an epic cinematic experience that your friends and you will remember and talk about for years!",
    "timestamp": 1761778800
  },
  {
    "username": "ditterio",
    "rating": 9.0,
    "comment": "Great thematic experience",
    "timestamp": 1761692400
  },
  {
    "username": "ydeloffre",
    "rating": 9.0,
    "comment": "Assurément mon jeu semi-coop favori. Tout est bien dans ce jeu. Le design, l'histoire, les mécaniques, la beauté des figurines. Bien sûr il y a une part de hasard. Mais cela fait juste ajouter à la tension et au suspence du jeu! Un gros OUI pour Nemesis.",
    "timestamp": 1761606000
  },
  {
    "username": "AlbertoRavioli",
    "rating": 9.0,
    "comment": "95/100",
    "timestamp": 1761519600
  },
  {
    "username": "tiggsterino",
    "rating": 9.0,
    "comment": "Sleeved",
    "timestamp": 1761429600
  },
  {
    "username": "Boardvadda",
    "rating": 9.0,
    "comment": "+Carnomorphs\n+Nachspiel",
    "timestamp": 1761429600
  },
  {
    "username": "Orendil",
    "rating": 8.5,
    "comment": "Some of my most memorable board gaming stories come from this game and how they have the perfect 'semi-coop' / traitor mechanic which keeps you guessing while having to work together to some degree. Mechanically, it does have a little too much randomness for my liking, and Nemesis: Lockdown is a tighter game, but this feels like an Alien board game through and through.",
    "timestamp": 1761256800
  },
  {
    "username": "antonkartashov",
    "rating": 9.0,
    "comment": "2p, 3p, 4p!, 5p!\n\nComplexity: ●●● (hardcore)\nDuration: 180 mins[/c]\n\nA semi-cooperative game with traitors. Based on Ridley Scott’s Alien movies. Your task is to reach the Earth together. At the same time, there are alien eggs on the ship, from which monsters hatch. Plus, some of the players may suddenly turn out to be bad: they try to break the ship or kill other players.",
    "timestamp": 1760997600
  },
  {
    "username": "xmorridin",
    "rating": 9.0,
    "comment": "Kickstarted!",
    "timestamp": 1760911200
  },
  {
    "username": "MoochyMania",
    "rating": 9.0,
    "comment": "* Solo Mode ✓\n* Sleeved ✓",
    "timestamp": 1760652000
  },
  {
    "username": "Lostren",
    "rating": 9.0,
    "comment": "Excellent game!",
    "timestamp": 1760652000
  },
  {
    "username": "mrm9084",
    "rating": 9.0,
    "comment": "Has 1 Player",
    "timestamp": 1760392800
  },
  {
    "username": "leviathangr",
    "rating": 9.0,
    "comment": "PnP",
    "timestamp": 1760220000
  },
  {
    "username": "AlBundy4td",
    "rating": 9.0,
    "comment": "Gamefound trilogy pledge 12/23, fulfillment Oct'24, Received Dec '24, on shelf of opportunity, Got first play in and the theme was definitely there, spawning queen first and getting sneak attack only lead to a gruelling attempt to survive. looking forward to future plays.",
    "timestamp": 1760047200
  },
  {
    "username": "Supertimor33",
    "rating": 9.0,
    "comment": "Very nice game. Enjoy the rules, easy to understand. The coop and semi coop make the game amusing.",
    "timestamp": 1759960800
  },
  {
    "username": "Nakira",
    "rating": 9.0,
    "comment": "Nemesis – The unofficial Alien board game in everything but name — and atmosphere to spare. You wake from cryosleep aboard a silent ship, systems failing, engines sputtering… and something else is moving in the dark. Together, you and your crewmates must repair the ship, check the course, and try to survive — all while quietly pursuing your own secret objectives. Cooperation is essential… until it isn’t. Maybe you “accidentally” seal a door with a Xenomorph and a teammate inside. Oops. The rules can be a bit fiddly and the playtime hefty, but no other game captures cinematic tension quite like this. Every session feels like a full-blown sci-fi thriller — equal parts terror, betrayal, and glorious disaster.",
    "timestamp": 1759874400
  },
  {
    "username": "JuMeruem",
    "rating": 9.0,
    "comment": "L'uns des meilleurs jeux auquel j'ai pu jouer !\n\nAucun autre jeu ne m'a donné ces sensations et cette immersion.",
    "timestamp": 1759701600
  },
  {
    "username": "Herrgebauer",
    "rating": 9.0,
    "comment": "The most thematically cohesive game in my collection. I have found this game very easy to teach (as long as people have seen the movie Alien). There is great thematic cohesion to all the gameplay elements as well as the art assets, and while there is a lot to keep track of, it all logically tracks with the world it inhabits. the bag mechanic can allow for some very frustrating outcomes, but I have rarely had that derail the experience. Others have, and it can be truly brutal.",
    "timestamp": 1759701600
  },
  {
    "username": "Jegesmedve",
    "rating": 9.0,
    "comment": "Fun.",
    "timestamp": 1759615200
  },
  {
    "username": "Harley57",
    "rating": 8.5,
    "comment": "Included expansions:\n\nAftermath",
    "timestamp": 1759442400
  },
  {
    "username": "Adripg3",
    "rating": 8.5,
    "comment": "2025",
    "timestamp": 1759356000
  },
  {
    "username": "Ddyraw",
    "rating": 9.0,
    "comment": "Fully Painted, such an amazing fun ride, not much else like it, worked great with family and game group. Needs one more play",
    "timestamp": 1759356000
  },
  {
    "username": "dougfoolery",
    "rating": 9.0,
    "comment": "Everything about Nemesis is dripping in theme and tension. Yes, the game is fiddly with a lot of rules but they all make sense and flow well after a few plays. Love the exploration and the constant feeling of dread as you weigh the risk-reward of your actions at every turn. The punishing design forces you to cooperate and be in close quarters with each other, adding more suspense as you never know if they are near you to help or to harm you.",
    "timestamp": 1759356000
  },
  {
    "username": "kgkan",
    "rating": 8.5,
    "comment": "Absolute cinema.",
    "timestamp": 1759183200
  },
  {
    "username": "ILoseAtLife",
    "rating": 9.0,
    "comment": "Probably my favorite thematic game (and one of my overall favorite games ever). Nemesis captures the feel of the original Alien movie really well. The randomness of the game feels cinematic to me, so I'm ok with the dice rolls, card flops, and aliens popping up to ruin my day. You can't take this game seriously. Almost all (if not all) the players will die every game..and that's fun and great! The production value is gorgeous. I think the semi-coop aspect works wonderfully and is actually crucial to how the game plays.",
    "timestamp": 1759010400
  },
  {
    "username": "Citrobacter_fr",
    "rating": 9.0,
    "comment": "",
    "timestamp": 1759010400
  },
  {
    "username": "ronoc008",
    "rating": 9.0,
    "comment": "Excellent atmospheric game that replicated the existential dread of the movie. The one issue with it is you need to have a group in the mood for a game that is cinematic and not something you are expecting win with any regularity.",
    "timestamp": 1758837600
  },
  {
    "username": "Savcore",
    "rating": 9.2,
    "comment": "Absolutely amazing. So good, and thematic.\nEven more fun if one of the player goes rogue, then the game really shines",
    "timestamp": 1758319200
  },
  {
    "username": "StevenNYC",
    "rating": 9.5,
    "comment": "Pros: Dripping in theme, plenty of unique board/card/item actions for players to tinker with, invokes a sense of despair and paranoia which increases immersion. Each game is very different from the last because of the many hidden objectives and modular board.\n\nCons: Player elimination can be spontaneous if unlucky. Circumstances can lead to punishing outcomes with limited mitigation. The rules are slightly more fiddly than they need to be.",
    "timestamp": 1762611300
  },
  {
    "username": "Dr_IJ",
    "rating": 10.0,
    "comment": "Amazing design.",
    "timestamp": 1762562520
  },
  {
    "username": "bamftw",
    "rating": 9.5,
    "comment": "+ Aftermath\n+ Voidseeders\n+ Crawl deck\n+ Karnomorphs (DE)",
    "timestamp": 1762124400
  },
  {
    "username": "Zanmor",
    "rating": 9.5,
    "comment": "absolute blast. incredibly thematic and great drama",
    "timestamp": 1762124400
  },
  {
    "username": "fska",
    "rating": 10.0,
    "comment": "+ acrylic tokens",
    "timestamp": 1761519600
  },
  {
    "username": "dnrubi0",
    "rating": 10.0,
    "comment": "Awesome! Perfection in a game!",
    "timestamp": 1761429600
  },
  {
    "username": "Radek826",
    "rating": 10.0,
    "comment": "Gra spełnia wszystkie moje oczekiwania i zdecydowanie jest to Top na naszym stole. Nieprzewidywalna i potrafi człowieka zmielić, przerzuć i wypluć dlatego tym bardziej cieszy kiedy uda się ją przechytrzyć - co zdecydowanie nie zdarza się zbyt często... Ten element zdrady współtowarzyszy - nigdy nie wiesz komu i czy w ogóle komuś możesz ufać ? Do podstawki polecam oczywiście zakupić sobie dodatkowe fanowskie cele, co zdecydowanie polepsza rozgrywkę i czyni ją jeszcze bardziej nieprzewidywalną \nNooo ciężko będzie przebić ten tytuł",
    "timestamp": 1761170400
  },
  {
    "username": "schlingo",
    "rating": 10.0,
    "comment": "It is a fantastic atmospheric game! I played it the last few days so many times!",
    "timestamp": 1760997600
  },
  {
    "username": "grayzilla",
    "rating": 10.0,
    "comment": "All cards are sleeved.",
    "timestamp": 1760738400
  },
  {
    "username": "fazermozg",
    "rating": 10.0,
    "comment": "+",
    "timestamp": 1760652000
  },
  {
    "username": "Kuhni",
    "rating": 10.0,
    "comment": "Rating 3,5/90-180Minuten\n1-5/Best 4-5/12Jahre\n\nAftermath 3,3/Best 4\nCarnomorphs 3,5/Best 4\nVoidseeders 3,2/Best 4",
    "timestamp": 1760565600
  },
  {
    "username": "Bzsmglsnk",
    "rating": 10.0,
    "comment": "Game offers cinematic experience, this game is not made to win, it is made to experience epic scenes, fighting with aliens, and trying to survive. Try to play it with some atmospheric sound in the background",
    "timestamp": 1760392800
  },
  {
    "username": "Enthused Dragon",
    "rating": 10.0,
    "comment": "KEEP\n\nPlayer Count: Best 4, 5, Recommended 3\n\nNotes:\nWant to play it again.\n\nWaiting for stretch goals.\n\n3D Prints:\n- 4x Character Boards",
    "timestamp": 1760392800
  },
  {
    "username": "Groak",
    "rating": 10.0,
    "comment": "Critics of the game argue that this is no euro, too scripted, random etc... and they are right. The game is basically a bunch of intermingled algorithms that are, franckly, a bit tedious to correctly manage at first.\n\nBUT, if the metrics by which one assesses a boardgame is the amount of pleasure, fun and emotions they provide, then this is an astounding game. Once you learn the algorithms, the magic of the perfectly tuned probabilities quicks in. The game's randomness is of the best kind, generating endless memorable twists both in your favor and against you. The strong theme and immersion translates those twists into an unforgettable emotional roller coster.\n\nIn my first solo playthrough, I was managing two characters in coop mode. In the very last round, after finally reaching the escape pod room, an alien spawned (of course) during the roll/attempt to get into the pod. Only one of my dudes had ammo, and fired them all dealing maybe half the needed damage. In an act of desperation, and convinced we were doomed, I used the action points/cards of my second dude to melee attack the monster. My suicidal hero gained 2 serious wounds (he had one previously, so anything more, even a pat on the back, meant death). He nevertheless managed to miraculously roll an intruder retreat with his last breath, allowing both my guys to jump in the pod with their very last action points. The suicidal guy had a total of 3 contamination cards, the other only one. And you can probably guess who ultimately survived... yup, the heavily wounded",
    "timestamp": 1760220000
  },
  {
    "username": "kReal92",
    "rating": 10.0,
    "comment": "Sleeved\ne-Raptor\nPainted",
    "timestamp": 1759960800
  },
  {
    "username": "jorissuurmeijer",
    "rating": 10.0,
    "comment": "For me this is a solid 10. It is such a tense game that it just holds your attention and let's a 4 hour game feel like half an hour.",
    "timestamp": 1759788000
  },
  {
    "username": "MrMuzzled",
    "rating": 10.0,
    "comment": "Crowdsourced and the most expensive game I've purchased. Fantastic components and just a blast to play. Hand painted all miniatures and bought a neoprene mat for it. Original Kickstarter version.",
    "timestamp": 1759615200
  },
  {
    "username": "injulmiDDUK",
    "rating": 10.0,
    "comment": "Every time you play, you make one movie.",
    "timestamp": 1759442400
  },
  {
    "username": "Lendengold",
    "rating": 10.0,
    "comment": "Anne\n(gekauft auf der Spielemesse Essen, 14.10.2021)",
    "timestamp": 1759442400
  },
  {
    "username": "onlysix",
    "rating": 10.0,
    "comment": "The story that unfolds as you play it is amazing – because everything is so bad and it keeps getting worse. Loved it.",
    "timestamp": 1759356000
  },
  {
    "username": "Chickon23",
    "rating": 10.0,
    "comment": "Top 10",
    "timestamp": 1759096800
  },
  {
    "username": "Sutheimers",
    "rating": 10.0,
    "comment": "Publisher Sleeves (Awaken Realms - 44x67)\nPublisher Sleeves (Awaken Realms - 63x88)\nPlaymat\nStory Dice Intruder Expansion (Sundrop)\nStory Dice Cat Expansion (Sundrop)\nAcrylic Player Trays (Laserforge Miniatures)\n3D Printed Insert (Etsy: Turtlebox3D)\n3D Printed Token Shields (Etsy: BoardToBits)\n3D Printed Stands (Etsy: PrintYourFun)\n3D Alien Egg Upgrades (Etsy: GiantTurtleCreations)\n3D Printed Dashboards (Etsy: M3is3D)\n3D Printed Engines, Intruder Bases, Computer Consoles, & Coordinate Console (Etsy: LaserLand)\nAcrylic Token Sets\n3D Terrain (Publisher - Awaken Realms)\nUnpainted Minis",
    "timestamp": 1759010400
  },
  {
    "username": "Matteo32",
    "rating": 10.0,
    "comment": "meraviglioso",
    "timestamp": 1758924000
  },
  {
    "username": "cortexjackal",
    "rating": 10.0,
    "comment": "Also own the Cats & the Terrain expansion which are both primed and for trade\n\n2 of the cats are painted",
    "timestamp": 1758664800
  },
  {
    "username": "Tennessee_REALTOR",
    "rating": 10.0,
    "comment": "The worst thing about this game is trying to understand the rules. The best thing about this game IS understanding the rules. It becomes one of the best games I have ever played. The expansions make it even better and it becomes apart of your soul.",
    "timestamp": 1758664800
  },
  {
    "username": "jazzhorizons",
    "rating": 10.0,
    "comment": "A dungeon crawler where you walk around a ship trying to survive and dealing with intruders.\n\nOne of the best games I've ever played. It is truly atmospheric and horror themed. There's nothing bad I can say about it. It's a must have for every collection.\n\nIt can work for beginner board gamers, but the GM has to be very confident with their abilities. I played two games with beginner board gamers, and I kept the explanation to a minimum, explaining just the basics of spending cards for actions and moving around the board, while I myself did the backend. In these circumstances it becomes more like a TTRPG. In general though this needs to be at least a step-up game, if not a game for experienced gamers.",
    "timestamp": 1758664800
  },
  {
    "username": "Debts2collect",
    "rating": 10.0,
    "comment": "I'll be honest and say that the Pilot and the Scientist are NOT fun to play as because their abilities don't really compensate for the weak weapons they start with. I mean come on, was it really necessary to make the scientist's 3-bullet-pistol even weaker by making his \"double-hit\" only count as a \"one-hit\"!?\n\nGame is awesome nonetheless imo.",
    "timestamp": 1758319200
  },
  {
    "username": "rafaelpaz",
    "rating": 10.0,
    "comment": "Played only once...\nThe game has immense potential for immersion in the universe of the film Alien. Lots of betrayal and threats all the time.\nI need to play more times to \"live\" this movie again and maybe increase the rating.",
    "timestamp": 1758232800
  },
  {
    "username": "KanChri",
    "rating": 10.0,
    "comment": "15",
    "timestamp": 1758060000
  },
  {
    "username": "indianajonesey",
    "rating": 10.0,
    "comment": "Penny sleeves; Wintra Inner Card Sleeves, 64 x 89mm\nSmall cards: Arcane Tinmen Small Board Game Card Sleeves – 44mm x 68mm",
    "timestamp": 1757887200
  },
  {
    "username": "wobbel",
    "rating": 9.5,
    "comment": "The semi (not always so nice) co-op is great.",
    "timestamp": 1757800800
  },
  {
    "username": "Colnics",
    "rating": 9.5,
    "comment": "The movie Alien, in a box.",
    "timestamp": 1757714400
  },
  {
    "username": "theradon",
    "rating": 10.0,
    "comment": "Co-op",
    "timestamp": 1756850400
  },
  {
    "username": "aaronrojo",
    "rating": 10.0,
    "comment": "Great game!!!",
    "timestamp": 1756677600
  }
]