[
  {
    "username": "marinexx",
    "rating": 1.0,
    "comment": "Can't even be mixed-in with what I currently have and so I have to go through all 300+ cards, remove some, then shuffle these in, and then my other expansion starts gathering dust. Makes no sense.",
    "timestamp": 1756677600
  },
  {
    "username": "GhostImperium",
    "rating": 1.0,
    "comment": "Animals",
    "timestamp": 1738537200
  },
  {
    "username": "Mandurang",
    "rating": 2.0,
    "comment": "Played all the Wingspan expansions but they barely improved my (already quite low) opinion of the game.",
    "timestamp": 1753912800
  },
  {
    "username": "Lengytam",
    "rating": 2.0,
    "comment": "The cashgrab asian version of the original. Doesn't worth a word.",
    "timestamp": 1739487600
  },
  {
    "username": "darkk_",
    "rating": 3.0,
    "comment": "The expansion makes the original game much longer with a lot of down time waiting for 6-7 players to take their turns.\n\nCaptivating ✅\nEngaging ❌\nReplayability ❌\nRules ❌\nQuality ✅",
    "timestamp": 1759096800
  },
  {
    "username": "rodigeun",
    "rating": 3.0,
    "comment": "Replaced with Wyrmspan",
    "timestamp": 1754431200
  },
  {
    "username": "FredrikEspedal",
    "rating": 4.0,
    "comment": "Adding new complicated abilities that ends up with the same endresult: gain food, gain card, gain egg is not interesting, it's lazy game design and makes for a worse user experience. Why would I spend 30 seconds extra on my turn to throw dice 3 times, when I can just take a resource based on a condition?",
    "timestamp": 1759701600
  },
  {
    "username": "barbi",
    "rating": 4.0,
    "comment": "I play Wingspan with my mum and she didn't like the additional layer, and not enough for me to bring it to the table with gamers ... sticking to the base game!",
    "timestamp": 1733871600
  },
  {
    "username": "tempar",
    "rating": 5.0,
    "comment": "based on original",
    "timestamp": 1761343200
  },
  {
    "username": "mojopet99",
    "rating": 5.0,
    "comment": "My partner liked it. I find it super boring. We donated it.",
    "timestamp": 1756245600
  },
  {
    "username": "Eliya84",
    "rating": 5.0,
    "comment": "Not necessary, because the classic works as well as a 2-player game.",
    "timestamp": 1747864800
  },
  {
    "username": "Delphinium",
    "rating": 5.0,
    "comment": "Sadly this feels like an expansion too far. There are cards that can end up degenerately powerful - ooh I drew a card that will score 28 when played - the range in scores are massive in a group that played dozens of games with Oceania and had many tight finishes - turning a classic into “Cosmic Encounter” seems a retrograde step and seems just to be milking the franchise.",
    "timestamp": 1729461600
  },
  {
    "username": "KIJUER",
    "rating": 6.0,
    "comment": "New game modes are utterly insignificant. For those, rating would be a \"2\". The fact that the game wasn't conceived and designed to work these ways and these were a \"patched up\" addition is evident.\nNew cards are more than welcome instead.",
    "timestamp": 1757887200
  },
  {
    "username": "Dahlia132",
    "rating": 6.0,
    "comment": "The real value is in the new birds, which are gorgeous and with interesting powers. The duet mode, which was supposed to be the main appeal, is ... meh... We prefer the base game for 2 people.",
    "timestamp": 1748124000
  },
  {
    "username": "one_maniac",
    "rating": 6.0,
    "comment": "The cards are a nice edition to Wingspan (8). The two player mode not so much (4).",
    "timestamp": 1746568800
  },
  {
    "username": "9zero21zero",
    "rating": 6.0,
    "comment": "BGG Secret Santa gift.",
    "timestamp": 1740956400
  },
  {
    "username": "HotHeart",
    "rating": 7.0,
    "comment": "Have no use for the Duet or Flock modes, so this is a bit more like an expensive card pack.",
    "timestamp": 1762124400
  },
  {
    "username": "skince",
    "rating": 7.0,
    "comment": "Still waiting for this one to click with me. It's a fine engine builder and I love the card art and design, but I don't get the same fun feeling building my bird engine as I might in other engine builders. In trying to put my finger on why, all I can come up with is lack of control. My bonus objectives, the food, the birds (aside from three in the display) are random. So you just take turns and see what you end up with. The tacked on duo board for largest contiguous group and other bonuses hasn't hit with me and many of the bird abilities leave me wanting more as well, but again I'm trying to determine why. It's a mystery that needs to be solved.",
    "timestamp": 1761865200
  },
  {
    "username": "Aimii",
    "rating": 7.5,
    "comment": "Plays logged on original Wingspan",
    "timestamp": 1762676040
  },
  {
    "username": "aaronandersen",
    "rating": 8.0,
    "comment": "I love that this expansion has a more interactive 2 player standalone option.",
    "timestamp": 1762632660
  },
  {
    "username": "K Fay",
    "rating": 8.5,
    "comment": "Elisabeth",
    "timestamp": 1761865200
  },
  {
    "username": "glsonn",
    "rating": 9.0,
    "comment": "Karen got from Wendy for Christmas, 2024.\n\nInitial rating = 9. Could go either way later. (Original Wingspan = 10.)\n\nH - 12",
    "timestamp": 1760997600
  },
  {
    "username": "gregbigler",
    "rating": 10.0,
    "comment": "More and better gamble hunters. Some people have upgraded the NA hunters due to these.\nHad to have it.",
    "timestamp": 1761951600
  },
  {
    "username": "clawp1995",
    "rating": 10.0,
    "comment": "Sleeve Kings USA Chimera 57.5 x 89 SKS-8808",
    "timestamp": 1761951600
  }
]