[
  {
    "username": "Floating World",
    "rating": 1.0,
    "comment": "Expansions should not be ranked.",
    "timestamp": 1754172000
  },
  {
    "username": "DruidsGrove",
    "rating": 1.0,
    "comment": "One of the worst customer service experiences ever. After receiving the game through pre-order, I found out it was missing a piece. Attempted to get it replaced, was publicly defamed and accused of abusive and rude statements, none of which were founded. Avoid at all costs.",
    "timestamp": 1670540400
  },
  {
    "username": "churchb3",
    "rating": 1.0,
    "comment": "Clank! but not fun at all",
    "timestamp": 1638658800
  },
  {
    "username": "ar7em",
    "rating": 1.0,
    "comment": "A disappointment to a classical Clank! Despite the original one, this game send a wrong message about taking the risk — the best performance is achieved through ignoring game quests and following careful playstyle. The game discourages a player to explore, and trying to innovate by punishing hard and having a strong positive-feedback loop. The game components are poor, and it seems that the authors were lazy to come up with properly sized stickers and areas on the game board. he setup time is long, and the amount of go back and forward steps is downing. The legacy elements of the game are poor, and doesn't provide any customization despite the advertisement message. The only good part of the game is the book of secrets, that has funny stories, but, literally, better pick up a narrative game instead, or play classical Clank for a properly balanced gameply.",
    "timestamp": 1616367600
  },
  {
    "username": "bigharrymonkey",
    "rating": 1.0,
    "comment": "Random things happen. Read random stuff. Find random sticker. Rich get richer. This attempt at a legacy spoils a decent deck-builder.",
    "timestamp": 1602626400
  },
  {
    "username": "Sas8Jo",
    "rating": 2.0,
    "comment": "Finished it, played with an excellent group... It's just not worth it...\nStory was meh at best, it had some funny moments...\nGameplay was ruined by the random events that happened. I like random games, just not 3 hours of gameplay for random oh you win because flip coin.",
    "timestamp": 1759788000
  },
  {
    "username": "demiesta",
    "rating": 2.0,
    "comment": "Never again so mutch stupid story between turn i dont even kwow who's turn it was.",
    "timestamp": 1745445600
  },
  {
    "username": "dbriel",
    "rating": 2.0,
    "comment": "Original Clank is only so-so but this version was well reviewed so I decided to play it with friends. It's really the same game with a terrible story and really bad humor thrown in for some reason. The game drags on and on far too long due to all the reading and fiddly bits. Not my thing at all and the ending was especially maddening. Easily the worst legacy I've played. I think 'tedium' is the best word to describe the whole experience.",
    "timestamp": 1724364000
  },
  {
    "username": "Chee",
    "rating": 2.0,
    "comment": "I really didn't enjoy this legacy experience. Maybe it would have been better if I had more Clank experience prior to playing the legacy game.",
    "timestamp": 1724364000
  },
  {
    "username": "uduhno",
    "rating": 2.0,
    "comment": "No solo play and is a legacy game. All games should be replayable.",
    "timestamp": 1709506800
  },
  {
    "username": "BoardGamingCouple",
    "rating": 3.0,
    "comment": "3/5\nDefinitely not the best legacy game ever made. It is a fun, engaging, solid game. The new map features are enjoyable and this board post game will be a lot more fun than normal Clank. The story and legacy aspect dragged a bit (needed to be shorter - 2h per game for Clank is too long). Still a solid game. This box is big and pricey.\nOther deckbuilders are better and more streamlined.",
    "timestamp": 1762297200
  },
  {
    "username": "yosz",
    "rating": 3.0,
    "comment": "I love Clank! Discovering new paths and story elements gets tiring very fast. After couple of turns almost each move will end up with reading a huge paragraph of text, adding stickers to the board or to cards. Because of that, time of one game is doubled. story is fun but not enough for me to be engaged all the time. Played 6 games out of 10. That was enough . I will skip part 2 and just play Clank Catacombs.",
    "timestamp": 1744927200
  },
  {
    "username": "Krehliv",
    "rating": 3.0,
    "comment": "We're a 3 player group that has played through a few legacy games. We picked this one up due to it's high ratings, but we suspect the reviews are inflated by fans of the D&D campaign that inspired it.\n\nWe played this game for 8 sessions. I can't recommend it. There are significant balance issues on specific cards and long-term rewards mechanics. The same player in our group has won all 8 sessions-- the first two from good gameplay and decision making, maybe some luck, and the rest due to snowballing.\n\nIf you decide to play this game, I highly recommend removing Hoardsperson's Bag (role card that is unlocked after a couple sessions). The player that gets it never has to give it up-- it stays in that player's starting deck permanently, and it's head-and-shoulders above the rest of the role cards.\n\nThere is an imbalance between starting characters. Some are harder than others. There are permanent rewards for achieving character-specific goals, but there are no catch-up mechanics for players that have fallen behind due to slow or difficult character goals. This leads to a rich-get-richer game experience.\n\nEven if our group wanted to continue playing without the game-breaking cards, the permanent buffs received by the player that has won all 8 sessions are too significant. This game is a lot of fun on even footing, but it's clear that this Legacy version wasn't given enough thought.\n\nJust play the base game! Steer clear of this one.",
    "timestamp": 1739055600
  },
  {
    "username": "Korwin",
    "rating": 3.0,
    "comment": "Bad game, like real bad.\nVery long game with long down time for each player (talking about the post legacy version) 3.5 hours for 4 people\nThe main problem is the pace, which is very slow. Compound by the a fact that the board/display state is always changing so you can't plan a head and yet somehow every turn feel samey",
    "timestamp": 1738018800
  },
  {
    "username": "storied",
    "rating": 3.0,
    "comment": "Admittedly, I had a great time playing the first 5-6 games. Unfortunately, the game never finished and sat on my shelf taking up a ton of space and then it just sat there and turned into something I had to toss in the dumpster, because who would play a game that's halfway finished?\n\nThe writing was also really bad and we started skimming through the narration. It's hard to find a game with good writing.",
    "timestamp": 1733266800
  },
  {
    "username": "Sylweczkaaa",
    "rating": 4.0,
    "comment": "jak ktoś wolno robi ruchy to jest taka nuda",
    "timestamp": 1761865200
  },
  {
    "username": "gildedrain",
    "rating": 4.0,
    "comment": "First play: so far so good! Some nice additions to the base Clank formula, lots of story moments, a fun semi-cooperative vibe. It's light enough that we can all joke around and chat while we play, which is refreshing change from some difficult/puzzly cooperative games.\n\nUPDATE after 6th game: Lots of details that are turning me off from this game. The endgame steps are super fiddly and there's no player aid. You have to refer to the rulebook AND the book of secrets at the beginning and end of every single game. Don't setup the game or put the game away until you read all the secrets and all the rules! Don't put a single card away because it might be needed.\n\nThen there are way too many interruptions to the midgame flow. You hit a quest and need to read the story, get out 5 sticker sheets, 7 new cards, put them in various places, make a choice, read the next story segment, get more stickers out.... whose turn was it? This happens so often it's annoying. I'd almost rather they put the story moments at the beginning and end of each game and just let each game have a new twist to focus on. Then let the rules get out of our way so we can just focus on playing. The interruptions make each game drag on.\n\nThen the overly punishing consequences of losing ALL your points if you get knocked out below ground or if you didn't manage to snag an artifact. \"Remember all that fun you thought you had for the past 2 hours? Let's erase that.\"\n\nAnd finally, the game encourages competition way more than cooperation. I think I've seen 2 cards in the entire game that when you play them benefit another player. Overall it's fine, silly fun, but it brings out an overly competitive streak in us and when someone ends the game with a big fat zero it's a huge turnoff.\n\nUPDATE: we all decided to abandon this legacy game without even finishing it. I think legacy games are dead to us now. The pandemic sorta messed that whole thing up. We just can't get together regularly enough for this kind of multi-game-night campaign commitment. It didn't help that we didn't enjoy several moments of the game itself.",
    "timestamp": 1757196000
  },
  {
    "username": "BadO666",
    "rating": 4.0,
    "comment": "The game can't decide whether it's co-op, competitive or adventure. Gameplay is constantly interrupted by unengaging walls of text. Lack of character development. Frustrating and boring",
    "timestamp": 1746655200
  },
  {
    "username": "mhostile",
    "rating": 4.0,
    "comment": "Clank! Legacy is very random. You have luck, you get the right cards at the right time, good. You don't have luck, you get weaker cards, too bad. This is because cards are not balanced in power at all.\n\nThis problem is OK in regular Clank! (which I like) because the game is fast and fun and chaotic. In Clank! Legacy, the legacy elements make the games last for two long hours, which is too much for this game (I really don't mind playing for hours when it's appropriate). Spending 20 minutes reading story paragraphs and finding and pasting stickers is too long!\n\nThis would be OK if the story was good, but it's not! Story is very very very poorly written. Things happen randomly without anything to do with the context of the actions. It's written in a humorous way but it's just not fun at all.\n\nThe board is nice but the cards are ugly. I'm really disappointed in this game. Just play regular Clank! (in Space or not) if you want to play Clank!, and play another legacy game if you want the legacy part. This one is bad.",
    "timestamp": 1740610800
  },
  {
    "username": "ChrisBarrett",
    "rating": 4.0,
    "comment": "For the right group, this seems like an amazingly unique experience. But personally, I don't want to be using stickers and destroying game pieces. Making the whole, expensive thing only properly playable for once group of people once through the campaign. Instead, we tried substituting bits of sticky note in place of the game's stickers. This seems mostly workable. But it does increase the cleanup time. And the setup/cleanup time already seems high for the amount of gameplay/enjoyment here.",
    "timestamp": 1724882400
  },
  {
    "username": "tynaut2",
    "rating": 5.0,
    "comment": "Not a fan of Legacy games, even though I enjoy Clank regular.",
    "timestamp": 1758751200
  },
  {
    "username": "BoltKey",
    "rating": 4.6,
    "comment": "Very disappointing. I didn't play the whole campaign but a single chapter, but the production is just bad. Pixelated icons all over the map, rushed and unfinished card illustrations, jpg artifacts sprinkled everywhere.\n\nThe game itself is not good. Bunch of wild effects just happening.",
    "timestamp": 1757196000
  },
  {
    "username": "eddieb",
    "rating": 5.0,
    "comment": "If you like clank and consequences from game to game. This is for you. I don't like deck builders. but I still enjoyed this.",
    "timestamp": 1754690400
  },
  {
    "username": "cenny",
    "rating": 5.0,
    "comment": "There are some things to like about this game for sure. The exploration of the map is done well and the addition of event cards is cool.\n\nThe main drag of this game is the fiddling and reading. It’s takes so long before you get to do anything, so it’s a lot of waiting, majority of the time spent in this game is not about actually playing it. Then it’s less competitive than original clank, it’s a weird mix of competitive gameplay but not really.\n\nI’ll rather play the original clank with expansions or clank catacombs (which also is a little too long, but still fun).",
    "timestamp": 1746914400
  },
  {
    "username": "felikatus",
    "rating": 5.0,
    "comment": "I loved Clank! until I played this... it was too cumbersome, too much reading that stopped being funny after a couple of plays. Too many interruptions in a game that is so much fun. I guess this legacy wasn't for me.",
    "timestamp": 1745877600
  },
  {
    "username": "darkfinale",
    "rating": 5.0,
    "comment": "end-November '23 Top 60 Games [#20/60]\n\nDungeon exploring, casual game. Interesting deck builder. Might get stale after a while.",
    "timestamp": 1744495200
  },
  {
    "username": "Warren dM",
    "rating": 5.0,
    "comment": "Meh. Sometimes, you just need to play other people's games to be a good human being. Clank basic is fine as it's not too long, but a legacy Clank? oh boy, what we do for friendship.",
    "timestamp": 1740956400
  },
  {
    "username": "Seewolf",
    "rating": 5.0,
    "comment": "Deck Builder / Kenner\nBest 3-4 Player\nLast 05/2024",
    "timestamp": 1740697200
  },
  {
    "username": "Celebrith",
    "rating": 5.0,
    "comment": "Really wanted to like it, but gameplay got repetitive and tedious, while the story wasn't exciting enough to keep playing. After about 7 games or so, the group's interest fizzled out. The only fun-factor was exploration of the map, which itself was at times hindered by gameplay.",
    "timestamp": 1739574000
  },
  {
    "username": "Lordstrategos777",
    "rating": 5.0,
    "comment": "Spend an hour putting on stickers. Play for 45 minutes. Spend an hour putting on stickers and hunting for components and putting things away. Spend an hour putting on stickers...",
    "timestamp": 1739314800
  },
  {
    "username": "Zerkk",
    "rating": 6.0,
    "comment": "It was fun, but not revolutionary. It's really summed up as Clank plus stickers. The story itself did not feel very compelling. However! If you dig Clank and legacy games? Give this one a go.",
    "timestamp": 1761951600
  },
  {
    "username": "burgundy90",
    "rating": 6.0,
    "comment": "2 games in but liking it. It's on the humorous side, with smaller story elements sprinkled in throughout the game. Being a competitive game, there's a tug between trying to maximize your score to win versus trying to unlock more story (by way of fulfilling Contracts). The latter you have no way of knowing for sure whether it will pay off or not. That part can feel random and be off-putting, but we'll see.\n\nEdit 3/26/21 Lowering to a 6 (\"ok, will play if in the mood\"). I'm definitely in the minority, but I hope this comment is useful to anyone reading. Mostly through the campaign, I don't feel the same itch to play this. The legacy elements feel a bit too random, and the story is too much on the comical side for my preference -- that's on me, for not knowing anything about Acquisitions Incorporated. I enjoy original Clank and it's mechanics. It's just the story and randomness do nothing to add to the game (for me), where I'd rather just play Clank.\n\nA reviewer also called out a part that I felt... that you're spending quite a bit of time between games with the legacy stuff, but not in a fun way.",
    "timestamp": 1761519600
  },
  {
    "username": "mqstout",
    "rating": 6.0,
    "comment": "Nominally better than Clank!, but still suffers from the unfun \"escape back to the surface\" mechanism. Added story and evolution makes it at least enjoyable through all that. Game gets closer to normal Clank! feelings later in the campaign (more frustrating, more no-win situations, lots of runaway winner, double-punishing losers).",
    "timestamp": 1760392800
  },
  {
    "username": "UnboughtStuffedDog",
    "rating": 6.0,
    "comment": "Once the game is underway, you are treated to an extremely entertaining and, at times, truly nerve-racking gaming experience. Clank Legacy would have been one of the better legacy experiences for me if it weren't for a few things that ultimately bother me time and again:\n\n1. The insane bureaucracy of setup: In addition to the normal game setup, there are various Legacy effects, such as placing stickers, adding new cards, goals, etc. All of this (including the regular setup) can easily add up to 30-40 minutes. Want to quickly jump into a game? Nice idea – but first, attach sticker 47a!\n\n2. Competitive or cooperative?! The basic mechanical framework is in many ways that of the regular Clank, i.e. a competitive game. However, in order to progress in the story and keep a ‘common’ rival at bay, players are encouraged to partially set aside their competitive attitude. This fits in with the setting, in which we are all career-hungry employees of the same company, but it is integrated into the game mechanically without much incentive. The possibilities for directly helping other players are almost non-existent, and doing something ‘for the group’ usually only feels good if there is a personal advantage to be gained from it. Too often, advancing the story requires moving to remote areas of the game board, while others happily make their way to the exit with an artefact under their arm.\n\n3. Too much randomness? In some games, I raced across half the board, completed missions, and then returned to HQ (or at least almost) with an artefact. These were games in which I was able to buy great cards, collect enough gold, and in which the evil dragon hardly noticed me for a long time. There is a noticeable ‘the rich get richer’ phenomenon here. Some games, on the other hand, were short and frustrating: There aren't any particularly good cards in the card display on my turn? Bad luck! I draw another bad combination of cards? Too bad. Oh, a relatively large number of my cubes were drawn from the bag again? Well, I guess I'll have to pray that I can still make it into the green zone. These elements of randomness are, of course, what make the game interesting and entertaining, but they can also lead to frustrating experiences. Still, this is normal for many board games. However, the fact that in Clank Legacy unfortunate randomness leads to player elimination takes away from the whole game's light-heartedness. I wanted to laugh at my misfortunes and at the same time cheer on the others players, but boy, did Clank Legacy make that a tough task...",
    "timestamp": 1759874400
  },
  {
    "username": "Beefy79",
    "rating": 6.0,
    "comment": "Played Mike's Copy",
    "timestamp": 1758146400
  },
  {
    "username": "gmeney",
    "rating": 6.0,
    "comment": "It's a great legacy game, but it is probably worth half the price, and the box is far too big.",
    "timestamp": 1753567200
  },
  {
    "username": "edsmorg",
    "rating": 6.0,
    "comment": "Josh's",
    "timestamp": 1746396000
  },
  {
    "username": "theaaron",
    "rating": 6.0,
    "comment": "While I'm not the biggest Clank fan, this was a fun legacy experience.",
    "timestamp": 1745964000
  },
  {
    "username": "quinCharlemagne",
    "rating": 6.0,
    "comment": "Gameplay is constantly interrupted by the game itself. Kinda cool sometimes, but can get a bit tiresome when you have to wait 20 minutes for your next turn that involves no decision making and takes 5 seconds. It's a weird hybrid of co-op and competitive that doesn't always work out. This game is a deck-builder, but I've found you don't get to cycle through your deck enough times for your decisions to make as much of an impact as say, Dominion. You're very subject to a lot of different sources of luck/unluck, not just with what cards you draw when, but also what cards are available to buy on your turn, what cubes get randomly pulled out of the bag, or what other players (or the game itself) does that you don't have much agency in reacting to. This game is fine: sometimes frustrating, sometimes good, but not often great.",
    "timestamp": 1744927200
  },
  {
    "username": "RikHavok",
    "rating": 6.0,
    "comment": "2/25",
    "timestamp": 1740265200
  },
  {
    "username": "Charcoman",
    "rating": 6.5,
    "comment": "First thoughs on Clank! Legacy: Go and buy it asap if you tried and liked Clank. Legacy elements add a lot of nice things to what is already a good game.\n\n Exploration fits well to the game.\n Character develops from game to game.\n Fun narrative.\n Rule additions feels organic.\n \n Expensive game.\n Sometimes interruptions during game could happen too often, breaking the game flow.\n Increased randomness compared to base Clank!\n\n In our case, the game length is a bit too much. We cannot play it as often as we would like. This forces us to lose sometime refreshing our memory on what happened the last time we played.",
    "timestamp": 1762124400
  },
  {
    "username": "kensiebensie",
    "rating": 7.0,
    "comment": "Completed",
    "timestamp": 1759356000
  },
  {
    "username": "Arnar146",
    "rating": 7.0,
    "comment": "Gulli",
    "timestamp": 1754517600
  },
  {
    "username": "OldSoulDean",
    "rating": 7.0,
    "comment": "Playing through the campaign with my brother. As a two player game, it's been fun!",
    "timestamp": 1752616800
  },
  {
    "username": "bartistic",
    "rating": 7.0,
    "comment": "Neat game but setup is a chore and lots of reading",
    "timestamp": 1752616800
  },
  {
    "username": "DocBlizz",
    "rating": 7.5,
    "comment": "I really like Clank... And I feel like this is gonna be really good!",
    "timestamp": 1761692400
  },
  {
    "username": "RougeHemlock",
    "rating": 8.0,
    "comment": "If you enjoyed Clank and like legacy games, I strongly recommend this. I wish the mechanics introduced in this meshed better when combining it with the full game afterward (some things blend well, others don't). I don't really know what else to say about this.",
    "timestamp": 1760824800
  },
  {
    "username": "PBandJellyfish",
    "rating": 8.1,
    "comment": "@TX",
    "timestamp": 1760824800
  },
  {
    "username": "badassbr",
    "rating": 8.0,
    "comment": "Ainda no meio da campanha, vamos ver como evolui para eu dar o veredito final",
    "timestamp": 1760306400
  },
  {
    "username": "caltexn",
    "rating": 8.0,
    "comment": "2nd copy purchased to begin new campaign.",
    "timestamp": 1759269600
  },
  {
    "username": "Camillis94",
    "rating": 9.0,
    "comment": "Deck Building\nPush Your Luck\nEnd Game Bonuses\nPlayer Elimination",
    "timestamp": 1762124400
  },
  {
    "username": "ipreuss",
    "rating": 9.0,
    "comment": "I just prefer cooperative games, otherwise it would be a ten. Perfect combination of mechanics and funny story with lots of wit.",
    "timestamp": 1761429600
  },
  {
    "username": "Jmccue",
    "rating": 9.0,
    "comment": "I already enjoy Clank! so this was a logical next step. The campaign was excellent, the best non-Pandemic legacy experience to date.\n\nI dislike the endgame where it is possible some players don't get to count their scores. If you don't make it \"out\" you are already not going to win, why rub salt in the wound by saying you don't even get to count your score? Pro tip: House rule this when playing with new gamers (or all the time) and let everyone count their scores. Newer gamers aren't thrilled by being eliminated.\n\nUpdate: I haven't come back to this game after the legacy experience, even though there is more to explore and unlock. I don't see my same group coming back to this so I'm letting it go, using it for parts.",
    "timestamp": 1760479200
  },
  {
    "username": "ThingsThing",
    "rating": 9.0,
    "comment": "2.74 Complexity\nPretty good campaign, although I played w/ someone that somehow won 90% of the games!\nIt was ridiculous, they were so good @ planning their moves or something!",
    "timestamp": 1759356000
  },
  {
    "username": "Barnettdor",
    "rating": 9.0,
    "comment": "Best at 4",
    "timestamp": 1759183200
  },
  {
    "username": "Whofreak555",
    "rating": 10.0,
    "comment": "Fantastic. Absolutely love it.",
    "timestamp": 1761343200
  },
  {
    "username": "SammySnijbonen",
    "rating": 9.5,
    "comment": "The story is very entertaining and funny, and though 'railroaded' still leaves the player's agency in the 'how' and 'when' (and probably even 'if') of certain details and scenes happening. Every time you think the game won't possibly surprise you anymore, it still manages to do so. There's a great sense of adventure and discovery.\n\n The game is still very playable and fun after the Legacy campaign is over.\n\n Not a spoiler, unless you don't know what \"Legacy\" entails. This game starts as a regular game of Clank! and builds up to several expansions' worth of content along the way. This is very well done, as all the newly introduced gameplay elements interact and none of the earliest new features succumb under the weight of those that get introduced later on.\n\n----\n\n There's a noticeable difference in color between stickers and printed materials, and the image on some stickers is scaled a bit differently from the surface they're supposed to go on to.\n\n Though it gets mentioned at the end of the rulebook (and in the online FAQ), the rules on integrating Clank! expansions (both old and new) are a bit brief and leave it up to the player to figure out what the best mix is.\n\n There's no announcement for a \"Clank! In! Space! Legacy\" yet... ;-)\n\nPainted the miniatures?: Yes. All done!\n\nSleeved\n\nAlso includes:\n- Clank!: Dire Wolf Promo Card\n- Clank!: Friendly Watcher Promo Card\n- Clank!: Siren Promo Card",
    "timestamp": 1759701600
  },
  {
    "username": "GrandPseudonym",
    "rating": 9.5,
    "comment": "~120 Minutes\nMediumweight\nCompetitive\nThematic\nAdventure\nCampaign/Legacy\nDeckbuilding",
    "timestamp": 1759356000
  },
  {
    "username": "OCDLancer",
    "rating": 10.0,
    "comment": "SO MANY AMAZING MEMORIES with this game! Took us 6 months and 11 4-hour games to finish it, and every time it was SO MUCH FUN! Best game for 3 people that I know of.",
    "timestamp": 1757196000
  },
  {
    "username": "Dziidzii",
    "rating": 10.0,
    "comment": "In our household, we love co-op and legacy games.\nThis hits the sweet spot. We play it, first to unlock story and then go full Clank mode. A lot of stickers- we really enjoy the modification part. But i can see that for others it could get in a way.",
    "timestamp": 1753308000
  }
]