[
  {
    "username": "wuwuw",
    "rating": 1.0,
    "comment": "skibidi",
    "timestamp": 1711062000
  },
  {
    "username": "JustAQuestion",
    "rating": 1.0,
    "comment": "The game is simply unintuitive. It's not the mess of a rule book which bores me but simply those things you can do which all look kind of generic.\nI didn't got any feeling while I played it besides boredom. Of course it is challenging arrenging things to get the most out of it but I want a theme not a game made for a calculator.\n\nFun is completely missing in this game. But if you like slender diet with a lot of worker placement and calculating things till you get nuts this could be your game.",
    "timestamp": 1605049200
  },
  {
    "username": "Peepser",
    "rating": 1.0,
    "comment": "I totally understand why Lacerda’s games cost $150. Each unnecessary mechanism costs $1 each.",
    "timestamp": 1599343200
  },
  {
    "username": "Repetardo",
    "rating": 1.0,
    "comment": "Gratuitous complexity to do very simple hings.",
    "timestamp": 1596924000
  },
  {
    "username": "Infernotez",
    "rating": 1.0,
    "comment": "I'd give it a 0 if I could, absolutely hate it. It takes the movement part I like from kanban(turn order) and ruins it plus adding the worst part of food chain magnate I hate(having to have an exact plan or you are screwed for the entire game). Other parts I hate is the turns take a long time(even with 2/4 veterans in the game), the game relies heavily on symbology while the symbols can actually be a lengthy explanation there where even having cheatsheets out still slows down the game too much.\n\nI don't find it that hard to learn, I just find it annoying and boring.",
    "timestamp": 1574204400
  },
  {
    "username": "Nomorepiratedgame",
    "rating": 1.0,
    "comment": "For working with Yoka, a company known for its plagiarism of Bang!",
    "timestamp": 1564092000
  },
  {
    "username": "sutrebuh",
    "rating": 2.0,
    "comment": "Compelled! The superb Kanban, which allows us to experience vehicle development in a playful way, compelled us to purchase another game by Vital Lacerda. The good reviews, which promise a complex gourmet game, compelled us to pick up On Mars. The extensive, cumbersome, and confusing rules compelled us to play a few times to make sure we were playing correctly. The few options for action in orbit and on Mars left us with few choices and, in combination with the situation in the game, compelled us to do what had to be done. Detailed rules compelled us to perform certain actions that triggered specific effects. Random elements in the form of bonus tiles, target cards, and card displays compelled us to pay attention to the few possible actions. Finally, the final scoring compelled one person to win who did not even know how they had achieved it.\nSome games use complexity to offer rich possibilities, perhaps even a wide variety of strategies that we can try out, but On Mars uses complexity to make it as difficult as possible for us to execute a move that is compelled by the circumstances anyway. There are no greatly differing strategies; the only difference is in the color of the tiles that we are then compelled to choose. It is a tedious game that remains tedious and does not open up any unexpected possibilities, as we are used to from some other complex games.",
    "timestamp": 1761778800
  },
  {
    "username": "MonikaTreik",
    "rating": 2.0,
    "comment": "Complexity for the sake of complexity. But I really liked the intention - would love to play a game version that is made more rationally.",
    "timestamp": 1754172000
  },
  {
    "username": "Mr Strange",
    "rating": 2.0,
    "comment": "It is funny how an over convoluted game with confusing rules and bad iconography can still get 8.2 on BGG. It shows that people are incapable of distinguishing between complexity of a game's strategic elements and the quality of its design.\n\nPeople think it is complex because it is difficult to learn. No, my friends, that simply means it is poorly designed. A game can have a lot of elements that work together making the game complex, but these elements should never be difficult to understand. It is the designers role to make things accessible to the players. This is what distinguish good designers from the bad.\n\nOn Mars is simply another example on how many poorly designed games are promoted to top on BGG because people thinks difficult to learn means a good game.",
    "timestamp": 1736809200
  },
  {
    "username": "sloehand",
    "rating": 2.0,
    "comment": "On Mars is a heavy game where players must unlock the puzzle of a multi-step procedure to get to a strategic decision. Now I like complex games but this one feels like assembling a piece of Ikea furniture. Can I follow the instructions and use an Allen key to build a book shelf. You betcha. Does that bring me any satisfaction or payoff? Nope. Instead, the instruction set and process of assembly gets in the way of the game, making On Mars seem way more complex than it really is. And most of the time, this procedure is not worth the payoff. I thought the on-world, off-world mechanic was smart. I liked the concept of collaborative building of a colony together and getting rewarded for your contributions to a common goal. But there are so many inorganic mechanics shoved into this design that seem tacked on. Take the rover/lander action for example. This could have been solved with two simple rules: 1) you may build next to or one away from an existing construct of yours; 2) upon returning to Mars, take a reward. Instead, I have to take the action which lets me move and possibly spend additional resources to get where I need to go. Thematically it works. Design wise, it gets in the way. Look, I am not a Vital Lacerda junkie. I really liked CO2 when it first came out but haven’t played it in a while. I enjoy Vinhos if someone else does the teach. But of his recent designs, everything has been a let down for me. I appreciate the feat. I really do. But his games are not for me. I would rather play the game, than figure out how to unlock tasks to play the game.",
    "timestamp": 1704927600
  },
  {
    "username": "ExplodingSnail",
    "rating": 2.0,
    "comment": "More work than a game and an utter chore to play. I’m sure it’s mechanics are clever but it is zero fun.",
    "timestamp": 1692396000
  },
  {
    "username": "Macky75",
    "rating": 2.0,
    "comment": "One of the hardest jobs on a table. Set up and rules already take hours. Gameplay feels like a job that I can't enjoy. Needs no more \"tests\"......",
    "timestamp": 1690754400
  },
  {
    "username": "f19971231",
    "rating": 3.0,
    "comment": "?",
    "timestamp": 1756159200
  },
  {
    "username": "clawp1995",
    "rating": 3.0,
    "comment": "3D Insert",
    "timestamp": 1755468000
  },
  {
    "username": "Scifi66",
    "rating": 3.0,
    "comment": "Haven't thought about this for a few years. Aside from the artwork and the \"shuttle mechanicism\" everything else felt like wading in treacle. I still think Lisboa or Kanban is Vital's best work.\nAnother Vital monster. The heaviest Lacerda game to date.\n+ Artwork is excellent\n+ Fantastic layout despite complexity the board is clear\nx Rules burden is high/brutal teach, it is not a once a year game\n- Crystals aren't thematic although maybe we will discover a new rock on Mars?\nx After 3 plays it feels like there are too many subsystems or it's a little too complex for my tastes or mechanisms don't reinforce the theme\n- Long, running up to 4 hours for 3p which is challenging my staying power. There was no improvement in run time in my plays to date.",
    "timestamp": 1752530400
  },
  {
    "username": "mawilson4",
    "rating": 3.0,
    "comment": "I could describe why some people enjoy this one. I just can't empathize with that appeal.\n\nSetup and teach could legitimately take an hour if you're being thorough and not trying to rush new players through the game's ideas. Even with longtime gamers, this was well over 30 minutes for us.\n\nThat also points to the game's fiddly rules density. I can acknowledge there's some strategic brain-burn hiding underneath it all, as well as depth, but I disagree that its mechanical opulence equates to more depth than many that get to the interesting stuff more quickly and without all the work.\n\nThis is also a game where some components' only function is to remind you of a mechanic. And various strategy articles recommend methods of remembering to do stuff...not methods do things well, just to do them at all. When a good strategy, worth repeating across multiple threads, is \"try to remember the rules,\" something is off.\n\nObviously this is shouting into the wind against a very popular game on BGG, and I wish its fans well. But I'd just as soon skip it and merely hang out and chat, or go home and return on a different game night with a game that's actually fun for me.",
    "timestamp": 1749679200
  },
  {
    "username": "Tristis",
    "rating": 3.4,
    "comment": "This game is stinking, and blooding from many wounds... Never ever play it! It is just sad, how many people convince themself with this bad, bad game.",
    "timestamp": 1746828000
  },
  {
    "username": "repear",
    "rating": 3.0,
    "comment": "3 - Likely won't play again, but could be convinced.\n\nThe only Lacerda game I've liked is Lisboa. This one isn't as hard to learn as you think, but it's just too much stuff.",
    "timestamp": 1736031600
  },
  {
    "username": "OurMrMajestyk",
    "rating": 4.0,
    "comment": "Really wanted to like this game more than I do. Feels like Lacerda’s loosest and most convoluted game, it’s the first game of his I’d call a point salad. The thematic ties to the actions seem very half-hazard and really don’t come together very well which makes the game harder to learn than it should be. The central gimmick of switching from orbit to planet side also feels underdeveloped to me while the building of the colony itself feels unnecessarily complex. Compared to the city building in Lisboa, which is cleaner and has more player interaction, it ends up falling flat. The more I’ve played the more it’s grown on me but I don’t think I’ll ever love it.",
    "timestamp": 1756245600
  },
  {
    "username": "Sneaky Petey",
    "rating": 4.0,
    "comment": "Way overwrought mechanism gumbo. The core of the game is interesting, but it feels like you’re doing work just for the sake of work. You could have facilitated the same game experience with half as many rules.",
    "timestamp": 1756245600
  },
  {
    "username": "K_oroviev",
    "rating": 4.0,
    "comment": "I’d say this is the definition of an inelegant design. an unnecessarily convoluted ruleset that results in just a very plain game.",
    "timestamp": 1745877600
  },
  {
    "username": "TKO81",
    "rating": 3.5,
    "comment": "Rating is based off of playing online, it was an overwhelming game to try to play online if I played this again in person my rating might change.",
    "timestamp": 1742943600
  },
  {
    "username": "CMagex",
    "rating": 4.0,
    "comment": "3\n\nI dont think this is worth it, but I do want to play again to see if this was just not great online",
    "timestamp": 1742338800
  },
  {
    "username": "Beastly_Venturer",
    "rating": 4.0,
    "comment": "Gave this one a few spins. Still feel like the more the designer creates the less interesting each design is. Vinhos, CO2 and Kanban are all really good. Then things tend to sink.",
    "timestamp": 1740265200
  },
  {
    "username": "quietcorn",
    "rating": 5.0,
    "comment": "This is a worker placement game where you have a pawn that during between rounds phases can move between the space action area and the mars action area, giving you different action options depending where you are. In space you collect resources and power up your abilities and on mars you walk your robots around the map making buildings and factories.\n\nThis is a very accessible game compared to some of the other games by Vital. It has a little bit of his hallmark complication, but it has none of the between turns or kicked out action qwirks. Overall entertaining, but even the minor elements of over-complication put this on the would-play-more list but not the must-play-more list.",
    "timestamp": 1762297200
  },
  {
    "username": "watoop",
    "rating": 5.0,
    "comment": "Shuttle mechanic is clever but building / upgrade rules are just overwrought (if you have A, then you need B, and don't forget C, D and E). Iconography is extremely confusing - I lost count of the number of times I got what I thought a 'scoring' card was telling me wrong. Tech and what benefits it allows at each level is also pretty opaque. A ton of jigsaw pieces that never made a coherent picture.",
    "timestamp": 1750716000
  },
  {
    "username": "Apos",
    "rating": 5.0,
    "comment": "A modern Lacerda game where the complexity of the rules outweighs the significance of the decisions you make. It feels more like an abstract puzzle packed with mechanisms and icons, but offers relatively little enjoyment in actual gameplay. It lacks the elegance and smooth flow found in his earlier titles, such as Vinhos or Kanban. Too long and little interaction for my taste too.",
    "timestamp": 1744495200
  },
  {
    "username": "Forgeforgeforge",
    "rating": 4.8,
    "comment": "The orbit-surface refresh tempo is super cool, up there with the the Empyreal conductor track in what a cool jerky syncopated action puzzle it is. Everything that actually happens on mars is boring.\n\nIt's pretty complicated, but it's not exactly tight in the same way Imperial Steam or Smokey valley is tight. Your plans are only ever loose, you have no real needs.\nObvious needs are some of the most interesting things in games. They constrain and differentiate the narrative arc of any one play of solo games, and they are the single biggest piece of information exchanged in an interactive game. When players have needs it can force negotiation in negotiation games. In shared-space/resources games it gives you a clear dotted line through future turns you know they'll trace so you can decide to wheel your ship away to plunder some other part of the game freely, or to steer into them and interfere.\n\nPlayers goals at any point in time are difficult to project forward, given all the machinery that stands between you and your next turn. It's not clear if a multiplayer game can be found underneath all this mechanical fog.\n\nAlso at the end of the day you're just grubbing for points?\n\nLike most lacerda it just does not vibe with me. The whole arc is just preparing your body for autofellatio.",
    "timestamp": 1742598000
  },
  {
    "username": "Fuzzcrumbler",
    "rating": 5.0,
    "comment": "Intentionally complex for complexity's sake. I like a few of his other designs, though, like CO2 far better.",
    "timestamp": 1742166000
  },
  {
    "username": "Javajoesworld",
    "rating": 5.0,
    "comment": "Rare Lacerda that I did not enjoy. Played it twice in a couple days to give it a shot as one does not always “get” a Lacerda at first. Simply did\nNot work for me.",
    "timestamp": 1735426800
  },
  {
    "username": "rws2029",
    "rating": 5.0,
    "comment": "• beautiful art and graphics\n• top-tier component quality\n• game mechanisms support the theme very well\n• the game boils down to a complex efficiency puzzle",
    "timestamp": 1734822000
  },
  {
    "username": "apuity",
    "rating": 5.0,
    "comment": "A light game dressed as a heavy game, a disappointing design decision. Instead of a game that maintains its complexity toward mid or late game or becomes progressively complex toward late game, the action space becomes narrower, which means certain actions are better in early game when every player would rush to claim the actions (while certain actions are locked out in early game). The decision space in solo is even narrower with poorly designed turn-order boni.",
    "timestamp": 1732748400
  },
  {
    "username": "ultimoratio",
    "rating": 5.0,
    "comment": "Potentially could be the best Lacerda. It has the inherent problem though of being a Lacerda where there's not much depth here to the effort you have to make that you're better off playing 18xx or a Splotter",
    "timestamp": 1726696800
  },
  {
    "username": "ramukaka",
    "rating": 5.0,
    "comment": "Not sure why I'm not making it a 6.",
    "timestamp": 1726264800
  },
  {
    "username": "Gamer_Dog",
    "rating": 5.0,
    "comment": "Inelegant and heavy. Rules overhead for this type of game is much higher than any game I've played and some of the graphic choices lead to confusion. The shuttle mechanic is an interesting twist on worker placement. If you are willing to invest the time needed for several plays, there's a crunchy game here with interesting decisions. I could see this rating go up, but not sure I'm willing to continue to invest time in it. Feels needlessly complex.",
    "timestamp": 1725746400
  },
  {
    "username": "invervegas",
    "rating": 5.0,
    "comment": "Complexity √",
    "timestamp": 1725141600
  },
  {
    "username": "Arah",
    "rating": 6.0,
    "comment": "A heavy euro with fun mechanisms at 3-4p.\n\nVisually stunning. Good mechanism of technology.\n\nFor solo mode, play with the Alien Invasion expansion, the base game bot is exploitable.",
    "timestamp": 1758578400
  },
  {
    "username": "Joel_L",
    "rating": 6.0,
    "comment": "A complex game but not too bad after one play-through. I enjoyed the shared Mars board and the choice of travelling between the Colony and Orbit. I'd have to play more to determine if it's something that holds my interest. But given how long each session is, I don't know when this will hit the table again.",
    "timestamp": 1757800800
  },
  {
    "username": "Killi",
    "rating": 6.0,
    "comment": "Thematic like all Lacerdas, but far from being my favorite from this designer.",
    "timestamp": 1756504800
  },
  {
    "username": "selvalabelva",
    "rating": 6.0,
    "comment": "Brainburn         Longevity    \nLuck impact       Rules/Setup  \nInteraction       Involvement  \n\nAftertaste           Enthusiasm   \n\n Played at 3+4 player count\n Rated base game w/o additional modules\n Reccommended solo with Alien Invasion\n Replayability improved with Alien Invasion exp.\n Confrontation: indirect\n\n Efficiency puzzle-like design\n\n Exceptional production quality",
    "timestamp": 1751320800
  },
  {
    "username": "Ryanelrichie",
    "rating": 6.0,
    "comment": "Just over the line of heavy and fiddly. Iconography is fine but isn't the most clear. All the rules of what you can place and where and when and how you can boost, never feels smooth. The tech is a neat idea but what the tech actually means for the player is confusing. The shuttle phase stutters the game. There's probably a great game in there for someone that wants to play many times in a short period, but the juice is not worth the squeeze on this one. Rulebook is decent but leaves many questions. Art is unique, but doesn't make the board or cards easier to decipher.",
    "timestamp": 1746568800
  },
  {
    "username": "lyndathompson1",
    "rating": 6.0,
    "comment": "Only played this once so far... need to play more! This is really heavy... not sure if I like it yet or not...",
    "timestamp": 1742425200
  },
  {
    "username": "winolopez",
    "rating": 6.0,
    "comment": "Rating went down from 9 to 6 just because after playing it for about seven times, I felt I've had my fill with this game and no longer feel compelled to play it again.",
    "timestamp": 1741388400
  },
  {
    "username": "TheKilljoy",
    "rating": 6.0,
    "comment": "I'm torn - it's very well designed, great production values, but I feel like it's heavy for the sake of being heavy. I have fun when I play it but it kind of leaves me unfulfilled.",
    "timestamp": 1740178800
  },
  {
    "username": "PotatoKing_",
    "rating": 6.0,
    "comment": "비딸의 인간찬가: 시작은 미력하나 끝은 창대하리라",
    "timestamp": 1739746800
  },
  {
    "username": "krit1789",
    "rating": 6.2,
    "comment": "Vital Lacerda's take on Terraforming Mars. Quite complicated on first look.",
    "timestamp": 1734476400
  },
  {
    "username": "Upuaut78",
    "rating": 5.5,
    "comment": "Betygsätt",
    "timestamp": 1729980000
  },
  {
    "username": "jpborquez",
    "rating": 6.0,
    "comment": "Beaucoup de possibilités. Mais, des tours très long à analyser et à s'assurer qu'on oublienrien. Il manque un ou plusieurs aides de jeux qui nous aide vraiment à ne rien oublier. Il y a trop de règles non intuitives faciles à oublier qui ne figurent pas nul part. Par exemple, la limite de navette selon le niveau LSS. Ça aurait été facile de faire un dessein quelque part pour s'en rappeler. À 4 joueurs, ça prends vraiment des joueurs efficace mais même là, il y a des longueurs car ce que l'on prévoit faire est souvent bloqué par d'autres actions. Plusieurs ont dit que c'esr un jeu qui récompense la flexibilite et l'opportunisme et je suis d'accords. Certaines personnes sur le forums et sur des chaines Youtube on fait de beaux aides de jeux maison. Ce qui me porte à croire que nous ne sommes pas les seules à trouver qu'il manque d'aide de jeux. Il est cependant très beau et thèmatique. C'est un beau cassage de tête. L'interaction entre joueur est moyenne. Ça se résume a utiliser une technologie ou à se faire bloquer. Je ne suis pas certain que j'aime le fait que les missions déclenche le partie. Le niveau en soit du LSS aurait été suffisant. Je pense qu'il y a beaucoup de façon de créer des stratégies différentes selon la partie donc beaucoup de rejouabilité. Content de l'avoir mais je ne sais pas s'il va sortir souvent...",
    "timestamp": 1728165600
  },
  {
    "username": "Qhorin",
    "rating": 7.0,
    "comment": "Amazing level of strategy. Brain burning and long. Tough to get to table.",
    "timestamp": 1762587120
  },
  {
    "username": "BitsOWood",
    "rating": 7.0,
    "comment": "It didn't sing to me the way some other Lacerdas do.",
    "timestamp": 1762383600
  },
  {
    "username": "fizboz",
    "rating": 7.1,
    "comment": "the lacerda'st lacerda game. its very thematic, but the rules are very difficult to grasp. every time we played we had to learn the rules again. you need to play this game with a rules police - only then you'll make sure you do everything correctly",
    "timestamp": 1761692400
  },
  {
    "username": "cinnzel",
    "rating": 7.0,
    "comment": "Me dio la sensación de que en partidas de más de dos jugadores le falta dinamismo y sensación de desarrollo. Como en otros diseños de este autor, hay acciones que me parecen demasiado débiles mientras otras son cruciales. Sin haberlo probado, tiene muy buena pinta para jugar en solitario.",
    "timestamp": 1761692400
  },
  {
    "username": "Impiousbe",
    "rating": 7.0,
    "comment": "I Generally feel like this game is a bit too tight. I don't mind tight games but this one really feels to me like it is prohibitive. As a player you are constantly managing constraints. You lack a certain resource, you don't have enough available storage space, you have just one action per turn.. etc etc.\n\nThe start of the game is quite constricted and limited and early on you will often find that executing whatever plan you have isn't going to be straightforward and you often require several turns and actions to achieve any set goals. You generally get the feeling that you find yourself doing what you can do and making the best of that rather than devising a clear strategy and executing. Executing a strategy requires a lot of build up in general and you will often find yourself running through your constraints. You would like to build but require the resource. The resource isn't available in the warehouse so you need to either build a certain other building to get it or maybe claim an iss bonus mineral. Unfortunately now you realize that you don't have the resource required to gain said bonus or build said building but it can be found in the warehouse so you can use an executive action. If only you had the crystals for that action. Ok you can build a house to get a crystal and grab the resource you need. Great now next turn you can build the building to get the resource to actually build what you are aiming to. Next turn you want to build but because there are meeples on the action it costs more crystals. if you have the crystals you forgot that you lack the workers to do the action. You gain workers and next turn the spot you wanted to build is now taken. etc etc.\n\nThe game is too tight. It isn't too tight to handle, in fact I have generally played the game quite well, but it is too tight to be very fun. The complexity budget is used in a negative way. 90% of the thinking is put in to working around the many limitations that you need to manage rather than in to building something positive like an engine. Getting up and running is just about when you can start to act more freely without hitting walls constantly. Unfortunately by the time you get there the game is just about over. You spend most of the game crawling out of a hole and just when you feel like you start to scale up the game ends. You spend the game building something but hardly get to expolit what you built. To make it worse most of the points you will earn don't come from the engine but from technologies and awards. The game end never really feels great. The game manages to feel too long and end too quickly at the same time. In most of our games the winner never actually really felt like the player that managed to achieve the thematic goal of the game. Thematic integration is a huge staple for VL games but in this one I feel the disconnect in the scoring even if it is embedded expertly in to the mechanics.\n\nI think I can sum up this game as follows: Lacerda was too concerned with how complex a game he could make but never stopped to consider where he should make it that complex. It is a genius bit of game design and I am in awe of how intricate the game is and how thematic the gameplay elements are. Objectively this is a masterpiece but in 4 plays it was never actually fun for everyone at the table. It tends to frustrate at least one player every single time. Fantastic design but not actually very fun. Psychologically I think good play isn't properly rewarded and bad play is severely punished. This game would be a lot better if it was just a bit less tight and gave players some wiggle room. Tight games tend to confine players in to certain strategems or actions and reduce creative freedom.\n\nExcellent design that feels like work.",
    "timestamp": 1761256800
  },
  {
    "username": "Jabbergeist",
    "rating": 6.5,
    "comment": "After playing several other really unenjoyable Lacerdas, I'm a lot more impressed with this one in retrospect.",
    "timestamp": 1761084000
  },
  {
    "username": "screwy81",
    "rating": 8.0,
    "comment": "Nominee\nGame of the Year 2021",
    "timestamp": 1761951600
  },
  {
    "username": "jkbamboom",
    "rating": 8.1,
    "comment": "For Sale\n\nAt Rams place",
    "timestamp": 1760306400
  },
  {
    "username": "leleyx",
    "rating": 7.9,
    "comment": "My very first Lacerda, I've been looking into his games for a while, after my friend got it we played a couple of times together, I bought a copy myself (for a fair price) to play solo, it was missing the solo cards, so I have proxied them.\n\nVery crunchy, lots of different avenues of play available, the stratey threshold is huge, and my strategic mind is tiny, so victory is unlikely, but enjoyement seems guaranteed.\n\nMULTIPLAYER\nWEIGHT | CRITERIA                | RANGE                          | RATING\n    15 | ENJOYMENT                | (Forgettable to Outstanding)   | \n    12 | MECHANICS                | (Boring to Interesting)        | \n    12 | PLAYER COUNT PERFORMANCE | (Not Balanced to Balanced)     | \n    12 | PLAYER INTERACTION       | (Low to High)                  | \n    09 | CLARITY OF RULES         | (Mud to Crystal)               | \n    09 | DEPTH                    | (Lacking to Meaty)             | \n    09 | REPLAYABILITY            | (Nil to Limitless)             | \n    07 | GAME LENGTH              | (Too Short/Long to Just Right) | \n    07 | LUCK FACTOR              | (All Luck to All Skill)        | \n    04 | ART                      | (Potato to Picaso)             | \n    04 | COMPONENT QUALITY        | (Cheap to World Class)         |",
    "timestamp": 1759788000
  },
  {
    "username": "DoubleTSC",
    "rating": 8.0,
    "comment": "1 play (4 players). Got hooked, but friend sold it.",
    "timestamp": 1759615200
  },
  {
    "username": "ReploidArmada",
    "rating": 8.0,
    "comment": "I love the mechanics and feel of the game, I wish I could play it somewhat okay. I've played it twice at four and took last both times, but that's okay.",
    "timestamp": 1759010400
  },
  {
    "username": "kirillsulim",
    "rating": 8.0,
    "comment": "Was slightly disappointed. Expected much more",
    "timestamp": 1758837600
  },
  {
    "username": "Drrabbits",
    "rating": 8.5,
    "comment": "Crushingly complex. Absolutely beautiful components & board. And one of the most touching gifts I've ever received. Glorious.",
    "timestamp": 1762124400
  },
  {
    "username": "BubbleheadAmber",
    "rating": 8.5,
    "comment": "PROS:\n- Complex but very interesting puzzle\n- The rocket mechanic forces you to commit whether going to the other side is important, especially when considering that other players staying are taking more actions to reduce the limited actions on the board\n- Lots of tension as people will very quickly take resources/techs/blueprints off the board before you can get it, and you're dealing with very little resources at times\n- The turn order mechanic borrows the awesome mechanic of Viticulture, where there are benefits to going last\n- Scientists add a lot of combo potential. and being able to use someone else's scientist adds a lot of immediacy and tactical consideration\n- Not completing buildings and getting minus points adds a lot of tension to the already limited spaces on the board\n- Tech powers add a neat element of tableau and power building\n- Crystals and rockets adds a lot of combo making potential\n- Lots of feel-good moments as you connect same-type buildings together, matching the techs to a pattern and completing objectives\n- Lost of player interaction as you can use other people's techs, blueprints and racing for tokens on the board\n- Tons of replayability due to the variable end-game triggers, techs that show on the board, objectives etc\n\nCONS:\n- Very complex and needs at least 2-3 games to get the hang of it\n- Very Euro-like interactions, nothing that makes you go \"what did you do?!\"\n- Theme gets drowned by combos and puzzle solving\n\nFINAL THOUGHTS:\nWhen a Lacerda game gets it right, it is really good! Happy to play a friend's copy but probs won't own it myself. Very fun to play repeatedly and get really good at it",
    "timestamp": 1761951600
  },
  {
    "username": "yroeht",
    "rating": 9.0,
    "comment": "A sandbox where you get to choose your path: progress LSS, get advanced buildings, scientists, technologies... which will you do first? They're all good. And you probably want them all done.\n\nThis game has some spatial puzzle elements, with the construction rules and the tech research.\n\nAmazing production quality, the printed meeples are delightful and the art, especially on blueprint cards, is exquisite. Not to mention the cover.\n\nIt's excellent, solo is demanding both in upkeep and strategy.",
    "timestamp": 1761865200
  },
  {
    "username": "Zephyr_Falcon",
    "rating": 9.0,
    "comment": "9",
    "timestamp": 1760652000
  },
  {
    "username": "Kroomiester",
    "rating": 9.0,
    "comment": "On Mars is likely Lacerda’s most interactive game.\nAlmost every action creates an opportunity for someone else. This may be my favourite Lacerda game, but recency bias might be influencing that statement.",
    "timestamp": 1760047200
  },
  {
    "username": "pezpimp",
    "rating": 9.0,
    "comment": "This is quite a heavy game, even compared to Lacerda's other heavy games. There are many intricacies to each action. Now with many plays under my belt, I can say that I love it. You can take so many different avenues and each game is so different. Be sure to read the rules yourself, as once I did it changed everything as it is a very heavy game with a lot of connections between actions and not knowing the details well can be frustrating while playing. So, I am glad that I re-read the rules for this set of plays, and I just loved it. For example, the winner of one game had incredible combos on their last two turns that let them do multiple actions in one shot, comboing it all together, very cool to see and if you know the rules well, this is doable. This may be my new favorite game by Vital Lacerda.",
    "timestamp": 1759701600
  },
  {
    "username": "RaiPL",
    "rating": 10.0,
    "comment": "Wonderful, huge, heavy Vital Lacerdas game.",
    "timestamp": 1761778800
  },
  {
    "username": "Cookie316",
    "rating": 9.5,
    "comment": "Exceptionally fantastic game. Only downside is the 50-minute teach and the fact that it takes at least two full playthroughs before you understand all the rules.",
    "timestamp": 1760824800
  },
  {
    "username": "gpli_11",
    "rating": 10.0,
    "comment": "Excellent heavy game as you don the role of the Chief Astronaut of your company to colonise the red planet.\n\nThis is arguably the heaviest design but it was very intuitive to grasp and play.\n\nMy favourite mechanism is catching the space uber to travel between the Colony and the Orbit Space Station to access different actions. Timing is key.",
    "timestamp": 1759442400
  },
  {
    "username": "tobimx",
    "rating": 9.5,
    "comment": "On Mars is a masterpiece where theme and mechanics entwine seamlessly, making even the complex feel tangible. The optics are stunning, the simulation impressively immersive, and every detail bears the mark of Lacerda’s and Ian’s genius.\n\nThe solo management is a demanding task, a meticulous dance of planning and logistics, but it rewards patience with a profound sense of accomplishment. On Mars, every action feels weighty, every decision meaningful—a cerebral journey to the Red Planet that never ceases to captivate.",
    "timestamp": 1757455200
  },
  {
    "username": "bellynice",
    "rating": 9.6,
    "comment": "Top fave Lacerda, I'd say.",
    "timestamp": 1756072800
  },
  {
    "username": "AbyssinianSon",
    "rating": 10.0,
    "comment": "I can not comprehend how someone designed this game. It is so intricate, complex and yet thematically easier to teach and comprehend then many lighter games. It's not an easy game to keep all the rules in line but it is well worth the effort and thought the game demands.",
    "timestamp": 1755900000
  }
]