[
  {
    "username": "Noboe",
    "rating": 1.0,
    "comment": "Bad customer service from FF.\n\nWhen this game is going to be put on the table? It has been already 3 years since I bought it and no one wants to play something that long.",
    "timestamp": 1761865200
  },
  {
    "username": "ZZBrent",
    "rating": 1.0,
    "comment": "Symmetric Munchkin meets Risk in space!\n\nLet me start by saying this is not a bad game, but rather it is just not my type of game. I enjoy the concept presented here but it really did have too much in common with Munchkin (open trading leads to a lot of kingmaking, especially with the ability to give straight up victory points, and the ability to lock people down from earning public objectives can really shut them down altogether) and Risk (build armies and take territories, which determine your income which give you actions/ships to go take more territories).\n\nThere was also a lot of downtime between turns which led to not only me getting impatient, but also me constantly forgetting and missing triggers (or planet activations) that happened on my turn (and there are dozens).\n\nI highly recommend anyone given the opportunity to try this to take it, as it is a great way to see if this is a game for you before buying it. But I recommend trying your first game with four to limit the time investment you have to make into it.\n\nBecause, to be clear, this is a great game. But it is certainly not for everyone. I know people I would recommend this to and people I would not. I would be willing to try it one more time with 4 players to see if the experience is different. But for me, this is one I would be okay with never playing again. It was fun but, with the competition of games demanding attention, fun is more of requirement for a good game than a feature of it.",
    "timestamp": 1760479200
  },
  {
    "username": "joostnauw",
    "rating": 1.0,
    "comment": "Played it twice. Way too convoluted everywhere else in the game but way too basic and dull in the combat. Also takes way too long to play. Just not a good game overall.",
    "timestamp": 1758405600
  },
  {
    "username": "Scifi66",
    "rating": 1.0,
    "comment": "A coffin box with a maximalist kitchen sink of mechanisms and staggering bling devolves into a game of absurd length (8+ hours). A hybrid Euro VPs+Troops on a Map with big dollops of randomness. Too few decisions for the length is the main issue but side servings of randomness, gotcha event cards and king making combine for an unappealing design. It's not for me.\n+ A space game with everything\n+ Multiple ways to score, its up to you to figure out how to do it (tactical)\n– The opacity of the decision space leads to players making sub-optimal moves\n– Sheer number of sub rules systems is mind boggling\n– Rough teach and first game for noobs\n– Low decision density given the length. I've played 1 hour games with a greater quantity and quality of decisions than TI\n– Some horrid random take that elements that could (will) screw you, make your peace with this or don't play",
    "timestamp": 1750716000
  },
  {
    "username": "Isshiresshi",
    "rating": 1.0,
    "comment": "I really want to love this game, but most times it just falls flat and frustrating just before the finish line.\n\nI did start writing a long list of things that I have a problem with, but its a list of most game mechanicsm and rules.\n\nI have played this five times, and the first time was great (four player game where none of us had tried it before). In the second game it all started to go down hill fast, when we started understanding the game and rules better.\n\nI really do believe, that Twillight Imperium could be a better board game, a great game, if it got a second game, rather than a new edition. A second edition I can understand and support, smoothing out rough edges and add things that was left out or needed more time in the oven so to speak, but a third and fourth revamp feels like an unfocused mess.",
    "timestamp": 1746396000
  },
  {
    "username": "Time_for_a_Miller",
    "rating": 1.0,
    "comment": "I really like the 6 other people I played with. It was a great Saturday, but I think I'd have rather played almost any other games with them. The game is just far to long with way to much downtime and not nearly enough impactful decisions. We routinely play games for 14+ hours so length isn't necessarily the problem. There is also some real king maker issues with the game.\n\nStill, I will read all the lore cause they have built a sweet world with flavorful faction mechanics.\n\nI'm surprised this game is rated so highly. I think it likely has some buyer's confirmation bias, but what most of us have spent is time. It sucks to think I just spent 14 hours playing a \"2\" game, but being honest with myself I'd prefer not to play again. Next time it goes to the table I think I'll show up, read everyone's factions, hang out until lunch and head home. That seems much more fun than playing to me.",
    "timestamp": 1742598000
  },
  {
    "username": "properplay",
    "rating": 1.0,
    "comment": "Edit: Tried to play this online async and the experience was equally bad. Didn't get one single public or secret objective that fit my faction's playstyle or slice. My action cards were also pretty useless. One of the players completely dominated the game and we absolutely couldn't do anything about it. (Actually some of the players even made deals with the player in the lead in order to try to snatch second place). Absolutely terrible game.\n\nI may give this another shot but I felt it was way too luck based to warrant one full day to play. Was expecting a much more strategic game.",
    "timestamp": 1742338800
  },
  {
    "username": "Throwaway341",
    "rating": 1.0,
    "comment": "fighter spam",
    "timestamp": 1738882800
  },
  {
    "username": "FilthyTroll",
    "rating": 1.0,
    "comment": "Too big and too long. Shouldn't be this high up on rankings by any stretch.",
    "timestamp": 1738278000
  },
  {
    "username": "mikemcdasl",
    "rating": 1.0,
    "comment": "Ah, Twilight Imperium, the \"crown jewel\" of board gaming that doubles as a sleep study for those brave—or foolish—enough to play it. If you’ve ever thought, “What if we turned an entire week of galactic Senate meetings into a board game?” then congratulations, you’re the exact target audience for this interstellar time sink.\n\nLet’s talk about setup: Twilight Imperium doesn’t just ask for your time; it demands your soul. Before you even start playing, you’ll spend an hour assembling a map that looks like it was designed by a toddler with a space obsession and no sense of balance. And good luck explaining the rules to new players, because nothing screams \"welcome to the game\" like a three-hour TED Talk on trade agreements and wormhole navigation.\n\nThe gameplay? Oh, it’s so simple—if you’re a 4D chess-playing android with a spreadsheet for a brain. You’ll juggle a baffling array of systems, from combat to politics to economics, all while trying to figure out why your neighbor is hoarding trade goods like they’re prepping for an intergalactic apocalypse. And don’t even get me started on the infamous negotiation phase, where you’ll watch grown adults argue about space treaties like they’re auditioning for Star Wars: The Bureaucracy Edition.\n\nOf course, this all culminates in battles that should feel epic but mostly boil down to rolling a fistful of dice and praying the RNG gods take pity on you. Want to conquer your rival’s planets? Too bad—hope you enjoy staring at your plastic fleet while everyone else debates a Senate resolution about universal healthcare for space turtles.\n\nBut the true horror of Twilight Imperium is its runtime. A single game can stretch anywhere from 8 to 12 hours, which is roughly the time it takes to binge-watch an entire season of The Expanse—and trust me, The Expanse is way more fun. By hour six, you’ll question not just your decision to play, but your very existence. Who are you? What is life? Why does winning the galactic throne require sacrificing an entire day?\n\nThe cherry on top? The ending. After all those hours, the game often concludes with someone sneakily achieving an obscure objective while the rest of the table stares in stunned silence. No fanfare, no applause—just a collective groan as everyone realizes they wasted their Saturday on glorified space Sudoku.\n\nSo, if you’re looking for a game that devours your free time, tests your friendships, and leaves you emotionally drained, Twilight Imperium has got you covered. Everyone else? Maybe stick to Catan and enjoy finishing a game before you hit retirement age.",
    "timestamp": 1737154800
  },
  {
    "username": "Dragonmaster256",
    "rating": 1.0,
    "comment": "Likely a 4, but the amount of 10s baffles me so I rated it a 1. Notice how a majority of the reviewers never include this in their top 100s. Well there's a reason for that. Out of the 500+ games I played this feels belongs at the bottom. Honestly, one of the worst designed games I've played. To start I enjoy long games when they are fun, but the playtime was severely inflated (over 14 hours with the PoK expansion in a 5 player game), with a worse than lackluster experience. It combines the randomness of dice with unrestricted negotiation, encouraging the worst game mechanics of all time - Kingmaking and player elimination. To be clear player eliminatiom didn't happen in our game, but the fact the game is designed to promote it in a day long experience is awful. Luck based games can certainly be fun and I do enjoy them, but if I could play about 12 of them in the timespan I could have played this once, I would have recieved significantly enjoyment out of it.\n\nThe theme of the game (space battles) also doesn't match the mechanics (random goal draws and a point race?). This game is more about initial exploration and squatting in your space sectors, more than an immersed epic battle. There is no/limited catch up mechanic to prevent unlucky rolls nor kingmaking to allow for a more holistic and enjoyable group experience. Sure one person might be happy about the whole experience, but the rest of the group feels like they just wasted half of their weekend. My sentiments on the game match 4 out of the 5 people that played it in pur session. The personality of the other is more geared towards lore, which I'll admit that is the one thing this game has going it, but I personally enjoy mechanical sound games more.\n\nAlso I enjoy heavy games, this is not that by any means. This game is an over abundance of rules with little substance. Many that don't really matter when comes down to a bunch of uninteresting dice rolls that everyone is eagerly waiting to be done. I get the feeling that this game makes people they are playing a big complex game, but in actualuality the fuzzy logic and probability predictions have little to do with the end result. The luck mitigation mostly comes from lucky card draws. More than half of the cards benefits are polictal effects, which is unless considering our uninteresting our political phases were. So there was no real luck mitigation designed into a game of chance. The strategy is severely lacking and comes down negotiability, chance, alliance symbiosis, and player aggression.\n\nThis game doesn't deserve to be in the top 100 let alone the top ten, in my opinion. However the great thing about society is just one person's opinion doesn't matter and the diversity of interests and passion is what makes our gaming community so expansive and beautiful. So for me I hated TI4, but I can completely understand why some people love it. I normally wouldn't take the time to write such a long and scathering review, but I feel like they were too many deceptive reviews, for people with interests like mine, and I wanted to give my hot take.",
    "timestamp": 1736895600
  },
  {
    "username": "Bauldric",
    "rating": 1.0,
    "comment": "Lucky game",
    "timestamp": 1736636400
  },
  {
    "username": "parpari",
    "rating": 1.0,
    "comment": "Terrible, horrendously bad. This is very long, random with unbalance factions. This game is good candidate to be even worst than Diplomacy because at least Diplomacy is deterministic game.",
    "timestamp": 1734476400
  },
  {
    "username": "paladininja",
    "rating": 1.0,
    "comment": "I'm sure if you wanna spend the whole night playing a single game,this is ok,but for me,just no no no.",
    "timestamp": 1732489200
  },
  {
    "username": "icheyne",
    "rating": 1.0,
    "comment": "Far too long. You can be effectively eliminated early and then you have to sit around for hours.",
    "timestamp": 1730588400
  },
  {
    "username": "Bodo",
    "rating": 1.0,
    "comment": "I do not mind long and complex. Back in the day , I played Fire In The East one - on - one. But that was fun. This is just long and complex , without the fun. On our fourth play , we were still spending most of our time looking up and studying rules; that provided nothing but speed bumps .",
    "timestamp": 1729634400
  },
  {
    "username": "ratbulogg",
    "rating": 1.0,
    "comment": "Did they solve the turtling problem only to replace it with something worse? Spend 10 hours to find out the answer!",
    "timestamp": 1727992800
  },
  {
    "username": "Monstars23",
    "rating": 1.0,
    "comment": "Way to long not at all worth it",
    "timestamp": 1720130400
  },
  {
    "username": "T4q3r",
    "rating": 1.0,
    "comment": "Trop... trop lourd, trop long, trop de micro règles qui parasitent le plaisir du jeu. Les règles ne sont pas si complexes mais tout les micros règles sont illisibles et peuvent te retourner la partie. Après 8h de jeux à 6... De loin la plus grosse déception et la sensation d'avoir perdu du temps pour peu de fun.",
    "timestamp": 1717192800
  },
  {
    "username": "GhostInside",
    "rating": 1.0,
    "comment": "I SOOO wanted to like this game, I was a TI fanboi before I ever even started because I was so sure I would love it!\nBut this takes the cake for biggest disappointment ever.\nSO much d*#m randomness... one person can randomly pull a massive bonus on the very first move and they will be untouchable the whole game. Meanwhile other people can play flawlessly and just get garbage luck for 10 hours. Who wants to do that? I sure don't.\n\nSOOO much complexity about stupid little things that end up not mattering 90% of the time.\n\nThe scoring system is ridiculous. Many of the strategy cards are fine, but a few (like #8) are just stupid and bad design.\nI really can't understand how this game got so popular, but so did Zombiecide... so maybe I should just stop playing board games.",
    "timestamp": 1705186800
  },
  {
    "username": "mikehancoski",
    "rating": 1.0,
    "comment": "if you like this game your an idiot",
    "timestamp": 1699311600
  },
  {
    "username": "Nizzamko",
    "rating": 1.0,
    "comment": "Too much meta game dependent.\nAnd not 4X, not deserves spent time.",
    "timestamp": 1673564400
  },
  {
    "username": "TerraNigma",
    "rating": 1.0,
    "comment": "This game literally gave me Covid.\n\nWhen I started playing this game, I expected a grand opera and all I got was a backyard poetry slam. I knew something was off when I executed the first movement. It felt wonky, boring, lumbering. And there he is, Corey Konieczka and his stupid Starcraft move set.\n\nThe game didn't get any better. It is heavily reliant on the gaming group, very luck driven, swingy and the end, with 40% of all the effort needed to win secured in one last round, feels so unbelievably dreary.\n\nWay too long for what it is.",
    "timestamp": 1660082400
  },
  {
    "username": "iBud",
    "rating": 1.0,
    "comment": "Boring, way too long and way too random",
    "timestamp": 1650405600
  },
  {
    "username": "matrium0",
    "rating": 1.0,
    "comment": "*edit after some thought I decided to make this the one game I give a single star. That seems overly harsh, but it IS the one game I really never want to play again. Any other game you could probably convince me to (even when I don't like that). But nothing could convince me to another 10 hour headache ending with (almost) random outcome.",
    "timestamp": 1650146400
  },
  {
    "username": "Mistermelo",
    "rating": 1.0,
    "comment": "Boring as hell. A mastodontic space \"Risk\" with lot of dice rolls and unbalanced factions.",
    "timestamp": 1628114400
  },
  {
    "username": "roman217",
    "rating": 1.0,
    "comment": "Not for me.",
    "timestamp": 1626991200
  },
  {
    "username": "GaiaHero",
    "rating": 1.0,
    "comment": "Too long obviously",
    "timestamp": 1624744800
  },
  {
    "username": "Esbont",
    "rating": 1.0,
    "comment": "The game took 12 hours and the winner was decided by who got the most Support for the Throne cards (free victory points). Very little in the space battles most of the game is long discussions on letting each other take turns invading each other's planets.",
    "timestamp": 1573340400
  },
  {
    "username": "xyoxyo",
    "rating": 1.0,
    "comment": "There are too many abilities and technologies to track for both yours and opponent's which make you lost because you cannot track all of them between the game (Each players has 3 abilities and 5-10 technologies and then 5-7 action cards. OMG!!!).\n\nEven with those ton of abilities and technologies, what you need to do in this game is trying to control nearest stars from your home base as many as possible and then build up your troops. Then sit there and vote twice a round. That's it.\n\nI dunno why this game is rated so high. But as for me, this game is just another too much unnecessary mechanisms game. Fake depth. Too long playing time make me feel so boring.\n\nAnother problems found in this game\n- VERY VERY VERY much downtime because of too many texts, too many abilities and technologies to track and all of them in very long text format.\n- Runaway Leader, Knowing who's the winner since the first hour but still need to be there for the next 7 hours. So dull\n- Luck driven in the most stupid battle mechanism I ever played. D10 Dice!! What the hell is this??!! Roll the dice again and again and again and again and .... ZZZZzzzzzz\n- Unbalance faction.\n\nTrash game. The only good thing in this game is quality of the minis.",
    "timestamp": 1564178400
  },
  {
    "username": "Unlumerkel",
    "rating": 1.1,
    "comment": "And the award for the most hyped game ever goes to...",
    "timestamp": 1562796000
  },
  {
    "username": "bobyams",
    "rating": 1.0,
    "comment": "Just as long, boring and pointless as the third edition. Total garbage.",
    "timestamp": 1562277600
  },
  {
    "username": "fremont",
    "rating": 1.1,
    "comment": "the hype is strong with this one",
    "timestamp": 1561413600
  },
  {
    "username": "Rostanovski55",
    "rating": 1.1,
    "comment": "4 plays: fiddly and sluggish, OP factions, luck driven combat, low variety in the setup, unacceptability long play time.\n\nOwners chill out with type, you are getting boring.",
    "timestamp": 1558389600
  },
  {
    "username": "Freedriver",
    "rating": 1.1,
    "comment": "This game has some big problems with balance within the factions; I played with the faction Muat, and ended convincigly last. At the end we were all crushed by the Jol-Nar. Others were not even close. Something isn’t tweaked right here,who playtested this game? Not to mention luck with rollling those dices in the combat! Bad and lame design! Unacceptable for 6-8hour game!!! Never again. If you enjoy luck and unbalanced game (factions), look no further.",
    "timestamp": 1558044000
  },
  {
    "username": "Vitolono",
    "rating": 1.1,
    "comment": "Luck, unbalanced factions, fidly, lots of mini rules, runaway leader problem...\nThe theme is strong, but I do not care for the theme if the gameplay is bad.",
    "timestamp": 1557784800
  },
  {
    "username": "Repugnant Gamer",
    "rating": 1.0,
    "comment": "Stupidly complicated \"Risk\" in space. No thank you. Alternate title for this could easily be \"Game Setup: the Game\". No game should ever force you to dedicate an entire day to playing it, but this game manages to do just that. 2 hours of said day must be set aside for setup and breakdown. How ridiculous!",
    "timestamp": 1531087200
  },
  {
    "username": "dlestarge",
    "rating": 2.0,
    "comment": "3 hours in I had built two ships, moved to a new planet, and had 1 point. I see what people like about this, but the time investment is makes it a crazy slow slog to get to the good parts near the end.",
    "timestamp": 1760047200
  },
  {
    "username": "so_not",
    "rating": 2.0,
    "comment": "I can play three cube drafts or a 7 round + top 8 Magic the Gathering -tournament in same time as this abomination takes.",
    "timestamp": 1759096800
  },
  {
    "username": "ozsoffy",
    "rating": 2.0,
    "comment": "I played Twilight Imperium: Fourth Edition once, after previously trying the third edition, and while the theme is rich and the universe-building impressive, the game just isn’t for me. We played with six players, and it took around 11 hours—far too long for my taste.\n\nThe gameplay is deep and full of strategy, but it felt overwhelmingly complicated at times. There was constant attacking and conflict, which added stress rather than fun for me, and I even ended up with a headache during the session.\n\nI can see why others enjoy it—it’s a grand space opera with lots of political and military intrigue—but personally, the length, complexity, and aggression made it an exhausting experience rather than an enjoyable one. Not my cup of tea.",
    "timestamp": 1752098400
  },
  {
    "username": "Wabbiteer",
    "rating": 2.0,
    "comment": "Too Slow and there are a lot of improved games at this time that do better.",
    "timestamp": 1744668000
  },
  {
    "username": "Jaysaurus",
    "rating": 2.0,
    "comment": "A game that you can lose when you set up the galaxy. And 8 hours with experienced players. Give it a miss.",
    "timestamp": 1734562800
  },
  {
    "username": "scryptx",
    "rating": 2.0,
    "comment": "Game is waaay too long for what it offers. Tech tree is more of a tech path as everyone always takes the same upgrades. Classes are imbalanced. Complexity is shallow and mostly contained in arbitrary game mechanics such as class abilities, flagship abilities or action cards.",
    "timestamp": 1727560800
  },
  {
    "username": "Antonyus",
    "rating": 2.0,
    "comment": "too long and tiresom",
    "timestamp": 1714082400
  },
  {
    "username": "TimNT",
    "rating": 2.0,
    "comment": "führt zu Hass und Blut",
    "timestamp": 1713477600
  },
  {
    "username": "Rinkuli",
    "rating": 2.0,
    "comment": "Hated it",
    "timestamp": 1686693600
  },
  {
    "username": "YouWontBeBoardGames",
    "rating": 2.0,
    "comment": "Terribly long and tedious game riddled with output randomness.",
    "timestamp": 1674342000
  },
  {
    "username": "lovelace",
    "rating": 2.0,
    "comment": "Very glad to have played it once. I totally see why this is a grail game for so many, but absolute not for me.",
    "timestamp": 1671577200
  },
  {
    "username": "Double Dan",
    "rating": 2.0,
    "comment": "TI is TI no matter edition.",
    "timestamp": 1662415200
  },
  {
    "username": "heikman",
    "rating": 2.0,
    "comment": "this game is so overwrought.. it's a race for vp's.. how fun.. the win-mechanic ties in very badly with the theme.. oh let me build some buildings here.. i won! let me place my entire army on one of my planets.. i won! etc..\ni lost interest very early on.. but now comes the best part.. get ready for 10h+ .. haha.. never in my life again.",
    "timestamp": 1638745200
  },
  {
    "username": "Kunysz",
    "rating": 2.0,
    "comment": "It's a really dissapointing, extremly long game (6players=12h), it has randomness that is impossible to control. Guaranteed headache.",
    "timestamp": 1635026400
  },
  {
    "username": "GeorgW",
    "rating": 2.0,
    "comment": "It's just waaaay too long. It's a game of negotiation, dice and random card draws (read ameritrash) with some great ideas, fun moments and hours upon hours of boredom. The game has so much going on and there are elements of euro strategy, but at the end of 10+ hours it's all decided by random chance. I feel like the game lacks soul and tries to spread itself too thin. It's trying to please everyone and obviously it's working for a lot of people, but not for me. I like the strategy actions (though leadership is OP) and their secondary follow actions, I like the command tokens and the puzzle of managing them well, but all the rest felt too random for me. I don't even think the dice were that much of a problem (though I think 10 sided dice are just fundamentally wrong), it's more about the objectives. It's fun to have such wildly different races, but it also means that by random chance someone can end up with secret objectives they complete on turn 1 and others with completely impossible ones, just by chance. This also means that the public objectives are much easier for some and beyond that, the objectives are so bland so that they could be somewhat possible for every race. This is the only thing the players are aiming for, pretty much the only way to get points, and they're boring and very unbalanced. The tier 2 cards are also just more expensive copies of the tier 1 cards, meaning that if someone has an advantage for one of them, they can easily get 2 more points in the later half of the game, leading to a massive 3 point swing. The diplomacy phase didn't really work for me either, most of the laws and directives are simpky not impactful enough and when they are, negotiation is a limited option since most people will have a strong opinion, so it's all about who has the most influence. That's also a very boring resource, in the first parts if the game it's only used for the effect of 1 strategy card and for the rest of the game it's only used on that and votes. Why even have it when there's nothing to do with it? The technologies are all good and well done, but they barely change between games and players, so everyone will end up with mostly the same stuff.\n\nIf you're going to have a game with a lot of randomness, why does it take so infinitely long to play? If you're going to have an epic game, why make it a race to points and why limit the amount of long term strategy to only technology and random, non-impactful laws? You can't even save up resources between rounds! So yeah, it's not for me, and compounded upon that it takes so long, so no I probably won't ever play again, hence the rating.",
    "timestamp": 1632261600
  },
  {
    "username": "Luedegast",
    "rating": 2.0,
    "comment": "Played it 4times about fourty Hours. To complex, to much downtime, and playing the necrovirus is so frustrating and lonely -.-",
    "timestamp": 1620856800
  },
  {
    "username": "KRWoods1",
    "rating": 2.0,
    "comment": "This feels like a game I should like, but the size and time commitment, combined with needing a higher player count, mean it just takes too long and never feels worth the investment. Also, I have experienced too many filibusters in this game, which really make it something I am not eager to try again.",
    "timestamp": 1616540400
  },
  {
    "username": "Romantikeros",
    "rating": 2.0,
    "comment": "Hands down, most overhyped game of ALL time. Absolute nightmare. 10 hour chance for a runaway leader. Did I mentioned dices?",
    "timestamp": 1586556000
  },
  {
    "username": "Low_luck_fan",
    "rating": 2.0,
    "comment": "Three games with unbalanced factions and runaway leader were enough to get rid of this garbage...",
    "timestamp": 1576969200
  },
  {
    "username": "flpii",
    "rating": 2.0,
    "comment": "Absolutely not a game for me. It has some good elements, mainly the tech tree with lots of interesting upgrades and potentially interesting politics phase.\n\nThere's lots of problems I have with this game though. Randomness in almost every aspect of the game. Lot's of dice rolls in combat, with barely any mitigation, very unbalanced action cards, some are crazy good, while other pretty much useless. Agenda phase, while cool in theory, was very underwhelming. Most of the laws were irrelevant to the current game state, so there was not enough incentive to negotiate and vote, as it didn't matter who/what got elected.\n\nAll of that taking 4+ hours makes for a game I never wanna play again.",
    "timestamp": 1576278000
  },
  {
    "username": "NormandyWept",
    "rating": 2.0,
    "comment": "One of the lowest decision-density games I have ever encountered, with long downtime and not enough to do.",
    "timestamp": 1570744800
  },
  {
    "username": "gragatrim",
    "rating": 2.0,
    "comment": "So many strange design decisions. You get to unflip all of your planets before AND after the voting phase of the game. Makes it a non-decision to always spend all of your influence. The combat doesn't make any sense, the defender gets to decide hits? For a game that's supposed to be about theme, how is that thematic? I also am not a fan at all of the scoring, artificially limiting how many points you can score each round just drags the game out to be even longer than it needs to be.",
    "timestamp": 1567029600
  },
  {
    "username": "Gratoliro_h",
    "rating": 2.0,
    "comment": "Risk ver -0.1.\nI would dare to say that the Risk is better designed game than this overhyped 3x garb..\nLuck in battles and randomness in objective cards in unancaptable for 8-12 hour game.",
    "timestamp": 1564178400
  },
  {
    "username": "Geekdeek",
    "rating": 2.0,
    "comment": "Ultrahype",
    "timestamp": 1562104800
  },
  {
    "username": "zoltanone",
    "rating": 2.0,
    "comment": "3x, luck dependent, fiddly (with lots lots of reading and mini rules) overhyped trash of the game. The reason why I didn’t rated this 1 is because the components are great. But the game is terrible! I have to wait 5 minutes on my turn and reserve whole day to play this game! On the game which is based purely on luck and unbalanced factions. WHo playtested this game? I bought this game based on the hype which I now regret because I lost almost half of the price value!",
    "timestamp": 1561413600
  },
  {
    "username": "Schongluck",
    "rating": 2.0,
    "comment": "The hype is strong with this one",
    "timestamp": 1557612000
  },
  {
    "username": "blokusfanus",
    "rating": 2.0,
    "comment": "6-8 hours horror with unbalanced factions. Plus I have a friend who is constantly forcing this game to be played every Saturday.",
    "timestamp": 1555192800
  },
  {
    "username": "marcon88",
    "rating": 2.0,
    "comment": "Dust collector after half play of one game.\n\nUpdate: Sold!",
    "timestamp": 1553295600
  },
  {
    "username": "bad_bon",
    "rating": 1.5,
    "comment": "Huge disappointment for me. Overly complicated, clunky and long game with big swings in the gameplay.",
    "timestamp": 1541286000
  },
  {
    "username": "teodorap",
    "rating": 2.2,
    "comment": "Played half of the game. Game doesn't have give you clear focus/strategy how you should play. We all agreed to interrupt the game in the middle of the play.",
    "timestamp": 1529532000
  },
  {
    "username": "rot_katze",
    "rating": 2.0,
    "comment": "aggressive 8-hour hunt for a runaway leader",
    "timestamp": 1528840800
  },
  {
    "username": "ziepten",
    "rating": 2.0,
    "comment": "Played once. Not worth 150$. Stick with the 3rd edition. And wait for 5th edition!?",
    "timestamp": 1527458400
  },
  {
    "username": "Revangavator",
    "rating": 1.5,
    "comment": "8Bought it for 150$. Selled for 75$. What a waste of money. Never will try any Twilight Imperium for the rest of my life. Played half of the game, and everybody agreed that we stop playing this game. So in the end i loose 2 hours of my time and 75$. Lesson learned! Never order games which will never hit the table!",
    "timestamp": 1527199200
  },
  {
    "username": "DeadFrog",
    "rating": 2.0,
    "comment": "Takes way too long. Everyone can see all the info right there on the table, so no surprises occur, as you wait for your slow, inevitable loss, or you win because you trick other players into misinterpreting the facts on the table...",
    "timestamp": 1525471200
  },
  {
    "username": "WRKRPLMT",
    "rating": 2.0,
    "comment": "the worker placement in this game is terrible",
    "timestamp": 1524175200
  },
  {
    "username": "rayzor6",
    "rating": 2.0,
    "comment": "Too long, too random and little ability to plan. Every part of the game has shorter and more fulfilling counterparts in shorter games.",
    "timestamp": 1515798000
  },
  {
    "username": "Erikachu",
    "rating": 2.0,
    "comment": "This game took too damn long. I would have been okay with the 10 hour time investment if the game felt solid, however, it felt way too random justify the long playtime. I kept getting impossible secret quests and terrible action cards so I just sat through half of the game watching my opponents compete for the victory. Also, it had elements of take that and kingmaking. Would consider playing again if it took 2-3 hours, but in reality, nooononono no nono. No.",
    "timestamp": 1512255600
  },
  {
    "username": "tectactoe",
    "rating": 3.0,
    "comment": "An epic game, and one whose finer points I haven't even remotely begun to grasp or understand (though a single game does last long enough that you will have learned a whole lot of \\things\\ by the time it ends). Still very much in the exploration phase of this one, by and large enjoying that discovery process (even if it occasionally means playing out a very, very long game in which you certainly have no chance of winning). Not sure this will ever become the masterpiece to me that so many others claim, but that's less the game's \"fault\" and more a testament to my personal tastes: This is decidedly NOT the style of game that normally excites me or pulls me in. Considering it's THAT sort of game—in total and utter excess no less—and I always come out the other side encouraged and willing to play again, it must be doing something right.",
    "timestamp": 1762297200
  },
  {
    "username": "Greggrim",
    "rating": 3.0,
    "comment": "Cost me 120 quid 3 years ago and I still haven't managed to find the space or time to play the bloody thing...",
    "timestamp": 1752962400
  },
  {
    "username": "robjectivity",
    "rating": 3.0,
    "comment": "Pros:\nNeat lore & art design\n\nCons:\nAgenda phase ruins the pace of the game and usually produces no interesting results\nTechnology suffers from a lack of interesting choices\nKingmaking/slaying too common\nRandomized objectives can make for bad games\nFaction asymmetry seems promising, but is too shallow\nCombat not fun\nInteresting choices can dwindle fast\n\nOn the whole, with how long a game takes, the juice is not worth the squeeze. Most fun to play the first few times until the cracks start to show.",
    "timestamp": 1750716000
  },
  {
    "username": "klaypoll",
    "rating": 3.0,
    "comment": "Had a bad experience - a 12 hour epic. Partially my fault, I got drawn into a side bar fight where someone called my bluff. Still a completely unedifying experience and likely won't play again.\nToo damn long a game.",
    "timestamp": 1749765600
  },
  {
    "username": "lililililil",
    "rating": 3.0,
    "comment": "PvP",
    "timestamp": 1747432800
  },
  {
    "username": "allnewlollo",
    "rating": 3.0,
    "comment": "Il mio voto è più legato al concetto di \"likely won’t play this again\" che a quello di qualità del prodotto.\nNel corso del tempo ho capito che il mio problema con questo gioco non è sicuramente la lunghezza di per sé (ti faccio più che volentieri anche due partite ad Hegemony o Nemesis in una giornata), ma il fatto di essermi sentito come sotto sequestro dopo la prima ora di gioco. Alla settima ora (la partita non l'abbiamo neanche finita), io volevo soltanto che la \"tortura\" finisse. Non ne potevo veramente più. Ne capisco i pregi e capisco perché piaccia ma è uno dei pochi giochi per cui declino serenamente un invito ad una giornata gioco (il che è tutto dire).",
    "timestamp": 1744927200
  },
  {
    "username": "HappyDeath",
    "rating": 3.0,
    "comment": "This is one of those games that sounds good in theory but in the end everyone knows who will win an hour in and the last 4 hours are the winner styling on your face. It requires that everyone playing the game be at the same level of familiarity with the game, unfortunately this requirement is impossible because only 1-2 people that have ever played it before will want to play it again because in general the first game is typically an NPE. Its ambitious but I feel like there are better 4x and better political games out there. This one is unneeded now.",
    "timestamp": 1742079600
  },
  {
    "username": "PR9Gaming",
    "rating": 3.0,
    "comment": "The only reason to own this is to bait out any grognards in your play group and promptly remove them. Just play any space 4X video game instead.",
    "timestamp": 1741906800
  },
  {
    "username": "Icedstoat",
    "rating": 3.0,
    "comment": "This is a frustrating game as it's nearly very good. The mechanics flow naturally and there's the illusion of strategy. But by the end it's just a very long game of munchkin, but with worse king making. Have no intention of playing again.",
    "timestamp": 1741561200
  },
  {
    "username": "Jorerbor",
    "rating": 3.0,
    "comment": "Really broad, not all that interesting, just chasing boring objectives while interacting with a big map and tons of mechanics.",
    "timestamp": 1736722800
  },
  {
    "username": "jonhomesley",
    "rating": 2.6,
    "comment": "Mechanics\n1 (Meticulous to a fault)\n\nProduction Value\n6\n\nReplay-Ability (Brutally long so I'll never play again)\n1",
    "timestamp": 1735945200
  },
  {
    "username": "MATTICUS073",
    "rating": 3.0,
    "comment": "I understand why other like it, but it's not for me.\nI'd describe it as 12 hour+ Munchkin.\nThere is more strategy, and it definitely can evoke emotion as there are definitely tense game defining moments.\n\nThat being said it still primarily contains a lot of things that I severely dislike about munchkin at its core:\nKing making, game breaking chance from the card decks, knocking people back (which increases the game time), lots of build up for a defining moment that will either make or break your game, sudo knock out (where you may as well be out, but you still have to sit there waiting for the game to end at some unknowable point in the future).\nThen there is the sheer length, which is the final nail in the coffin; it's incredibly draining and the primary reason I won't ever play this again. I'm fine with long games, but the chaotic lack of control, punitive interactions and sudo knock out mean that I won't enjoy this one.",
    "timestamp": 1732489200
  },
  {
    "username": "staygeeky",
    "rating": 3.0,
    "comment": "https://youtu.be/_sYbCgtfjtQ",
    "timestamp": 1731366000
  },
  {
    "username": "vinayplusj",
    "rating": 3.0,
    "comment": "Apparently, the earlier versions of this game were wargames. Change the mold for plastic, along with some paintings, many words and this game can be set in an a archipelago, a single planet or a small forest. Having lots of bits does not make a thematic game. This edition with its forced bargaining, arguing, threatening and lying seems to have forgotten the average boardgamer and what they actually like. Military actions are superceded by power hungry deal making, king making and betrayal.\n\nThis game is too long and / or expensive for most people. Also, anyone having problem with alpha players in coop games will suffer much longer here. This game needs a table of either fast friends or complete strangers. One of the few modern boardgames that I hated as soon as I started playing. the game is really not fun. It’s such a disappointing experience, especially since I'd heard good reviews. Half an hour into the unacceptability long play time, the polite Canadian who invited me to the table was being rude and aggressive to other players.\n\nThe fourth edition seems to have leaned into its weaknesses; the extremely long game time and tendency to metagame, are made into features. The artwork, although I guess it makes sense to make it \"thematic\", seemed blah and generic to me.\n\nYou have to optimize a LOT of things and constantly be checking your opponent's pieces, sensible planning is next to impossible. Most importantly, sow discord among other players and keep bluffing. There are too many factors / goals ahead to consider. Coupled with the intrigue, plotting of other players' actions and VPs = EXTREME analysis paralysis if you want to play reasonably well. It really is just too AP encouraging. Not enjoyable for anyone but the most dedicated of Ameri-gamers.\n\nI hope your involvement with this highly ranked game doesn’t prove as much of a waste.",
    "timestamp": 1731366000
  },
  {
    "username": "SFRR",
    "rating": 2.6,
    "comment": "TI4 is \"PDS-Political-Sitzkrieg,\" it's an OK game if you only play to 10 points, only 9 if playing with Promissory Notes, it's OK because it's short. If you like sitting around voting twice, carving out your little corner then squatting in it, getting tons of free PDS units (which are now the most decisive unit in the game), then I suppose you'll like this game.\n\nI still have the same issues with TI4 as \"PDS-Political-Sitzkrieg\" but with PoK it does get a tiny bit better. I'll give it a few more tries.\n\n6/29/2022 - bought TI4, won't play the base game, \"PDS-Political-Sitzkrieg\" is quite boring.\n\nIn TI4 the weaker Factions got weaker, the strong Factions got stronger. Tech really is not cheaper, since command tokens got more expensive, players must exhaust MORE planets to gain command tokens, this requires exhausting MORE included resources, many Factions need at least 2 techs to be competitive (mobility especially), which means fewer ships, fewer infantry...this really harms the combat-oriented Factions (which are the lower Tier Factions), making them into little more than \"paper tigers.\" I infer that the designers hate the combat-oriented Factions.",
    "timestamp": 1724277600
  },
  {
    "username": "Onbase",
    "rating": 3.0,
    "comment": "Way too long. I think with the right people, this could work, but currently it's not an experience I'll be looking to repeat.",
    "timestamp": 1720044000
  },
  {
    "username": "lainesko",
    "rating": 3.0,
    "comment": "My board gaming unpopular opinion I suppose. Really long, really overwhelming and on top that I suck at games that have direct conflict. The lore and the Twilight Imperium universe seems really interesting and I enjoy the lore of the game. Unfortunately it doesn't save the game for me. I understand why people hype it up but Twilight Imperium doesn't do it for me.",
    "timestamp": 1716588000
  },
  {
    "username": "fuzen",
    "rating": 3.0,
    "comment": "One play. A bit of a slog, and not sure if I'd like to return.",
    "timestamp": 1715551200
  },
  {
    "username": "trodat123",
    "rating": 3.0,
    "comment": "way too long, played for 6 hours and were only half-way through. the gameplay is interesting but the slow development and the long gameplay just killed this one for me",
    "timestamp": 1712700000
  },
  {
    "username": "bazyliszek10000",
    "rating": 3.0,
    "comment": "This game promises epic space wars. Space fleets, different races, technologies, etc ... It's a lie, war leads to failure. You earn points by buying them with actions, that is, by idling in the following rounds. You buy points for goods that you get at the cost of actions, and they are useless, so you spend actions on resources again and buy points again on actions, etc .. This game rewards you for inactivity. He orders for war. It forces you to boring politics. It encourages lousy negotiations and asking for more points, instead of provoking a fight. The game only works well for 6 players, otherwise the board is unbalanced. Units are also unbalanced militarily, but poor units can make up for by begging for points. The game drags on mercilessly, through shallow negotiation, begging and forced politics. This is not a \"people on the map\" game, this is not what I was looking for, it is not what this game promised me. No matter if it works in some way, it doesn't matter what it promises. It may be the best negotiation game, but it is certainly not a good battle game.",
    "timestamp": 1710630000
  },
  {
    "username": "Jaocb",
    "rating": 3.0,
    "comment": "Too long for my taste",
    "timestamp": 1709506800
  },
  {
    "username": "tomkandy",
    "rating": 3.0,
    "comment": "If you asked for a list of all the bad features of boardgames, they would look a lot like TI - output randomness, take that, very long and unpredictable length, kingmaking, lots of clunky maths and dice, player elimination and unbalanced factions.\n\nThe art and minis are fairly nice though.",
    "timestamp": 1704754800
  },
  {
    "username": "Mack1993",
    "rating": 3.0,
    "comment": "Amidst all the powers and abilities that make this an enticing experience, I can't help but shake that playing this game feels like Munchkin gated behind time length and rules. The king-making is absurd and no matter how hard you plan and coordinate if the table decides to push the second place player to victory there's not a lot you can do to stop it.",
    "timestamp": 1702335600
  },
  {
    "username": "Entropology",
    "rating": 3.0,
    "comment": "God this game is great for the first 2 hours. Then think it's fine for the next two. Then someone gets completely screwed by the rules and mentally checks out. Then someone wanders off and we wait on their turn for 30 min. Then, then..., then. And then just one or two people care for the last two hours. Not a good sign. Pretty much done with it when Warpgate gives 90% of the experience in 25% of the time and you can include new people and they can actually compete. New version at least is a step up.",
    "timestamp": 1700434800
  },
  {
    "username": "gotrunks712",
    "rating": 3.0,
    "comment": "Too long and heavy for my taste.",
    "timestamp": 1697925600
  },
  {
    "username": "LilBoMeep",
    "rating": 3.0,
    "comment": "A very complex game and I understand the hype, however too much politics for me and way too long of a game for my attention span. Also too much drama - if I wanted to experience that I would have gone back to high school",
    "timestamp": 1693864800
  },
  {
    "username": "SWxNW",
    "rating": 3.0,
    "comment": "It's a 6-8 hour gang-up-on-the-leader mess with random take-that cards and an asinine end-game condition.",
    "timestamp": 1693605600
  },
  {
    "username": "BlindsideDork",
    "rating": 3.0,
    "comment": "Very fiddly and factions are definitely unbalanced. Rather play Rebellion or most other games during the timespan that this one takes.",
    "timestamp": 1690668000
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 3.0,
    "comment": "My second, and last, outing with this game was with 7 players. 7 hours. Not my cuppa. I will avoid this game going forward.",
    "timestamp": 1685656800
  },
  {
    "username": "JustinRRizzo",
    "rating": 3.0,
    "comment": "If you think dice rolling is a suitable resolution to 45 minutes of build up and planning, then this game might be for you.\n\nAlso, I have nothing but total distain for \"gotcha\" cards.",
    "timestamp": 1679266800
  },
  {
    "username": "Trebuh",
    "rating": 3.0,
    "comment": "Classic in its pure form, complex but nowadays too slow, tooooo long.",
    "timestamp": 1676502000
  },
  {
    "username": "ChipmunkTX",
    "rating": 3.0,
    "comment": "I understand it is loved and can see why many love it, but it is not for me and feel like I need to rate it appropriately.",
    "timestamp": 1673305200
  },
  {
    "username": "johnnytruant",
    "rating": 3.0,
    "comment": "I used to love this game, but I've realized something...There is very little game here. The number of meaningful decisions over the course of 4-6 hours is astonishingly low. What's more, the first hour and a half play out the exact same way every.single.game.\n\nI have much better ways to spend my gaming hours.",
    "timestamp": 1670799600
  },
  {
    "username": "ultimoratio",
    "rating": 3.0,
    "comment": "Base: \nwith POK \n\nUPDATE Dec 2020: Upgraded the rating to 2 Stars for now. The POK expansion made significant improves to the game. Otherwise it's 1 star with just the base.\n\nI would rather play 18xx for this duration, or play this only on TTS. For 6+ hours, an 18xx game has hundred times more depth and opaque decisions than this. Basically, any game that takes this long will need to be as deep as an 18xx. And TI4 failed the criteria.\n\nThis game is so prone to degeneracies like leader-bashing - which drags the duration of the game.\n\n================\n\nUPDATE Jan 2020: The random objectives makes any long term planning pointless. It's a tactical and reactive game. A poor one for a 6-7 hour long game.. Yeah. Eclipse exists and I'd rather play that every single time.\n\n=================\n\nI first rated the game 4 Stars on my first plays - epic game but a little bit rough on the edge. But it is now 3 Stars as its rough edges just keeps making itself more apparent than ever. The rating might get lower.\n\nThe early game if expanding is just crawling and plodding. The direction of the expansion makes an impact on politics on later turns, but c'mon. Why not escalate the game faster?\n\nThe late game is BORING. SUPER DUPER BORING. People arguing endlessly on how to stop people from winning. This bash-the-leader is tolerable on other area-controls like Inis because these games are quicker, but TI4 is just PLODDING. So many times I keep thinking \"Just bloody get on with it\" when people are still scheming and arguing on how to stop the 1st place player.\n\nThe best bit was in the middle game where conflict, diplomacy, haggling, backstabbing, brinkmanship is at its height. The game is still that epic Ameritrash area-control that requires diplomacy to win (one thing that a lot of people tend to neglect).\n\nBut if I want to play an Ameritrash game of brinkmanship, politics, and haggling, then I'll just play Cosmic Encounter.",
    "timestamp": 1646262000
  },
  {
    "username": "Jrb259",
    "rating": 3.0,
    "comment": "Sadly, this was my worst board gaming experience. I felt like I wasted a day of my life. I was up for it. I did my homework. But there were so many disappointing moments that felt unforgivable. Being voted to skip a turn, by two other couples at the table, because they wouldn't vote against the person in first place felt punitive. Playing cards only to find the ability was not what was expected because we were not playing with that expansion. Recognizing too late how important certain things were. Feeling overwhelmed at the tech tree and not being able to see how my position was conducive to following a certain strategy. Spending an entire Saturday and leaving early because the game still wasn't finished.\n\nIn addition, the game is not as streamlined as it should be. It feels clunky and difficult to move. You are continually checking and referencing your tech tree, the types of ships, your special ability, etc. Felt like an absolute slog in the end.\n\nI respect those who master, love, and appreciate this game. But this is not one I am ever anxious to experience again.",
    "timestamp": 1638054000
  },
  {
    "username": "Mayasty",
    "rating": 3.0,
    "comment": "I have never played such a horrible monster so far. The longest game I’ve ever experienced but it hadn’t paired up with the appropriate fun. Playtime 8h for 6 players, very long downtime and bloody randomness combined with extreme complexity are not acceptable.\n\nE.g. for 2 hours I’ve been planning how to score 1 VP (of 10 needed for victory) for controlling 2 systems adjuscent to system \"Mecatol Rex\" placed at that time centrally on the board. I’ve been developing the technologies to slaughter my enemies more effectively. I’ve been building machines, mechs, infantries. I’ve been trading, negotiating with the others, plotting the intrigues like a crazy fool. Finally after 2 hours I’ve wiped out all enemies on my way, gained good, strong and safe enough position to be able to defend those 2 bloody hexes and survive on them until scoring in status phase. I strongly believed that anyone who will dare to knock down my L1Z1X extraordinarily upgraded machines will have to spend a hell a lot of time and resources which simply was not possible until the nearest scoring phase. And you know what? Suddenly one player played at no cost a card that swapped \"Mecatol Rex\" hex with the one on the perimeter of the board thus moving this hex out far away from me. I felt like an asshole. And of course I haven’t fulfilled the scoring condition and haven’t gained 1 VP. As simple as that. 2 hours of ass work have gone. Go to hell with such a game! Any dice game is far better than this.\n\nLast time I experienced such a total unfair and unjustifiable destruction (only because the game allows such) was during \"1989 Dawn of Fredom\" play thanks to the card \"61. Monday Demonstration\" played against me. It completely ruined all my game in absolute random way so I refused to continue. Fortunately this was only 2 players game and my opponent understood and agreed. Here, with that \"Mecatol Rex\" swap I felt exactly the same but this time I had to continue as this was 6 players game. Why to try harder when little depends on your work and decisions, when other player my destroy your plans in such an easy way? This disqualifies the game in my eyes.\n\nThe first politics phase took almost 30 minutes, was pretty funny and resembled party game. We voted down the leader, made him pretty spontaneous mess and rolled on the floor laughing. But after hours and hours this turned out to be less and less funny as we (myself and 4 other players - newbies) discovered that the whole game is a bloody random mess.\n\nAnd finally the victory. Until end of last round 3 of us would have reached 10 VPs in scoring phase. But the winner became the one who had Leadership card and thus being the first in round announced it earlier. As the game ends up immediately upon such an announcement we got assholes. The designers don’t care that thus we had one move less. So, I’m asking where is the fun in the 8 hours play when you gain the victory in such unbalanced way by only 1 VP? The game should have lasted 2 hours and then we wouldn’t have had such a headache and hangover at least.\n\nNevertheless my rate is 3. Only because I can imagine how good this game might be if peeled off of all useless elements and randomness. Its rules are simple and intuitive. But hundreds of cards with their own tiny rules that can randomly turn the play upside down is what makes this game complete mess.\n\nThe best perfect game of similar genre is \"Shogun\" that combines similar combat challenge, territory control, small economic management and at the same time is very simple and intuitive. It brings a lot of fun and doesn't last 8 hours.\n\nSo, bye bye \"Twilight Imperium\" traumatic experience in current shape. Never again!",
    "timestamp": 1637535600
  },
  {
    "username": "btharveyku08",
    "rating": 3.0,
    "comment": "Better than TI3, but it's still far too narrow a scope for such a \"space opera\", IMHO. And wayyyyy too long because of that.",
    "timestamp": 1621288800
  },
  {
    "username": "Aaron_Dangerman",
    "rating": 4.0,
    "comment": "While Twilight Imperium is an intimidating juggernaut in complexity and time consumption, it is equally massive in depth. And the complexity that seems so daunting upon learning Twilight Imperium becomes more natural as players get lost in the epic sci-fi story that is unfolding while playing for 5-8 hours. It requires dedication, but the rewarding experience is worth it.",
    "timestamp": 1757887200
  },
  {
    "username": "mrdollar11",
    "rating": 4.0,
    "comment": "It was fun for the first 3 hours. We played for 9 hours.",
    "timestamp": 1750197600
  },
  {
    "username": "Brettspielinfo",
    "rating": 4.0,
    "comment": "Tolles gehirnschmalz forderndes spiel das mir sehr gefällt.\neinzig allein würde ich beim spielen folgende phase weglassen wollen...\n\nDie Agendaphase\n...diese sinnfreie abstimmerei geht mir total auf die nüsse und kostet nur spielfreude. von der verschwendeten zeit reden wir erst gar nicht. AGENDA, so ein nerviger schwachsinn.",
    "timestamp": 1747346400
  },
  {
    "username": "Forgeforgeforge",
    "rating": 4.0,
    "comment": "Space cowardice. The map is too connected and ships too fast, preventing you from ever having a big battle or even a little sortie on a border world because very quickly you need all of your fleet to defend all your systems from all of your enemies and can't afford to weaken yourself to third parties.\n\n\"player balanced\". Needs a walk away from the table to negotiate system like virgin queen, but the necessary negotiation in this game is inextricably intertwined with every tempo in the game.\n\nI understand the desire to keep the game tense, but the ending is way way too sharp for a game of this length. The victory point cards should decrease, not increase, in value as you get closer to the required point totals. The first few that come out should be a 3vp stretch of a goal like conquer a home system, one that sets the agenda for the game. That or the 2vp victory cards should be revealed a full round before you are eligible to score them. The way it is now, the 2 vp cards come out that let the tech races just go \"oh look I already completed that, and I have speaker so I guess I just instawin with imperial\" and rob the table of the desperate climactic battle this cold war has been building up to.\n\ntech that lets you steal action cards is a feels-bad mechanic.\n\n\nIt's a weird weight. Too dumb and random for serious competition but too complex and long for party gamers. I feel like I need to be doing whippets to transform myself into the target audience for this game. And then I might just rather play axis and allies 1986? Still I'd hope I get invited when people I like are getting together.",
    "timestamp": 1740092400
  },
  {
    "username": "realityfoible",
    "rating": 4.0,
    "comment": "Epic is one word for it. Inelegant, shallow and overwrought are others. The length of TI4 comes not from grand operatic strategy and negotiation, as there is very nearly neither. Rather, the runtime comes from excessive downtime and faffy rules.\n\nTI4 contains all of the unbalanced silliness of Cosmic Encounter, but stretched thin across many hours and lost within simple yet weirdly fiddly systems. It straddles an awkward spot; being far too chaotic and unfair to be strategic, yet far too long and procedural to be goofy.\n\nIt's fine for a game to be this irreverent if it is a brief lark... But I cannot tolerate a game that asks for this much time and mental energy only to routinely disregard the decisions players make.\nLength and complexity do not automatically equate to depth and intrigue.",
    "timestamp": 1737500400
  },
  {
    "username": "Beedun",
    "rating": 4.0,
    "comment": "Fun game, but takes too long for my liking.. In the right mood with the right friends though - it's a fantastic time and game",
    "timestamp": 1731452400
  },
  {
    "username": "mrVentures",
    "rating": 4.0,
    "comment": "Bit too complicated for me. Cosmic Encounter is same vibe but simpler (though still not simple).",
    "timestamp": 1728597600
  },
  {
    "username": "Elvatuar",
    "rating": 4.0,
    "comment": "Come on, guys! Simplify the rules and find a way to make it playable within the span of a few hours so normal people with lives can enjoy it.\nWait! No. Let this game be the way it is. There are lots of people out there who want a crazy complicated day-long game. I'm just not one of them.",
    "timestamp": 1714860000
  },
  {
    "username": "zebracat",
    "rating": 4.0,
    "comment": "Played two times. Time eater. First play 12 hours second one was 10 hours (shorter version).",
    "timestamp": 1709247600
  },
  {
    "username": "schtefan",
    "rating": 4.0,
    "comment": "Not enough game for the play time, outdated mechanisms, so many cards to keep track of, random agendas that favour single players. I could have played dune imperium 3 times or root 4 times in this time frame and have so much more fun and interesting decisions. Seems like a self sustaining hype and lots of nice looking material, but totally overrated gameplay wise imo.",
    "timestamp": 1707001200
  },
  {
    "username": "Foolio949",
    "rating": 4.0,
    "comment": "Too long",
    "timestamp": 1701558000
  },
  {
    "username": "cyberdr3amer",
    "rating": 4.0,
    "comment": "After playing so many 4x on PC, this just seems way undercooked. Atleast the diplomacy aspect in way better in person (compared to PC 4x), but all other aspects are just thinned down husks",
    "timestamp": 1699398000
  },
  {
    "username": "tawnos76",
    "rating": 4.0,
    "comment": "Seems very dumbed down and simplified. If you want a simplified game then epic long games are not for you. Being an old time Avalon Hill player I have no problem with lots of rules and intricacies in play. Simplifying Twilight Imperium makes it more of an overlong bloated Euro which it is not supposed to be. I prefer the harder tech tree with more prerequisites as it makes more since rather then just having the right colors to get more.\nIt seems like every aspect that some love with this new version is the very same aspects that make me never want to put it on my table or own it.",
    "timestamp": 1696888800
  },
  {
    "username": "rick3623",
    "rating": 4.0,
    "comment": "Ameritrash.\n\nWe played for hours. The game ended over one GIANT dice fest in which the underdog, outrolled a much bigger opponent to win.\n\nWhat a waste of a Saturday.",
    "timestamp": 1695247200
  },
  {
    "username": "sunyushen",
    "rating": 4.0,
    "comment": "政治游戏，想赢必须努力嘴炮。打了十小时没打完，心力交瘁。",
    "timestamp": 1693519200
  },
  {
    "username": "SoloMaru",
    "rating": 4.0,
    "comment": "The game takes too long to play and the down time is massive. I hate the combat system, it's both random and lengthy. The game doesn't feel rewarding at all consider how long it takes to score just 1 VP. We prepared for a whole week before playing this game, reading all the rules and guides, only to be disappointed by this over complicated dice fest. I totally understand the appeal of this game, and I do appreciate the theme, the asymmetry, the negotiation aspect, but there are so many cleaner, better design than this in all of those areas (Chaos Order, Sidereal)",
    "timestamp": 1687816800
  },
  {
    "username": "jibibgg",
    "rating": 4.0,
    "comment": "Would only play this game with experienced players. Even then I'd rate it just barely a 6. Game is so bloody slow. I hate the movement/activation system. It literally prevents you from having a dynamic board state and only lets you expand a couple of hexes every time. Fleet size restrictions don't let you go all-in smash mode. The way you earn VP (and actually win) is a complete crapshoot (control x types of planets is either already done or impossible depending on the player). The tech tree feels very flaccid/insubstantial.\n\nYou want a real event game with politicking, negotiations, alliances, epic battles? Play Dune. You want a space opera while still being a functional euro? Play Eclipse.",
    "timestamp": 1684360800
  },
  {
    "username": "junior_gracz",
    "rating": 4.0,
    "comment": "The best FFA game ever - if life was utopia.\nIt's just too long and complex to play it unless you can really afford to give up one full day to it, and be so lucky to have 4 more friends in the same situation, and that also know the game.\n\n4 stars is a max. I wish i'd play it again, but i heavily doubt it.",
    "timestamp": 1677970800
  },
  {
    "username": "Kent",
    "rating": 4.0,
    "comment": "This is probably a pretty good game, at least a 6, if this is your kind of game. But I'm rating it for me and what I think of the game. So this is not really my type of game. I don't like the negotiating and the secret agreements not only because of the nature of these activities but also because of the time involved and how they contribute to long play times.\n\nI also don't like the potential for backstabbing, for breaking previously established agreements with other players. I think that by the nature of the game and how points are scored, eventually players will be confronted with the decision of turning on each other. I'm not interested in participating in these activities. Not a game for me.",
    "timestamp": 1676761200
  },
  {
    "username": "Harii",
    "rating": 4.0,
    "comment": "A memorable experience to do once in a lifetime, and that's it.\nThe game is just too long and too stagnant for what it is.",
    "timestamp": 1676674800
  },
  {
    "username": "Victoria_hermit",
    "rating": 4.0,
    "comment": "A thousand chits & pieces in a game that can take 6 hours to play. Got this through a trade, looked in the box, then traded it away as fast as I could.",
    "timestamp": 1667516400
  },
  {
    "username": "Shampoo4you",
    "rating": 4.0,
    "comment": "A lot not to love in this game, but in the end it's too many abilities to track and too many \"cancel\" effects, which I hate.",
    "timestamp": 1663538400
  },
  {
    "username": "Faolain",
    "rating": 4.0,
    "comment": "Long and slow, I don't like it that much but I like playing with the people who do, so I will play it.",
    "timestamp": 1657058400
  },
  {
    "username": "tafm1803",
    "rating": 4.0,
    "comment": "Far too long and with too little decision making for a game even half it's length.",
    "timestamp": 1655589600
  },
  {
    "username": "Postmark",
    "rating": 4.0,
    "comment": "Twilight Imperium - 4/10\nI’ll have to admit that I wasn’t entirely looking forward to playing Twilight Imperium last Saturday but on reflection, I’m willing to give it a 4 instead of a 3.\nBefore my first play, I’d have thought that I’d like it more but before my second play I was not feeling positive.\nFor a start I’m underwhelmed - it just wasn’t epic.\n\nNot just not epic for 5 hours play, it wasn’t epic compared to what Eclipse gets into less than 3 and Eclipse isn’t epic - you might each build a dozen spaceships, conquer half a dozen systems and research a dozen techs, oh a fight half a dozen space battles but at least it was worth getting the bits out of the box. Epic is “History of the World” - 3000 years of civilisation (or “Outreach” which takes 3000 years and adds billions of people, a third of the galaxy and a 16 hour run time.)\n\nYet again it finished before it really got going (this time we didn’t even reveal all of the 1vp public victory conditions!) I don’t want to invest on a 10 turn strategy if the game is over after 5 and the competition to rule the galaxy turns out to be an episode of Krypton Factor; and I don’t want to spend 5+ hours on a VP chase of building some structures that could be complete on turn 2 (and only the “1 public vp per turn” limit keeps the game going.)\n\nEverywhere I look is disappointment.\n\nA lot of techs to research but I only researched 2, used the first to research the second and the second to build a ship that had no purpose because the game was over before it moved. I often complain that the best techs in a game are pointless because game is over before you can exploit them but that was ridiculous.\n\nNot that many systems to visit but barely any battles in the game.\n\nNo economy to build - all the planets are worth whatever (and couldn’t they have sorted out a consistent symbol for trade goods on the planet and the counters?)\n\nCommodities/trade goods - what was that all about?\n\nAgendas and promises - I don’t think finding a easy way to give the eventual winner a free 4 vp (in a 10 vp game) really helped, plus agendas feel so tacked on. Perhaps some groups can make this bit the highlight of the game, I’d rather it just went away.",
    "timestamp": 1654120800
  },
  {
    "username": "Abso",
    "rating": 4.0,
    "comment": "Contrary to other comments here I actually liked the strong mechanics. The strategy cards, following others' actions and managing your command tokens in different pools. Good euro mechanics in the core of the game.\n\nThat said, for a space epic the game is almost void of epic moments. Hardly combat in the game as combat does not bring you points.\n\nBecause the artificially limited scoring makes you crawl for only a point per round it’s impossible to make a big epic clash and end up with a dramatic move, lots of points and thus epic rounds of victory and defeat. Instead the most exciting moment is topdecking secret objectives as some of them give you free points instantly while the others demand a full three round set up to achieve.\n\nThe game desperately needs some home brewed variants, like opening up more goals per round and allowing to score multiple objectives per round.\n\nVoting for agendas between play rounds is a great idea, but implemented in a horribly fiddly way. One of the fiddliest rule segments in any game. Not only are you voting, but you have different amount of votes per player. Sounds awesome until you realise someone first gives 7 votes leaving them 4 for the next agenda, other player then votes 11 leaving them 15, the third player votes... wait now, how many did you have left again and what’s the total sum for and against? The agenda phase is probably way better in a digital platform and upkeep. I could even do all the artificial math if the agendas were important to the game... but in our play all this hoopla was for some laws that made zero difference during the game or for the win. Lackluster waste of time.",
    "timestamp": 1649282400
  },
  {
    "username": "jhaelen",
    "rating": 3.5,
    "comment": "Rating is a guesstimate based on TI 3e. I think it's funny that average playing time actually went up compared to the previous edition :-P",
    "timestamp": 1644966000
  },
  {
    "username": "Twistel",
    "rating": 4.0,
    "comment": "There is a lot going on in this game. I play a lot of games, and am the teacher of my game group. We play complicated and long games (e.g. Brass Birmingham, Root, Eclipse,...), however, this one was simply too long. I thought I wouldn't mind the aspect of a day-length game, but after trying it I was mostly only exhausted. So was most everyone else. It could have been the circumstances of the game I admit, but I did play it for 9 hours, which is enough time for me to decide whether I like a game or not usually without changing my mind again. I did have fun playing, but I certainly am never going to put in the effort to initiate another game of this.\n\nTLDR: Game is too long for my stamina.",
    "timestamp": 1644879600
  },
  {
    "username": "PurpleHazel",
    "rating": 4.0,
    "comment": "Twilight Imperium: Fourth Edition is an amazing game - in theory. In practice, it is a game that heavily relies on a veil of majestic wonder and awe at its perceived grandeur. Now, I love this game and I hope that it inspires countless others like it, but I simply can't suggest anyone to pick it up without knowing what you're getting into.\n\nThe Good\n+ TI4 is, without a doubt, eye catching! Its this massive box with wonderful art of galactic scale, drawing from the ideas of cult sci-fi classics. Inside is like a goody bag of plastic ships and cardboard tiles to form your very own galaxy.\n+ If you have a game group of 5+ friends who are hardcore board game players, there are few games that can take as much dedication as TI4. Most games will run for a minimum of 6 hours, sometimes even going a full day if you have 8 people at the table.\n+ Strategy wise, TI4 allows for a wide-range of options for your chosen faction/civilization. Will you be warmongers, political diplomats, a kingmaker? There are countless ways you run your empire in the pursuit of victory. But, that brings up my first major issue with TI4...\n\nThe Bad\n- Strategy wise, nothing matters to TI4 except Victory Points. If you can't score an objective by the end of the round, you have simply wasted your time. To really get into this point, you have to understand that the main method of earning VP is objectives which are predetermined goals the game lays out for you. These are not options, these are not request - these are demands that the game enforces on the players.\n- Once this veil is pulled back, you will quickly learn that TI4 is not a civilization-builder: it's a VP engine-builder. You're one and only goal is to earn VP and to defend yourself.\n- Offensive combat is not only frowned upon, but actively punished. You rarely will ever earn VP for direct combat and, worse yet, will often lose a few ships no matter what due to the game's dice combat. This creates a double-deficit for engaging in war. You don't earn VP, thus putting you behind, and you lose valuable resources.\n- The last point I'll bring up is the imbalance of factions. Most factions are \"okay\" and can have a decent shot at winning. The main issue lies in just a few factions being arguably unplayable if the rest of the table knows what they are doing. The biggest victims of this are the Winnu (core game) and Arborec",
    "timestamp": 1644188400
  },
  {
    "username": "Mr Tias",
    "rating": 4.0,
    "comment": "I have played it 2-3 times now, with six players.\n\nIt's rather complex, with many components and you must learn the cards. I think it's too much and too slow. I only play it because my friends want to do it.",
    "timestamp": 1623621600
  },
  {
    "username": "DanFred",
    "rating": 4.0,
    "comment": "The most overrated game on BGG. How is this in the top 10? I played Twilight Imperium twice. The first time it was with 3 people and the person teaching it only wanted it to go until 5 points (instead of the first to reach 10 like a normal game). It lasted 2 and a half hours and I enjoyed it enough to give it a second go. The second time we played the full game with 5 people and lasted 7 hours (after a refresher of the rules). Twilight Imperium is too long for what it is, wears out its welcome and has so many bad mechanics that would be forgivable in a shorter game (like the 2 hour one), but is unforgivable in a game that lasts over 5 hours.\n\nTwilight Imperium has dice, and while they are only used to go into battle, both games I played, at least one of two people decide to fight since the game has many area control parts. I don't mind luck in games that are short, but to lose to the randomness of the dice in a game that takes all day to play is simply ridiculous.\n\nAnother flaw of Twilight Imperium is that it has a kingmaker problem. One of the guys basically allowed one player to win in the final round by making a bad choice because he just wanted the game to end and he knew he couldn't win. To have a game where the winner can be random and not based on skill in a game that takes all day is just unacceptable. TI may be worth experiencing once to see what all the hubbub is about, but has too many flaws to be worth playing more than once.\n\nI don't mind long epic games, if they have little downtime and no luck. A dice chucking fest in a game that can last 8 hours is just dumb.",
    "timestamp": 1621548000
  },
  {
    "username": "ryansmum2008",
    "rating": 4.0,
    "comment": "Not for me",
    "timestamp": 1618351200
  },
  {
    "username": "sorentheborn",
    "rating": 4.0,
    "comment": "Way too long, fiddly and messy for what it does.. dont get me wrong, I love fiddly and long games when the investment feels worth it, but this was such a drag. Had decent fun the first hour or two and then I couldn't care less about all these ugly blant tech cards all over the board and ugly plastic every where",
    "timestamp": 1611270000
  },
  {
    "username": "DuckDuck_Ann",
    "rating": 4.0,
    "comment": "Maybe playing on new year day partly hung over impacted my experience but I didn’t like this- I got attacked early and spent six hours in last place. A boys game maybe??",
    "timestamp": 1610751600
  },
  {
    "username": "SrFinn",
    "rating": 4.0,
    "comment": "The best FFA game ever - if life was utopia.\nIt's just too long and complex to play it unless you can really afford to give up one full day to it, and be so lucky to have 4 more friends in the same situation, and that also know the game.\n\n4 stars is a max. I wish i'd play it again, but i heavily doubt it.",
    "timestamp": 1610578800
  },
  {
    "username": "Iriphil",
    "rating": 4.0,
    "comment": "Too large element of luck. Too many negate cards which counter an strategy. Like in Munchkin, player in front gets targeted every time, until someone can't be attacked. Much too long for a joyful gaming experience.",
    "timestamp": 1595887200
  },
  {
    "username": "JasonSaastad",
    "rating": 4.0,
    "comment": "prolonged playtime \n dice",
    "timestamp": 1583103600
  },
  {
    "username": "mickhah1",
    "rating": 5.0,
    "comment": "Very overrated game.\nCombat depends on pure luck. The fact that you are able to win a fight with a single fighter vs a death star disturbs me mostly.\nRaces are completely imbalanced. There are many with interesting mechanics which you can play and have fun, but without an intent to win, because they are just not able to if there are decent races in play.\nToo much random concerning victory points. Too many races which are advantageous from the start because they have more buildings or techs, and if there are building/tech quests in play, it just free VP.\nFor a game where almost everything depends on pure luck or a picked race it plays too long. Sitting there for 8 hours and seeing that you don't have any opportunity to win because your combat dices don't roll well or there are tech quests and you are playing Sardakk is not fun.\nDimplomacy is also a joke. Completely unneccerary time consuming step.",
    "timestamp": 1762210800
  },
  {
    "username": "MavenSRB",
    "rating": 5.0,
    "comment": "Overrated at this day and age.",
    "timestamp": 1760565600
  },
  {
    "username": "iplaybgnaked",
    "rating": 5.0,
    "comment": "The epic 3x civilization game just gets better with each edition. I really like the streamlined nature of this edition as it makes the game very easy to get to the table provided I got the time and players for it. I still have just as much fun with it as it did the 3rd edition.",
    "timestamp": 1758060000
  },
  {
    "username": "Jcabrera83",
    "rating": 5.0,
    "comment": "Adam owns",
    "timestamp": 1753567200
  },
  {
    "username": "synthlord",
    "rating": 5.0,
    "comment": "4.20",
    "timestamp": 1753221600
  },
  {
    "username": "mnemonicuz",
    "rating": 5.0,
    "comment": "Improvements to Third Edition, but it's still the same game. Plays a bit more streamlined. So now you only need to suffer 12 hours before it ends.",
    "timestamp": 1751666400
  },
  {
    "username": "Ceolec",
    "rating": 5.0,
    "comment": "I have played TI 4-5 times. With 6 players this game takes too long and the mechanics are incredibly stiff compared to e.g. Eclipse. Halfway the game your attention span dwindles and you begin to make mistakes or forget to take into consideration various variables that could eventually affect the end result. I will in the future prefer to play Eclipse and maybe MoO: Ad astra when it is released.",
    "timestamp": 1751234400
  },
  {
    "username": "speter22",
    "rating": 5.0,
    "comment": "The most extra board game. Will absolutely be the peak of the hobby, to some people. Some scatterbrained thoughts on this beast:\n\n- My original thoughts on TI4 were mostly on the negative side, but it turns out my main complaint (too many special abilities to remember) was resolved by removing the expansion. The base game definitely has enough as-is if you’re the type of person who only plays this maybe once a year, like me. With the expansion removed, TI4 reveals itself to be a massive but manageable experience, and a very exciting event game. I think the expansion is maybe more for people who have played this like 5+ times and want to spice things up a bit.\n\n- The action selection is great. I love how you need to balance your tactics and strategy token pools so that you can eke the most out of every round. Gauging what actions you need to prepare for is a great, fuzzy puzzle to figure out. The actions themselves are all useful and all powerful in certain scenarios, and preparing yourself for those scenarios is a lot of fun. The grand strategy that comes out of this aspect is awesome.\n\n- The political side of the game eludes me. It's absolutely there, and the council phase is a ton of fun, but the wider negotiation that needs to happen in the rest of the game is hard to parse, since it's never clear to me what my opponents need. That unknowability (which admittedly is there becuase of my lack of experience with the game) makes negotiations quick and scary. Which is fun, but also makes it so that I don't know how to use it correctly as one of my tools to win the game. I have weird feelings about the negotiation elements, needless to say! I'm ultimately happy that the game is so politics-forward, and I kind of love it for that, but it's just weird in the wider context of trying to understand what your opponents need. Which, I mean, sometimes it doesn’t matter in negotiation games if you don't know what opponents need, but so much of the game feels zero-sum that it just feels like some deals are probably absolutely terrible for you and you don't know which ones they are. I'm sure I'll have more solid thoughts on this on future plays.\n\n- The action cards add some great fuzziness to the game, but some of them are just straight BS, haha. It's fun, but also can be grueling in a big ol' strategy game that takes 5-8 hours.\n\n- The puzzle of figuring out how to fulfill the various objectives that give you points is really satisfying, but I think their implementation is frustrating. I didn't love the feeling of \"I finished all the objectives I could this round, now what do I do?\" and having pretty much no way to stop others from fulfilling theirs. I get why the game is built around these objectives, and I get that there ARE other things you can do other than fulfilling them, but I still didn't love the way that they worked. And sometimes objectives come up (or end up in your hand) that are dirt-simple for others to get, but take a ton of work for you. It's not meant to be fair, but it can be frustrating in a game that (again) takes 5-8 hours to play.\n\n- The last round in both games I've played wasn't very exciting. The mid-game is a blast, but by the last round in both of those games, it was really clear who the winner was going to be and there wasn't much we could do to stop them. I don't think every game will go into this situation, but based on what I've seen, this scenario probably won't be uncommon in future plays. Again, not a huge deal for a game that lasts 1-3 hours, but in a game this long, and with rounds this long, it's a bit of a slog.\n\nUltimately, I really dig the grand strategy and tense policking this game offers. It's always going to be an exciting prospect to play this once a year or so, but I'm not sure I'd clamor to play more often than that, and I think it's because of its length. I realized that the things I dislike about the game wouldn't be much of an issue in a shorter game, but its length exacerbates them. But at the same time, its length is what makes it so exciting in the first place! So, my feelings are still positive-to-mixed on this one.",
    "timestamp": 1746655200
  },
  {
    "username": "TacticalDragon",
    "rating": 5.0,
    "comment": "Epic space opera that provides some amazing tense moments at the game table. It's still too long and too much moving pieces.",
    "timestamp": 1742684400
  },
  {
    "username": "Webbe",
    "rating": 5.0,
    "comment": "Probably not my kind of game anymore.",
    "timestamp": 1742598000
  },
  {
    "username": "vip_chicken",
    "rating": 5.0,
    "comment": "Unreasonably long (8-12 hours).",
    "timestamp": 1739142000
  },
  {
    "username": "Kodeir",
    "rating": 5.0,
    "comment": "Disclaimer: I have played third edition a lot. There were a few years while I was a university student in which I played it at least once a month. I've even chained two games in a row. I am very familiar with the meta game, and so is my group. I haven't played TI4 nearly as much, but have gotten a handful of games in.\n\nTI4 streamlines TI3 in ways I don't like. TI3 allowed for large point swings, which meant players end game score differences could be high, but the game still felt close, because multiple players could still be a few moves away form pulling a swing themselves.\n\nTI4 doesn't have point swings, which means players scores will end up clumped together. But it also means TI3's issues, this is, rewarding encroaching playstyles and analysis paralysis, are present even more. It rewards bashing the leader too. It's got objectively good mechanical improvements, like the tech tree, but these don't compensate for how the changes overall affect the meta game.\n\nIs third edition perfect? Certainly not. But I much rather loose with a huge point difference, knowing I did my best, than play a game that's twice as long. I've been able to play TI3 in under an hour per player, without including set up and clean up. To put it into numbers, last TI4 game I played lasted two and a half hours per player because nobody could pull ahead.\n\nWith all that said, if you've got a stable gaming group with which to play this, and all of them are new to the TI games, the journey I had with mine from total newbies to veterans was wild. I've got a lot of precious memories tied to this saga I wouldn't trade them for anything in the world. But I also will try to stay as far from TI4 as I possibly can.\n\nRating: \nNumber of players:\n6\n3~4\n\nTo have more information on how I rate games, go to my profile",
    "timestamp": 1739055600
  },
  {
    "username": "Imotekh22",
    "rating": 5.0,
    "comment": "Too much rules for nothing. The universe is Meh. Too long also and you don't have a lot of possibilities",
    "timestamp": 1738018800
  },
  {
    "username": "JamieRufe",
    "rating": 5.0,
    "comment": "Rating: Indifferent\n\nEdit: I just don’t like this game enough to justify the time investment this game requires. I prefer Space Empires 4X in every way and it’s way easier to teach and get to the table.\n\nTI4 is a really tough rating for me.\n\nIf we’re talking play time, it’s a 3 hands down. Without a disciplined game master keeping things moving, the later rounds can really drag and slow down, especially as players fatigue. Plus, in the time it takes to play a game of TI, I could play several of my favorite games. For me, it’s really hard to justify spending this much time on one game (that I think is fine) when it’s difficult just to play the games I know I already love.\n\nIn terms of mechanics and gameplay, it’s definitely an 8 - it has several things I really like: a map, tech trees, asymmetric player powers, interesting scoring objectives, modifiable game rules via voting. With the right group, it’s an incredibly immersive and engaging experience.\n\nI would definitely recommend any serious gamer to try it once.\n\nAll these things considered, TI4 sits at a 5 for me and I’m okay with that.",
    "timestamp": 1735340400
  },
  {
    "username": "Happymrdave",
    "rating": 5.0,
    "comment": "Good game with a nice mixture of some euro mechanics into a very trasher design. Unfortunately some lingering issues kind of haunt the game, namely the incredibly long playtime (easily 75+ minutes per player), some techs that are largely useless except as stepping stones, and factional imbalances.\n\nI have had fun playing this. But I'm just done and I don't think I ever really want to play it again.",
    "timestamp": 1733439600
  },
  {
    "username": "Fingayn",
    "rating": 5.0,
    "comment": "Played for 12 hours, enjoyed ca. 20 min of it. Never again",
    "timestamp": 1731279600
  },
  {
    "username": "jelsepa",
    "rating": 5.0,
    "comment": "Very long. I understand the excitement around this game, but I'm abashed to see so many people being obsessed with it. There are so many civ games that are much better, less extravagant with superficial components and concepts.\n\nWith 8-12 hours of plays (and yes, the game doesn't go under 8 hours unless if you play it once a month), I could play games that are so much more compelling and less convoluted. Republic of Rome lasts about the same length, but at least, I can go out of the table if I'm not involved in something. Here, the game wants you to stay to your seat by making you believe that something amazing will happen, when 90% of the time it doesn't.\n\nOverall, most of the game revolves around building armies, clash with another player, get some techs. Rinse and repeat. It's a good time, but not a grandiose space-opera adventure that so many pretend it is.",
    "timestamp": 1728424800
  },
  {
    "username": "bigbossjose",
    "rating": 5.0,
    "comment": "http://www.for2players.pl/2024/09/twilight-imperium-swit-now...",
    "timestamp": 1726869600
  },
  {
    "username": "magicfreak39178",
    "rating": 5.0,
    "comment": "Has the potential to be a lot of fun with the right group, but would probably be better as a video game, which is something I don't typically say.",
    "timestamp": 1726869600
  },
  {
    "username": "honk3d",
    "rating": 5.0,
    "comment": "M",
    "timestamp": 1726610400
  },
  {
    "username": "Chakoburito",
    "rating": 5.0,
    "comment": "I have no idea why would u play so long boring game like this. There are much better and saturated 4x strategy games in my opinion",
    "timestamp": 1723500000
  },
  {
    "username": "arisep",
    "rating": 5.0,
    "comment": "Game itself is good for what it tries to do, the score is based on my willingness to play it again, which I won't do since the duration is too long and conquer and negotiation are to mechanics that don't sit well with me.",
    "timestamp": 1721167200
  },
  {
    "username": "Albertinum",
    "rating": 5.0,
    "comment": "Great game, just not for me. Could be much simpler",
    "timestamp": 1718488800
  },
  {
    "username": "littlechandler",
    "rating": 5.0,
    "comment": "I can see a lot of things Eclipse was inspired by in this game. I like some things more than Eclipse: You don't research nearly all of the available techs each game, and the techs feel more different. I also prefer the action system here both in the token economy rather than Eclipse's currency payment system with you having to pay more the more things you control as well as the action follow nature. The negotiation aspects I don't like but that is more personal preference of not liking negotiation in general; I thought the trade commodity system was a nice semi-structured way to incentivize trading rather than negotiation just being bash the leader and alliances.\n\nHowever, all of this isn't worth the much longer length of this game. I think a large part of the length of the game comes down to how difficult it is to get points in the game, that there is a decent amount to consider in the game even if the base rules are pretty straightforward, and the politicking of who is ahead and who isn't. I dislike the objectives both in terms of how as the only way to score points how difficult they make it to score, as well as how arbitrary a lot of the actions feel in that you are sometimes making deals to exchange the galactic space over a system and then retreat back the next round just to complete the objectives.\n\nI like the idea of the action cards, but don't like how some are just force an opponent to remove certain units without them having any way to react.\n\nI'm surprised by the fact this game is considered the gold standard for 4X boardgaming, yet at least in the setup mode I played there actually isn't any explore. Well, there are random events when you first colonize a planet, but the whole board was revealed.",
    "timestamp": 1706396400
  },
  {
    "username": "lordalatar",
    "rating": 5.0,
    "comment": "Impressive that you can play a game in 5-6 hours but still I miss playing Twilight Imperium 3 edition. With all adjustments, many to the better, it still feels like not playing the game I love. If choosing between the two games I would like to play TI3 more. TI4 still requires a day to play and can not be finished in the 3-4 hour sweet spot to be played after work hours.",
    "timestamp": 1702681200
  },
  {
    "username": "disposable.superhero",
    "rating": 5.0,
    "comment": "Played a few times. Three times at 4 players and once at 6 players. It was better at 6, but still too long and too complex for my tastes. The fun/minute is lower than many other games; while the complexity is high enough to make the game feel like work.\n\nI will play again because my friend loves it, but I don’t see myself ever suggesting it.",
    "timestamp": 1696888800
  },
  {
    "username": "AmassGames",
    "rating": 5.0,
    "comment": "Way too long, play Catan\n\nGoogle AmassGames",
    "timestamp": 1695333600
  },
  {
    "username": "noti",
    "rating": 5.0,
    "comment": "too too long to play (-2 stars)\ntoo long setup (-1 star)\nold mechanics (- 1 star)\na lot of nostalgy (old timer)\nit is not really a Civ game, just paint over a heavy military game with some diplomacy and resource management and with some diplomcacy.\nI am not a fan of Eclipse. But Eclipse has the better resource management and lasts much shorter.\n\nA typical Ameritrash with much luck, but some name it strategy. It wants to be a deep strategy game. But regarding luck-strategy, it reminds me of Risk (up to 8 hours and more pseudo complexity) rather than Chess if I have to explain to a person who does not play often board games. (-1 star)\n\nIn the same playtime, I can play 4 or 5 other great games or enjoy life in a different way. Such long playtime for a board game feels a waste of time for what I get.",
    "timestamp": 1695074400
  },
  {
    "username": "madvogel",
    "rating": 5.0,
    "comment": "My single-play experience of this was fun and memorable, but mostly due to the rules complexity we had to work through as a group. There's a lot of fun potential here for negotiation, but it feels like it requires regular play which the box size, play time, and rules complexity are not conducive towards.",
    "timestamp": 1694556000
  },
  {
    "username": "individyouall",
    "rating": 5.0,
    "comment": "The beginning game is too slow and dull and the end game is decided by too much chance. I was really disappointed in this.",
    "timestamp": 1694383200
  },
  {
    "username": "Zengoeroe",
    "rating": 5.0,
    "comment": "There is a lot to like in this game.\nYou are building, conquering, battling and negotiating in space and every faction has its own characteristics you have to use properly in order to make a chance to win this game. Many hours have to be invested in this game so that you are learning how to strategize and work against other factions. However, I do not like games that are forcing you to play in a certain forced way without leaving room to enjoy the game. What I mean by that, I want some liberty in my decisions. I am absolutely not a fan of a game where YOU are the person who has to sacrifice some of his actions in order for a certain player to not win the game and having the game run 2-3 hours longer just to make yet another player win the game, but that player isn't you! (Munchkin effect / Kingmaker effect)\n\nThe reason why I am giving this a 5 is because this game takes waaaaaaaaaaaaaaaay to long for what it is. Downtime is really long for players that are getting behind. So, some players will be enjoying the long sessions a lot more than others.\n\nI would certainly recommend that you play this game at least once because not many board games provide such kind of gaming experience.",
    "timestamp": 1693692000
  },
  {
    "username": "rauschpotato",
    "rating": 5.0,
    "comment": "3 plays, 5-6p:\nI don't really enjoy this game, but I'm willing to play it once in a long while. After five/six hours I get bored and want the game to wrap up, but the later rounds take forever. The action cards can range from incredibly helpful to useless, so I wish they were consistently valuable. I wish the politics cards and influence points were more integral and game-changing. Battles can be fun, but in many cases they weaken both sides and allow a turtling player to reap rewards.\n\nOverall, it's a fine game, but I rarely enjoy any game over four hours long.",
    "timestamp": 1682892000
  },
  {
    "username": "Leofric",
    "rating": 5.0,
    "comment": "A game with a very intense learning curve that I am not sure if its worth the investment of the entire group beforehand. Sure, there is a lot of meticulous content in the game per faction, and the phases add a great deal of variety, but I feel there are more games that offer the same and require less in terms of investment, fiscally and time wise. Also, once a player has been beaten down climbing back on the ladder is near-impossible. With a game that takes this long and demans so much investments, thats a no-go. Overrated.",
    "timestamp": 1682632800
  },
  {
    "username": "Szewster",
    "rating": 5.0,
    "comment": "Definetly a 7/10. Game is good, mechanic is okay, diplomatic aspect of this game is nice. But in my opinion game is too long and in second part of the game the situation on map can change very quickly, too quickly.\nWill play when someone will ask and I will have good time, but I will never want it in my collection and when given chance, I will propose something else.",
    "timestamp": 1681423200
  },
  {
    "username": "Zylofan",
    "rating": 5.0,
    "comment": "18 hours to play and 8 spent waiting for the game to end with no viable move left for victory.",
    "timestamp": 1679180400
  },
  {
    "username": "janglemangle",
    "rating": 5.0,
    "comment": "a bunch of friends sit around a table, laughing, talking, hanging out, for up to eight hours!\n\nit's a game that demands to be taken seriously, and at the same time not at all. it's interesting enough to return to in the future",
    "timestamp": 1677366000
  },
  {
    "username": "irzbos",
    "rating": 4.5,
    "comment": "More who I played with making the game last forever than the actual gameplay. Doesn't really encourage fighting, though.",
    "timestamp": 1676070000
  },
  {
    "username": "Epochend",
    "rating": 5.0,
    "comment": "There's no doubt it's epic, offering a tremendously broad scope for getting the kind of experience you want out of it. The trouble is, a game would need to be truly, utterly mind-blowing to justify the sheer complexity and outrageous day-long play-time that TI4 inflicts on you; and for me, it simply isn't. In the time it takes to play (let alone to remember all the rules), I can play 4 other meaty games instead, all of which I enjoy more, and end up getting a more diverse, satisfying game night out of it. And for the love of God, don't ever try it at 3 players.",
    "timestamp": 1673305200
  },
  {
    "username": "Zeusman",
    "rating": 5.0,
    "comment": "Non-Library Copy",
    "timestamp": 1672700400
  },
  {
    "username": "Bartinator",
    "rating": 5.0,
    "comment": "I'm not too much into bargaining which is in the unwritten center of this game. Serious beef with neighboring players possible.",
    "timestamp": 1672614000
  },
  {
    "username": "Miradro",
    "rating": 5.0,
    "comment": "Nice theme, cool twist in the middle but way to long ... in some rounds 15 min. downtime. Not my tempo!",
    "timestamp": 1667689200
  },
  {
    "username": "Avron",
    "rating": 5.0,
    "comment": "It's at least twice as long I feel the mechanisms and interactions warrant. Considering Eclipse does basically the same things for me and is half the length I just don't want to play this, at all.",
    "timestamp": 1664834400
  },
  {
    "username": "andy61",
    "rating": 4.5,
    "comment": "Rated according to the Third Edition",
    "timestamp": 1662069600
  },
  {
    "username": "Jnixon82",
    "rating": 5.0,
    "comment": "Went in with huge expectations but it was a surprisingly dull grind for VPs.",
    "timestamp": 1660514400
  },
  {
    "username": "moiaussizen",
    "rating": 5.0,
    "comment": "rating enjoy vs time, space and cash isn't good enough.",
    "timestamp": 1658354400
  },
  {
    "username": "BlackmaskGamer",
    "rating": 5.0,
    "comment": "not good.this is basically a race VP engine builder.since the objectives are revealed every round stretched to a 8 hours game.and you need to find resources(planets,technologies,materials)to complete them.there is also no X for exploration. the tiles are not hidden like in xia.which takes the tension from the setup and the starting game.playing like a turtle is the strategy here.get planets fast,establish defenses on them and start to building a wall of armies around strategic points.than go for technologies.and use mindgames on enemies like \"if you attack me this guy is wating for you to finnish you off and he will win\".dont fight for metacor is useless you will lose a lot of time.having controlled 2 planets/tile will give more flexibility.also another good strategy would be going for the technologies to build the star. but you are kinda open.\nalso i played the hacan . pretty good race for turtle even i played the game firs time. but i got serious problems with negotiaton in this game.the problem is what to trade for deals.you cant do materials.you cant do actions cards since these are hidden and are great for passive/aggresive play.doing negotiation on agendas is kinda pointless.here having a lot of planets can do some stuff but not a lot since there are not tight to VPs.\ni would remove this agenda completely for a good AI with events like in M&M or even xia.so your deals look like this.\"i will not attack you if you not attack me\".  cmon. did you ever played spartacus?\ndont like that you cant move to a space where is you tactical token already.this actually prolonges this game by a great margin.(old design)\ncombat is pure luckfest.dice and there you go.it can drag by the end.\nfrom 5-6 round its basicallly a waiting game for vps.everything interesting is by the 5 round dead.\ni would try to play it with different race but cant stand the agony.its way too long for the type of enjoyment can offer you.will never play it again.\nfunny from 2013 i dreamed about this game.than a streamlined 2017 version was out.even in CZ language.but iam more happy that i got merchant&marauders with seas of glory exp.way more fun than this.\nbuy nexus ops,eclipse or other games.you will not really miss this one.\nalso good comments by littlemute and purplehaze.go read them.",
    "timestamp": 1653256800
  },
  {
    "username": "Slayerwaq",
    "rating": 5.0,
    "comment": "Combat system take really long time in the middle and later game.",
    "timestamp": 1652220000
  },
  {
    "username": "nishikawa-collector",
    "rating": 5.0,
    "comment": "Too long for what it is for me and I can take or leave most space themed games.",
    "timestamp": 1648335600
  },
  {
    "username": "CascadeHush",
    "rating": 5.0,
    "comment": "3 Typical fantasy flight complete disregard to game balancing. This is an 8 hour game, and it is not okay that you will more than likely spend more than half of that time knowing there is no way you can win and it's probably not your fault. The tech tree is completely underwhelming. The agenda phase is excruciating.",
    "timestamp": 1646780400
  },
  {
    "username": "SeerMagic",
    "rating": 5.0,
    "comment": "Well, I didn't like it that much. I guess that's a bit of a relief as falling in love with an eight hour game isn't ideal. What didn't I like? Just about everything honestly. I knew I wouldn't like the combat, as chucking a bunch of dice for high numbers (or low numbers here) is something I find really dated. It's really dated. It also takes forever with how much stuff can be involved. The agenda stuff was fun, but done better in Warrior Knights. Especially the voting, would be way better if it was blind. I thought I'd love goal cards for VP. But a lot of them were really odd and felt flat in a 4x game. The tech wasn't as interesting as I hoped either. The command token system felt more restrictive than other games that use similar. Pretty much I prefer Starcraft in every single way. Better token system, better combat, better minis, more unique units, better vp system. I do understand why people like Twilight Imperium, but it's unlikely to be anything more than a once a year play for me. It's ok, but I prefer many other area control games that play faster and funner for me.\n\n Lots of races to play as\n Clean action system\n Minis mostly easy to tell apart\n Good card tapping system for resources and influence\n\n Lame flags for ground units\n Odd voting system\n Bad, dated combat that takes too long\n Luck of the draw for action cards\n Weird goals",
    "timestamp": 1646262000
  },
  {
    "username": "yuchinkv",
    "rating": 5.0,
    "comment": "I want to like this game, but the battle system is too random",
    "timestamp": 1640732400
  },
  {
    "username": "hagensam",
    "rating": 5.0,
    "comment": "Too long and phases are confusing. Not my kind of game.",
    "timestamp": 1639177200
  },
  {
    "username": "Bobonthecob",
    "rating": 5.0,
    "comment": "The game is fine, but I'd rather play 3 games of XIA in a row for the time this game takes.",
    "timestamp": 1635980400
  },
  {
    "username": "mi_de",
    "rating": 5.0,
    "comment": "So much promise without delivery.",
    "timestamp": 1632866400
  },
  {
    "username": "ginsbu",
    "rating": 4.5,
    "comment": "Excessively long game where the winner can be decided by drawing the right card. Too much time spent waiting to make decisions which just aren’t that interesting.\n\nI’m glad I got to play. It was a memorable experience, but not primarily due to the game itself. I liked the agenda phase though.",
    "timestamp": 1632607200
  },
  {
    "username": "cgarvie",
    "rating": 5.0,
    "comment": "AT Red Dice, facebook organised event for lots of new Players. It good but its just to long for my enjoyment value",
    "timestamp": 1628460000
  },
  {
    "username": "Dracilic",
    "rating": 4.5,
    "comment": "It's ok at best.",
    "timestamp": 1626559200
  },
  {
    "username": "RConsonni",
    "rating": 5.0,
    "comment": "This game is a total failure in 4 players or less. With 5+ players, it becomes an epic experience - and by epic, I mean not only that is unique and memorable, but also that it lasts forever. If you manage to play this game, in a 6-player game, in less than 3 hours, you have found nirvana. Otherwise, it may be a grueling experience.",
    "timestamp": 1626559200
  },
  {
    "username": "Dyzthar",
    "rating": 5.0,
    "comment": "You need to be in the right type of mood and have the right type of group to play this game. But if you really aren't into the space theme like I am, for the time it takes to just get through one game, its better if your group plays other games. If you really want to run a intergalactic empire then there is a video game called Endless Space 2.",
    "timestamp": 1626127200
  },
  {
    "username": "Saaur_",
    "rating": 5.0,
    "comment": "I had a whole lot of text, but clicked outside of the window and lost it. However, I feel like I should justify this ranking a bit. So less words, some talking points (I hope)\n\n- Randomness of the objectives; for a game this long and heavy I'd prefer the actual scoring to be a bit less luck driven. It's pretty depressive to spend a lot of resources (in the broadest sense of a game) to draw secret objectives you have no chance in hell getting and someone else taking the game with one of the easy ones. Furthermore, there is absolutely no theme behind the objectives. Really, really disliked this part of the game.\n\n+/- The section selection mechanics are pretty cool, but I would rather have had this in a game which does not get better with more players (also, it's a bit fiddly and visually unclear at times). So the game is best with more player, but the downtime is worse. And the downtime isn't THAT cool to see / interact in. The Euro itch this game scratches for me is Scythe - which plays just fine with 3/4 and in a much better timeframe with less unthematic luck.\n\n+ The role selection part of the game is pretty cool and fits the game but I don't see any reason to play this over something like Mission: Red Planet or Puerto Rico.\n\n- Story arc; a game this long shouldn't fall flat for a number of players. But the board state in last 1/3rd of the game will have a number of players pretty much out of it (and maybe only they know).",
    "timestamp": 1621461600
  },
  {
    "username": "ExplodingSnail",
    "rating": 5.0,
    "comment": "I was in awe of the initial spectacle, but on reflection there were some frustrations that didn't initially registered. Subsequent plays have soured my opinion further, which is a shame as I was hoping that my initial reaction would hold up.\n\nSome issues that have become more apparent include the play time, with our last 5 player game taking 7 hours, the slow pace, random objectives, random combat, forced restrictions on player choices, player elimination.",
    "timestamp": 1620079200
  },
  {
    "username": "Klicky1990",
    "rating": 5.0,
    "comment": "I do not think it is a bad game, just not one I consider to be fun.\n\nI love the race biographies, idea that each race has specific technologies and game mechanics, setting up of game, colonization. And then around 2nd hour mark combat comes and to me game immediatelly goes to super boring mode of never ending dice rolls to determnie whose ship is going to blow up.\n\nGiven the score this game has, some people consider this fun and that is fine, more power to them. But I feel like if I wanted to play something like this I can do it much more effectivelly and enjoy it more on PC and not on board.",
    "timestamp": 1619474400
  },
  {
    "username": "jhugz",
    "rating": 4.5,
    "comment": "I just do not get it. I am completely stumped. I have never been more excited to try a board game since joining the hobby. I was finally going to get to play the game on everyone’s gaming bucket list. Six hours later, I logged my play of TI4 and it was the second worse rating I’ve ever given a board game on BGG. Where to begin? The gameplay mechanics are average at best and below average at worst. The Space Battles are a dice chucking luck fest that are incredibly boring and frustrating. The activation of systems for movement and production is overcomplicated and unnecessary. The bidding for turn order, first player, and roles is not exciting and seems to be there just to drag the game out. The amount of AP is smothering due to having to crunch the spreadsheet numbers every time turn order comes back to you to try to min/max your moves leading to a ton of downtime. The debate phase (which I was really excited for) was uninspired in which laws were argued that have little to no impact on the game. Next, let us talk about the objectives and victory point track. First to 10 victory points wins and there is no catch-up mechanism in the game. If you fall behind, you may have to suffer through hours of this game in which you know you have no chance of winning. The only thing left for you to do over the next three hours is to decide who you want to win and become a kingmaker for them. Finally, the theme just seems plastered on with boring asymmetric race powers to create a generic space game. It was just a complete mess for me thematically and mechanically. Not once did this game feel epic, just long and clunky. I may give this one another shot in the future to see if I am just missing something, but wow, do I need some time to recover from this dumpster fire experience and complete let down of expectations.",
    "timestamp": 1609196400
  },
  {
    "username": "tulipt",
    "rating": 5.0,
    "comment": "Options that are restricted or strategies are gas lighted to take away from the game play. Very little that you actually have the choice in. \"Strategy\" on rails.",
    "timestamp": 1607209200
  },
  {
    "username": "Born-of-Ashes",
    "rating": 5.0,
    "comment": "I felt like I had to at least give this a shot once, but it went exactly how I expected; I struggled to get a handle on the game, building up my economy, made a truce with a neighbor who then betrayed me. 6 hrs of never being in contention...woo.",
    "timestamp": 1605740400
  },
  {
    "username": "stvnritch",
    "rating": 5.0,
    "comment": "Twilight Imperium will always be a meh game for me. Sometimes i really like it and others I want nothing to do with it. Its a long heavy game which is hard enough to get people to play at times but it is also a minimum of 3 players meaning its even harder for me to find a dedicated group willing to drudge through the game. So for that I cant rate it higher than the middle.",
    "timestamp": 1605135600
  },
  {
    "username": "CotB",
    "rating": 5.0,
    "comment": "Verdict - Mediocre\nWeight - Heavy\nPlaytime - 6 Hours\nOptimal Player Count - 4\n\nKey Mechanisms\n-Action Selection\n-Area Control",
    "timestamp": 1599256800
  },
  {
    "username": "datefruit",
    "rating": 5.0,
    "comment": "hexagons, complex",
    "timestamp": 1595455200
  },
  {
    "username": "Real1up",
    "rating": 5.0,
    "comment": "I personally don't understand why this game is so hyped. It isn't as good as everyone claims and takes way too long.",
    "timestamp": 1585350000
  },
  {
    "username": "robyaw",
    "rating": 5.0,
    "comment": "Goes on far too long.",
    "timestamp": 1579993200
  },
  {
    "username": "ferion",
    "rating": 5.0,
    "comment": "I bought the 3rd edition, wanted to like it but did not really.\nPlayed the 4th edition, and was remembered again just why I didn'T like it: every time I play dice-rolling battle games I curse my bad luck of the roll. These games are just not for me.",
    "timestamp": 1578524400
  },
  {
    "username": "imjoshellis",
    "rating": 5.0,
    "comment": "The more I play, the less I like this game because I'm generally not a fan of games where kingmaking happens almost every game, whether passively or actively.",
    "timestamp": 1575500400
  },
  {
    "username": "abandofmilk",
    "rating": 5.0,
    "comment": "Played it once, the rules take forever to go over (At least the person explaining them took a long time). Was never really sure if I was accomplishing anything at any one particular time. There seemed to be too much to analyze and due to the long playtime nature of the game, it was hard to stay focus on a few certain goals. Willing to play again to improve my first impression of it as many people seem to enjoy it.",
    "timestamp": 1575500400
  },
  {
    "username": "alzsara",
    "rating": 5.0,
    "comment": "Compared to the original played many moons ago, this 4th edition is better, more varied, more interesting ... but it still mostly sucks eggs. (It seems there’s some serious fanboy selective bias rating going on here!) With people continually uhmmin and ahhing over whether to follow actions or not, or what units to build, and what techs to build, each round takes an hour and within that you'll still probably felt like you've played the game for all of 5 mins and watched on for the rest. There's a lot of pure downtime, combat is interminable, and the game progresses glacially. As movement options increase, anyone who over-aggresses leaves both the attacker and the defender vulnerable to attacks from other players - you can't defend everything. So despite the promise of cool unique powers to play with and the lure of interesting decisions re the continual tradeoff between building units and expanding, this turns out to be a 7-8 hour game with massive downtime, slow progress, and ultimately resolved via king-making attacks. If you're in it just for the ride and the war story, it delivers in spades, but I'd prefer a lot more game involvement for that long an engagement.",
    "timestamp": 1566511200
  },
  {
    "username": "PepaSed",
    "rating": 6.0,
    "comment": "I would say it is an OK wargame.\nThe problem is that the theme feels really weak, and there is no real story while playing. I think the main reason is that the win conditions are far too abstract. It just feels like some generic game mechanics with a sci-fi theme loosely attached.",
    "timestamp": 1762622160
  },
  {
    "username": "quietcorn",
    "rating": 6.0,
    "comment": "Solid improvements all around. After rules review, the game took about 1 hour per player which is nice. The changes to the tech tree are very welcome. The way objectives are handled is much more smooth and enjoyable. The components are much nicer. I very much liked the new role cards and their effects. The whole experience seemed much smoother, although I did raise my eyebrows at a few things. The first thing that seemed odd to us was that the game has action cards which are played during the laws phase. The action card essentially says 'accurately predict the way the vote will go and get X'. Then the laws tend to have an effect for those who voted yes and an effect for those who voted no. The rules of the game allow players to abstain. If everyone abstains, then the player with the speaker token chooses a resolution for the law, but since they didn't vote, then they can let the effect succeed or fail without getting/suffering the reward/penalty, and negating the action card's effect. Perhaps we played this wrong, but it felt odd. Another issue is that the action card that cancels someone's action card is still in. I don't know who still thinks counterspells are fun, but I guess those people still work at FFG. Component wise I also feel it's odd to still have custom tokens for all umpteen factions when the triangles and vp markers could just be in the six player colors, and save us all a lot of bits and boxspace.\n\nAgain though. Overall good. I am impressed and happy with it. I'm just finding little flaws in it's armor is all. I will play it again, and it will stay on my shelf.",
    "timestamp": 1762297200
  },
  {
    "username": "Horst724",
    "rating": 6.0,
    "comment": "Always fun. Complex. too much non-binding politics for my liking. takes forever",
    "timestamp": 1762038000
  },
  {
    "username": "nwmistborn",
    "rating": 6.0,
    "comment": "take so much time...",
    "timestamp": 1761951600
  },
  {
    "username": "Mr Mjeh",
    "rating": 6.0,
    "comment": "Much better than the third edition. Long though, very long.",
    "timestamp": 1760220000
  },
  {
    "username": "Griit",
    "rating": 6.0,
    "comment": "Epic. Just epic. Never played a game shorter than 10 hours.. and always a great experience.\nSometimes it’s hard to go for the points, having ships and winning battles is so tempting.",
    "timestamp": 1759010400
  },
  {
    "username": "Penguinised",
    "rating": 5.5,
    "comment": "It's exactly as big as everyone says, and absolutely not a game I want to play more than once a year",
    "timestamp": 1758578400
  },
  {
    "username": "emelvin",
    "rating": 6.0,
    "comment": "Promises hours of tense 4x action, delivers hours of dice rolling before all 6 players abstain on the agenda card for the 3rd round in a row",
    "timestamp": 1755986400
  },
  {
    "username": "ShoddySleeper",
    "rating": 6.0,
    "comment": "It's a pretty good game but not worth the 12 hour price tag where we could play multiple games with less endurance and scheduling",
    "timestamp": 1751061600
  },
  {
    "username": "Novaskyland",
    "rating": 6.0,
    "comment": "Twilight Imperium is a massive game requiring major time investment from all involved. This makes the game very fun and interesting given you have a day to spare, friends willing to spend the day with you, some willingness to role play, the moon is in the right phase and all the stars are aligned.\n\nIn short (unlike the game) fun to play but too complicated absent a dedicated friend group equally committed to learning and playing.",
    "timestamp": 1746914400
  },
  {
    "username": "Jertlemiah",
    "rating": 6.0,
    "comment": "I can't say I'm looking forward to grinding through another game of this",
    "timestamp": 1746396000
  },
  {
    "username": "Point_taken",
    "rating": 6.0,
    "comment": "This game is good for what it is. The length, downtime, and some under rewarding end game outcomes can be a problem. I play with a good group so I have never had a bad time playing.",
    "timestamp": 1745704800
  },
  {
    "username": "Gimpzilla",
    "rating": 6.0,
    "comment": "It's me; not you.\n\nTi4 was a literal 24 hours of learning, playing, negotiating, battling.\n\nI'm not saying this can't be fun, I just have 17 other games I can use to invoke the same emotion; and I can play every single one in the same time as Ti4",
    "timestamp": 1745186400
  },
  {
    "username": "Elm0__",
    "rating": 5.5,
    "comment": "I found the game very dependent on particular group.\n\n1st experience, with extra competitive group unwilling to explain game nuances to the new player - atrocious.\n\n2nd experience, with more easy going people but still playing seriously - very fun and engaging, made me excited about the game.\n\n3rd experience, played on TTS and split to several sessions, played with group of mostly newbies - got paralyzed by constant negotiations, over-analyzing and stalling. Almost death by boredom, saved by a more heated finale.\n\nOverall I see the potential of this game but find it quite overrated. It's core mechanics are somewhat incongruent mumbo-jumbo of good and bad/very dated concepts. While strategies and command tokens are fun and rewarding concept, component actions mostly encourage stalling, tech tree is bland, agenda is poorly designed and fiddly and random draw objectives is just a bad concept. You never feel really in control, just constantly jockeying for goals that are thrust on you and do not feel very immersive.\n\nEDIT: After another play i am lowering the rating to 5.5. It just doesn't feel justified to spend 10 hours playing this when there actually aren't that many meaningful decisions. Instead of playing space opera you are bogged down in negotiating weird deals with your neighbors where you \"borrow\" a planet from someone in order to get your objective fulfilled (politely allowing them to get their ass off beforehand). When I look at John Company with fun parliament phase, when I look at COIN games with asymmetric win goals and interesting areas of cooperation between factions then it gets harder and harder for me to justify bland and half-baked mechanics of TI that are somehow hyped as an ultimate boardgaming experience.",
    "timestamp": 1738191600
  },
  {
    "username": "Picton101",
    "rating": 6.0,
    "comment": "Managed to get a cheaper copy. Still not convinced that its better than 3e but its certainly cleaner.",
    "timestamp": 1736809200
  },
  {
    "username": "Rheebus",
    "rating": 6.0,
    "comment": "It's long. Had a good first play, but I was ready for it to end. I'll definitely okay it again... Next year!",
    "timestamp": 1735599600
  },
  {
    "username": "zfairborn",
    "rating": 6.0,
    "comment": "Good game. BUT it is VERY long to play; which makes it hard to learn - especially with 24 factions to play (you could have x4 games with no duplicate factions; which feels like it offers solid replayability... but hurts the 'mastering' of the game since its hard to learn to deal with opposing factions.\n\nThis is a game that verges on NEEDING to be a Computer Game due to its depth of details. The difference between experienced players VS new players is TERRIFYINGLY vast.\n\nGreat if this is the one game your dedicated play-group of 6 commits to playing every weekend.\n\nEven then; some factions are too strong VS some that are too weak (faction balance is solidly questionable).",
    "timestamp": 1732748400
  },
  {
    "username": "BadassBilbo",
    "rating": 6.0,
    "comment": "Played at PCC 2024.",
    "timestamp": 1730934000
  },
  {
    "username": "pilot",
    "rating": 6.0,
    "comment": "I rate TI3 at 10 with expansions, so why do I rate this only as 6? Because I had terrible experience with my last game with it and reflecting on that - maybe my taste for games have changed.",
    "timestamp": 1728338400
  },
  {
    "username": "Phillybeefandcheese",
    "rating": 6.0,
    "comment": "If this had been around in the 80s, the last 7 years of the decade, in which I was in my 20s, I would have loved it. So much cooler than Risk or even Axis and Allies. Now in my 60s, I don't need grand sweeping arcs of interspecies galactic tussles A good game should be no longer than a movie (most often 1 1/2 hours; rarely 2 1/2 hours). Grandpa don't want to punch a time clock for a shift-and-a-half to play this behemoth. How about a couple nice card games instead? Too damn long. I'll start noticing my ass pressing into the seat before the game is wrapping up. God's way of letting you know, move, do some damn something else. Other than taking itself with so much grand importance, it's of course an utterly brilliant and masterful accomplishment.",
    "timestamp": 1727906400
  },
  {
    "username": "1enrique",
    "rating": 6.0,
    "comment": "Its a great game. Just waaay too long, making it a \"once in a long while\" kind of experience.",
    "timestamp": 1724364000
  },
  {
    "username": "KubaP",
    "rating": 6.0,
    "comment": "I am super happy I've played it as it was an interesting experience. We managed to play a full 4 player game in under 5h including 1h of rules explanation. What I really dislike about games like this is all the rules exceptions coming from game components. It almost feels like cheating when you score your 10th (winning) point with the only secret objective that can be played in an Aciton Round.",
    "timestamp": 1723932000
  },
  {
    "username": "Geert Vinaskov",
    "rating": 6.0,
    "comment": "Except for the 1-victory point strategy card, there's actually no real reason to upgrade from third to fourth edition.\n\nAlso, this is the gateway game into heavier games or 4x games for a lot of people. So the ratings here reflect that, and this game is way less complex than the complexity poll suggests.",
    "timestamp": 1721599200
  },
  {
    "username": "Gauweezy",
    "rating": 6.0,
    "comment": "Sold to Jamey",
    "timestamp": 1720735200
  },
  {
    "username": "zettlejam",
    "rating": 6.0,
    "comment": "the downtime in this thing is crazy",
    "timestamp": 1717970400
  },
  {
    "username": "zarzu",
    "rating": 6.0,
    "comment": "A massive amount of little systems that feel mostly unconnected and just put on top and next to each other instead of creating one streamlined system.\n\nToo many random effects for my taste:\n- Action cards that can be very swingy\n- Agendas that can have zero effect or take a player nearly out of the game\n- Later objectives can be perfectly aligned for some players and near impossible for others\n\nThe turn order only makes sense during the action phase but has big problems during agenda and strategy phase where it is entirely determined by the speaker and an arbitrary clockwise order.",
    "timestamp": 1717624800
  },
  {
    "username": "Brandizzle",
    "rating": 6.0,
    "comment": "It's fine. Epic feel, but also feels dated. Too much of a time investment for what it is.",
    "timestamp": 1714860000
  },
  {
    "username": "xlqt",
    "rating": 5.5,
    "comment": "Dice have no place deciding meaningful things in a game of this magnitude.",
    "timestamp": 1713477600
  },
  {
    "username": "leumas88888",
    "rating": 6.0,
    "comment": "Need a re-do sometime, but felt like it dragged.",
    "timestamp": 1710630000
  },
  {
    "username": "Carbonium",
    "rating": 6.0,
    "comment": "Очень объёмная игра, надо много договариваться. Похоже на игру престолов, но масштабнее. Боёвка похожа на звёздные войны восстание, всякие кубики, куча кораблей и тд. В первой партии очень легитимно выиграл, хоть и играли неправильно",
    "timestamp": 1709247600
  },
  {
    "username": "Merkowitz",
    "rating": 6.0,
    "comment": "Not worth the long playtime, by the last few turns everyone just desperately wants it to be over. Unfortunately it could then still take 2+ hours for a winner to emerge. Very few interesting decisions to be made outside selecting strategy cards. Combat (which doesn’t really happen very much at all) is too fiddly. I really want to like this but after our last play our whole group just said: never again.",
    "timestamp": 1708988400
  },
  {
    "username": "Mattias",
    "rating": 6.0,
    "comment": "Nicely cleaned up version of TI3. Horrible rulebook using the \"Rules Reference\" principle of recent FFG games. Please stop doing rules like this. Check out classic Avalon Hill games for how to write great rules.",
    "timestamp": 1708556400
  },
  {
    "username": "pallazzo47",
    "rating": 6.0,
    "comment": "- It was ok. Not too complicated in regards to mechanics, but there is so much going on and a lot to keep track of. I don't think the 8+ hour playtime is worth the game.",
    "timestamp": 1707606000
  },
  {
    "username": "Ryan Keane",
    "rating": 6.0,
    "comment": "Honestly I’m not a huge fan of big space battle games with random maps and IP that didn’t predate the game - they lack the real map and factions of a historical wargame or a real fictional work like Star Trek or Game of Thrones, which help me immerse in the theme. That said, this is the best epic space wargame I’ve tried.\n\nThe hunt for objective points is a great mechanic over needing to take opponents homeworld or hold territory till the final round (build up to big round 9 battle is my main complaint with Eclipse). And while there’s interesting tech and race abilities, it doesn’t seem to become so complex that you can’t pretty easily glance at opponent’s amassed units and know how they will roll (long range space cannons are a bit tiresome, since they can be hiding amid a pile of plastic in adjacent hexes you’re not paying attention to - I would eliminate that tech). The Puerto Rico mechanism works well, although having clockwise order for selecting them seems bad design (you will benefit by having a player to your right that wants to keep taking Political). I think they should be selected based on previous round’s turn order, and the game would benefit by having a turn order track with player counters, where you reorder them after each strategy phase, and indicate when a player has passed.\n\nThe agenda voting is not well designed, and voting in games like AGoT and Lannister is much better. Turn-based voting, election votes (you have to select a player), the uncertainty of whether the 2nd agenda will matter, and that the agenda deck varies wildly from crippling to one player to no one gives one crap, combine to create a big unfun waste of time. I would definitely house rule this by going through the deck and only keeping the for/against agendas (and only those that seem at least conditionally interesting), flip only 1 agenda card each round, and make voting simultaneous: everyone just goes thumbs up or thumbs down at the same time, commiting all their planets’ influence towards their up/down vote. You can still negotiate before that, but once negotiating is done, everyone puts out their thumb at the same time.\n\nI would also house-rule removing the secret objective cap. I really like not knowing what players might be going after, but since you can’t score more than 2 of them at most a round (1 during status phase, and 1 during action phase if you’re lucky enough to draw one of those), I don’t really see any reason to have a hard cap of 3 (incomplete in hand + scored on the table). The game is long enough without this rule preventing it from coming to a quicker exciting conclusion.\n\nLastly, a more minor graphic issue: I wish the planet art was much more functional, like solid colors of their trait, and then a big science symbol on the planet’s face. With tons of plastic on the board, the small science and trait symbols get completely covered.",
    "timestamp": 1706396400
  },
  {
    "username": "heyman31891",
    "rating": 6.0,
    "comment": "01/27/24: first full game. 4 players, 8 hours. Fun and interesting but oh so long. Probably wouldn't want to play with more than 4 in the future. Not sure I want to play again actually because of length even though it was fun. I'd rather play 4 two hour games than just this one.\n\n08/27/23: half a game w/6 because one player had a hard stop. We were going for 7 hours. It's a lot of fun but a bit long. Would definitely play again and would like to run a full game. 6 is a bit much so maybe 3-5 players would be nice. Lots of rules to remember but it generally flows pretty nicely. Lots of asymmetric abilities and tech.",
    "timestamp": 1706396400
  },
  {
    "username": "Dacoco",
    "rating": 6.0,
    "comment": "6P\n5p\n\nBuild an intergalactic empire through trade, research, conquest and grand politics.",
    "timestamp": 1705446000
  },
  {
    "username": "blanket221",
    "rating": 6.0,
    "comment": "是一款銀河征服遊戲，三到六名玩家扮演十七個派系之一，因此零件較多，遊戲規則也較為複雜，玩家需要透過軍事力量、政治策略和經濟討價還價來爭奪銀河統治權。每個派係都提供完全不同的遊戲體驗，是一款需要動動腦的策略性遊戲！",
    "timestamp": 1704668400
  },
  {
    "username": "Sunnysidetim",
    "rating": 6.0,
    "comment": "I like the theme, components, lore, and gameplay, but unfortunately, being able to table it depends too much on getting 6 players to commit 6-10 hours. I wish it had a solo mode similar to John Company 2nd Edition which uses \"promise cubes\" to simulate negotiation with bot.",
    "timestamp": 1704150000
  },
  {
    "username": "whiskeyface",
    "rating": 6.0,
    "comment": "Very boring and not for me, but I understand why others like it.",
    "timestamp": 1704063600
  },
  {
    "username": "FranklinTV",
    "rating": 5.8,
    "comment": "CanCon18 purchase and played one 3 player game at end of 2018. It's long (90 minutes rule review plus 7 hrs game time with pre-set first game rules and that is with just 3 player) but worth it. I think if I played it again it would need to be 5/6 player, as the 2 vs 1 element appears to frequently and voting is too manipulative for the speaker - 5 players would probably have more long term alliances and probably less resources / planets for each. so, tentative rating of 8.666 now, but I suspect after a 5/6 player game, it would go >9 (Dec 18). UPDATE: Sure, only one play, but if Im still talking about that game two years ago, it must be a good one. Pub Meeple Ranking Engine Dec 2020 (Rating: 9.851) UPDATE: Last game was a grind, and whilst it is ultimately as fun and epic game, at one point I really wanted it to stop! So, drop in rating (but it is still good for a once a year social event) (Rating 9.026, Dec 2021) UPDATE: The Prophecy of Kings makes the base game redundant, as I will only play this once a year and it will be with the expansion, so rating given a score 5.805 (below Catan Starfarers). (Rating 5.805, Dec 2023).",
    "timestamp": 1703718000
  },
  {
    "username": "BlueDane",
    "rating": 6.0,
    "comment": "Playmat",
    "timestamp": 1703372400
  },
  {
    "username": "Nicocolithophoride",
    "rating": 6.0,
    "comment": "It takes ages to play",
    "timestamp": 1702249200
  },
  {
    "username": "BertaK",
    "rating": 5.5,
    "comment": "Really enjoy this. The low score comes from the length of the game. Will take another look if further games shorten the game by 3-4 hours.",
    "timestamp": 1700866800
  },
  {
    "username": "koflo1",
    "rating": 6.0,
    "comment": "3-6 (6)",
    "timestamp": 1695938400
  },
  {
    "username": "silcabad",
    "rating": 6.0,
    "comment": "Too long",
    "timestamp": 1693432800
  },
  {
    "username": "ACGalaga",
    "rating": 6.0,
    "comment": "It’s a hood game but maybe not for me.",
    "timestamp": 1692568800
  },
  {
    "username": "ewokracoonbreder",
    "rating": 6.0,
    "comment": "I often find 4x games to be tiresome presenting players with far too many rules and options. I’m not a huge fan of minis in a game, give me some more cardboard. I did however really enjoy this game!\n\nHaving played third edition 10 years ago I might have been armed and ready to go, but after spending 30 minutes reading the learn to play, I was able to sit down and play this game relatively briskly with two experienced gamers.\n\nThis was the aspect I most enjoyed, that this 6+ hour game took me effectively no effort to play and enjoy. On your turn, you basically have two options: do stuff on the board or play card. No separate actions for doing research, building units, moving, initiating combat, etc. You can do all of the above by choosing to do something on the board or playing a card. Easy as pie!\n\nThe deal making/bribing with commodities and trade goods is amazingly simple. The agenda phase was interesting in our game even with 3 players.\n\nMy main criticism was that I thought the game was too long. I like long games but my first couple plays made it seem like this game was never ending. Turns out this had to do mostly with a rules mistake with the way victory points are awarded. I can't see this game ever taking more than 8 hours with reasonably competent players. That is unless you're playing to a higher victory count.\n\nGiven the ease to learn and the excellent balance between player interaction vs interaction with the game system, I’ll likely try to get this to the table often.\n\nEDIT: Upped my rating to a 10 after playing with 6 players, all of which have played a learning game prior to the main event. Our game finished in under 8 hours with many rules look ups, various political argument, and a few breaks. Considering we were all new, this was great! Next time will be even shorter. Everyone had a blast, down time wasn't an issue, and the game play was just fun! This long game will get played often!!\n\nEDIT: Was able to complete a 4 player game in just about 5 hours, a game which was played slowly.\n\nFinal Edit - Sold: For me TI just was never the \"event\" game my friends took to. The mechanics are straight forward enough, but there were too many intricacies to feel like you are playing well if you only play once a year or so. I got this to the table about four times and it was great fun. But, it would take me a lot of prep to re-learn the game when it came time for the next game. As such, this had to get sold.",
    "timestamp": 1692309600
  },
  {
    "username": "wr4th",
    "rating": 6.0,
    "comment": "4X",
    "timestamp": 1691272800
  },
  {
    "username": "witsnwagers",
    "rating": 6.0,
    "comment": "Since my first game was 14 hrs I can't say I'm \"usually willing to play,\" but it was nonetheless fun. I really enjoyed the dealing and negotiation Twilight entails, although I'm sure my strategy was utterly amateur since I was just learning the rules this game as well. That said, I was surprised I kept up with the more experienced folks I was playing with and we ended in a very close game.",
    "timestamp": 1690408800
  },
  {
    "username": "Infinipede",
    "rating": 6.0,
    "comment": "Box is a bit beat up. Game inside is fine.\n\nI really wanted to like this game, cause I love the PC game Stellaris and this seems to be along similar lines, but it just... dragged. Maybe it's because the other people I played with were all very courteous and we didn't fight each other over territory or anything? I'm willing to try once or twice more.",
    "timestamp": 1688853600
  },
  {
    "username": "tiagoVIP",
    "rating": 6.0,
    "comment": "Designer: Dane Beltrami, Corey Konieczka, Christian T. Petersen\nPlaying time: 240-480 Min\nWeight: 4.27 / 5\nPublisher: Fantasy Flight Games\nPlayer count: 3-6 (best with: 6)\n\nCOMPLEXITY: Very high\nCOMPONENTS: High\nDOWNTIME: Very high\nFUN: High\nINTERACTION: High\nPLAYING TIME: Very high\nLUCK: High\nREPLAY VALUE: Very high\nSOLITAIRE: Very low\nTHEMATIC: High\n\nComments: Twilight Imperium: Fourth Edition is a strategy game about area influence, dice rolling, follow actions, grid movement, tech trees, variable set up and players powers, voting, etc. It has a LOT of things going on.\n\nTwilight Imperium: Fourth Edition is a monster of a game in many ways: it is big (350+ miniatures, 400+ cards), sprawling, long, complex (but not all that much), and it has many, many moving parts.\n\nTI4 shares the role selection mechanic that is used in games like Puerto Rico and Race for the Galaxy, in which you choose a role, that will give you a major action and the others can \"follow\" the same role, but doing some minor action. To follow a role you spend Strategy tokens. There are 8 roles in the game: Initiative, Diplomacy, Politics, Logistics, Trade, Warfare, Technology, Imperial.\n\nEvery round, the players will choose a role to do, and the choosing order will go from the player that took Initiative in the last round (and the player can't choose Initiative two times in a row). The players choose a role in clockwise order, beginning with the one that took the Initiative role last round. But after this, the order of play will follow the order of the numbers on the roles. The players can activate the role anytime during his turn, and once he does it, the major action will happen, then every other player will be able to do the minor action of the role by paying one Strategy token (and usually will be necessary to spend resources also) - the Initiative role doesn't have a major action, it allows, however, to the player that selected it to use all the minor roles without spending Strategy tokens (and, of course, the player will be the first to select a role in the next round).\n\nAlso, the players will have a number of Command tokens, and they can be used, each at a time, to activate a hex (system) in the board, and is only possible to activate a hex once for round (the Warfare role allows for the possibility to activate the same hex twice). You activate a hex in order, usually, to build units (ships, ground forces, docks, PSDs) or to move units (then you place the Command token in the hex to where the ships will move).\n\nThe game revolves around these things: actions of the roles and actions (activations) made by the Command tokens. Basically the roles serve for: Initiative (be the first to act), Diplomacy (stop someone from attacking you), Politics (bring an event for voting, also to gain Action cards), Logistics (to gain tokens, that you can put in the Command, Strategy and/or Fleet Supply), Trade (gain resources, also allows for trade deals to be made, or to break all of them), Warfare (to activate twice the same system), Technology (to discover new technologies), Imperial (score points).\n\nTwilight Imperium: Fourth Edition is very rich in options, and not a lonesome game, as everyone pays attention to the others, trying to take advantage of the minor action of the roles, struggling to get the timming of actions right (like waiting to activate rolls when you know some other players won't be able to do the minor action), and, of course, because it is a game of conquest, thus it is only a matter of time before the battles start to happen, especially for Mecatol (the capital center of the board), since the use of the Imperial cards have a boost to those holding Mecatol, as well as being able to fulfill some particular objectives.\n\nTwilight Imperium: Fourth Edition it is a game that puts players face to face, brawling for the same spaces, the same actions, building fleets and technologies in order to attack the planets of others. And also of politics, since you can make deals with the other races, vote for events that will benefit some (or harm others). It is, also, a very long game, with many hours of playing time, that definitely won't fit the tastes, time or even table of most players, but for those that do, it is a treat.",
    "timestamp": 1687384800
  },
  {
    "username": "JustAModestMan",
    "rating": 6.0,
    "comment": "Twilight Imperium is a thematic, deep, and rich experience that's absurd play length will likely keep all but the most hardcore fans from engaging with it time and time again.",
    "timestamp": 1686780000
  },
  {
    "username": "krit1789",
    "rating": 6.1,
    "comment": "Epic space game of tech-tree build up, combat dice-rolling, area control, and negotiation. It takes too long to hit the table often.",
    "timestamp": 1686261600
  },
  {
    "username": "Voy_tak",
    "rating": 6.0,
    "comment": "It is an outstanding game, no question.\nBut for me it is simply too long.",
    "timestamp": 1682460000
  },
  {
    "username": "Mestremuten",
    "rating": 6.0,
    "comment": "Rating:\n3/5\nProduction value:\n3/4\nIs the game in my collection/Love to have?:\n0/1",
    "timestamp": 1680386400
  },
  {
    "username": "Takhyon",
    "rating": 5.5,
    "comment": "Game of epic space conquest, the most well regarded 4X game which doesn't need any introductions. Not really my style, but surprisingly solid mechanically at its core. Clever dynamics such as the strategy cards, the streamlined tech tree, and the asymmetric alien factions. Unfortunately fiddlyness and finicky rules exceptions creep in with the action cards, agendas, combat, and technologies, and mistakes are common as special edge cases are easily forgotten. Even though I realize a game of this scale isn't really even meant to be smooth and streamlined, I still find these rough edges irksome.\n\nThe bigger issue is that for me this is game that contains about 2-3hrs worth of fun and interesting mechanisms, which are being stretched over a time period of twice or triple that. Even with the simultaneous play from the strategy cards, the downtime is excessive, especially once big battles with multiple ships blast off, or the tedious negotiations start taking place. As such it's not something I'm personally interested in exploring a lot more, but I totally understand the appeal, especially for people who are able to get into the theme and negotiation aspects of the game.\n\nI also find the end game incredibly unsatisfying and deflating. There's like hours and hours of build-up, all of which ends up culminating in dice rolling, randomly top-decked \"gotcha\" -cards, and lucky objective draws. I've won a game of this which felt completely undeserved as a randomly drawn new objective card just happened to be something I already qualified for the scoring of, which gave me two of the ten points needed for victory. Which doesn't entirely sit well with me as it's some Takenoko -levels of nonsense in a 6hr+ strategy game.",
    "timestamp": 1678662000
  },
  {
    "username": "Rayanne",
    "rating": 6.0,
    "comment": "Risk in outerspace; not my favorite",
    "timestamp": 1677970800
  },
  {
    "username": "Pioneerer",
    "rating": 6.0,
    "comment": "Too long for me, otherwise a cool game concept overall",
    "timestamp": 1676847600
  },
  {
    "username": "Awakening",
    "rating": 6.0,
    "comment": "My previous experience\nI have previously owned and played TI3 a handfull of times and I had mixed feelings about it. There were so many little things in the base version that I didn't like. Sure most where later fixed with the expansions. In TI4 you get a definitive version of everything.\n\nWhy TI4 is better\nTI4 is just a much better game because it fixes all issues I had with TI3 and streamlines a lot. I like the new strategy cards, how trading works, the overhauled technology tree. I didn't like Distant Suns or the Leaders so I don't miss them at all.\n\nMore stuff I like\nI like getting the 17 races with 2 racial techs, the flagships and promissory notes in the box. The new insert isn't perfect but at least it is usable. The public and secret objectives also breaks up the traditional turtleing. And finally, I personally think the new artwork is fantastic and looks way more modern.\n\nWhat I don't like\nTI4 is streamlined but it is still a game that takes a long time to play and has a lot of rules that can be quite complicated for new players. Once you get into the second half of the game it will start to feel more and more like a slog.\n\nNot for everybody\nTI has never been a game for everybody and TI4 doesn't change that. It's still a long epic space war game where you roll dice to decide the outcome of battles and the luck of card draws has an impact on the game. It is still a game that will likely take a whole day and is difficult to get to the table.\n\nConclusion\nFor me personally, I like this version and I will keep it and try to get it to the table more often. It is the best epic space experience out there. And I think it's worth the money, if it's the type of game you like.",
    "timestamp": 1676761200
  },
  {
    "username": "jasonact",
    "rating": 6.0,
    "comment": "Very good and interesting game. The amount of asymmetry and options are simply staggering, but it strangely began to make sense as we played. I love so many elements of the game, but the damning feature of the game, however, is the combat. On the surface, it's simply about rolling dice, but there are so many possible cards, weapons, and asymmetrical abilities that complicate the combat that it was much more frustrating than needed. It essentially ruined the game for me. I was generally pleased or ambivalent about the combat outcomes, so it wasn't about how the combat affected my game. It was just annoying to have all of these pre-combat steps that really did not make much sense.",
    "timestamp": 1675119600
  },
  {
    "username": "BoardOne",
    "rating": 6.0,
    "comment": "Great 'epic' full day of gaming kind of game for our group. See's the table like once every 2 years because of the commitment. I would rate it higher but I always seem to default to the same basic strategy.",
    "timestamp": 1674428400
  },
  {
    "username": "AnJon",
    "rating": 6.0,
    "comment": "Twilight Imperium is like playing a wargame over Xbox Live where the real game is to be the first to get the most achievements. I say this because, despite the large presence of the board, the majority of the points you get come from cards with specific conditions that remind me of the random things game achievements will have you do. Have X number of ships on the edge of the board, or have X planets of type X, that kind of thing. For me, this resulted in a strong mechanical dissonance. I can understand why alot of people would like this game, and would be surprised by and come to appreciate it especially. Completing objectives requires players to interact in unusual or strange ways that are automatically novel. For myself, though, I don't like the d10 dice combat and find meeting objectives to be more annoying than interesting for forming strategies around.",
    "timestamp": 1673478000
  },
  {
    "username": "neural_net",
    "rating": 6.0,
    "comment": "It's fun until you have a chance to win or influence board state. But when you fall behind, you will just sit there and execute blank moves.\nThe negotiation part is too chaotic for my taste, and largely depends on the group dynamics. If you know the people you are playing with, it's probably better.\n\nI completely understand why people are in love with this game tho'",
    "timestamp": 1672786800
  },
  {
    "username": "Shinako",
    "rating": 6.0,
    "comment": "It's a good game, but it's just not for me. Personally, I think it's ok 6/10. It has a lot of cool systems like the action cards that are drafted each round, the action economy system, and the political trading/deal-making, but in the end the actual strategic gameplay is just Risk/Munchkin with extra steps. Bash on the leader, and then someone comes in from behind at the last second and takes the win after everyone else has exhausted their resources stopping other players, or people purposefully engage in kingmaking to help another player win.\n\nIf you're the kind of person that liked playing Risk global domination with your friends, then you'll love this game. I personally prefer Eclipse because of the more varied research/combat interactions, and I don't particularly enjoy the \"politically driven take-that\" aspect of TI. If I am going to be playing a game with a lot of take-that mechanics, I would rather play something short and easy. I have it rated 6/10 because I would indeed play it if in the mood, but I don't think I would be in the mood for it very often due to the sheer length. It's fun up until that last round, but the last round ends up souring the rest of the experience for me even when it's only 1/10th of the total playtime.\n\nEDIT: I've come to realize after more plays that the hidden goals are what usually sours the last round for me, as someone will usually win off a lucky hidden goal. Dune has similar levels of politicking, without the randomness of dice and hidden goals, so I would rather play if given the choice.",
    "timestamp": 1671836400
  },
  {
    "username": "Kuncik",
    "rating": 6.0,
    "comment": "A long-improved legendary game. Lots of brilliant ideas. For me also with flaws.",
    "timestamp": 1671231600
  },
  {
    "username": "mOCHU035",
    "rating": 5.5,
    "comment": "1 Play\n\n7/23/19\nI have rated this an 8 because it feel unfair to rate this any lower for a number of reasons. I can see arguments that can be made to call this a 7 instead, but the arguments for rating this higher outweigh the negatives so, leaving this at an 8. Rating is likely to change based on future plays almost certainly.\n\nNow, on to my thoughts about the game. First the problems about the game.\n1. High randomness. Secret objectives, public objectives, die rolls for combat.\n2. Setup and tear-down is so painfully slow (tear-down more than the setup.)\n3. King-making is definitely a problem. There is not enough opaqueness to avoid this.\n4. Game length is definitely on the long side. Finding a good group to play with can be a problem as well. Downtime is so painful.\n\nHowever, despite all these negatives, you go into a game like this knowing the downsides and negatives. You know that you are more likely than not to lose because of the bad hand dealt to you (in terms of objectives or what ever else). But this is probably the only game I have played where I was able to overlook the impact of randomness on the outcome of the game and still enjoy it nonetheless.\n\n-2\n8/6/19\nStill rates higher than Eclipse. But I do not view it as highly as I did the last time. In addition to the (rather annoying) issues from last time, there are other issues that come through as well after additional plays.\n1. Things get fairly mean-spirited fairly fast. Perhaps that is just my interpretation of how things pan out in pretty much every negotiation game. But 8 hours of it definitely feels like a bit much.\n2. It is just plain tough to remember stuff at the end of a really long stretch of a battle. Remembering to use your graviton laser system 7 whole hours after you receive that tech in your first combat is just plain annoying. Especially so when you lose the game because of that.\n3. It really is just way too much posturing and chest thumping and stuff like you move in and move out in a turn and I will get back in after a round kind of negotiation that is really really annoying.\n\nI might be excited to play this, like once a year. Perhaps even twice a year. Every week? Hell no. Would gladly choose something like Rising Sun over this if I had to play an area control game with some negotiation and tasty combat. The game is epic though. At the end of the day. And perhaps with the right group this can move up to a 7. But again, it is just so many things I just cannot enjoy through the course of an 8 hr session.\n\n+1 to a 7/10 cause I would still play this over quite a few other games at 7 I suppose, if only a bit rarely. Just need to find exactly the right group to do this.\n\n-2 After a long time not playing this, I am hard pressed to think of any situation when i might ever want to play this again.",
    "timestamp": 1670108400
  },
  {
    "username": "billr257",
    "rating": 6.0,
    "comment": "sold",
    "timestamp": 1667343600
  },
  {
    "username": "Samuel Vriezen",
    "rating": 6.0,
    "comment": "This game does manage to achieve a space opera type of grandeur, though it does so primarily by throwing a ton of stuff at you, and also by being rather slow-paced. If you’re into the feel of that, it can certainly be immersive. I can enjoy it. But much of it will be undramatic. No sweeping flash campaigns, you rather proceed across the galaxy system by system, you may have to plan operations an hour of game time ahead for relatively small goals, happy to pick up a point here and a point there, maybe trying to keep an uneasy peace or possibly waiting for the right time to lash out suddenly.\n\nThis monster breathes slowly, and maybe a galactic game should. I do think it’s alive, though. You can tell it’s a game that has gone through a lot of development.\n\nIdeally, I think you play this on a beautiful day... with good lunch breaks... some wine... dinner... brandy and cigars...",
    "timestamp": 1666821600
  },
  {
    "username": "nicest_guy_22",
    "rating": 6.1,
    "comment": "First off, there’s no hype regarding this game. Too few people have rated it for there to be a hype. It’s the least popular game among the top 10 (and among the least popular in the top 100). So no bandwagon here. Yet, it has great ratings. That’s what gives its overall rating credibility in my book.\n\nUnfortunately, for me, the duration, complexity and level of luck involved bring down the score.\n\nAppeal: 7 - the sci-fi theme, although cool, isn’t for everyone\nAccessibility: 6 - minimum 3 player (6) and max 6 (6)\nComplexity: 1.6 - (4.21 x 2 - 10)\nDuration: 0 - 20 min or less (10), 40 min (9), 60 min (8), etc.\nDown time: 8 - duration of a players turn is medium (high in battle); however, the opportunities to play during someone else’s turn are frequent\nStrategy: 9 - the impact the players’ actions have on the outcome of the game (9 because of the amount of diplomacy and complex decisions involved despite the high level of randomness from dice and cards)\nReplayability: 8 - lots of variance between games but game length makes it difficult to bring back to the table; but highly playable online\nQuality of the components: 10 - great art and playing pieces",
    "timestamp": 1666648800
  },
  {
    "username": "Morinfen",
    "rating": 6.0,
    "comment": "Too slow",
    "timestamp": 1666130400
  },
  {
    "username": "Evlong",
    "rating": 6.0,
    "comment": "Only 1 play. I think this game is a masterpiece, for a group of 4 people that want to play is one Saturday a month. I don't, and can't see myself, have this type of group as so can't see a way to really enjoy it.",
    "timestamp": 1664402400
  },
  {
    "username": "adamscott",
    "rating": 6.0,
    "comment": "Trying to sort out how I feel about this game.\n\nNegatives include :\n\n-There is way too much luck for such a long game (combat, secret objectives, action cards, etc.).\n-Many of the objectives are uninteresting or thematically irrelevant.\n-The battle system is uninteresting, with lots of dice rolling.\n-DOWN TIME.\n-Kingmaking and bash the leader.\n-Lots and lots of cards everywhere. It's impossible to keep track of what everyone can do and has upgraded.\n-The game isn't too difficult to learn, but lots of small rules to keep track of.\n\nWith all of those negatives, the game has its fun elements. The allocation system for your tokens is quite interesting. It is fun to build up your empire, advance your techs and look for clever plays to score points. The game has the potential to create lasting gaming moments/memories and I enjoyed some of the diplomatic elements.",
    "timestamp": 1664402400
  },
  {
    "username": "TopekaBoardGamer",
    "rating": 5.9,
    "comment": "It was fun for all of us and worth the time that we played but we all agreed afterward that we wouldn’t be likely to pick it up and play again. Maybe at most a once a year type of game but whenever we would want to get together for that length of time we would probably rather just play a series of Other games over that time.",
    "timestamp": 1664056800
  },
  {
    "username": "pickboy87",
    "rating": 6.0,
    "comment": "Basically a slightly slimlined version of Twilight Imperium 3. Some of it I liked more (ship upgrade cards), some of it less (the tech tree). The political phase only happens once someone has claimed Mecatol which is a bit bizarre, but it also guarantees it being done in a non 4 or 8 player game. Overall, good, but I still prefer TI3 warts and all.\n\nCheck out my comment on TI3 if you want a bit more in depth review/comment of this game.",
    "timestamp": 1663624800
  },
  {
    "username": "majicbaby",
    "rating": 7.0,
    "comment": "+Prophecy of Kings expansion\n+Thunders Edge expansion",
    "timestamp": 1762124400
  },
  {
    "username": "MiloXCoco",
    "rating": 6.8,
    "comment": "aesthetics: 8\nquality: 7\nvalue: 6\nconsistency: 7\norganization: 7\n\nsmoothness: 5\nstrategy: 9\naccessibility: 3\n(re)play-ability: 7\ninteraction: 8\n\n68/100\n\n7 plays",
    "timestamp": 1760997600
  },
  {
    "username": "icystack",
    "rating": 7.0,
    "comment": "I was unfortunate enough to sit between defensive players that behaved like an attack would hurt their feelings, so I didn't have much fun playing this. Given that it takes several hours to play, a more balanced system that incentivizes interaction (and disincentivizes immature players) would have been appreciated.",
    "timestamp": 1760911200
  },
  {
    "username": "MoochyMania",
    "rating": 7.0,
    "comment": "* Sleeved ✓",
    "timestamp": 1760652000
  },
  {
    "username": "StupidRatCreature",
    "rating": 7.0,
    "comment": "rating with Expansion and Codices",
    "timestamp": 1760565600
  },
  {
    "username": "snowguy2",
    "rating": 7.0,
    "comment": "Love this game. Too hard to get to the table, all day board game days are rare. Sold it for that reason, but love to play again.",
    "timestamp": 1760047200
  },
  {
    "username": "DevOpsProDude",
    "rating": 7.0,
    "comment": "43x65 - 1014\n63x88 - 28\n190.5x279.4 - 25\n\nPlayed on board game night.",
    "timestamp": 1760047200
  },
  {
    "username": "ImZhe",
    "rating": 7.0,
    "comment": "Good social negotiation game",
    "timestamp": 1759960800
  },
  {
    "username": "chateauzou",
    "rating": 7.0,
    "comment": "Essentially a race for Victory Points.",
    "timestamp": 1759874400
  },
  {
    "username": "Fundle",
    "rating": 7.0,
    "comment": "highs and lows the game",
    "timestamp": 1757887200
  },
  {
    "username": "ChunkyLover",
    "rating": 7.0,
    "comment": "I liked it. Not usually my type of game, so I can really go much higher in rating. It doesnt have to many rules for a game with that high a complexity. We played 6 people for 8 hours. But it didnt felt drawn out.",
    "timestamp": 1757887200
  },
  {
    "username": "Sedd",
    "rating": 7.0,
    "comment": "Episch,aber von der Spieler-Runde abhängig. Kommt aufgrund der Spieldauer zu selten auf den Tisch. Trotz der sekundären Fähigkeiten der Statuskarten-/Aktionen, ist eine hohe Downtime. Das liegt u.A. daran das nicht immer die Sekundärfähigkeit genutzt werden kann und das man auch Aktionen machen kann, wo die anderen nichts machen können.\nKämpfe sind glückslastig und Spielereliminierung ist auch möglich.\nDa ist Eclipse schneller/knackiger.\n\nEdit: Irgendwann hat sich auch Gaja Project in diese Reihe von epischen, galaktischen 4X-Spielen hinzugesellt.\nUnd ganz neu: Age of Galaxy -> Ist weniger episch (vor allem hinsichtlich Zeit), aber mein Aktueller Favorit.",
    "timestamp": 1757714400
  },
  {
    "username": "Hinmatt",
    "rating": 7.0,
    "comment": "If you liked area control in the 4x variety, you would probably like - possibly love - this game. The theme is set in space which adds to the epic feeling of the game. The game is about building a mightier empire than your opponents. Mightier doesn't necessarily mean the largest one. Factors like technology, resources, influence or military power are important as well. You can achieve victory points through different tasks and the first player who has ten points wins.\nDepending on your game group fighting isn't that important or comes rather towards the last part of the game. You will resolve a lot of issues through negotiations, trading, threats or military deterrence. The game is highly interactive.\nOn many levels the game is fantastic, but it is also extremely long. It's not for a game night but for a game day. It doesn't necessarily feel too long when you are playing it and the length even adds to the epic feeling. Sometimes players will take some time for their turns though, there definitely is some downtime. And the long playing time will make it hard for you to find several players which are willing to invest so many hours in a game and are availaibe at the same time.\nIf you have a few bad rounds at the beginning, e.g., because another player is attacking you mercilessly, it can happen that you don't have a realistic chance to win the game anymore although only half of it is over. In such situations the long playing time is not great.\n\nWhile the earlier iterations (I played TI1 and TI3) are fun as well I definitely recommend to choose the fourth edition. It's way better than the previous editions.",
    "timestamp": 1757109600
  },
  {
    "username": "Kiely",
    "rating": 7.0,
    "comment": "Episch, lang, geil. Aufgrund der fehlenden Häufigkeit die es gespielt wird, gibt es allerdings \"nur\" 8 von 10 Punkten. Man merkt, dass das Spiel \"etwas\" in die Jahre gekommen ist. Das ändert auch die neue Edition nicht. Trotzdem für alle die eine lange Partie Epicness haben wollen, toll!",
    "timestamp": 1756591200
  },
  {
    "username": "VultR",
    "rating": 7.0,
    "comment": "Politics and Command token,\nTechnology, take planets,\n\nYT: Shelfside's #1",
    "timestamp": 1756159200
  },
  {
    "username": "Foreman3000",
    "rating": 7.0,
    "comment": "Time Commitment",
    "timestamp": 1755986400
  },
  {
    "username": "TGorson",
    "rating": 7.0,
    "comment": "Ersteindruck",
    "timestamp": 1755640800
  },
  {
    "username": "simonocles",
    "rating": 7.0,
    "comment": "Games Bandit",
    "timestamp": 1755640800
  },
  {
    "username": "blake33",
    "rating": 7.1,
    "comment": "Too long",
    "timestamp": 1755468000
  },
  {
    "username": "VoxSkitarii",
    "rating": 7.0,
    "comment": "Space epic in boardgame form. Be sure you have dedicated players as this game takes a LONG time to play.",
    "timestamp": 1754863200
  },
  {
    "username": "oggosplat",
    "rating": 7.0,
    "comment": "Amazing game, except for the time commitment (part of what makes it amazing).",
    "timestamp": 1754172000
  },
  {
    "username": "Greenosaur",
    "rating": 7.0,
    "comment": "Really enjoyed the streamline effect. I feel they did a good job making the game faster. I do miss some of the things about TI3, but I am sure F.F. will make expansions.",
    "timestamp": 1751666400
  },
  {
    "username": "aeonphreak",
    "rating": 7.0,
    "comment": "***4,5,or 6p",
    "timestamp": 1750284000
  },
  {
    "username": "bggdork",
    "rating": 7.0,
    "comment": "May 25 - 9\n\nHave not played this for the longest time. The excitement has faded a little.",
    "timestamp": 1748556000
  },
  {
    "username": "BadPritt",
    "rating": 7.1,
    "comment": "4 Players is quite diffrent from 5+ as you got more newtral systems to conquere and all stragic cards getting played each turn.",
    "timestamp": 1747000800
  },
  {
    "username": "gamblingworld",
    "rating": 7.0,
    "comment": "Fun game, but at this weight id rather just play a war game like successors as the dynamics are more intriguing.",
    "timestamp": 1746828000
  },
  {
    "username": "Insect83",
    "rating": 7.0,
    "comment": "Way too long for my taste.",
    "timestamp": 1746136800
  },
  {
    "username": "SimeousBusiness",
    "rating": 7.0,
    "comment": "I've played this maybe 5 times. It has cost me friendships. Definitely a crucible.",
    "timestamp": 1746050400
  },
  {
    "username": "DrJULIK",
    "rating": 7.0,
    "comment": "Sold because the game was causing irl fights.",
    "timestamp": 1745704800
  },
  {
    "username": "Paxtongc",
    "rating": 7.0,
    "comment": "It's a neat game and cool to roleplay but you spend a lot of time and often times will feel bad if you let it.",
    "timestamp": 1745272800
  },
  {
    "username": "kentangarab",
    "rating": 7.0,
    "comment": "Initial play/impression. Need more play with consistent group to fully appreciate this.\n\nThe very first round has almost no decision making, most likely you will do it in an autopilot. So why bother forcing players doing it? This part should be trimmed in the design.\n\nI also dislike the info dump for the tech trees. Too much info that has to be digested upfront that is very important if you want to play well.",
    "timestamp": 1745186400
  },
  {
    "username": "Escapeboy28",
    "rating": 7.0,
    "comment": "A great game just too big to fit in my collection, and it never hits the table.",
    "timestamp": 1744754400
  },
  {
    "username": "jschill96",
    "rating": 7.0,
    "comment": "Very fun space combat game with engaging lore, but gameplay can be a bit of a slog, especially with new players. I've only played once, and it took over 10 hours to complete. May update ranking with additional plays, but it has been hard to get this to the table.",
    "timestamp": 1744063200
  },
  {
    "username": "Aardvarkius",
    "rating": 7.0,
    "comment": "Easily an hour per player (which I don't mind) but it also requires 4-5 players to shine so 4-5 hours minimum. To truly learn the game and then get enough plays to gain needed experience will require multiple plays relatively close together (i.e. like at least monthly) before you become proficient.\n\nUntil you're proficient you can expect a more experienced player to win while you're still trailing by 3-4 points. If you're not earning at least 1 point per turn you're likely toast.\n\nThe many races and the random map layout make for plenty of replayability but, again, requires a lot of learning and experience to understand both how to play your race as well as the nuances of your opponents' races.",
    "timestamp": 1743804000
  },
  {
    "username": "Regel_Fleck",
    "rating": 7.0,
    "comment": "Couldn't help compare to Antike II which is pretty much a no randomness, abstract minimalist design compared to this one. If you like the idea of adding minis with a bunch more thematic rules, features, dice combat and 10 additional hours you'll probably love this. I don't find the rules bad. They're intuitive and those that aren't are usually abstracted to streamline. There's just a lot of rules but nothing complex. It was moving too slow at first but improved but understand the downtime is serious. I do enjoy watching other moves as you build suspicions and plan your next but this probably has the longest wait time I've ever experienced. It's a tinker around game but I'm having some trouble understanding the scoring system. You want to dominate for the sake of empowering a win but the thing is you don't know how because the scoring randomly appears! It feels somewhat detached due to its randomness. I should really give it justice and try reading the rulebook sometime. It has been a fun game in the story it creates and there is a good deal of strategizing and negotiating. Really this game seems to have it all... but also feels kind of pointless because you're often fighting for control over more space, more resources, and more influence because more space, more resources, and more influence increase your chances of holding what you need to win but you'll have to wait and see what that is later on.\n\nUpdate: dropping a point. Even with practice the game is too slow, too long. It feels both burdened and stretched too thin for the sake of doing so.",
    "timestamp": 1743717600
  },
  {
    "username": "Bodaci0us",
    "rating": 7.0,
    "comment": "If there is time, it is great. it can also be hard to play when not explained well, but that has more to do with the players than the game.",
    "timestamp": 1743458400
  },
  {
    "username": "Gumstep",
    "rating": 7.0,
    "comment": "Big and bloated. I'm okay playing this just once a decade.",
    "timestamp": 1743372000
  },
  {
    "username": "front_ed",
    "rating": 8.0,
    "comment": "average time 8-10h",
    "timestamp": 1762470000
  },
  {
    "username": "teejam2",
    "rating": 8.0,
    "comment": "Good: Delivers an epic game of galactic conquest, political maneuvering, and interstellar trade.\n\nBad: Takes all day. Some rules are a bit fiddly such as working out what to produce according to production limits, production costs, and fleet limits, and tech.",
    "timestamp": 1761692400
  },
  {
    "username": "bruke",
    "rating": 8.0,
    "comment": "This game is great, but I changed my vote from a 9 to an 8 because I'm starting to realize how much it sucks if a player is totally eliminated half-way through a 10 hour game. For a game this long, player elimination shouldn't be a thing. Maybe there needs to be a \"vassal\" rule where if someone is near elimination they can swear allegiance to another player and a mechanic like the merge rules from Ankh happen.",
    "timestamp": 1761429600
  },
  {
    "username": "kurtrussell",
    "rating": 8.0,
    "comment": "The event game like no other.",
    "timestamp": 1760997600
  },
  {
    "username": "Horsebanger",
    "rating": 8.0,
    "comment": "Amazing but took forever to play.",
    "timestamp": 1760911200
  },
  {
    "username": "RougeHemlock",
    "rating": 8.0,
    "comment": "Sadly too hard to get a group and time for. Takes 1-2 business days to play. Also takes a lot of table space. Haven't played it in several years as a result of the playtime. This is all especially unfortunate because the game's better the more players you have. If you're able to get the opportunity to play this though, it's a peak board gaming experience, one of the best. Amazing and immersive galactic conquest and politicking. Wish it was easier to play.",
    "timestamp": 1760824800
  },
  {
    "username": "shanev316",
    "rating": 8.0,
    "comment": "Every board gamer should try this game once. Yes, the game is too long, there’s a lot of luck, and it’s not a game you can play often. But my experience with it has been fun every time. The diplomacy and player interactions are the best part of the game, and when you’re 10 hours into a game, the decisions just have more weight. Fantastic game, but just not one I can play often.",
    "timestamp": 1759615200
  },
  {
    "username": "McQueen",
    "rating": 8.0,
    "comment": "Variantes :\n\nDiversity of Empires (pour éviter les objectifs redondants)\nhttps://boardgamegeek.com/thread/2735789/diversity-empires-r...\n\nDestiny of Empires (pour rendre visible plus rapidement les objectifs)\nhttps://boardgamegeek.com/thread/2355918/destiny-empires-rev...\n\nImperial Hegemony (pour permettre à tous les joueurs de scorer au dernier round)\nhttps://boardgamegeek.com/thread/2354173/imperial-hegemony-a...\n\nGhost 5th player (pour simuler un 5eme joueur à 4 joueurs)\nhttps://boardgamegeek.com/thread/2583433/ti4-4-player-5-stra...\n--> A 4 joueurs, on ne joue plus avec 2 cartes Strat. Quand tous les joueurs ont choisi leur carte Strat, le dernier joueur du tour (ou aux points... ?) choisit une carte Strat restante pour le joueur fantôme. Après le 1er tour d'action du round, on active la capacité secondaire de cette carte Strat.\n\n12x12 Scoring Variant:\nPartie en 12 PV. Ne jouer qu'avec 4 objectifs I et 4 objectifs II, et la limite d'objectifs secrets monte à 4.\n\nTrade Wars (pour 2 joueurs)\nhttps://boardgamegeek.com/thread/2114639/trade-wars-2-player...\n\nPremade maps:\nhttps://boardgamegeek.com/thread/2780413/balanced-fun-pok-ma...\n\nMap Generator:\nhttps://keeganw.github.io/ti4/\n\nGame assistants:\nhttps://extraboard.net/extracomputer.html\nhttps://ti4companion.paxmagnifica.com\nhttps://ti-assistant.com\nhttps://ti4score.com\nhttps://tidraft.com/draft/prechoice\n\nOnline play:\n\nhttps://www.twilightwars.com/\nhttps://asyncti4.com/\n\nMod Tabletop Playground:\nhttps://tabletopplayground.old.mod.io/ti4\nhttps://boardgamegeek.com/thread/2981199/recommendation-need...\n\nStats:\nhttps://lookerstudio.google.com/reporting/cb0b987b-5105-4aa4...",
    "timestamp": 1758751200
  },
  {
    "username": "ChamMusic",
    "rating": 8.0,
    "comment": "Truly a great and genuinely epic science fiction game; always enjoy playing it whether face to face or online.\n\n\nBUT...\n\nIt is VERY complex.\n\nIt does take a very long time to play (even with quick seasoned gamers).",
    "timestamp": 1758664800
  },
  {
    "username": "BoomDooger",
    "rating": 7.8,
    "comment": "Chels: 7\nAnt: 8.5\n\nA excellent and monumental gaming experience that is riddled with flaws - the excessive length born of weighty actions, a restrictive action system, scads of lore that are often left behind as new players struggle with the game size, extensive tech trees with bespoke outgrows for each faction, the regular 'gang up on the leader' feeling of old war games - and the list goes on.\n\nBut despite it all, it is a singular experience, an engrossing way to spend a long time bickering, jockeying, and making memories with friends, and one doused in theme when you are ready to take that step.",
    "timestamp": 1758492000
  },
  {
    "username": "asta",
    "rating": 8.0,
    "comment": "It's so much easier to get into than TI3 - Streamline and art upgrade. It does everything better and is an epic experience. Mostly played 3 player and can play in about 5 hours with everyone focusing. Looking forward to a larger player game.",
    "timestamp": 1758319200
  },
  {
    "username": "Fuzzcrumbler",
    "rating": 8.0,
    "comment": "Absolutely as great & epic as it's reputation, but so difficult to get to the table. Other titles stand a better chance of getting played, such as Eclipse, Kemet, Scythe, Rising Sun, Space Empires, GOT, and Dune- but they won’t provide the grand & unique experience found in TI.",
    "timestamp": 1757973600
  },
  {
    "username": "heatbbx",
    "rating": 8.0,
    "comment": "+ Prophecy of Kings\n\nProbably the best 4x game I have ever played. Games take an absurd amount of time (5-6 hours) but my gosh is it a true 4X experience. Every decision you make has significant impacts at some point in the game, even many actions later. The game is 70% a social challenge, navigating around other players to complete objectives upon which negotiations will inevitably lead you to allies or enemies. Attempting to work together to achieve your goals while also leading preventative measures against opponents who are far ahead. Just a pure social experience of tact and skill. If I could give it an 11, I would.\n\nRating Tracker:\nAugust 2022 - 10\nFebruary 2023 - 8.5 - Obviously due to the playtime this is sadly a once in a year type of game. Phenomenal experience but needs whole days planned around it.\\\nSeptember 2023 - 8 - Still love the game, but haven't tabled since my last update, and sold my copy as another member in group has one. Unfortunate but still an absolutely fantastic game.",
    "timestamp": 1757368800
  },
  {
    "username": "Profecia91",
    "rating": 8.0,
    "comment": "A classic 4x where diplomacy is its highlight, I wish there was more incentive for battles and it is clear that the more passive and focused on the objectives, the closer you get to victory.\nTo win the game we have to reach 10 or 14 victory points, depending on the option the players decide. There are victory points that are difficult to achieve, but there are others that are very easy that come out randomly on the personal objective cards and it is not even satisfactory for this to happen in such a long game and with so few points needed for victory.\nThere are many game situations, decisions on the agenda cards, very powerful alliances, overly passive or active players, which can make the experience bad, because you know you won't be able to fight for victory but you have to stay until the end of the game and that is painful when we are talking about these taking about 8 hours.\nI really like 4x games but with a maximum duration of 4 hours, because for more than that playing time I prefer to opt for 1vs1 wargames.",
    "timestamp": 1757196000
  },
  {
    "username": "ryan8tacos17",
    "rating": 8.0,
    "comment": "Only played once and desperately need to play again.",
    "timestamp": 1756072800
  },
  {
    "username": "Marco2020",
    "rating": 8.0,
    "comment": "What a monster! We played our first session over 7 hours with 4 players. Game explanation and game set up adds another 1.5 hours. It is really epic! It is a 4 X colossus with a lot of Ameri-trash! We liked it a lot. Our game mainly focused on expansion and extermination. Less exploiting and exploring, as the whole galaxy is known and the planets resources come with the expansion and settlement on new planets. On the board game box it´s written A BOARD GAME OF CONQUEST, POLITICS and TRADE. I would say this pretty much summarizes the whole content of the game and gives you the portion of those aspects in descending order of importance for game play. Definetly a game for 4 or more players, and a group of board game geeks loving the luck aspect in the space battles. If you are more on the EURO space side, you should try Eclipse or Void Fall.",
    "timestamp": 1755727200
  },
  {
    "username": "kevgames",
    "rating": 8.0,
    "comment": "Not the best for the casual board game player, but challenging and fun once you get the hang of it.",
    "timestamp": 1755640800
  },
  {
    "username": "Doctor_Cowboy",
    "rating": 8.0,
    "comment": "CLASSIC Fantasy Flight game: exceedingly fun theme, gameplay, and player interactions but finicky, finicky rules. Once you've read all the tiny cards and understand all the possible options that could pop up, it's great. Long gameplay is both a pro and a con, and joy depends completely on your own gaming group.",
    "timestamp": 1754344800
  },
  {
    "username": "Singhilarity",
    "rating": 8.0,
    "comment": "I've played enough of TI4 and the PoK expansion to have a firm decision.\n\nThis game is apex. It's a pinnacle of the genre - but it's not without its flaws.\nLet me start by pointing out that I think about it constantly. The 24 factions. The tech progressions. Map layout. The politics and timings. What can be traded, what can be extorted?! The myriad objectives.\n\nIt's not quite a full 10 for me, however. I feel like it wants just a little bit more tuning. Certain opportunities just seem a bit too much like traps. Certain ships are more valuable than others. Certain technologies, ultimately, overshadow others - meaning that there's juuuust a bit of the edges of a pigeon hole. The game makes up for it with the huge variety of objectives, factions, board composition, and negotiations - but I'd like the flexibility to really explore alternate compositions for a faction without feeling like I'm making suboptimal choices.\n\nIt runs super long. This is not a detriment. I actually relish games of this length; certain aspects of the experience are completely inaccessible until you round hour 6 -:but organizing it can be a chore. It means I never get to play it as frequently as I'd like.\n\nBecause, seriously, I've never put more mental energy into a game.",
    "timestamp": 1754344800
  },
  {
    "username": "sykano",
    "rating": 8.0,
    "comment": "gigantic space 4X and negotiation game with cool alien races that takes 4-9 hours\nrevised and streamlined in comparison to TI3, and stuffed with the best from TI3 expansions\nclassic\nNegotiations are a big part of the game (!), at least if you want a chance to win. It's not obvious for inexperienced players, but there is a lot of depth and potential for variety of negotiation deals. This makes TI4 probably the best and most epic negotiation game.\nTI really wants to be played with 6 players. It's designed for this player number. (!)\n\n+ good mechanics (command tokens, strategy tiles with cost for secondary, action cards, variable objectives, secret objectives, tech symbols on planets, combat with D10, agenda phase voting with riders, commodities -> trade goods, promissory notes, ...)\n+ good theme\n+ good materials, most of the ship miniatures are really well done\n++ asymmetric player powers, all 17 TI3 races in base game\n+ revised and streamlined classic\n+ competitive depth (!)\n+ social experience, creates stories\n0 demanding gameplay, learning curve, hard to play well\n- takes very long\n- can't be played often, hard to find people that are willing to invest that much time, requires a big table (at least for 5+ players)\n- not optimal with fewer than 6 players (!)\n- initiative order as tie breaker\n-- some balancing issues (races, techs) (!) (-> techs might be fixed by Codex soon)\n- insert could be better\n- extremely expensive\n\nI like the races, there are some really cool twists on some stereotypes (elf-like alien mermaids, trader lions, space pirates, Borg-like cybernetics, space turtles, brainiac aliens, space goblins, nomadic wolfbatbears, fire elementals, angry plants, wormhole spirits, militaristic humans, fighter insects, sect of clones, macrovirus, ...).\nGreat move from FFG to include all 17 (normal) races and the flagships from TI3+Expansions in the TI4 base game!\n\nI also like the action cards. Although they are quite random, they're epic and not always easy to use in the best way.\n\nI dislike that some objectives are quite easy and that some overlap heavily (e.g. 2 upgrades for 1 point, 3 upgrades for 2 points).\nI also dislike that tight games are often decided solely by turn order.\n\nIn general I am not a fan of the \"Puerto Rico\"-like role selection mechanic, but it seems to be done much better in TI4 (other players have to spend resources to get secondary, just one among several other kinds of actions, initiative value, ...).\n\nThe Agenda phase is cool, but sometimes it seems not that impactful.\n\nThe dice-driven combat works surprisingly well. Maybe D10 should be used more often in games!? But why no retreat to empty systems or at least empty space?\n\nI think that one of the strengths of TI4 is that it is such a greatly revised game and a complete package.\nBut still there are some weak spots where the game could need some rebalancing (Naalu, Sol, Jol-Nar too strong; blue and green techs much better than red techs; requirements for Dreadnought II; ...). That's disappointing especially where it hurts gameplay variety (Sol, tech paths, fleet composition).\n\nThe base game should have included a bit more system tiles and more objectives (and a 18th race).\n\nThis would probably be a solid 10 for me if it weren't for the long playtime and some of the balancing issues.",
    "timestamp": 1753567200
  },
  {
    "username": "Daggerclaw",
    "rating": 8.0,
    "comment": "DW",
    "timestamp": 1753308000
  },
  {
    "username": "winchesterkaveman",
    "rating": 8.0,
    "comment": "I really REALLY want to score this at 10. It's in my personal top 5. But the sheer scale of it, the incredible time it takes to set up and play, the investment of mental and physical energy for a game... all means that its an 8. Quite simply, it is never ever going to be a game I 'always want to play' because logistically that is insane.\n\nI adore it, and everything about it. I love the lore and the world building, the variety and versatility, the style and how it makes me feel even thinking about playing.\n\nBut it is also an ordeal, and one that for most people is simply out of their comfort zone by too much. You have to commit to this game to get the best out of it, and there is no grey area before that full commitment. if you don't you'll probably hate it.\n\nThe game is a work of art that's been through 3 iterations before now, and continues to be developed through online Codex supplements and community support.\n\nNot everyone should play this game, but if you do, and you invest in that game, it will change you.",
    "timestamp": 1753308000
  },
  {
    "username": "slotus2005",
    "rating": 8.0,
    "comment": "They need to put Distant Suns back into this game oh-so-desperately. Perhaps the best thing about this game are the paths to victory that do not involve much fighting, and the high cost of fighting. I could do with a bit less tokens and more old-school record sheets, and the damn planet cards take up tons of room. The only real balance flaw I have found in this game is exploit with the human flagship and tons of fighters. I think I am starting to hate fighters in sci-fi games because everybody wants to imitate modern naval warfare rather than a balance between all fleet elements. The technology, while not as \"realistic\" as the former tech tree, is much more friendly to keeping the game moving; I grew very tired of players wasting time waiting to look at the single copy of the damn tech tree. The new \"look at your cards\" method works far better. Having said all of that, a few record sheets could easily take the place of all the silly cards. I do like the miniatures to this game quite a bit though.",
    "timestamp": 1753308000
  },
  {
    "username": "BubbleheadAmber",
    "rating": 8.0,
    "comment": "PROS:\n- Very interactive game\n- Feels like it has elements of social deduction game in long board game form (e.g. player behaviour matters, picking up cues from negotiations, can frame conversations to suit your needs etc...)\n- Always makes you feel engaged through the follow action\n- Game is very asymmetric with the player powers, increasing replayability\n- Even with all the dice rolling and RNG from cards (objectives, laws etc.), the focus on negotiation and scoring objectives makes the game feel more high skill ceiling and deep (compared to a combat focused dice thrower game)\n\nCONS:\n- Strategy doesn't feel deep (e.g. have tons of \"combo\" opportunities, once you explore all planets there's no way to build a resource engine)\n- Downtime suffers the later you go on the game, due to the mental overload of all the techs played\n- The game is punishing due to the game length; you have to play through the game if you made a bad move\n- Kingmaking and bashing the leader is very present in the game\n\nFINAL THOUGHTS:\nBasically, grand space opera, in board game form (both in epic scope and the huge number of mechanics thrown in)\n\nReplayability: 5/5\nPlayer Interaction: 5/5\nDowntime: 4/5\nStrategy vs Luck: 4/5",
    "timestamp": 1753221600
  },
  {
    "username": "silverhydra",
    "rating": 8.0,
    "comment": "https://www.youtube.com/watch?v=WpQMzY1uG2o",
    "timestamp": 1752876000
  },
  {
    "username": "Twel001",
    "rating": 7.9,
    "comment": "I did it, but at what cost...",
    "timestamp": 1752357600
  },
  {
    "username": "decard1979",
    "rating": 8.0,
    "comment": "Galakta. 8 Players. Insert. Mata. Dodatek. 1400",
    "timestamp": 1751925600
  },
  {
    "username": "SenseiZen",
    "rating": 8.0,
    "comment": "Två olika spel är aldrig identiska, 8 TIMMAR (1 är set-up)",
    "timestamp": 1751925600
  },
  {
    "username": "apisapia",
    "rating": 8.0,
    "comment": "I like the game but sitting at the table for 6-8 hours is too exhausting for me.",
    "timestamp": 1747432800
  },
  {
    "username": "tommyteleshop",
    "rating": 8.0,
    "comment": "Very elaborate game. Requires a bit of studying to get the most out of the game. Long gameplay.",
    "timestamp": 1746482400
  },
  {
    "username": "colinrgeorge",
    "rating": 8.0,
    "comment": "+ Prophecy of Kings Expansion\n+ Twilight Codex Volumes 1-3",
    "timestamp": 1745964000
  },
  {
    "username": "AhabXXX",
    "rating": 8.0,
    "comment": "Epic games, sometimes too long, but always enjoyable.",
    "timestamp": 1745791200
  },
  {
    "username": "marburgmonkey",
    "rating": 8.0,
    "comment": "Strategy / Conquest / 4X",
    "timestamp": 1745532000
  },
  {
    "username": "Lagake",
    "rating": 8.0,
    "comment": "An outstanding game. Every game plays a little differently.",
    "timestamp": 1745186400
  },
  {
    "username": "JotWu",
    "rating": 8.0,
    "comment": "Great, but slightly too hard to hit the table and too long.",
    "timestamp": 1745100000
  },
  {
    "username": "BlackLeadAlchemist",
    "rating": 8.0,
    "comment": "Great game, gets a bit too long (My first game ran over 10 hours with 5 players. Maybe due to all players being new, and playing with the expansion?)",
    "timestamp": 1744495200
  },
  {
    "username": "mattlowder",
    "rating": 8.0,
    "comment": "April 2025 w/Ryan Palmer.",
    "timestamp": 1744495200
  },
  {
    "username": "stoupeaks",
    "rating": 9.0,
    "comment": "1 - aleix - Sol\n2 - elisa - Saar",
    "timestamp": 1762655520
  },
  {
    "username": "KummiRub",
    "rating": 9.3,
    "comment": "The best 4x game ever made and Babylon 5 in a box... what else is there to say? We have house rules that give people an additional secret objective and reveal extra public objectives at the start to accelerate scoring and reduce game length by a couple of hours. This means it gets to the table more often. Buying the POK expansion is essential, don't play without it!",
    "timestamp": 1762470000
  },
  {
    "username": "PickyNaga",
    "rating": 8.5,
    "comment": "Would try it again",
    "timestamp": 1762470000
  },
  {
    "username": "sirhaggis",
    "rating": 8.5,
    "comment": "SK",
    "timestamp": 1762383600
  },
  {
    "username": "adel9591",
    "rating": 9.0,
    "comment": "This really transcends what I thought a board game could be, with long term consequences of every choice coming up later in the game in an indescribably satisfying way. The game is epic in scale and truly provides as much freedom to interact with others as you want. It is however prohibitively long, which makes it an 8.\n\nEdit: Still just too good, even its length isn't a real drawback.",
    "timestamp": 1762297200
  },
  {
    "username": "ItsMagic",
    "rating": 8.5,
    "comment": "massive combining convincing unlocking theatrical bidding fantastical spreading stealing bluffing collecting surprising tactile;\nA Game of Thrones: The Board Game, Eclipse: Second Dawn? favoured;\nfavoured over Diplomacy?",
    "timestamp": 1762038000
  },
  {
    "username": "Josh123212321",
    "rating": 9.0,
    "comment": "This was really quite fun. It unfortunately takes too much time out of the day for me to justify playing again. If you get fired, your wife leaves you and your kids don't talk to you because of your homophobic views, this would be better than killing yourself",
    "timestamp": 1761951600
  },
  {
    "username": "Connduit",
    "rating": 8.5,
    "comment": "4-8\n\nRecommend even player count\n\nBest at 6",
    "timestamp": 1761951600
  },
  {
    "username": "MiMeu",
    "rating": 9.0,
    "comment": "Prophezeiung der Könige\nThunders Edge",
    "timestamp": 1761865200
  },
  {
    "username": "Joe Dizzy",
    "rating": 9.0,
    "comment": "Only looking to trade my English version for a German version of TI4.",
    "timestamp": 1761692400
  },
  {
    "username": "merismo",
    "rating": 9.0,
    "comment": "No other game quite like it. I spend so much time even just *thinking* about Twilight Imperium.\n\nGranted, the first time I played it I wasn't impressed. Maybe it's cause I didn't really know what was going on, or maybe cause 6 hours in I knew I was gonna lose and I *still* had to wait another 2 hours to come out in last place. But by the 2nd playthrough I figured it out and was totally hooked.\n\nThis might seem like a dice-rolling space-themed fighting game, but really diplomacy and strategy are what score you the victory. It's much more tactical than you'd think, and the player interactions are really what make it shine. If there was only one game I could play for the rest of my life, it would be TI4, hands down.\n\nAt the same time, I understand why others might not be as much of a fan. There should be an inverse relationship between the length of a game and how much luck is required- for short games, relying on lots of luck is fine. For a 6-10 hour game... luck should be pretty minimal, and for TI4 it is far from minimal. A set of bad rolls, lame action cards, or a law coming out that breaks your strategy and no one else's- these could all screw you over big time, even late in the game. And in true Ameritrash fashion, there is even a chance you could get eliminated (to be fair, I've yet to see this happen).\n\nI don't think any of that should discourage anyone from trying the game. It's spectacular, and holds my number 1 spot for a good reason.",
    "timestamp": 1761692400
  },
  {
    "username": "deurbroucq",
    "rating": 9.0,
    "comment": "+Prophecy of Kings",
    "timestamp": 1761256800
  },
  {
    "username": "Song_of_Shield_Lady",
    "rating": 8.5,
    "comment": "宏大，漫长，经历。",
    "timestamp": 1760997600
  },
  {
    "username": "Carnage994",
    "rating": 9.0,
    "comment": "This definitive space 4x has been on my want to play list for the longest time. There is a lot going on with a ton of moving parts, but it definitely leads to an epic experience. Personally, I prefer Eclipse, just because of the shorter play time, but the actual game experiences are completely different.",
    "timestamp": 1760911200
  },
  {
    "username": "BionicBeaver",
    "rating": 9.0,
    "comment": "I have all expansions and codex content. This would be a 10 if not for the time it takes to play this game. If they somehow could get this game to play in 3-4 hours, it would be at the top of the stack.",
    "timestamp": 1760824800
  },
  {
    "username": "bamftw",
    "rating": 9.0,
    "comment": "#6p",
    "timestamp": 1760133600
  },
  {
    "username": "Bertuccia",
    "rating": 9.0,
    "comment": "After a first try in 6p and nearly 6h, I was left very impressed. First, I like the action system: having a primary action for you and a secondary for everyone who is willing to pay, keeps players engaged during downtime. Actions are many at the beginning, allowing for a quick start and then their weight increases, but expanding doesn’t feel like a handicap like in Eclipse. Public objectives remain available for players in later rounds regardless of whether others finished them first, and private objectives give some light unpredictability. Differently from Eclipse, the game is much more strategic and does not force you into fights just for the sake of it. Cannot wait for the next try.",
    "timestamp": 1759528800
  },
  {
    "username": "vorpal_Cortex",
    "rating": 9.0,
    "comment": "+Prophecy of Kings expansion\n+Thunder's Edge expansion",
    "timestamp": 1759010400
  },
  {
    "username": "Persereus",
    "rating": 9.0,
    "comment": "Playable with house rules:\nAll Level 1 public Quests are available beginning with the first round.\n\nEach Player gets 2 secret quests\n\nPlaytime >6h with 5 player\n\nEdit, with Timer able to play around 6h without house rules",
    "timestamp": 1758492000
  },
  {
    "username": "InFlare",
    "rating": 9.0,
    "comment": "A unique gaming experience that is impossible to get in other 4x strategy games. Epic, politics, diplomacy and warfare in space mixed in the perfect cocktail that I enjoy drinking every time.",
    "timestamp": 1758405600
  },
  {
    "username": "Jbywater",
    "rating": 9.0,
    "comment": "Played with 6 people. Took 9 hours. Was phenomenal!!",
    "timestamp": 1758405600
  },
  {
    "username": "DeadDomino",
    "rating": 9.0,
    "comment": "This game is too big and too long and I get to play it so rarely and never with the same group that each game is another beginner game.\n\nBut also I played it earlier this year and the day just flew past and everyone had a great time.",
    "timestamp": 1758232800
  },
  {
    "username": "StevenManro",
    "rating": 9.0,
    "comment": "Very Complex. Very Time consuming. Good Game.",
    "timestamp": 1758060000
  },
  {
    "username": "biotofu",
    "rating": 8.7,
    "comment": "Only 1 game played. Good 8-10hr full day 6P game. Takes at least 1 full play to get the hang of it (a lot of things to pay attention to on your board, learn the tech options, other factions on top of your own faction's mechanics, strength/weakness). Pretty much unlimited replayability with a lot of brain crunching. The end game (the final round) seems to have a problem of getting very bloated (I was out of the lead in the final round and I could literally go away for 30mins while waiting for the other 4 still competitive players to dice everything out before its my turn to do something negligible before it went around again). You need a massive table to house everything and maybe a 4P game would be more crisp. Definitely not going to play this with 8P. Enjoyed majority of the game and I think the enjoyment is going to improve as i make less and less stupid mistake to keep myself in the game and fight for the throne.",
    "timestamp": 1757973600
  },
  {
    "username": "joecool42",
    "rating": 9.0,
    "comment": "- Prophecy Of Kings\n\n- Thunder's Edge",
    "timestamp": 1757973600
  },
  {
    "username": "DWRoelands",
    "rating": 9.0,
    "comment": "Got this to the table once so far; worth every dollar.",
    "timestamp": 1757368800
  },
  {
    "username": "jdb7990",
    "rating": 9.0,
    "comment": "One of my absolute favorites. Only thing that would make it a perfect ten would be if easier to teach or if factions are more balanced",
    "timestamp": 1757282400
  },
  {
    "username": "Udruga Kockica",
    "rating": 9.0,
    "comment": "IVA.K.\n\n+FFG Galactic Gamemat\nBID",
    "timestamp": 1756936800
  },
  {
    "username": "fackloar",
    "rating": 9.0,
    "comment": "It's the board game for me, defining everything I like about the hobby. It obviously has some downsides, especially the fact that it just takes too long. But I love it nonetheless. It's always an event, something to discuss prior and after the game.",
    "timestamp": 1756850400
  },
  {
    "username": "JacenSunrider",
    "rating": 9.0,
    "comment": "Amazing experience right from the opening of the box. The sheer size is something that got me excited (but it's not for everyone), and then the gameplay itself won me over right away. It's kind of Civilization, but board game and in space - each time we play it, it feels familiar but fresh and exciting. But the upside can also be a downside - it is a big game, both in size and complexity and time required to finish it. I know people can finish a 6 player game in a matter of couple of hours, but for us, even though most of the group is already experienced and played around 10 games, we still can't make it shorter than 10 hours to finish. It's the type of game that we plan ahead and prepare a whole day to play through. But then each game leaves a lot of memories and stories to tell afterwards when we reminisce even years after. One of the games I keep returning to on regular basis in spite of how hard it is to get enough people to spend their whole Saturday on it.",
    "timestamp": 1756591200
  },
  {
    "username": "Killi",
    "rating": 9.0,
    "comment": "I got late onto the Twilight Imperium hype train. Having that said, it was my best board game experience of 2025.\nI played it at 4p and was still the longest board game I played, but it is so engaging you don't realize how fast time flies.\nI recommend you play with people who you really enjoy playing games.\n\nThis might change to a 10 once I play a 2nd or 3rd time, and see it at different player counts such as 5p and 6p.\n\nThe only CON I have is that it is very difficult to table because of its duration, but the duration itself for me it is not bad, at least with this game.\n\nThis game may very well be in my TOP3 and I just don't want to admit it yet.",
    "timestamp": 1756504800
  },
  {
    "username": "Patoani",
    "rating": 9.0,
    "comment": "Still learning... A behemoth of a game, but definitely see why it is considered a classic",
    "timestamp": 1755640800
  },
  {
    "username": "Redd85",
    "rating": 9.0,
    "comment": "my first play of this was with 6 players a long time ago and I got completely out of the game due to my incompetence and I say there for hours and disliked the experience. But wanted to give it another try with a group I am closer with so I bought it. Played my first game with two other players to learn the game again. I had a blast. It really is a great game of you are invested in what everyone is doing. But it long and exhausting. My body was drained from all the calculations even at six hours. Look forward to teaching a few other people then coming together for a six player game eventually.",
    "timestamp": 1755208800
  },
  {
    "username": "genma101",
    "rating": 9.0,
    "comment": "Wish I could get enough time and players for the game",
    "timestamp": 1755122400
  },
  {
    "username": "Steezish",
    "rating": 8.5,
    "comment": "2/10/25: I love negotiation and table-talk, which this has in spades. I also feel like there is so much room to learn new strategies and approaches. We will see if this game falls down the list due to lack of play in the future.\n\n6/2/25: Had my second play of TI4 on 5/31/25. I almost won the game but another player did some great wheeling and dealing to setup a sneaky victory which was cool. I am left a little colder after my second playthrough. I do really enjoy the game but I am left wondering if I would rather play different games during an 8 hour stretch rather than TI4. I feel like all of my decisions matter (even if you do not realize it until 4 hours later), the asymmetric factions all play different, plenty of room for negotiation / trading.",
    "timestamp": 1755036000
  },
  {
    "username": "eddieb",
    "rating": 9.0,
    "comment": "Where are my expansions?!?!\nI got them. Felt like a lot of money for very little. Still love the game. But we are paying for stuff they designed 10 years ago. Where is the expansion with stuff that didnt already exist for TI3\n\nLowering my rating. This game has lost it's luster. I'm 400 into components, game, and expansions. And I still need more stuff to make it easily playable, since i dont have an octagon shaped six foot diameter table, with a 75 inch pc monitor to display the extra stuff. Wish it had new stuff instead of just upgrading old expansions.\n\na year later- dropping rating again. IT's a 4x game without any real choices. Basically try and make it look like you are doing horrible. Hide your real intentions. Lie, cheat, steal. And cut your friends out at the worst possible moment. Sucks for friendships. I've played like 30 times. So the luster is gone.",
    "timestamp": 1754690400
  },
  {
    "username": "hannibal555",
    "rating": 9.0,
    "comment": "Complex and long though the rules are very intuitive.\nImmensely fun!",
    "timestamp": 1754604000
  },
  {
    "username": "wackywester",
    "rating": 10.0,
    "comment": "Amazing game! Highly recommended for anyone who is willing spend the day playing",
    "timestamp": 1762681380
  },
  {
    "username": "SukiyakiGaSuki",
    "rating": 10.0,
    "comment": "Probably logged more than 20 plays than I wrote here, but I don't have the exact dates. From November 8th, 2025 all plays were including Thunder's Edge.",
    "timestamp": 1762663440
  },
  {
    "username": "fstfst",
    "rating": 10.0,
    "comment": "+Prophecy of Kings\n+Thunder's Edge\n+Codices",
    "timestamp": 1762470000
  },
  {
    "username": "Dusty27",
    "rating": 9.6,
    "comment": "An epic game of epic portions! Streamlined and ready to rock! I Got 18 games in a 9 month span in 2018! Did four games in five days playing TI4 everyday of it! Played a 14 pointer in 3.5 hours with a seasoned table. This game is so good, I spent 40 hours building a complete insert set for ease of setup. Looking forward to building a new score board after Thunder's Edge drops.\n\nThe support this game gets with 6 different digital clients, 2 official tabletop expansions, and 2 dedicated podcasts is spectacular!",
    "timestamp": 1762383600
  },
  {
    "username": "CazKcatta",
    "rating": 10.0,
    "comment": "By far the game I spend the most time anticipating every play through this amazing space epic! Every single game comes with unexpected surprises, nail biting suspense, jump from the table excitement, and a vigorous debate over who will reign supreme ruler of the galaxy. From the very diverse factions, well planned action cards, to the amazing armada of printed miniatures, this game does not miss a beat in design or possibilities.\n\nHighly recommend as the best board game in existence IF you are into booking an entire evening (or day if learning how to play) to come around a table with friends and good food, leaving with memories that last a lifetime.",
    "timestamp": 1762297200
  },
  {
    "username": "LeonOrsoGufo",
    "rating": 10.0,
    "comment": "Top",
    "timestamp": 1762124400
  },
  {
    "username": "Zronos3008",
    "rating": 9.5,
    "comment": "Torto",
    "timestamp": 1762124400
  },
  {
    "username": "Drift Dragon",
    "rating": 10.0,
    "comment": "The best 4X game ever made. Every game is extremely memorable. I love that each game also ends up having a built in history. The things you did 2 or 3 hours ago will affect your reputation now, and the alliance you really need might not happen because you backstabbed someone earlier. Once you've played once, you've probably spent 8+ hours dealing with the rules, and now you know them pretty well, so you later games are way easier to play. There's also a frequently forgotten rules list on the sub reddit for this game that I reference each time we play, that helps a lot. I only found two flaws with this game:\n\nFirst, exploration felt weak if you don't draft the planet setup, which we never do. We want to get to building armies ASAP. Second, there's only one type of ground unit, which was disappointing. The expansion fixed both of these things and added more interesting things as well.\n\nI wish I could play more, it's always worth it.",
    "timestamp": 1761865200
  },
  {
    "username": "Evertore",
    "rating": 10.0,
    "comment": "sleeved + insert tbp",
    "timestamp": 1761519600
  },
  {
    "username": "Ryyva",
    "rating": 10.0,
    "comment": "-1 for the high price.\n-1 for the space lion on the cover (Tigers rule, lions drool).\n+100,000,000 for the memory of each of the little space fish murdered in an unprovoked Saar bombing of Resculon. May your spirits rest easy knowing you've been avenged with a space fish danger egg o7",
    "timestamp": 1761343200
  },
  {
    "username": "Freydey",
    "rating": 10.0,
    "comment": "3-6 Versus",
    "timestamp": 1761343200
  },
  {
    "username": "BlackOutBoss99",
    "rating": 10.0,
    "comment": "Absolute cinema",
    "timestamp": 1761343200
  },
  {
    "username": "wiim",
    "rating": 9.8,
    "comment": "Played all races by now, some of them more than once. Still love this game. Such an experience.\n\nYes it does take a day to play, but it never feels like you're 'just waiting'. There's always something to think about, to discuss, ...\n\nIt's amazing how such a long game will so often stay tense to the end. It can drag a little from time to time at the very end, but just when it's about to drag too much the game ends.",
    "timestamp": 1761170400
  },
  {
    "username": "renegade6184",
    "rating": 10.0,
    "comment": "Amazing!",
    "timestamp": 1760565600
  },
  {
    "username": "Atrockice",
    "rating": 10.0,
    "comment": "Best game I've ever played.",
    "timestamp": 1760306400
  },
  {
    "username": "Zimmel24",
    "rating": 10.0,
    "comment": "Great game in a new shape",
    "timestamp": 1760047200
  },
  {
    "username": "Sketcherrrr",
    "rating": 10.0,
    "comment": "I found this game to be more straightforward than its reputation lead me to believe. It's long, heavy, and full a table hog. However, it's created some incredibly memorable gaming sessions.\n\nAnd as much as I don't like dice driven combat (Root is the rare exception), the flow of combat, modifiers, and epic fleets make up for it.",
    "timestamp": 1759960800
  },
  {
    "username": "Sillion",
    "rating": 10.0,
    "comment": "I love this game with my 2 Galactic Events:\n\"Capital Ships\" and \"Tech Progression\"\n----------------------- Capital Ships ---------------------------------\n“If it looks heavy, it should feel heavy. ~ Heavy on it.“\nAll capital ships gain a shield this game:\n- Flagships have 4 shield points.\n- War Suns, Dreadnoughts, Carriers have 2 shield points.\n- Cruisers have 1 shield point.\n\nFlagships and Dreadnoughts roll 1 additional die each round in combat.\nLocal PDS participates in each round of combat instead of rolling space cannon before combat.\n\nUse small cubes or markers to track each ships shield points.\nWhen a capital ship gets hit put a shield marker next to it.\nWhen a capital ship gets a hit beyond its shield points flip it over if it has sustain damage or destroy it like in the original rules.\n\nWhen you would use an ability that repairs a ship during combat instead remove a shield marker if it is not flipped over. After combat remove all shield makers.\n\nWhen you produce fighters or infantry you can produce 2 for one production point.\n--------------------------- Tech Progression -----------------------------\n“All your tech are belong to us.\nYou have no chance to survive make your tech. “ \nEvery player starts their rounds with researching an extra tech.\nOn round 1 you can research tech with 0 prerequisites this way.\nOn round 2 you can research tech with 1 prerequisites or lower.\nOn round 3 you can research tech with 2 prerequisites or lower.\nOn round 4 you can research tech with 3 prerequisites or lower.\nOn round 5 and onwards you can research tech the another factions has already researched.",
    "timestamp": 1759788000
  },
  {
    "username": "amusedleg",
    "rating": 10.0,
    "comment": "As good as advertised.\n\nIt is impossible at this stage of my life to see how I can ever play this again. But I cherish my memories of the times I was able. Every second was fabulous.",
    "timestamp": 1759701600
  },
  {
    "username": "DesignXception",
    "rating": 10.0,
    "comment": "Includes expansions.",
    "timestamp": 1759528800
  },
  {
    "username": "dj_koen",
    "rating": 10.0,
    "comment": "peak",
    "timestamp": 1759442400
  },
  {
    "username": "elqueaprende",
    "rating": 9.9,
    "comment": "+LA PROFECÍA DE LOS REYES\n+CODEX I\n+CODEX II\n+CODEX III\n-----------------------------------\nIt´s so epic...",
    "timestamp": 1759356000
  },
  {
    "username": "Schenke9497",
    "rating": 10.0,
    "comment": "I'm very fond of the diplomatic option to the game, being able to broker deals with my neighbors. The POK expansion, as well as the Codex additions were very worth the investment.",
    "timestamp": 1759269600
  },
  {
    "username": "Ironclad_Board_Gamer",
    "rating": 10.0,
    "comment": "Epic!! No other game has the depth across so many domains as this one",
    "timestamp": 1759010400
  },
  {
    "username": "rose0043",
    "rating": 10.0,
    "comment": "Bought at target in there buy a toy/game for 30% off came to $95 with free shipping.",
    "timestamp": 1758924000
  },
  {
    "username": "toorwell",
    "rating": 10.0,
    "comment": "My favorite game, yet.",
    "timestamp": 1758924000
  },
  {
    "username": "Mightsrain",
    "rating": 10.0,
    "comment": "Played with POK and codices",
    "timestamp": 1758664800
  },
  {
    "username": "Nasark74",
    "rating": 10.0,
    "comment": "Getting it to the table is insanely hard, but my fav board game when able to pull it off.",
    "timestamp": 1758405600
  },
  {
    "username": "mjhm",
    "rating": 10.0,
    "comment": "in wpg",
    "timestamp": 1758319200
  },
  {
    "username": "Boardvadda",
    "rating": 10.0,
    "comment": "+Prophezeihung\n+Play Mat",
    "timestamp": 1757800800
  },
  {
    "username": "fragia",
    "rating": 10.0,
    "comment": "Shared with Lorenzo and Matteo",
    "timestamp": 1757714400
  },
  {
    "username": "Imhov",
    "rating": 9.5,
    "comment": "Yes, the game is long. But spending the time is totaly worth it! The degree of interaction is amazing. The downtime is fine since you often can use the secondary ability of other players during their turns. And the split between VP and war makes the game feel less punishing than other games.",
    "timestamp": 1757282400
  },
  {
    "username": "DaitanKoba",
    "rating": 10.0,
    "comment": "With POK as good as these types of games can get as a boardgame. If you can commit to a game like that it is the shit. Can not wait for the next expansion",
    "timestamp": 1756850400
  },
  {
    "username": "Orsovico",
    "rating": 9.5,
    "comment": "Takes a huge amount of time but it's worth it, it's my favorite game",
    "timestamp": 1756850400
  },
  {
    "username": "Doneldragon",
    "rating": 10.0,
    "comment": "Simply the best game",
    "timestamp": 1756764000
  },
  {
    "username": "HeyBigGuy",
    "rating": 10.0,
    "comment": "My favorite game, always improved with the expansions as well. My one complaint is only that it's hard to get a group together to play it regularly but anytime I can I will.",
    "timestamp": 1756764000
  },
  {
    "username": "ryanjohnpeterson",
    "rating": 10.0,
    "comment": "Increased rating to 10 with multiple plays.\n\nA truly amazing game.",
    "timestamp": 1756677600
  }
]