[
  {
    "username": "lililililil",
    "rating": 1.0,
    "comment": "Limited player variance",
    "timestamp": 1747432800
  },
  {
    "username": "Aquoionjoue",
    "rating": 1.0,
    "comment": "Je ne vais pas m'étendre, mais Sleeping Gods est sans doute le jeu que j'ai le plus détesté de toute ma vie. Beaucoup trop gros, beaucoup trop long, mal écrit, inutilement complexe, ce jeu est un livre dont vous êtes le héros prétentieux et ridicule.\nUne étoile pour les illustrations et le système des combats qui étaient sympa, mais le reste ne vaut pas un clou.\nRevendu illico presto.",
    "timestamp": 1737932400
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "Well, I didn't like the efficiency puzzle that much, it's really solitaire divided up into several players. As a campaign went on, it became less tedious because there were many options available. I did like the story stuff, and how there's not enough time to see everything, but it feels like that's the hook to get multiple plays out of this. To OPTIMIZE.\n\nI think I did ultimately enjoy this, but that's in spite of all its flaws, and all that euro stuff I'm not into. It's a cool book bolted on to a too-complicated game, and I wonder why I'm not just doing the \"interactive book\" half. On a computer of course, they obviously don't print many of these anymore.",
    "timestamp": 1732230000
  },
  {
    "username": "Pandemify",
    "rating": 1.0,
    "comment": "1 Star for Schwerkraft Verlag ! 150€ is a fucking Joke :-D and 7 or 8 Stars for the Game! Aweful Publisher !!! For all the germans: Buy the english Version ! Take a Dictionary and learn better english an a great game at the same time  AND save 50-70€ Euros. Well you get the fucking same game and can buy some more Games, Expansions or save it  Boykott the worst Publisher in Germany !!",
    "timestamp": 1685829600
  },
  {
    "username": "vorakesh",
    "rating": 1.0,
    "comment": "From what I saw online: With tons of unintuitive symbols on cards and board and no text, the game is unplayable for me.",
    "timestamp": 1675465200
  },
  {
    "username": "Hokiechica3",
    "rating": 1.0,
    "comment": "Combat is just sooooooo very tedious. A painful slog of bad game mechanics and plodding non-sensical battles that ruins the beautiful storytelling and artwork of the game. I don't know that I have ever been so bored or disappointed with a game.",
    "timestamp": 1655071200
  },
  {
    "username": "NoxMortem",
    "rating": 1.0,
    "comment": "Started wonderful... but oh boy, did we hate the last 2 days finishing the campaign. It was just an unpleasureful grind, prolonged unnecessarily.",
    "timestamp": 1644188400
  },
  {
    "username": "Derkleineprinz",
    "rating": 1.0,
    "comment": "The biggest disappointment of 2021 for now. Extremely boring gameplay, the game doesn't encourage you to explore, even the story not interesting enough to make me continue playing... I really hoped I would like it and gave it several tries, but nope \n\nUpd. The quality of the expansions content made me really hate this game.",
    "timestamp": 1624917600
  },
  {
    "username": "daddylonglegs86",
    "rating": 2.0,
    "comment": "i dont even feel like its a game. More of a story telling simulation",
    "timestamp": 1753135200
  },
  {
    "username": "ourmove123",
    "rating": 2.0,
    "comment": "# Newer thoughts:\n\n- The campaign game had a lot of manual upkeep, which at first felt a bit overwhelming, and eventually felt overly repetitive.\n- Decisions often didn’t feel impactful or engaging.\n- Combat lacked excitement and didn’t feel as dynamic/interesting as expected.\n- After playing the game, I cannot think of any fun moments.\n\n# Older thoughts:\n\nSo far, an excellent narrative and exploration game.\n\nSomewhat tricky to get started.\n\nThe difficulty seems pretty high, especially while just starting.\n\nThe ability to choose what you can do is VERY refreshing in a tabletop narrative-based game.\n\nThe exploration potential seems very high in this game, and I'm looking forward to exploring more.\n\nI find the theme good so far, and the artwork is bordering okay and good.",
    "timestamp": 1741388400
  },
  {
    "username": "Mamjor",
    "rating": 2.0,
    "comment": "Super mauvais à quasiment tous les niveaux, à l'exception du système de combat qui est plutôt amusant, et des illustrations qui sont potables. Pour le reste, c'est un des pires jeux auxquels j'aie joué de toute ma vie. Inutilement et ridiculement compliqué, prend une place abominable sur la table, horriblement mal écrit, tant par la cohérence des actions proposées que par le style littéraire en lui-même qui n'est même pas digne d'une rédaction de CE2. Et puis ce système de jetons commandement... une hérésie, une bêtise totale. Pour utiliser vos jumelles, par exemple, il vous faudra placer dessus un de ces fameux jetons commandement. Bon. Mais si d'aventure vous vouliez les utiliser à nouveau au cours de votre journée, vous devriez d'abord enlever le jeton commandement qui s'y trouve, afin de pouvoir en placer un nouveau. Or une telle action (retirer les jetons commandement) n'est possible (dans le meilleur des cas) qu'une fois par jour, lors de la phase du bateau... Bref, ne comptez pas utiliser vos jumelles l'après-midi si vous les avez déjà utilisées le matin, parce que c'est bien connu, les jumelles, ça doit se reposer au moins 24 heures entre deux utilisations. Et après ça, je lis que ce jeu est un sommet de jeu immersif...\n\nGoogle trad : Super bad on almost every level, with the exception of the combat system which is rather fun, and the illustrations which are drinkable. Overall, it's one of the worst games I've ever played in my life. Uselessly and ridiculously complicated, takes up an abominable place on the table, horribly poorly written, both in terms of the coherence of the proposed actions and the literary style itself which is not even worthy of a CE2 essay. And then this system of command tokens... heresy, total stupidity. To use your binoculars, for example, you will need to place one of these famous command tokens on them. Good. But if by chance you wanted to use them again during your day, you should first remove the command token that is there, so that you can place a new one. However, such an action (removing command tokens) is only possible (in the best case scenario) once per day, during the boat phase... In short, don't plan to use your binoculars in the afternoon if you have already used them in the morning, because it is well known, binoculars must rest for at least 24 hours between two uses. And after that, I read that this game is a pinnacle of immersive gaming...",
    "timestamp": 1735858800
  },
  {
    "username": "sethcandle",
    "rating": 2.0,
    "comment": "[ overview]\nChoose your own adventure co-op.\nMechanics suck the juice out of the game, fiddly (get items to heal to get command to get items to heal) and the story isn’t engaging, much much too random.\n\n[gameplay]\n\nThe admin/upkeep phases I are just too fussy, too many circular mechanics that just are not fun.\n\nEach player turn goes in 3 phases.\n[1.]Do a ship action, which the rules for are very unintuitivlly written, which might do something like give you three command and draw an ability, if you want to equip the ability it might cost you 2 command, so you net gained 1.\n[2. ]Draw an event (which is also the round counter). Event cards often make you do a challenge action or pass and take damage, so you just retake the damage you just healed or fatigue at least two crew to pass.\n[3. ]Finally, finally, you get to do two actions, mostly travel via ship or cyoa at a location. So you travel to get to a location, but guess what you almost always have to pass trough rough seas, which means another challenge, which means either take more damage or fatigue at least two crew to pass.\nSo you finally get to read a page from the story now right? Which often involve two or three more challenges, you feel already on your knees health wise before been the meat of the game, and as most of the stories are random to start, you might get a dead end and go back to [1.]\nIt make take 2 or three locations before you pick up an ongoing story, meaning you have done 5-7 challenges before it stops being just random location guesses, and that chain might only go on for 3 locations then back to guessing. It takes awhile to get any good items or recipes, which will be very random based on market draws or random location picks, which also burns an action, so you have to go through the whole [1-3 ] again,, and hope you picked the random locations that gave you money!\nBut you also need to find those weapons and defense items or combat will be impossible, even early combat I ended up with mobs doing [ 6-11 ]damage a round, with the characters having a measly 6 health, crew were passed out all the time, so more turns traveling to port to heal, hope you have the money to heal!\n\nYou just get stuck in damage/upkeep loops with one bad turn.\n\n[combat]\nSimplely not fun, you are too weak, it doesn’t feel balanced or skillful. Combat doesn’t happen often, but when it does you are walloped. It takes too many turns to find decent weapons, and even then half or more of the crew will pass out every combat. You get counter attacked each attack, plus a full monster attack at each round,\nYou can get xp and lvl, but it takes a long time to get any xp, and then you need to burn yet another travel action and a port action to lvl up, then go through [1-3] again and the lvl up cards are very weak, most of them are not very better then the ability card, xp feels like another pointless mechanic.\n\n[story]\nThis is what this game is all about right? Choose your own adventure co-op. But the story just isn’t very good. Mixed up mother goose crossed with Greek fables (oh a labyrinth with a monster at the end?)\nYou each play several characters so you never really feel connected to your ship crew. The story threads are random.\nBurn 2 turns to Go to new map, let’s go to the port town, get a quest for “special rocks” “somewhere to the west of the island” burn 2-4 turns travel to the locations on the west, 2-3 are dead ends, one gives you “special rocks” “take Rocks to the south” burn turns going south, 2-3 locations are dead ends, one gives you the ending for special rocks “thank you, here is a totem” quest ends. Repeat this process 6 times, opps you are out of game turns!, read the end game, end the game with 6 totems, have that ending.\nMost of the quests feel disjointed like this. The game try’s to build up the story a little, but the time in between makes you stop caring about the on going plots.\n\n[other thoughts]\nA lot of people praise the art, but there is very little art in the game, just the cards and the map pages. Goody picture of a soup bowl for a heal item, or picture of a sword for the weapon. The map pages are not special. I really don’t get where “good art” is coming from.",
    "timestamp": 1723672800
  },
  {
    "username": "loioiol",
    "rating": 2.0,
    "comment": "Strongly Punitive games are not for me",
    "timestamp": 1720389600
  },
  {
    "username": "Ragge1",
    "rating": 2.0,
    "comment": "Till Dubbelnisse.",
    "timestamp": 1713564000
  },
  {
    "username": "ryanespin",
    "rating": 1.9,
    "comment": "I really disliked this \"game\". A lot of interesting ideas, but feels like a big mess. Combat is long and arduous, majority of the game is just a grind, and I never got into the story.",
    "timestamp": 1707260400
  },
  {
    "username": "smagman1991",
    "rating": 2.0,
    "comment": "A very big letdown for a game which I followed for years in development.\n\nThere are numerous rules issues, which I am so surprised is hardly mentioned in reviews of this game. We couldn't play anymore because my head was constantly in the rulebook trying to read between the lines. When I have to make my own rules for a game it's 1. taxing, and 2. not what I paid for. The fatigue mechanic is the biggest pain in the you-know-what I've ever had the displeasure of dealing with in a board game.\n\nThe art is beautiful, the scope is impressive.\n\nFor an immersive Red Raven game, I'd choose Near and Far instead, and for a co-operative story builder, I'd go with Arkham Horror LCG.",
    "timestamp": 1696802400
  },
  {
    "username": "Ephorus",
    "rating": 3.0,
    "comment": "What I dislike:\n- This probably should have been a video game, but I'm amazed how the designer pulled this off, kudos! Still, this is not the experience I'm seeking when playing board games.",
    "timestamp": 1762038000
  },
  {
    "username": "GuySamstag",
    "rating": 3.0,
    "comment": "Is it just me or do these modern hybrid choose-your-own-adventure games always have mediocre-to-terrible writing? I'm not too familiar with the forebearer genre, maybe they've always been like that? Like I wouldn't read this crap out of my own volition normally, but if you decide to play this you basically just signed yourself up for some failed novelist's pulp, and will have to, for all those intermissions, sit through a not insignificant amount of truly painful \"proses\", inbetween the almost equally intolerable gameplay.",
    "timestamp": 1759269600
  },
  {
    "username": "CombineCR",
    "rating": 3.0,
    "comment": "German edition: NOT recommended, very bad translation, very bad AI generated scenario texts. Misleading translations everywhere.\nEvents and event cards are absolute boring and unnecessary, resource draining. No possibility of gaining resources apart from a tiny ship action that gives 1 gold at max (weapons cost 10+). Events just add nothing to the game.",
    "timestamp": 1757196000
  },
  {
    "username": "ReddBear",
    "rating": 3.0,
    "comment": "I'd prefer a book",
    "timestamp": 1754690400
  },
  {
    "username": "Arnar146",
    "rating": 3.0,
    "comment": "Gulli",
    "timestamp": 1754431200
  },
  {
    "username": "Sir_Harris",
    "rating": 3.0,
    "comment": "Let me start off by mentioning that this game was not for me or my partner, but could very well be right for you! We prefer more detailed, in-depth role play esc campaigns.\n\nI was thoroughly excited for sleeping gods for a couple months before we bought it, but upon playing a couple of games we noticed how stale the loop felt and how disconnected we were from the world. This is my third campaign board game played, the others being Tainted Grail and Arkham Horror. Comparing Sleeping Gods ability to entice you into the story to the other two mentioned, its night and day. I felt like I was playing the characters, and I was living in the moments for the other two games. With Sleeping Gods, it almost felt lazy and rushed their descriptions and often rather bizarre. The introduction, although a very nice way to teach you roughly how the game is played, rushed its story so quickly that you barely had time to breath. It had the potential to have a real enjoyable story, with rich detail and intriguing game play but in my opinion fails at every hurdle.\n\nAs mentioned prior, this could very well be your type of game. There are difficulties to make it harder or easier if you'd like, but the loop itself left little to no interest to us in something we would be sitting down to play for another hour or so more.",
    "timestamp": 1753999200
  },
  {
    "username": "that_guy001",
    "rating": 3.0,
    "comment": "Way too many tests for my liking. Story bits are well written, but not worth the trouble of having to go through three tests to read a couple of sentences and so many things to track.",
    "timestamp": 1752530400
  },
  {
    "username": "Bongo_clive",
    "rating": 3.0,
    "comment": "It's not a very good adventure, it's not a fluid game.\n\nLike a lot of dungeon crawler type games, it bogs down to mathematical, mechanical grind.\n\nDid not enjoy at all",
    "timestamp": 1742943600
  },
  {
    "username": "Mamiebudo",
    "rating": 4.0,
    "comment": "Appreciate lots of people like this, but it's really not my cup of tea.",
    "timestamp": 1759010400
  },
  {
    "username": "KageSasurai",
    "rating": 3.5,
    "comment": "So I really hope that Laukat's normally wonderful art and world building can save this kludge of a game, or maybe it just gets better as you play it more, I don't know. This strikes me as one of those things that should have been a video game or app, the systems are kludgey and there is excessive bookkeeping and tokens and doesn't make sense in a board game. I am generally against app-assisted game, but this one sorely needs one.\n\nIt has the distinct honor of being a deep long campaign game with 1000+ individual components that not only has the worst guide I've ever seen for a \"quickstart\" (It quite poorly teaches you 3 of about 12 mechanics you need to know, and glosses over 2 more) but it also tells you to incorrectly search for \"quest cards\" when what you actually want to start the game are \"market\" cards. Searching for those cards in the wrong deck (the one the guide instructs you too search in) will reveal spoilers. The guide to organizing the massive amount of components is equally terrible, this game suffers from \"first time kickstarter-itis\" which is entirely unacceptable from a veteran company like Red Raven.\n\nIf you read this before playing, for the love of all that is holy do not believe the F#$%ng quickstart guide and read the rulebook first.\n\nEdit: I tried very hard to like this game, but as much as the world is amazing, neither my wife nor myself could tolerate the game that was attached to the exploration, so it was sold.",
    "timestamp": 1754085600
  },
  {
    "username": "wiim",
    "rating": 4.0,
    "comment": "I'd definitely try it again with 2 players; might change my grade a lot. Especially if we can leave the game on the table between sessions and we can have long sessions.\nAt this point though, I played with 3 and a little later even 4. It was SUCH a drag: too many unclear fiddly rules, hard to agree on what to do (as you often have no indication how a choice will turn out .. so how do you then do that with 4 people?) ... was not my thing in the setting/group I played in at all. The rest of the group didn't seem to enjoy it that much either as we never finished the campaign (but did get close).",
    "timestamp": 1749592800
  },
  {
    "username": "NathanFarthing",
    "rating": 4.0,
    "comment": "Only played once, but the awful tutorial sapped the enthusiasm I had going into Sleeping Gods and the next couple of hours did little to arrest that feeling of disappointment.\n\nIt's pretty on the surface and it's the kind of product that's certainly *someone's* favourite game, but I found the mechanics sorely lacking (and fiddly) and the world wasn't really interesting enough to me personally to keep me hooked. The exploration seems like it has potential, but when the game centres around a horribly dry 'skill check' mechanic, it's just not what I'm looking for in a game.\n\nI get the impression Sleeping Gods is the type of game that will inevitably get a little better, but not enough for me to consider giving it another go. I don't understand the hype.",
    "timestamp": 1738623600
  },
  {
    "username": "dr glaze et al",
    "rating": 4.0,
    "comment": "A clumsy rip-off of the more elegant 7th Continent. Slow, fiddly, and repetitive.",
    "timestamp": 1737154800
  },
  {
    "username": "Sharzadee",
    "rating": 4.0,
    "comment": "Kickstarter Edition. Traded away, not our cuppa tea.",
    "timestamp": 1735426800
  },
  {
    "username": "NordRunner",
    "rating": 4.0,
    "comment": "Couldnt get on with the fighting system but it deserves another try avoiding trouble.",
    "timestamp": 1733266800
  },
  {
    "username": "lorax21",
    "rating": 4.0,
    "comment": "Fantasy themed game [ordinarily a minus for me], by Ryan Laukat [ordinarily a big plus]. A lot of work has obviously gone into the choose-your-adventure book.\n\nComponents: nice art, as to be expected, but shuffling is too difficult for some items [the fate cards are too small, the food tokens are round and rigid].\n\nDesign: the number of elements is overwhelming [health, fatigue, damage, command tokens, umpteen special powers spread across different characters,...]. Yet it's easy to control them by following rote procedures such as 'visit the galley to pick up more command tokens and heal a wound'. To what end, though? The adventure book dictates the important outcomes. For me, the game feels like perpetual lather, rinse, repeat, without strategic depth. Although immersive while I am engaged in the administrative minutiae, ultimately the whole enterprise seems pointless.\n\nFor a 2p game, each player controls 5 crew members. So you don't identify with any one character in the story. Perhaps the game would work better if you controlled only one character.\n\nPS: set-up and tear-down are chores, magnified by the campaign nature of the game [where game settings must be preserved from one session to another].",
    "timestamp": 1720821600
  },
  {
    "username": "krivichzm",
    "rating": 5.0,
    "comment": "That was not good experience. The game presents itself as adventure, but requires weird resource management in a form of puzzle, fills the table with cards we don't need most of the time. Battles are unthematic and simplistic puzzles as well.",
    "timestamp": 1761084000
  },
  {
    "username": "adamscott",
    "rating": 5.0,
    "comment": "After trying it out on TTS, I won't be rushing out to get a copy. I appreciate the passion that went into this, but I found the combat tedious and the writing bland.",
    "timestamp": 1760824800
  },
  {
    "username": "willbeplayin",
    "rating": 5.0,
    "comment": "Yet another disappointment from Laukat. Rulebook leaves a lot to desire and the general gameplay feels quite empty. Also there's something about the writing that feels weird. The choice of words and pacing, I can't quite put my finger on it. Also some of the choices feel as if I had no choice or that I didn't get what I chose etc.\n\nI've played Near and Far and enjoyed that one just slightly more than this. We also have Above and Below since my partner is a fan of these games. I keep paddling on because I enjoy my time when she's enjoying the game so much, she's the only reason I do keep playing these. \n\nJust hoping it gets better as we get more familiar with the game but after first 6hrs, I'm not convinced. Laukat could benefit from partnership with another designer/publisher that could write better rulebooks and enhance the gameplay in general in the future. There's almost 500 threads about rules which says it all.",
    "timestamp": 1760565600
  },
  {
    "username": "ianwolfgang",
    "rating": 5.0,
    "comment": "50",
    "timestamp": 1754690400
  },
  {
    "username": "sykano",
    "rating": 5.2,
    "comment": "story-driven (-> don't like that)\n\nbut I guess it's one of the best story-driven games",
    "timestamp": 1754344800
  },
  {
    "username": "frankqb",
    "rating": 5.0,
    "comment": "The story has some interesting elements about the mystery of the world, and I like feeling like\nI'm in charge of where I go and what I do, but all this is bogged down by a system that does nothing but wear you down constantly and force you to be in a constant state of brokenness. Once you see the gears running over you for no reason other than to slow you down and force you to not do what you want, it gets a little tiresome. Still, I love the art, the combat is kind of nice, and the attempt is admirable.",
    "timestamp": 1753912800
  },
  {
    "username": "Jiefu",
    "rating": 5.0,
    "comment": "First play impressions was a Terrific game. Stunning art. But somehow I could not be bothered playing it again. Tried, but seems like following a procedure. Dunno why.",
    "timestamp": 1751752800
  },
  {
    "username": "Ghost CoD",
    "rating": 5.0,
    "comment": "I see why people are loving this game, but it didn't click with me (too much bookkeeping for too little exploration for my taste). The rating reflect my personal taste, not the game design",
    "timestamp": 1746741600
  },
  {
    "username": "Bybbax",
    "rating": 5.0,
    "comment": "I liked the idea, bought it, but found myself absolutly not interested after 1 session. Sold it.",
    "timestamp": 1745964000
  },
  {
    "username": "capcapoho",
    "rating": 5.0,
    "comment": "Was a bit disappointing - the 'adventure' boils down to a series of combats, which isn't what I expected or hoped for.",
    "timestamp": 1742511600
  },
  {
    "username": "meshnaster",
    "rating": 5.0,
    "comment": "It's a decent adventure brought down by too much gaminess. They put tedious optimization puzzles in a choose your own adventure book. The art is nice, the graphic design is poor, it is far too fiddly for what it does, the story tidbits are fun, and the game part of it is incredibly boring, which makes the whole experience frustrating rather than fun.",
    "timestamp": 1742166000
  },
  {
    "username": "Ternal2",
    "rating": 5.0,
    "comment": "I8",
    "timestamp": 1741734000
  },
  {
    "username": "Addiction2k",
    "rating": 5.0,
    "comment": "Only a two hour session in and o don’t love it so far. I don’t feel very involved just yet, we’ll see how it goes. When i say I'm not involved yet this seems to be a narrative game but I don't appreciate how the narrative started. Like it's uneven (can't say more without spoilers.\n\nI'll wait and see how ti goes.",
    "timestamp": 1740438000
  },
  {
    "username": "Tygrone",
    "rating": 5.0,
    "comment": "Just one play in - don't know if i'll return for more:\n\nCombat is a puzzle of \"who-has-the-least-damage and can take a counter-attack\"? Feels already like a grind. Some turns are easy & straightforward... Other turns seem to take forever.\n\nHave yet to see how characters evolve with XP - but they look boring/bland.\n\nThe story seems well-written.",
    "timestamp": 1740351600
  },
  {
    "username": "Daziel",
    "rating": 5.0,
    "comment": "I really thought I would enjoy this more - all of the mechanics just seem to be there to slow down what is a rather shallow story with a myriad of side fetch quests. Once you click with the mechanics challenges and combat become more of a chore than a challenge.",
    "timestamp": 1739574000
  },
  {
    "username": "cenealon",
    "rating": 5.0,
    "comment": "2024 First Impressions\n2024 New-to-Me Games Ranked",
    "timestamp": 1735686000
  },
  {
    "username": "Erikk78",
    "rating": 6.1,
    "comment": "I understand this is a good game, but it just doesn't pull me in. I just never play it and choose other game over this every time.",
    "timestamp": 1762038000
  },
  {
    "username": "Sirius8",
    "rating": 6.0,
    "comment": "Too cumbersome and slow in gameplay. Not at all caught by the story. I guess that boardgames with a lot of reading in a book is to slow/uninteresting for me. Also to many charcters to really get engaged with the characters and the story.",
    "timestamp": 1761343200
  },
  {
    "username": "tasskaff",
    "rating": 6.0,
    "comment": "Not so bad, maybe a bit of bland writing. And massive table hog",
    "timestamp": 1761256800
  },
  {
    "username": "Argand",
    "rating": 6.0,
    "comment": "Me gusta el concepto de aventura-exploración del juego, no me gusta el combate. Mucha gestión de eventos y cansancio para lo que da, se me están quitando las ganar de continuar la campaña. Le tenía muchas ganas e ilusión, creo que no iré a por las expansiones.",
    "timestamp": 1759528800
  },
  {
    "username": "Pelle0809",
    "rating": 6.0,
    "comment": "Liked the world and story, but the fight and ship mechanics felt lacking.",
    "timestamp": 1759356000
  },
  {
    "username": "Dampfhammer",
    "rating": 5.5,
    "comment": "Langatmig und im Ergebnis dann unbefriedigend. Da hilft die schöne Welt leider nicht.",
    "timestamp": 1757023200
  },
  {
    "username": "Entropology",
    "rating": 6.0,
    "comment": "Lovely blend of art, story and open world adventuring. The game clock is just about perfect. The rule book is good, but has a couple of silly omissions that require BGG forum checks. I think I would prefer a few less characters, it's a lot to manage 9 constantly and there is definitely a diminishing return aspect going on there. Finally, I really appreciate the choice/challenge mechanism. You very rarely lose story due to bad luck or failed challenges. That significantly reduces the motivation to 'cheat' when you get 10 steps into a plot and draw a 1. You don't lose everything, just take a health/sanity/supplies knock and move on. That alone makes me want to return to this world.",
    "timestamp": 1756245600
  },
  {
    "username": "WeberGaming",
    "rating": 6.0,
    "comment": "Played once with some friends (4 of us). Sleeping Gods should be everything I want in a game. It’s gorgeous, great narratives and a world I really really want to explore.\n\nHowever, it has a lot of components and things to set up, taking a lot of time. Once we were set up, it took a while to understand all the rules, the combat and how to play. The narrative was by far the best part. However combat seemed extremely challenging and quite clunky. It felt like quite a lot of upkeep and admin to explore. No doubt you’d get into a better rhythm of this.\n\nThis definitely feels like a game made for one or two players. After 3 and a bit hours we hadn’t even made it to ‘my turn’ (after set up, rules, etc.). Not that that is a major issue - this is a coop game where it’s really just making decisions as a group. With that in mind you’d really want a dedicated table to leave it set up to play through the campaign. In that lens I could imagine this bumping in rating quickly. However, as it stands, it’s hard to see it hitting the table in our group when there are so many other great 4 player games out there that can hit the table quicker.",
    "timestamp": 1755468000
  },
  {
    "username": "ditterio",
    "rating": 6.0,
    "comment": "I really hated this game. I don't like story games and if you remove the story in this game, there was nothing exciting left for me.",
    "timestamp": 1755208800
  },
  {
    "username": "IAMCACKIMON",
    "rating": 6.0,
    "comment": "Didnt care for it. Will play again for the sake of others. I might have really liked this back as a teenager hanging out with friends. This was more of a narrative experience with occasional combat or decision making events. Not my sort of game now as an adult with less time on my hands and wanted something crunchier and strategic. I could see some people liking it.\n\nI also didnt like the art at all and found it a major turn off.",
    "timestamp": 1753826400
  },
  {
    "username": "SaltedPork",
    "rating": 6.0,
    "comment": "Like a video game but its a board game",
    "timestamp": 1752184800
  },
  {
    "username": "LePijdu14",
    "rating": 6.0,
    "comment": "Clairement pas un indispensable, peu de stratégie, peu de chance, des choix et des multiples options.\n\nJe conseille le jeu comme accompagnement à des soirées de discussion autour d’une tasse de thé.\n\nLe jeu est sympathique dans ces conditions mais rien d’exigeant. Au contraire les règles floues permettent un certain laxisme et la liberté d’interprétation.",
    "timestamp": 1745704800
  },
  {
    "username": "Vladi4ka24",
    "rating": 6.0,
    "comment": "Отличная игра с книгой приключений - думали мы. Будем играть с детьми по вечерам и читать им истории - думали мы. На деле же она требует очень много времени на партию. Но что больше всего отталкивает, это игра за нескольких персонажей одновременно. Совершенно не ассоциируешь себя с героями, они словно болванчики, которых не жалко и оттого за них не переживаешь. А истории и правда интересные. Надеюсь ее усовершенствуют.",
    "timestamp": 1745359200
  },
  {
    "username": "Tsaar",
    "rating": 6.0,
    "comment": "Underwhelmed. There is not really a developing plot, it’s a meandering story that simply goes on and on. You meet people, the want something from you for which you have to visit another location. There are enemies you must fight against. After the win you gain money, stuff and experience. At markets you buy weapons, in harbors you exchange experience for personal skills. It’s not bad, but not good either.\n\nThe amount of stuff on the table is massive and to keep track of the growing amount of missions and action cards is not easy. The book is nice and big, but I can’t help seeing outcomes of choices that still have to be made because they are right under the multiple choice question. Spoilers.\n\nSo, will I keep it? Maybe. We’ve put away everything in order to pick up where we left, but if we won’t continue in the next six months, it’s better to let this one go.\n\nDutch edition (Keep Exploring Games, 2022) along with both expansions, battle mat, 4 promo cards and metal coins. Wonderful quality of it all.\nEverything fits in the base game box.",
    "timestamp": 1744495200
  },
  {
    "username": "NielosNl",
    "rating": 6.0,
    "comment": "P-2-Solo-3",
    "timestamp": 1743458400
  },
  {
    "username": "Aratar",
    "rating": 6.0,
    "comment": "The game as described in the rulebook I would rate a 5. But when played with a few tweaks, among other things reading the consequences before choosing an option, I would rate it a 7. I guess I prefer games that have a main storyline.",
    "timestamp": 1740351600
  },
  {
    "username": "Sk84lyph",
    "rating": 7.0,
    "comment": "With dungeon expansion",
    "timestamp": 1762628460
  },
  {
    "username": "Citadel",
    "rating": 7.0,
    "comment": "Well done coop adventure game. Art, world design, writing and voice acting (in the app) are excellent and evocative. Combat system is interesting. Doesn’t deal with the alpha player problem in coops. Need to play more to see how good gameplay is over a whole campaign.\n\nUpdate: Finished a campaign in 7 3-hour sessions. It’s got the “Choose Your Own Adventure” style of other adventure games where you can’t tell if an encounter will be positive or negative. The game is against a timer so the negative waste your time and resources: resources which took time to acquire. Combat was often rewarding but took an excessive (tedious) amount of time to recover from. Though you essentially level up during the campaign to improve your recovery time. The combat mechanics were fun and interesting.\n\nI’m settling on a 7 after the campaign, in terms of desire to play again, though I think it might have been an 8 for that first campaign.",
    "timestamp": 1762470000
  },
  {
    "username": "korosuuu",
    "rating": 7.0,
    "comment": "102€\n???",
    "timestamp": 1762383600
  },
  {
    "username": "Minh_Nguyen",
    "rating": 7.0,
    "comment": "I had a lot of fun with my one session of this with Sam. But he seemed to not enjoy it quite as much, which is a bit of a shame as I kind of bought this for us to play together since he was previously super excited about the game. Where does that leave me. I can try to keep playing with Sam, or reset it and play it with Matt, or play it with Skylar (who also owns it and also has reservations about the game as a design), or I can play it true solo.",
    "timestamp": 1761606000
  },
  {
    "username": "BrutusA",
    "rating": 7.0,
    "comment": "Aesthetic: 1\nMechanism: 2\nInvolvement/length/fluid: 2\nReplayability: 1\nOther: 1",
    "timestamp": 1761519600
  },
  {
    "username": "Iraperkins82",
    "rating": 6.7,
    "comment": "8/10: Really great game, almost always keeping. I may not suggest it all the time, but will never turn down a game.\n\nHopefully this will be the first CYOA that I get through almost all the content for! Such a good game if you have the time and table space.",
    "timestamp": 1761343200
  },
  {
    "username": "oidvoda",
    "rating": 7.0,
    "comment": "Abenteuerspiel\nSpiel des Monats von Chris",
    "timestamp": 1761343200
  },
  {
    "username": "DSC14",
    "rating": 7.0,
    "comment": "Interesting adventure game which I wanted to like more.",
    "timestamp": 1760997600
  },
  {
    "username": "Papinek",
    "rating": 7.9,
    "comment": "Extraordinaire ! Never boring, even after the sixth campaign ! Extremly difficult for the cortex to navigate the best way ! Always exciting ! Omlude's crystal is too strong ! The only shortcoming : the extension is almost superfluous !\nNot interactive with the main game and the appendix arcade ( kid modus ) is not corresponding to the demands ! Too expensive and only to sqeeze money out of me",
    "timestamp": 1762597800
  },
  {
    "username": "chimp82x",
    "rating": 8.0,
    "comment": "Purchased from The Gamer's Table\nOctober 2025\nPurchase Price = CA$120",
    "timestamp": 1762297200
  },
  {
    "username": "Hgogro",
    "rating": 8.0,
    "comment": "9",
    "timestamp": 1762038000
  },
  {
    "username": "kevinn94",
    "rating": 8.0,
    "comment": "Campaign met Tim B",
    "timestamp": 1761343200
  },
  {
    "username": "Tintinbas",
    "rating": 7.5,
    "comment": "Great sandbox, played the campaign multiple times. But a lot of characters with abilities to track and combat was ok.",
    "timestamp": 1760824800
  },
  {
    "username": "halaszkiraly",
    "rating": 8.0,
    "comment": "Ryan Laukat",
    "timestamp": 1760824800
  },
  {
    "username": "Ridd3r",
    "rating": 8.0,
    "comment": "Good game, good story. Don't think it has a lot of replayability after you've completed the campaign once though (personal opinion).",
    "timestamp": 1760738400
  },
  {
    "username": "lethan",
    "rating": 8.0,
    "comment": "Sold",
    "timestamp": 1760652000
  },
  {
    "username": "Lindemann08",
    "rating": 9.0,
    "comment": "En solo",
    "timestamp": 1762631160
  },
  {
    "username": "1ngu",
    "rating": 8.5,
    "comment": "Incl. Tides of ruin",
    "timestamp": 1762470000
  },
  {
    "username": "AdalynIris",
    "rating": 9.3,
    "comment": "Great game. It is what I would have always loved the “choose your own adventure” books to be. You explore and keep unlocking the different pieces of the story. At the same time, you have to struggle to survive in a hostile world, getting tired and fighting with monsters. I am not fond of combats in this kind of games, but fortunately, here combat is only occasionally happening and it is not the typical throw dice, but, on the contrary, it requires some strategy.\nI guess that once you know the story is not replayable. However, there are plenty of hours and several campaigns before that happens.",
    "timestamp": 1762038000
  },
  {
    "username": "ithinkimasofa",
    "rating": 9.4,
    "comment": "really great narrative chose your own adventure kind of journey. only played solo and that is just fine with me. absolutely loved this. took it up to a cabin and played a great campaign over 2 days. amazing!!",
    "timestamp": 1761429600
  },
  {
    "username": "deekerston",
    "rating": 9.0,
    "comment": "max 4 best 1-2",
    "timestamp": 1760738400
  },
  {
    "username": "magioria",
    "rating": 9.0,
    "comment": "The best campaign game ever created",
    "timestamp": 1760479200
  },
  {
    "username": "Ghosting49er",
    "rating": 9.0,
    "comment": "A massive campaign based story driven adventure game with so many thing to do and places to go.",
    "timestamp": 1760479200
  },
  {
    "username": "globetrotter",
    "rating": 9.0,
    "comment": "Amazing game with a vast area to explore.\nAfter 3 sessions taking 24 hours, we only was in a small part of the world.\nI'm looking forward to explore this world.",
    "timestamp": 1759183200
  },
  {
    "username": "clawp1995",
    "rating": 10.0,
    "comment": "3D Insert\nSleeve Kings - \"WOTR\" Card Sleeves (110) - SKS8814 70 x 120\nMayday - Euro (100) - MDG7028 59 x 92\nMayday - Mini Euro (100) - MDG7035 45 x 68",
    "timestamp": 1761951600
  },
  {
    "username": "Link66",
    "rating": 10.0,
    "comment": "One playthrough, I enjoyed it a lot. Feels like I have seen only half of the locations. I will certainly play it at least a second time",
    "timestamp": 1761951600
  },
  {
    "username": "Nonoku",
    "rating": 9.5,
    "comment": "1-4 B: 2\nW: 3.24",
    "timestamp": 1761606000
  },
  {
    "username": "Marksify",
    "rating": 10.0,
    "comment": "its a long game and some of the challenges get really hard. but despite that, its stunning the game play is perfect and its such an enjoyable experience. i dont recommend 4 players but 2 is just perfect",
    "timestamp": 1760565600
  },
  {
    "username": "Kendosan",
    "rating": 9.5,
    "comment": "An amazing and versatile narrative experience with gargantuan scope to re-explore. Played as solo.",
    "timestamp": 1760565600
  },
  {
    "username": "Edu207",
    "rating": 10.0,
    "comment": "My favorite game so far. I loved the idea of exploring a open world map and meet places and on every place something different are occurring.\n\nBut, take care, its a really long game, and the savegame has a long setup. So, its better to keep this on the table.\n\nAnd oh, works better solo, then 2 players and then 4 players (too long and sometimes on your turn you just move your ship without making a fun thing).\n\nAnd i really recommend Fartelle narration, makes your journey way more immersive and fun. For exemple: i take a diferent choice on a story because the \"talking tree\" voice's was too cute to cut the flower of the tree.",
    "timestamp": 1759701600
  },
  {
    "username": "Smeckle_Smeagol",
    "rating": 10.0,
    "comment": "You really get the feeling of adventure",
    "timestamp": 1757887200
  },
  {
    "username": "Flejano",
    "rating": 9.8,
    "comment": "Only played one campain so far, but this game is amazing. I love the \"choose your own adventure\" vibe it has. It's certainly one of my top 5 games. The only con is that it takes quite a long time to finnish just one campain.",
    "timestamp": 1757455200
  }
]