[
  {
    "username": "BlueMoon618",
    "rating": 1.0,
    "comment": "Bought in 2015",
    "timestamp": 1755640800
  },
  {
    "username": "hildrethjack73",
    "rating": 1.0,
    "comment": "Game great Cmon customer service terrible",
    "timestamp": 1748642400
  },
  {
    "username": "darkfinale",
    "rating": 1.0,
    "comment": "Cards seem overpowered. Not really my type, will not be playing again.",
    "timestamp": 1744495200
  },
  {
    "username": "Farstar84",
    "rating": 1.0,
    "comment": "terrible game, totally unbalanced, if you start somewhat not good you'll be watching the other playing without any possibility to recover, runaway leader huge problem, totally random cards, the gods are an awful addon. How is possible that this game has 7.9???",
    "timestamp": 1742511600
  },
  {
    "username": "dontnickme",
    "rating": 1.0,
    "comment": "Imbalanced cards and horrible run away leader problem. Game rewards people who sit back and just wait for for others to spend all their rage. There's no actual combat strategy in this at all!",
    "timestamp": 1741129200
  },
  {
    "username": "XxFieryFirexX",
    "rating": 1.0,
    "comment": "Not a man baby. I own the game but am disgusted of Eric",
    "timestamp": 1729720800
  },
  {
    "username": "Hineni17",
    "rating": 1.0,
    "comment": "Run away leader syndrome. Nice figures doesn't fix imbalance of random cards.",
    "timestamp": 1708642800
  },
  {
    "username": "Lktictac",
    "rating": 1.0,
    "comment": "Horrible. Lose all your dudes in a fight and its over.",
    "timestamp": 1699916400
  },
  {
    "username": "Greenosaur",
    "rating": 1.0,
    "comment": "TRADED @ BGG\n\nI was not impressed with this game. I never understood the hype and I was personally let down by it.",
    "timestamp": 1685916000
  },
  {
    "username": "JakeDave",
    "rating": 1.0,
    "comment": "Miniature Market Black Friday for $56, $67-ish shipped",
    "timestamp": 1672354800
  },
  {
    "username": "sunyushen",
    "rating": 1.0,
    "comment": "打来打去的，很多时候无非都是在赌而已。",
    "timestamp": 1662242400
  },
  {
    "username": "bartoszq",
    "rating": 1.0,
    "comment": "No idea why this game is so highly rated. The only plus of it is thematic - but balancing makes this literally unplayable.",
    "timestamp": 1661724000
  },
  {
    "username": "funnytortoise",
    "rating": 1.0,
    "comment": "The designer made some unacceptable statements",
    "timestamp": 1649196000
  },
  {
    "username": "cykelmannen",
    "rating": 1.0,
    "comment": "Worst Game ever. Impossible app.",
    "timestamp": 1613948400
  },
  {
    "username": "pupykises",
    "rating": 1.0,
    "comment": "hard to believe how this is anything but the worst to anyone else. playing with toys for no apparent reason. yay? i looked at '1' rating description again:\n\"awful - defies game description\"\nyup. i have rated this 100% correctly. avoid at all costs.",
    "timestamp": 1593813600
  },
  {
    "username": "Sirbenet",
    "rating": 1.0,
    "comment": "This game is shitty",
    "timestamp": 1582326000
  },
  {
    "username": "Peatamclub",
    "rating": 1.0,
    "comment": "the game is has many card to play. but i can't play because not enough the rage",
    "timestamp": 1581375600
  },
  {
    "username": "walladria",
    "rating": 1.0,
    "comment": "Awful treatment of the customer, strongly encourage not to buy a game from CMON",
    "timestamp": 1571522400
  },
  {
    "username": "Infernotez",
    "rating": 1.0,
    "comment": "This is one of those games that completely turn me off. I played it once and I was ok with it, but then I played again and I made a misplay in the first age, I was thrust into last place because of that with no way to do anything to recover.\n\nThe rage mechanic also(plus the fact people can steal rage) completely kills the game for me. It's supposed to be a constraint but it feels more like I'm getting locked into choices because of what can happen in any given age.\n\nIf you are new to this game it can be a miserable experience as anyone with experience has somewhat of a clue what to do and you might not notice how badly they are messing your plan up. In my first game I completely messed up a guys plan by not taking an action which cost him the game(he played optimally otherwise) but since I didn't fight he could not fight and his game was set back big time. It honestly feels worse than monopoly to me and that is my most hated game.\n\nWhen you play with 4-5 people the game gets rather long and it makes me want to just play shorter games with similar player numbers.\n\nI would much rather play games like Bunny Kingdom, Ethnos or 7 wonders which are similar",
    "timestamp": 1545865200
  },
  {
    "username": "Evron",
    "rating": 1.0,
    "comment": "Worst game ever.",
    "timestamp": 1536444000
  },
  {
    "username": "warmachine519",
    "rating": 1.0,
    "comment": "Runaway leader problem. Also very random on the cards you get in the draft each turn. With all the hype I expected more - very disappointing.",
    "timestamp": 1514329200
  },
  {
    "username": "Kadabra911",
    "rating": 1.0,
    "comment": "I played this game once. After the first of 3 rounds, I honestly thought we had the rules incorrect, as the game was so bad that I was certain that we had missed something.\n\nThe only reason this game is rated so well is because of the miniatures. This is the worst game I have ever played within the strategy genre.",
    "timestamp": 1508450400
  },
  {
    "username": "Biscotti",
    "rating": 1.0,
    "comment": "Nothing wrong with game. I'm sure its a splendid affair. However after watching run through and or reading reviews, absolutely no desire to play.",
    "timestamp": 1481238000
  },
  {
    "username": "InfinityReborn",
    "rating": 1.0,
    "comment": "So boring",
    "timestamp": 1476223200
  },
  {
    "username": "alifaith10",
    "rating": 1.0,
    "comment": "This is a broken game. You win this game every time if you get all your players into the Ragnarök and lose the most battles. Winning battles is the worst thing you could do as a Viking Warrior apparently... The theme of the game does not work at all with the mechanics and scoring. I would think that the winner would be the last one standing, but what would I know.",
    "timestamp": 1474495200
  },
  {
    "username": "BlackSerran",
    "rating": 1.0,
    "comment": "Extremely imbalanced abilities, solved lazily with quick fix method of drafting as usual.",
    "timestamp": 1457046000
  },
  {
    "username": "Glanzmuecke",
    "rating": 2.0,
    "comment": "random, no fun",
    "timestamp": 1756332000
  },
  {
    "username": "ourmove123",
    "rating": 2.0,
    "comment": "Seemed promising when learning how to play, but playing with others was a very boring experience. I was in a game with more experience players, and as a beginner, I felt like I stood no chance.\n\nThe options and cards felt boring. The unit placements on the map felt unengaging. The battles were anti-climactic. Knowing what was strong and when to play things were completely unknowable to a newbie.\n\nThe miniatures are okay. The map does not look great. The map actually makes the game feel tiny.\n\nSome cards definitely felt stronger than others.\n\nI felt the game is best appreciated by veterans. However, I felt the game did not have a theme or art style I liked. I can tolerate a Viking theme, but this game just did not do it for me.\n\nAlthough the game appears to be full of intense combat, the actual combat events are lackluster and have no oomph.\n\nNot a game I would seek out to play.\n\nThe game lasted a bit longer than I wanted, especially since I felt clearly in last place when I played against experienced players. I could not find a worthy redeeming aspect.",
    "timestamp": 1747605600
  },
  {
    "username": "Danwarr",
    "rating": 2.0,
    "comment": "***Sell\n\nKind of a weak hybrid drafting and area control game. Sort of incentivizes you to lose more than win combat which I find strange, and the drafting isn't fantastic.\n\nValhalla, Ragnarock, and some crazy awesome minis though.\n\nLoki/10",
    "timestamp": 1740870000
  },
  {
    "username": "CHAOZxf",
    "rating": 2.0,
    "comment": "The rules or regulations of the cards are not well specified or written, they cause conflicts and encourage cheating. Entertaining game but it's not a big deal.\nSaled",
    "timestamp": 1738623600
  },
  {
    "username": "dopebones",
    "rating": 2.0,
    "comment": "Rating after first play highly subject to change. Engine building, synergistic drafting games aren’t really my thing, nor are heavy themes and miniatures, still the gameplay was interesting, clever and seemingly well balanced",
    "timestamp": 1736290800
  },
  {
    "username": "beardandglasses",
    "rating": 2.0,
    "comment": "Thrift/yard sale find",
    "timestamp": 1736290800
  },
  {
    "username": "BoardGamingCouple",
    "rating": 2.0,
    "comment": "2/5\n\nexpensive game for what it is. the minis are great, but the game relies on a card system to play and win. experienced players dominate newer players. the balance on this game is way off due to broken strategies and poor playtesting.",
    "timestamp": 1735254000
  },
  {
    "username": "tectactoe",
    "rating": 2.0,
    "comment": "I don't generally love area majority (\"dudes on a map\") games (with a few big exceptions), though this had a few mechanics that made it a bit more enjoyable for me. I, for one, like the twist of being able to essentially score points for the number of fighters than end up dead (i.e., \"in Valhalla\"). But at the end of the day, it's still very much an area majority game that didn't totally resonate with me.",
    "timestamp": 1733785200
  },
  {
    "username": "AdmiralCrunch",
    "rating": 2.0,
    "comment": "Not worth the time or effort",
    "timestamp": 1729893600
  },
  {
    "username": "smurfodeth",
    "rating": 2.0,
    "comment": "At this point, I just don’t understand the lasting appeal of this game. Mechanically, it’s a weak closed drafting game of dubious balance and even more dubious fun. Sure, the dolls are nice, but the game around the dolls is a dull affair. I recently got suckered into a play after a long absence, and spent the entire time wishing I were doing something else. From now on, it’s gonna be a no from me, dawg.",
    "timestamp": 1727647200
  },
  {
    "username": "USSRocker",
    "rating": 1.7,
    "comment": "Completely broken game.\nVery boring draft phase.\nDamaged with \"Take that\".\nYou could be unexpectedly damaged and lose a chance to win in the first round.\nNOTE: It's not a thematic game at all, it is an euro-abstract with a mask of vikings.",
    "timestamp": 1723672800
  },
  {
    "username": "Rowdy99",
    "rating": 2.0,
    "comment": "Huge slashy rng gray plastic cmon jerk off",
    "timestamp": 1710370800
  },
  {
    "username": "Kbjordan",
    "rating": 2.0,
    "comment": "I hate this game.",
    "timestamp": 1706655600
  },
  {
    "username": "Daddy18",
    "rating": 2.0,
    "comment": "Its okay",
    "timestamp": 1705186800
  },
  {
    "username": "CANAS1AN",
    "rating": 2.0,
    "comment": "i don't understand the hype around this game. production is great but the mechanics don't mesh well imo.\n\nthe fact that the drafted cards change each round really hampers the first few plays or if there is a long time between plays. this to me is the sign of a bad game especially because there are not any components for players to build a long term strategy. this game needs player aids similar to those in kemet imo.",
    "timestamp": 1697925600
  },
  {
    "username": "godjan",
    "rating": 2.0,
    "comment": "Played it once with veterans, and on a second-third round realized, that - how many people here noticed - victory is achieved mostly due to drafting overpowered cards over just bad ones. So many pretty miniatures, and whole game is about picking right cards - good choice for 10 year olds to play with pretty toys",
    "timestamp": 1686866400
  },
  {
    "username": "TheLawRT",
    "rating": 2.0,
    "comment": "this is a euro game for exposing workers, it's not area control",
    "timestamp": 1683583200
  },
  {
    "username": "MotherMary",
    "rating": 2.0,
    "comment": "Shiny, little substance. Was told this would be a months game in my group. Barely made it one session. Why are there miniatures? Because you're paying for them.",
    "timestamp": 1682460000
  },
  {
    "username": "whiskeyface",
    "rating": 2.0,
    "comment": "Only played 2 player and it was bad.",
    "timestamp": 1676847600
  },
  {
    "username": "LoanWolf",
    "rating": 2.0,
    "comment": "Absolutely hated it",
    "timestamp": 1668034800
  },
  {
    "username": "Board_All_The_Time",
    "rating": 2.0,
    "comment": "I finished my plays of this game. But I never enjoyed a single moment of them. The Loki strategy is nothing I want anything to do with and Rage theft is a portion of the game I hate. I don't like watching you continue to take your turn with the resources I had build up to be able to do what I needed.",
    "timestamp": 1661292000
  },
  {
    "username": "Simwork",
    "rating": 2.0,
    "comment": "Somewhere between Meh and Hated It. Just another dudes-on-a-map game. Generic circle of \"terrain\" to fight over. Card play makes any kind of planning a fail.",
    "timestamp": 1654466400
  },
  {
    "username": "reyska",
    "rating": 2.0,
    "comment": "The game mechanics are pretty much broken. Some cards are vastly over-powered. Winning battles early gives you a huge advantage and if you lose, there's very little you can do to catch up in later rounds. One of the worst games I've played.",
    "timestamp": 1653084000
  },
  {
    "username": "SasekGKS",
    "rating": 2.0,
    "comment": "Średnio słaba gra.",
    "timestamp": 1652738400
  },
  {
    "username": "zaincmt",
    "rating": 2.0,
    "comment": "Avoid Cmon games. Terrible publisher and also avoid erics games. He was very offensive when met at a con!",
    "timestamp": 1648249200
  },
  {
    "username": "drbobjack",
    "rating": 2.0,
    "comment": "1 demo play, with two rules incorrect (we played that the winner of the battle gets the reward regardless of who initiates the pillage, and without an initial province destroyed) so take it with a grain of salt.\n\nViewed as a thematic game, it very much limits the range of conflict and drama that can actually occur. Very few pieces in each location, all powers are relatively incremental (with exceptions like the giant that kills everyone at his location.) It's a curious choice for what should be The Ultimate in Theme.\n\nAs a strategic game, the card-drafting multiple-path-to-victory doesn't really appeal to me. The connections are fairly obvious (if you get all the points-for-dead-stuff upgrades and the kill-your-own-stuff, you will probably win.) A mix of cards seems a good idea; you don't even have the pleasure of very diverse strategic paths, as would ideally be the case.\n\nI feel it's a hybrid design that takes the worse elements of thematic games (lack of depth, special powers on cards) and strategic (multiple paths to victory, surprisingly low interaction, combo engine pieces).",
    "timestamp": 1643756400
  },
  {
    "username": "macUladh",
    "rating": 3.0,
    "comment": "I love card-driven area control games, heavy conflict and Norse mythology... but I bounced off this one, hard. The game felt hollow, the card play repetitive, the interaction banal. Combat is fundamentally about playing cards to make a bigger number: hardly the stuff of legend. I know there is more scope for clever play than I intuited in my handful of plays, but I simply cannot find the motivation to put the effort into something so bland. I can't help but feel everyone is too busy swooning over miniatures to notice how empty the game is.",
    "timestamp": 1753048800
  },
  {
    "username": "larrydurbin",
    "rating": 3.0,
    "comment": "I played this game thinking I was going to be amazed. Didn't happen. Yes, this game has cool minis, but they come unpainted and detract from gameplay. Dice Tower really pushed this game hard , but gameplay is elementary and common. Nothing original here. If this game came with fully painted miniatures it would increase the fun factor considerably. I bought my like new copy for $30 at a flea market, which seems about right for what you're getting. I think I'll probably give it to my 12 yr old grandson. This game wouldn't make my top 300. Needs another layer of complexity and better components to really make it a decent game. As is, not worth the effort. Update. I sold it and gave my grandson a good game.",
    "timestamp": 1740697200
  },
  {
    "username": "SebWilder",
    "rating": 3.3,
    "comment": "Played Steam version only",
    "timestamp": 1740438000
  },
  {
    "username": "ultimoratio",
    "rating": 3.0,
    "comment": "Update: FEB 2025 - \n\nDespite the noise about how confrontational the game is, the strategy in this game is so linear, edging towards utterly boring. 2 stars.\n\n=======\n\nWeird for a troops-on-a-map to have significant number of decisions that are very solitaire-ish. Indeed a hybrid, but this is leaning a lot on the terrible modern Euro design\n===============\nGreat hybrid game of pure tactical romp! The card drafting is weak, due to how incredibly linear it is. But the overall concoction of this design is fantastic that leads to good gameplay.",
    "timestamp": 1740178800
  },
  {
    "username": "Zerosum",
    "rating": 3.0,
    "comment": "Think I would rather just play Chaos in the Old World for this style of game or Fire & Axe for the theme...",
    "timestamp": 1738364400
  },
  {
    "username": "CoolBumpty",
    "rating": 3.0,
    "comment": "Gift",
    "timestamp": 1735772400
  },
  {
    "username": "btasam",
    "rating": 3.0,
    "comment": "Blood Rage is a game that I really wanted to love, felt destine to love, didn't love and wondered if something was wrong with me. Nope, my friends are wrong. This game is garbage. At best, Blood Rage has been a flaming disappointment and here's why.\n\nIn all of its ball-tickling grandeur, Blood Rage is a construct of stitched together uninteresting subsystems that are primarily driven by an overstretched card drafting mechanic. Perhaps the most obvious is combat which is resolved by an unimaginative card-reveal. This completely subverts the battle driven, glory-seeking theme and reduces it to a game of high card victory point grabbing but only if you win or lose in tandem with what you drafted prior.\n\nDon't get me wrong, if you like planning, drafting and implementing combos within a chaotic context, this game is perfect for you. The BGG meta is certainly filled with combo discussions and critiques.\n\nFor me, Blood Rage is filled with so much action devaluation that I can't even enjoy my own cleverness and the only remedy seems to be playing it more.",
    "timestamp": 1735513200
  },
  {
    "username": "CatContentCreator",
    "rating": 3.0,
    "comment": "In der richtigen Konstellation, und mit einigen Flaschen Met, ist Blood Rage sicherlich ein großartiges Spiel.\n\nMich stört: Fast jedes noch so gut vorbereitete Plünderungs-Vorhaben kann durch eine (oder mehrere) Karte(n) des Gegners zunichte gemacht werden.\n\nDie einzige Möglichkeit hier gewappnet zu sein, ist die Karten der jeweiligen Zeitalter gut zu kennen. Ansonsten wird es auch für gute Verlierer schnell frustrierend! Dies scheinen die Autoren auch durchaus berücksichtigt zu haben: Denn es gibt nicht allzu viele Karten und selbst durch die Erweiterungen scheint hier nichts Wesentliches hinzu gekommen zu sein. Und dennoch:\n\nHabe ich den Elan Blood Rage so oft zu spielen, um den oben geschilderten Sachverhalt abzuschwächen? Nein.\n\nHabe ich diese Dinge wieder vergessen, wenn das Spiel mal drei, vier Monate nicht auf den Tisch kommt (was sehr wahrscheinlich ist)? Ja.\n\nDas Spielbrett sieht furchtbar aus, der Rest geht grafisch in Ordnung.",
    "timestamp": 1734994800
  },
  {
    "username": "iplaybgnaked",
    "rating": 3.0,
    "comment": "A surprisingly solid card drafting game unfortunately held back by awful card balance that requires all players to be very experienced with the game to self-correct the balance issues by metagaming the draft, otherwise one player will rocket way ahead of the others. When the stars align and you have the perfect group for it, Blood Rage is actually pretty fun but more often then not the game has played out with a runaway leader that assembled the wombo combo (either via luck of the draw or by other players failing to hate draft them) that's just a dull experience for everyone involved.",
    "timestamp": 1731625200
  },
  {
    "username": "theAliano",
    "rating": 3.0,
    "comment": "My worst gaming experience.\n\nI was so thrilled to test this game; I wanted to buy everything. Then, I played my first game, and I was glad I hadn't bought it. It was really an awful and frustrating game experience, even though the game had everything I like: deckbuilding, minis, area control...\n\nIt didn't work for me. The winner wins by suiciding all their units. You cannot move your boats or giant sea monster; mine was sitting there doing nothing throughout the entire game. And beware, it's not a conquest game; it's an area control game.\n\nPersonally, this board game is my biggest disappointment.",
    "timestamp": 1713304800
  },
  {
    "username": "MrMcGuyver",
    "rating": 3.0,
    "comment": "Upgrade to upgrade your upgrades Rage",
    "timestamp": 1705273200
  },
  {
    "username": "Caballosser",
    "rating": 3.0,
    "comment": "I don't get why people like this. Perhaps the miniatures? Certainly not the gameplay. The cards and battles are way too random.",
    "timestamp": 1703113200
  },
  {
    "username": "meankai",
    "rating": 3.0,
    "comment": "Making one strategy better then all the others made the game only be about \"hate\" drafting which took the fun out of the game.\n\nI find all of the Cool Mini or Not (CMON) games to be unbalanced but this is the one of those I've played I had the least fun with because of it.",
    "timestamp": 1689976800
  },
  {
    "username": "ktedeev",
    "rating": 3.0,
    "comment": "Very random, some strategies cannot be countered.",
    "timestamp": 1688508000
  },
  {
    "username": "John Rogers",
    "rating": 3.0,
    "comment": "Blood Rage scratches an itch I don't have. A game that achieves its design goals quite well yet I care neither for its parts or sum.\n\nI'm not a fan of card drafting, card combos, special powers, or compounding abilities toward bigger badder moves. I find the game is largely about the draft and moving up the 3 tech tracks with the board as a stage for these things to play out. Early scoring is small and secondary to moving up the tracks and gaining upgrades toward bigger scoring opportunities in round 3.\n\nI'd suggest drafting/buying cards Dominion style (the game is essentially deck-building/hand mgt from age-to-age) but I doubt it would significantly alter my feelings. As it is, drafting prevents AP and downtime but at the cost of increased luck into a very significant part of the game.\n\nI understand why it's popular: shiny bits, fantasy theme, euro point maximizer underneath; ultimately a familiar song with a new arrangement. It feels like 7 Wonders and Cosmic Encounter but played out on a board with Viking dudes. I bet the Dice Tower crowd is nuts for this.\n\nA funny aside, despite all the shiny chrome I never really felt the theme. Instead I found it easy to ignore in favor of maximizing points. But hey it's a euro with a lot of chrome.",
    "timestamp": 1680386400
  },
  {
    "username": "JustinRRizzo",
    "rating": 3.0,
    "comment": "I really dislike this game. I don't enjoy hidden information in a game that only lasts a mere 3 rounds. Seems like one failure can be quite costly.\n\nPrefer Bunny Kingdom for a drafting game. Prefer cry havoc for an area control game.",
    "timestamp": 1655762400
  },
  {
    "username": "ashbane",
    "rating": 3.0,
    "comment": "50$",
    "timestamp": 1654639200
  },
  {
    "username": "Mad Hab",
    "rating": 3.0,
    "comment": "Can't mention one thing I enjoyed about this game. Ugly board, prone to snowballing, repetitive as hell... So many better games out there.",
    "timestamp": 1653343200
  },
  {
    "username": "cardbored",
    "rating": 3.0,
    "comment": "Much prefer Rising Sun.",
    "timestamp": 1650837600
  },
  {
    "username": "lynx1998",
    "rating": 3.0,
    "comment": "What is the hype all about? All style and no substance.",
    "timestamp": 1645657200
  },
  {
    "username": "Knalleknarten",
    "rating": 3.0,
    "comment": "Just not a fun game. Had all the expansions even...",
    "timestamp": 1644188400
  },
  {
    "username": "Smoothsmith",
    "rating": 3.0,
    "comment": "Sold - BGG Market\n------------------------------------\nBlood Rage would just be a whole lot more fun if you streamlined out the whole map, area control and actions elements - Victory is 80%+ decided in the draft anyway so why not just make it a pure drafting game instead of wasting half an hour evaluating the draft through other mechanisms.\n------------------------------------",
    "timestamp": 1638918000
  },
  {
    "username": "maktmissbrukare",
    "rating": 3.0,
    "comment": "I got a few more plays of this and I'm just not engaged by it. It's lighter than I expected and the theme is a little off the mark. It's not terrible, but I definitely regret not trying before buying because it's was a little expensive just to realize that it wasn't for me.",
    "timestamp": 1638313200
  },
  {
    "username": "vikingcode",
    "rating": 3.0,
    "comment": "\"It gets better after everybody has played it 5 times\" isn't a great selling point.\n\nCard drafting game disguised as a DOAM/area control game.",
    "timestamp": 1637967600
  },
  {
    "username": "prolestellare",
    "rating": 2.9,
    "comment": "Cards are repetitive, not surprisingly the range of strategies is limited\n\nIn this limited group, the unbalanced suicide strategy makes the others worthless\n\nOverall has no depth",
    "timestamp": 1636585200
  },
  {
    "username": "Elandil84",
    "rating": 3.0,
    "comment": "Good grief, the cards in this game. Throw the whole deck out, try again, and we may have a game then.",
    "timestamp": 1631916000
  },
  {
    "username": "Erundino",
    "rating": 4.0,
    "comment": "The mechanics are clear and simple, but swingness of the game makes me feel I`m loosing time thinking about it.\nNo decision matters that much so , why bother?\n\nJust weak.\nGet your minis out of my face",
    "timestamp": 1755468000
  },
  {
    "username": "SenseiZen",
    "rating": 4.0,
    "comment": "Verkar inte vara så bra / intressant, om man förlorar så är man basically el primo för resten av matchen, väldigt mixade reviews trots att den har en bra rating, potentiellt om man ville kan man ge den en chans men det finns andra spel som hellre förtjänar den tiden",
    "timestamp": 1755295200
  },
  {
    "username": "Mandurang",
    "rating": 4.0,
    "comment": "I might give it another chance, but was quite turned off by it at the first play. Seemed rudimentary and some cards seemed totally imbalanced.",
    "timestamp": 1753912800
  },
  {
    "username": "marriedcouple",
    "rating": 4.0,
    "comment": "It's ok but there are better games out there.",
    "timestamp": 1751752800
  },
  {
    "username": "g4bor",
    "rating": 4.0,
    "comment": "Wow. If there was ever a cookie cutter design, produced and marketed as the coolest DoaM game ever made.\n\nA magyar kiadás is hozzáteszi a magáét, pl. Heimdall's Watch >> Heimdall figyelése. A Heimdall karóráját leszavazták, vagy fel sem merült?",
    "timestamp": 1751493600
  },
  {
    "username": "fatal69250",
    "rating": 4.0,
    "comment": "Card are not very clear, strategy is simple and action limited",
    "timestamp": 1748037600
  },
  {
    "username": "Higgs4047",
    "rating": 3.5,
    "comment": "Pretty complicated to learn! Then short and limited player choices after that. The theme is better than the gameplay.",
    "timestamp": 1746482400
  },
  {
    "username": "Micastiz",
    "rating": 4.0,
    "comment": "To be fair, not my type of game. I did have fun playing it, but I think it was partly the group itself was fun. The card drafting made it more interesting, but pushing your luck in the card draft pays big if you get lucky. In the end, it was just whoever had the last one-up card that prevailed. Nice art, great miniatures, but not enough to want to get it on the table. There are dozens of games I would choose ahead of this one.",
    "timestamp": 1745964000
  },
  {
    "username": "churchb3",
    "rating": 4.0,
    "comment": "Play Inis instead for a better game",
    "timestamp": 1745704800
  },
  {
    "username": "andrewsgame12",
    "rating": 4.0,
    "comment": "There's no denying this game looks awesome! It just falls flat gameplay wise for me. I think the drafting variant improves it but makes the game take longer. I think this one just isn't for me but I respect it.",
    "timestamp": 1745445600
  },
  {
    "username": "PootisRemoved",
    "rating": 4.0,
    "comment": "most overrated game on the site",
    "timestamp": 1717279200
  },
  {
    "username": "davebo",
    "rating": 4.0,
    "comment": "I don't think this game is anywhere near my wheelhouse.",
    "timestamp": 1717192800
  },
  {
    "username": "wallwaster",
    "rating": 4.0,
    "comment": "Very different than CitOW but feels very similar. It's nice that things don't depend on dice but I miss the asymmetry. 7 wonders for ameritrashers I guess.",
    "timestamp": 1715551200
  },
  {
    "username": "trodat123",
    "rating": 4.0,
    "comment": "Interesting game. After a drafting round, you have the opportunity to spend \"rage\" for actions such as occupy a territory or plunder. Winner is the player with the most victory points at the end of the game.\nThe first plays were a lot better but I reckon that the replayability is just not given in this game because it is very obvious that some cards are extremely stronger than other ones. That has the negative effect of predicting the winner of the game.\nAside from that, the game is enjoyable although it is quite repetitive in its actions, in the end there is not much variability.\nAfter all I would still recommend this since I am the only one in my \"gamer circle\" which is fed up with this, the others still enjoy it",
    "timestamp": 1714428000
  },
  {
    "username": "AndrewHoffman",
    "rating": 4.0,
    "comment": "Dudes on a map is not my preferred genre, but I can appreciate what others like about it.",
    "timestamp": 1706482800
  },
  {
    "username": "Clemmensen",
    "rating": 4.0,
    "comment": "In my opinion a very over-hyped game, that I did not enjoy that much. It felt very unbalanced.",
    "timestamp": 1704668400
  },
  {
    "username": "whoolzyourdaddy",
    "rating": 4.0,
    "comment": "2020 Ranking:\n2021 Ranking: 364\n2022 Ranking: 349\n2023 Ranking: 445",
    "timestamp": 1702162800
  },
  {
    "username": "that_guy001",
    "rating": 4.0,
    "comment": "Something about the game feels very forced, which isn't a feeling I get when playing a similar game in Inis.",
    "timestamp": 1698620400
  },
  {
    "username": "koflo1",
    "rating": 4.0,
    "comment": "2-4 (4)",
    "timestamp": 1695938400
  },
  {
    "username": "Citery",
    "rating": 4.0,
    "comment": "Another case of wanting to like it more than I do. What I want is a raucous, stompy conflict game that lives up to a name like \"Blood Rage\", but instead what I got was a dreary euro with a tedious draft, anticlimactic battles, and a lot of heads-down upgrade management.\n\nPeople like to bring up runaway leader problems for games that don't deserve it, but this is a rare exception where I think the critique is justified. There is almost no compensation given to losing armies in regards to board state or action economy, and the winners are unilaterally rewarded with increases in both. Early pillage winners can just feel unstoppable at times. When every player is perfectly checking the power of every other player the system works, but the balance is too delicate.\n\nThe minis also add to the cost but don't add to the game, and the depiction of women in an exclusively female tribe all clad in fur bikinis feels really slimy for a game that came out in 2015. There's no excuse for that kind of stuff anymore.",
    "timestamp": 1693864800
  },
  {
    "username": "gamerdoge",
    "rating": 4.0,
    "comment": "Abstract. pasted on Viking theme. Overhyped with minis.",
    "timestamp": 1689544800
  },
  {
    "username": "ptf666",
    "rating": 4.0,
    "comment": "I am a little bit dissapointed after the first play. It was meant to be quick, but we spent almost 4 hours. It was unclear who the leader is, and the winner was unexpected. Beautiful components - espacially monsters - but the whole game is in my opinion overhyped, not even in the same league with Forbidden Stars or GoT.",
    "timestamp": 1683064800
  },
  {
    "username": "Hoopyy",
    "rating": 4.0,
    "comment": "I don't remember what I didn't like about it, but I remember not liking it. Card drafting is always nice, so its not a complete write off I guess",
    "timestamp": 1676847600
  },
  {
    "username": "tehspookeh",
    "rating": 4.0,
    "comment": "A game where the area control element is irrelevant and the game is decided by who knows the cards best and can hate draft better. I prefer games where you're playing the board state.",
    "timestamp": 1674601200
  },
  {
    "username": "GeneralMarauder",
    "rating": 4.0,
    "comment": "Interesting, thematic and well produced game. There are good game mechanics. Only problem is that the only winning tactics is to lose as many battles as possible as , Loki's and Frigga's blessings are way too powerful compared to other gods and you get to many points from getting in and out of Valhalla. Winning fights gives you much less glory than losing the fights, which is really counter intuitive.",
    "timestamp": 1669503600
  },
  {
    "username": "kyleglyn",
    "rating": 4.0,
    "comment": "4  Nov 2022 - 3 plays\nCard drafting is not my favorite. In Blood Rage, it is the most important part of the game. It is also difficult to know how to draft well until you know the deck well, as is typically the case with the genre. However, Blood Rage is a big enough game that getting to know the deck well will either require some dedicated study, or a lot of time spent playing (poorly).",
    "timestamp": 1667343600
  },
  {
    "username": "Tramba",
    "rating": 5.0,
    "comment": "Zu Zweit absolute Katastrophe nicht zu Empfehlen zu viert Super Klasse",
    "timestamp": 1761519600
  },
  {
    "username": "VibuliusCamilius",
    "rating": 5.2,
    "comment": "Not Interested",
    "timestamp": 1760997600
  },
  {
    "username": "selvalabelva",
    "rating": 5.0,
    "comment": "Brainburn         Longevity    \nLuck impact       Rules/Setup  \nInteraction       Involvement  \n\nAftertaste           Enthusiasm   \n\n Played at 5 player count\n Rating inclusive of expansions gameplay\n Expansions are a plus, not a necessity\n Confrontation: indirect\n\n Tense agonising draft",
    "timestamp": 1757887200
  },
  {
    "username": "Killi",
    "rating": 5.0,
    "comment": "Don't like Lang's games.",
    "timestamp": 1756504800
  },
  {
    "username": "parzi42",
    "rating": 5.0,
    "comment": "dont know if area control is not my thing or just this viking themed game.",
    "timestamp": 1756159200
  },
  {
    "username": "Avid_Equinox",
    "rating": 5.0,
    "comment": "- Needs repeat plays to fully correctly draft and find synergies\n- Map feels quite small\n- Not a bad game but there's definitely better area control games out there.",
    "timestamp": 1756159200
  },
  {
    "username": "mikesanerd",
    "rating": 5.4,
    "comment": "I totally did not \"get\" this game. I felt completely lost throughout my play with no clear idea of what the concept of this game even was. I like a lot of the individual components and mechanisms, but the way it all came together just seemed like a mess to me. I also found there to be too much confrontation and negative interaction with other players for my taste. I did not enjoy myself at all when playing this game.",
    "timestamp": 1755813600
  },
  {
    "username": "TheCrookedMan",
    "rating": 5.0,
    "comment": "Great game, a little expensive, and needlessly plastic. Great nonetheless.",
    "timestamp": 1753308000
  },
  {
    "username": "Dirtnutmeg",
    "rating": 5.0,
    "comment": "Never been huge on area control games. didn't hate it, but it wasn't the best.",
    "timestamp": 1750975200
  },
  {
    "username": "w33t",
    "rating": 5.1,
    "comment": "This is a great game with nice miniatures. Not nice enough that ill probably get to painting any of them other than the monsters though.\n\nLove the card drafting element along with the territory control. Probably would play this over most area control games.",
    "timestamp": 1748383200
  },
  {
    "username": "gram_niebieskim",
    "rating": 5.0,
    "comment": "My BGG:\n10 - excellent game, always have a great time\n7 - enjoyable game, I'm willing to play again\n5 - not bad but it's not my cup of tea\n2 - won't play ever again",
    "timestamp": 1743717600
  },
  {
    "username": "sutrebuh",
    "rating": 5.0,
    "comment": "Lay it on thick! Blood Rage offers drafting followed by combat on nine fields plus 4 fjords. With usual equipment, the game would actually look quite plain. The opulent equipment makes it an eye-catcher, but apart from that (except for the price) it doesn't contribute much, because the game doesn't tell a story. The mechanism itself is quite entertaining: The drafting invites tactical considerations, the combat offers many surprises and there are various ways to victory. Nevertheless, the game sometimes leaves you puzzled: The imponderables seem large and at the same time a lead in rage seems unassailable.",
    "timestamp": 1742079600
  },
  {
    "username": "resonance2k",
    "rating": 5.0,
    "comment": "It's a very rough gameplay and boring.",
    "timestamp": 1741302000
  },
  {
    "username": "mWick5420",
    "rating": 5.0,
    "comment": "My only thought while playing this game is \"Why am I playing this when Inis exists?\"",
    "timestamp": 1740351600
  },
  {
    "username": "RikHavok",
    "rating": 5.0,
    "comment": "2/25 Fully painted. Cards Sleeved.",
    "timestamp": 1740265200
  },
  {
    "username": "Shinkenshi",
    "rating": 5.0,
    "comment": "I've only played once digitally. The card driven gameplay is a lot more euro-y than I expected from a dudes on a map game. I am happy to play it in person to see if it improves my first impression. Drafting against AI is no fun.",
    "timestamp": 1739314800
  },
  {
    "username": "cinnzel",
    "rating": 5.0,
    "comment": "Juego de control de territorios con flamantes miniaturas de plástico en el que no siempre debes ser el más dominante en combate para alzarte con la victoria definitiva. El draft de cada ronda te permitirá elegir qué camino seguir hacia el Valhalla. Para mí, mejor cuantos más jugadores seáis.",
    "timestamp": 1738278000
  },
  {
    "username": "RexSemperAugustus",
    "rating": 5.0,
    "comment": "Steam",
    "timestamp": 1737414000
  },
  {
    "username": "PermaFrost88",
    "rating": 5.0,
    "comment": "7 Wonders meets area control. Although, this is way better due to the lower player count, and memorization is not too much of a headache.\n\nThe downsides to this is the Kemet style battle, too random for my taste.",
    "timestamp": 1736463600
  },
  {
    "username": "Mysq",
    "rating": 5.0,
    "comment": "Miniature figures are okay I guess. Balance is just bad, mechanics also.",
    "timestamp": 1735858800
  },
  {
    "username": "Grobbs",
    "rating": 5.0,
    "comment": "Sell price: $60",
    "timestamp": 1735254000
  },
  {
    "username": "kyhre",
    "rating": 5.0,
    "comment": "Blood rage doesn’t seem like something I would like. The player boards and minor upgrades are something I usually don’t care for, the area control seems uninspired, the drafting here unexciting and on rails, the treatment of nordic heritage is frivilous, ridiculous and kinda fun, the graphics are meh, the miniatures are an obscene extravaganza.\n\nAfter one play at two players I’ve got to admit it was fun and I would not be against playing again.",
    "timestamp": 1733785200
  },
  {
    "username": "RebeGame",
    "rating": 5.0,
    "comment": "+ Mistics of Asgard",
    "timestamp": 1733007600
  },
  {
    "username": "Flow25",
    "rating": 5.0,
    "comment": "Highly overrated.\nIf you think this is a \"dudes on a map\" or thematic game, you are wrong, even though the theme and the absurdly exagurated minis imply that.\nAlso it feels really sterile to play and not thematic at all.\nThe game is just about scoring points over 3 rounds in a deck-/engine building fashion. Could have been set into almost any other setting. If you look below the cover, it is a okayish deckbuilder, but nothing really more.",
    "timestamp": 1730156400
  },
  {
    "username": "skipaoff",
    "rating": 5.0,
    "comment": "сыграл в онлайне - хз супер странно играется как плохой ареа контрол. не понимаю вообще как он так высоко поднялся.",
    "timestamp": 1729893600
  },
  {
    "username": "OldYronsides",
    "rating": 5.0,
    "comment": "2-4p (4)\n60-90m",
    "timestamp": 1729288800
  },
  {
    "username": "MrMonkey",
    "rating": 4.5,
    "comment": "Played it a few times and found it interesting but underwhelming in the end. I was able to win the game, in both cases, by securing one or two zones in different areas and piling up on quests for those areas. I feel like this game could be genuinely great, it feels like Cosmic Encounter where you draft your powers and have alternative point routes, but needs tweaking to make all of those cards and point routes more viable.",
    "timestamp": 1729288800
  },
  {
    "username": "Telaz",
    "rating": 4.5,
    "comment": "My rating(50%): 5\nMy “want to play-again” rating(50%): 4\nMy overall rating: 4.5\nPlays: 1\n\nOwn and prefer Ankh - I don't care for the drafting in this game. Board looks terrible imo.",
    "timestamp": 1729029600
  },
  {
    "username": "Scifi66",
    "rating": 5.0,
    "comment": "Doesn't quite deliver due to random card draw and no real way to hate draft. Minis are excellent and theme is supportive. The expansions tend towards bloat. That said with beer and the right group this can work as a fantasy consim.",
    "timestamp": 1724882400
  },
  {
    "username": "invervegas",
    "rating": 5.0,
    "comment": "Complexity √ - Just not liking the meanness of this game - you can end up with nothing to do/feeling excluded if one player plays a card or action. I don't see how that can be enjoyable...",
    "timestamp": 1724450400
  },
  {
    "username": "Qhorin",
    "rating": 5.0,
    "comment": "Fun theme, but not my style of game. Random cards seem overwhelmingly powerful.",
    "timestamp": 1723154400
  },
  {
    "username": "Smexy217",
    "rating": 5.0,
    "comment": "Pros:\n-Great minifigures\n-Theming is spot-on\n\nCons:\n-Combat is lacking\n-Limited replayability\n\nBlood Rage is a game that didn't quite hit the spot for me. I came in expecting a game much heavier in combat due to it's theme and naming, and the actual combat, while passable, isn't engaging. Most of the dominant strategy revolves more around the cards in your hand or sacrificing your own warriors. I like the drafting mechanic, and the rage limitation makes you really agonize over your decisions. But I still don't find the total gameplay loop super engaging.\nOverall, while I can see the appeal, Blood Rage didn't quite hit the spot for me due to lackluster combat, as well as one or two dominant strategies ruining replayability. I will still play if offered, but not a game I typically look forward to breaking out during game night.",
    "timestamp": 1722117600
  },
  {
    "username": "Vismeep",
    "rating": 5.0,
    "comment": "Simon",
    "timestamp": 1712786400
  },
  {
    "username": "Desigual",
    "rating": 5.0,
    "comment": "You can win by losing battles. It's solid game if everyone is in the same level, otherwise experienced players will have a great advantage.\n\nbest with 4",
    "timestamp": 1712700000
  },
  {
    "username": "simopurgz",
    "rating": 5.0,
    "comment": "Mostly a fun game. The mechanics, however, ensure that most of the time the final scoring is not close at all with a runaway leader becoming apparent after the second round.\nIncludes a terrible scoring mechanic which makes no sense with the theme of the game",
    "timestamp": 1712354400
  },
  {
    "username": "Zalasta",
    "rating": 5.0,
    "comment": "The theme is cool, but honestly I thought the beginning of the game was a lot more interesting than the end. As everyone amass more rage and horns, people can simply flood each province with their own army and pillage without anyone being able to add any units. We also played the no draft version, and by sheer luck I happened to draw a bunch of cards that worked with each other (Loki’s blessing with backstab, eminence and even the glorious death quest). Although I didn’t get to play all of them because someone ended the age prematurely, but I could have finished the round with a lot of points not because I did anything clever. Ultimately I was disappointed by how one dimensional the gameplay is and it is pretty repetitive, upgrade, play quest, pillage and repeat. There really isn’t much here and I’m truly surprised at how highly rated it is.",
    "timestamp": 1708556400
  },
  {
    "username": "berzerk73",
    "rating": 5.0,
    "comment": "The major issue I have with this game is the lack of asymmetry between the viking clans. The good thing about this game is how many different mechanics it blends together. With the right group, it is a gem and leads to some tense moments with the combat cards.",
    "timestamp": 1708297200
  },
  {
    "username": "CotB",
    "rating": 5.0,
    "comment": "Rankings\n19th Best Game 2017\n47th Best Game 2018\n60th Best Game 2019",
    "timestamp": 1704668400
  },
  {
    "username": "MarkyX",
    "rating": 5.0,
    "comment": "An average Dudes-On-The-Map game with lots of playability due to the numerous abilities and monsters to use in the game. It's surprisingly very easy to teach since all the information is both on the cards and playmat. In terms of pacing, it plays pretty quickly since you are able to do only ONE action per turn instead of multiple (more board games need to do this). The game ends shortly after the climax and doesn't overstay its welcome.\n\nHowever, I don't feel the \"need\" to own this game.\n\nThe first glaring problem with the game is the simple fact that you need to know the decks inside out to play at any competent level. Otherwise, the game just feels like you are along for the ride with no real direction to follow. I've seen experienced players take advantage of their neighboring newbies because of newbies didn't realize that passing certain cards to him would just make him powerful.\n\nAnother problem is the numerous effects that make it hard to decipher the game state. Throughout the session, you will encounter card effects that seem to give you points for doing almost random thing such as dying, or other people dying, or losing a fight, etc. Unlike the younger brother Rising Sun, there doesn't seem to be any focus within the game. You have vikings, stuff happens, and you score points. In Rising Sun, while there are effects that give you points, the game still forces everyone to be on the same page about gathering monsters, building strongholds, and taking over areas.\n\nWith all the faults, the game does have sparks in its design. It plays quickly, the downtime is minimal, and it's very easy to comprehend the core basics of the game. Unlike many other games, I feel the expansions like the Mystics and Gods actually hurt the game instead of improving it.",
    "timestamp": 1701903600
  },
  {
    "username": "mirror33",
    "rating": 4.5,
    "comment": "Didn't realize this till I owned a copy, but honestly I'm embarrassed to play a board game with action figures as pawns and while the game/mechanisms are really pretty decent, gameplay is compelling enough and strategic enough to have enjoyed myself, it's not strong enough to transcend my toy aversion.",
    "timestamp": 1701039600
  },
  {
    "username": "Daniel109",
    "rating": 5.0,
    "comment": "Mediocre and overproduced. Play Inis instead.",
    "timestamp": 1698620400
  },
  {
    "username": "Carbonium",
    "rating": 5.0,
    "comment": "Ареакнотрол, похож на иниш и игру престолов, не зашло, но миньки классные",
    "timestamp": 1698098400
  },
  {
    "username": "wanne",
    "rating": 5.0,
    "comment": "ausgeliehen",
    "timestamp": 1698012000
  },
  {
    "username": "Jsheebz",
    "rating": 5.0,
    "comment": "Some people are really into it. It's alright to me, but would rather play something else. Don't play with someone that has played it a lot. You'll get trashed.",
    "timestamp": 1697407200
  },
  {
    "username": "Tygrone",
    "rating": 5.0,
    "comment": "Tried to like this game, but felt very random. Very little you do seem to matter when someone can have a lucky draw in the final draft. This feels like the blue-shell in mariokart",
    "timestamp": 1694556000
  },
  {
    "username": "Severijndw",
    "rating": 5.0,
    "comment": "One play of it thus far. There was something odd about this one. The card you draft matter a lot, but there's not a lot of agency on which ones you'll pick up, and the discarding of cards at the end made it look like the deck isn't very tightly designed.\nDuring the game, some players were essentially forced to win fights which would earn the loser a lot of points and it felt like there was very little the 'winner' could do about it. It was failing to be a good area control game and became more of a card game with a board. In the final round, it didn't feel like there were many interesting decisions being made either.\nThis game definitely felt like it could have used more time for development into a much tighter and engaging game.",
    "timestamp": 1694556000
  },
  {
    "username": "simon1990",
    "rating": 5.0,
    "comment": "Vendu au Bazar 2023",
    "timestamp": 1694556000
  },
  {
    "username": "bsd3959",
    "rating": 5.0,
    "comment": "죽어서 발할라로 갔는데 왜 점수가...",
    "timestamp": 1693000800
  },
  {
    "username": "evenstar7",
    "rating": 5.2,
    "comment": "区域控制游戏。\n不适合二人玩，没有太多落后保护机制。\n卡牌很少联动，需要针对情况选择，需要打印卡表和使用轮抽。",
    "timestamp": 1692136800
  },
  {
    "username": "Miiitra",
    "rating": 5.0,
    "comment": "2 jug - 3 jug - 4 jug",
    "timestamp": 1690668000
  },
  {
    "username": "VovannJenodi",
    "rating": 5.0,
    "comment": "Tried this game once - wasn't impressed at all. Thankfully, I was able to get rid of it at a relatively fair price.",
    "timestamp": 1688421600
  },
  {
    "username": "Shades fan",
    "rating": 5.0,
    "comment": "I love the miniatures and Drafting is always fun but I’m not so happy about how strategies life and die by you knowing the games in’s and outs. Sure it rewards creating a meta around it but forget about teaching a new player to play and not absolutely destroying them. Then when you actually do give the game lots of plays it becomes about hate drafting what cards your opponents need because if you don’t certain strategies can run away with the game. It is a well made game but I think the actual play of it is rather mediocre. Drafting is much better in other games where more complexity in strategies and wider paths to success exist.",
    "timestamp": 1684879200
  },
  {
    "username": "robweg10",
    "rating": 6.0,
    "comment": "Trades with Game Night Kit #1 (NIS)",
    "timestamp": 1762124400
  },
  {
    "username": "elggun",
    "rating": 6.0,
    "comment": "Good game, although very uninteresting for 2 players and when someone takes the lead, defeating them is next to impossible.",
    "timestamp": 1761692400
  },
  {
    "username": "threhane",
    "rating": 6.0,
    "comment": "Good Euro-Ameri hybrid area control game with card drafting/hand management as the main gameplay mechanics.",
    "timestamp": 1761170400
  },
  {
    "username": "ImZhe",
    "rating": 5.5,
    "comment": "Really don't like the swinginess overall, doesn't feel super strategical",
    "timestamp": 1759960800
  },
  {
    "username": "Doverkeen",
    "rating": 6.0,
    "comment": "Great to get on the table, also fun for new players and when not winning.\nSadly the stronger strats are not as strong as the fun ones (winning fights) once the level of play rises and going for Loki to some degree seems obligatory, even if it is just to stop someone to go full on Loki. Therefore I droped my score from 9 to 6.",
    "timestamp": 1759183200
  },
  {
    "username": "lostweets",
    "rating": 6.0,
    "comment": "I like it better than my kids. They seem to prefer to chuck dice for combat. Saving it for a year or two to see if they change their minds.\n\nEdit: some success summer gaming at camp. It is pretty quick. The production is great but not in an expensive way where I would feel bad if the components get a little trashed.",
    "timestamp": 1758924000
  },
  {
    "username": "Dice Mage",
    "rating": 6.0,
    "comment": "1",
    "timestamp": 1758578400
  },
  {
    "username": "Blackhearted89",
    "rating": 6.0,
    "comment": "Plays badly with 2 players. We did not like it.\nI`ll give it another chance with 4 player setup.\nInitial bad gameplay impression doesn`t change the fact that minis in this game are amazing.",
    "timestamp": 1757628000
  },
  {
    "username": "Mnemoidian",
    "rating": 6.0,
    "comment": "The mechanics of Blood Rage are quite interesting and I usually quite enjoy the game when I play it. But after 5 plays (all 4 player games), I find that I tend to leave the table unsatisfied and frustrated.\n\nI think the main issue I have is that there are too few cards - I've seen them all, and they fall a bit too neatly in a few synergistic groups. I think that adding more cards to the total pool (but keeping the number of cards players keep) would really make the game more interesting to me, as you would not know exactly which cards are in play - and there would be a greater chance of \"new\" strategies appearing, rather than different people picking from the 3-4 existing paths every game.\n\nThen again, I've found myself often thinking \"Huh, maybe it's time to give blood rage another go...?\".",
    "timestamp": 1757455200
  },
  {
    "username": "Husman",
    "rating": 6.0,
    "comment": "Box wear; fully sleeved.",
    "timestamp": 1756764000
  },
  {
    "username": "AviYanK",
    "rating": 6.0,
    "comment": "This was my first 'serious game' I bought after Catan.\n\nThe first few plays were really fun, but over time I got tired of it (maybe because it was the only option I had and I just played it too much).\n\nA few things bother me:\n\n'Rage' feels like it runs out way too fast. Every game I feel very limited in how much I can actually do.\n\nI like seeing a board full of miniatures. But because of all the battles, a lot of minis go to Valhalla too quickly, and the board usually feels pretty empty.\n\nMonsters feel not as scary and big as they look.\n\nThree rounds feel a bit short. I’d love to have at least four.\n\nStill, the game is pretty fun and the minis are beautiful (that was honestly the main reason I bought it). I had a really good time with it. Recently I even got nostalgic and played three games in a row with a friend. So I think the real solution is just to buy more games, so there’s always another option and people are more willing to play.",
    "timestamp": 1756764000
  },
  {
    "username": "zabriskie_point",
    "rating": 6.0,
    "comment": "Me agobia que hacer un mal draft te condicione toda una ronda.",
    "timestamp": 1755900000
  },
  {
    "username": "Peekstrom",
    "rating": 6.0,
    "comment": "Played on BGA",
    "timestamp": 1755554400
  },
  {
    "username": "ChaosFarseer",
    "rating": 6.0,
    "comment": "The drafting didn't really work for us. Don't fully remember why or why not; it's been a while.",
    "timestamp": 1754344800
  },
  {
    "username": "BeloW06",
    "rating": 6.0,
    "comment": "Another card combo game with placing figures onto the board where the placement of pieces into areas are less important than the cards you drafted. Knowing the decks is crucial to do well, esp. how the cards from round 3 (unknown to a noob) will work with those from the previous 2 rounds.\n\nIt's not my style of game, so I'm not keen to learn how the cards all work with each other to catch up with players who looped me in scoring.",
    "timestamp": 1753221600
  },
  {
    "username": "umbre",
    "rating": 6.0,
    "comment": "Tried a couple time 2p, did not like it, too swingy, one player can steamroll the other.\nTried once 4p, and it was way better. It is still very swingy, but everyone gets to have some fun somewhere.",
    "timestamp": 1753135200
  },
  {
    "username": "GrimThunderbrew",
    "rating": 6.0,
    "comment": "Update: I would always rather play INIS. Fired.\n\nInteresting. I think I like it better than Kemet, but not sure. Seems like the low number of unique cards might hurt replayability, but won't know for a while. Wish the minis were pre-painted, but no biggie. Look forward to playing it with all correct rules. Turns went pretty quick and we noticed that there was a lot of table talk compared to the next game we played.",
    "timestamp": 1752789600
  },
  {
    "username": "willbeplayin",
    "rating": 6.0,
    "comment": "The only reason this is still in my collection is that this was the first game I ever painted any minis for.",
    "timestamp": 1751839200
  },
  {
    "username": "MichaelaPat",
    "rating": 6.0,
    "comment": "2025",
    "timestamp": 1751407200
  },
  {
    "username": "onceplayed",
    "rating": 6.0,
    "comment": "i feel this needs the right group. the game rewards repeat plays but im not sure if theres enough decision making for me to keep being interested.",
    "timestamp": 1750802400
  },
  {
    "username": "ChrisIsOkay",
    "rating": 6.0,
    "comment": "PC",
    "timestamp": 1750716000
  },
  {
    "username": "Mueckerling",
    "rating": 6.0,
    "comment": "I'm not a fan of the Viking theme and I have my political concerns regarding the popularity of this theme in general, but Blood Rage is nonetheless a fun experience. It's quite abstract and the card drafting seems to be half of the actual game. The following area control half is more like the playing out phase of the drafted cards, which puts an emphasis on strategy, not on tactics. I often find myself not having enough room for reacting to my opponents' actions, which makes it less interactive to me. The drafting phase though is really great. I love the trade offs between unit upgrades, scoring, and battle cards.",
    "timestamp": 1750456800
  },
  {
    "username": "Deltonbrack",
    "rating": 6.0,
    "comment": "Update: Played again after 8 years. It doesn't hold up for me anymore. Rising Sun is still my favorite of the OG CMON line, but Ankh is very good too. Blood Rage is just outdated feeling and needs a rules refresh and some mechanism updates.\n\nOnly got to play this once but really enjoyed it. Had a rules mishap that changes things quite a bit. I'm ready to play again!\n\nOn second play another rules mishap. I skimmed the rules as a refresher and missed some things. Maybe next time I can finally get it right.",
    "timestamp": 1750284000
  },
  {
    "username": "Silberback",
    "rating": 6.0,
    "comment": "Great war game.",
    "timestamp": 1750024800
  },
  {
    "username": "4Corners",
    "rating": 6.0,
    "comment": "Own the Gods of Asgard and the Mystics of Midgard expansions.",
    "timestamp": 1749333600
  },
  {
    "username": "footey1984",
    "rating": 6.0,
    "comment": "Have played 10 or so times. First age is a bit boring and the game is starting to feel same-y. Will still play it every once in a while though.",
    "timestamp": 1749333600
  },
  {
    "username": "all_fiction",
    "rating": 6.0,
    "comment": "The box art and title are misleading, as this game is not nearly as chaotic and all about high-octane fights as its cover may suggest.\nMost likely the only BG I regret buying; while it's not a terrible game per sé playing it against players with different experience levels is not interesting at all, given how crucial knowing combos and the draft phase are. And even when everyone knows what to do it's not something I'd like to play over many other titles",
    "timestamp": 1748901600
  },
  {
    "username": "Grishny",
    "rating": 6.0,
    "comment": "After ten years I've played enough Blood Rage that I feel comfortable commenting on it. This is one of those games that I recognize as good, but the more I play it the less I like it. Part of that is almost certainly the fact that most of the players I know who own it (I traded it) love it and play it so much that they are no longer enjoyable for me to play with. So Blood Rage is game that I unfortunately now actively avoid.",
    "timestamp": 1747605600
  },
  {
    "username": "speter22",
    "rating": 6.0,
    "comment": "Good! A Euro drafting game mixed with an area-control battle to the death (and rebirth, and death, and rebirth, and death...). The drafting wasn't nearly as random as I had feared, and the area control and timing considerations were substantive. Not sure why it didn't click for me 100% - it somehow came together as less than the sum of its parts, for me. It's probably because it's taken in comparison with Inis and Ankh, which have quite a few similarities with this game and are among my all-time favorite area control games.",
    "timestamp": 1746655200
  },
  {
    "username": "Beastly_Venturer",
    "rating": 6.0,
    "comment": "3 plays. This is decent although coming with significant flaws. Luckily these are mostly well known now but was not so much the case early on when the game came out and when I played it.",
    "timestamp": 1744668000
  },
  {
    "username": "Bergonzini",
    "rating": 6.0,
    "comment": "Brutal, es uno de esos juegos que te encanta jugar, con una mecánica sencilla y una magnífica escalabilidad. No le cuesta salir a mesa.",
    "timestamp": 1744408800
  },
  {
    "username": "Plargyplop",
    "rating": 6.0,
    "comment": "I don't know what this game is trying to be. Whatever it thinks it is, it isn't.",
    "timestamp": 1744236000
  },
  {
    "username": "AuroLamda",
    "rating": 6.0,
    "comment": "A great battle!",
    "timestamp": 1743717600
  },
  {
    "username": "asfaloth_glorfindel",
    "rating": 6.0,
    "comment": "Uno de los juegos más sobrevalorados de los últimos años. Aún siendo entretenido, vistoso y a ratos divertido a su manera, me parece que la experiencia desequilibrada y anárquica que ofrece no merece que sea un juego tan cacareado y jugado. Un juego que tiene un ganador por 40 o 50 puntos por delante de los demás por hallar un combo roto o jugar el infame Trono de Odín no puede recibir las críticas positivas que recibe. Por no hablar de que penaliza ir a combates tratándose un juego de vikingos que se supone que vienen a matarse y a inmolarse en el ragnarok. Lo considero el fastfood de los juegos de mesa. La gente lo consume a pesar de saber que es de calidad mediocre por el simple hecho de ser rápido, ágil y tener miniaturas y estética atractiva.",
    "timestamp": 1742079600
  },
  {
    "username": "Phija",
    "rating": 6.0,
    "comment": "Need to play. Slowly slogging through painting the minis.\n\nUPDATE: Minis painted! Now I have no excuse.\n\nUPDATE: Played 3 times with the boys (10 & 9). Doesn't really move me, which is absolutely hilarious considering how long I've owned it.",
    "timestamp": 1741906800
  },
  {
    "username": "Not_People",
    "rating": 6.0,
    "comment": "CMON games don't really seem to do it for us. And area control isn't a favorite of anyone in this house. We tried playing with the teens in the house. The adults picked up the best strategies quick and dominated with their wise drafting picks. Only one of us at the table seemed to be aggressive enough to take the middle ever. The teen in question Rage-Quit after the 3rd game and we haven't touched it since.",
    "timestamp": 1739487600
  },
  {
    "username": "AlexDun",
    "rating": 6.0,
    "comment": "+ 5th Player Expansion\n+ Mystics of Midgard\n+ Wooden box",
    "timestamp": 1738796400
  },
  {
    "username": "Ryokunn",
    "rating": 6.0,
    "comment": "2/8/23- 7.5 initial thoughts rating.\nOne play so far, and really enjoyed it. Mitigating randomness with chaos, to paraphrase what many other reviewers have said. Good fun, and great presentation. But I will need more plays to really get a solid gauge of where this falls.",
    "timestamp": 1736809200
  },
  {
    "username": "jeff_keller",
    "rating": 6.0,
    "comment": "Played this once and did not get it. Got wrecked. Need to play it again.",
    "timestamp": 1734994800
  },
  {
    "username": "tolhs",
    "rating": 5.9,
    "comment": "2024:+1\n\nNotR < 10: 3,4,5\nBest: 4,5\n\ntbp:30-40",
    "timestamp": 1733958000
  },
  {
    "username": "propane train",
    "rating": 6.0,
    "comment": "A war game that has a bit too much randomness that it becomes less about strategy and more about the luck of the draw.",
    "timestamp": 1733439600
  },
  {
    "username": "juuzzom",
    "rating": 6.0,
    "comment": "When looking at EL’s progression I can see something of CitOW and Rising Sun here. Blood Rage is a good game, but it doesn’t quite rise to the spheres of Chaos in the Old World. On the other hand it also doesn’t dive into the torpor of full table Rising Sun. The excellent action point system comes directly from CitOW and as the players are at the start of the clan tracks in the beginning it starts rather interestingly. Even with only three rounds the game however starts to drag a bit towards the end if there is even a hint of AP proneness in the air. I do like the whole Loki concept balancing the game and offering another approach to gaining glory. On the con side the balance is cracking towards the end of the game with huge point swings especially thanks to the clan tracks. The game also suffers from the Langian syndrome of the cool things being the least useful if your aim is to do well.",
    "timestamp": 1733353200
  },
  {
    "username": "Hibou77",
    "rating": 6.0,
    "comment": "The card drafting is well implemented, giving asymmetric powers to every player and every game feels different. High quality miniatures. On the other hand, I dislike the lack of attrition in battles : the winner keeps all his figures, the victory points and the stats increase. The loser loses all of his figures. (Sold to Markey)",
    "timestamp": 1732489200
  },
  {
    "username": "staygeeky",
    "rating": 6.0,
    "comment": "https://youtu.be/2ixsabAukDY",
    "timestamp": 1732402800
  },
  {
    "username": "srsmith93",
    "rating": 6.0,
    "comment": "Sell",
    "timestamp": 1731798000
  },
  {
    "username": "abssalom",
    "rating": 6.0,
    "comment": "Un juego de mayorías y draft con una producción excelente, pero las mecánicas son extremadamente simples, me ha dejado frío siempre que lo he jugado.",
    "timestamp": 1731538800
  },
  {
    "username": "ThinkingThatsAll",
    "rating": 6.2,
    "comment": "Pretty good area control game, though the action economy is too tight in the first round and too loose in later rounds.",
    "timestamp": 1730761200
  },
  {
    "username": "Arkanev",
    "rating": 6.0,
    "comment": "Pas assez joué.",
    "timestamp": 1730674800
  },
  {
    "username": "bjsully6",
    "rating": 6.0,
    "comment": "I generally like this game a lot when I played it. It is a small board so you cannot run and hide here so you must do combat. I have just found other games that I like more than this one now so I cannot rank it as high as I might have when it came out. I would still play it though if it came out.",
    "timestamp": 1730415600
  },
  {
    "username": "pilot",
    "rating": 6.0,
    "comment": "A strange game with quite opaque strategies for newcomer, yet it´s an intriguing game. The battle part reminded me Cosmic Encounter with playing hidden strenghth cards and possible card zapping abilities. Will play again only with other newbs, hehe",
    "timestamp": 1728424800
  },
  {
    "username": "tilikumc",
    "rating": 6.0,
    "comment": "Mari and Dennis own this.",
    "timestamp": 1728424800
  },
  {
    "username": "ObzidiaN",
    "rating": 6.0,
    "comment": "I don't like dudes on a map tbh. Not my fav. genre.",
    "timestamp": 1728252000
  },
  {
    "username": "thermopylai",
    "rating": 7.0,
    "comment": "Played once. Won.",
    "timestamp": 1762693320
  },
  {
    "username": "minitj",
    "rating": 7.0,
    "comment": "1 партия на четверых за 1:50.\nИгра прикольная! С каждой эпохой ваши карты становятся мощнее, сами игроки развиваются и набирают силу, а тем временем поле сужается сподвигая вас к конфликту, но при этом эффекты карт боя\\улучшений сделаны таким образом, что вам даже интересно умирать и получать выгоду! В итоге, никто не боится сражаться, каждый считает себя победителем, тот кто хотел проиграть = проиграл, а второй игрок добился своих целей и получил очки + улучшения и каждый раз выбор вступать в битву или нет, не очевиден, ведь вы хотите ещё исполнить волю богов или сохранить ярость, чтобы перейти в локацию с рагнароком и получить дополнительных очков!\nМне игра понравилась, для закрепления моих впечатлений надо бы сыграть ещё партейку, т.к в этой партии я победил через самую легкую тактику \"Локи\" , мне в каждой эпохе на драфте достались карты, которые дают очки за вернувшихся воинов из Вальгаллы, а потому я был счастлив проигранным битвам и получал много очков, в последнем раунде получил по 6 очков за 7 убитых моих фигурок! = 42 ПО.",
    "timestamp": 1762210800
  },
  {
    "username": "Incredibul",
    "rating": 7.0,
    "comment": "It's a good game, but I feel you can lose the game in Round 1 in a kind of intransparent way. So the easy and lightweight rules are in contrast to having to warn new players. Each rules teach I do basically comes with\n- \"don't play too many expensive upgrades because some Loki Player will kick you out of the round before you did anything\"\n- \"Look out especially if you play with Loki cards to not forget playing your upgrade cards before all Provinces are pillaged\".\n\nBasically, you can lose the game as early as your own turn 3. There is no comeback from not getting any Upgrades in Round 1. With experienced games, you quickly come into a stressful meta game of having to memorize all cards and combos or be crushed from misplays.",
    "timestamp": 1761606000
  },
  {
    "username": "Kaibaman209",
    "rating": 7.0,
    "comment": "want to play more",
    "timestamp": 1761519600
  },
  {
    "username": "LostChord_Mark",
    "rating": 7.0,
    "comment": "3-3-23 $83 KN Added cardboard age track and Valhalla sheet - kickstarter special - Game Steward 11-25-24.\n2025-10-25 SOLD $50 DollarCon",
    "timestamp": 1761429600
  },
  {
    "username": "Auroric",
    "rating": 6.5,
    "comment": "Blood rage is an odd one for me. The design is a cool mix, and games are a great length with endless interaction, which I appreciate. There's a lot of different ways to approach the game, and you're extremely invested in what your opponents are doing. Lots of tension in the action selection as well, making every move count.\n\nIt starts to feel samey pretty quickly to me however. I also find it frustrating to play, because it rewards meta knowledge of the deck so much, and battles never end the way you think they will. Going into a fight with a lot of power for an area you need only to realize that it would have been stronger to lose, or not fight at all, just leaves a sour taste. A war game this is not. It's an intensely chaotic, tactical, point salad drafting game at it's heart, with area control and conflict tacked on as scoring mechanisms. I see why people love it, but it's too swingy, unpredictable, and draft focused for my taste. I also find the board to be very messy. Which does fit with the vibe of the game I suppose.\n\nI always think I'm down to play it again, like there's something I'm just not clicking with, I just never really have the fun I'm hoping for. But sure, let's play again.",
    "timestamp": 1760479200
  },
  {
    "username": "DevOpsProDude",
    "rating": 7.0,
    "comment": "41x63 - 177\n70x120 - 13\n\nPlayed on board game night.",
    "timestamp": 1760047200
  },
  {
    "username": "Sondari_Wobble",
    "rating": 7.0,
    "comment": "2-4 spillere",
    "timestamp": 1759615200
  },
  {
    "username": "mondauge",
    "rating": 7.0,
    "comment": "Would play again but this whole line, and doam games in general, don't do enough for me. (Or too much, really.)",
    "timestamp": 1759442400
  },
  {
    "username": "Ddyraw",
    "rating": 7.0,
    "comment": "Played a few times, and is good, but for a game with this cool of parts, some of the fun factor was missing, not very exciting for a game that looks exciting",
    "timestamp": 1759442400
  },
  {
    "username": "414448",
    "rating": 7.0,
    "comment": "Rating based on a four plays. High tempo, thematic, intuitive!\n\nSold since it never got played.",
    "timestamp": 1759442400
  },
  {
    "username": "Vandsten",
    "rating": 7.0,
    "comment": "w/ all KS expansions",
    "timestamp": 1759356000
  },
  {
    "username": "JPFunbux",
    "rating": 7.0,
    "comment": "A really fun combination of card drafting and area control with cool minis. Watch out for the Loki player.",
    "timestamp": 1758664800
  },
  {
    "username": "Arseny_Vasily",
    "rating": 7.0,
    "comment": "thematic euro on worker placement. deceives expectations due to low conflict, but is unique in its kind",
    "timestamp": 1758319200
  },
  {
    "username": "rafaelpaz",
    "rating": 7.0,
    "comment": "The first game impression was very good, even though I played without draft just to learn. I believe that with draft the game scales to another level, as everything there depends on meticulous planning based on card selection. Eager to play again.",
    "timestamp": 1758232800
  },
  {
    "username": "TheSlushySnake",
    "rating": 7.0,
    "comment": "Viking-Themed, Area Control Game.\n3-4 Players. (Best With 4 Players).",
    "timestamp": 1757541600
  },
  {
    "username": "gizmobj",
    "rating": 7.0,
    "comment": "Wonderful combat game with beautiful miniatures. Wish the cards were a bit bigger.",
    "timestamp": 1757023200
  },
  {
    "username": "Saume",
    "rating": 6.7,
    "comment": "It's a fine area control game. It plays significantly better at 3 or 4. It's not my favorite in the genre, but I like it occasionally. It's fairly light too, easy to learn.\n\nSome of the cards feel overpowered and can lead to a runaway leader.",
    "timestamp": 1756764000
  },
  {
    "username": "Vinnichi",
    "rating": 7.0,
    "comment": "On the morrow he will leave me, as my Hopes have flown before.”\nThen the bird said “Nevermore.”\nE.A. Poe",
    "timestamp": 1756332000
  },
  {
    "username": "LilRed",
    "rating": 7.0,
    "comment": "A weaker version (IMO) of chaos in the old world. But still a good game!",
    "timestamp": 1755900000
  },
  {
    "username": "Marcopolo91",
    "rating": 7.0,
    "comment": "previously owned and played about 7 or 8 times.",
    "timestamp": 1755554400
  },
  {
    "username": "Mr_Weyland",
    "rating": 7.0,
    "comment": "3-5",
    "timestamp": 1755468000
  },
  {
    "username": "serkelion",
    "rating": 7.0,
    "comment": "Nice card-driven light wargame when you can try to win by getting your warriors killed in a blood bath path to Valhalla",
    "timestamp": 1755381600
  },
  {
    "username": "Michalxo",
    "rating": 7.0,
    "comment": "One game only. Almost won by luck (scored 120 points in last round).",
    "timestamp": 1754863200
  },
  {
    "username": "Arnar146",
    "rating": 7.0,
    "comment": "Gulli",
    "timestamp": 1754517600
  },
  {
    "username": "Rasdel",
    "rating": 7.0,
    "comment": "Not what I expected. It seems too overproduced for what it is. It looks like a type of game but plays like another. The decisions and mechanisms are fun and interesting but something feels off when playing and I can't see what it is.",
    "timestamp": 1754172000
  },
  {
    "username": "mrtwopoints",
    "rating": 8.3,
    "comment": "A lot going on here for a game that looks like it does. I have a feeling with more plays it might become more enjoyable.\n\nYup, it does.",
    "timestamp": 1762297200
  },
  {
    "username": "mickhah1",
    "rating": 8.0,
    "comment": "Some useless cards, but overall a nice game.",
    "timestamp": 1762210800
  },
  {
    "username": "lortelars",
    "rating": 8.0,
    "comment": "Very strong Viking and Norse gods theme which I really like, lovely miniatures and good gameplay on the side. I thought I would really love this game but as I now have tried it multiple times (not with expansion yet) I am a bit disappointed, it is still a good game just not completely into my taste. some tactics seem like cheating or exploiting like with the Kraken and the ship tactic that can give you a hell of a lot of points and all around is the Loki tactic the one that has won most of the games that I have played. so a bit unbalanced in that regard.",
    "timestamp": 1762210800
  },
  {
    "username": "Quietchess",
    "rating": 8.0,
    "comment": "Includes 5th Player Expansion",
    "timestamp": 1761606000
  },
  {
    "username": "slp2dream",
    "rating": 8.0,
    "comment": "Painted",
    "timestamp": 1761519600
  },
  {
    "username": "ItsMagic",
    "rating": 8.2,
    "comment": "banishing drafting specializing fantastical unlocking constructing arranging thematic participating combining bluffing expandable;\nInis?? favoured",
    "timestamp": 1760824800
  },
  {
    "username": "yaofengze",
    "rating": 7.8,
    "comment": "（984.22购入880卖出）",
    "timestamp": 1760738400
  },
  {
    "username": "thefatcyclist",
    "rating": 8.0,
    "comment": "***II-5",
    "timestamp": 1760738400
  },
  {
    "username": "StrongbowGold",
    "rating": 8.0,
    "comment": "B-6",
    "timestamp": 1760738400
  },
  {
    "username": "doobot",
    "rating": 8.0,
    "comment": "jedině 5",
    "timestamp": 1760306400
  },
  {
    "username": "igor_f",
    "rating": 8.0,
    "comment": "2-4",
    "timestamp": 1760220000
  },
  {
    "username": "tyroll",
    "rating": 8.2,
    "comment": "Un juego hermoso, de mayorías y conquista de áreas, muy competitivo.Las figuras son geniales para poder pintar.La estrategia está en escoger muy bien las cartas a jugar.",
    "timestamp": 1760133600
  },
  {
    "username": "el_ultimo",
    "rating": 7.5,
    "comment": "Comprado en 2015",
    "timestamp": 1760047200
  },
  {
    "username": "Sitbear",
    "rating": 8.0,
    "comment": "A pretty competent game which takes up quite a lot of space with minis. It's 90+% minis. That being said, the area control and push your luck elements (do you go all in on Yggdrasil, or stay on the perimeter and outlast everyone?) make this a thrilling game to play with others. When you go all in and bust, you knew the risks.\nOn the other hand, the Loki strategy being overpowered is one of the worst parts of the game. The \"win by losing\" strategy being not just viable but so good it's impossible to win without hate drafting just does not sit well with me.",
    "timestamp": 1759960800
  },
  {
    "username": "MoMahili",
    "rating": 8.0,
    "comment": "Keep",
    "timestamp": 1759874400
  },
  {
    "username": "yaenz",
    "rating": 8.0,
    "comment": "Highly Thematic Euro with suspenseful yet straightforward combat. Bluffing and trying to outsmart your opponents is lots of fun. Upgrading your People is enticing and feels different every game. It seems like the overall production suffers a bit from the vast amount of (great) minis and the storage is quite bad.",
    "timestamp": 1759874400
  },
  {
    "username": "Lartasster",
    "rating": 8.0,
    "comment": "With expansion",
    "timestamp": 1759788000
  },
  {
    "username": "Ideology",
    "rating": 7.8,
    "comment": "",
    "timestamp": 1759269600
  },
  {
    "username": "mjacobsca",
    "rating": 8.0,
    "comment": "Cool game. But it stresses me out lol.",
    "timestamp": 1759096800
  },
  {
    "username": "heatbbx",
    "rating": 7.5,
    "comment": "+ 3d Printed Insert\n+ KS Gold Box\n+ Shamans\n+ 5th Player Expansion",
    "timestamp": 1758837600
  },
  {
    "username": "Petersilio",
    "rating": 7.7,
    "comment": "print insert",
    "timestamp": 1758405600
  },
  {
    "username": "shanev316",
    "rating": 8.0,
    "comment": "This is a game I've struggled to rate for a long time. I like all the little pieces of it, the drafting is cool, the minis are awesome, the double-think/bluffing is fun. The best part of the game is the upgrading of your faction and how each player becomes more asymmetric as the game goes on... But it all just comes together and leaves me wanting more. I can't really describe what it is about it, but it just doesn't have life. I'd rather play Inis which allows for more clever play, has more beautiful artwork, and comes together more smoothly.\n\nIdeal Player Count: 4",
    "timestamp": 1757973600
  },
  {
    "username": "tonicamo",
    "rating": 8.0,
    "comment": "2-4 players",
    "timestamp": 1757455200
  },
  {
    "username": "BloodWarlock",
    "rating": 7.9,
    "comment": "+ Blood Rage\n+ Gods of Asgard expansion",
    "timestamp": 1757282400
  },
  {
    "username": "wingeekbrett",
    "rating": 8.0,
    "comment": "65 €",
    "timestamp": 1757282400
  },
  {
    "username": "Drrabbits",
    "rating": 8.0,
    "comment": "SOLD",
    "timestamp": 1756936800
  },
  {
    "username": "ClintAchilles",
    "rating": 9.0,
    "comment": "I think maybe it's lost it's luster over time, but I'm still excited to play it again. The draft is the real game, and the execution of your draft more a followup or implementation of your strategy rather than a tactical decision space. It certainly suffers from a steep experience curve, as someone who has played the game previously will have a distinct advantage over newer players. I've also had perks bounce pretty hard off the game, feeling that certain cards and combinations are overpowered. I can see that, but ultimately it comes down to that draft and whether everyone at the table knows what can and will happen if they let certain cards go around the table. Managing your money/rage level to ensure that you don't action your way out of doing things in your turn is a fun little twist, and gives singer agency on whether timing of certain plays is more important than the quantity of actions in a given turn.\n\nI think it would be best served as a game that is played regularly by the same play group.",
    "timestamp": 1762383600
  },
  {
    "username": "Fleax",
    "rating": 8.5,
    "comment": "kickstarter",
    "timestamp": 1762297200
  },
  {
    "username": "lark23",
    "rating": 8.5,
    "comment": "keep",
    "timestamp": 1762297200
  },
  {
    "username": "WillW97",
    "rating": 8.5,
    "comment": "great gameplay\ndated art",
    "timestamp": 1762297200
  },
  {
    "username": "Folilo82",
    "rating": 9.0,
    "comment": "I like this because it is a cool fighty game with miniatures but you don't really make the decision to attack the other players directly.\n\nThe card drafting and tableau building aspect is also very interesting.",
    "timestamp": 1762038000
  },
  {
    "username": "Vladi4ka24",
    "rating": 9.0,
    "comment": "Отличная игра. Но..... Если вы сделали ошибку в первой эпохе и отстали по очкам, случайно потеряли всю армию из-за карточки боя, то в целом на победу уже можно и не рассчитывать. т.е. вы просто сидите и ждете окончания партии. Шансов догнать лидера практически нет, сменить стратегия посреди партии не получится.",
    "timestamp": 1761865200
  },
  {
    "username": "phunter",
    "rating": 9.0,
    "comment": "+Mystics of Midgard\n+5p\nMonsters painted",
    "timestamp": 1761606000
  },
  {
    "username": "ArmeD",
    "rating": 9.0,
    "comment": "One of my favourite area control games and what got me initially hooked to KS boardgames.",
    "timestamp": 1761343200
  },
  {
    "username": "Hisu",
    "rating": 9.2,
    "comment": "I kind of like Ankh more but that one gets complaints about complexity from non-regular players",
    "timestamp": 1761343200
  },
  {
    "username": "Awesomiser",
    "rating": 8.5,
    "comment": "Great with mates, beers & pizza",
    "timestamp": 1761256800
  },
  {
    "username": "hockeyjones",
    "rating": 8.5,
    "comment": "99\n\nLast play in 2016",
    "timestamp": 1761170400
  },
  {
    "username": "antonkartashov",
    "rating": 9.0,
    "comment": "2p, 3p, 4p!\n5p - w/ 5th Player Expansion (Ram Clan), Kickstarter Exclusives (Wildboar Clan) or Promos Box (Stag Clan)\n\nComplexity: ●●○ (medium)\nDuration: 90 mins\n\nA very simple, but deep board game, the mix of Eurogame and Ameritrash. The gameplay is somewhat reminiscent of “Unmatched,“ only here the game is incredibly balanced (which I can't say about “Unmatched”).",
    "timestamp": 1760997600
  },
  {
    "username": "LuisEstepa",
    "rating": 9.0,
    "comment": "Tematica 10\nJugabilidad 8\nPrecio 7\nEsta divertido pero hay estrategias muy fuertes y se puede hacer algo repetitivo. Pocos monstruos y simetria inicial, ambos factores bajan la nota",
    "timestamp": 1760824800
  },
  {
    "username": "shadysp4rk",
    "rating": 9.0,
    "comment": "Included\nBlood Rage: 5th Player Expansion\nBlood Rage: Mystics of Midgard\nBlood Rage: Gods of Ásgard\nBlood Rage: Promos Box (Mountain Giantess, Garm, Seer Troll, Wolfwoman)",
    "timestamp": 1760565600
  },
  {
    "username": "PMN91",
    "rating": 8.5,
    "comment": "Painted",
    "timestamp": 1760479200
  },
  {
    "username": "Yanastos",
    "rating": 9.0,
    "comment": "There are so many different strategies in this game that you never truly know who will come out victorious. Viable winning options include winning clan battles, controlling multiple areas, and completing quests. Even dying or losing battles is a great winning strategy if you draft the right cards.\n\nThe miniature figures are really nice, and even more incredible when painted. I would like to get more plays of this to hammer down some other strategies. Really really good action point and area control game that has a great wargame theme and feel.",
    "timestamp": 1760479200
  },
  {
    "username": "rigacu",
    "rating": 9.0,
    "comment": "Vienna",
    "timestamp": 1760220000
  },
  {
    "username": "hyperking",
    "rating": 9.0,
    "comment": "I'll play this game whenever asked. It's a fantastic and quick (for area control) card drafting game. My group has played MTG for years and picked up on a lot of the drafting strategies quickly. It's really the meat of the game and the card play is strategic without feeling like a chore. Highly recommend for competitive gamers who enjoy conflict",
    "timestamp": 1760047200
  },
  {
    "username": "Nakira",
    "rating": 9.0,
    "comment": "Blood Rage – Few games capture the glory of battle and the poetry of destruction quite like this Viking epic. As Ragnarok looms, rival clans fight for dominance across a dying world, earning glory through conquest, quests, and the occasional glorious death. The rules are simple, but the strategy runs deep — drafting powerful cards to upgrade your clan, summon monstrous allies, and sway the gods themselves. Every decision feels meaningful, every loss potentially part of a greater plan. It’s elegant, explosive, and endlessly replayable — the game that made Vikings cool again (and reminded everyone that mead and mayhem are a perfect mix). Skål!",
    "timestamp": 1759874400
  },
  {
    "username": "SammySnijbonen",
    "rating": 9.0,
    "comment": "Great graphic design. Clear but thematic spaces on the game board. Your player board doubles as a player aid for the different turn actions.\n\n Many equally valid paths to victory, all leaving room to sabotage other players' well-laid plans, or to bluff about your own intentions.\n\n It looks way more complicated than it is. Rules are easy to explain.\n\n----\n\n A skeptic could say this is an overproduced game.\n\n Experienced players often have the upper hand over new players due to their knowledge of the types of cards that are in the decks. The first time(s) you play, you're mostly familiarizing yourself with the different ways to win rather than really having a shot at winning against more experienced. I've seen this discourage some new players.\n\nSleeved\n\nPainted the miniatures?: No. Perhaps one day I will, but I really want to do the sculpts for the giants and troll justice.",
    "timestamp": 1759701600
  },
  {
    "username": "HughCross",
    "rating": 9.0,
    "comment": "Highly interactive area-control and close-drafting game. Everyone starts the same but with card drafting it ends up with really asymmetrical factions. It has many different strategies and sinergies to explore and persue, even losing battles is a viable strategy. It has some room to bluff too. Experienced players do have a significant advantage over newcomers tho.\n\nThe minis are nice but i guess it should be a pain to paint that many.",
    "timestamp": 1759701600
  },
  {
    "username": "Hawksteader",
    "rating": 9.0,
    "comment": "**Monsters PAINTED**",
    "timestamp": 1759442400
  },
  {
    "username": "chrisclaytx",
    "rating": 9.0,
    "comment": "Great group game of 4. I always try to win by losing. Yes you can win by trying to die as option. Paint the minis and you will be spoiled. Great looking fun cdg.",
    "timestamp": 1759356000
  },
  {
    "username": "RavenousCake",
    "rating": 9.0,
    "comment": "Sleeved, Sleeve Kings.",
    "timestamp": 1759269600
  },
  {
    "username": "atlas64gaming",
    "rating": 9.0,
    "comment": "AUGUST 2025: 51ST\nFEBRUARY 2025: 52ND\nAUGUST 2024: 33RD\nFEBRUARY 2024: 30TH\nAUGUST 2023: 23RD",
    "timestamp": 1759096800
  },
  {
    "username": "gawlas",
    "rating": 9.0,
    "comment": "Sleeves:\n- Rebel Mini American Premium (41/63 mm)",
    "timestamp": 1758924000
  },
  {
    "username": "Final_Meeple",
    "rating": 10.0,
    "comment": "Top 50 Games of 2021 - #43\nTop 50 Games of 2022 - #8\nTop 50 Games of 2023 - #10\nTop 50 Games of 2024 - #10",
    "timestamp": 1761865200
  },
  {
    "username": "HelgiSam",
    "rating": 10.0,
    "comment": "Rundes Spiel, das man auch gut Einsteigern erklären kann.",
    "timestamp": 1761606000
  },
  {
    "username": "Neysmeey",
    "rating": 10.0,
    "comment": "▪pomalowane figurki\n▪plastikowe znaczniki akcji\n▪organizery na plansze graczy x4\n\n▪piankowy insert",
    "timestamp": 1760824800
  },
  {
    "username": "NOOCX",
    "rating": 10.0,
    "comment": "Nihilistic vikings, whose biggest death wish is to go down, or better, rise up to Walhalla in a blaze of glory? A PUBG-like Ragnarök mechanism destroying and shrinking the board every round? Epic Yggdrasil fights, where everything and everybody gets involved and the winner takes it all?\n\nCount me in, this sounds like a hell lot of stupid fun!\n\nBlood Rage brought me back to board games and opened my eyes for the trashy side. It's a diceless hybrid leaning towards Euro with victory points, strong drafting and tableau-building elements and bla, still it's somehow thematic, powerful, dynamic and a blast to play. In the best possible way everything is swingy and broken and wombo combo in this rather chaotic game and it feels enormously satisfying to feel the impact and synergies of your actions.\n\nBehind all overproduced bombast and martial slaughter there is a clever tactical and overall mostly balanced area control game, which I full heartedly enjoy and recommend.\n\nAs everyone is pointing out, the Loki strategy is kinda op/lame. While it's interesting gameplaywise and I'm glad it's there, it's too easy to capitalize on it with little effort. Still everybody has to play around it and it's rare the Loki player is winning at our table even though he's also never getting last. It is an issue, but not big enough to dumb down my enthusiasm.",
    "timestamp": 1760824800
  },
  {
    "username": "Wuyley",
    "rating": 10.0,
    "comment": "Best 4, Recommend 3",
    "timestamp": 1758492000
  },
  {
    "username": "eeboy",
    "rating": 10.0,
    "comment": "This is my favorite game, I've played it more than 10 times. The setup is easy with few components, the play time is not to long but just perfect, and there are so many tactical choices to make without reading any long complicated text on cards.\nThe tension is always there.\nAlthough I have the 5-player expansion, I have every time only played it with 4 players, which is really good.",
    "timestamp": 1758405600
  },
  {
    "username": "beaglestorm",
    "rating": 10.0,
    "comment": "Sleeved - 118 - Mini American - Yellow (FFS01)\nSleeved - 6 - Tarot - Orange (FFS66)\nhttps://boardgamegeek.com/geeklist/164572/item/4146945#item4...",
    "timestamp": 1758232800
  },
  {
    "username": "k000z",
    "rating": 10.0,
    "comment": "One of the best area control games ever, highly strategic, lol randomnes",
    "timestamp": 1758146400
  },
  {
    "username": "Arash13",
    "rating": 10.0,
    "comment": "An intensely strategic game, packed with suspense and excitement all the way through. You only need to play it a few times to fully enjoy it. (updated 9.5 >> 10)",
    "timestamp": 1756764000
  },
  {
    "username": "dthomas97",
    "rating": 9.5,
    "comment": "This hybrid area control rich in theme and card play is Incredible with 3 to 5 players. Suffers a little at 2 but it’s still playable. One of my favorite games ever made.",
    "timestamp": 1756072800
  },
  {
    "username": "Kaliff09",
    "rating": 10.0,
    "comment": "#area",
    "timestamp": 1755813600
  },
  {
    "username": "KnittelMan",
    "rating": 10.0,
    "comment": "What’s not to love about this game. The art is great, all the unique cards are awesome. The theme is fun. The drafting works great! Awesome figures. I got a custom insert which I think helps tremendously. Love the game.",
    "timestamp": 1755640800
  },
  {
    "username": "jaceycole",
    "rating": 10.0,
    "comment": "Everyone had a great time! The rules seemed fairly simple at first, but there was actually a lot of nuanced situations we needed to look up. Very much looking forward to more plays. This could be a real winner for our group!\n\nThe strategic and tactical decisions are all very enjoyable. After the first few plays, the shock of the overpowered cards subsides and you play expecting them, so you lose a little of that initial chaotic fun.\n\n5 plays, 9.0 - This game is amazing. So tense. So hard to decide the best action in many scenarios. Just the right amount of unpredictability. And because it's the players that are unpredictable instead of the game, it doesn't feel like bad luck. Such a fun experience. Though I have not yet had a game under 2 hours.\n\nProbably my favourite game.\n\n7th play, 4 player - First time playing with 4 players in nearly three years. I still love this game. The drafting is great, helping form your round by round strategy, but then the board play is so juicy, unpredictable and chaotic, you're just holding on hoping you can finish your plans. The way it build up to your big point scoring opportunities in round 3 is very satisfying. Feeling might be somewhat bolstered by the fact that I've won 6 of 7 games.\n\n10.0 - 8th play, 4 player - Such a close and tense game. The newbies beat the experienced players!",
    "timestamp": 1755036000
  },
  {
    "username": "Paratrooper1942",
    "rating": 10.0,
    "comment": "I always enjoy playing this one. The Kickstarter monsters allow even more tactics to hone or counter strategies and add to the replayability. While I wish that the Kickstarter exclusives were made more readily available, I still love the choices in the basic game. Drafting the right cards for your strategy is important, as well as paying attention to what your opponent's strategy seems to be. This one has never disappointed me. Recommended for 3-4 players.",
    "timestamp": 1754863200
  },
  {
    "username": "zombie_cataclysm",
    "rating": 10.0,
    "comment": "Miniaturas pintadas.",
    "timestamp": 1754776800
  },
  {
    "username": "Kuhni",
    "rating": 10.0,
    "comment": "Rating 2,9/60-90Minuten\n3-5/Best 4-5/12Jahre\n\nGods of Asgard 2,6/Best 4-5\nMystics of Midgard 2,7/Best 4-5",
    "timestamp": 1754690400
  },
  {
    "username": "sherm21al",
    "rating": 10.0,
    "comment": "BLOOD RAGE!! What a great game. At one point it was my favorite of all time, but I have since cooled. It could definitely make it's way back up, but as of right now I have not been able to have any real competitive games as I am always teaching new gamers. I hope that people want to play and master it, that way I can really get some competitive games 3-5 player games of Blood Rage. Love the minis and production, CMON standard here. Eric Lang's best.",
    "timestamp": 1754604000
  },
  {
    "username": "deehizzle",
    "rating": 10.0,
    "comment": "With:\nDigital Extras box\n5th Player Content\nMystics of Midgard expansion\n\n=============================\n\nWatch it Played Video: https://www.youtube.com/watch?v=EkvmTFUGiyQ\n\nRules: https://www.cmon.com/wp-content/uploads/2023/06/BLR001-Ruleb...",
    "timestamp": 1754431200
  },
  {
    "username": "Beru",
    "rating": 9.8,
    "comment": "#0003",
    "timestamp": 1753567200
  },
  {
    "username": "sultan_of_games",
    "rating": 9.5,
    "comment": "4-5",
    "timestamp": 1752789600
  },
  {
    "username": "hidderrr",
    "rating": 10.0,
    "comment": "- best group pvp game\n- randomness minimized with semi rock-paper-scissors battling which enables bluffing\n- bluffing has huge impact\n- strategic foresight has huge impact\n- leader targeting is still a thing though less impactful",
    "timestamp": 1752444000
  },
  {
    "username": "NikolasGimli",
    "rating": 10.0,
    "comment": "Fun",
    "timestamp": 1751752800
  },
  {
    "username": "kReal92",
    "rating": 10.0,
    "comment": "Sleeved\nFolded Space\nDeluxe: no\nPainted: no",
    "timestamp": 1750716000
  },
  {
    "username": "mathieulabelle73",
    "rating": 9.8,
    "comment": "Un très bon jeux, un mix d'affrontement avec des majorités sur des territoires et du hand-management.",
    "timestamp": 1750370400
  },
  {
    "username": "TehRochi",
    "rating": 10.0,
    "comment": "Kickstarter",
    "timestamp": 1749420000
  },
  {
    "username": "MannyM",
    "rating": 10.0,
    "comment": "#1\n\n~",
    "timestamp": 1748469600
  }
]