[
  {
    "username": "ultimoratio",
    "rating": 1.0,
    "comment": "another boring soulless Euro",
    "timestamp": 1742770800
  },
  {
    "username": "sozonm7",
    "rating": 1.0,
    "comment": "70 Collector's Box + Crown Expansion. 1st kickstarter promo.",
    "timestamp": 1695852000
  },
  {
    "username": "Guantanamodelfuego",
    "rating": 1.0,
    "comment": "One for the broken Renegade company",
    "timestamp": 1686866400
  },
  {
    "username": "CJE1111",
    "rating": 1.0,
    "comment": "I don't like the childish art.",
    "timestamp": 1667775600
  },
  {
    "username": "aircastle",
    "rating": 1.0,
    "comment": "This is just to balance out this walt mulder guy who appears to be an idiot.",
    "timestamp": 1570485600
  },
  {
    "username": "zephmode",
    "rating": 2.0,
    "comment": "I played this because I liked \"Architects\" but this was a lot harder to learn and a lot more convoluted. And it took way to long. I think it took us 5-6 hours. I so wanted the game to be over after 2 hours. I misunderstood a few things and avoided some parts because I didn't quite understand them. Well that costed me big time because that meant I didn't take advantage of the chaining of resources. It's just too many things a going on. If you don't set up the right engine early one, you're screwed. I spent the last 4 hours in agony. I never want to play this again.",
    "timestamp": 1720130400
  },
  {
    "username": "Desert_Witch",
    "rating": 2.0,
    "comment": "Why this shit stayin in top 100? It's insane!",
    "timestamp": 1643756400
  },
  {
    "username": "krisispm",
    "rating": 2.0,
    "comment": "This game is an over-complicated chore without much fun to be had along the way. Both of the subsequent games in this trilogy are leagues better than this initial entry.",
    "timestamp": 1635026400
  },
  {
    "username": "wingnut338",
    "rating": 2.0,
    "comment": "Way too much rng for the game length and complexity. Oh you want to build a fortification? Draw a random card with random rewards. Oh you want to get workers? Chose from these randomly drawn cards with a random number of purple workers on them then draw a card with a random amount of gold for each purple worker you take. Draw 3 random Paladins with a chance of getting 3 useless ones while everyone else gets the one you want.",
    "timestamp": 1630533600
  },
  {
    "username": "serjexx",
    "rating": 2.0,
    "comment": "Nothing interesting in the process. The process itself is not connected with lore at all.\nYou simply upgrade one of your tracked index back and forth and do the opposite.",
    "timestamp": 1587506400
  },
  {
    "username": "smurfodeth",
    "rating": 3.0,
    "comment": "God, what a waste of my time. Just another mechanism mixtape, MPS, everybody-fucks-around-on-their-personal-board snooze fest, with a game state that is on rails most of the time, with only the occasional interruption from meaningless decisions. And, with all these cards and bits everywhere, the publisher couldn’t be arsed to include player aids for the iconography salad?",
    "timestamp": 1749592800
  },
  {
    "username": "Beastly_Venturer",
    "rating": 3.0,
    "comment": "1 play.",
    "timestamp": 1740783600
  },
  {
    "username": "apuity",
    "rating": 3.0,
    "comment": "Fun iff one loves changing meeples into different colors. Beyond belief how this game is so well-regarded. There are so many ways to shift colors that each turn must be spent puzzling out how to shift these colors, which dilutes the significance of Tavern cards & starting meeples. Almost no tightness in game design (you can accomplish almost the same things if starting with 2K1B1G vs 2R1B1K). Worst of all, the randomness in Fortify & Suspicion preclude premeditated turn planning. A terribly designed euro, requiring almost no intelligence to play.",
    "timestamp": 1737327600
  },
  {
    "username": "Sparticuse",
    "rating": 3.0,
    "comment": "Tons of choices to make and most of them feel like meaningful choices that could lead to a win.\n\nUpdate: after a couple plays there's just too much AP. I just want the game to end while I'm playing it.",
    "timestamp": 1732057200
  },
  {
    "username": "Dyzthar",
    "rating": 3.0,
    "comment": "Solid game at first but with low luck, no asymmetrical game play, everything visible/open to each player, and zero interaction, there always is little replayability.\n\nAfter playing this game just a few times one can already see everything that is in it and what one can do. If one knows what their end goal is, it becomes quite clear which actions one should take at any given turn.\n\nI feel like this game skill cap isn't as high as people make it out to be since the key to victory is guessing the mid game victory conditions right and hoping that the worker/outsider cards will favor you more so than your opponents.\n\nWith just a few plays one can easily figure out how and when to make the most of their resources, what actions their opponents will take and how their opponents will do those actions.\n\nSummary: Simple point salad euro game that quickly becomes predictable and ultimately uninteresting.",
    "timestamp": 1717106400
  },
  {
    "username": "TheSlov",
    "rating": 4.0,
    "comment": "Replayed. With 3 players this took way too long, scoring low, and had little satisfaction or fulfilment in game play. Might be the worst in the series",
    "timestamp": 1755900000
  },
  {
    "username": "FaseMenosUno",
    "rating": 4.0,
    "comment": "Precio de compra 45,53. Precio de venta 28. Total 17,53",
    "timestamp": 1750629600
  },
  {
    "username": "darkfinale",
    "rating": 4.0,
    "comment": "Played twice IRL, feels like just doing things. The USP is the jailing of people. Feels like efficiency puzzle, don't really want to play again.",
    "timestamp": 1744495200
  },
  {
    "username": "Masterblocker",
    "rating": 4.0,
    "comment": "Just a priorization number no actual rating",
    "timestamp": 1736550000
  },
  {
    "username": "PotatoKing_",
    "rating": 4.0,
    "comment": "가장 중요한 자원이 불쾌할 정도로 운에 좌우된다",
    "timestamp": 1736204400
  },
  {
    "username": "shmonkey",
    "rating": 5.0,
    "comment": "Pretty standard modern Euro with different colored meeples to manage. The only real interaction is where you put commissions and garrisons. Even that is still fairly incidental. I enjoyed the puzzle but it went slightly too long for what it was. I think it works well in the medium heavy modern euro sphere. Maxing out the banners gives you an inordinate amount of points so for future plays, I need to note that I should pick one colored track to hit hardest, that was the biggest score discrepancy among everyone.",
    "timestamp": 1759874400
  },
  {
    "username": "Time_Walker",
    "rating": 5.0,
    "comment": "Portugal",
    "timestamp": 1756850400
  },
  {
    "username": "No2Ross",
    "rating": 5.0,
    "comment": "I never really understood the dislike for \"multiplayer solitaire\" games until I played this.\n\nWhile player interaction is good, board games are still a nice social experience when people are interacting with the game on their own terms. I think what is required for \"multiplayer solitaire\" board games is setup (or something other such type of) variability and this game has basically none.\n\nPlayed it twice and then never wanted to play it ever again.",
    "timestamp": 1749592800
  },
  {
    "username": "Scifi66",
    "rating": 5.0,
    "comment": "23Aug->Good Euro but not enough interaction. Solo was too fiddly.\nWorker placement engine builder with the paladin deck. Nothing you haven't seen before but it is done well and ties together nicely in a heads down package. I like both the art and gameplay here over Architects.\n± Solo good but fiddly.",
    "timestamp": 1745100000
  },
  {
    "username": "Generalkhun",
    "rating": 5.0,
    "comment": "After 2-3 plays not see Im going back to play it again. This is whats people called \"Multiplayer solitaire\" finding your solution on your board things is not my cup of tea (even the 3 colors cycling puzzle solving in this game is somewhat satisfied in some moments) .\nMaybe play a solo game instead of this",
    "timestamp": 1736377200
  },
  {
    "username": "hiimjosh",
    "rating": 5.0,
    "comment": "An optimization game that outwore it's welcome. It's a good puzzle as the only way to play correctly is to do everything. It's too long for what it is and there is no interaction though. This whole series is pretty meh",
    "timestamp": 1732489200
  },
  {
    "username": "quietcorn",
    "rating": 5.0,
    "comment": "At the start of each of seven rounds, players draw three cards. Each has it's own ability that focuses on making a specific action cheaper or more effective, and comes with two workers. Then in turn order players draft a card that comes with four additional workers. The workers come in a variety of different colors. Once this is done players take their actions one at a time clockwise by laying workers of the correct colors into the action spaces of their boards.\n\nSome actions on your board collect resources, others give you steps on one of three scoring tracks, and at times they also come with a bonus reward. There is an action space that places a building onto a worker space making that action cheaper in further rounds, and a space that lets you pays some resources to clear the workers from an action, allowing you to resolve it twice in that round. To further build your engine, there is a belt of purchasable cards that provide additional bonuses when you resolve a specific action in the future.\n\nThe game has a number of random elements that are a little troublesome. Money is very tight in the game. When you take a wild-colored (represented as purple) worker, you also take a purple card. The back of the purple card has 0, 1 or 2 free dollars on it. These dollars pull from a separate bank, which when depleted refills and then punishes the player with the most purple cards. A player who lucks into getting mostly $2 vs a player who badlucks into getting mostly $0 has a substantial advantage. Additionally, there's an action where you build wall cards at the top of your board. These too come with random rewards, that might help you a lot in your chosen path, or might just wind up a waste of your precious few workers. Another big advantage comes to the player who draws the helper card that reduces the cost of the building that substitutes the worker on your board by half in the first round.\n\nAdd to this the way the belts of faceup cards work. Each round you refill the two card displays. One is full of cards that can be taken to improve your engine, but they can also be discarded for a one-time bonus. First come first serve. The cards don't appear to repeat as well, so it's easy to miss out on an effect you need because someone else wants the one time benefit for punting them. It works the same with the second display of cards, but those have a mix of one time bonuses at the top, and bonus scoring criteria at the bottom.\n\nMild randomness frustrations aside, the game is enjoyable overall. I like working a personal management board, and it reminds me a lot of Orleans, minus the bag building, plus a little more randomness. This is a game where you need to laser focus on your goals, since workers and money are in short supply, and the rewards for track bumps only come at the very end of the tracks. In that way it's mildly disappointing since it seems like there is a lot of cool stuff to do but really you pick one or two goals at the start of the game and then just push as hard as you can in that straight line. Aside from beating each other to cards, there's very little player interaction.",
    "timestamp": 1721685600
  },
  {
    "username": "Balleflass",
    "rating": 5.0,
    "comment": "Very multiplayer solitare.\nNot my type of game.\nArchitects is my favorite from Garphil by a long shot, but I havent tried Circadians Chaos Order yet which I hope doesnt have the same flaws as Scythe.",
    "timestamp": 1720908000
  },
  {
    "username": "HackFin",
    "rating": 5.0,
    "comment": "First impression 2P: Unfortunately my problem with Shem's designs continues. The spreadsheet fundament puts players in a tight corset denying interesting individual decisions. In the end everyone did pretty much everything - is the game one turn too long? This game is all about turn optimisation whilst strategic choices barely mean anything, even though it is not a tactical game either. The West Kingdom trilogy represents what happens to games when you streamline and polish so much that the outcome feels plain and soulless. If you like Shem's other games and also have no problem with Stonemaier designs you will probably still like this game, but I am finished spending my time trying to like these hype games. Still loving the art of the Mico!\nBtw: I have no idea how this happened, but the weight rating is a lot too high. This is certainly not GWT level weight.",
    "timestamp": 1711922400
  },
  {
    "username": "MattWey",
    "rating": 5.0,
    "comment": "Ok so this is a weird one.\n\nThe game is not bad. It has mechanics that work together well. It has a theme that works fine and add to the mechanics. But...it's just boring? This is a worker placement game where players compete for certain things but mostly everyone is playing alone, cause everyone has their own action board. Later you get some pretty decent actions to use, but still mostly it's me vs me.\n\nI think this game would benefit from smaller player board and more actions on the general space. Sure it would make it closer to most worker placement games, but this is of course subjective. One thing that I learned after playing this is that the BGG rating is...a mess. This is nowhere close to fun as Ark Nova or even Terraforming Mars. It's worse than Tzolkin in terms of worker placement element AND theme.\n\nI felt very tired after playing this with 4 players. Perhaps with less players it would work better.",
    "timestamp": 1707346800
  },
  {
    "username": "threhane",
    "rating": 6.0,
    "comment": "Excellent condition. Decent worker placement game, where players recruit different types of workers each round, instead of every player having their own supply of workers. Ultimately, though, I’m not sure that the payoff justifies how convoluted this game is.",
    "timestamp": 1761692400
  },
  {
    "username": "artman_russian",
    "rating": 6.0,
    "comment": "1 партия. Оценка предварительная.",
    "timestamp": 1761606000
  },
  {
    "username": "djsturz",
    "rating": 6.0,
    "comment": "This one felt a little too solitaire and cumbersome setting up each round.",
    "timestamp": 1757455200
  },
  {
    "username": "Killi",
    "rating": 6.0,
    "comment": "Best of the West Kingdom series.",
    "timestamp": 1756504800
  },
  {
    "username": "ditterio",
    "rating": 6.0,
    "comment": "I played a demo on Spiel. It was too much for me. I prefer Viscounts and Architects.",
    "timestamp": 1755208800
  },
  {
    "username": "Terry_Yan",
    "rating": 6.0,
    "comment": "OK game. Probably my favorite one in the West series. It invokes the feeling of Legacy of Yu in me but in a multi-player setting. But in typical Shem style, it feels very unbalanced. Some cards are absolutely useless, while others are absolute must have. And only one can have them.",
    "timestamp": 1755208800
  },
  {
    "username": "rws2029",
    "rating": 6.0,
    "comment": "• August 2025> Purged!\n\n• WARNING •\nThis game is NOT red/green colorblind friendly. In fact, it’s downright hostile.\n\nRating as a game: Very Good.\nRating for ease-of-play given the color palette: Very Bad.\n\nNote to publisher:\n• don’t use grey to represent black because grey and green can be difficult to distinguish, depending on lighting conditions and where one falls on the colorblind spectrum;\n• don’t use blue side-by-side with purple because if your eyes can’t detect certain red wavelengths, purple and blue look the same.",
    "timestamp": 1754344800
  },
  {
    "username": "mfaller",
    "rating": 6.0,
    "comment": "Repetitive solitary busy work tacked onto a theme (and the usual great art!) After a couple plays you've seen all there is to see. Strangely the expansions \"detract\" from the base game instead of adding to it. It's maybe all too abstract and just a puzzle that once you solve it there's nothing else to do.",
    "timestamp": 1753308000
  },
  {
    "username": "LoveTrain",
    "rating": 6.0,
    "comment": "Preliminary Rating",
    "timestamp": 1749765600
  },
  {
    "username": "dtmoney75",
    "rating": 6.0,
    "comment": "1 Play\n\nExpansions: City of Crowns\n\nPlayed at: 2",
    "timestamp": 1748642400
  },
  {
    "username": "THE_GODFATHER",
    "rating": 7.0,
    "comment": "X",
    "timestamp": 1761951600
  },
  {
    "username": "Sondari_Wobble",
    "rating": 7.0,
    "comment": "1-4 spillere",
    "timestamp": 1760220000
  },
  {
    "username": "Mr Mjeh",
    "rating": 7.0,
    "comment": "A great euro where the theme is sadly lacking - big time\n\nGameplay-wise it’s good though",
    "timestamp": 1760220000
  },
  {
    "username": "DoctorPhil",
    "rating": 7.0,
    "comment": "Criteria (out of 5)\nRules complexity 3\nPlaytime/complexity ratio 4\nStrategic avenues 4\nMechanism strength 4\nThematic integration 3\nVariability 4\nReplayability 3\nFun factor 4\nSolo mode\nPlayer interaction 3\nElement of mastery 3\n\nOverall 7.0 out of 10",
    "timestamp": 1759356000
  },
  {
    "username": "JHunter101",
    "rating": 6.5,
    "comment": "Scarp Notes:\n\n- Converted outsider balance is a bit wonky\n- Getting criminals naturally is far more worthwhile than the punishment/cost\n- Start of Rounds are just one by one activating King's Orders",
    "timestamp": 1759269600
  },
  {
    "username": "yelske",
    "rating": 8.2,
    "comment": "Easy to learn, hard to master, a lot of deep decisions. A bit of Orleans style worker placement, but different enough. Plays in under an hour. And all this in a small box.",
    "timestamp": 1762383600
  },
  {
    "username": "Budgetface",
    "rating": 8.0,
    "comment": "150",
    "timestamp": 1762297200
  },
  {
    "username": "hendecatope",
    "rating": 7.5,
    "comment": "Big Box w/City of Crowns",
    "timestamp": 1761429600
  },
  {
    "username": "Hooloovoo42",
    "rating": 8.0,
    "comment": "ST20 2025 #19\nST20 2024 #10\nST20 2023 #13",
    "timestamp": 1761256800
  },
  {
    "username": "CGGGaming",
    "rating": 8.0,
    "comment": "Only played solo. Satisfying worker placement game. The automa is easy to pilot, but takes a bit of time each round.",
    "timestamp": 1760392800
  },
  {
    "username": "Luclid",
    "rating": 9.0,
    "comment": "Keep",
    "timestamp": 1762666620
  },
  {
    "username": "clawp1995",
    "rating": 9.0,
    "comment": "3D Insert\nSleeve Kings 54 x 86 (110) SKS-8821\nArcane Tinmen - Small 44 x 68 (50)",
    "timestamp": 1762608660
  },
  {
    "username": "Fleax",
    "rating": 9.0,
    "comment": "kickstarter",
    "timestamp": 1762297200
  },
  {
    "username": "Henri738",
    "rating": 9.0,
    "comment": "Also played solo",
    "timestamp": 1762210800
  },
  {
    "username": "Nuvium",
    "rating": 9.0,
    "comment": "Really good! Many choices of strategies.",
    "timestamp": 1761692400
  },
  {
    "username": "Napattack",
    "rating": 9.8,
    "comment": "3.72\n1-3\nBest at 2\n120 (1,440)\n#18",
    "timestamp": 1762383600
  },
  {
    "username": "bdavid0127",
    "rating": 10.0,
    "comment": "H",
    "timestamp": 1760738400
  },
  {
    "username": "OGRussHood",
    "rating": 9.9,
    "comment": "My 2025 Top 250: #121\nMy 2024 Top 250: #123\nMy 2023 Top 250: #139\nMy 2022 Top 250: #145\nMy 2021 Top 250: #140\nMy 2020 Top 250: #152",
    "timestamp": 1758492000
  },
  {
    "username": "timkrysko",
    "rating": 9.5,
    "comment": "+ City of Crowns\n+ Extra Paladins\n+ Collector's Box\n+ Metal Coins\n+ Sleeved Cards\n+ 2x Player Aids (Action Andy?)",
    "timestamp": 1757887200
  },
  {
    "username": "sestovic",
    "rating": 9.5,
    "comment": "",
    "timestamp": 1756677600
  }
]