[
  {
    "username": "Spamdre",
    "rating": 1.0,
    "comment": "Riot games doesn´t allow to cancel orders once they are done, but they say they reserve the right to cancel an order if they think something is fishy.\nSo that means they could actually cancel orders, but choose to do so only if they benefit, not if you benefit from it.\nCustomer service doesn´t reply (a pandemic is a great excuse for a multimillion dollar company to have shitty service, a task that can be done from home...fuck them!)\nPredatory business practices like this should not be tolerated.",
    "timestamp": 1607468400
  },
  {
    "username": "Bbelegurth",
    "rating": 1.0,
    "comment": "Juego para loleros",
    "timestamp": 1488668400
  },
  {
    "username": "codecracker",
    "rating": 1.0,
    "comment": "Arrived with some box damage and a cracked mech tray. Riot would not replace the tray and only offered a $5 discount. Each email I sent took a week before I got a response. After over a month with no resolution, I returned the game and called my CC company to reverse the charges. Normally I would not care about a tray but the custom trays are one of the main components in this game. I know several others who also had cracked trays. I would have been happy had they replaced the tray, replaced the entire game promptly, or offered a more sizable discount. The terrible customer service just ruined the game. Just seeing it stirs up bad feelings and I don't think I could ever enjoy this game.",
    "timestamp": 1487372400
  },
  {
    "username": "olivierandu",
    "rating": 1.0,
    "comment": "The bigger\nThe better ?\n\nI don't think so ...\n\n(this might be the first\n\" authoritarian \" boardgame,\ntrying to crush the competition\nunder its (heavy) metallic feet",
    "timestamp": 1485903600
  },
  {
    "username": "Biscotti",
    "rating": 1.0,
    "comment": "Nothing wrong with game. I'm sure its a splendid affair. However after watching run through and or reading reviews, absolutely no desire to play.",
    "timestamp": 1481238000
  },
  {
    "username": "sexybiologist",
    "rating": 1.0,
    "comment": "Honestly the worst Board Game I have played and I play a lot. The game looks pretty, but the instructions are poorly written and the cards are too. No skill or strategy for this game.",
    "timestamp": 1478905200
  },
  {
    "username": "near4422",
    "rating": 2.0,
    "comment": "The game is extremely frustrating to play. You have close to no control over your character and once you fell into a punishing loop (you start getting damage cards) you are even more limited (basically you have to sacrifice everything to heal yourself). It takes AGES to finish a single scenario.\nFor me this game is definitelly badly designed. It promises fun and looks good, but its mechanics are frustrating.",
    "timestamp": 1717452000
  },
  {
    "username": "Chuggas",
    "rating": 2.0,
    "comment": "Not a fan of programmed movement, especially when you are relying on each other to achieve something.",
    "timestamp": 1671318000
  },
  {
    "username": "mdrozdziok9595",
    "rating": 2.0,
    "comment": "Totalnie niegrywalna. W grze nie zaplanujesz absolutnie niczego. Obecność w top 100 to jakiś przykry zart. Świetne wykonanie nie ratuje tego tytułu",
    "timestamp": 1657058400
  },
  {
    "username": "Talti",
    "rating": 2.0,
    "comment": "Horrible",
    "timestamp": 1642374000
  },
  {
    "username": "LPG17",
    "rating": 2.0,
    "comment": "Bland game that slogs on for a long duration for how simple it is.",
    "timestamp": 1626472800
  },
  {
    "username": "Trickman",
    "rating": 2.0,
    "comment": "Boring from the first try. Rides on the wave of League of Legends. Tries to sell itself as a \"programming\" game but is nothing like programming. It's just an unpredictable mess of a game. Skip this.",
    "timestamp": 1567807200
  },
  {
    "username": "SoloMaru",
    "rating": 3.0,
    "comment": "A game where you feel like you're invincible, but couldn't really accomplish anything. Just plain bad",
    "timestamp": 1733180400
  },
  {
    "username": "Scifi66",
    "rating": 3.0,
    "comment": "Passable co-op gameplay. Theme does nothing for me. Very overproduced components.",
    "timestamp": 1724796000
  },
  {
    "username": "TForever",
    "rating": 3.0,
    "comment": "Gameplay is too light, not very deep.",
    "timestamp": 1702422000
  },
  {
    "username": "Mayasty",
    "rating": 3.0,
    "comment": "Stunning quality of the edition, the biggest game box I’ve ever seen, many differentiated and interesting scenarios but … the game itself is simply unplayable. Total chaos that doesn’t let you control what you do.\n\n1) You need to add a specific action to the mech’s command line but there’s no appropriate card on the table in given moment, so your mech will act in the way you definitely don’t want.\n2) Finally you somehow programmed your mech in the way you want but then you take the damage card that totally messes up the order of the actions you programmed and again your mech executes the steps in random order you definitely don’t want. You can only helplessly observe that madness. This isn’t even funny.\n3) The game is not scalable to the fewer number of players than 4. Regardless of number of players they will always have the same number of minions to defeat. So the fewer players the worse and the less chance to complete a mission.\n\nI had great expectation but only what I’ve got is a big disappointment. I’ve planned to introduce this game to my kids, who are 13 and would love the theme and overall look of the game. But I won’t. Most of the time the game shows to the players their helplessness and doesn’t bring any satisfaction. The only what my kids would love would be just to play around with figurines without any rules. But for that I don’t need a game in such a giant box. I had better bought a set of loose figurines.\n\nI guess this game is in BGG top 100 only due to it’s look, edition and reference to the popular universum. Nothing qualifies it as a good game. My rate 3 is just because of that edition. Otherwise it would have been 1.",
    "timestamp": 1668812400
  },
  {
    "username": "alman25",
    "rating": 3.0,
    "comment": "It's a nice looking game with great production value. The price tag offers one of the best values for a board game on the market.\n\nHowever, compared to other cooperative board games, this one doesn't provide the edge of your seat tension that I like such as Pandemic.\n\nThe time and effort it takes to set up and put away is a bit inconvenient. None of the characters you use are unique enough to do anything different from each other besides when unlocking the schematics, which can take several rounds to get to.\n\nAlso, there were some missions that felt like a grind to drag yourself through and rules that aren't explained very well. I just couldn't wait to finish all ten missions like slogging through a movie I wanted to end so badly.\n\nThis was a game I wish I hadn't wasted my time or money on.",
    "timestamp": 1626040800
  },
  {
    "username": "aaj94",
    "rating": 3.0,
    "comment": "Grindey, samey hack and slash. Had no interest in continuing on to further missions.",
    "timestamp": 1621461600
  },
  {
    "username": "mrssallyintown",
    "rating": 4.0,
    "comment": "I had a headache after playing this game. Was not expecting a puzzle.",
    "timestamp": 1760220000
  },
  {
    "username": "Killi",
    "rating": 4.0,
    "comment": "Did not like this at all.",
    "timestamp": 1756504800
  },
  {
    "username": "IsolatedPawn",
    "rating": 4.0,
    "comment": "Great concept and production, but after a few missions, it was apparent the design didn't scale well to player count, and is on the repetitive and easy side.",
    "timestamp": 1755900000
  },
  {
    "username": "Highnine",
    "rating": 4.0,
    "comment": "1st Edition",
    "timestamp": 1737154800
  },
  {
    "username": "Silver Avocado",
    "rating": 4.0,
    "comment": "Big budget video game adaptation. Dungeon crawler with a puzzle element. A bit of a funfair ride. Enjoyable enough to play, but it's playing you rather than the other way around. Forgettable. Enormous set up time and faff.",
    "timestamp": 1717884000
  },
  {
    "username": "sykano",
    "rating": 3.9,
    "comment": "cooperative board game from League of Legends publisher\n\namazing component quality (but also expensive)\naction programming with actions in four colors that can be strengthened by stacking same colors\nThe damage cards are a good idea!\nThe drafting of new action cards is good, maybe a bit too random, but the time limit is a bit odd to execute.\n\nI didn't like that much that there are always all four mechs in the game and missions are usual cramped, leaving one or two mechs with not much to do.\n\nI like that it's relatively easy, but the puny minions make it a bit boring, even in great numbers. A bit variety in enemies would have been better.\n\nIt's fun once or twice, but there is not much replayability. (!)",
    "timestamp": 1710716400
  },
  {
    "username": "Fuzzcrumbler",
    "rating": 5.0,
    "comment": "Too much set up & take down for what amounts to not enough variety, and what becomes uninteresting missions, and frankly, somewhat boring play. The game plays you, rather than the other way ‘round. I’d rather play a good CDG than this silly nonsense, but I suppose it’s good for playing in a family setting (including children). Production is through the roof, though. A Mattel toy for grownups. Pass.",
    "timestamp": 1723068000
  },
  {
    "username": "Fevin",
    "rating": 5.3,
    "comment": "Un Robot Rally coopératif.\n\nDe la programation et un peu de chaos mais pas si mal. Visuellement réussit.\n\nFaut par contre avoir envie de jouer à un Programation strictement coop' ...",
    "timestamp": 1713736800
  },
  {
    "username": "TKO81",
    "rating": 5.0,
    "comment": "I would recommend playing without the timer for younger players.",
    "timestamp": 1700002800
  },
  {
    "username": "oldskoolgeek999",
    "rating": 5.0,
    "comment": "Overrated. Very random. Frustrating",
    "timestamp": 1682460000
  },
  {
    "username": "ashkai",
    "rating": 5.0,
    "comment": "Thought that we would really enjoy a coop programming game. \n\nWe could not get into this game whether due to the mechanics not being fun for us or the fact that this has to be played using scenarios.\n\nScenario set up usually leads to us not playing a game more often than we would like.",
    "timestamp": 1678489200
  },
  {
    "username": "B_Moores",
    "rating": 4.8,
    "comment": "Who cares about the theme?",
    "timestamp": 1678057200
  },
  {
    "username": "TinyTheGreat",
    "rating": 5.0,
    "comment": "Simple Game, with a lot of stuff to take in in the first games. Random Fun, which can be somewhat be controlled. Radom Shit will happen nonetheless.",
    "timestamp": 1676156400
  },
  {
    "username": "Destrio",
    "rating": 5.0,
    "comment": "Obviously an extremely well produced game that is priced well for the average board gamer. You must like cooperative programming to like this game.",
    "timestamp": 1674860400
  },
  {
    "username": "JaakkoK",
    "rating": 5.0,
    "comment": "The production is over the top excessive. The game is fairly simple and succeeding in it feels random. Great for kids but wouldn't recommend for people looking for more challenging games.",
    "timestamp": 1659304800
  },
  {
    "username": "TheItchyGun",
    "rating": 5.0,
    "comment": "Game pretends to be programming, but its in fact just randomness.\nIt may be nice for kids...but i would never suggested to play.",
    "timestamp": 1650664800
  },
  {
    "username": "Langalore",
    "rating": 5.0,
    "comment": "Wasn't a hit. I had hoped it would be. I think set up time and confusion about moving the bomb in mission 2 robbed us of a great game.",
    "timestamp": 1641942000
  },
  {
    "username": "krit1789",
    "rating": 5.1,
    "comment": "Programmed robot movement and co-op campaign missions",
    "timestamp": 1639609200
  },
  {
    "username": "Entropology",
    "rating": 6.0,
    "comment": "A pretty good programming game. I certainly strongly prefer this over Roborally or Colt express or other competitive programmers. For those, one mistake or being bumped unexpectedly can completely hose everything in a turn or even more. Here, there are SO many minions that even unexpected/unplanned events usually involve you running over bad guys, just not the ones you planned on.\n\nThis works great with kids! The production is out of this world, the art is fun and engaging for them, the rules are simple (kudos for not making this any more complicated than necessary!), and the theme is great. The advantage of the whole board being bad guys is that both of them can move almost randomly and still be effective and engaged, they almost literally cannot avoid hitting minions and that makes them happy.\n\nThat being said, if it weren't for the kids, this would definitely be a few points lower. On the adult scale, it's fine at best but on the simplistic scale. It's also somewhat annoying that they split the missions into their own folders and split the rules across so many books.... The kids love the effect, but as an adult I'm mostly just annoyed at all the extra parts, pages, books, etc. The balance is also pretty suspect with less than four players, there isn't any accommodation for differing player counts.",
    "timestamp": 1761865200
  },
  {
    "username": "Iraperkins82",
    "rating": 6.0,
    "comment": "Played through",
    "timestamp": 1758060000
  },
  {
    "username": "specialjoek",
    "rating": 6.0,
    "comment": "I don't like programming games. It is far too chaotic for me and you often cannot control what your mech is doing.",
    "timestamp": 1755122400
  },
  {
    "username": "mnemonicuz",
    "rating": 6.0,
    "comment": "A nice and extremely well-produced co-operative game.\n\nLight programming gameplay and a fun and charming campaign to go through.\n\nIt quickly becomes repetitive and a bit of lackluster.",
    "timestamp": 1753653600
  },
  {
    "username": "zomborya",
    "rating": 5.5,
    "comment": "Played through first 6 scenarios. Reset back into envelopes.",
    "timestamp": 1752271200
  },
  {
    "username": "Eliya84",
    "rating": 6.0,
    "comment": "It is ok, but if i will play an programmend movement game, i will play always Trickerion.",
    "timestamp": 1747864800
  },
  {
    "username": "Jrb259",
    "rating": 6.0,
    "comment": "Mechs vs Minions really ramps up the tension quickly. After only the tutorial, you are thrust into a challenging mission that asks a lot of you and the other players. Mission two is even more challenging with the evolving board state and potentially game changing roles of the dice.\n\nI do like that the scenarios feel legitimately difficult. We looked at them and were not really sure how we were ever going to win. The nice thing with each round, is that although you are challenged, your deck of abilities really ramps up as the round progresses, as do your special abilities.\n\nWhen you barely get out of the round with just a turn to spare, you feel like you accomplished something.\n\nThis programming game is not for everyone. You may not get the cards you need. Other attacks from minions can completely mess up your actions and make your turn impossible.\n\nI felt incredibly helpless in certain scenarios. I know I started doing something valuable, but near the end, I felt completely useless because I could not turn. I also sensed frustration from others at the table when they could not get what they needed.\n\nIn other scenarios, I felt incredibly powerful and in control. I was able to do exactly what I needed in the timeframe I needed to.\n\nThe more familiar you are with the cards and the abilities, the easier it is to know what to draft and how it will affect your actions. Being in a timed draft really puts the pressure on as well.\n\nI’d be up for trying more missions. Not sure I’ve ever loved a programming game, but this gives lots of variability for customizing actions and abilities.\n\nProduction is great. Scenarios are interesting and challenging.",
    "timestamp": 1741820400
  },
  {
    "username": "improv321",
    "rating": 6.0,
    "comment": "It's a fun game, with an enormous amount of production value. After we'd finished the game (with one of the best reveals I've had in a game), there was kind of nothing more to gain from the game for me.",
    "timestamp": 1737500400
  },
  {
    "username": "Cone Defense",
    "rating": 6.0,
    "comment": "Amazing components and the programming feel to it make for a really chaotic exciting game. Not sure about the setup and take down but it’s thoroughly enjoyable.\n\nTakes up too much space though. Game size is a factor in keeping it for me. It had better be a 9.5-10 for me to keep a box of this size.\n\nBox size score adjustment: - 2",
    "timestamp": 1724796000
  },
  {
    "username": "ants_cymru",
    "rating": 6.0,
    "comment": "Outstanding quality game. Lots of fun to play - only played 1st mission but there seems to be plenty in the box. Review to be reconsidered when all missions are played. Will we need more missions afterwards? Who knows.",
    "timestamp": 1719180000
  },
  {
    "username": "kylehelp123",
    "rating": 6.0,
    "comment": "3-4. Playable at 2.",
    "timestamp": 1717797600
  },
  {
    "username": "Mystic_Mouse",
    "rating": 5.5,
    "comment": "Easily the best programming game I've played. I don't normally like that mechanic, but it was very well done here. Great game to experience at least once; it just never made it back to the table after the campaign was done. It will come back one day, because it had a cute theme, and I can enjoy it through others. The components, especially the storage, were fantastic.",
    "timestamp": 1716847200
  },
  {
    "username": "Mr Mjeh",
    "rating": 6.5,
    "comment": "This game is impressive in every way! Enjoy the game play but haven't played enough yet, but the video and audio files, the way the game works, the scenarions and missions - definitely worth it!",
    "timestamp": 1760220000
  },
  {
    "username": "KubaP",
    "rating": 7.0,
    "comment": "Fun action programming coop. Felt a bit like coop Robo Rally.",
    "timestamp": 1759788000
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 7.0,
    "comment": "We worked our way through all the missions of Mechs vs. Minions. The game starts with a lot of verve, and we fell in love with it. Eventually the game started to feel repetitive.\n\nNon-essential",
    "timestamp": 1757628000
  },
  {
    "username": "carbohm",
    "rating": 7.2,
    "comment": "Interesante coop donde toca programar acciones. También hay drafting de cartas",
    "timestamp": 1756591200
  },
  {
    "username": "Mr_Weyland",
    "rating": 7.0,
    "comment": "2-4",
    "timestamp": 1755468000
  },
  {
    "username": "Cercatesori",
    "rating": 7.4,
    "comment": "CRITERIA RATING\nENJOYMENT \nGAMEPLAY \nREPLAYABILITY \nDEPTH \nGAME LENGTH \nALEA \nCOMPONENT QUALITY \nPLAYER INTERACTION \nPLAYER COUNT PERFORMANCE \nSCORE: 7,43",
    "timestamp": 1754085600
  },
  {
    "username": "xcaptnmorgan",
    "rating": 8.0,
    "comment": "Traded Nov. 7 for A Study in Emerald",
    "timestamp": 1762573500
  },
  {
    "username": "curious_faze",
    "rating": 8.0,
    "comment": "Best material quality I ever had in a board game. Cool looking, nice minis. However, programming as the main mechanism was too little for me to be really enthusiastic about the game.",
    "timestamp": 1762383600
  },
  {
    "username": "kesulin",
    "rating": 8.0,
    "comment": "Juego de programación de acciones colaborativo.\nInteresante sistema de mejora, buena jugabilidad y mucha acción. Muy divertido.",
    "timestamp": 1762124400
  },
  {
    "username": "Aftonkatt",
    "rating": 8.2,
    "comment": "Coop chapter programming game",
    "timestamp": 1761343200
  },
  {
    "username": "holf",
    "rating": 7.8,
    "comment": "主題策略合作遊戲，玩家操作各種獨特機甲，對抗敵人或是進行各項任務的劇情，也就是有許多關卡可選擇，機制是卡牌驅動編程進行，就像雙錫機器人一樣，規則不難，每回合會因為卡片的增加而讓自己能力越來越強，但是遭受敵人傷害的時候會讓自己的規劃受到影響，抽卡片的不安定因素跟骰子不可控的運氣，倒是為遊戲帶來更多的趣味，缺點是遊戲盒太大較難攜帶，需要安定的空間~",
    "timestamp": 1761256800
  },
  {
    "username": "Golob",
    "rating": 8.0,
    "comment": "The game strikes a perfect balance between strategic optimization and pure joy of smashing enemies. The 10 missions are varied and replayable, and everything is made even better with extraordinaire production.",
    "timestamp": 1760392800
  },
  {
    "username": "mavericklancer",
    "rating": 8.5,
    "comment": "Purchased direct from Riot 10/13/16.\n\nProduction quality is absolutely astounding. Everything from the pre-painted miniatures to the well thought out and organized insert screams \"quality\". More importantly, the gameplay is compelling as well. The surprise Escalations constantly throw new wrenches into our well laid plans. The draft also challenges us every round to adapt to what we're given. I was surprised by how difficult it would be to just tow a bomb in a straight line in the first mission. You really need to manage your command line efficiently.\n\nThe minion AI is streamlined and not fiddly at all. The campaign gives all the fun of opening new envelopes in a legacy game without compromising replayability. The hourglass use in the draft really helps cut down on AP. There isn't anything else like this in the collection.\n\nThe Radioplay (from Riot's website) is a great addition that adds a lot of flavor. I love that they use professional voice actors with flavor text beyond the mission guide.\n\nMy only criticisms are that the insert can be a bit awkward when popping out dozens of minions and that I can see the programming being AP inducing for some gamers.",
    "timestamp": 1761606000
  },
  {
    "username": "winsrp",
    "rating": 9.0,
    "comment": "The bad thing about this game is that it ends too fast.",
    "timestamp": 1760997600
  },
  {
    "username": "Qhorin",
    "rating": 9.0,
    "comment": "Great production, easy to understand rules, fun mowing down minions. Good times.",
    "timestamp": 1760824800
  },
  {
    "username": "Infernity",
    "rating": 9.0,
    "comment": "The production quality to price ratio is an absolute steal. My only issues come from the rulebook and the unconventional box dimensions.",
    "timestamp": 1760738400
  },
  {
    "username": "pastorarod",
    "rating": 9.0,
    "comment": "One time, a buddy of mine almost completely completed the scenario for us. Unfortunately he couldn't because he took 7 damage cards in a row on the same turn. He kept walking in and out of lava. We eventually won but it was the funniest point in the whole campaign!",
    "timestamp": 1758146400
  },
  {
    "username": "pedrowski",
    "rating": 8.5,
    "comment": "To be Painted",
    "timestamp": 1757541600
  },
  {
    "username": "purplesloth",
    "rating": 10.0,
    "comment": "Outstanding co-op game, will always play.",
    "timestamp": 1759442400
  },
  {
    "username": "Haydon_Steele",
    "rating": 10.0,
    "comment": "What a fantastic game. Ive had it for a few years but finally managed to collect my League friends together to play. We really like how you learn the rules as you play, and there isn't a conventional rulebook as such. Interesting mechanics as well which I haven't seen elsewhere. Highly recommend if co-op is something you are looking for.",
    "timestamp": 1759096800
  },
  {
    "username": "Rubeus",
    "rating": 10.0,
    "comment": "Este es el mejor juego de programación de acciones que conozco y, aún no gustándome esta mecánica, sí reconozco que este lo disfruto mucho. Me costó en su momento alrededor de 80 euros y NO CONOZCO NINGÚN JUEGO DE MESA CON ESTA CALIDAD DE COMPONENTES: para mí es el baremo que utilizo para comparar si un juego de mesa tiene buena relación calidad-precio o no. Todas las miniaturas son asombrosas, la calidad de los dados y de las cartas es magnífica, el grosor de los tableros es muy bestia, con zonas brillantes y algo de relieve, con algunas piezas de metal alucinantes, con un reloj de arena que es hasta decorativo de lo bonito que es. En fin, un producto fuera de serie y con el que apetece siempre jugar.",
    "timestamp": 1758492000
  },
  {
    "username": "Tauzer",
    "rating": 9.5,
    "comment": "It's been a few years since I played through the campaign, but I still clearly remember the amazing fun that it was. When I play through this with my kids I'm sure it will rise back up on this list. It's a very unique game, cooperative, programming with a real time element. I love how the waves of enemies seem overwhelming, but how you're soon mowing through them with reckless abandon! I especially love stacking up the fuel tank upgrades and then using them as a \"nuclear\" option to wipe out a a vast number of minions in one go. I also appreciate that this game is more cheerful than gruesome, one that I will easily be able to play with my kids. Don't forget the amazing production values! Pre-painted mechs, magnetic boxes, gametrayz full of swarms of minions, it's beautiful!",
    "timestamp": 1755813600
  },
  {
    "username": "cbvester",
    "rating": 10.0,
    "comment": "SLEEVED",
    "timestamp": 1753740000
  },
  {
    "username": "laughagain",
    "rating": 10.0,
    "comment": "At HOTH",
    "timestamp": 1751839200
  }
]