[
  {
    "username": "ultimoratio",
    "rating": 1.0,
    "comment": "Pretty production but that's it. It's bog standard",
    "timestamp": 1757887200
  },
  {
    "username": "letarsier",
    "rating": 1.0,
    "comment": "Thundergryph cannot be trusted. Just plain and simple.",
    "timestamp": 1756850400
  },
  {
    "username": "Larinorth",
    "rating": 1.0,
    "comment": "Bad publisher",
    "timestamp": 1735167600
  },
  {
    "username": "cotomel",
    "rating": 1.0,
    "comment": "Very lazy design as expected from the italian school of modern euros.",
    "timestamp": 1732748400
  },
  {
    "username": "D4nge",
    "rating": 1.0,
    "comment": "A lot of minigames linked without any logic",
    "timestamp": 1710889200
  },
  {
    "username": "dreamcrawler",
    "rating": 1.0,
    "comment": "Spanish editor @Tcgfactory has provided way less product of what they promised to the shops, so a bunch of preorders have been cancelled, including mine. So no, thank you.",
    "timestamp": 1689112800
  },
  {
    "username": "selvalabelva",
    "rating": 2.0,
    "comment": "Brainburn         Longevity    \nLuck impact       Rules/Setup  \nInteraction       Involvement  \n\nAftertaste           Enthusiasm   \n\n Played at 4 player count only\n Rating inclusive of expansions gameplay\n Confrontation: multiplayer solitaire\n\n Efficiency puzzle-like design",
    "timestamp": 1751320800
  },
  {
    "username": "Ludwig3366",
    "rating": 2.0,
    "comment": "Le jeu est beau mais quel ennui ! il est vrai qu'il repose sur la théorie de l'évolution qui s'avère fausse à la lumière des dernières découvertes en génétique et microbiologie. On n'accroche pas au thème malgré des mécaniques bien pensées.",
    "timestamp": 1736982000
  },
  {
    "username": "Alecevergreen",
    "rating": 2.0,
    "comment": "La preparazione è un incubo di lunghezza. Il gioco è noioso e inutilmente complesso. Passa la voglia di giocare sapendo che più di mezz’ora è necessaria per il setup. bocciato. A mai più",
    "timestamp": 1703458800
  },
  {
    "username": "zaincmt",
    "rating": 2.0,
    "comment": "Missing expansions that were hidden in main objectives. Horrible rubber stamps that stick together, badly designed box and insert. Missing rules and error on some components listing. Really dissapointing.\n\nGameplay wise there is a huge first player advantage. Get discovery make loads money and you will continue lead for rest of game. coins mean so much in this game especially when it comes to repeating actions. And some actions are just naturally stronger especially when objective cards are drawn!",
    "timestamp": 1680040800
  },
  {
    "username": "crabbadon",
    "rating": 2.0,
    "comment": "Heavy and plodding. All sorts of bits and bobs that don't interconnect in interesting or clever ways but look shiny on kickstarter. A pain to teach and a chore to play.",
    "timestamp": 1645398000
  },
  {
    "username": "Nomenos",
    "rating": 2.0,
    "comment": "Bad choices of the colors, it makes me not wanting to play the game.",
    "timestamp": 1610924400
  },
  {
    "username": "ssij",
    "rating": 3.0,
    "comment": "A complex optimization puzzle with no relevant player interaction. Too convoluted for table talk, this game left me wondering where it's social aspect is.",
    "timestamp": 1760479200
  },
  {
    "username": "aeonphreak",
    "rating": 3.0,
    "comment": "Not impressed with this one: overrated. Economy very tight, too tight I'd argue. You get worker cards where you're lucky if you can even complete one the entire game.\n\nComparatively, would rather play other Italian games like Lorenzo/Golem.",
    "timestamp": 1747778400
  },
  {
    "username": "pfctsqr",
    "rating": 3.0,
    "comment": "You will neither experience nor learn anything about Darwin’s theories or explorations in this game. The game uses tracks and tedium to “entertain” players, and that term must be used lightly here. The board is an absolute mess of tiny icons that make the experience far worse than it needs to be.",
    "timestamp": 1743458400
  },
  {
    "username": "Neeby",
    "rating": 3.0,
    "comment": "Its just not fun",
    "timestamp": 1735858800
  },
  {
    "username": "anomander64",
    "rating": 3.0,
    "comment": "Played once on BGA. Did not enjoy it at all.",
    "timestamp": 1727042400
  },
  {
    "username": "Aaron_Dangerman",
    "rating": 3.0,
    "comment": "Way too many parts, requirements, and mechanics; yet it's so easy to prevent yourself from progressing toward a satisfying conclusion.",
    "timestamp": 1724709600
  },
  {
    "username": "cgarvie",
    "rating": 4.0,
    "comment": "about 3 things too many to track.. to much of board is unreadable if sitting in wrong place , and time between turns drags",
    "timestamp": 1760652000
  },
  {
    "username": "logopolys",
    "rating": 4.0,
    "comment": "There were way too many bits and moving pieces in this game. It ultimately boiled down to a worker placement game with a few too many hoops to jump through to make sure that workers were qualified to work. I think it's telling that you could ignore huge swaths of the board. This is not the kind of game that I enjoy. The glut of components and huge swaths of options did not really seem to add anything to the game, and it seemed more tiresome than complex.",
    "timestamp": 1759269600
  },
  {
    "username": "Joel_L",
    "rating": 4.0,
    "comment": "Another mishmash of mechanisms. Has the exploration track from Maracaibo. Has a bunch of worker placement spots that you don't really compete for (only a 2-coin penalty for future visits). Complexity for the sake of it. Meh.",
    "timestamp": 1748556000
  },
  {
    "username": "Micastiz",
    "rating": 4.0,
    "comment": "Bottom line: it is a game with great art, mechanics I generally love, and actions I like doing, but the sum is far less than the parts.\nMore detail: as others have pointed out, going last in the turn order to start the game becomes a nearly insurmountable challenge. Initially, the turn order punishment was not immediately obvious, but after the first round I saw how my opponents all had advances at sea, specimens and money. I followed behind but was out of money at the end of the first round. My first action in the second round was the turn order change, but once again, my opponents grabbed all the best actions, so I spent all my money again to do what my opponents were doing for free. Finally, in the THIRD round, I could actually get in on the \"good\" stuff, but I had no hope to submit original research ( I finally got one before game-end, while my opponents all achieved 4-5) and I had no hope of catching the Beagle. Why create a game that, on the first set of turns, locks those last in the turn order into a nearly impossible situation? Yes, I did score some points, finishing 3rd in our 4-player game and not terribly far behind second. But the outcome was never in doubt and I found myself not caring all that much about the game because I scrounged to do a handful of the interesting combos the initial first and second player were doing over and over and over. And my last turn? I just passed, because once again I was out of money and had nothing to do. I had very little fun in a genre that usually creates tons of fun regardless of who wins.",
    "timestamp": 1745964000
  },
  {
    "username": "jandhi2",
    "rating": 4.0,
    "comment": "I played with a group that was 75% playing this for the first time, but I caught on to the flow and necessary actions a little later than everyone else. In this game, if you aren't first, you're definitely last. My heart was isn't the game after two rounds, so for the two hours after that I was pretty sad to be playing it. Near the end, I perked up a little, knowing I was no competition to anyone and just screwed around with my turns to see if I could accomplish something, anything at all.",
    "timestamp": 1743976800
  },
  {
    "username": "tbrofromspace",
    "rating": 4.0,
    "comment": "I found the central puzzle of this one to not be particularly dynamic. I'm not sure if there's a way in which the specimen collection can't be your primary focus, and watching competent players nearly neutralize each other on the book track isn't that compelling. Might be improved by quite a bit of study, but not sure the design warrants it. I appreciate the attempt to make a responsive and interactive game of this type in the vein of Barrage, but I find both games to be less than fulfilling.",
    "timestamp": 1743631200
  },
  {
    "username": "kReal92",
    "rating": 5.0,
    "comment": "",
    "timestamp": 1758492000
  },
  {
    "username": "Killi",
    "rating": 5.0,
    "comment": "Didn't like the first time I played it, but might give it a 2nd try.",
    "timestamp": 1756504800
  },
  {
    "username": "sykano",
    "rating": 5.0,
    "comment": "insanely boring, brown and not thematic\nmechanics not interesting\n\nI would prefer \"Newton\" over this.",
    "timestamp": 1754344800
  },
  {
    "username": "TharsisRoverPets",
    "rating": 5.0,
    "comment": "The board is a bit too busy so I didn't understand what was going on that well. I think this might fix itself after another play but I didn't think the game was that special.",
    "timestamp": 1753480800
  },
  {
    "username": "dmillar71",
    "rating": 5.0,
    "comment": "This is the Collector's Edition (English)",
    "timestamp": 1753048800
  },
  {
    "username": "Beastly_Venturer",
    "rating": 5.0,
    "comment": "Not really feeling this one like everyone else but only the one play so far. We've seen all of this before and I feel the flow is just not as good as Luciani's better designs...",
    "timestamp": 1752789600
  },
  {
    "username": "Weirdsalmon",
    "rating": 4.5,
    "comment": "4.5/10: Darwin’s journey is a work placement game where you can specialize and upgrade your workers so they get better benefits from actions in the future. It’s full of combo potential and just so many mechanics. I really enjoyed the work placement upgrading, and the combos felt good when I got them.\n\nComponent quality was sad in the retail version. It’s not bad, it’s fully playable, just compared to the deluxe, it made it less enjoyable for me.\n\nWhere Darwin’s journey lost me is in the sheer amount of stuff. I played with the firelands expansion and had to look in the rulebook far more than I like to while playing games. The symbolism was simply so unintuitive it detracted from gameplay greatly. Some symbols were so small they confused players and some are simply to close to each other.\n\nThe board is an absolute mess missing so much contrast. It’s one of those boards where everything blends together and determining what are parts you interact with and what parts are decorative can be genuinely difficult to differentiate.\n\nAt the end of the day , I think if I played this more I would like it. I think that the rulebook layout, design of the board and the massive number of mechanics is too much for me to learn. It feels like in the end, it would be like a 6.5-7/10 but would require so much effort to get there that it is not worth it.\n\nI understand why some people might really like this game, but it’s first impression is simply too much stuff mixed with terrible symbols and a truly eye blurring confusion of a board, that it falls flat for me.",
    "timestamp": 1751925600
  },
  {
    "username": "metelo",
    "rating": 5.0,
    "comment": "After the 1st play, I felt that I had played this game many times in the past.\n\nUnfortunately, after some thinking, I realized the game felt like a very generic \"Italian\" game that has already been done, too similar to many others (Newton, Matter Alma, Tiletum, even TerraMara), but with a theme that really does not click for me.\n\nIt is that I would not play it again, It just felt like I've done before too many times, with a better theme, and a tighter engine.",
    "timestamp": 1747692000
  },
  {
    "username": "Korwin",
    "rating": 5.0,
    "comment": "Play it only once, but something didn't click.\nThe game is very punishing if you do the wrong decision early on. No catch-up mechanism to speak of.\n\nAlso very long, because it is so punishing, you trying to squeeze out everything out of every single turn.",
    "timestamp": 1738018800
  },
  {
    "username": "eldub",
    "rating": 5.0,
    "comment": "Underwhelmed despite high expectations. Couldn't find the fun through the morass of competition over spots that are all kinda necessary, and it wasn't so tight that it felt mutually suffocating; it really just didn't land for me. I see why it's good, but I didn't like it, ultimately.",
    "timestamp": 1736204400
  },
  {
    "username": "KarenAB",
    "rating": 5.0,
    "comment": "Kickstarter",
    "timestamp": 1736118000
  },
  {
    "username": "GroundDoon",
    "rating": 5.0,
    "comment": "too restricted to be fun",
    "timestamp": 1736118000
  },
  {
    "username": "RalfMalf",
    "rating": 6.0,
    "comment": "Not really my sort of game but very good for what it is. If I were a particular fan of this style then I'd probably rate it a 9. As it is, I'd rather play something else.",
    "timestamp": 1762383600
  },
  {
    "username": "Auroric",
    "rating": 5.5,
    "comment": "A tight, punishing, and fairly typical worker placement game. Lots of variability in objectives, crew etc. Money is hard to come by so action spots must be heavily prioritized. I really like the worker upgrade/specialization mechanic, it's quite innovative and fun. The ability to unlock new spots that provide money when used by others is also neat. It all looks fantastic as well.\n\nI don't really love this one though. It's just tracks and point/resource salad. None of the actions feel particularly interesting, and it's a jumping through hoops kind of experience. Go up tracks, get a thing, unlock a thing to go up a track again and complete an objective. Pretty boring. Interaction is sort of present but rarely intentional, although the shared museum score calculation is a cool twist. The game's art looks great, but it can be a little hard to parse; much of it could have been made more clear.\n\nUltimately it's one of those Euros that feels more like a puzzle than a game. Some variable setup, incidental interaction, now go convert things into points. It is fun for a play or two, but doesn't have any staying power. On top of that it's a convoluted teach, so the juice isn't worth the squeeze except with players who are very familiar with this kind of thing.",
    "timestamp": 1761519600
  },
  {
    "username": "VeStil",
    "rating": 6.0,
    "comment": "Combotastic worker placement game that starts out tight, but gradually becomes looser and filled with more options. As themeless and solitaire as only a euro can be and also a bit too luck driven for it's complexity I think. Still a solid design.",
    "timestamp": 1759960800
  },
  {
    "username": "Balthagor",
    "rating": 6.0,
    "comment": "Very long, quite complex, but good.",
    "timestamp": 1759701600
  },
  {
    "username": "enavico",
    "rating": 6.0,
    "comment": "+ Worker specialization (wax seals requirements to place in certain action spaces)\n+ New action slots may be unlocked by the players, and they gain an immediate benefit for doing it\n+ High setup variability\n\n- The game is tight on actions and resources during the first two rounds, but the economy may easily become loose from the mid-game on\n- A game made of several mini-games\n- Lack of originality\n- The Beagle track and the exploration tracks are really dull: uninteresting movements that lead to a chain of bonus, combos and points, over and over during the whole game",
    "timestamp": 1758492000
  },
  {
    "username": "larryjrice",
    "rating": 6.0,
    "comment": "FIRST IMPRESSION:\n\nBGA - learning game. Seems like another fine game from Luciani, but I'm not sure I want to invest the time into learning to play it well. Feels very much like your typical Luciani design. It is very important to keep your ship moving and exploring/discovering new flora.",
    "timestamp": 1757628000
  },
  {
    "username": "Firebees",
    "rating": 6.0,
    "comment": "I've played a few games on BGA now (my friend and I have a habit of playing the same game back to back) and this, for me, does not have a lot of replayability outside of different crew cards and objectives. There is a good game here but it's one I'd have to be in the mood to play and one I have no desire to own.",
    "timestamp": 1756591200
  },
  {
    "username": "Bertuccia",
    "rating": 6.0,
    "comment": "After the first play, it feels a heavier version than Newton, but with new interesting mechanics tied to the theme. After a few more plays, I realised that I really hate some mechanics such as having to keep moving the ship not to lose points or having to pay whenever using actions in diaries already triggered by someone. Prefer other titles from the same author.",
    "timestamp": 1756418400
  },
  {
    "username": "Glanzmuecke",
    "rating": 6.0,
    "comment": "I think this is a great design in terms of a modern Euro, that is not way too much over the edge like any Lacerdas or whatsoever. Still, a lot of thinking and puzzling happens. You have to enjoy to build sequences of actions in your head and to plan them.",
    "timestamp": 1756245600
  },
  {
    "username": "JesseW",
    "rating": 6.0,
    "comment": "It's fine. Kinda repetitive. Expansion may have helped some, but the group didn't care enough to keep trying.",
    "timestamp": 1755900000
  },
  {
    "username": "arturh",
    "rating": 6.0,
    "comment": "(Need to play more)",
    "timestamp": 1755381600
  },
  {
    "username": "Cerebral333",
    "rating": 6.0,
    "comment": "WantToPlay #4",
    "timestamp": 1755381600
  },
  {
    "username": "visard",
    "rating": 7.0,
    "comment": "Worker placement in five rounds. Explore Galapagos and publish your findings. Money is tight for beginners.",
    "timestamp": 1762210800
  },
  {
    "username": "cinnzel",
    "rating": 7.0,
    "comment": "Un juego muy exigente que consigue combos muy satisfactorios. Te verás obligado a adaptarte constantemente, así que de poco te servirá planificar a largo plazo, eso sí, no descuides la investigación de la Teoría de la Evolución porque ahí están más de la mitad de los puntos de la partida.",
    "timestamp": 1762124400
  },
  {
    "username": "Wickedheart",
    "rating": 7.0,
    "comment": "ゲームはともかく、ルールブックがひどい。\n見出しのサイズや章の構成、ルールの記述方法はお世辞にも良いとは言えない。",
    "timestamp": 1760911200
  },
  {
    "username": "Subaru77",
    "rating": 7.0,
    "comment": "Ezek az olaszok továbbra is zseniálisak. Egyértelműen ők ma a legjobb heavy euro játéktervezők. A Darwin nem adja alább, mint a szerzők korábbi játékai: alaposan kidolgozott, rengeteg ötlet, jól összegyúrva, a szokásos stílusban és mechanikákkal, de mégis üdítően másképp. De ezt is megszokhattuk tőlük. Itt is van utazás, egy kis többségi mechanizmus, karakterfejlesztés, akcióválasztás, munkáslehelyezés.\nA külcsín az asztal mellett ülve szemet gyönyörködtető, pedig alapjában véve egy excel-tábla. Nagyon jó a hangulata és élvezetes minden döntés a játékban, feltéve, hogy sikerül elkapnod a játék fonalát. Lehet stratégiákat felépíteni. Viszont aki lemarad, elrontja a partiját, az brutálisan fog frusztrálódni. És ugye nem 1-2, hanem inkább 3 órán át. Azért ez egy nehéz játék, amiben könnyű \"hibákat\" véteni és az eddigi 4 parti alapján azt tapasztalom, hogy a hibákat nagyon-nagyon-nagyon nehéz helyrehozni (pl.: rosszul indított pecsétek, rosszul választott céllapkák vagy a fordulóvégi célokhoz nem jól igazodó lépések: a játék kezdetén nagyon kell a pénz, így a kezdőjátékos komoly előnyt élvez, amit szerintem nem kompenzál eléggé a játék).\nSzóval a Darwin egy grandiózus, látványos, élvezetes játék, sok kemény döntéssel, némi hólabda effektussal.",
    "timestamp": 1759442400
  },
  {
    "username": "fisha",
    "rating": 7.0,
    "comment": "Szokásos olasz hevijuró. Benne bőven a \"ne érezd jól magad\" faktor, mert szűkös tud lenni, de talán annyira nem volt vészes. Aránylag sok akciód van a zsánerhez képest és azért mindig van mit csinálni, amivel előrébb jutsz. A grafikai megvalósítás funkcionális szempontból messze nem lett tökéletes. Ici-pici extra ikonok, alig kivehető akcióhelyek, meg ez a lencsés okoskodás az akcióhelyeken... Nekem tematikailag is kicsit fáj a desing. Mert tök szép, de pont az állatok teljesen háttérbe szorulnak. Picike lapkán, minimális grafika, míg van egy nagy pakli random emberfej a segítő vagy milyen kártyákon. Az akciók is elég erőltettek a téma szempontjából, igazából nem is értem miért erőltették pont ezt témát rá, aminél szerintem találtak volna jobban illeszkedőt is. De összességében jó volt játszani, annyira nem is bonyodalmas már menet közben.",
    "timestamp": 1758232800
  },
  {
    "username": "TowersAlez",
    "rating": 7.0,
    "comment": "Casa",
    "timestamp": 1758060000
  },
  {
    "username": "krll",
    "rating": 8.0,
    "comment": "2025",
    "timestamp": 1762297200
  },
  {
    "username": "Koert",
    "rating": 8.0,
    "comment": "Interesting complex strategy game.",
    "timestamp": 1761951600
  },
  {
    "username": "Leonida_",
    "rating": 8.0,
    "comment": "bello, non troppo difficile ma un po'dispersivo",
    "timestamp": 1761692400
  },
  {
    "username": "RunningRed",
    "rating": 8.0,
    "comment": "Sleeved with:\nGGS10064ML Standard European Matte (62 x 94)",
    "timestamp": 1761519600
  },
  {
    "username": "javierclaveria",
    "rating": 8.0,
    "comment": "Tras leerme las reglas y ver un par de vídeos de partidas. Creo que se puede tratar de un juego agradable pero puede que se agote rápido. Colocación de trabajadores con una pequeña vuelta de tuerca consistente en que dichos trabajadores van \"evolucionando\" permitiéndoles hacer acciones más potentes. Varias zonas del tablero para realizar movimientos e ir recogiendo \"especies\", beneficios y demás.\nEstéticamente bastante bonito.\nMe da la sensación que sigue la estela del resto de los juegos de \"la escuela italiana\" de Luciani.\nTras una partida juego entretenido. Probablemente mejor a tres, cuatro jugadores. Necesarias más partidas para ver si se hace repetitivo",
    "timestamp": 1761256800
  },
  {
    "username": "Qumpelblase",
    "rating": 8.0,
    "comment": "Eigentlich wieder ein klassisches Expertenspiel, bei dem die Mechanismen und Zahnräder zwar gut einander greifen, das für mich aber nichts Besonders macht. Gab es so ähnlich schon dutzende Male und wird es auch weitere Male geben. Was mich an diesem Spiel dann doch reizt ist das Verbessern der eigenen Arbeiter und die enorm kurze Spieldauer von 60-90 Minuten. Das macht mir persönlich einfach mehr Spaß als stundenlanges Grübeln.",
    "timestamp": 1761256800
  },
  {
    "username": "BackInPoint",
    "rating": 9.0,
    "comment": "Great game-many paths to victory, super solid engine building worker placement game. I particularly like that the workers develop and it increases placement opportunities.",
    "timestamp": 1762666980
  },
  {
    "username": "Kayne02",
    "rating": 8.5,
    "comment": "The board art is very clean and beautiful. The components' quality is good and feels very nice to play.\nThe game is simple, the explanation is short and it doesn't reach 2 hours of play.\nThe price in Brazil is very fair (comparing with other prices in Brazil, not with EUR or USD).\nMechanically is very solid, but thematically is really weak.\nAnyway, it's fun to play and I liked it.\n\nThe whole comment is here:\nhttps://docs.google.com/document/d/1s2kg29PrfrjEaUfQsgzwIRBI...",
    "timestamp": 1762297200
  },
  {
    "username": "damaga",
    "rating": 9.0,
    "comment": "▪︎ JUGADORES ÓPTIMO: 3\n▪︎ DURACIÓN APROX: 2 horas",
    "timestamp": 1762210800
  },
  {
    "username": "Matteocascio",
    "rating": 9.0,
    "comment": "Gran bel gioco, molto difficile ma appagante anche nelle sconfitte.",
    "timestamp": 1761778800
  },
  {
    "username": "lobonoir",
    "rating": 9.0,
    "comment": "Fireland Expansion (2023)\nDarwin Worker mini-expansion (2023)\nFalmouth Port mini-expansion (2023)\nAnimal Companion (2023)\nGreat Ship (2023)\nScenarios mini-expansion (2023)\nPirates mini-expansion (2023)",
    "timestamp": 1761519600
  },
  {
    "username": "schnabbo",
    "rating": 9.0,
    "comment": "Great Game, a lot of posibillities",
    "timestamp": 1761429600
  },
  {
    "username": "BionicBeaver",
    "rating": 9.9,
    "comment": "I have the Fireland expansion.",
    "timestamp": 1762210800
  },
  {
    "username": "jann1",
    "rating": 10.0,
    "comment": "Love this game. Theme, components, type of actions you can do. What I love most is the combos you can perform in your turn. 4-5 actions per round for 4 rounds isn't much so it is important to combo and advance in many ways you can. I played it a lot and I love the fact that I still don't have a preferred strategy",
    "timestamp": 1762210800
  },
  {
    "username": "the_mad_baron",
    "rating": 10.0,
    "comment": "Collection: Insert",
    "timestamp": 1759701600
  },
  {
    "username": "MuddyPete",
    "rating": 10.0,
    "comment": "I've been hesitant about giving such a high score, as it took a few games for this to warm. It has hit with a vengeance though!\n\nEach game requires a different strategy and you are forced to adapt constantly. There's no mono-strategy here. It's super tight but there's just the right level of pain and reward.\n\nThe base game appeals more than the Firelands expansion, as it limits in-game randomness.\n\nSolid med/heavy Euro-crunch.\n\nEDIT: I take it back - Firelands is awesome. Limited randomness can be mitigated and it expands the game hugely.",
    "timestamp": 1759442400
  },
  {
    "username": "timkrysko",
    "rating": 9.5,
    "comment": "+ Oceania Expansion\n+ Fireland Expansion\n+ Falmouth Port Mini-Expansion\n+ Animal Companions Mini-Expansion\n+ Darwin's Worker Mini-Expansion\n+ Great Ship Mini-Expansion\n+ Pirates Mini-Expansion\n+ Scenarios Mini-Expansion\n+ Golden Tent Mini-Expansion\n+ Metal Coins\n+ Sleeved Cards\n+ 2x Player Aids",
    "timestamp": 1759010400
  },
  {
    "username": "oforcada",
    "rating": 10.0,
    "comment": "LB",
    "timestamp": 1758492000
  }
]