[
  {
    "username": "T1_Faker",
    "rating": 1.0,
    "comment": "白癡遊戲",
    "timestamp": 1744149600
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "An abstract game about placing patterns, but then you have 3D placing rules (that are so hard to memorize) and animals to give it a little flavor. You tend to place so few animals, you'll probably have a desolate wasteland anyway. Hrmm, at least Ark Nova lives up to its promise. There's 0 interaction, and then someone ends the game before you got your finishing touches. And then you add up points on the SPREADSHEET.\n\nI tried to place terrain for animals, it felt like the only rewarding part of the theme, but it's more difficult than it looks. The discs came out in the wrong order, yet I was still forced to put them down (huh, at least Stefan Feld games are a little generous instead of being a strict puzzle). If you fail at the animals, there's the default terrain scoring so nobody has to feel bad. Plus even MORE calculation to burn up your turn if you're a perfectionist. Probably both are advantages for euro fans, but both are turnoffs for me.",
    "timestamp": 1740006000
  },
  {
    "username": "LewinBGF",
    "rating": 1.0,
    "comment": "I'm sorry but I find the artwork terrible",
    "timestamp": 1737932400
  },
  {
    "username": "Ludwig3366",
    "rating": 1.0,
    "comment": "Un matériel de mauvaise qualité et une absence quasi totale d’interaction.\nUne vraie purge!",
    "timestamp": 1734476400
  },
  {
    "username": "CoreyClark",
    "rating": 1.0,
    "comment": "Seemed fun at first but apparently just the latest in a long line of ripoffs. I must do what I can to counteract the hype around a game devoid of inspiration.",
    "timestamp": 1725141600
  },
  {
    "username": "benzidrine",
    "rating": 1.0,
    "comment": "Amazing game. Game wise 8.5/10 but production quality is so poor and so universally bad that I feel a need to warn people away from its purchase.",
    "timestamp": 1716415200
  },
  {
    "username": "Technon",
    "rating": 2.0,
    "comment": "Disharmonies is a solo / solitaire Game where everyone plays their own little game with their own little board separated from everyone else, and the only interaction with other players in the game consists of competing about limited resources, where someone will take what other players need. Then you compare who collected the most profit. Disharmonies would be a better name for such a silly game, lol",
    "timestamp": 1754517600
  },
  {
    "username": "jtrleone",
    "rating": 2.0,
    "comment": "Wow this game is boring. Very pasted on theme.\nI get what it was going for (spatial building of habitat and animal placement into it) but it just wasn't fun at all. Super multi-player solitaire and very AP prone since you have to react to the new resources on your turn.\n\nThe art doesn't stand out enough and actually gets in the way to the iconography - making the multi-color disc requirement is hard to see.",
    "timestamp": 1753740000
  },
  {
    "username": "yelske",
    "rating": 2.0,
    "comment": "Just boring, we were both done after two plays. Also, production quality is too low for what the price is.",
    "timestamp": 1734217200
  },
  {
    "username": "tectactoe",
    "rating": 2.0,
    "comment": "Cute game, quick game, moderately enjoyable game, found myself getting a little bored with it after about ~10 plays. Random tile distribution and card display ensures variable gameplay but nevertheless things started to feel a little 'same-y' after a while.",
    "timestamp": 1733785200
  },
  {
    "username": "Fevin",
    "rating": 1.9,
    "comment": "C'est pour ce genre de jeux que je prend des notes tellement il est oubliable. Thème ultra rabâché et assez plaqué. Pratiquement aucune interaction tant c'est un solitaire en parallèle et que la lisibilité des autres boards et inexistante. Mécaniquement c'est proche d'akropolis tout en lui étant nettement inférieur car sans fun. Sa seule qualité c'est que le plateau est joli.",
    "timestamp": 1726869600
  },
  {
    "username": "hiimjosh",
    "rating": 2.0,
    "comment": "Dreadful. A totally sterile take and make game with really limited lookahead. Almost totally devoid of tactics. I can see people having fun making shapes, but I don't personally see the point. Play Azul. Play Chakra. Heck, play Cascadia. Why is there buzz around this?",
    "timestamp": 1725400800
  },
  {
    "username": "azeem",
    "rating": 3.0,
    "comment": "A multiplayer solitaire that is as light as Cascadia, but far, far less exciting. Somehow, this game took well over one hour.",
    "timestamp": 1743890400
  },
  {
    "username": "JoeTerra",
    "rating": 3.0,
    "comment": "Good looking game with good mechanics. The problem is that it’s a cash grab. Not an original thread in the whole thing. Absolutely inexcusable for the creators to have conjured such a ripoff of what other designers have made. The fresh paint can’t justify it.",
    "timestamp": 1742425200
  },
  {
    "username": "DoloresM",
    "rating": 3.0,
    "comment": "Très joliment illustré.\nMatériel agréable.\nPar contre très éloigné du thème... Rien de neuf sous le soleil au niveau de la mécanique...\nDéçue.",
    "timestamp": 1740438000
  },
  {
    "username": "Assassine12",
    "rating": 3.0,
    "comment": "BGA",
    "timestamp": 1736809200
  },
  {
    "username": "qtzlboardgamer",
    "rating": 3.0,
    "comment": "Far from harmonious, this Cascadia-like game gives me anxiety over the incorrect placements I'm doing",
    "timestamp": 1736722800
  },
  {
    "username": "Kimball Bent",
    "rating": 3.0,
    "comment": "Interaction between players is non-existent. Random card draws, random tile draws and no ability to plan any layout on your board makes this more of a chaotic exercise than a game. Absolutely nothing new here. I don't get the excitement... bit of a snooze in my opinion.",
    "timestamp": 1736204400
  },
  {
    "username": "Schr0dinger85",
    "rating": 4.0,
    "comment": "Probably the best iteration I’ve played of the multi-solitaire, animal-themed, tile tableau-builder genre (Cascadia, Calico, etc.). The 3D elements are a nice touch, and the cards give you some direction. That said, it’s still clearly not my jam.",
    "timestamp": 1762210800
  },
  {
    "username": "tang tang",
    "rating": 4.0,
    "comment": "River disc is damn unbalance on side A.",
    "timestamp": 1759788000
  },
  {
    "username": "NaokoBP5",
    "rating": 4.0,
    "comment": "Typical game which we do something on own board and gain more scores. I do not know, maybe somehow I played this kind of games too much and got a bit of bored.",
    "timestamp": 1758146400
  },
  {
    "username": "sykano",
    "rating": 3.9,
    "comment": "yet another animals puzzle game\noverrated, not that good\ngameplay a bit clunky\nvery abstract\n\nlooks a lot like \"Reef\"\n\"Reef\" meets \"Cascadia\", but less clever",
    "timestamp": 1754344800
  },
  {
    "username": "lukestrotz",
    "rating": 4.0,
    "comment": "Exactly the wrong kind of player interaction for me. It's multiplayer solitaire with an annoying draft. You generally screw with your opponent(s) not because you planned to, but because you just took the thing you wanted that they might have wanted too.\n\nBetween the tile clusters and the cards, It's also got too much randomness. Someone might just get two great cards that work together and there was nothing you could do to stop them. The inability to actively refresh the tile clusters you can choose from also leads to some annoying turns that can swing games (your opponents get the tiles they need, you don't and are forced to clog up your board). Too many times there's only one set of tiles that are even partially useful and invariably someone else takes that cluster before it's your turn. The cards also feel unbalanced in terms of how they score. Some are just so much better than others (easier to do and get you plenty of points).\n\nThe push-pull between the two scoring types (arrangements on cards versus the tiles themselves) is obviously the point of the game but it just becomes all a bit of a mess and the aforementioned randomness makes it feel more lucky than skillful (getting right tiles at right time makes a massive difference to your final result). It is worth noting however, that someone who knows all the cards has a distinct advantage, as they know what tile arrangements are possible to score and what synergies might be worth building towards (you can't guarantee you'll get that card, but at least you can give yourself the option by arranging your tiles in an appropriate way if you have no other driver behind placement of a tile).\n\nI'm also yet to see any reason not to play a rush strategy. Building up is just too slow and unless everyone does it, you'll not get anything finished in time and score poorly. This is especially true if you get animal cards that help with this (one that score for combinations of single layer pieces)",
    "timestamp": 1754085600
  },
  {
    "username": "Zaungast",
    "rating": 4.0,
    "comment": "Abstract game with simple rules and beautifully implemented nature theme, where big wins and big defeats feel the same until the point salad at the end.",
    "timestamp": 1751925600
  },
  {
    "username": "Euroman",
    "rating": 5.0,
    "comment": "Another Multi-Player Solitaire\nI am not a fan of MPS games and this one has problems beyond that. Mainly - you can't see your own board! Also, some draw choices can be perfect for your strategy, but of course that pile is taken by the person before you.\nAlong with a strong luck factor, this game can bring out the AP in some players who want to maximize every point. If someone does this and calculates the multitude of possibilities, their turn can take forever.\nCombining Luck, MPS, and AP - not fun.\nWill play if required to do so by the group or for quid pro quo.",
    "timestamp": 1762470000
  },
  {
    "username": "pWmonolith",
    "rating": 5.0,
    "comment": "1-4 Spieler",
    "timestamp": 1761865200
  },
  {
    "username": "jagiell82",
    "rating": 5.0,
    "comment": "Not the Cascadia killer for which I did nothing",
    "timestamp": 1761778800
  },
  {
    "username": "Dasoogle",
    "rating": 5.0,
    "comment": "It's okay",
    "timestamp": 1761429600
  },
  {
    "username": "btasam",
    "rating": 5.0,
    "comment": "The games looks lovely but after a few turns, it becomes an abstract soup of colors. Thanks to BGA, I don't really have to calculate any scoring which would only hurt this game more.",
    "timestamp": 1759874400
  },
  {
    "username": "jojajo",
    "rating": 5.0,
    "comment": "Although the game mixes elements from Azul, Cascadia, Tiny Towns, Calico and Azul; Queen's Garden, it never exceeds any of these games.\nIt plays best at two, so that the pace won't slow down. Design is interesting, execution feels a bit poor. Our pouch ripped after three plays, player-boards and -cards bend so that components sometimes fly over the table and somehow the box is a bit too small, so I had to remove the inserts to snug it all in.\nStill, we enjoy playing it as a family of four. It is easy to explain, easy to understand and easy to play. A brain-burner it isn't but rather a nice puzzle.\n\nEDIT: I am upgrading this from a 6 to a 7 since my children of 9 & 10 really like it and we therefore play it on a daily basis. A family-game it is.\nEDIT EDIT: After a week we suddenly all stopped playing it. Final score: 6.8\nEDIT EDIT EDIT: no-one ever wants to play it anymore, we were all fed up by it after a week. Don't understand the hype, actuallly. Final final score: 5.",
    "timestamp": 1758405600
  },
  {
    "username": "pitonowie",
    "rating": 5.0,
    "comment": "Based on online plays\n- as asolo /solitaire maybe is OK,\n- but I don't like multiplayer solitaire game type\n- mechanics and my feelings are like: \"that was used already & I've played similar (better) games\".\nI'm not a target - too simple, too much solo factor",
    "timestamp": 1757800800
  },
  {
    "username": "macUladh",
    "rating": 5.0,
    "comment": "",
    "timestamp": 1756936800
  },
  {
    "username": "CTreader",
    "rating": 5.0,
    "comment": "Um... Quite random, lack of strategy",
    "timestamp": 1754863200
  },
  {
    "username": "littlechandler",
    "rating": 5.0,
    "comment": "I generally dislike pattern building, but I have had multiple people say that Harmonies is better than all the other pattern building games. I mean, maybe it is one of the best patter building games. But not in a way that makes someone who doesn't like pattern building to like it. This one combines the base scoring system of just build certain sets with trying to also simultaneously score certain configurations on the animal cards. It is all very abstract and if it wasn't for the theme and art I doubt this game would have 10% of the popularity it has had. I respect the game more than Cascadia at least of having more hard choices than that game, and having some decisions of when you want to commit to a new animal objective or not.\n\nI heard someone else describe it as the best of Azul and Cascadia, and maybe of Cascadia, but not of Azul. Well, it doesn't have the worst of Azul either, the board state changing too dramatically so you have to really path out the possibilities, but it also lacks the ability to screw over your opponent as much as Azul that those dramatic board state changes caused.",
    "timestamp": 1752962400
  },
  {
    "username": "Fierezza",
    "rating": 5.0,
    "comment": "Online gespielt",
    "timestamp": 1752703200
  },
  {
    "username": "seb_48784",
    "rating": 5.0,
    "comment": "after about 1 play on BGA: I carefully worked my way through the tutorial and played a full game on BGA to try and understand the hype — but I couldn’t. The theme feels pasted on; to me, it’s an abstract game. The decisions didn’t feel satisfying, but rather exhausting. You’re expected to build and recognize patterns, and I kind of struggle with that. I guess my spatial thinking just isn’t suited to this type of game.",
    "timestamp": 1751407200
  },
  {
    "username": "CarsonChandler",
    "rating": 6.0,
    "comment": "Not enough going on in this one for me.",
    "timestamp": 1762648260
  },
  {
    "username": "quietcorn",
    "rating": 6.0,
    "comment": "In this game you select a circle that contains three discs of varying colors from an array of available sets of three. You then must place the discs on your player board. Discs can stack on each other and there are endgame VP rewards for having discs in certain patterns and heights. In addition to this, you may select one of five animal cards from the display. Each animal has a pattern on it which when met allows you to remove a cube from the card and add it to a stack of discs on your board. The animal card scores for how well you emptied it of cubes and the cubes also make it so you can no longer stack discs on top.\n\nThe game feels very similar to playing Cascadia. Although the stacking element is cool, it doesn't actually add a lot to your options. This game actually feels less player interactive than Cascadia since everyone is working at their own personal goals rather than everyone sharing the same goals so the tile draft isn't as tense. It's also a little irritating that the patterns on the animal cards need to be met exactly and the board spaces are shaped in such a way that some patterns can only be completed horizontally and not vertically.",
    "timestamp": 1762297200
  },
  {
    "username": "ruvaak",
    "rating": 6.0,
    "comment": "Nice art, elegant system, but\n- no interaction at all\n- no usefull hate draft\n- claustrophobic gameplay like Calico\n- cards and board bed like crazy, it's very bad since we need to put tokens on it.\n- cards pain/points/occurrences ratio is unbalanced",
    "timestamp": 1762124400
  },
  {
    "username": "toucana",
    "rating": 6.0,
    "comment": "Impression: Average\n\nNot surprisingly, I am lukewarm on all take-and-makes. This is no exception. Harmonies is a solo puzzle stretched to accommodate 4 players with the only interaction coming from choice denial when taking items/cards. Here, players choose a group of terrain tokens and/or scoring cards from the central tableau to build a personal ecosystem. Once again, players are confronted with a dozen scoring variables and maximizing placement to optimize scoring. Because many things can score points, every one must decide which ones to score. The good thing is that the puzzle is slightly more interesting than Cascadia and slightly less complicated than Spectacular - which makes the game a much better fit for me. I am ok to play again, but see no reason to pick up a copy.",
    "timestamp": 1762124400
  },
  {
    "username": "DaneTheBeast",
    "rating": 6.0,
    "comment": "Played (TTS)",
    "timestamp": 1762038000
  },
  {
    "username": "Rafa44",
    "rating": 6.0,
    "comment": "Azul and Cascadia had a baby.",
    "timestamp": 1761778800
  },
  {
    "username": "burgundy90",
    "rating": 6.0,
    "comment": "I'm usually fine with abstract games and tile placement (e.g. Azul, Reef, Cascadia), but this didn't click. It was almost too thinky in what I want in an abstract game that plays in under an hour. Like an unexpected mental drain. Or perhaps an incorrect perception of wanting this to be a short relaxing game, to \"recharge\" mentally between heavier games. Playing this drained me more than anything. Cascadia had more of an openness in its gameplay that felt better for its weight. It's odd, but those are the feelings playing Harmonies evoked nonetheless.",
    "timestamp": 1760738400
  },
  {
    "username": "theaaron",
    "rating": 6.0,
    "comment": "Pretty fun game. I originally thought it might be too similar to Reef because of the way you stack pieces and make patterns to score points. This game feels completely different, though.\n\nWhile Reef is the better game, Harmonies is fun enough and plays quickly.",
    "timestamp": 1759960800
  },
  {
    "username": "Viziviz",
    "rating": 6.0,
    "comment": "Nice and beautiful looking game. Kind of cozy play wich is quite strategic and hard to master. However it's very solitaire and therefore I'm not really interested in playing it with 3 to 4 players. If you want to have more interaction Azul might be the better choice.",
    "timestamp": 1759615200
  },
  {
    "username": "gec80",
    "rating": 6.0,
    "comment": "Played at Marnix & Marlous",
    "timestamp": 1759442400
  },
  {
    "username": "logopolys",
    "rating": 6.0,
    "comment": "Parts of Harmonies reminded me of Quadropolis, with its drafting of tiles to make special scoring patterns. I was also reminded of Wild: Serengeti, although in contrast, Harmonies did not go way too long and was actually fun. This was a fairly low interaction game and planning ahead was difficult due to the draft options being so fluid. Despite these issues, I liked the game and I would be open to playing it again.",
    "timestamp": 1759356000
  },
  {
    "username": "Frog0fWar",
    "rating": 6.0,
    "comment": "2-3",
    "timestamp": 1758751200
  },
  {
    "username": "BretonJack",
    "rating": 7.3,
    "comment": "Good game but also very overrated.",
    "timestamp": 1762124400
  },
  {
    "username": "Stormcow",
    "rating": 6.5,
    "comment": "The emergent structures that you build, seeded by the random draw of resource tokens and animal cards, is fairly interesting, however it is essentially head down multiplayer solitaire. Ah ha! you say, clearly there is interaction in the drafting of the tokens and cards. Not really, as not only is it impractical to predict what your opponent will want from across the table, hate drafting is just as likely to mess up your build as to starve your opponent's. Probably better to lean into it and call this a 2p or solo game.\n\nCan't help but compare this to Azul, which has a more interesting draft phase that is supported by a more straightforward and legible build phase.",
    "timestamp": 1761951600
  },
  {
    "username": "celenac",
    "rating": 7.0,
    "comment": "Lightweight. Relaxing. Neat puzzle.\n\nCompared to Cascadia, it feels less finicky, like it has a cleaner game design, like it'll have higher replayability naturally without needing \"more challenging\" variants/modes. It also feels more relaxing to play. How different things score seems easier to track because how the landscape scoring works is the same all the time.\n\nHowever, it also feels less interactive. Very solitude. Not as cutthroat as Cascadia, where everyone has the same goals so it's easy to track what other players are doing. In this game, players have different patterns/goals they are trying to build because they can pick up different animal cards. Players end up just focusing on what they're doing.\n\nI'm not a solo board game player, but I actually wouldn't mind playing this game solo.\n\nBeautiful artwork and simple, but quality production. Love that it doesn't take much space either. In Cascadia, you would need to build outwards, but in Harmonies everything is confined in the size of the player board.",
    "timestamp": 1761865200
  },
  {
    "username": "microWolf",
    "rating": 7.0,
    "comment": "A fantastic short game to play with beginner players, but can also be fun as a warm-up game on a game night. I love the art, while gameplay would benefit from an expansion to add some complexity.",
    "timestamp": 1761778800
  },
  {
    "username": "gr9yfox",
    "rating": 7.0,
    "comment": "In Harmonies players draft colored tokens to build habitats to match their animal cards for points. In this way players will be defining how they are going to score, which affects their future plans.\nSimple rules, smooth gameplay, some tricky scoring conditions which add different layers of priorities to every choice.\nA great production, with chunky wood components and beautiful artwork where every card had a different habitat and animal on it.",
    "timestamp": 1761778800
  },
  {
    "username": "Blackhearted89",
    "rating": 7.0,
    "comment": "Good game, easy to learn hard to master, but like in Cascadia- there is almost no player interaction.",
    "timestamp": 1761692400
  },
  {
    "username": "bigfootjedi",
    "rating": 8.0,
    "comment": "Great alternative to Cascadia. I like all the ways to score your tableau as you draft pieces and scoring cards. I'm not sure which game I like better.",
    "timestamp": 1762652460
  },
  {
    "username": "Lindemann08",
    "rating": 8.0,
    "comment": "En solo",
    "timestamp": 1762631040
  },
  {
    "username": "ReptilianSamurai",
    "rating": 8.0,
    "comment": "Easy to learn, quick to play, but with intriguing decisions to make. Fun individual tile laying and pattern matching. Just wish there was a way to flush the cards if you don't like any of your choices.",
    "timestamp": 1762624680
  },
  {
    "username": "arildoaim",
    "rating": 7.7,
    "comment": "Very good",
    "timestamp": 1762612560
  },
  {
    "username": "Dr_IJ",
    "rating": 8.0,
    "comment": "Simple, fast and thinky. Did not like it at first but revisited it a year later and after all the hype and it shines now to me",
    "timestamp": 1762561980
  },
  {
    "username": "Ari88",
    "rating": 8.0,
    "comment": "Sleeve Kings 70x120\nWOTR\nSKS-8814",
    "timestamp": 1762470000
  },
  {
    "username": "Whodini24",
    "rating": 9.0,
    "comment": "Azul meets Reef",
    "timestamp": 1762628880
  },
  {
    "username": "AidnOne",
    "rating": 9.0,
    "comment": "Everything works well. Excellent for two players. Lots of replayability.\n\nI love Harmonies",
    "timestamp": 1762628460
  },
  {
    "username": "marek_orsulik",
    "rating": 9.0,
    "comment": "Base: 707",
    "timestamp": 1762470000
  },
  {
    "username": "smriera",
    "rating": 9.0,
    "comment": "Magnífico juego de colocación de losetas, en solitario o a más jugadores",
    "timestamp": 1762470000
  },
  {
    "username": "ingg",
    "rating": 8.5,
    "comment": "타오바오 patron 카드슬리브",
    "timestamp": 1762470000
  },
  {
    "username": "CreacK",
    "rating": 9.0,
    "comment": "This game has quickly become one of my favorites. It's drafting and tile placement offer up challenges and the goal cards offer variety and makes each game different.",
    "timestamp": 1762470000
  },
  {
    "username": "DBKH",
    "rating": 10.0,
    "comment": "My review after 100+ games: still not tired to play it, always satisfying to play.",
    "timestamp": 1762038000
  },
  {
    "username": "JeckZz_",
    "rating": 10.0,
    "comment": "It's simple and easy to explain (which makes it quick to teach people), yet strategic game.\nTheatmosphere and artwork are top-notch.\nThe only downside is that you're playing more for yourself, but is that really a downside in that case?\nFreaking love this Game",
    "timestamp": 1762038000
  },
  {
    "username": "mathew_t7",
    "rating": 10.0,
    "comment": "The game is just so visually appealing! it also tests how well you can recognize patterns. I've had a ton of fun playing this game and I believe it has high re-playability value as well",
    "timestamp": 1761951600
  },
  {
    "username": "werkstatton",
    "rating": 10.0,
    "comment": "No insert needed",
    "timestamp": 1761778800
  },
  {
    "username": "Crow_Theater",
    "rating": 10.0,
    "comment": "I don't know why I hesitated til now to get this beautiful game. Very simple rules but depper strategic puzzly asymmetric. If you have issue to bring nonplayers on the table, this is it.\nSometimes it burns your head to organise your habitant in your ares.",
    "timestamp": 1761692400
  },
  {
    "username": "Halix96",
    "rating": 10.0,
    "comment": "Absolutely love it, one of my favourite!\n\nAnyone can help to get the PROMO PACK? ??",
    "timestamp": 1761692400
  }
]