[
  {
    "username": "kanishknishar",
    "rating": 1.0,
    "comment": "No.",
    "timestamp": 1747778400
  },
  {
    "username": "cotomel",
    "rating": 1.0,
    "comment": "Lacerda fans abusing BGG rankings typical.",
    "timestamp": 1732748400
  },
  {
    "username": "Bnl88888",
    "rating": 1.0,
    "comment": "Nothing new",
    "timestamp": 1732489200
  },
  {
    "username": "Peter Loftus",
    "rating": 2.0,
    "comment": "Up there with the best in my collection. My fave Lacerda and that is saying something. Awesome.\n\nBut then... playing with a group - constant referral back to rules - pure trauma. Downgraded socre from 10 to...",
    "timestamp": 1694296800
  },
  {
    "username": "Vasco0560",
    "rating": 2.0,
    "comment": "The game plays you. You don't even feel the theme.\nOverrated, overproduced, overcomplicated.",
    "timestamp": 1670886000
  },
  {
    "username": "Nizzamko",
    "rating": 2.0,
    "comment": "Hmmm... Incredibly Bad.\nJust a very big bulk of mechanics which are mostly auto-rotatable. I'm working almost 11 years on production and it's so visible, that during game creation mostly on mechanics synergy author concentrated. The game weight rate also not representative.",
    "timestamp": 1630620000
  },
  {
    "username": "Benoitl33",
    "rating": 3.0,
    "comment": "Quite frustrating. Overpowered scoring cards that appear randomly. Strategy not obvious, it's more a matter of optimizing in the short term. Too many moving parts to plan anything. No interactions. Bad rules writing.\n\nNot worth the effort.",
    "timestamp": 1760392800
  },
  {
    "username": "tectactoe",
    "rating": 3.0,
    "comment": "Things I really love about this game: (1) The theme, (1) the main worker placement and action-order mechanism, and (3) the delicate dance of strategically placing your workers in order to influence Sandra's next department. All very fascinating, making for an overall tense and enjoyable game. But it does suffer from a lot of the same issues I've had with other Lacerda games. Excruciating setup/teardown time and number of components and little fiddly rules; the relentless interlocking of mechanisms makes things annoyingly opaque at times (though not as bad as in, say, LISBOA or ON MARS); much of the scoring again comes from totally random objective tiles that award points for arbitrary actions. Lastly, while I understand that the theme is meant to inform the mechanics, the general gameplay flow felt slightly on-the-rails throughout my several plays. That is, repeating the same cycle of getting blueprints, ordering parts, pushing cars out, then getting them into your garage. It's a good game, not quite a great one.",
    "timestamp": 1733785200
  },
  {
    "username": "ultimoratio",
    "rating": 3.0,
    "comment": "Played Kanban EV. It’s good. Its complexity gets better when the various mechanisms all mesh together very well. Players get parts which allows players to build cars, which allows players to grab cars. Grabbing models which you either use for upgrades or grabbing cars to score you pts. The pts is determined based on how much the car is upgraded collectively by all players and how many times a specific upgrade is used for all cars. So it has that player synergy that I really like.\n\nBut it all felt a bit too loose and a bit out of control. Too many steps where you get a small number of pts every time and I feel that tactics felt a bit too prevalent at some certain points in the game. Even the meeting, which is suppose to be about strategic planning, has this almost obvious decisions - even when to play a meeting card from your hand and which meeting card to play is obvious.",
    "timestamp": 1732402800
  },
  {
    "username": "adamscott",
    "rating": 4.0,
    "comment": "I keep thinking that I should love Lacerda games, but I've now tried four and none have been up my alley. In theory, they should be my type of game, but....\n\nThis one had very few action spots and needing to match up the colours you need isn't very fun. The meeting mechanic felt tacked on and pretty luck-based. I also strongly disliked the way the cars came out.\n\nOverall, very heavy/fiddly and the gameplay didn't do nearly enough for me to justify the time investment.",
    "timestamp": 1751407200
  },
  {
    "username": "iplaybgnaked",
    "rating": 4.0,
    "comment": "An alright \"do x to do y to do z\" worker placement game from Lacerda, although you can pivot and do things different, you tend to stick to the same sequence of moves with each play so the game starts to feel samey after a while.",
    "timestamp": 1738623600
  },
  {
    "username": "saoirseclerks",
    "rating": 4.0,
    "comment": "拒绝为复杂而复杂，题材无聊，玩法机制复杂得毫无意义，如果你喜爱看板，那我们聊不来。",
    "timestamp": 1735945200
  },
  {
    "username": "invervegas",
    "rating": 5.0,
    "comment": "Complexity √",
    "timestamp": 1742252400
  },
  {
    "username": "BBorneo",
    "rating": 5.0,
    "comment": "For the complexity, one of the least rewading games. The theme is overused imo. Close to no asymetry. There are very few comboes one can do, its pretty much an efficiency race. The resource acquisition really didnt need cards since pretty much all of them are identical. The scoring cads are too random for that level of complexity. Otherwise has some interesting mechanisms, especially the action selection and ordering is pretty interesting and provides plan ahead opportunities where players can show off skill.",
    "timestamp": 1738450800
  },
  {
    "username": "Knoqx",
    "rating": 5.0,
    "comment": "Rating based on 1 play",
    "timestamp": 1724277600
  },
  {
    "username": "Scifi66",
    "rating": 5.0,
    "comment": "Some minor rules changes (Sandra is a bit tougher) but overall the game played very similarly to previous version. It is a tight tussle and can be frustrating when you are locked out of a department - but it is a solid ride.\n+ Theme changed to EVs - the way of the future!\n+ New components/player boards are lovely.\n- Board redesign and colour changes made it harder not easier to work out which training element belonged to which department. I'm sure that would pass with more plays but I moved the wrong token a couple of times during both plays which we had to adjust later.",
    "timestamp": 1722636000
  },
  {
    "username": "Desigual",
    "rating": 5.0,
    "comment": "Kanban and The Gallerist are the best games of Vital Lacerda.",
    "timestamp": 1712700000
  },
  {
    "username": "MScrivner",
    "rating": 5.0,
    "comment": "Uses arbitrary restrictions and mechanical limitations to simulate the challenge and conflict normally present in games. The epitome of complex without being deep. Made me tired and angry to play. Fuck Sandra and all the Sandras of the world.",
    "timestamp": 1703113200
  },
  {
    "username": "Imsevimse",
    "rating": 6.0,
    "comment": "Gorgeous components, with lavish wooden cars and a cleverly designed board that truly brings the theme to life. Unfortunately, the focus on thematic connections makes the gameplay feel restrictive and repetitive. There are no big plays, no standout features, and no satisfying arc, leaving me with little desire to revisit it.",
    "timestamp": 1758924000
  },
  {
    "username": "Ryanelrichie",
    "rating": 6.0,
    "comment": "Brilliant design with awesome art. How everything works together is really genius. Unfortunately it felt like running through waist high mud. Getting things down takes so many prerequisites and moves before. For a game about making cars, I made 2 in almost 3 hours. Never felt exciting or like I was building up to big moves. Just a long series of small steps the whole time. Was fun at times but just slow to get to the fun times.",
    "timestamp": 1757368800
  },
  {
    "username": "philosophy66",
    "rating": 6.0,
    "comment": "Not a bad game if this is what you enjoy, not something I'd go seeking out to play if there were other options.\n\nLots of rules, lots of setup, lots of options, and little to no interaction aside from blocking a spot. It's also long and will require a couple playthroughs to understand all of the options, scoring criteria, and how to build a strategy.",
    "timestamp": 1754776800
  },
  {
    "username": "selvalabelva",
    "rating": 6.0,
    "comment": "Brainburn         Longevity    \nLuck impact       Rules/Setup  \nInteraction       Involvement  \n\nAftertaste           Enthusiasm   \n\n Played at 4 player count only\n Rated base game w/o additional modules\n Reccommended solo\n Replayability improved with Speedcharger exp.\n Confrontation: indirect\n\n Efficiency puzzle-like design\n\n Exceptional production quality",
    "timestamp": 1751320800
  },
  {
    "username": "Dayfall",
    "rating": 6.0,
    "comment": "Only commenting with four players and assuming we played the rules correctly. There was way too much down time when it seems like it could have been simultaneous action. The restriction on which car parts you could use to build a car was irritating and we still can't figure out why there were speech bubbles in our player colors.",
    "timestamp": 1750456800
  },
  {
    "username": "ptrdpp",
    "rating": 6.0,
    "comment": "A great game ruined by the psychedelic art of Ian O'Toole. I wonder if he was on LSD when he was working on this game.\nIt's weird that Lacerda allowed him to use these colors because his games are so very thematic while fluo colors don't fit the automotive theme at all.",
    "timestamp": 1739487600
  },
  {
    "username": "Iraperkins82",
    "rating": 6.9,
    "comment": "One of my absolutely favorite games. You can try and pry it out of my cold dead hands.\n\nPhenomenal.",
    "timestamp": 1762665540
  },
  {
    "username": "E78990",
    "rating": 7.0,
    "comment": "Played once. Too much",
    "timestamp": 1762210800
  },
  {
    "username": "bomberleung",
    "rating": 7.0,
    "comment": "BGG52\nWorker placement\nAmazon HKD950",
    "timestamp": 1761256800
  },
  {
    "username": "Felwin",
    "rating": 8.0,
    "comment": "LANG -- 3:30 Stunden -- Komplexität 4+\nOkay @ 2-4 -- Good @ 2-4 -- Best @ 3-4\nLetztes Spiel 06/2024",
    "timestamp": 1761084000
  },
  {
    "username": "ScotchYeti",
    "rating": 8.0,
    "comment": "Excellent worker placement game where it's a lot of fun to manipulate the parts and cars. The solo implementation is fantastic. You can't just mind your own business because Sandra might fire you at the end of the week and the two Bots take away upgrades and cars.\n\nAt the moment I like Weather Machine a bit more.",
    "timestamp": 1760479200
  },
  {
    "username": "Jumicorinbo",
    "rating": 8.0,
    "comment": "I liked it so much I bought an EV.",
    "timestamp": 1760479200
  },
  {
    "username": "RobyaVP",
    "rating": 9.0,
    "comment": "Solo, 3 player",
    "timestamp": 1762653660
  },
  {
    "username": "ditterio",
    "rating": 9.0,
    "comment": "Player aid: https://boardgamegeek.com/filepage/198647/veectors-playerade\n\nComplete compact rules: https://boardgamegeek.com/filepage/218855/action-andy-kanban...\n\nQuick summary with solo: https://boardgamegeek.com/filepage/235686/kanban-ev-quick-su...",
    "timestamp": 1762297200
  },
  {
    "username": "carlzzzjr",
    "rating": 9.0,
    "comment": "Great worker placement game. Excellent turn order/ action selection mechanism with a pesky boss. It's a game about work but is still fun.",
    "timestamp": 1762297200
  },
  {
    "username": "yeknom02",
    "rating": 10.0,
    "comment": "Lacerda's best game to date, in my opinion. Probably the most clear-cut connection between thematic goals and in-game execution. What could be better than designing the next generation of cars? Scoring victory points for being the best to brag about it.",
    "timestamp": 1762383600
  },
  {
    "username": "masterlelik",
    "rating": 10.0,
    "comment": "boardgames\n(once)\nO",
    "timestamp": 1760997600
  },
  {
    "username": "Cookie316",
    "rating": 10.0,
    "comment": "Best game I've ever played. A masterpiece.",
    "timestamp": 1759269600
  }
]