[
  {
    "username": "zmartianov",
    "rating": 1.0,
    "comment": "This game glorifies animal abuse in its title",
    "timestamp": 1754604000
  },
  {
    "username": "Esyhpe",
    "rating": 1.0,
    "comment": "Répétitif, mais en plus petit",
    "timestamp": 1736463600
  },
  {
    "username": "ourmove123",
    "rating": 1.0,
    "comment": "An RPG dungeon-crawler with an interesting book-map and enemy score card system.\n\nAs an experienced player in RPGs, I'm looking forward to playing more scenarios.\n\nThe initiative and top-or-bottom card system is different/interesting so far.\n\nI'm looking forward to trying other characters, seeming upgrades, and playing more scenarios.\n\nThe theme to me is good, and the artwork is okay.\n\nThe components are okay.\n\nThe map-book system is amazing, and I think a lot more games can utilize this design!\n\nUpkeep is too stressful and not fun!\n\nThe upkeep breaks immersion constantly, so it's difficult to be engaged.\n\nTop-or-bottom action choice was interesting at first, but eventually felt meh.\n\nSetup and teardown is a lot of work.\n\nStory is not interesting.\n\nThe only redeeming aspect I can see so far is the map book system.",
    "timestamp": 1721512800
  },
  {
    "username": "Username20250806",
    "rating": 1.0,
    "comment": "GH B&B Gamefound campaign does not deliver. No communication with Cephalofair.",
    "timestamp": 1716847200
  },
  {
    "username": "Gamil_",
    "rating": 1.0,
    "comment": "After repeated plays, I just despise the way turns are played out, notably the card system used.",
    "timestamp": 1704409200
  },
  {
    "username": "Floating World",
    "rating": 1.0,
    "comment": "Expansions should not be ranked",
    "timestamp": 1686261600
  },
  {
    "username": "mdean",
    "rating": 1.0,
    "comment": "This was an own goal really",
    "timestamp": 1682546400
  },
  {
    "username": "Beedun",
    "rating": 1.0,
    "comment": "Meh.",
    "timestamp": 1682287200
  },
  {
    "username": "Thierrex",
    "rating": 1.0,
    "comment": "Boring repetetiv gameplay. I rather watch paint dry.",
    "timestamp": 1676761200
  },
  {
    "username": "esfive",
    "rating": 1.0,
    "comment": "Bloated, trash game",
    "timestamp": 1674342000
  },
  {
    "username": "marcopac74",
    "rating": 1.0,
    "comment": "this game is simply too fiddly, too many variables, too many things to keep track of, I cannot even imagine the original gloomhaven, I really wonder how people can actually enjoy that game",
    "timestamp": 1669935600
  },
  {
    "username": "Peter Loftus",
    "rating": 1.0,
    "comment": "Slightly less annoying than the original version. Just a mess of rules and cards everywhere - I spend more time managing all that than concentrating on gameplay. Tempted to fling it in a bin. Will give it another session before deciding.",
    "timestamp": 1665957600
  },
  {
    "username": "larrydurbin",
    "rating": 1.0,
    "comment": "Just as shallow as Gloomhaven. Most overrated franchise ever.",
    "timestamp": 1664316000
  },
  {
    "username": "ZigZagPunch",
    "rating": 1.0,
    "comment": "Fuck this game. Horrendously imbalanced (Infinite range retaliate 3? GFY), terribly weak characters (Voidwarden is literally unplayable.), worse pieces (why are the monster bases so tight?)\n\nThe only thing this game was good for was the first 5 scenarios to teach friends before we bought bighaven",
    "timestamp": 1663192800
  },
  {
    "username": "Thizizit",
    "rating": 1.0,
    "comment": "If this is Gloomhaven lite, I’m staying far away from anything GH.",
    "timestamp": 1662847200
  },
  {
    "username": "joven11",
    "rating": 1.0,
    "comment": "just not what I'm looking for in a boardgame",
    "timestamp": 1659391200
  },
  {
    "username": "sykano",
    "rating": 1.0,
    "comment": "just a dungeon crawler\njust an introductory version for the full \"Gloomhaven\"/\"Frosthaven\" game\n\nAt least it is a more reasonable package than the full game version.\n\nLegacy and stickers suck!\nbox a bit too small",
    "timestamp": 1659218400
  },
  {
    "username": "Klubriviu",
    "rating": 1.0,
    "comment": "It's not 1 but it's waaaaay to overrated. The story is bad, the number of elements unnecessary big, lots of types of monsters which are basically the same. The game is a dungeon crawler with a combat which gest less satisfying each long or short rest till you're 100% on autopilot. Funny enough - for a dungeon crawler you have no \"advantage\" (for position), no area of control or anything like that. This feels like a computer game with bad and extremely linear story line with combats which feel the same every time. The game is easy possible to finish and once I've done that - I have no idea what to do with it. I won't play again (re-learling everything + long setup time), it's difficult to sell because it provides bad 2nd hand owner experience (unsealed boxes, used map) and it feels bad to throw away. So I guess I'll have it on my shelf for the rest of my life and mind you this is a big and have box. 4/10 - would not recommend unless you're looking for co-op in which 1 person can't command all the others and you have lots of time (in that case it's solid 8/10 for that specific purpose but not because it's a good game).",
    "timestamp": 1641682800
  },
  {
    "username": "salane",
    "rating": 1.0,
    "comment": "Someone told me this game is bad and I believe him.",
    "timestamp": 1634680800
  },
  {
    "username": "gibby290",
    "rating": 1.0,
    "comment": "Unpopular opinion, I don't like Gloomhaven",
    "timestamp": 1624744800
  },
  {
    "username": "BannKieMoon",
    "rating": 1.0,
    "comment": "Stupid game - it is not worth beeing inside of the Top 100.\nIt's like a modern marvel movie. Worthless!\nYou won't remember in 30 years (I hope)",
    "timestamp": 1618696800
  },
  {
    "username": "debelbot",
    "rating": 1.0,
    "comment": "This is the opposite of elegant. So much bookkeeping for so little fun. I am glad I don't own a copy of the original GH or the new FH. Definitely not my style of game.\n- Pure boring repetitive hack-and-slash\n- Cooperative with silly communication restrictions\n- Too much rules and bookkeeping without actual stakes or excitement. (You play each scenario until you win).\n- The card play is neither that interesting nor that innovative.\n- The story text is childish and boring.\n- Rules are unclear, scattered and inelegant.\n\nIt's a joke how highly these games are rated... Real rating 4-5, but rating 1 out of pure spite. Shame I can't rate this a -10....",
    "timestamp": 1612998000
  },
  {
    "username": "Tjlovebg",
    "rating": 1.0,
    "comment": "Not deserved",
    "timestamp": 1612652400
  },
  {
    "username": "bearn",
    "rating": 1.0,
    "comment": "Same old GH garbage.",
    "timestamp": 1604271600
  },
  {
    "username": "junior_gracz",
    "rating": 1.5,
    "comment": "Not a game, it's a puzzle. Half a point because setup was easy and scenario wasnt long. Still, I am butthurt because JotL is one of the main culcripts that are holding amazing fun competitive dungeon crawlers from existing",
    "timestamp": 1756764000
  },
  {
    "username": "Radtommy",
    "rating": 2.0,
    "comment": "For what it's worth, this game was definitely an experience I would only want to experience once.\n\nI have played through the whole game, and not only is it really difficult, it's not very forgiving either. It feels like every scenario needs to be a perfect run in order to progress the game. Setup/teardown is also pretty annoying.\n\nIt feels like it's trying to be a board game and a ttrpg at the same time, and as a fan of both, combining them together here doesn't feel amazing.",
    "timestamp": 1752357600
  },
  {
    "username": "CortexBomb",
    "rating": 2.0,
    "comment": "Gloomhaven is a relatively engaging and gamey implementation of a dungeon crawl that treads new ground rather than relying on familiar mechanics like 20 sided dice. The story creates a side veneer of interest that propels character advancement and investment in the proceedings but the whole thing would be overwrought and uninteresting without the core card play mechanic.\n\nSaid card system is both the strength and weakness of this game as a whole. It creates a puzzly situation each turn where you have to think through optimum play for both now and the future while also trying to take into account what the monsters are going to do (semi-random) and what your team is going to do (contextual on good communication and teamwork). The system does make for more interesting decisions than most dungeon crawlers, but the reliance that the system creates on effective teamwork is both good and bad in that it requires a fully invested, pretty cooperative team all on the ball to really hum as it is challenging enough to require that level of engagement, even with lower level monsters the inherent nature of the card play requires several steps of look ahead and makes this a fairly challenging game to play competently.\n\nThis smaller box is a much, much better introduction than the original game as it actually has a series of starter scenarios that teach you how to play rather than just throwing you into the deep end with a ton of cards and abilities to understand like the base game. If you are interested in Gloomhaven and want to try it out then this is definitely the place to start. That said, there is a tipping point beyond the first few scenarios where your character decks open up again and that is close to the same degree of overwhelming as it is out of the gates in the main game; what hope I had to enjoy it more than the main box quickly went by the wayside once it opened up.\n\nThe Legacy component in this does suffer a bit in that it doesn't have quite the same grandiosity, as the scenario book is a map, and while it makes setup easier, it does limit the game a bit, but if you like it enough to play it into the ground the 25 scenarios should keep you busy for quite a while.\n\nAs with base: you want spin down monster token holders (for HP tracking). It speeds play a lot. Even with those, this thing is fiddly to set up and play in terms of the physical stuff you're dealing with and keeping track of.\n\nFinal assessment: I like the idea of this, but the implementation leaves me dissatisfied. All of the issues of slow combat in D&D are exacerbated here by the straight jacket that the card system puts on everything that you do in game. I find it odd that the most challenging thing in this game often ends up being just having the ability to move enough to effectively take your combat actions.\n\nWhile this gamey puzzle element is undoubtedly what the fans love about it, I find it obnoxious in practice; as so much of it is reliant on the team working together and a single action taken by one player can have negative cascading effects on the other players because of how actions are selected at the start of the round. Hence, optimal play would be the living hell of alpha player dictating actions to the team. Not having some table talk would make this impossible to be successful in though, so it ends up trying to split the baby with the suggestions in the rules (which effective amount to: table talk, but in general terms only) that try to obscure this core issue. I think I would have ultimately enjoyed this game a lot more if initiative was a separate roll or mechanic from the actions and players were allowed to just choose their actions when their turn comes up. Having movement not being tied to the cards would also likely have improved my enjoyment of it as well. The existing system is moderately more elegant, but it makes the play pretty dissatisfying to me and some of the players we may have otherwise enjoyed this game with.\n\nAt the end of the day, this takes the thing I dislike most about post 3.0 D&D (endless array of special powers you have to keep track of and combo with each other like a video game) and ports it into a puzzley board game that makes that the whole shebang. It's not a bad design per se, but it's not for me and I don't care to play it again. My ratings ultimately reflect how much I want or would be willing to play it, not its \"objective\" quality, hence the 2.",
    "timestamp": 1746482400
  },
  {
    "username": "tectactoe",
    "rating": 2.0,
    "comment": "Played on digital only (Steam) and quite honestly, I couldn't imagine having to play this with a physical version. I respect the design and the unique efficiency puzzle it creates with your hand of cards/actions, I enjoy the spatial aspects of exploring maps and fighting the enemies... And yet, I don't find myself craving to play the game more. At some point it starts feeling more like homework than fun and I'm not entirely sure why.",
    "timestamp": 1733785200
  },
  {
    "username": "PhaosCod",
    "rating": 2.0,
    "comment": "Honestly, I don't understand the hype. Bought it because of the exceptional reviews. Boy, oh boy. The game is needlessly complex for what it's trying to achieve. Which, is interesting because I have no clue what the developers are trying to go for here. To give an idea of the elements involved, I had to sacrifice my dining table and leave the components there so that I continue playing and finish a campaign another day. 2/10 stars because eating on the floor was actually not that bad.",
    "timestamp": 1721080800
  },
  {
    "username": "Mystic_Mouse",
    "rating": 2.0,
    "comment": "How does this possibly make a 6th overall rank? Do we need to check that people have played more than six different games to rate them? Thematic rating of 3? You keep using that word. I do not think it means what you think it means. Someone please tell me how this has theme?!\n\nSince I have the first Gloomhaven, I wouldn't keep this game if you gave it to me. Great for a few plays, but too easy, repetitive, limited in future play, and overly tedious similar to its predecessor. IDK why this version was necessary. It feels like, \"We launched too many expansions in the first edition, so let's turn it down a notch and train people to play the deluxe version that we should have released afterward.\" Redonculous\n\nSomeday, someone's going to write a fantasy dungeon crawler with story, actual good writing, great card puzzles like this has, and it will literally implode minds; a fantasy dungeon crawler where choices must be weighed, emotions felt, and puzzles unlocked. This only hits one of those notches.\n\nI'm harsh on hyped games, so watch a playthrough if you're interested. This is Mage Knight light for those that love card puzzles and slight deck builders.\n\nDingo",
    "timestamp": 1716588000
  },
  {
    "username": "iplaybgnaked",
    "rating": 2.0,
    "comment": "Boring repetitive hand management combat optimization puzzle with an obvious best way to play your character's kit for each scenario. The randomness of the monster's initiative doesn't change up the ideal sequence to play your character cards in while the combat modifier decks are so stupidly swingy they either trivialize the encounters through pure luck of the draw or randomly add an superficial difficulty spike for no reason other than a poor shuffle.",
    "timestamp": 1712268000
  },
  {
    "username": "Megalogico",
    "rating": 2.0,
    "comment": "Está bien, pero tampoco tan bien como para pasar tan meteóricamente por delante de otros juegos. Es un juego entre ligero y medio, accesible para un público general y bien implementado. Sin embargo, hay otros Dungeons Crawlers y juegos temáticos que lo superan en mecánicas, en calidad de guión, capacidad inmersiva, etc. Sinceramente, dado el hype, esperaba algo más.",
    "timestamp": 1701126000
  },
  {
    "username": "javi_cin",
    "rating": 2.0,
    "comment": "This should have stayed as a RPG video game. Way too much bookkeeping and rule reading for an actual play that feels stale.",
    "timestamp": 1699657200
  },
  {
    "username": "Blix",
    "rating": 2.0,
    "comment": "Its all combat. Its very linear. Not a lot of variety in gameplay. Not a lot of opportunity for variety in strategy.",
    "timestamp": 1676847600
  },
  {
    "username": "douglaseg1",
    "rating": 2.0,
    "comment": "Too much accounting. Probably better as a digital game.",
    "timestamp": 1672614000
  },
  {
    "username": "Wolcik",
    "rating": 2.0,
    "comment": "Digital version available (PC)\nPlaying solo because i bought English version before it was localized.\nNot using stickers as I dislike that part of repayable legacy game - end of rule-book suggest replaying and admits its bad design for it in the map.\n\nChapter 2 introduces cheat mechanism that allows to grind money and exp without consequences as long as you have time to grind by losing and restarting - I will just play as if I have unlimited resources.\nSince I play solo I don't need to ignore the rule to not communicate with myself decisions since I don't have split personality.\n\nInitiative mechanism makes the puzzle of picking cards broken as you almost never know when you will move in relations to monster move order - and how will the monster move, so you can plan to have a sweet push or pull only to try to find plan B and since I play Solo it feels like the game is acting as the player that doesn't play along in Co-op game.\n\nI enjoy the book's design, and the simple story seems enough - the City events are random stuff to happen outside of any plot advancement, so I guess big version feels more like that.\nOutside monsters that rumble around the box the insert is fine - even though the post boxes are not holding everything once unpacked.\nThe tear down and setup are not quick despite the insert.\n\nPeople complain about civilization for game management then what about this piece of work? After picking up best available equipment and cards I only play two cards each round to move, attack or wiggle about - the rest takes 80% of time which makes me sad I'm not playing a PC game where I press W to move forward.\nI'm glad that cards do not have pictures on them, as I use pictures only as memory recall in games - I did not noticed that boards in book vary until reviewer said big box felt more generic.\n\nThe game feels hard while manageable - running out of heath and cards making hard decisions to stay alive... not to repeat the chapter again after time invested because of Random monster power attack that decided to do over half of your life dmg forcing you to drop a card.\nChapter 4 introduced enemy spawning and I did not check to be fair with the game, but if it beat me then on second round I would feel like cheating when I would know beforehand where to set myself up - glad I managed to win.\n\nGame takes too much time on game management rather than playing and I can see how people would bounce off it when everything is introduced at once.\nAdvantage and Disadvantage a lot of times are just deck acceleration - take two +0 cards and pick a better one or rather take two -1 cards and pick which one is your Advantage.\n\nThe biggest grape I have with this is that most cards are crap - I feel like I'm searching for nuggets in my hand and once I get the few good ones I have to play with shit for few rounds until I can do something decent again. I know I'm not appreciating the advanced strategy this allowed to use elements, environment and unique abilities with tokens (which are poorly explained still), but there is no one character that would fit my play-style, e.g. cleverly maneuver enemy to trap using one-use item from last mission only for him to heal completely next round, while the other kind monster was barely moving waiting till his colleagues are done and I will deal with him - and in between those two rounds there is twice the time of moving figures and tokens around, picking attack cards at random. Other example - boost an elemental attack for the next round to use it on great combo you prepared only to have the monster not move in right order for you and also possibly stealing your elemental boost to hurt you.\nI might be a dumb barbarian but I did not run in guns blazing, but I don't see how leveling my characters and switching some crap cards to other crap cards will improve my experience.\nYou strategically pick cards and equipment but are forced to play a tactics game where each round has its own separate conditions making long term planning a chore.\n\nAfter chapter 5 I know the game is not too hard for me - its just my disliking to losing cards gives me stress over to be forced to replay scenario. Chapter 4 made me worry I wont make it in time with killing everything but just going to Boss and dumping dmg on it to win made me realize I'm not too dumb to play well - I killed and looted everything even if I could bother to kill everything.\n\nI dont even want to read the City cards out of curiosity because its a drag - if this supposed to give the characters some personality when I pick A or B.\n\nPainted the minis and spoiler boxes and sold it so someone maybe will enjoy it.",
    "timestamp": 1648591200
  },
  {
    "username": "nishikawa-collector",
    "rating": 2.0,
    "comment": "Yuck!! Played the first four scenarios. It was clunky and very painful and not my type of game at all. Character development is boring, battles are boring, yuck! Please spare me. I will never play again.",
    "timestamp": 1648335600
  },
  {
    "username": "ViewOfDelft",
    "rating": 2.0,
    "comment": "The fact that this game is rated so high is testament to how ridiculous the BGG rankings are. It looks like a game for 8 year-olds, completely the opposite of what a good design should be: no depth of analysis, no real options in the game, no real interaction, and absolutely no innovation as design. Boring, simplistic, repetitive.. The equivalent of the level of decerebration one finds in Hollywood blockbusters.",
    "timestamp": 1643151600
  },
  {
    "username": "lavenderlmic",
    "rating": 2.0,
    "comment": "After playing scenario one, I sold it. Maybe it is my bad, but I really dont get it, it would be better if it is a video game or mobile phone game.",
    "timestamp": 1641164400
  },
  {
    "username": "Canyousayblingbling",
    "rating": 2.0,
    "comment": "If i want this much bureaucracy, I ll spend a day in the office. Sold.",
    "timestamp": 1638572400
  },
  {
    "username": "NormandyWept",
    "rating": 2.0,
    "comment": "Dungeon-crawler with a fairly generic-seeming fantasy plot and a focus on repeatedly killing enemies. Even after six scenarios I already found the constant combat a little tiring, with the story relegated to just a few paragraphs here and there.\nThe dungeon-crawling that isn't as interesting as Gears of War and the puzzle of playing your cards correctly isn't as interesting as Mage Knight (and worse, added the element that after planning your turn, the monsters or another player could do something that rendered your play at best inefficient if not outright wasted).\nThe tension in every scenario comes from the race to finish it before your deck trashes itself, which also seems to reduce the variety of scenarios possible - I would be very surprised if anything as interesting as the Berserker from Gears of War appears as the system seems very constrained by some of these design decisions.",
    "timestamp": 1633557600
  },
  {
    "username": "midna2003",
    "rating": 2.0,
    "comment": "The best coop game I have played so far. Unfortunately, coops are not my favorite type of game, which means that we often play other games over this one.\nThe game mechanics are decent (feels a bit like Spirit Island lite, which for me is quite a good thing).\nBut where this game shines is in giving players the sense of growth through many plays. Without the leveling, the story, the new items/actions, etc. the game would become boring after a couple of plays (this is the main problem I have with Spirit Island).\nOverall, a fun game with a nice theme that makes me want to come back for more.",
    "timestamp": 1627855200
  },
  {
    "username": "Ben_Bos",
    "rating": 2.0,
    "comment": "Seriously.\n\nThis game is played ... on the fiddly pages of an open book. It asks you to put stickers on its component A4 thin “map”. Its monsters are comparable with cheap paper cut outs from a print yourself game and in its first 5 scenarios plays out as a snore fest when most players already have the basic knowledge of a dungeon crawler explaining - in pain - such elementary rules like Line of Sight and melee or ranged combat...\n\nThe fact such a poor executed and produced product - with exactly 4 generic heroes - is promoted by some video streamers as something worth while is beyond me.\n\nI am not even mentioning the complete lack of AI behavior of its NPC’s which resembles the state of the art a decade ago (each monster SHOULD have different move/attack instructions depending on its health stage/position and health of human pieces). Yeah, look at Enemy Action: Ardennes to see some real AI Botting...\n\nSo in order to play a second play through you need to track the changes on your map progress on a piece of paper and for all this cheap shit... the publisher asks 60 bucks out of your pocket...\n\nTalking about marketing a colored book ...\n\nThe original Gloomhaven was already a playability disaster which hype never materialized for 95% of its owners because after X time it never came back to their table. Set up, administration, break down time were broken beyond repair.\n\nThe fact this “thing” made it to number 1 overall on BGG is an insult to the board gaming designer’s world. This introduction “kit” is further proof of how silly things evolved over the past few years.",
    "timestamp": 1626472800
  },
  {
    "username": "dmickelson",
    "rating": 2.0,
    "comment": "See Review. Bottom line: I did not like the dark themed and non-engaging story. The campaign took my group about 55 hours to complete, which felt too long.",
    "timestamp": 1622498400
  },
  {
    "username": "Jessy C",
    "rating": 2.0,
    "comment": "Would be a good video game. It’s a giant time toilet as a physical product. I can’t believe someone would have made this. It’s the biggest disappointment I’ve had, playing board games, and it makes me lose a little faith in humanity, that anyone would devote the time required to play this. I can’t even fathom attempting the full Gloomhaven. We played through three scenarios of this, and lost right at the end of the fourth one. It didn’t deserve that much of our time. So, so unhappy.",
    "timestamp": 1615762800
  },
  {
    "username": "lisakshortt",
    "rating": 2.0,
    "comment": "Fucking hate this game.",
    "timestamp": 1608418800
  },
  {
    "username": "kissgg",
    "rating": 2.0,
    "comment": "Basically, the same shit as Gloomhaven, which got 1 star from me.\nThis gets 2, to appreciate the scenario book: it shaves off a little bit of the atrocious setup time, making this game slightly less unacceptable than the original.",
    "timestamp": 1602194400
  },
  {
    "username": "MeepleBlue",
    "rating": 2.0,
    "comment": "I hate this game!",
    "timestamp": 1599256800
  },
  {
    "username": "GuySamstag",
    "rating": 3.0,
    "comment": "The playing-directly-on-the-scenario-book thing is just such a great idea, would love to see this implemented more elswwhere.\nGame itself is slop obviously.",
    "timestamp": 1759356000
  },
  {
    "username": "FrancoisX",
    "rating": 3.0,
    "comment": "Feels like the love-child of Descent, for the dungeon crawl experience, and Mage Knight with the hand management for combat.\n\nAfter 5 scenarios, the game is decent but the writing is pretty poor which is a pity for this type of game as it hurts the immersion.",
    "timestamp": 1759096800
  },
  {
    "username": "tasskaff",
    "rating": 3.0,
    "comment": "Melt what´s left of your brain by sitting in on atrociously bog slow card play game with badly balanced charas in a run-of-the-mill yawntasy setting with childish writing.\nWhat [redacted] designed that bomber guy ? \"Let´s make a melee char with no health and no healing with promising explosion skills but then put them in scenarios where none can be used mwhuahuahua\"\nAt least I was never forced to play the big version. pheew",
    "timestamp": 1751407200
  },
  {
    "username": "ultimoratio",
    "rating": 3.0,
    "comment": "Update: Mar 2022\n\nFinished the game. The game got more interesting as we level up more. The deck construction became very interesting with tough decisions on how to kit your character.\n\n=======================\n\nHave to play more scenarios before I give my thoughts",
    "timestamp": 1750975200
  },
  {
    "username": "Mutabor_CS",
    "rating": 3.0,
    "comment": "Not my cup of tea. We had fun in szenario 1 to 3. But the 4th killed it for us. Can't understand the hype.",
    "timestamp": 1745704800
  },
  {
    "username": "ciceroni",
    "rating": 3.0,
    "comment": "Nothing really interesting to see here. The deck building and character evolving aspects are ok, the rest is just a collective bashing of different monsters. Over and over again.",
    "timestamp": 1744149600
  },
  {
    "username": "Skull One",
    "rating": 3.0,
    "comment": "20",
    "timestamp": 1742857200
  },
  {
    "username": "Sauce424",
    "rating": 3.0,
    "comment": "Ok it's fun but you need a party that is willing to go through a whole campaign with you if you don't play solo and have to wait till everyone time aligns ( which we all know in this busy time is nearly impossible ) I don't know maybe it's just my group who just can't play campaign games or boss battlers. As a video game I would rate it much higher but I've been having to play it solo and looks like I'm going to have to finish it by myself and maybe selling it.",
    "timestamp": 1740870000
  },
  {
    "username": "BoardGamingCouple",
    "rating": 3.0,
    "comment": "3/5\n\nMore streamlined and easier to setup & teardown than Gloomhaven. The systems have been made easier to manage. The game is solid, but not amazing. There is a lot of bloat & can be samey after awhile.",
    "timestamp": 1735254000
  },
  {
    "username": "Ed0r",
    "rating": 3.0,
    "comment": "ITS a boring Eurogamer Puzzle nothing more ...\nNo adventure No roleplaying No Story no excitement...\ni dont know why this is so high on bgg\nexactly the Same goes for frosthaven/gloomhaven\n\ngo Play the Video Game and reflect for yourself (dont try to falls asleep)",
    "timestamp": 1729029600
  },
  {
    "username": "Chroust84",
    "rating": 3.0,
    "comment": "This is boooring. An unsuccessful attempt to convert a computer RPG format into a board game.",
    "timestamp": 1725832800
  },
  {
    "username": "adambailey6",
    "rating": 3.0,
    "comment": "Jaws of the Lion is a very confused game. It wants to be an RPG game with character development and player agency, but it's actually a board game with limited choice, terrible characters that don't develop beyond getting skill cards and no agency in your actions. It wants to be a computer game, but it's still a board game with all the limitations therein (players have to handle all NPC decision making and movement, small maps that are tactically limited, lots of tokens/pieces for each type of enemy).\n\nIf you're going to put that much effort into a table top game, play D&D or Pathfinder. You'll have a better time with less effort and more options.\nOR if you hate the hassle of learning all the rules and handling all the tokens: play a computer game like Into The Breach or XCOM. You'll have more enemies, bigger/better maps, more variability, while your odds won't be tied to simplistic mechanics like how many cards are in your attack deck.\n\nThere are better games to play.",
    "timestamp": 1722636000
  },
  {
    "username": "xlimxz",
    "rating": 3.0,
    "comment": "It starts off immersive, but the game play is so extended that it wears on me. Also doesn't work well without a core group, which I cannot gather for this game. I enjoyed the cooperative aspects and might rate it marginally higher, but my SO dreads it.",
    "timestamp": 1717452000
  },
  {
    "username": "fantastory",
    "rating": 3.0,
    "comment": "Overcomplicated. Long time to setup each game.",
    "timestamp": 1713650400
  },
  {
    "username": "Fileciagrajo",
    "rating": 3.0,
    "comment": "boring if u r gamer",
    "timestamp": 1708642800
  },
  {
    "username": "Inmemorial",
    "rating": 3.0,
    "comment": "Should be one of my favourites but it just is too much to bother with. It's fantasy with building characters, fighting evil and all the usual tropes. But it's just bland, unsatisfying and generic. There is also so much mechanics and game elements it's just too much bookkeeping for me to enjoy.\nPlayed as the healer and it was a drag. Would prefer to play anything else.",
    "timestamp": 1706137200
  },
  {
    "username": "LuisGomez",
    "rating": 3.0,
    "comment": "[Unsleeved]",
    "timestamp": 1706137200
  },
  {
    "username": "bamader94",
    "rating": 3.0,
    "comment": "The tutorial style was appreciated, but the \"story\" was just so disconnected/lackluster and we really couldn't get excited about the puzzly/euro style card play that they called combat. I took a break from the game and came back to try it again to see if it improved, and it was one of the worst gaming experienced I've ever had lol. The puzzle play is...not for me.",
    "timestamp": 1699830000
  },
  {
    "username": "mofongobongo",
    "rating": 3.0,
    "comment": "Played in a group of 4. The game is quite monotonous and grindy. There is not much variation in enemies. I didn't actually find the card mechanics as interesting as many other people seem to.\n\nIt may be more fun in a smaller group, but with 4, it's difficult to meaningfully plan your actions for the round without way too much discussion with other players about exactly what everyone plans to do, where they need to be and where they need enemies to be.",
    "timestamp": 1699225200
  },
  {
    "username": "Zaungast",
    "rating": 3.0,
    "comment": "Highly overrated repetitive counting puzzle packed in a pathetic story.",
    "timestamp": 1691618400
  },
  {
    "username": "jrsquid888",
    "rating": 3.0,
    "comment": "The problem with Gloomhaven is that it's not a game. It's a story you play along with, like an elaborate \"choose your own adventure\". This doesn't mean it can't be fun. I believe it can be very fun, with the right people who want to do the adventure with you. I have done so, and can completely confirm that this is true. However, there's literally nothing fun about this solo. If it's done solo, then you must rely on the storytelling of the \"game\" itself. And that story is weak. The story can only truly be developed with other people. This brings it to another reason why it's not a game, but rather a \"cooperative adventure book sort of thing\". There is no true victory condition other than merely going through the book front to back. I'm sure I'm not the first to say or the last. This would be great if you have a son or daughter to spend a Saturday morning every week for 30 weekends doing this activity. But then when you're done, what have you built together other than time well-spent? That is great with loved-ones, but not something I would prefer with strangers. This is a 25-40 session event, with wasch session lasting 2-4 hours. This can, in theory, be done in a few weeks, but you won't get much else in life done, other than your job, eating and sleeping. The story that is created by this cooperative adventure then becomes critical to the enjoyment. And the story as written is just, well, worse than nearly all fantasy books I've read. The artists were not storytellers. They wanted to create the story in the adventurers.\n\nDon't bother with this if you are married. Even to someone who likes games.",
    "timestamp": 1688767200
  },
  {
    "username": "Tomcat1304",
    "rating": 3.0,
    "comment": "Had enough after the first introduction scenario. Boring and fiddly. If I want to kill monsters in a dungeon crawl, I'll go back to Herquest or Descent.",
    "timestamp": 1687644000
  },
  {
    "username": "Bemischen",
    "rating": 3.0,
    "comment": "3 seems harsh, but truth is we probably won't play it again.\n\nMy gf bought this for me, but sadly she hates it and we only played 4 missions.\n\nI could play solo, but resetting it to the start seems complex, and to be honest I'm just not excited by it... the characters, the enemies, the story, the card based combat... it's just not doing it for me.\n\nIf I'd played with friends who enjoyed it I might have a different view, but that's pure speculation.",
    "timestamp": 1687125600
  },
  {
    "username": "Palencia93",
    "rating": 3.0,
    "comment": "Played up to the sixth mission with 4 characters\n\nComplex combat system with a lot of things to keep in mind and track, but still manages to feel dull. In all of my games only 2 of the heroes were doing any of the fighting and working towards the objetives with the other 2 barely landing a hit or jus moving to the exit. Very poor map design.\n\nDespite beign a campaign game it doesn't feel like you are improving or becoming better at the game. All the mission & enemies lack variety.\n\nThe challenges you select before the mission are very annoying and makes you play in an unoptimal way or you won't be leveling up.\n\nThe items and wepons feel very simple and not very useful.\n\nThe town quest at the end feel very tack on and you get punished/rewarded for no reason most of the time.",
    "timestamp": 1685916000
  },
  {
    "username": "CatnipTheGrey",
    "rating": 4.0,
    "comment": "Bought essentially for solo play. Too much bookkeeping to feel fluid in solo.",
    "timestamp": 1761692400
  },
  {
    "username": "The_eighth_colour",
    "rating": 4.0,
    "comment": "Rated based on solo play. The game uses clever card play and hand management, but combined with the perfect information when playing solo, this turns the game in to an efficiency puzzle with too many variables, which for me, took the all the fun out of it. Also you will spend whole turns wasting cards just moving to the other side of the map or a new room. IMHO Buttons and Bugs is way better as a solo card play, hand management, efficiency puzzle.",
    "timestamp": 1759874400
  },
  {
    "username": "Table43",
    "rating": 4.0,
    "comment": "The five mission tutorial really does a nice job in teaching, and I appreciate the separate glossary. Scenario maps are such a great way to set up a scene, and the addition of a third book which can add to the level design is clever. The timer of cards in hand makes JOTL feel more like Legends of Andor than a dungeon crawl. The dark theme is not to my preference (which is on me, since gloom is literally in the title) and there are a few restrictive cooperative elements like not sharing gold that I have house ruled away. Update: now that I'm complete with the campaign I find the writing to be quite bad, both in the city encounters and the scenario introductions. My ratings have dropped from seven to five over the plays, and I have no interest in revisiting this box again.",
    "timestamp": 1759615200
  },
  {
    "username": "peterlevi",
    "rating": 4.0,
    "comment": "2 (3,4)\n(open)\n\nWe started on this with my son and couldn't even pass the tutorial. I guess dungeon crawlers are not our thing. As a whole it felt super mechanical and... \"procedural\". Or maybe it's the cooperative nature of it that bothers me.\n\nIf we give it another go, I'll update the rating.\n\nUpdate: Lowering to 4. As time passes, I have less and less desire to revisit. I think I generally dislike games like this with dice/card battling, character development, health stats, etc. I also dislike cooperative games. Basically this hits all the wrong chords for me.\n\nProbably not the game's fault - the rating reflects my own subjective desire to play it, not that I think it's a fundamentally bad game (as is the case with other low ratings I've given).",
    "timestamp": 1758060000
  },
  {
    "username": "Imichan",
    "rating": 4.0,
    "comment": "Team/Color = Character\nScore = Level",
    "timestamp": 1757714400
  },
  {
    "username": "nic7410",
    "rating": 4.0,
    "comment": "40 new",
    "timestamp": 1757541600
  },
  {
    "username": "AB06",
    "rating": 4.0,
    "comment": "I wanted to like this game so much, but it ended up just not being for me. Parts of the game just felt like it would easier if it was a video game. I understand why it has high ratings, but it is just not for me.",
    "timestamp": 1756764000
  },
  {
    "username": "Kottis",
    "rating": 4.0,
    "comment": "SELGE?",
    "timestamp": 1756418400
  },
  {
    "username": "Osmanthus",
    "rating": 4.0,
    "comment": "Would rather play those games no PC.",
    "timestamp": 1756159200
  },
  {
    "username": "Norraf Von Nacht",
    "rating": 4.0,
    "comment": "I would be willing to rate this game higher if not for the horrible complexity and overall fussiness of the process. I find myself struggling to accomplish my goals before running out of life (cards). Frankly I'd rather chuck dice than monkey around with GH's card based/hand management combat & movement. Also, do you like keeping track of things? Well then THIS is the game for you! SO... MUCH... to keep track of.\nSetup is kind of a pain in the ass too.\n\nI get the feeling that a streamlined version of this game would really hit the spot.",
    "timestamp": 1750284000
  },
  {
    "username": "Soul_Turtle",
    "rating": 4.0,
    "comment": "Really repetitive. Character progress is too slow. Gameplay is more frustrating than fun. Story is filler, really nothing special or interesting. Objectively good production value.\n\nI think I was spoiled by Arkham Horror LCG, which to me is superior in basically every way. God forbid you fail a mission in Gloomhaven and are forced to repeat it - I can't imagine anything less fun than playing the same mission twice.\n\nI did finish the whole campaign.\n\nI can only assume that people rating this highly have simply never played a video game in their life. The Gloomhaven system is a board game that wants to be a video game (and IS a video game!)",
    "timestamp": 1747864800
  },
  {
    "username": "eiffel37",
    "rating": 4.0,
    "comment": "One of the best dungeon crawlers ever played. In think if you love this its hard to avoid the big gloomhaven box when you finish it. I hope they release new one on this all in the book style",
    "timestamp": 1747087200
  },
  {
    "username": "totokeke",
    "rating": 4.0,
    "comment": "Very fun but heavily set up and status tracking.",
    "timestamp": 1745359200
  },
  {
    "username": "UtterMarcus",
    "rating": 4.0,
    "comment": "Giocatore singolo prevede di usare due personaggi",
    "timestamp": 1743890400
  },
  {
    "username": "individyouall",
    "rating": 4.0,
    "comment": "Played the first page and didn't play any more. Not my type of game at all.",
    "timestamp": 1743372000
  },
  {
    "username": "zosiepose",
    "rating": 4.0,
    "comment": "Really enjoyed it (the difficulty was wild for us) but unfortunately set up was grueling and we fell off playing it. Maybe we'll try again someday!",
    "timestamp": 1741647600
  },
  {
    "username": "Arcalex",
    "rating": 4.0,
    "comment": "The promising card system is eventually too tricky to be fun, the story could be more interesting and engaging but every scenarios are just kind of kill’em all… all in all it’s boring.",
    "timestamp": 1740870000
  },
  {
    "username": "Nino_223",
    "rating": 4.0,
    "comment": "STRATEGY\nCAMPAIGN",
    "timestamp": 1739314800
  },
  {
    "username": "TrevorJr26",
    "rating": 4.0,
    "comment": "Ultimately this kind of dungeon crawler campaign game is just not for me. Too much faff, too much reading, not enough of it is exciting for me. This is an unbelievable value for money though.",
    "timestamp": 1738191600
  },
  {
    "username": "Ideology",
    "rating": 4.0,
    "comment": "Theme was fairly bland.\nPlayed it solo, not sure if that is the reason for rating. While mechanisms are interesting, I realized that I was playing through the scenarios as a \"chore\" not because I wanted to.",
    "timestamp": 1730242800
  },
  {
    "username": "Capitolcpt",
    "rating": 4.0,
    "comment": "Did not really care to play this again. Not my type of game.",
    "timestamp": 1730070000
  },
  {
    "username": "Mushmo",
    "rating": 4.0,
    "comment": "It's better than OG Gloomhaven yes. still takes forever to play. These games are not for me. I would always choose Dungeon Degenerates over either of the Gloomhaven games. It's all the worst parts of DND (combat) streamlined into a 5-6 hour slog.",
    "timestamp": 1726610400
  },
  {
    "username": "Fiona Deere",
    "rating": 4.0,
    "comment": "Emily's",
    "timestamp": 1724536800
  },
  {
    "username": "bazyliszek10000",
    "rating": 4.0,
    "comment": "+ smaller box than in Gloomhaven\n+ faster setting than in Gloomhaven\n+ lots of different monsters and little gray plastic, it's quite quick to prepare, sets of monsters can be kept together, I mentioned a quick setup \n\n+/- gradual presentation of the rules, on the one hand it is easier to follow the instructions step by step, on the other hand the game speeds up slower.\n\n- the hero's development is unsatisfactory. At the beginning we get supposedly new cards, we can buy something. However, all this is weak and uninteresting. All these cards and abilities (even between heroes) are very similar, I don't feel any difference when I change the hero. I see that I have more or less abilities, but it doesn't really matter. After completing 10 scenarios, the game becomes boring and monotonous.\n- the game offers seemingly a lot of things to choose from and develop, all of which must be handled, all of which must be remembered. When we get what, when we do what, when we level up the character, etc.. but all the above is not very interesting. The game is overcomplicated in relation to what it offers. We do a lot, but the effects are mediocre, we don't feel the changes. At the beginning it starts with two cards, then we have another x and so on up to 10, but above 10 the cards become secondary, on some I have one step more, on others less, basically whatever I use will be fine.\n- overcomplicated initiative\n- attack cards from the deck, apparently interesting, but I would rather roll a die than dig into these cards, add, remove, etc... There was definitely an idea, but the effect is mediocre, and it's another thing to handle.\n- I do not like that this is a cooperative game, and yet each player plays for himself, compete for resources with allies.\n\nIt's not even about the fact that there are too many rules, although that doesn't help. The point is that all this has to be handled, it steals time, and the effect is hardly felt.\n\nKM > nothing for a long time > S&S/Descent > ... > Gloomhaven",
    "timestamp": 1715637600
  },
  {
    "username": "dr glaze et al",
    "rating": 5.0,
    "comment": "Possibly the first dungeoncrawl to get it right. Sensible rules for enemy movement, gradual advancement and scaling of adversaries, depth of card combinations, a vaguely engaging story arc, etc.\n\nI find the level of detail on many of the action cards, especially the starter cards, to be overwrought. But that's a small matter compared to how good all the other game systems are.",
    "timestamp": 1761692400
  },
  {
    "username": "Cenagal",
    "rating": 5.0,
    "comment": "No entiendo que este tan bien valorado cuando todos los escenarios son: entra y mata todo lo que encuentres.",
    "timestamp": 1761429600
  },
  {
    "username": "joachimRyu",
    "rating": 5.0,
    "comment": "I’ve never been into RPGs, but I gave this a shot since it’s the easier version of Gloomhaven everyone talks about. Honestly, the whole time I was thinking — why does this need to be a board game?",
    "timestamp": 1760997600
  },
  {
    "username": "Josev",
    "rating": 5.0,
    "comment": "The game play is really fun, and the first few chapters had me hooked, but then suddenly it got really dark really quickly. I had to put it down as it felt weird. It seemed like an unnecessary turn after starting out with what almost seemed like a pirate/ crime theme",
    "timestamp": 1760392800
  },
  {
    "username": "Jrtolf",
    "rating": 5.0,
    "comment": "Its very well designed. It just isn't for me.",
    "timestamp": 1758751200
  },
  {
    "username": "localghost8080",
    "rating": 5.0,
    "comment": "The original Gloomhaven pushed the boundary where a board game would just be better implemented as a video game i.e. the amount of setup, book-keeping, inventory, tracking life totals, status effects, in-game triggers, etc. Jaws of the Lion takes a small step back from the ledge by streamlining some of those things slightly, and is a better game for it.",
    "timestamp": 1757455200
  },
  {
    "username": "Killi",
    "rating": 5.0,
    "comment": "Don't like dungeon crawlers, but had to give it a go to supposedly the best one out there. Played it 3 times to make sure it wasn't my thing. Yeah, I get that you have lots of hours out of this box, I just don't like the genre.",
    "timestamp": 1756504800
  },
  {
    "username": "very_okay",
    "rating": 5.0,
    "comment": "Rated based on a 2 player experience. In short, it's overrated.\n\nTedious upkeep, pseudo-tactical gameplay, and a contrived story. I do like the components, their organisation, and appreciate the affordability.\n\nI think I'm about half way through the campaign, so will see it through to the end. Just a relief I did not play the OG Gloomhaven, Arkham Horror LCG and even Descent 2nd ed. are a far more enjoyable experience.",
    "timestamp": 1756245600
  },
  {
    "username": "natx17",
    "rating": 5.0,
    "comment": "Too repetitive, too scripted; I was not eager to advance in the campaign and it seemed dull to me.",
    "timestamp": 1754431200
  },
  {
    "username": "slayfordayz",
    "rating": 5.0,
    "comment": "We realized we don’t like games that are ONLY tactical. But we did like all the components and how interactive the scenarios were",
    "timestamp": 1750370400
  },
  {
    "username": "KingInTheCorner",
    "rating": 5.0,
    "comment": "As tactical and challenging as this is, I never feel like I'm in a dungeon. I'm fighting the puzzles of the game mechanics and not the monsters. Example? You have to run through each dungeon as fast as you can while slaying monsters, because if you stop and rest too much, you're going to fall over from exhaustion. Makes sense, right?",
    "timestamp": 1747692000
  },
  {
    "username": "Runemal",
    "rating": 5.0,
    "comment": "Feels too much like a puzzle game and not enough like a campaign game.",
    "timestamp": 1747346400
  },
  {
    "username": "Kirguel",
    "rating": 5.0,
    "comment": "Duży zawód. Nie czuje tu przygody. Gra w głównej mierze opiera się na taktycznej walce, elementy fabularne są niewielkie (karty przygód w mieście między potyczkami i wstawki fabularne przed i po walce i to tyle). Przygoda raczej klasyczna, bez zaskoczeń i niezbyt wciągająca. Wyborów fabularnych praktycznie nie ma lub prowadzą do podobnego efektu. Eksploracji świata nie ma wcale. Męczyliśmy się z mężem bardzo, bo byliśmy nastawieni na rpg z planszą, a tu z gry fabularnej w zasadzie jest tylko walka i to wymagająca sporo liczenia wszystkiego, bo postać szybko się męczy i wcale nie łatwo jest wszystkich załatwić zanim skończą nam się karty. Przez to mało klimatyczne są te potyczki i dość powolne. Przeszliśmy chyba 9 scenariuszy.",
    "timestamp": 1746396000
  },
  {
    "username": "eldub",
    "rating": 5.0,
    "comment": "It's good. I just don't really understand why I'm getting invested in this world whatsoever...nothing draws me in, and even the optimization puzzle is still just number crunching, which I don't mind generally, but for a game that's supposed to be immersive and campaign-driven, I just didn't get why I'd continue if I couldn't find an enthusiastic, super consistent person to play with.",
    "timestamp": 1745532000
  },
  {
    "username": "BittersweetDance",
    "rating": 5.0,
    "comment": "Sold - $25",
    "timestamp": 1743116400
  },
  {
    "username": "laman132",
    "rating": 5.0,
    "comment": "At the wrong house\n()\n\nTheme/Aesthetics:\nTheme is kinda there, there's a bunch of starting flavour text, a comic, an attempt. Peters out quick. Looks passable too, nothing to get excited for. The tutorial is absolutely sublime; it's incredibly thorough and digestible.\n\nGameplay:\nI don't like Gloomhaven. I prefer more story, so it being mostly thinky euro combat is a minus. The combat itself---doesn't make me feel powerful, often feels overbearing. Don't like solving the puzzle when I'm being pummelled to death. Also the bloody demolitionist's 'destroy an obstacle' is way too situational. Still mad.\n\nKeeper?\nNo. I'll finish the campaign, stick the map on the wall, but I'm done with it.",
    "timestamp": 1742338800
  },
  {
    "username": "dosxtres",
    "rating": 5.1,
    "comment": "1+",
    "timestamp": 1741906800
  },
  {
    "username": "sn00z",
    "rating": 5.0,
    "comment": "This box should have a disclaimer, do not play the Voidwarden in 2p...",
    "timestamp": 1740956400
  },
  {
    "username": "Cicerone",
    "rating": 5.0,
    "comment": "Tried to reignite my love after COVID for Gloomhaven, but it just didnt click (also couldnt find 3 other people to play with consistently). Its just more of the same",
    "timestamp": 1739142000
  },
  {
    "username": "Harroguk",
    "rating": 5.0,
    "comment": "Great for learning *haven games\nCurrently Playing Frosthaven",
    "timestamp": 1738537200
  },
  {
    "username": "Xerlot",
    "rating": 5.0,
    "comment": "Do not like the card play with more than one person. Not knowing who is going first makes it hard to enjoy. Too many lost actions.",
    "timestamp": 1737932400
  },
  {
    "username": "djsturz",
    "rating": 5.0,
    "comment": "Better system than other dungeon crawlers I've tried, but still not my style of game.",
    "timestamp": 1736204400
  },
  {
    "username": "Hoffstadt1972",
    "rating": 5.0,
    "comment": "Started fantastically, great coop interaction - but then: very very slow character progress, no real story, just dumb repetitions of the same dungeon with a bunch of monsters. Don't want to play this again, neither the big boxes.",
    "timestamp": 1736031600
  },
  {
    "username": "robosheep",
    "rating": 5.0,
    "comment": "The right-sized Gloomhaven, I do wish there was more freedom to take some time in scenarios though",
    "timestamp": 1735599600
  },
  {
    "username": "NowOrNever88",
    "rating": 4.5,
    "comment": "Played tutorial scenario and second scenario (which had the goals of KO all enemies) on TTS with three others. The card play system is...fine. Similar with monsters.\n\nNeed to try more to get a more fair feel for the game, but it doesn't feel all that special for now anyway. As with many dungeon crawlers, there's a lot of small fiddly rules like range vs melee, movement vs obstacles/rubble/monsters, even looting rules and item sharing rules.\n\nIt overall just bogs down the game and doesn't feel very elegant. If I could do this, I think I may just prefer DnD for giving you way more creative freedom in how to combat enemies (kinda like an open world game). Or I could just prefer a JRPG/MMORPG which automates everything for me, like tracking damage and movement and monsters, etc.\n\nI think my favorite aspect of this was doing it with friends, but if I want to game with friends, I'd rather pick a more cerebral euro game. So yeah, overall, not a fan so far. (Though I do appreciate it being faster setup and more streamlined to play than the original. But I still don't know if I'd consider it all that great so far/yet.)\n\nSo it's okay but not something I care much for from my first plays. The other thing is committing to playing through a scenario is a bit lengthy for my tastes too. I guess we'll see. 6/10\n\nEDIT: Played third scenario on Black Ship and yeah, it's not really for me. I don't love that a lot of time, you are limited on movement and can't get close to wail on enemies. Plus there's often small rules and finicky stuff we have to check, which I don't love. I'd rather play a JRPG or so that automates all this stuff. Also downtime can be a smidge high at higher player counts, which I don't love. I also don't really like co ops so it's not for me (scenario was also a bit too easy). 40-50/100 Also difficult terrain color can be hard to see between blue and purple.",
    "timestamp": 1734994800
  },
  {
    "username": "patox",
    "rating": 5.0,
    "comment": "3D-printed scenery and monsters. Metal Coins and Removable Stickers.",
    "timestamp": 1734735600
  },
  {
    "username": "Malgamus",
    "rating": 5.0,
    "comment": "I'm glad I waited to try out the Gloomhaven system by getting this instead of the big box. I find the combat which is a major part of the game to be very slow and boring. While the cards provide all the needed info, they are so bland with no art to help paint the picture of the action in your mind. The included system to manage health and status on enemies in horrible and makes the table a mess. Picking up 3rd party bases that allow you to track health and status for each enemy makes things a lot better.\n\nThe story itself is ok but nothing special and certainly not enough to make me put up with the terrible combat.",
    "timestamp": 1734390000
  },
  {
    "username": "TheGreatNiro",
    "rating": 5.0,
    "comment": "The only \"game\" is tactical battles. Would like more exploration and discovery and \"game\" to the game.",
    "timestamp": 1733007600
  },
  {
    "username": "zingano",
    "rating": 5.0,
    "comment": "Skirmish games not my thing. No sense of story",
    "timestamp": 1732921200
  },
  {
    "username": "Joey_A",
    "rating": 5.0,
    "comment": "It's baby's first Gloomhaven! It's scaled down, but mostly intact, warts and all. I found this at a Walmart clearance for $25, and I don't regret it, loads of game included, as always!\n\nNote: Whell, I got my $25 worth of enjoyment. Didn't finish it, too much of a repetitive slog. This and it's big brother earn a collective cull. Way too luck based for what it wants to be.",
    "timestamp": 1732489200
  },
  {
    "username": "JeffH4257",
    "rating": 5.0,
    "comment": "Meh",
    "timestamp": 1731452400
  },
  {
    "username": "ashkai",
    "rating": 5.0,
    "comment": "We thought this would be easier to get to the table than original Gloomhaven.\n\nThis box is smaller, but it is still packed with stuff that makes it hard to organize or set up a game really fast.",
    "timestamp": 1730934000
  },
  {
    "username": "CGGGaming",
    "rating": 5.0,
    "comment": "(Played solo) Story is very generic. I really don't like the card battle system it implements and the missions were way to repetitive for my liking. (Sold)",
    "timestamp": 1728511200
  },
  {
    "username": "TheRook",
    "rating": 4.8,
    "comment": "Gloomhaven apparently just isn't my game. We tried so hard to like this, but man is the story awful (IMO). And the game play is more like a chore rather than interesting. I tried to like this. I'm glad so many do. But this is easily one of my biggest disappointments as a game.",
    "timestamp": 1727906400
  },
  {
    "username": "leleyx",
    "rating": 5.0,
    "comment": "Not interested!\nI didn't mind it much, but my group did not enjoy it.",
    "timestamp": 1724882400
  },
  {
    "username": "shammois",
    "rating": 5.0,
    "comment": "For me personally: just far too much management to be fun: there are a few repetitious elements and while that can work mechanically, the narrative echoing that sense of grind just doesn't excite me enough, despite the card system being interesting.. But that said, I'm not a skirmish game fan or a fantasy fan, so I'm clearly not the target audience here. If you are it's probably a home run.",
    "timestamp": 1723068000
  },
  {
    "username": "smauger",
    "rating": 5.0,
    "comment": "(D&C own) - I could take it or leave it\n1-4 players",
    "timestamp": 1722204000
  },
  {
    "username": "Patblade",
    "rating": 5.0,
    "comment": "Gordon",
    "timestamp": 1721167200
  },
  {
    "username": "Xstream",
    "rating": 5.0,
    "comment": "A lot of content at a good price. There's just not much to fault in that area. The box Is very cramped though. No space for (3D printed) upgrades.\nThe score dials are very loose and always change values when playing. They are frankly quite horrible. Other than that, top notch.\n\nThe theme and storytelling is, mweh, It's fine, but quite generic. We've played one session now covering the first 3 scenarios with 2p. It was ok and I liked playing It, but I'm not hooked or interested to dive back in. That's also because of the setup and maintenance of everything, even though they did a good job minimising it vs the original Gloomhaven.\n\nI do respect It though. The card play and the mix of powers offers more interesting tactical options vs rolling dice. But it did feel all somewhat the same in card powers and combo’s. It just doesn't really resonate with me I guess.\n\nUpdate: having this now played as the videogame It's just so much better! The concept of timing and managing your turns is just so tight and well done. Now I can say GH is an excellent videogame, just not a boardgame. For me JOTL isn't required, the original Gloomhaven just gets you right in being tight and hard, where I felt the first few missions in JOTL just fell flat and boring, what caused me not wanting to play It anymore. Not playing the videogame version I realise how cool the original GH is with all Its depth. I didn't get this experience during JotL.",
    "timestamp": 1719180000
  },
  {
    "username": "nukeu666",
    "rating": 5.0,
    "comment": "Bored after 6 missions or so",
    "timestamp": 1719180000
  },
  {
    "username": "hiimjosh",
    "rating": 5.0,
    "comment": "Jaws of the Lion has gotten a lot of love lately. I've played Gloomhaven about 10 times or so now and it's a game I do really enjoy but rarely want to pull out. I simultaneously am impressed with Jaws of the Lion and expected more. Let's talk about it\n\nOne of the first and most jarring things that has changed is the rulebook. I thought the original rulebook was a bit of a slog. Jaws of the Lion's uses a tutorial campaign approach. I thought it worked okay, but I wasn't crazy about the rules presentation. Overall it feels like the rules stretch on for longer and are harder to read ahead of time. I prefer rule books to be structured more as reference manuals than tutorials most of the time (an example of play is always welcome though). The rules overhead in Jaws of the Lion is lower than in Gloomhaven by quite a lot, but it's still higher than you might expect\n\nSpoon feeding also doesn't give you a good taste of the game. The first scenario gives you only six cards and the enemies don't use AI cards. I personally found this a bit too simplistic. The second scenario switches out some of your cards for slightly more complex cards and gives the AI a limited deck. This is a little bettter, but I felt this should've perhaps been game 1. Being limited to six fairly basic cards again still doesn't really whet your palate for what Gloomhaven actually feels like. Overall the progression here works and is more streamlined, but I think it's possibly a step too far (which I'd prefer over the contrary)\n\nThe terrain in the book is an economical choice and a good one. It doesn't streamline the game all that much, but I also didn't feel like the game was missing anything by using the book. Solid and smart choice. The integrated tips on the boards are particuarly nice\n\nMy biggest criticism (aside from the pacing) is that this set only has 4 characters. Gloomhaven has a ton of characters and overall a lot more content (arguably more than double what Jaws of the Lion has). While Jaws of the Lion is quicker to setup and likely my preferred way to play solo, vanilla Gloomhaven is - in my opinion - a better product and a better way to get introduced to the game (especially if you are being taught). Jaws of the Lion is very watered down to start - to the point where I think some people will walk away without ever having experienced the depth the game has to offer. Rather Jaws of the Lion is a good addition to a Gloomhaven collection as it gives you easy scenarios to introduce new players to - I just wouldn't recommend it over the base game. I will happily play through this, but I doubt I will pick it up. You could easily house rule a few scenarios in base Gloomhaven to spoon feed rules if you'd like",
    "timestamp": 1718661600
  },
  {
    "username": "luckystreak",
    "rating": 5.0,
    "comment": "Interesting card system, good value for money I guess, but ultimately a bit of a mess of genres. It's a fusion of Euro and Dungeon Crawler yet falls short on both counts. On the surface it's a precise card-efficiency puzzle engine but before long you will find a heap of edge cases left hanging in the wind - \"I'm a tight Euro, except when I'm not....\". Two entirely conflicting styles of game design both of which I enjoy but not when they are shoe-horned together.\n\nIt's also a co-op experience and yet has restrictions to communication built into the system, probably to encourage the 'element of surprise' (to make up for the lack of dice...) or to avoid any alpha players taking over, but it doesn't work - you can't tell other players what number cards you plan to play but you can tell them what you plan to do...kind of?? It's a muddy rule that feels very unsatisfying to try and incorporate as players.\n\nRewards are also incredibly dull. Trekking half-way across the map for...drumroll...a coin feels like the dungeon is laughing in my face - \"You thought you were going to find something exciting...think again.\" Where are the highs and lows that are a prerequisite to a dungeon crawl experience?\n\nOh, and the story is naff.",
    "timestamp": 1717538400
  },
  {
    "username": "Weaks",
    "rating": 5.0,
    "comment": "No es lo que esperaba. Es buen juego, pero no me engancha. Creo que es porque no tengo capacidad de elegir armas. Cada vez parece que atacas de un modo diferente. Me resulta una existencia extraña.",
    "timestamp": 1714773600
  },
  {
    "username": "The CEE",
    "rating": 5.0,
    "comment": "Gloomhaven: Jaws of the Lion has some stellar ideas going for it. The scenario booklet that includes pre-printed terrain for each combat encounter is a brilliant time saver. And more importantly the core fundamentals of the game's hand management and top action/bottom action card play seemed interesting and worthy of further exploration.\n\nUnfortunately the amount of administrative bookkeeping required to actually play a scenario sucked the joy out of the experience for me. I don't think foisting this degree of rules overhead onto the players just to manage what could otherwise be automated procedures in a digital format plays to the strengths of board games as a medium. My time spent with Gloomhaven on the tabletop just made me eager to try the video game implementation where monster behavior and stat tracking can be handled by the software.\n\nIn an unpopular opinion, I actually was irritated by the way the game's ruleset was slowly doled out across multiple scenarios. I think this is probably a personal quirk I developed from being the primary rules explainer in my group. I'm very accustomed to sitting down for a first play with a comprehensive understanding of a game's mechanics and Jaws of the Lion discourages that approach.",
    "timestamp": 1713477600
  },
  {
    "username": "Fiodoroff",
    "rating": 5.0,
    "comment": "Sprzedaż 20-10-2023 za 190,0 zł.",
    "timestamp": 1711234800
  },
  {
    "username": "megalopsukhe",
    "rating": 5.0,
    "comment": "I like the map booklet a lot, but after finishing this game, I decided against moving onto Gloomhaven. Perhaps it was due to my relatively lazy play group, but I felt like setting up and playing this was way too much work for too little reward.",
    "timestamp": 1711234800
  },
  {
    "username": "wamsp",
    "rating": 5.0,
    "comment": "players: 1-4\nweight: 3.6\ntime: 30-120\n\ncooperative\ncampaign\n\nAug. 2020",
    "timestamp": 1710457200
  },
  {
    "username": "djnesq",
    "rating": 5.0,
    "comment": "The before-you-play guide, the instructions, and the text on the cards make the game effortless to get into. Still, you're chasing and being chased by monsters, inflicting or receiving hit points on nearly every turn, and hoping that the monsters reach their Hit limit before you and the other players do --- not my sort of game.",
    "timestamp": 1710370800
  },
  {
    "username": "tjbizzle",
    "rating": 6.0,
    "comment": "I think I prefer this version over original Gloomhaven from a setup time and interesting character perspective, but the component quality is definitely better in OG gloomhaven.",
    "timestamp": 1761519600
  },
  {
    "username": "kilianbognar",
    "rating": 6.0,
    "comment": "We played about six scenarios, so take this with that in mind: if you don't complete any version of Gloomhaven with relatively short gaps between sessions, it's easy to forget the smaller rules, and relearning them is a pain. That's probably the main reason it's not for me.\n\nThe Jaws of the Lion box, while more portable, is too small, and although the booklet makes setup quicker, it's still a pain to find the necessary pieces. An organizer might help if you go with it.\n\nThat said, I still recommend everyone try Gloomhaven at least once, because at its core, it has a really clever card system that's engaging to interact with - at least for a couple of sessions.",
    "timestamp": 1760306400
  },
  {
    "username": "cannoneer",
    "rating": 6.0,
    "comment": "This is more my speed. Much simpler and more streamlined than the original big game, and seems better balanced to 2-player scenarios, at least that’s the feeling I get, about 10-11 scenarios in. I enjoy it but it’s not something I would suggest much, except my son really likes it and so it’s fun to be able to play with him.",
    "timestamp": 1760220000
  },
  {
    "username": "kensiebensie",
    "rating": 6.0,
    "comment": "Chapter 5",
    "timestamp": 1759356000
  },
  {
    "username": "Sir Pent",
    "rating": 6.0,
    "comment": "I've played five scenarios. Simple to learn/teach/play, and each scenario adds more mechanics and length to the missions. By the 5th mission, you are playing the complete game. The card mechanism of determining play order as well as choosing top or bottom actions was very interesting. And the character growth aspect is also fun. The game seems balanced well, too. My main drawback is that the theme is quite gruesome with Chaos Demons and Blood Tumors and a storyline about an evil cult.",
    "timestamp": 1759269600
  },
  {
    "username": "evangelionys",
    "rating": 6.0,
    "comment": "The game setup takes too long, would prefer the digital version.",
    "timestamp": 1758664800
  },
  {
    "username": "emmeray",
    "rating": 6.0,
    "comment": "Map has a few stickers on it. Includes assembled insert (Folded Space).",
    "timestamp": 1757714400
  },
  {
    "username": "Quickdraw69",
    "rating": 6.0,
    "comment": "Played through the first few scenarios and had a good time when the game came out. This approach to a tutorial is pretty good but might seem convoluted to more casual gamers giving this a try. I put it on the shelf for a while after three scenarios. I just brought it back to the table after more than a year and am much less enthusiastic this time around. I'm waiting to see if that changes or if I'm ready to part ways with the game.",
    "timestamp": 1756850400
  },
  {
    "username": "Dante_Molari",
    "rating": 6.0,
    "comment": "significant improvement from original GH, still a bit dry and the lack of events make the experience a bit bland and not very exciting at times. Still a very good logic puzzle, if you are in the mood or love such games.",
    "timestamp": 1756764000
  },
  {
    "username": "cinnzel",
    "rating": 6.0,
    "comment": "Uno de los mejores juegos de mazmorreo que he probado, eso sí, no te esperes una experiencia demasiado narrativa. El núcleo del juego se basa en matar monstruos y subir de nivel tus personajes. Además, el sistema de selección de acciones te planteará en muchas ocasiones un serio rompecabezas.",
    "timestamp": 1756245600
  },
  {
    "username": "Evertore",
    "rating": 6.0,
    "comment": "Zatu",
    "timestamp": 1755554400
  },
  {
    "username": "Wally4",
    "rating": 6.0,
    "comment": "I started the campaign super into it. Love the world map and the character progression. The combat card play is so excellent to begin with. My major con about this game is that it's just the same thing over and over again. Enter room, smash baddies, leave room. Again and again. If dungeon crawlers are your thing and combat is what you love about games, then you'll likely love this. But if you're hoping for more ways to engage in the story or more mechanical / thematic variety across a campaign, then this will fall short.",
    "timestamp": 1755468000
  },
  {
    "username": "Secondguess",
    "rating": 6.0,
    "comment": "1-4 Player\nCooperative\n60 mins",
    "timestamp": 1754863200
  },
  {
    "username": "Kelsoli",
    "rating": 6.0,
    "comment": "I bought this based on BGG ratings. I wanted to love it, and at first rated it a lot higher, as it was my second or third game purchased to play solo. Alas, after a couple of scenarios, I started getting bored. Mercenaries for hire isn’t a theme that resounds, and it brought back memories of trying to love Dragonlance books as a teen, and halfling rogues and alignment systems. None of which are bad things, just that there are so many games with amazing rules and mechanics and art, I’d rather play 7th Continent or Wingspan or Arnak.\n\nedit: I replayed a few months ago and it was more fun and less confusing although there had been a several year gap between plays, however set up and tear down is a bit too much and there are other games I'm more excited about.",
    "timestamp": 1753653600
  },
  {
    "username": "JediMaster0310",
    "rating": 6.0,
    "comment": "A fine enough game, and a good addition to Gloomhaven, but the system just doesn't grasp me the way it should. Hidden information in what seems intended to be a tactical, cooperative dungeon crawl rubs me the wrong way. A solid title for many, but not my first choice.",
    "timestamp": 1753653600
  },
  {
    "username": "XenoLocke",
    "rating": 6.0,
    "comment": "A good game but not for me. The combat is too much of a puzzle and too punishing.\n\nGave it away to a friend who enjoyed Gloomhaven.",
    "timestamp": 1753221600
  },
  {
    "username": "Quietchess",
    "rating": 6.0,
    "comment": "Contains Folded Space Insert",
    "timestamp": 1752012000
  },
  {
    "username": "bluestraggler",
    "rating": 6.0,
    "comment": "Most of these thoughts based on one 4p campaign, but revised a bit after getting more experience with full Gloomhaven.\n\nExcellent stuff:\n* Great experience to work through a campaign as a group, playing with the same people and getting to know the characters.\n* The Gloomhaven system and gameplay deserves the hype. Strategy is fun and it gives rise to some really wild sessions where things go completely sideways and you squeak through anyway.\n* Strategically not as interesting as some of my favorites. But I've come to appreciate that this system is more about improvising and leaning into good heuristics rather than being able to plan everything.\n* Characters are very well-designed and all have unique skills. I played as the Red Guard but I'm interested in trying all the other ones. And even as the Red Guard I could've built up the deck quite differently.\n* Getting better with your character, learning their strengths and figuring out how to manage your deck.\n* Once in a while things line up and you get a magic turn where everything clicks, and goodness is that satisfying.\n\nOK stuff:\n* Overarching story is not really interesting at all. (Though I have enjoyed the hammy narration app.)\n\nNot good stuff:\n* Too often 4p scenarios had that feel I associate with frustrating video game levels where every setup feels like a painful slog you just want to get through as quickly as possible.\n* Some later levels seen uninspired, just wave after wave of respawning elite monsters pummeling you into exhaustion. I honestly wonder if they play-tested 4p very thoroughly on some of these. Maybe they were limited by the binder format.\n* Nearly all scenarios are way, way longer than the 30 minutes/player estimated on the box.\n* I know they had to cut some costs here and there to get it on the shelf at Target, but buyers are likely going to want to spend more to improve the experience. I bought some monster standees with damage counters because tracking damage for lots of monsters is really tedious and error-prone. Meanwhile there's a map and stickers that don't add anything to the game.\n\nOverall, well, I don't know. When we wrapped up the campaign, no one wanted to jump into full Gloomhaven. I eventually did, playing digitally, and honestly loved it. I'm usually for tabletop over digital, but there's so much overhead in this system sometimes to manage all the characters, initiatives, monsters, elements, etc., playing digitally really let me focus on core gameplay. So maybe this all reflects JOTL's limitations, or the system is too much on tabletop, or having four people just exponentially grew the playtime and overhead into something that didn't work.",
    "timestamp": 1751925600
  },
  {
    "username": "Mersion",
    "rating": 6.0,
    "comment": "This game is cool, but playing it physically felt like too much fiddly work, and not enough actual gaming. Played about 10 scenarios and eventually decided it was not worth the effort.",
    "timestamp": 1750111200
  },
  {
    "username": "d3athjest3r",
    "rating": 6.0,
    "comment": "I think it's an OK game. The setup time is short with the scenarios being printed in the book. Awesome!!!\nBut the game has a lot of flaws. The card play is heavily overrated. A lot of people hype it for it's tactical depth. But in the end, you can't really communicate with your partners what number you have, so who knows who is going first (some monsters also have very low numbers on the cards), and you might be left with a completely different board state, and your strategy for the turn going down the drain. My girlfriend got annoyed after a few plays, and started to draw 2 random cards from the hand (because she mostly got to go second or last) and we still managed to finish the scenarios. Also since you have only ~10 cards in your hand and after having used all of them (after ~5 turns) you have to discard one at random, which leaves you with the decisions to either use your super attack in the first couple of turns on the first best monster OR risking to lose it without having played it.\nAlso the scenario goals are super boring. KILL ALL MONSTERS! and the story really lame of the shelf fantasy blabla. After having played ~9 scenarios, it's just more of the same again and again. The game becomes a huge grind.\n\nAgain I don't think the game deserves its spot so high up the ranking. It's ok it's fun sometimes. But it is by no means THAT GOOODDD!!! There are just too many fanboys and girls!",
    "timestamp": 1748210400
  },
  {
    "username": "PokeyMcBatFish",
    "rating": 6.0,
    "comment": "This game has a dark theme and models exhaustion and desperation. This doesn't suit everyone. Quite winnable though. It is classified as a legacy game but it is reversible so you can pass or sell it on.",
    "timestamp": 1746655200
  },
  {
    "username": "speter22",
    "rating": 6.0,
    "comment": "I played the first 6 scenarios solo, and it just got exhausting. It’s undeniably a very well-made game, and I think I’d be happy to play it if someone invited me to, but there’s just way too much going on for me to have the patience to play this by myself. It does a great job of replicating a strategy video game experience, but with that comes the almost unforgivable cost of endless upkeep. Video games have the huge benefit of doing all of the background work, but when I have to do it myself, it just beats me to the ground.\n\nUpkeep aside, playing this also gets me suspicious that solo-ing big, crunchy co-op experiences just isn’t my jam. Too often I’d be putting in a bunch of work to try to fight a few monsters, only to have a random card draw mess with my plans in a really unsatisfying way. Which a lot of people think is great! I think the reasons that the random elements of Gloomhaven didn’t work for me are 1) I was playing it alone, and if I were with someone else, drawing a miss card would be a tense, potentially uproarious experience, but alone, it just felt draining, and 2) it’s long. Really long. Randomness in a short game is way more palatable for me (stuff like Pandemic still goes down nice and sweet), but in a game that lasts me 2-3 hours solo, it can be really frustrating.",
    "timestamp": 1746655200
  },
  {
    "username": "Mickers",
    "rating": 6.0,
    "comment": "I learned this type of game is not really my cup of tea, but I understand why many people enjoy it.",
    "timestamp": 1746223200
  },
  {
    "username": "Humy",
    "rating": 6.0,
    "comment": "This was my first dungeon crawler board game.\n\nAt first i was intriguined by it.\nThe story is good and the whole system and mechanics are well introduced. Building up with the first missions, getting more complex.\n\nBut after 5-6 missions i lost interrest. Mostly of the rushing nature of this game.\n\nI really dislike that you have to plan every step ahead, even when there is no enemy around.\nWhy shouldnt i grab the chest in the emptied room?\nAnswer: because you loose hand cards and starve without them.\n\nThat breaks the adventure theme for me.",
    "timestamp": 1745445600
  },
  {
    "username": "Kehaar317",
    "rating": 6.0,
    "comment": "A much more palatable portion of Gloomhaven for those bored evenings\nBut after enough playing, I know Gloomhaven stuff is not for me.",
    "timestamp": 1744754400
  },
  {
    "username": "Hikorzik",
    "rating": 6.0,
    "comment": "Very fun but kinda hard at times with difficulty spikes that make scenarios a bit longer than what I'd like, when you have to retry one several times... The story is quite nice tho, and I like the flavor and gameplay!",
    "timestamp": 1743804000
  },
  {
    "username": "totero",
    "rating": 6.0,
    "comment": "Solo - Unopened",
    "timestamp": 1742770800
  },
  {
    "username": "Lebro262",
    "rating": 6.0,
    "comment": "slow pace and lack of diversity. Story is lacking Combact is nice",
    "timestamp": 1741474800
  },
  {
    "username": "silverhydra",
    "rating": 6.0,
    "comment": "https://www.youtube.com/watch?v=vgkqQrccUZ0",
    "timestamp": 1740351600
  },
  {
    "username": "towerofcheezah",
    "rating": 6.0,
    "comment": "Now a 6 -will only play this online or with someone who can fully manage the game with no teach\n\n\n9 to an 8 to a 7, just couldn't get into it after the 5th session",
    "timestamp": 1739314800
  },
  {
    "username": "SaraCV",
    "rating": 6.0,
    "comment": "Co-operative dungeon crawlers are probably about as far from my gaming taste as possible, but I can respect the design and definitely understand why this is rated so highly.\n\nThe gradual introduction to the rules over the first few games was specifically well designed, and the character customization that starts early in the game is enjoyable.",
    "timestamp": 1739314800
  },
  {
    "username": "brodatyboardgames",
    "rating": 6.0,
    "comment": "My adventure with Gloomhaven Jaws of the Lion had 3 stages:\n\nThe first was the excitement of starting a new campaign game with an awesome tutorial introducing me to the world of Gloomhaven.\n\nThe next was the fascination with the combat system and the development of our heroes.\n\nThe final stage was the ‘Gloomhaven fatigue’ I mentioned earlier.\n\nHowever, this disease won with us and it was only through strong determination that we managed to finish this game. However, Jaws of the Lion is not bad. I even think it is the perfect game to introduce someone to the world of dungeon crawlers. It's just that if the game's storyline and enemies had been more engaging we probably would have had a better time.\n\nFinal verdict: We played the game, but our jaws didn't drop\n\nPros\nGreat euro combat\nCard play system\nDiverse heroes\nMap-book\nExcellent tutorial\n\nCons\nBoring story\nHit and kill and repeat\nItems too single-scenario\nLate elements\nHow to pack it?\nGloomhaven Fatigue",
    "timestamp": 1737932400
  },
  {
    "username": "tomvdvel",
    "rating": 6.0,
    "comment": "I could see the cleverness in the card play, but the set-up and upkeep was simply too much for my taste. I feel that this would work much better as a video game. It does not help that I don't like the setting as much as other \"big\" games with a lot of set-up, such as Sleeping Gods or Spirit Island.\n\nSold to a friend.",
    "timestamp": 1737846000
  },
  {
    "username": "Unicagoogle",
    "rating": 6.0,
    "comment": "Campaña completada a 4 jugadores.\nLas cartas poseen 2 acciones excluyentes, lamentablemente casi siempre usarás la misma parte de cada carta. El único componente legacy del juego reside en una serie de pegatinas que se colocarán en un mapa para indicar las misiones disponibles y completadas.\nLa historia es totalmente genérica y no aporta absolutamente nada a la jugabilidad. Los eventos que hay a modo de interludios son irrisorios y no satisfacen en absoluto. El desarrollo de los personajes a nivel jugable es nulo, hay cartas de niveles altos que no quitan el hueco a cartas de nivel 1. Una mayor asimetría creo que no le vendría mal.\nEl juego tiene un muy buen tutorial que introduce paulatinamente las mecánicas de todo el juego.\nMi principal problema con Gloomhaven Faúces del león es que se hace muy repetitivo y jugar a él resulta tedioso. La mayoría de escenarios no aportan nada novedoso y se queda corto de mecánicas originales a las pocas partidas.\nLa sensación general de la campaña es agridulce. Gran potencial desaprovechado.",
    "timestamp": 1737586800
  },
  {
    "username": "adamscott",
    "rating": 6.0,
    "comment": "I'm rating JotL a bit higher than the original since this mitigates several things I didn't like about it (price point, huge box, a million pieces, setup/tear down time, campaign length, grind).\n\nUpdate : Six scenarios in and I'm starting to lose interest. Game was super fun initially (Hatchet's favourite!), but I'm already starting to feel that it's getting samey and grindy. I'm hoping for more variety, not just kill enemies and/or destroy objectives.\n\nUpdate 2 : Nine scenarios in and my wife has completely lost interest. I'm not far behind. Very repetitive and samey, way too fiddly, setup/tear down is a chore.",
    "timestamp": 1737068400
  },
  {
    "username": "t3stsubject",
    "rating": 6.0,
    "comment": "originally in collection 06/20/2020",
    "timestamp": 1736895600
  },
  {
    "username": "Longshank22",
    "rating": 6.0,
    "comment": "To fiddly, to much upkeep, rather play this kind of RPG on PC",
    "timestamp": 1736809200
  },
  {
    "username": "chibiowl",
    "rating": 6.0,
    "comment": "Will probably sell it off after completing the campaign. I don't think I will want to replay it even though there is replayability with using a different character.",
    "timestamp": 1736636400
  },
  {
    "username": "Apophis222",
    "rating": 6.0,
    "comment": "SOLO / Inlay (H)",
    "timestamp": 1736118000
  },
  {
    "username": "saoirseclerks",
    "rating": 6.0,
    "comment": "刚开始的体验非常好玩，慢慢熟悉自己的技能，集结队伍每个战役后在酒馆恢复买装备升级，简单而质朴的RPG快乐。但中后期玩法高度重复，玩到第六七个战役属实有些腻了，不知道是不是因为阉割版的缘故。对于美式沉浸感非常重要的故事性和背景介绍严重不足，怪物机制单一，头重脚轻太过明显，希望有机会体验原版。",
    "timestamp": 1735945200
  },
  {
    "username": "mudville9",
    "rating": 6.0,
    "comment": "There is a lot going on in this box. I don't have a ton of dungeon crawl experience, but the card system for combat and leveling works well here. The game so far is quite difficult. There's a lot left to explore, but my impressions are positive so far.",
    "timestamp": 1735858800
  },
  {
    "username": "okean",
    "rating": 6.0,
    "comment": "UPDATE: I finished the campaign, and my initial impressions haven’t changed much. That said, I did enjoy the final scenario where you face off against the main boss. However, overall, the game still feels repetitive, each scenario plays very similarly, the story isn’t engaging, and it doesn’t feel like a legacy game where you progressively upgrade your abilities. The cards you add throughout (I had seven in total) don’t feel significantly different or impactful. It also doesn’t feel like a dungeon crawler; it’s more of a skirmish game with a very simple combat system. All in all, I don’t see what others might find so appealing about this game, and I don’t think it deserves to be in the top 10.\n\nI’ve played half the scenarios, and while the first five and character-focused missions are interesting, the rest feel repetitive with a \"kill all monsters\" theme. The cards lack interesting abilities and don’t offer much of a puzzle in deciding which to play, and the items are all too similar. I expected different mechanics as the game progressed, but unfortunately, it all feels the same. It's not a bad game, but it shouldn't be ranked such high. I’ll continue playing to see how the story ends, though.",
    "timestamp": 1735340400
  },
  {
    "username": "Javajoesworld",
    "rating": 5.5,
    "comment": "Made as a shorter teaching version of the bigger Gloomhaven. Still too much of a commitment for me as each scenario was taking 3 hours to play with the group I learned it with due to severe AP where there was no need.",
    "timestamp": 1735340400
  },
  {
    "username": "cactusfish",
    "rating": 6.0,
    "comment": "Fun and well balanced rpg with good world building, but takes a long time to set up and is slightly hard to keep track of all the small parts which adds that little bit of friction to the decision to keep playing,",
    "timestamp": 1735167600
  },
  {
    "username": "JFed01",
    "rating": 6.0,
    "comment": "Includes Gloomhaven: Jaws of the Lion – Removable Sticker Set and Map (2021)",
    "timestamp": 1734908400
  },
  {
    "username": "Frederick_Langlois",
    "rating": 6.0,
    "comment": "Un jeu beaucoup trop porte/monstre/trésor pour moi, je préfère de loin quand on est plus dans le narratif que le pur donjon crawler...",
    "timestamp": 1734735600
  },
  {
    "username": "docinthedesert",
    "rating": 6.0,
    "comment": "It seemed quite a bit \"fiddly\" with too much to track.",
    "timestamp": 1733698800
  },
  {
    "username": "MoneLise",
    "rating": 6.0,
    "comment": "I don´t get the hype with this game. The first four games with our party of four were way too easy. We changed the difficulty mode and then it was ok, but we found it very repetitive. Strategy-wise it was always the same, you've got some card-combo's that work good together and some characters that best do ranged attacks and some players that best do melee attacks. There is some virability in monsters but after all they just need to go down in HP and that's the goal. Especially for the Voidwarden it was kind of dull, because he was always last and monsters were already killed before his turn. Maybe we should have made it even more difficult, but after some games we just wanted to finish the campaign and be done with it.\n\nI reset my game, sold it on an online marketplace in the Netherlands and got overwhelmed with how many people wanted to buy and play it. They offered me money way over the price I payed for it. I guess it's because of it's popularity and that it's sold out in all Dutch shops, but I wouldn't recomend playing it, there are way more fun games for my taste.",
    "timestamp": 1733698800
  },
  {
    "username": "StanTem",
    "rating": 7.0,
    "comment": "Sealed\n45 euro",
    "timestamp": 1762470000
  },
  {
    "username": "_wolo_",
    "rating": 7.0,
    "comment": "It starts amazing.\n\nAt some point becomes fiddly and repetitive. Almost feels like should have ended at 75%",
    "timestamp": 1762124400
  },
  {
    "username": "silenceisgolder",
    "rating": 7.0,
    "comment": "I'm quite late to the party on the Gloomhaven craze (writing this in early 2024) but it is surprisingly good. At first, I dismissed it as a Kickstarter Dungeon Crawl, which is not something I'm interested in even if it's the best one. The Mage Knight comparisons are much truer, but I found the upkeep simpler and the gameplay more focused -- you're really trying to optimize your hand of action cards. Playing two-handed solo isn't too bad, and quickly coming up with and executing plans has been a satisfying pastime that is just what I want out of a solo game.\n\nThe setup and teardown are annoying but all of the different ancillary elements smash together in a way that keeps the gameplay feeling exciting without feeling random -- no small feat. I'll be happy to keep playing this one.",
    "timestamp": 1762124400
  },
  {
    "username": "Charcoman",
    "rating": 7.0,
    "comment": "I have just go through two of the introductory scenarios, learning myself and playing the first with Xavier. Too soon maybe to give an opinion, but here are my first impressions:\n\nQuote:\n+ It is an excellent product. The components are top quality. The insert is really good, the box is full up to the cover!\n+ The way it has solved the tedious set-up of others dungeon crawlers, thing that I hate, is fantastic (even though not innovative, I know).\n+ I don't usually like dungeon crawlers, mice and mystic bore me to dead, but this one is interesting and I am enjoying it. The puzzle it proposes looks funny even though very simple for the moment (I have read that the introductory scenarios are very easy, let's see the progress).\n+ The mechanic is very smart and I understand why GH has been so a big success. The selection process in your cards and them being the timer of the scenario is pure gold.\n+ The history itself, up to now is quite standard BUT I recognize that they have put a good effort on it. The characters proposed have some charisma, the art and background world is nice, they even provide even a short comic with the game!",
    "timestamp": 1762124400
  },
  {
    "username": "wkover",
    "rating": 7.0,
    "comment": "We enjoyed the original Gloomhaven, but in moderation. Groundbreaking, to be sure, but also grindy. We gave up after 40 scenarios, so JotL and its less overwhelming campaign seemed worth a shot.\n\nJotL is the cleaner experience. And shorter, in that there are only 25 scenarios instead of a million. Shorter is sometimes better. Would be rated higher, but having to constantly destroy inanimate objects isn't fun.\n\nWARNING!!: For the first half of JotL - and all our original Gloomhaven sessions! - we made the common mistake of miscalculating the difficulty level. Consequently, most scenarios were more challenging than they should have been. Which makes our wins that much more impressive, and also explains why certain scenarios were oppressively difficult. Yikes.\n\nPostscript:\n\nCampaign complete! For fun, my ranking of campaign games (top = most enjoyed):\n\nPathfinder Adventure Card Game (all sets played; great character progression, but an acquired taste)\nEarthborne Rangers\nThe 7th Continent (counting each curse as a separate campaign)\nClank Legacy\nApocrypha (like PACG, but stranger, darker, and less linear)\nZombicide: Rio Z Janeiro\nPandemic Legacy\nLord of the Rings: Journeys in Middle-Earth\nRoll Player Adventures (original + Gulpax; prize for the most story-rich campaign)\nSleeping Gods\nZombicide: Washington ZC\nZombicide: Fort Hendrix\nZombicide: Pariz\nMass Effect: Project Hagalaz\nFlame & Fang\nG.I. Joe Deck-Building Game: Raise the Flagg campaign\nFabled Fruit (w/o problematic Lime expansion)\nDragonlance: Warriors of Krynn\n7th Citadel (loved 1st threat; 2nd was disappointing)\nLands of Galzyr\nThe Initiative\nZombicide: Gears & Guns\nGloomhaven: JotL\nDestinies: Witchwood\nGloomhaven (lost interest halfway through)\nD&D: Tomb of Annihilation\nD&D: Temple of Elemental Evil\nHarry Potter/Toy Story Deckbuilders\nThe Veil: Rulers of Darkness\nThe Elder Scrolls: Betrayal of the Second Era\nDescent: Road to Legend co-op app (starter campaign)\nDC Deck-Building: Rebirth\nAscension Tactics (2p co-op campaign)\nZombie Teenz Evolution (much higher with target age group)\nWarhammer Quest ACG (too brutal; better with expansion characters)\nSword & Sorcery: Ancient Chronicles (Descent+; fun enough, but I doubt we'll continue)\nDescent: Road to Legend (original 1E; abandoned for shinier, better campaign games)\nTainted Grail (3p campaign aborted; too much grind + oppression)\nMy City\n\nExcept for the final two entries, all the above were enjoyable - so no regrets. Everything above TG is rated 6+.\n\nI gave up on one-vs-many systems, since they're nonsensical and imbalanced. All monsters behaving optimally isn't fun.\n\nNote: I've played plenty of fantasy games, but most don't fall into the campaign category. Weird.",
    "timestamp": 1762124400
  },
  {
    "username": "Geroid",
    "rating": 7.0,
    "comment": "Very easy to learn and very quick to setup, unlike Gloomhaven. It's a fun cooperative game and has a quick game flow.\nUpdate: All the fighting gets a bit tedious after five scenarios.",
    "timestamp": 1761778800
  },
  {
    "username": "Kater_Inna",
    "rating": 7.0,
    "comment": "5",
    "timestamp": 1761778800
  },
  {
    "username": "BoardgameBriBri",
    "rating": 7.0,
    "comment": "PERSONAL LIKES\nCategory: Adventure, exploration, fantasy, fighting, miniatures\nMechanism: Campaign/battle driven, cooperative game, deck construction, grid movement, hand management, legacy game, multi-use cards, role playing, scenario/mission/campaign game, variable player powers",
    "timestamp": 1761519600
  },
  {
    "username": "Rasdel",
    "rating": 7.0,
    "comment": "This is for me the way Gloomhaven should have been marketed. The booklet is brilliant is simplifies the setup and makes it a blast to play. I hope this will become a spin off series with different entries in the future. Smaller more affordable stand alones that build up into something bigger when put together, similar to how LCGs work... not likely though.",
    "timestamp": 1761519600
  },
  {
    "username": "Korrs",
    "rating": 7.0,
    "comment": "Decent dungeon crawler.",
    "timestamp": 1761256800
  },
  {
    "username": "JM_arsal",
    "rating": 7.0,
    "comment": "It tries to do everything right, but it only scratches the surface with each attempt. The story is engaging, but it gets diluted among repetitive scenarios: you enter a place, fight enemies, repeat the cycle for 20 chapters without variation. There are no epic moments that stay memorable, just monotony. The attack decks are random and don’t allow for real strategic management. The card mechanic divided into top and bottom parts with initiative between heroes and monsters is the best part, but it’s not enough to save a game that feels half-developed and boring. A run-of-the-mill title with a great idea that fails to take off. We won the campaign, but winning meant closing this box forever.",
    "timestamp": 1761084000
  },
  {
    "username": "Deathron123",
    "rating": 7.0,
    "comment": "Game is fine. Not a fan of it.",
    "timestamp": 1759615200
  },
  {
    "username": "Stingart",
    "rating": 7.0,
    "comment": "Great world and mechanics, but poor finish - the end missions starts to drag a bit. In any case worth a try.",
    "timestamp": 1759615200
  },
  {
    "username": "Penguinised",
    "rating": 6.5,
    "comment": "Do I like it better than Gloomhaven? Sure. Do I need to own it any more than I needed to own Gloomhaven? Certainly not",
    "timestamp": 1758578400
  },
  {
    "username": "carbohm",
    "rating": 7.0,
    "comment": "Es un dungeon crawler. Toca matar bichos. Hay 4 personajes posibles",
    "timestamp": 1757887200
  },
  {
    "username": "Nonlocal",
    "rating": 7.0,
    "comment": "Gameplay is great. The top action / bottom action mechanic with the cards is wonderful. However, the story felt super generic and for a legacy game I have to nock off points for such. Also, a few of the card actions aren't as well thought out / implemented / balanced as they ought to be.",
    "timestamp": 1756936800
  },
  {
    "username": "Valcurdra",
    "rating": 7.0,
    "comment": "Great way to learn Gloomhaven, definitely the place to start especially if your not normally into heavy games.\n\nCompared to the original you getting the same great gameplay but with some of the world building and city management stripped out, the quality of the scenarios is slightly higher, although I found the balance within the characters to be worse.\n\nThe book is popular with others but I much prefer the tiles from the original, the book I found to be annoying to use.\n\nOverall your getting a sliver of the content for about a 25% of the price, so you cant beat the experience of the original with this, but its worth having for sure.",
    "timestamp": 1756936800
  },
  {
    "username": "mekane",
    "rating": 7.0,
    "comment": "Picked this up to help learn the game. Got an in-person group going. Enjoyed and appreciated the gentle introductory scenarios. I love playing the Hatchet so far.\n\nReset the game and handed it off to Dave in April 2024",
    "timestamp": 1756850400
  },
  {
    "username": "FaseMenosUno",
    "rating": 7.0,
    "comment": "Precio de compra 54. Precio de venta 19. Total 35",
    "timestamp": 1756504800
  },
  {
    "username": "MiCrab",
    "rating": 7.0,
    "comment": "Community Rating: 8.4",
    "timestamp": 1755036000
  },
  {
    "username": "GeminiWeb",
    "rating": 7.3,
    "comment": "Plays reflect sessions which may include multiple adventures",
    "timestamp": 1754863200
  },
  {
    "username": "inge pen",
    "rating": 7.0,
    "comment": "Ok game.\nSplendid tutorial.\nRulebook itself more of a mess. Hard to look up anything specific.\nI have somewhat dungeon crawl fatigue after played so many campaigns (gloomhaven, oathsworn, tales from the red dragon inn, agemonia, deliverance, primal...)\nSetup is too much of a hassle, but better then original gloomhaven. Prefer this over gloomhaven.\nI need more original games. Fateforge is now more my cup of tea.",
    "timestamp": 1754344800
  },
  {
    "username": "onceplayed",
    "rating": 7.0,
    "comment": "after playing gloomhaven it seemed too simple, some of the missions were a drag (e.g. \"destroy these 8 tables\").",
    "timestamp": 1754085600
  },
  {
    "username": "GuRuGuMaWaRu",
    "rating": 7.0,
    "comment": "CAMPAIGN GAME",
    "timestamp": 1753999200
  },
  {
    "username": "YoLYcmqZ",
    "rating": 8.0,
    "comment": "Thoughts: Played one campaign and really got into it. Very immersive with excellent tactical combat and rewarding progression. Worth the commitment—even solo—when you're in the mood. No desire for big Gloomhaven, this is my sweet spot.\n\nTag(s): Campaign, Tactical Combat, Cooperative\nBest Player Count: 1-4, {2}\nRating: 9, -1.0\nOwn: Physical\nFinished. ✅\n\nFor Sale: $30, including sticker pack.\n(Amazon: n/a, GN: $50)",
    "timestamp": 1762693260
  },
  {
    "username": "yaofengze",
    "rating": 7.8,
    "comment": "（317.08买入 270卖出）",
    "timestamp": 1762383600
  },
  {
    "username": "larryonov",
    "rating": 8.0,
    "comment": "Best: 2, 1",
    "timestamp": 1762297200
  },
  {
    "username": "Dr_Bewd",
    "rating": 8.0,
    "comment": "This started as a 10, then it progressively went down to 9.5, then 9, and it currently sits at 8.5. My main issues remain a weak narrative and the small variety of characters to try in order to replay the campaign more often. This remains the Gloomhaven that I would recommend, but I slowly cooled on it. In part, this is because I don’t really enjoy coops that much and because campaign games are too hard to get to the table for me. This will leave the collection.\n\nMy original thoughts:\nThis game feels a lot like an SRPG in a box. I simply love it and I think that this is a great introduction to its big brother (although JotL might be enough). The rulebook is very clear, well structured, and it does an amazing job. The 5 tutorial scenarios are very helpful to teach the game and allow you to teach the rules little by little. Scenarios can become a bit repetitive, but the main limit is arguably the narrative (I would probably say the same things about the original). Unfortunately, the story is nothing to be particularly excited about. All things considered, I’m not very likely to get Gloomhaven or Frosthaven any time soon… an expansion to add a couple of characters (and maybe a few more interesting scenarios) to JotL would be nice though.",
    "timestamp": 1761951600
  },
  {
    "username": "taurai",
    "rating": 8.0,
    "comment": "01/2021\n59,-",
    "timestamp": 1761778800
  },
  {
    "username": "opti_mind",
    "rating": 8.0,
    "comment": "It's hard for me to describe my feelings of this board game. On one hand, I love it, and on the other, I hate it. The part that I love is the uniqueness of the Gloomhaven world, it's art and how the game mechanics were mixed. The part that I hate is how long can one of the first missions can take with just 2 players, around 10 hours ...",
    "timestamp": 1761606000
  },
  {
    "username": "frodopytlicek",
    "rating": 8.0,
    "comment": "I think it's better than original Gloomhaven.",
    "timestamp": 1761606000
  },
  {
    "username": "Paddouken",
    "rating": 8.0,
    "comment": "Very good introduction version of gloomhaven. Characters are little bit unbalanced and are overpowered at further stages.",
    "timestamp": 1761519600
  },
  {
    "username": "PaychologicalBox",
    "rating": 8.0,
    "comment": "Making my through my first campaign and really enjoying it so far. As a DM for DND5e, this is a great game to play that allows me to be part of the action. Highly recommend.",
    "timestamp": 1761429600
  },
  {
    "username": "franfac",
    "rating": 8.0,
    "comment": "prestado",
    "timestamp": 1760479200
  },
  {
    "username": "rigacu",
    "rating": 8.0,
    "comment": "Vienna",
    "timestamp": 1760306400
  },
  {
    "username": "asmonder",
    "rating": 8.0,
    "comment": "Great game, a lot of flexibility and depth. Some levels were brutal - and it took some time to beat (cough cough sewer level)",
    "timestamp": 1760220000
  },
  {
    "username": "Viewtiful_Justin",
    "rating": 7.5,
    "comment": "can't sell - stickers",
    "timestamp": 1760220000
  },
  {
    "username": "Togii",
    "rating": 8.0,
    "comment": "Strategic Depth: 10/10\nRNG Mitigation: 9/10\nGoofiness Potential: 6/10\nSimplicity: 2/10\nArtistic Direction: 10/10\n\nTime Commitment: 120 min plus",
    "timestamp": 1759960800
  },
  {
    "username": "thefatcyclist",
    "rating": 7.5,
    "comment": "***V-2",
    "timestamp": 1759874400
  },
  {
    "username": "rcausapie",
    "rating": 8.0,
    "comment": "Que gran juego , muy divertido combates y construcción de mazos",
    "timestamp": 1759788000
  },
  {
    "username": "Barbarrodja",
    "rating": 8.0,
    "comment": "La mecánica perfecta. La única pega es que la historia que cuenta, no me importa en absoluto.",
    "timestamp": 1759442400
  },
  {
    "username": "Lendengold",
    "rating": 8.0,
    "comment": "Anne\n(gekauft auf der Spielemesse Essen, 2022)",
    "timestamp": 1759442400
  },
  {
    "username": "CommanderDarken",
    "rating": 8.0,
    "comment": "Gloomhaven - die Pranken des Löwen ist die \"Light\"-Version von dem Schwergewicht Gloomhaven, wobei leicht nur im Vergleich zu Gloomhaven zu verstehen ist.\n\nDie Pranke des Löwen ist nicht nur der deutlich preiswertere Einstieg in die Welt von Gloomhaven.\n\nBei Pranken des Löwen wechselt man nicht den Helden während der knapp 25 Missionen dauernden Kampagne.\n\nAußerdem hat das Spiel eine 5-teilige Einführungskampagne, die einem die verhältnismäßig komplexen Regeln gut verständlich beibringt.\n\nDie deutsche Übersetzung ist von guter Qualität.\n\nIm Gegensatz zum großen Bruder geht der Aufbau dank eines Heftes mit 25 vorgedruckten Dungeons deutlich schneller.\n\nDie Pranke des Löwen ist perfekt, um das Regelsystem zu lernen und relativ preiswert zu testen, ob einem das System taugt.\n\nBei Gefallen kann man sich den großen Bruder Gloomhaven oder den neuen verbesserten Bruder Frosthaven zulegen.",
    "timestamp": 1759269600
  },
  {
    "username": "BretonJack",
    "rating": 8.0,
    "comment": "Really worth the value for the amount of scenarios in this game. Me and a friend reached just a little less than half way through this. It became quite challenging, we were on a specific scenario that we just kept losing. Would like to revisit this again to give it another crack.",
    "timestamp": 1759010400
  },
  {
    "username": "notnorb",
    "rating": 8.0,
    "comment": "Sept 2024 - 8/10\n\nJan 2021 - 8.5/10",
    "timestamp": 1758837600
  },
  {
    "username": "emilcavan",
    "rating": 7.5,
    "comment": "Me gusta mucho la mecánica de las cartas de capacidad y de los descansos. Estoy solo aprendiendo, pero me parece un gran juego de mazmorreo.\nCampaña iniciada con mi chiquillo",
    "timestamp": 1758578400
  },
  {
    "username": "abicsab",
    "rating": 7.5,
    "comment": "Gloomhaven has an amazing concept, but I never quite find the will to set it up and play. Maybe sometime in the future I’ll dive in, because I know it has huge potential.",
    "timestamp": 1758405600
  },
  {
    "username": "zocl",
    "rating": 7.5,
    "comment": "While I did like the game mechanics and characters, I didn’t finish this campaign as the story didn’t really pull me in. Fighting the different monsters also became a bit repetitive and playing solo with two characters seemed like it entailed a lot of overhead. The work to fun ratio was a bit off for me as a result. The amount of content you get in the box is very generous and I think it’s one of the best values I’ve gotten in board gaming. And one of the best onboarding and rule book experiences I’ve had. From this game I found that Gloomhaven was not a world for me but I do have a soft spot for the characters in it.",
    "timestamp": 1758232800
  },
  {
    "username": "RollPatrol",
    "rating": 8.5,
    "comment": "Just as epic as the big brother, though without the humonguous set up & tear down times.",
    "timestamp": 1762470000
  },
  {
    "username": "camax",
    "rating": 8.5,
    "comment": "It's a great coop campaign and intro into the world of Gloomhaven. The wife and I like RPG like games where you level up your characters. The book being the map/playing surface is genius. The difficulty is using the top half of one card, and the bottom half of another. Cards are like currency, so once they are spent, they are gone for that game. That also serves as your timer for completing the quest in time. Jaws of the Lion has a ton in the box for an reasonably affordable price (since it's often on a good sale.) One of these days, we hope to get through the campaign, as for us, it's hard to sit down for that length of time to play. The introductory campaigns ease you into how to play, which is great, and we were able to get through those in a decent amount of weeks. Clearly once the time investment ramped up, we took the off ramp!",
    "timestamp": 1762470000
  },
  {
    "username": "Rianona13",
    "rating": 8.5,
    "comment": "2022 - Marzo ⚔️ En solitario\n\n1-5 Tutorial ⭐⭐⭐\n---\n6 Investigación corrupta⭐⭐\n7 Tumor hundido ⭐⭐\n8 ❌ Localización inaccesible\n9 Evolución explosiva ⭐⭐⭐\n10 Las pruebas de los héroes ⭐⭐\n11 Alcantarillas contaminadas ⭐⭐⭐\n12 ❌ Localización inaccesible\n\n--- Misiones secundarias:\n19 Guarida de ladrones ⭐\n\n--- Desbloqueadas---\n13 Cosecha perversa - Escenario de campaña.\n20 Mercancías extraviadas - Misión secundaria\n21 Agentes del caos - Misión secundaria\n23 Lo mejor de lo mejor - Misión secundaria\n24 Vigilar el vacío - Misión secundaria\n\n-Personajes-\nCentinela del vacío ⭐⭐\nGuardia rojo ⭐⭐⭐\nEjecutor ⭐⭐\nDemoledora ❌",
    "timestamp": 1762383600
  },
  {
    "username": "Roboard_games",
    "rating": 9.0,
    "comment": "Great game, and a good linear introduction to the genre. Had fun playing it with three friends and getting all characters into play. The writing is great and suits the tone, without overdoing it. Great way to encourage that friend that think DnD Is \"cringe\" to roleplay a bit with the city events  Everyone had fun and now wants to play frosthaven!",
    "timestamp": 1762383600
  },
  {
    "username": "ditterio",
    "rating": 9.0,
    "comment": "10 extra scenario missions: https://boardgamegeek.com/filepage/241160/gloomhaven-serpent...\n\nChecklist after each scenario: https://boardgamegeek.com/filepage/204464/post-scenario-chec...\n\nWe have to start with scenario 13.\n\nSolo: use the Gloomhaven Companion app",
    "timestamp": 1762297200
  },
  {
    "username": "Justnow86",
    "rating": 9.0,
    "comment": "Best Gloomhaven for beginners. Just start playing while reading the rules. At the end of chapter 5 you know everything you need to know for this game.\nTook a friend and me about a year to complete.",
    "timestamp": 1762124400
  },
  {
    "username": "timo93",
    "rating": 8.5,
    "comment": "unsure",
    "timestamp": 1761951600
  },
  {
    "username": "orangecat17",
    "rating": 8.5,
    "comment": "Same core system as the OG and Frosthaven. But who exactly is this targeted at? It sells at Target, but I can't imagine a non-hobby customer picking this off the shelf and not being overwhelmed by it. I suppose it's for hobby gamers who want a shorter campaign, and assuming I am correct, I wish they had chosen to add more interesting characters to this package. Still, I rate it highly because that core system is fantastic.",
    "timestamp": 1761951600
  },
  {
    "username": "Eca333",
    "rating": 9.0,
    "comment": "Used some house rules to get through it solo.",
    "timestamp": 1761865200
  },
  {
    "username": "Nerdvik",
    "rating": 9.0,
    "comment": "Really intriguing game that I though would hook me to play it but I just do NOT have the time.",
    "timestamp": 1761170400
  },
  {
    "username": "TheDoctr",
    "rating": 9.0,
    "comment": "Eric",
    "timestamp": 1760997600
  },
  {
    "username": "Stonlim",
    "rating": 8.5,
    "comment": "1-4 jogadores - 90 minutos",
    "timestamp": 1760652000
  },
  {
    "username": "Spektro",
    "rating": 9.0,
    "comment": "First time a board game made me eagerly wait the next time I can play with it.\n\nIt's an incredibly good game to play if you have some fellow idiots.\n\nWhile we play I take up the role of the \"game master\", i have read all the rules, i check them, manage the monsters, tracking. The other players only need to play so I make the game easy for them.\n\nBit of downside that not all 4 of us are always available to play, but we knew that when we started the campaign\n\nStory is trivial.\n\nThings are a bit hard to track at times but not that bad in my experience.\n\nI am biased towards this game due the company I am playing it with.",
    "timestamp": 1760220000
  },
  {
    "username": "isito",
    "rating": 8.5,
    "comment": "Played the first scenario alone. It is an immersive game, gotta experience it with more people. Love the tutorials and characters/figures.",
    "timestamp": 1759960800
  },
  {
    "username": "jackycola",
    "rating": 9.0,
    "comment": "Für mich deutlich besser als das \"große\" Gloomhaven. Einführungsrunden bringen die Regeln bei, eine Story führt durch die Kampagne und mit insgesamt 25 Missionen (die man nicht alle spielt) kommt man realistisch ans Ende bevor die Gruppe auseinanderfällt.\n\nEinzig das Buch mit den Karten ist zu klein, aber das haben wir anders gelöst.",
    "timestamp": 1759874400
  },
  {
    "username": "Jolman42",
    "rating": 9.0,
    "comment": "Une expérience très bonne pour l'instant, un jeu qui donne le feeling de Diablo mais remplaçant le combo et l'APM par de la stratégie et de la gestion de main. Le tuto fait un job incroyable pour tout expliquer. Le jeu en solo est smooth mais demande beaucoup de concentration pour ne rien rater.\n\nAprès plusieurs scénarios (9 complétés), le jeu est simplement addictif et les interactions entre personnages très fun - au point de joueur solo avec 3 personnages. La gestion du jeu est complexe mais fonctionne sans appli avec de l'organisation.\n\n4 scénarios à 2 joueurs sur une campagne secondaire : la dynamique change beaucoup mais reste super fun, presque un jeu à part, mais cela en dit long sur la richesse du jeu.",
    "timestamp": 1759788000
  },
  {
    "username": "Colombian85",
    "rating": 9.0,
    "comment": "Gekauft: 55,99€ + Insert 25,20€",
    "timestamp": 1759528800
  },
  {
    "username": "Fevin",
    "rating": 8.8,
    "comment": "Un Gloomhaven facile à instaler avec pratiquement toute la saveur. Les monstres manque un peu d'originalité et les classes ne sont pas les plus sympa. L'équilibrage est meilleur.",
    "timestamp": 1759356000
  },
  {
    "username": "Cycu150",
    "rating": 9.0,
    "comment": "kupione wspólnie Delma/Roki",
    "timestamp": 1759183200
  },
  {
    "username": "seanmeyer6",
    "rating": 9.0,
    "comment": "Want to learn Gloomhaven and like campaign games fighting bad guys? This is very good and you always look forward to what the next level will bring/introduce and how you'll figure out the next puzzle. Can adjust difficulty so each mission is a nail biter. The card play for movement/combat is unique and sometimes so hard to decide what you must get rid of... great tension.",
    "timestamp": 1759183200
  },
  {
    "username": "jjopa",
    "rating": 9.0,
    "comment": "Fantastic introduction into the world of Gloomhaven. It has the best tutorial I've ever seen in a boardgame. It works so well. The amount of content in this box is absurd.",
    "timestamp": 1758751200
  },
  {
    "username": "Nerd_4_Lyfe",
    "rating": 9.0,
    "comment": "I am very new to the Gloomhaven world and game. I am coming from 40K and starting to enjoy board-gaming much more. This game is fantastic. My son and are halfway through and we love it.\nThe simplicity of the game and the growth of the characters is really good!",
    "timestamp": 1758751200
  },
  {
    "username": "Pamponiros",
    "rating": 9.0,
    "comment": "Just wow. Great entry into the series with nice characters (except maybe Demolitionist) and enemies. Finished it 4handed at +2 difficulty since i was familiar with Gloomhaven and it has been one my greatest experiences ever. 9 because Demolitionist as i said is a bit subpar, not because of her kit but because of elements missing in later scenarios which doesn't help her. Story is also subpar. People whining about last boss being super easy but i didn't find that to be the case. 1 class specific scenario is cheese-able but doesn't feel like it has a legit beating method either",
    "timestamp": 1758664800
  },
  {
    "username": "boardwithteacher",
    "rating": 9.0,
    "comment": "Finished",
    "timestamp": 1758578400
  },
  {
    "username": "videlpain",
    "rating": 10.0,
    "comment": "Point scale - 1=Terrible, 5=not boring but not compelling, 10=Compelling\nMinis: 8\nArt: 7\nRule book: 10\nPlayer aid: 10\nGame play: 10\nStory: 7\nOver all: Must play",
    "timestamp": 1762666020
  },
  {
    "username": "rooninzen",
    "rating": 10.0,
    "comment": "Juegazo. Obligatorio jugar al tope máximo de jugadores para que se disfrute más y en el idioma que manejen los jugadores. El tutorial es fácil de aplicar a nuevos jugadores. Se hubieran agradecido mas escenarios. Muy recomendable.",
    "timestamp": 1762647960
  },
  {
    "username": "mentor77",
    "rating": 10.0,
    "comment": "10 play for now. Amazing.\nYou have to like tactical combat with hand management because this is what it is put in a dungeon crawler.",
    "timestamp": 1762297200
  },
  {
    "username": "BlueEyesLX",
    "rating": 10.0,
    "comment": "Sleeved with Docsmagic Standard Size Premium Card Sleeves Clear (DMS13)\nSleeved with Docsmagic Mini European Premium Board Game Sleeves (DMS16)\nInsert by E-Raptor",
    "timestamp": 1762124400
  },
  {
    "username": "kesulin",
    "rating": 10.0,
    "comment": "Sorprendido por el puzzle euro que te presenta, integrado muy bien con el tema dungeon.\n\nMe ha parecido lo mejor que he probado en mucho tiempo.",
    "timestamp": 1761778800
  },
  {
    "username": "Hydrommel",
    "rating": 10.0,
    "comment": "Excellent jeu. Beau matériel. Mode apprentissage top. Complexe, juste ce qu'il faut. Evolutif (montée en expérience, montée en difficulté des scénarios). Adaptatif (selon le nombre de joueur, les scénarios s'ajustent). Coopératif (2 à 4) & mode solo : tous modes intéressants.\nSeule petite remarque : le narratif semble un peu linéaire (pour un ancien joueur de jeu de rôle self-scénarisés), bien qu'il y ait quelques surprises. L'approche reste très \"tue et ramasse\", même si les rencontres \"en ville\" enrichissent bien le narratif.\nIncontournable et on y revient sans ennui !",
    "timestamp": 1761519600
  },
  {
    "username": "Spedicy",
    "rating": 10.0,
    "comment": "My first experience at a campaign game and i love how accessible it is for newcomers",
    "timestamp": 1761084000
  },
  {
    "username": "crito13",
    "rating": 10.0,
    "comment": "Excellent! Quickly has become one of my all-time favorites. Fantasy, cooperative, roleplaying - what is there not to love.",
    "timestamp": 1760997600
  },
  {
    "username": "alesab",
    "rating": 10.0,
    "comment": "Perhaps, a fifth player could control the monsters in a four-player game",
    "timestamp": 1760911200
  },
  {
    "username": "yaenz",
    "rating": 10.0,
    "comment": "One of the best gaming experiences i have ever had in my life. The simultaneous two-card action selection mechanism is deeply engaging and rewarding. Jaws of the Lion is a condensed version of its big brother that amplifies and elevates all of the good stuff like character interaction, scenario diversity, and meaningful progression while speeding up setup and teardown by A LOT with the printed scenario maps. It's a perfect culmination of every kind of fun a boardgame can be.",
    "timestamp": 1759874400
  },
  {
    "username": "Mutiemoe",
    "rating": 10.0,
    "comment": "Jaws of the Lion really is better game than the original Gloomhaven.",
    "timestamp": 1759701600
  },
  {
    "username": "GrandPseudonym",
    "rating": 9.5,
    "comment": "Good Solo\nBest with 2\nGood with 3\nGood with 4\n~90 Minutes\n~120 Minutes\nMediumweight\nHeavyweight\nCo-op\nEuro\nAmerican\nStrategy\nThematic\nCombat\nCardplay",
    "timestamp": 1759615200
  },
  {
    "username": "Subaru77",
    "rating": 10.0,
    "comment": "Na, így kellett volna már elsőre is megcsinálni a Homályrévet. Van egy történetív, amit végigjátszva pont telítődik is az ember. A lapozható spirálfüzet, ami egyben a pálya is pont kényelmes és praktikus.",
    "timestamp": 1759442400
  },
  {
    "username": "ArmadaC137",
    "rating": 10.0,
    "comment": "I have never played the original because I was intimidated by the large box.\n\nI am glad I waited and bought this instead. It looks like it is much more manageable than the original. It is perfect for casual players.",
    "timestamp": 1759269600
  },
  {
    "username": "paddy101",
    "rating": 10.0,
    "comment": "Played it all. Great experience. Was not too hard on normal difficulty.\n\nDidnt feel the need to replay anything after finishing the story. Really like the scenario book with maps for faster setup time",
    "timestamp": 1759096800
  },
  {
    "username": "KerriCo",
    "rating": 10.0,
    "comment": "10/10 GAME, my god this is so much fun. The settup is really fast, this feels like a really well done videogame, the tension when facing a boss is amazing and the strategy makes you feel like everything good that happens is thanks to your witt. The perks and the items are perfectly balanced. My score is \"just buy it\"",
    "timestamp": 1759010400
  },
  {
    "username": "Ironclad_Board_Gamer",
    "rating": 10.0,
    "comment": "Perfect length campaign",
    "timestamp": 1759010400
  },
  {
    "username": "WadeB1977",
    "rating": 9.8,
    "comment": "A sort of beginner Gloomhaven, and a taste of the main campaign game. The book-style map is much more engageable for new players and the four characters are just enough to learn without being overly simple. The characters are usable in the main game as well.",
    "timestamp": 1758319200
  },
  {
    "username": "yabluz",
    "rating": 10.0,
    "comment": "Per ora questo gioco mi sta entusiasmando, l'ho preso per giocarci in solitario e sto finendo gli scenari col demolitore e il voidwarden, però poi ci voglio rigiocare con le altre 2 miniature e vedere quale coppia mi piace di più. Il tutorial è semplicemente fantastico, l'opposto di quanto sia difficile fare anche solo 1 passo avanti in Mage Knight.",
    "timestamp": 1757800800
  },
  {
    "username": "Barry_Ribera",
    "rating": 10.0,
    "comment": "La polla con cebolla",
    "timestamp": 1757714400
  },
  {
    "username": "ivanxote",
    "rating": 10.0,
    "comment": "perfect game to play with your friends",
    "timestamp": 1757714400
  },
  {
    "username": "romaan777",
    "rating": 10.0,
    "comment": "wonderful game, brought my kids to the world of expert games and we have now a playtime of 10 month and 4 scenarios left!",
    "timestamp": 1757714400
  },
  {
    "username": "Daniel_Enriko",
    "rating": 10.0,
    "comment": "not open",
    "timestamp": 1757628000
  },
  {
    "username": "michalb7",
    "rating": 9.5,
    "comment": "Prefer more Jaws of the Lion than the orginal Gloomhaven",
    "timestamp": 1757282400
  }
]