[
  {
    "username": "Glanzmuecke",
    "rating": 1.0,
    "comment": "Another modern solitaire euro. Not for me. At least I did give it a try",
    "timestamp": 1747692000
  },
  {
    "username": "maejohns",
    "rating": 1.0,
    "comment": "colorblind unfriendly",
    "timestamp": 1737154800
  },
  {
    "username": "ultimoratio",
    "rating": 1.0,
    "comment": "yet another standard Euro game",
    "timestamp": 1729116000
  },
  {
    "username": "foxrain4",
    "rating": 1.0,
    "comment": "Interesting theme but messy board\nPlaced in cold storage because of complexity and no reviews from friends yet",
    "timestamp": 1663020000
  },
  {
    "username": "GuySamstag",
    "rating": 2.0,
    "comment": "Euro-\"slop\". And I meant more in the sense how it muddles your memory. Couldn't remember that I've played this, but apparrently I have.\nActually rather impressive, if you think about it, how Eurogamers are able to differentiate and compare these things. Much-needed skill in this hobby.",
    "timestamp": 1757455200
  },
  {
    "username": "brapsmagic",
    "rating": 2.0,
    "comment": "this comment is based on the fact that I bought this to play solo. it's false advertising to claim to have a solo mode when there really isn't one. a solo mode is designed as such and has an AI. this game's solo mode is \"play by yourself and score as many points as you can in X rounds\". I can do that with pretty much any board game--it's not a solo mode. it's 2025. game designers should know this (and DO know this), so it's kind of a BS move to claim this is a solo mode for your game when this is all you provide.",
    "timestamp": 1735772400
  },
  {
    "username": "Xquarky",
    "rating": 2.0,
    "comment": "Unbalanced asymmetrical faction + random tiles + random end game scoring",
    "timestamp": 1733526000
  },
  {
    "username": "kyoysc",
    "rating": 2.0,
    "comment": "poor balanced game",
    "timestamp": 1690063200
  },
  {
    "username": "Ephorus",
    "rating": 3.0,
    "comment": "What I like:\n- Comboooos!\n- Pretty fun puzzle/optimisation game.\n\nWhat I dislike:\n- Mostly MPS. Players just explain what they are doing, while players wait for their turn.\n- Very fiddly and very long set-up.\n- Shines most with three to four players which increases waiting times too much for me. Since there are a lot of combos in this game, waiting times per person can be quite long.\n\nWhy I culled it:\nNot my type of game. See above.",
    "timestamp": 1762038000
  },
  {
    "username": "toorwell",
    "rating": 3.0,
    "comment": "Just Another Soulless Euro.",
    "timestamp": 1758924000
  },
  {
    "username": "tectactoe",
    "rating": 3.0,
    "comment": "Point salad, resource conversion, chained actions - all the hallmarks of the watering down of the modern-day euro, and yet I have enjoyed my time with this one so far, more so than a handful of other recent games that have felt comparatively like either homework or aimless wandering (i.e., RATS OF WISTAR, APIARY, WOODCRAFT, etc.). Not sure why? I admire the use and flow of the cards - top vs. bottom, which slot to used (based on possible modules acquired), and the cycle of use -> graveyard -> hand. Haven't played enough to comment on balance, but it \\seems\\ like multiple strategies can be viable - explore heavy, build heavy, machine track heavy. I think it depends on your score card and how hard you want to go on a specific category. We'll see if this holds up with repeated plays, but I was pleasantly surprised (despite the theme here being absolutely irrelevant to everything).",
    "timestamp": 1756764000
  },
  {
    "username": "zuzubun",
    "rating": 3.0,
    "comment": "Too long pointsalad which drags for more than an hour even after you can determine the winner. Rudimentary card pool building. Not much can be done to prevent a snowballing leader from winning.",
    "timestamp": 1745186400
  },
  {
    "username": "shoemoney",
    "rating": 4.0,
    "comment": "I’m a big fan of Østby and Svennson’s (and in this instance of course Meissner's and Wermlund's) work, and this one has engaging combo-chains, strong production values, and other standout features such as the interwoven tracks and engine-building that is cleverly attached to all major actions. Clearly built on Østby and Svennson’s signature design philosophies, Revive relies on a small number of core actions that combine with a larger number of modifying mechanisms and bonuses to parse. However, in this case the modular mechanisms and bonuses fail to coalesce around a central driving force (the endgame goal tiles and cards aren't sufficient), which tilts the game towards aimlessness and a lack of a sense of progression. In addition, the number of sources for combos (the three intertwining tracks on your player board, the machine tokens, the cards, the slots, your player powers, the tech track) make the game's flow a bit cumbersome. Still, chaining actions together is fun, to a point. Caveat: It is clear from the rankings that I am in the VAST minority, and that most people consider this the designers' magnum opus. For me, it's The Magnificent or Capital Lux, and I eagerly await Saltfjord.",
    "timestamp": 1762124400
  },
  {
    "username": "Mauricio_Oliva",
    "rating": 4.0,
    "comment": "hard do learn",
    "timestamp": 1759874400
  },
  {
    "username": "keckz",
    "rating": 4.0,
    "comment": "Furztrocken. Keine Interaktion. Ausbalanciert?? Thema? ... austauschbar und nicht relevant.\nDa fallen mir viele Spiele ein, die ich lieber spielen würde...",
    "timestamp": 1758924000
  },
  {
    "username": "federik21",
    "rating": 4.0,
    "comment": "Solitaire",
    "timestamp": 1757973600
  },
  {
    "username": "bcnevan",
    "rating": 5.0,
    "comment": "Empty engine building with little interaction and just too much component manipulation for the actual decision space. The pattern of small to big turns can create downtime that isn't made up by your own big turn, due to the basic nature of what the engines accomplish. You can feel the table pulling to overlap turns to get the pace faster.\n\nThe card play backed by a nicely strategic combination of engine building and scoring pursuits are the best aspects. But the downsides easily overwhelm the positive aspects here.",
    "timestamp": 1761519600
  },
  {
    "username": "Argann",
    "rating": 5.0,
    "comment": "Autant pour le thème que pour les mécaniques, j'ai trouvé ce jeu très moyen.\nJ'ai eu l'impression de jouer à la dînette a transformer des ressources en d'autres ressources, pour dépenser ces même ressources afin d'en gagner d'autres...\nLe jeu propose peu d'interactions (au point que nous avons finit par jouer simultanément pour gagner du temps), il n'est pas contraignant, on parvient toujours à faire ce que l'on avait prévu sans délais ou presque.\nIl faut monter sur des pistes pour scorer et débloquer des modules qui se valent à peu près tous, rien n'est décisif, piocher au hasard ou choisir dans le marché revient à peu près au même.\nBref je me suis ennuyé...",
    "timestamp": 1757973600
  },
  {
    "username": "Killi",
    "rating": 5.0,
    "comment": "Felt bland to me. Played it 2 or 3 times already, probably won't play again.",
    "timestamp": 1756504800
  },
  {
    "username": "drenquea",
    "rating": 5.0,
    "comment": "Nice, aber zu komlex/frickelig, um richtig Spaß zu machen, Züge dauern zu lange",
    "timestamp": 1751407200
  },
  {
    "username": "Dukeludwig",
    "rating": 5.0,
    "comment": "Honestly haven’t quite seen what justified the hype for this game. It’s not bad, but the theme doesn’t come through at all, the card graphic design is boring, and the gameplay doesn’t leave much of an impression. I usually feel like I’ve just started getting going when the game suddenly ends. I have warmed on it some with each subsequent play, but I have a feeling that I’ll include it in my next cull.\n\nI will say that the dual-layer player boards are pretty cool, but unfortunately cool player boards don’t make a game.",
    "timestamp": 1750802400
  },
  {
    "username": "Fd12",
    "rating": 5.0,
    "comment": "These are four hours of my life I will never get back.\nAfter one hour of teaching and one hour of playing, it finally clicked: this game is a resource optimization game. Two more hours to finish it with four players, and now I can finally avoid playing this again. There are a lot of five stars rated games that I would try out again. But basically there is no story told here, so it would again be a calculatory exam, not a good time beating my friends.",
    "timestamp": 1738278000
  },
  {
    "username": "itzpea",
    "rating": 5.0,
    "comment": "New in Shrink",
    "timestamp": 1737846000
  },
  {
    "username": "invervegas",
    "rating": 5.0,
    "comment": "Complexity √",
    "timestamp": 1737154800
  },
  {
    "username": "ditterio",
    "rating": 6.0,
    "comment": "REVIVE\n\nEURO GAME.",
    "timestamp": 1761692400
  },
  {
    "username": "Imsevimse",
    "rating": 6.0,
    "comment": "Bland aesthetics and an uninspired setting. While the gameplay is decent, it leans heavily on tracks, trickling points and resources, and a fair bit of randomness. The player-board machine tracks—intended as a clever feature—often end up obscuring information. Underwhelming overall.",
    "timestamp": 1758924000
  },
  {
    "username": "laryl",
    "rating": 6.0,
    "comment": "Too complicated for what should be a solid mid-weight game. There are so many options with all the available free actions that our AP-prone player had gridlock every turn and was constantly re-doing all his options when he realized that he'd overlooked something that would give a better result (\"Oh, but if I activate this machine that gives extra range then I don't have to spend that food. That changes everything. Let me start over.\" That kind of thing happens A LOT) Don't like the unintuitive spaghetti-style machine tracks. I do like the customizable machines and the card play with the upgrade slots.\n\nWith the downtime and the fiddly tactical gameplay, this one just isn't for me.",
    "timestamp": 1757282400
  },
  {
    "username": "cicerunner",
    "rating": 6.0,
    "comment": "Just the lightest touch of interaction on the central board. Mechanically interesting player board but ...\n\n(first play November 2023)",
    "timestamp": 1754604000
  },
  {
    "username": "aresil",
    "rating": 6.0,
    "comment": "bga",
    "timestamp": 1754085600
  },
  {
    "username": "Coralouwho",
    "rating": 6.0,
    "comment": "#LetterR\n#Mountains\n#Treasures #Gems\n#BGA #Tutorial",
    "timestamp": 1753826400
  },
  {
    "username": "Kelsoli",
    "rating": 6.0,
    "comment": "I wanted this game for two years before being gifted a copy for Christmas. It's fun, but not the most engaging solo game, after a couple of plays. More fun with other players, which I rarely have. I haven't yet tried the expansion so I'm looking forward to that. Moderately long time to set up and tear down due to many components. Also, the rule book has a number of errors that make it frustrating to learn.",
    "timestamp": 1753653600
  },
  {
    "username": "rayzor6",
    "rating": 6.0,
    "comment": "It's not that it's bad, but it really highlights a problem I have with design space today: LOTS of stuff to do and see but no real direction. It's so much random stuff to get points. It reminds of Feast for Odin on that respect. Just grind to get points and we'll see what happens at the end.. I'm not the biggest fan of longer games with little to learn about how to play WELL after you finish.",
    "timestamp": 1752357600
  },
  {
    "username": "destro",
    "rating": 7.0,
    "comment": "Ph",
    "timestamp": 1762608720
  },
  {
    "username": "TheMaz",
    "rating": 6.5,
    "comment": "Too much \"did I already do this\"? \"Did you remember to take a card?\" When I start hearing these things, it just ruins the game a bit. But it's not nearly as intimidating as it looks. I won't play 4 players live again, but this might be a great one for online play.",
    "timestamp": 1762297200
  },
  {
    "username": "tiagoVIP",
    "rating": 7.0,
    "comment": "Designer: Helge Meissner, Kristian Amundsen Østby, Eilif Svensson, Anna Wermlund\nPlaying time: 90-120 Min\nWeight: 3.44 / 5\nPublisher: Devir\nPlayer count: 1-4 (best with: 3)\n\nCOMPLEXITY: High\nCOMPONENTS: Medium\nDOWNTIME: Medium\nFUN: Medium\nINTERACTION: Medium\nPLAYING TIME: Medium to high\nLUCK: Low\nREPLAY VALUE: High\nSOLITAIRE: Medium\nTHEMATIC: Medium\n\nComments: Revive is a strategy game game about deck building, variable players powers, map addition and tech tree. The ideia is that Revive is part deck builder, part tech tree, part exploration game with asymmetric tribes for the players - double sided at that! It's just a little on the long side for me, but I quite enjoyed the tech tree aspect as well as trying to manage my cards - players will want to get the right cadence so that their engine building lines up at the opportune time.\n\nThe noose tightens surprisingly quickly and there is nowhere near enough time to do what you need to do. Plenty of variability out of the box, but skip the ‘campaign’ and just add in the extra rules/components as you like. I wouldn’t turn down a game of this, but there wasn’t any ‘wow’ factor to keep me coming back.",
    "timestamp": 1761951600
  },
  {
    "username": "lulu35",
    "rating": 7.0,
    "comment": "plus? w3.4 (35+120' vindj) cf passe-temps Campaign Game BGA totest?",
    "timestamp": 1761865200
  },
  {
    "username": "Cocoabine",
    "rating": 8.0,
    "comment": "8/10: Only played Revive once, but really enjoyed it and would happily play again. It has a little bit of everything. Asymmetric factions, tile placement, route placement that functions as workers, engine and deck building. It can feel a bit overwhelming to know what objectives to go for, but at least there is the secret objective card which helps nudge you in one direction or other. Has some nice variability with the factions, tiles, crates, modules, and cards.",
    "timestamp": 1762610880
  },
  {
    "username": "Sedd",
    "rating": 7.5,
    "comment": "Kurz: Ein Zivilisations-Aufbau-Spiel das sehr mechanisch wirkt, bzw. das Thema wenig rüber kommt. Man hat das Gefühl, ich erkunde / breite mich nur aus um Boni abzugreifen. Diese Engine-builder-Mechanik ist wiederrum gut umgesetzt und macht Spaß.\n\nLangform:\nIn Revive spielt jeder ein Volk, das sich vor der wiedrigen Welt versteckt hat. Um sich jetzt, als das Eis endlich taut, auszubreiten und seine Civilisation wieder aufzubauen.\nDas Thema kommt dabei aber nur bedingt rüber. Ich sehe zwar, das ich mich auf der Karte ausbreite und Technologien entwickle. Aber das ist insgesamt eher mechanisch und macht weniger den Eindruck als würde ich mein Volk entwickeln/voranbringen. (M.M.n. ist es hier trotzdem besser gelöst, als bei \"Scythe\".) Gutes Bsp. dazu: Wir machen uns auf die Suche nach Artefakten... Aber die sind leider nur dafür da, um damit Siegpunkte zu generieren.\n\nDie grafische Gestaltung gefällt mir und bringt das Thema wieder etwas näher. Aufmachung und Material sind ebenfalls ziemlich gut (von Karten-/Plättchenqualität bis doppellagiger Tableaus).\n\nDie Mechanik ist in allen Belangen, ein Engine-Builder (Verbeserung der eigenen Auslage, um mehr zu bekommen, wenn man Aktionen ausführt). Auch wenn andere Mechaniken wie z.B. Deck-building dabei sind. (Wenn man es genau nimmt, sind es mehrere kleinere sehr gut verzahnte Enginebuilder)\nJe weiter die Partie vorran schreitet, desto belohnender fühlen sich die Spielzüge an, aber auch umso unübersichtlicher werden diese. (Wegen der Boni, die teilweise gleichzeitig aktiviert werden).\nDa es mehre Optionen gibt, seine Engine zu verbessern, gibt es mehrere Möglichkeiten zu gewinnen (Die Möglichkeiten scheinen auch gut ausbalanciert zu sein). Jedoch laden viele Optionen zur Analyse-Paralyse ein und daher sollte man nicht mit Grüblern spielen.\n\nEs entsteht ein positives Spielgefühl, weil fast alles aufgewertet werden kann. (Karten, die \"Maschine\", Aktivierungsplättchen, Volksbonus, usw.)\n\nWas mir nicht so gefällt:\n-Die Passen-Aktion fühlt sich ziemlich doof/langweilig an.\n-Gewisser Glücksfaktor, durch Karten- und Plättchenauslage gibt es noch (in einer Partie lagen fast immer nur Zahnräd-Plättchen aus)\n-Das Rennen auf die Artefakte. Das sorgt zwar für Interaktion und Spannung. Aber auch für das Gefühl \"endlich läuft das was ich mir aufgebaut habe super und nun soll es schon wieder vorbei sein? Schade.\"\n-Der Motor meines Volkes, der sich so cool verbessern lässt (und insgesamt ziemlich aufgeplustert ist), bietet \"nur\" Blitzaktionen (und Punkte ( =noch langweiliger ;-) )).\n\nGrundsätzlich hat es Potential richtig gut zu werden. Wiederspielreiz ist definitiv vorhanden, daher gerne nochmal. Bevorzugt mit Kampagne, um endlich das komplette Spiel kennen zu lernen.\n\nNachtrag; Spiel mit allen Kampagnenmodulen:\nIch glaube ich bin froh, die Kampagne nicht selbst gespielt zu haben und nur alle Regeln mit hinzugefügt zu haben. Ich habe darüber eher negatives gehört, besser gesagt Enttäuschung.\nZusammengefasst sind die Module minimale Änderungen und die erzählte Geschichte wohl eher reizlos\nAber das Endergebnis mit allen Modulen lässt sich sehen. In den meisten Fällen ist es mehr Varianz vorhanden. (Bspw. bei den Rand-Punkt-Plättchen, Karten oder 2. Fähigkeit zum Hebel). Durch drafting und mehr Völkerasymetrie aber auch mehr Abwechslung in der Spielweise.",
    "timestamp": 1762383600
  },
  {
    "username": "Kayne02",
    "rating": 8.0,
    "comment": "A trilha de máquinas é tão legal... Mas o lago congelado e as cartas de cidadão são tão merdas...\nFora que comprei porque tinha um Cthulhu gigante na lateral da caixa e não tem absolutamente nada de horror cósmico no jogo.",
    "timestamp": 1762297200
  },
  {
    "username": "Jonnyrico74",
    "rating": 8.0,
    "comment": "1.11. bei enne",
    "timestamp": 1761951600
  },
  {
    "username": "jrubin1",
    "rating": 8.5,
    "comment": "Another excellent game from Aporta and these designers. Loved Santa Maria and The Magnificent so had high hopes for this one. Wasn't quite convinced until after our second game - just like the previous two I mentioned, it is never punishing, always giving you some rewards on your turn. But what it does best (like with the others) is rewards you more for squeezing out just that much more from each of your turns - finding neat ways to do things faster than opponents. A little more complex than these other two for sure but totally fun.",
    "timestamp": 1762580700
  },
  {
    "username": "Sinoc",
    "rating": 9.0,
    "comment": "Good level of difficulty for me. Nice map, nice design, with good choices to do.",
    "timestamp": 1761865200
  },
  {
    "username": "FoxRageQc",
    "rating": 9.0,
    "comment": "K Played",
    "timestamp": 1761692400
  },
  {
    "username": "TwelveYou",
    "rating": 9.0,
    "comment": "I think if the game used meeples in other forms, different from the classic ones like in Carcassonne, it would be much more atmospheric. For example, the buildings and the crow are very good.",
    "timestamp": 1761692400
  },
  {
    "username": "BionicBeaver",
    "rating": 10.0,
    "comment": "This game blows me away. I love the asymmetry, exploration, and theme. Plays well with 2+.",
    "timestamp": 1762210800
  },
  {
    "username": "yaenz",
    "rating": 10.0,
    "comment": "Revive is a close to perfect culmination of things i find just plainly fun. The unique and rewarding mechanics alone would make me love it. Revive's table presence, pacing, and the everchanging asymmetries of every game however make this a 10/10 for me.",
    "timestamp": 1761429600
  },
  {
    "username": "crisfmartinelli",
    "rating": 10.0,
    "comment": "I thought it was an incredible game. Many people say it has too many things or too many mechanics, but I didn't think so. I found it very simple to explain and understand, and very easy to strategize. It's not too tight or too loose, I think it's just right because you have access to resources, but not excessively so. So you do what you can with what you have and figure out how to get that resource to build that thing... and so on.",
    "timestamp": 1759356000
  },
  {
    "username": "Derianhorgen",
    "rating": 10.0,
    "comment": "SpielboxRating 7-9, av. 7,83",
    "timestamp": 1758751200
  }
]