[
  {
    "username": "VultR",
    "rating": 1.0,
    "comment": "If you played Zombicide, it's like Zombicide Zombies are controlled by a DM, the Zombies are actually Imperials, and the rest of the players fight the DM's horde of Imperial units. Like Zombicide the Rebel Alliance have Zombivores.\n\n\nCampaign vs Skimish Mode, miniatures, unlock characters throughout journey, has scenarios,\n\nLike Journey’s of Middle Earth (cards) but this is a dice game.\n\nPrice: $116.04",
    "timestamp": 1708297200
  },
  {
    "username": "vinayplusj",
    "rating": 1.0,
    "comment": "To fully enjoy the game and access a wide range of characters and missions, you're required to invest in numerous expansions.The components, including miniatures and cards, are underwhelming in quality given the game's price point.",
    "timestamp": 1697148000
  },
  {
    "username": "Suzyanna48",
    "rating": 1.0,
    "comment": "I'm here to berate the designer of this game. I haven't even played the game, and it's already driving me to tears and making me want to flip the table! Who designed the pieces? Who? Why is the AT ST walker such a pain the the butt to assemble. 0 stars for that junk. At this point it'll be a gun- less figurine!",
    "timestamp": 1683237600
  },
  {
    "username": "HarVeeGee",
    "rating": 1.0,
    "comment": "If you like spending more time reading the rules and setting up your game than actually playing, spending more time waiting for other people to have their turn (including even more downtime combing though the rulebooks for more rules and box for more components) than actually doing anything when you actually play, not actually having any real decisions to make when it's your turn, and feeling yourself like your friends less as people just due to the sheer impact of the negativity everyone will be feeling while \"playing\"... this might be the game for you!\n\nAn absolute testament to the flaws of BGG's 'all time' list and rating system in general: there's so much 'more stuff = better game' bias.\n\nIf you have more fun playing this than something like Sheriff of Nottingham, your brain is broken.",
    "timestamp": 1641769200
  },
  {
    "username": "cgarvie",
    "rating": 1.0,
    "comment": "Christmas 2020 2nd hand about 40\n\nIt doesnt feel balanced to me, Imperials all over us, and then the gap widens with them getting more points.\n\neven when you think youve got a chance the pull out something unknown and unexpected.\n\nMission six rebels lost again and no idea how they can win just cat see it, Imperials had so many troops. Quickly losing interest in this. Which is a shame as it could be very good\n\n\nthis could be really good but 3 more missions in(as neil enjoys) but cant see what we're doing wrong and yet still lose\n\nive grown to LOATH this game, every time it quickly becomes pointless as we're clearly out gunned, last game within 2 or 3rd round 2 of us were wounded meaning the rest of game was just trying to stop anyone else being wounded ornits all over",
    "timestamp": 1634853600
  },
  {
    "username": "Rustere",
    "rating": 1.0,
    "comment": "It gets a 1, cuz officers shouldnt be able to command Wampas.",
    "timestamp": 1525989600
  },
  {
    "username": "Scott85",
    "rating": 1.0,
    "comment": "Don't get why people love this game. The rulebook alone is just painful. Only strategy I can figure out is roll dice well...",
    "timestamp": 1515366000
  },
  {
    "username": "beset",
    "rating": 1.0,
    "comment": "Worst game in existence. There is not a single game rule in this game, that is well thought out or balanced out. The game is heavily one sided by design, which means half of the game content is there for the sole purpose of inflating the price, without any prior notification of it being so. The money would be better spent burning, that at least warms you for a couple of seconds, this game gives you nothing",
    "timestamp": 1487631600
  },
  {
    "username": "holdenkim",
    "rating": 1.0,
    "comment": "Just roll a D6 at the beginning of the game to see who wins the campaign, and then go play Scythe instead.",
    "timestamp": 1472421600
  },
  {
    "username": "Yelish",
    "rating": 1.0,
    "comment": "Just the same as Descent, poor game.",
    "timestamp": 1470520800
  },
  {
    "username": "GodHand",
    "rating": 1.0,
    "comment": "As a generic sci-fi skirmish game i would give it a solid 7, but FFG is using it as a way to suck the dollars of the Star Wars zealots who tosh money at whatever has the SW logo printed on it. If you don't believe me, consider this: with the base box they only sell you half the game, you have to spend 80 aditional bucks for minis that are should be there, but there's only a cheap carboard token. It's the DLC of boargames, and that is unnacceptable.\n\nAlso, I can't believe over 1200 people gave this a 10 just because it's Star Wars, as much as I love the original films.",
    "timestamp": 1451862000
  },
  {
    "username": "leleyx",
    "rating": 2.0,
    "comment": "I have not enjoyed the little bit of solo time I had on this, might be a little better with 2+ players, but generally I'm not that into this kind of tactical combat, and the set up/break down is WAY to finicky for my taste.",
    "timestamp": 1741734000
  },
  {
    "username": "lpcheng",
    "rating": 2.0,
    "comment": "I have played 4 games so far in the Heart of the Empire campaign as one of 4 characters (3 people where one person takes 2 characters each scenario). I really had high hopes that I would like this game. I love the IP, and absolutely think Star Wars Rebellion is a fantastic game. So to be able to play a campaign game as rebel characters fighting though a \"dungeon crawler\" to accomplish missions seemed like an amazing experience to be had. Alas, I am so disappointed! This game is so heavily weighted in favor of the Imperial player that each scenario we Rebels are all just about killed off or have met the losing criteria by the halfway point in each scenario. And we are all fairly seasoned gamers, so it's not like we aren't familiar with the concept of action-economy, complementary abilities, buffs, etc. The Imperial Player has the advantage of knowing the map with all the tricks and traps, gets hordes of reinforcements each turn to replace the stormtroopers at a ratio of 2 to 1 it seems when/if we actually take a couple down at the start of each round, and then has some card abilities that pretty much take us out in one shot. Plus, he gets multiple dice re-rolls when at best we rebels may get 1. And then, despite all the tight action-economy and doing all you can to carefully plan your strategy each round, it all gets undone by some lousy dice rolls. Don't get me wrong, dice are not inherently a bad mechanism. But if the action economy is already super tight such that you have to be as efficient as possible to even have a 10% chance of accomplishing the mission (and I would argue 10% is generous in this game for the Rebels), then it seems majorly unfair to also be subjected to an unbalanced dice distribution where the Imperial Player's dice seem to have more ability to block your attacks than the Rebel players' dice do. Obviously there are lots of people who love this game. This is not a game for me. I do love thematic games, even those with luck (ie. Rebellion, War of the Ring 2nd Ed, Nemesis, Dead of Winter to name a few), but this is one game that I will take a hard pass on after we finish this God-forsaken campaign!",
    "timestamp": 1716328800
  },
  {
    "username": "Soupinator",
    "rating": 2.0,
    "comment": "So poorly balanced it's not even remotely funny. The empire player will win unless they are completely and utterly incompetent or have legendarily poor luck with dice. This is the only game I've ever played that has gotten people to express anger at the table.",
    "timestamp": 1623535200
  },
  {
    "username": "DungeonDom",
    "rating": 2.0,
    "comment": "I enjoy complicated games but playing and learning was a slog. I think I need to be taught by someone who already knows the rules. I would resell but I took the miniatures out and painted (poorly lol) some of them",
    "timestamp": 1618696800
  },
  {
    "username": "RobbieBoyWonder",
    "rating": 2.0,
    "comment": "Overall a very tedious game. The down time is ridiculous, alongside with the secret rules being unevenly heavily weighted to the Imperial player.\nOther FFG games where it comes down to the last couple of turns you are constantly on a knife edge. This is truly down to the perfect dice roll every time, even then at the end of a round the Imperial Player can just negate everything you do.\nCompared to other campaign games ive played it just isn't that fun",
    "timestamp": 1616108400
  },
  {
    "username": "BattleZone",
    "rating": 2.0,
    "comment": "Game died a miserable death. The inept skirmish mode ruined the flavor of the title, and instead of fixing the game they pawned it off and went with Lord of the Rings which is quickly becoming one of the few licenses FFG can hold onto. Even legions has been cast off to Atomic Mass Games which makes garbage",
    "timestamp": 1612652400
  },
  {
    "username": "macrsson",
    "rating": 2.0,
    "comment": "Nice outfit of a dull game. I don´t like a combat where you will miss an enemy standing next to you with several shots from a laser gun. That is stupid and annoying.",
    "timestamp": 1568844000
  },
  {
    "username": "eracerandy",
    "rating": 2.0,
    "comment": "Felt way too hard, the rules are too complex and too much minutiae to keep track of",
    "timestamp": 1566856800
  },
  {
    "username": "vikings40",
    "rating": 2.0,
    "comment": "It is like a really bad joke...",
    "timestamp": 1547074800
  },
  {
    "username": "Ptaco",
    "rating": 2.0,
    "comment": "Balance is a serious problem with this game.",
    "timestamp": 1516662000
  },
  {
    "username": "KSchultz",
    "rating": 2.0,
    "comment": "Boring as heck...",
    "timestamp": 1490396400
  },
  {
    "username": "Grobbs",
    "rating": 3.0,
    "comment": "Includes Hoth expansion\n\nSell price: $100",
    "timestamp": 1735254000
  },
  {
    "username": "AlexFS",
    "rating": 3.0,
    "comment": "2018/09/17 - 9 plays at 3-4p\n\nThe game has great minis and components in general.\n\nI played the base campaign, and became gradually disillusioned with the game, because of an increasing imbalance between the Empire and the Rebellion. The four last plays were smashing defeats for the Rebellion, which was boring for everyone.\n\nIn the end we did not even play the final scenario, even though it was the only one remaining to finish the campaign.\n\nAnother problem was rules fiddlyness. Even after 9 plays we were still checking edge cases, slowing down the pace of the game.\n\nIt seems the skirmish mode is really good, and there also a cooperative mode available with an app, but I did not try any of those play modes.",
    "timestamp": 1713736800
  },
  {
    "username": "dierenh",
    "rating": 3.0,
    "comment": "Engelse regels in originele opmaak",
    "timestamp": 1654120800
  },
  {
    "username": "Maxplanck12",
    "rating": 3.0,
    "comment": "The widespread love of this system is surprising to me, considering the fact that there are aspects of the ruleset that make absolutely no sense, thematically, and can't help but break the immersion as players try to wrap their heads around them. Even as a rabid Star Wars fanatic, this one did absolutely nothing for me.",
    "timestamp": 1632520800
  },
  {
    "username": "Narlgoth",
    "rating": 3.0,
    "comment": "Imperial Assault is a pretty awful and vastly over hyped re-skin of Descent 2nd Edition. Sure its chromed to hell with a big grey AT-ST miniature in the box, but in terms of substance its just as awkward and shallow as D2nd. Being Star Wars themed doesn't make it any better!\n\nJust as in D2nd they've killed all the decision making, fun and depth in the process of making a 'faster, scenario driven' game. The timed nature of many scenarios forces both sides hands tactically. You have to play cheesy tactics like blocking and stalling to win, or in the case of Rebels running away so the enemies can't touch you, both of which are frustrating to do and frustrating to have done to you. This rubbish makes every game feel like a soul destroying optimization puzzle, not a entertaining semi-coop game.\n\nMost scenarios are totally unbalanced in favour of one side or the other.\n\nHeroes also overdevelop into obnoxiously over complex piles of skill spaghetti ('Oh I rolled 2 hits and a surge, I'm going to use this skill to add a surge and gain focus, which in turn allows me to use my chazwaser ability to add Pierce 3 and move three spaces, I've then got within three range of a different target so I'm going to shoot them too using a special shot where I can deal damage equal to range but only if I'm stood next to another Hero in which case you can't see me to shoot me back and I deal you 9 damage pierce 3 with bleed, cleave 1 and stun'). Often Imperial player's units are essentially dead in one hit unless they get lucky and roll an evade!\n\nAs the Imperial/Overlord you're also significantly nerfed, with no real customization options. You have no event/keeper deck to build, no threat management (spawning points don't count), leaving you with few effective choices. After a point there is also little to spend experience on, as only a handful of cards will have a use depending upon your opponents. Influence cards are so hard to buy and their effects so circumstantial and weak they are hardly worth a glance a lot of the time.\n\nAll in all I just hate this game. It makes me feel miserable, bored and unhappy, regardless of which side I play on. Its as fun as throwing yourself off a building so that you land testicles first on a railing.\n\nMy favourite moment in the whole game was when the heroes lost the campaign and they were hanged on gallows like 1700s sheep rustlers. I laughed, laughed like Jack Nicholson Joker when he looks in the mirror.\n\nThe 3 is totally justified.",
    "timestamp": 1628114400
  },
  {
    "username": "awiesendanger",
    "rating": 3.0,
    "comment": "Tried multiple times. Just feel like each scenario is badly balanced, to easy for one side or the other. I get the idea of keeping long game in mind, but each scenario should be fun, not a blowout. Maybe the app is better...",
    "timestamp": 1617660000
  },
  {
    "username": "stvnritch",
    "rating": 3.0,
    "comment": "I don't know what it is about Star Wars board games but for me they mostly all fall flat. I had super high hopes for this and maybe that's why i didnt enjoy it as much as I hoped I would, I just don't like a lot of Star Wars board games.",
    "timestamp": 1605740400
  },
  {
    "username": "balticsea",
    "rating": 3.0,
    "comment": "Way too complicated and boring..., and this trivial usage of character types is one of the reason why Star Wars was ruined, esp. from Disney...",
    "timestamp": 1604444400
  },
  {
    "username": "Sh0rtz",
    "rating": 3.0,
    "comment": "I have never been more disappointed by a board game. Playing Mansions of Madness before, I was expecting more than a shoot-out. However, it does not really have more strategy to it than shooting and running.",
    "timestamp": 1595973600
  },
  {
    "username": "Nikator",
    "rating": 3.0,
    "comment": "Great game regarding rules and components, but...\nCampaign Game: The secrecy regarding mission information vs. heroes is ridiculous. Absolutely game changing if you ever played before (and thus know) the mission details, i have never encountered such effects with Descent.\n\n***** Update *****\nCampaign Game: The \"surprises\" for the rebels are a laughing stock. More important then intelligent play is the correct bet how the mission might be designed. Will switch to overlord role as i'm no longer willing to waste my time with playing heroes and the gaming group wants to continue playing IA.\n\n***** Update *****\nQuit playing for Descent 2nd Edition. In Descent it might be also surprising how a scenario unfolds and of cause for such a complex game not every scenario or even campaign can be designed balanced, but scenario information is \"rules-wise\" open to all players.",
    "timestamp": 1577401200
  },
  {
    "username": "rseater",
    "rating": 3.0,
    "comment": "I'm impressed. This is way better than its Descent roots predict. Damage is high -- this is not a war of attrition. There are actual choices, not just obvious maneuvering. There is good unit variety. The custom dice do a good job at providing different characteristics to weapons without much rules overhead.\n\nI think this is really a 2 player game. As the rebel player, I'm happy controlling 4 characters. Just 2 would be a bit boring, and just 1 would be tedious.\n\nupdate: I like the tactical game 2 player. With more, player elimination is terrible. The campaign has snowballing. The two are a terrible combination, since the imperial player often faces the choice of eliminating someone early (20 minutes into a 2 hour game) or playing poorly, not only risking losing this game but possibly all future games because of the cascading effects. Unacceptable.\n\nupdate: as an RPG, where the imperial player can cheat but is guided to make the game tense (not to try to win), the game is quite fun. Just don't accidentally play it by the printed rules.\n\nas printed, 5 player: 3/10\nas printed, 2 player: 6/10\nas an RPG, 5 player: 7/10",
    "timestamp": 1571349600
  },
  {
    "username": "Gurkvatten",
    "rating": 4.0,
    "comment": "Nobody liked playing as empire. Would be willing to revisit with the right group",
    "timestamp": 1754776800
  },
  {
    "username": "latschediwes",
    "rating": 4.0,
    "comment": "Pending",
    "timestamp": 1744495200
  },
  {
    "username": "Jrb259",
    "rating": 4.0,
    "comment": "Imperial Assault is a dungeon crawler, but with a Star Wars theme. Is the IP enough to make this feel different or exciting?\n\nUnfortunately for me, I do not feel much enthusiasm for the game even though I love the Star Wars universe. I was hoping this would be a great romp, but unfortunately, move and roll dice to attack just doesn’t do it for me. I feel like I am doing the exact same things every turn.\n\nThere is very little dice mitigation in this one. If you have one bad roll, then you may be toast. I struggle with dice battling games in general because they feel so unpredictable and can have such swingy results.\n\nCompare that to Gloomhaven, where you can get items, do different attacks, and guarantee damage based on cards that you play. Each turn feels different because you are managing a deck. You have items that allow for one-offs. You can remove negative cards from your deck. I feel a greater sense of control in Gloomhaven which is why I appreciate that property more than Imperial Assault.\n\nI have only played two missions where my entire experience was dependent on getting a certain roll. In fact, I only had 3.75% probability of not winning the second one. Sure enough, I rolled the wrong thing and lost. This is a memorably painful experience, and a great one for the other player, but can really dampen enthusiasm after a two hour experience comes down to that.\n\nBGG stats on balance of the campaign seems to show it's incredibly lopsided in favor of the Imperial player. Maybe there are better scenarios out there. I’ll likely try one or two more scenarios, but starting to wain early in enthusiasm for this one.\n\nAs we continued to play scenarios, again and again we had turns where a dice roll went awry. Or, we had some modifier that changed something completely, adding strain or damage.\n\nLast gripe, but it's a big one with many fantasy flight properties and Corey Konieczka in particular: when every round I have to ruin the game flow to consult a bgg forum or to look up something in a reference rulebook that was not clear in the main rulebook, then your instruction guides have issues. In every campaign scenario we played, something was always unclear on the main instructions. I found answers buried in the \"encyclopedia\" reference rulebook, or online, or not at all and we just decided to move on. This is maddening to what already feels like a frustrating experience with unsatisfying dice rolls.\n\nMaybe I would be willing to give this another chance with more balanced scenarios or some new expansion property, but I can think of other properties I'd rather be playing.",
    "timestamp": 1740265200
  },
  {
    "username": "SocialJusticePaladin",
    "rating": 4.0,
    "comment": "Way too fiddly for what it is.",
    "timestamp": 1736204400
  },
  {
    "username": "juleshawthorne",
    "rating": 4.0,
    "comment": "As an AFAB fan from the 90s, it was absolutely indicative of the standard Star Wars experience that everything was so absurdly gendered. It genuinely felt gendered to the point of distraction and frustration. Even when portraying female characters, the base presumption was that the actual player was male. Such an alienating experience and not how I prefer my Star Wars. No thank you.",
    "timestamp": 1720562400
  },
  {
    "username": "Kodeir",
    "rating": 4.0,
    "comment": "This is the prime example of what I do *not* want of a board game: tons of components, which translates into excruciating set-up times and even more bookkeeping. You spend almost as much time doing chores than actually playing. Also, the so-called \"narrative\" comes from someone reading a rulebook out loud, and has close to no emergent narrative whatsoever.\n\nIf this were a digital game, it could be played in ten minutes due to the lack of set up and bookkeeping. All that said, if you are a Star Wars fan and don't mind the downtime, do give it a try.\n\nRating: \n\nFor more information on how I rate games, go to my profile",
    "timestamp": 1709334000
  },
  {
    "username": "Yuri",
    "rating": 4.0,
    "comment": "(sold)\n6/10 with several house-rules and adjusted unit costs",
    "timestamp": 1697148000
  },
  {
    "username": "lebryant",
    "rating": 4.0,
    "comment": "First two missions of the campain were kinda \"fun\", or at least OK to bare for those several hours spent. But when I realised that the full campaign (side missions included) is literaly the same roll-move-roll game, it made me regret all the time I've invested into it. Never, ever again anything like that. It's just a pointles waste of time.\n\nI did finish the campain though, since I didn't really want to let my group down.\n\n---\nlebryant's TOP games of all time\n---\n[2022]: 239/294 (top 81%) | Rating - 3 | Overall Plays - 12\n[2021]: 240/288 (top 83%) | Rating - 3 | Overall Plays - 12\n[2019]: 211/256 (top 83%) | Rating - 3 | Overall Plays - 12\n[2018]: 166/208 (top 80%) | Rating - 3 | Overall Plays - 12",
    "timestamp": 1689112800
  },
  {
    "username": "jellologin",
    "rating": 4.0,
    "comment": "Played a few times. Box and all components in very good condition.",
    "timestamp": 1686866400
  },
  {
    "username": "Victoria_hermit",
    "rating": 4.0,
    "comment": "Star Wars plus Descent faux role-play fighting board game with bizarre dice iconography.",
    "timestamp": 1667689200
  },
  {
    "username": "anim8r",
    "rating": 4.0,
    "comment": "Gorgeous, could be interesting but not my type.",
    "timestamp": 1656280800
  },
  {
    "username": "quietcorn",
    "rating": 5.0,
    "comment": "The Star Wars theme is fine, but I honestly like the Descent Fantasy theme more. Regardless, the minis are nice, the levels are well designed, the changes to the rules drastically improve the game system over it's mechanical predecessor, Descent 2nd edition. The huge improvements include having players take turns between monster activations, moving the miss result onto the defense die that the lighter armored characters roll, as opposed to having it on the attack die, and in general, the theme fits the timed-style maps much better than a Dungeon Crawl setting does. That being said, my playgroup took issue with the timed missions aspect of things. For them, this game needed to be more of a monster-masher for them to enjoy it. Pity.",
    "timestamp": 1762297200
  },
  {
    "username": "kilianbognar",
    "rating": 5.0,
    "comment": "Probe droids are not kamikaze battle units. Doom is the best iteration of this system, and I don't really want to play that either.",
    "timestamp": 1748556000
  },
  {
    "username": "Aruwen",
    "rating": 5.0,
    "comment": "based on first playthrough. Had an epic session with plenty of star wars feeling with the smuggler using quickdraw in two consecutive rounds while retreating wounded to prevent the imperials from winning.\n\nWill update soon when we played a couple times. Will be a long 2 days wait",
    "timestamp": 1745272800
  },
  {
    "username": "DaddyLudo",
    "rating": 5.0,
    "comment": "The theme, minis, components and stats are cool and interesting, but i found the game to be just a repetitive aim, roll and pray for good luck on the dice, and lacking any interesting decision-making. Why not have fewer, but stronger enemies, instead of scores and scores of new enemies pouring in, making the game feels like a chore, like mowing the lawn, with the grass on the beginning always grown out, right when you thought it was job done.",
    "timestamp": 1744668000
  },
  {
    "username": "I_made_a_username",
    "rating": 5.0,
    "comment": "Pros: cool dice-based system, because each color of die has different roll possibilities it makes characters who use them feel more aggressive or reliable (thus making gameplay unified with theme), the free app includes a solo campaign that is pretty nice (albeit with some difficulty spikes), the back-and-forth formal campaign is a big and epic saga, the minis are nice, characters dutifully represent various star wars archetypes (bounty hunter, jedi, wookie, etc.) and play differently, neat many vs. one structure that works pretty well here.\n\nCons: some components are fiddly (finding similarly colored map tiles in particular), requires a dedicated play group and benefits from having the same members play each time (i.e., not substituting players).",
    "timestamp": 1741561200
  },
  {
    "username": "Masterblocker",
    "rating": 5.0,
    "comment": "Just a priorization number no actual rating",
    "timestamp": 1736636400
  },
  {
    "username": "Fravoc",
    "rating": 5.0,
    "comment": "*The set up time is absolutely ridiculous with all the puzzle pieces and various sizes, decks\n*Needs a game master that absolutely does the prep work and sets things up in advance or sorts things well, because otherwise it will be unbearable. It's on D&D level when you are new to it.\n*Dice chucker with fairly straight forward battling\n*The minis are quite nice and fun when painted",
    "timestamp": 1730242800
  },
  {
    "username": "shaveandahaircut",
    "rating": 5.0,
    "comment": "[1 play] I didn't love Descent, but I liked it more than this, despite the Star Wars chrome.\n\nMost recent play Oct '15.",
    "timestamp": 1722808800
  },
  {
    "username": "kiwipaul",
    "rating": 5.0,
    "comment": "enjoyable",
    "timestamp": 1722463200
  },
  {
    "username": "TVDinner",
    "rating": 5.0,
    "comment": "Just didn't hit right. Felt like something else with Star Wars tacked on.",
    "timestamp": 1709938800
  },
  {
    "username": "kaepone",
    "rating": 5.0,
    "comment": "Reminded me a lot of the formula FFG uses for LotR Journeys in Middle Earth and Mansions of Madness, which I'm not a fan of.\n1. Setup is not fun. Sorting through double sided tiles to find the ones in the scenario book and then piecing it all together.\n2. Gameplay felt on rails. The characters felt different, but actions felt really repetitive and the scenario outcome was influenced too much by the dice. If felt cool when you dodged an opponent's attack, but also just lucky.\n3. Theme is good, but you're just backup character #1, 2 or 3, not main characters.",
    "timestamp": 1709247600
  },
  {
    "username": "coryke",
    "rating": 5.0,
    "comment": "Acknowledging that I am not playing by the proper rules, but modified rules so that I can play with my son, it's ok. I just don't feel like I want to learn the proper rules (mostly adding on to what we use) to use those \"official\" rules. It's just ok to me. (By the modified / simplified rules we use.)\n\nAlso have: Chewbacca, General Weiss, Han Solo, IG-88, Rebel Saboteurs, Rebel Troopers, and Royal Guard packs.",
    "timestamp": 1707778800
  },
  {
    "username": "Zenith123138",
    "rating": 5.0,
    "comment": "Blame this guy https://boardgamegeek.com/user/poggydude",
    "timestamp": 1680300000
  },
  {
    "username": "Cantongamer",
    "rating": 5.0,
    "comment": "This game is Gloomhaven ish only a bit lighter. It's fun but I wouldn't call it great. Doing the campaign with two player, two hero is broken. Once the heroes get upgrades they are unstoppable.",
    "timestamp": 1680300000
  },
  {
    "username": "noduh",
    "rating": 5.0,
    "comment": "1-5 players (best 2,5)\n60-120 minutes\nThematic Dungeon Crawl Co-op/1 Vs All\nDice Rolling, Die Icon Resolution, Grid Movement, Line of Sight, Modular Board, Scenario, Variable Player Powers",
    "timestamp": 1676329200
  },
  {
    "username": "Paulermo",
    "rating": 5.0,
    "comment": "Spend to little time learning this, sold it again",
    "timestamp": 1674082800
  },
  {
    "username": "Zondag",
    "rating": 5.0,
    "comment": "The campain has many leaks (one is that the Imperial player is way too strong than the Rebels), but the skirmish is ok.",
    "timestamp": 1673650800
  },
  {
    "username": "icheyne",
    "rating": 5.0,
    "comment": "I'm lukewarm on this game. I don't like the all vs 1 aspect of the game. Our Imperial player played to win and we have lost almost all the scenarios.\nIt's suffered in comparison to the Gloomhaven: Jaws of the Lion campaign which I have played in parallel. The mechanics of Gloomhaven are so much better. More interesting decisions with far fewer rules ambiguities.",
    "timestamp": 1670022000
  },
  {
    "username": "ferion",
    "rating": 5.0,
    "comment": "Played only once, thus rating is only first impression.however, not really eager to try again.",
    "timestamp": 1667080800
  },
  {
    "username": "Lapu",
    "rating": 5.0,
    "comment": "No me gustan los juegos de estas características. Me aburrió. Definitivamente no es mi nicho. Entiendo a quien le pueda gustar. Tiene muy buena producción.",
    "timestamp": 1666735200
  },
  {
    "username": "jodokast4",
    "rating": 5.2,
    "comment": "I love the minis and the strategy aspects of it.",
    "timestamp": 1662847200
  },
  {
    "username": "Guntower_Mike",
    "rating": 5.0,
    "comment": "I ran an entire campaign of this for my friends during the Pandemic. They loved it - but they couldn't see just how often I had to fudge the poorly thought-out rules to make it work.",
    "timestamp": 1660341600
  },
  {
    "username": "Palpatine66",
    "rating": 6.0,
    "comment": "Attempted 2 play throughs with friends",
    "timestamp": 1762210800
  },
  {
    "username": "Cenagal",
    "rating": 6.0,
    "comment": "En campaña, un malo como jugador contra todos, ha quedado muy superado, y la app está muy desfasada en comparación con otras.\nEn 1 vs 1, montar el escenario es un dolor que hace que no te apetezca jugarlo, aunque si obvias esto es muy bueno.",
    "timestamp": 1761429600
  },
  {
    "username": "Termino476",
    "rating": 6.0,
    "comment": "En lo de Azul",
    "timestamp": 1760133600
  },
  {
    "username": "ekko",
    "rating": 6.0,
    "comment": "It was fun for a 2-3 games, but we lost interest after a few games. The campaign just didnt feel that compelling.",
    "timestamp": 1759615200
  },
  {
    "username": "Brucie_Lee",
    "rating": 6.0,
    "comment": "\"Don't Buy This\" Reason: Phil owns this.",
    "timestamp": 1759356000
  },
  {
    "username": "localghost8080",
    "rating": 6.0,
    "comment": "Cool asymmetrical co-op tactics game. Some missions are incredibly unbalanced in favor of one side or the other. The Empire player will have to pull their punches sometimes to create a more satisfying experience. Set up takes too long.",
    "timestamp": 1757455200
  },
  {
    "username": "GeminiWeb",
    "rating": 6.0,
    "comment": "Most plays are for the skirmish game",
    "timestamp": 1754863200
  },
  {
    "username": "Ciffy",
    "rating": 6.0,
    "comment": "Thank you Mandy! For reals...",
    "timestamp": 1752184800
  },
  {
    "username": "Alaena",
    "rating": 6.0,
    "comment": "First impressions:\n1. Tutorial doesn't have a tutorial mission. Idk what is my purpose to do anything - so the game seems pointless. Started watching a how-to video by SUSD.\n2. Lots of little rules:\n-can only activate \"surge\" lightning once per ability per turn\n-can split up movement\n-diagonal is adjacent\n-imperials can only attack once per turn.\n-can take strain up to endurance. Any extra is converted to damage. If at max strain, cannot use ability requiring endurance.\n-when become wounded, remove all damage(?) except endurance.\n\n\nNeed to play regularly to remember rules. Looks like a lot of set up.",
    "timestamp": 1752184800
  },
  {
    "username": "Elysian1196",
    "rating": 6.0,
    "comment": "It's not that I think this is a bad game, as I did have fun playing, the theme was well-realized with not too many minis, and I love tactical xcom style character building. In fact, if there was a better dedicated one-shot like scenario, I think this game could be great.\n\nHowever, personally speaking, this game caps at a 6 for me because I just don't see myself looking to play this much. I wouldn't commit to a campaign like this unless I had a dedicated group, I prefer a more euroy/Gloomhaven combat approach, and I would never consider owning it because I find playing as a Rebel much more fun than playing as the Empire, which would be inevitable if I owned this game. Supposedly there's an app to fix the Dungeon Master issue though, which would be fantastic if it works and could improve my rating if I tried it.",
    "timestamp": 1746136800
  },
  {
    "username": "Lippupalvelu",
    "rating": 6.0,
    "comment": "Coop",
    "timestamp": 1743116400
  },
  {
    "username": "anne_z",
    "rating": 6.3,
    "comment": "This game helped me learn that I'm not that into \"tactical\" games or spending a lot of time thinking about getting into position so I can be in range to hit someone but not in range to get hit.",
    "timestamp": 1742684400
  },
  {
    "username": "Cone Defense",
    "rating": 6.0,
    "comment": "Game definitely shows its age, but I can appreciate the appeal of plowing through the campaign with a friend. I’m not sure I’d have any interest in skirmishes though because so many games do it better now.",
    "timestamp": 1737932400
  },
  {
    "username": "EV2814",
    "rating": 6.0,
    "comment": "2023\nCampaign/Story",
    "timestamp": 1736722800
  },
  {
    "username": "tristandevanthery",
    "rating": 6.0,
    "comment": "Pas mal sans plus",
    "timestamp": 1736463600
  },
  {
    "username": "albcann",
    "rating": 5.5,
    "comment": "Did a lengthy review on this game if interested.\n\nhttps://boardgamegeek.com/thread/1950926/solo-10x10-review-s...",
    "timestamp": 1735772400
  },
  {
    "username": "noplusma39",
    "rating": 6.0,
    "comment": "Needs painted.",
    "timestamp": 1732662000
  },
  {
    "username": "SisyphusX",
    "rating": 6.0,
    "comment": "Sale 2022",
    "timestamp": 1730588400
  },
  {
    "username": "bjsully6",
    "rating": 6.0,
    "comment": "I played this with a friend it is pretty good experience overall. I am not sure I felt immersed in the universe with this one though. This is one of those games with maybe too many expansions that turned me off on it. Game mechanics are solid and solo play with the app is solid.",
    "timestamp": 1730156400
  },
  {
    "username": "Edag",
    "rating": 6.0,
    "comment": "I think as a Dungeon Crawler it has not aged well with how saturated the genre is in 2024.\nAs a rebel your turns are too predictable and quick. Does not give me the decision space or the agency I would want in a game of this scale and \"promise\".\n\nWould not play if the Empire player is slow or prone to Analysis Paralysis, as you're just sitting around waiting for your turn, where you just do 2 simple actions.\n\nWould recommend as a rebel player controlling more than one character/\"hand\" to add depth to your turns and strategy, making it more fun.",
    "timestamp": 1726696800
  },
  {
    "username": "A41685",
    "rating": 6.0,
    "comment": "Really was excited for this one, but had a really hard time getting into it, and now it and one of its expansions sits on my shelf of shame.",
    "timestamp": 1723154400
  },
  {
    "username": "youjon5",
    "rating": 6.0,
    "comment": "Fun, but can be frustrating for both players. Also begins to feel stale during the course of the campaign.\n\nEdit: Solo and co-op modes are actually pretty decent!",
    "timestamp": 1718661600
  },
  {
    "username": "alexmus",
    "rating": 7.0,
    "comment": "Version Française",
    "timestamp": 1762634220
  },
  {
    "username": "ditterio",
    "rating": 7.0,
    "comment": "See Descent 2nd edition",
    "timestamp": 1761692400
  },
  {
    "username": "badassbr",
    "rating": 7.0,
    "comment": "Joguei MUITO quando saiu e gostava demais!\nNo fim, depois de passar pelas campanhas, não voltei a jogar mais e acabei vendendo, ainda assim super recomendado!",
    "timestamp": 1760306400
  },
  {
    "username": "MoMahili",
    "rating": 7.0,
    "comment": "Keep",
    "timestamp": 1759874400
  },
  {
    "username": "gildorn",
    "rating": 7.0,
    "comment": "Traded Quest for El Dorado and Coloretto. Gifted to Stephen.",
    "timestamp": 1757196000
  },
  {
    "username": "tasskaff",
    "rating": 7.0,
    "comment": "A bit high-strung, too-much-cards-with-text gamedesign. Would benefit from more elegance and sleekness. But still awesome !\nStill, FCK ffg for stopping german production years ago, too soon",
    "timestamp": 1755122400
  },
  {
    "username": "Weirdsalmon",
    "rating": 6.5,
    "comment": "6.5/10: Dungeon crawler many vs 1 set in the Star Wars universe! First campaign start we played wrong and it was miserable. Tried the skirmish and quite liked it but I think i will enjoy the campaign more.\n\nLooking forward to playing this more and exploring the game mechanics.",
    "timestamp": 1751925600
  },
  {
    "username": "Mikechris16",
    "rating": 7.0,
    "comment": "",
    "timestamp": 1751839200
  },
  {
    "username": "smytty94",
    "rating": 7.0,
    "comment": "complete collection!!!",
    "timestamp": 1751666400
  },
  {
    "username": "Infernotitan2",
    "rating": 7.2,
    "comment": "83",
    "timestamp": 1751234400
  },
  {
    "username": "goyacorl",
    "rating": 7.0,
    "comment": "+Dados extra\n\nOLEADA 1\n+Han Solo\n+Chewbacca\n+Soldados Rebeldes\n+Saboteadores Rebeldes\n+General weiss/AT AT\n+Campeon Guardia Real\n+IG 88\n\nOLEADA 2\n+Sombras Gemelas\n+R2D2 y C3PO\n+Boba Fett\n+Kayn Somos\n\nOLEADA 3\n+Guerreros wookiee\n+Soldados asalto\n+Asesinos a sueldo\n\nOLEADA 4\n+Jinete de Bantha\n+Contrabandista Alianza\n\nOLEADA 5\n+Regreso a Hoth\n+Princesa Leia\n+Soldados Base ECO\n+General Sorin\n+Dengar\n\nOLEADA 7\n+Obi Wan Kenobi\n+El Inquisidor\n+Greedo",
    "timestamp": 1750024800
  },
  {
    "username": "Nuvium",
    "rating": 8.0,
    "comment": "Good in its own way.",
    "timestamp": 1762297200
  },
  {
    "username": "Grimnir",
    "rating": 8.0,
    "comment": "Boardgame / 2-5 players\nKonieczka, Kemppainen, & Ying / Fantasy Flight Games\nAlso own Return to Hoth expansion",
    "timestamp": 1761343200
  },
  {
    "username": "AzuNiTe",
    "rating": 8.0,
    "comment": "Finally got around to playing this game. Although I usually prefer a fantasy theme for dungeon crawlers and was a bit wary of the Star Wars IP, this turned out to be a great success! It didn’t really feel like a typical dungeon crawl, but more like a series of missions that fit together into a cohesive story. It’s also a clear improvement on the Descent system.\nThe miss die has been removed from the attacker’s pool and instead added to the defender’s roll — a small change, but definitely an improvement. The updated line of sight rules are a real gift and put an end to so many debates.\nPlaying as the Imperial side was much more fun than acting as a traditional DM. The class decks, agenda decks, and threat system were all excellent additions.\nAnd, surprisingly, our group connected with this game even more than with a typical fantasy setting. Seeing Han Solo in the cantina or facing off against Tusken Raiders sparked so many fun references to the films — it really brought the experience to life!",
    "timestamp": 1761256800
  },
  {
    "username": "Micpi",
    "rating": 7.5,
    "comment": "in Gtbg",
    "timestamp": 1761170400
  },
  {
    "username": "DiceOnTheFloorAgain",
    "rating": 8.0,
    "comment": "Took me a while to get into this. It can be quite fiddly to setup and continually reading all the cards that you have assigned to the characters can be tiresome. However once you get into the flow of the game, it is not difficult to play and it's a great adventure. Playing with the Legends of the Alliance app in solo mode is fantastic and a great way to play campaign mode.\nIf you love Star Wars, then this is a no-brainer, the variety of characters to play and the multitude of upgrades and mods that can be applied means great replayability.\nThe main negative is the cost to expand your collection, you would think Fantasy Flight could have introduced multi-packs where you can at least purchase multiple figures at once at a cheaper price, rather than having to buy them individually.",
    "timestamp": 1760997600
  },
  {
    "username": "SammySnijbonen",
    "rating": 8.0,
    "comment": "A two-for-one of enjoyable games. The Campaign is a fun Star Wars game, and Skirmish is a true sandbox in which fans can play out the free-for-all fan fiction fights from their dreams.\n\n Nice miniatures, a pleasure for painters.\n\n A double rulebook system: Learn to Play + Rules Reference Guide. This wouldn't work well with many other games, but it does in this FFG title. It reminds me a bit of the video game approach, where more gameplay abilities are unlocked as the game's storyline progresses. Here you start playing after reading through the Learn to Play booklet, and when you encounter a situation that isn't covered there, you look it up in the Rules Reference Guide. The latter comes with a useful index and a good cross-reference system between related items. But as a rulebook in itself, it's a mess. It's a bit of a nuisance to read it as is. And if you don't encounter the situations that prompt you to look up a rule in there, it's possible that you'll be playing without an essential (albeit often small) rule unwittingly...\n\n----\n\n So. Many. Expansions. It's a double-edged knife. Granted, you're not obliged to buy any expansions. You can use tokens, and the stat cards are provided in the game (and campaign expansion boxes). But you'll want them, 'cause you're a Star Wars fan. But then you'll have the luxury problem of finding storage for all those miniatures (especially if you paint them), cards, and tokens. And the choices: what card decks will I use in my campaign?\nWhich figures? For Skirmish, it's a lot of fun to be able to build a wide variety of teams, of course.\n\n I find Campaign games to be a tad 'bittersweet'. Playing as a campaign adds an extra dimension to the gameplay of any game. Your sessions feel like part of a greater whole; your actions are steps towards something beyond the current scenario. But it adds more 'scheduling' to your free time. The schedules of a campaign group need to align, and that's not something that's easily doable for some people. I have started multiple campaigns, but haven't seen even one of them all the way through to the end... And story-wise, the patchwork of story missions and side missions often provides a narrative that doesn't make all that much sense. Though I must add that each mission on its own really does feel like Star Wars.\n\nAlso includes:\n- Chewbacca Ally Pack\n- General Weiss Villain Pack\n- Han Solo Ally Pack\n- IG-88 Villain Pack\n- Rebel Saboteurs Ally Pack\n- Rebel Troopers Ally Pack\n- Royal Guard Champion Villain Pack\n\nPainted the miniatures?: Yes, this set is done.\n\nSleeved",
    "timestamp": 1759701600
  },
  {
    "username": "bnoterman",
    "rating": 8.2,
    "comment": "30",
    "timestamp": 1757887200
  },
  {
    "username": "Identitycrisis1917",
    "rating": 8.0,
    "comment": "Cooperative",
    "timestamp": 1756936800
  },
  {
    "username": "theryanstorm",
    "rating": 8.0,
    "comment": "BETTA\nAll miniatures painted with 3D printed items, in projector case with plastic organizers",
    "timestamp": 1756764000
  },
  {
    "username": "kennethjoel",
    "rating": 8.0,
    "comment": "Campaigns: 1\nSolo Games: 6\nBase Games: 3\nLOTA Games: 6",
    "timestamp": 1756764000
  },
  {
    "username": "skmac",
    "rating": 8.0,
    "comment": "Descent re-skinned with Star Wars and that isn't a bad thing. Without the coop app, which is great, this would drop to an 8.",
    "timestamp": 1756245600
  },
  {
    "username": "GomJabbar",
    "rating": 8.7,
    "comment": "My Rank: 27",
    "timestamp": 1762470000
  },
  {
    "username": "EvolvingMonkey",
    "rating": 9.0,
    "comment": "1-5 players\n2 or 5 are the sweet spots apparently",
    "timestamp": 1762470000
  },
  {
    "username": "CGGGaming",
    "rating": 9.0,
    "comment": "(solo play)\n\nGreat dungeon crawler with a fun campaign in which the characters are able to take several progression paths.\n\nSolo playable with the Imperial Commander 2 community app or official co-op app. Imperial Commander 2 enables the player to play the core box campaign without an additional player and it is possible to do some bookkeeping in the app (enemy squad tracking and deployment cards).\n\nUnfortunately out of print and the translated expansions are heavily overpriced.\n\nSetup time can be painful, because of searching all the different tiles.\n\n(Negatives: setup time)",
    "timestamp": 1762297200
  },
  {
    "username": "Strajder",
    "rating": 9.0,
    "comment": "Better mechanics than in Descent 2nd edition.\nGreat components and miniatures.",
    "timestamp": 1761606000
  },
  {
    "username": "nhmc",
    "rating": 9.0,
    "comment": "A lot of fun for start wars fans, especially if you like painting the miniatures. Gets a bit fiddly with all the upgrades and items, however. The combat is less elegant than Gloomhaven but I think I still like this dice-chucking better.",
    "timestamp": 1758405600
  },
  {
    "username": "Lacrasher",
    "rating": 9.0,
    "comment": "A very thematoc and beautifully crafted Star Wars strategic board game. It oooks fonplicated butbis actually eady to learn. It does overwhelming amd it certainly isnt for everyone. But if you enjoy Star Wars this is a must have. The material id beautiful and the campaign really good. Then there are small matches where you can build an army and olay against esch other. I am sure many people just buy it for this alone. It feels like a tabletop but without measuring with a laser pointer. It is a sweet spot between being for strategists and just ordinary people who enjoy using their brsins once. It sounds odd but that is my experience. Super nerds I know love this, willing to spend hundreds of dollars on expansions. And I also know oeoole who at best play drinking games and then start to strategize about Imperial Assault and you feel like, how did that happen?\n\nStar Wars and Pew Pew, mixed with role-playing and dungeon crawling, hell yes.",
    "timestamp": 1757455200
  },
  {
    "username": "DocGerbil",
    "rating": 9.0,
    "comment": "One of my gaming group's favorite games!",
    "timestamp": 1756850400
  },
  {
    "username": "gabcy",
    "rating": 9.0,
    "comment": "EN",
    "timestamp": 1756764000
  },
  {
    "username": "playfutbol2",
    "rating": 9.0,
    "comment": "Includes:\n- Heart of the Empire\n- Jabba's Realm\n- Return to Hoth\n- The Bespin Gambit\n- Twin Shadows\n- Tyrants of Lothal\n- All character packs\n- 3D-printed insert",
    "timestamp": 1755036000
  },
  {
    "username": "ThirdStringHero",
    "rating": 9.0,
    "comment": "2/5",
    "timestamp": 1754085600
  },
  {
    "username": "avengernk",
    "rating": 9.0,
    "comment": "kika",
    "timestamp": 1753826400
  },
  {
    "username": "gatchaman",
    "rating": 10.0,
    "comment": "Possibly the greatest solo game of all time. (Marvel Champions is probably #1.) Everything is so awesome. Star Wars theme is great, the solo Imperial Commander 2 is fabulous, the official solo is fabulous.",
    "timestamp": 1761606000
  },
  {
    "username": "Frankidinapoli",
    "rating": 10.0,
    "comment": "Solo",
    "timestamp": 1760220000
  },
  {
    "username": "GusiX",
    "rating": 9.7,
    "comment": "- Base - SWI01ES -",
    "timestamp": 1759528800
  },
  {
    "username": "VODK",
    "rating": 10.0,
    "comment": "El DC perdecto",
    "timestamp": 1758751200
  },
  {
    "username": "TherealDestructor",
    "rating": 10.0,
    "comment": "I own every expansion and most of the playmats. I've been to multiple tournaments and played basically everything. IA absolutely has its faults: Skirmish can go on a little long, is very difficult to balance, and can be clunky to understand the proper technique for; Campaign is unbalanced, some missions feel a bit samey, and the rules are sometimes confusing and pointless; Co-op is lacking in content and the app has a few weird rules that are difficult to remember. However, the theme is incredible, the core rules are very tightly designed, it's easy to teach, very difficult to master, and most of all, there's something for everyone here. You could buy every expansion and exclusively play campaign and still get your money's worth out of this game. You could also never play campaign once and still get your money's worth. At $100 original retail price this game is more than a steal, and every expansion pushed the game forward in a meaningful way. The monetization of these expansions is also extremely buyer friendly as the lowest value boxes are also the least essential. I would recommend Imperial Assault to everyone, unless the theme truly does nothing for you, or you have an extremely low tolerance for clunky rules. This is my favorite game of all time.",
    "timestamp": 1756936800
  },
  {
    "username": "diamondinblue",
    "rating": 9.8,
    "comment": "2022 Jan: 9.0\nImperial Assault captures the Star Wars atmosphere brilliantly. Both official and fan-made applications enable solo play. The game features engaging 'dungeon crawler' and skirmish modes. The production quality is impressive. However, the setup and teardown process, along with the absence of an insert, are drawbacks.\n\n2025 Jul: 9.5\n2025 Aug: 9.75\nIt would be 10, if it would have an insert.",
    "timestamp": 1756591200
  },
  {
    "username": "MikeReb",
    "rating": 9.6,
    "comment": "You totally feel the climate of Star Wars universum. Many of the expansions make this game replayable a lot. Additional software driven expansion as Legends of Alliance or Imperial Commander, add different possibilities (as coop against AI) to play campaign(s). The moment Darth Vader appears on the map and you cannot beat him, but still you need to run away through him to the space ship and take off, makes everybody super engaged and wanted to play more. The moment you get Luke Skywalker as your ally for next two missions, where he not only defend you with his lightsaber but also allows to beat others easier than it would you to do it, makes it more fun and enjoyable.\n\nOne issue is that it is not printed in Polish  which is super sad and makes this game really expensive to acquire.\n\nLots of great mini (or mid size) figures. Fantastic, fantastic game. I love it.",
    "timestamp": 1755640800
  },
  {
    "username": "JEvansOP",
    "rating": 10.0,
    "comment": "Great game, a lot of options and love the various modes of play e.g. 2-5 player campaign, solo campaign (through app or homebrewed variant), and 1 vs 1 Skirmish mode.\n\nEdit: 17/08/2025\nManaged to play a campaign where I was an Imperial Player, and this is certainly bumped up to a 10 for me, cementing it's place in my top 3! Campaign is so great in the IRL, and the Skirmish is great for playing after a campaign, two games in one box + the other App methods of playing.",
    "timestamp": 1755381600
  },
  {
    "username": "metroidprime004",
    "rating": 10.0,
    "comment": "Mainly a campaign player for this game but I love the systems.",
    "timestamp": 1755208800
  },
  {
    "username": "Bradleythebrain",
    "rating": 10.0,
    "comment": "10 for the skirmish mode.\nCampaign more like an 8.",
    "timestamp": 1754344800
  },
  {
    "username": "Posco",
    "rating": 10.0,
    "comment": "CAMPAIGN",
    "timestamp": 1750716000
  }
]