[
  {
    "username": "glutealgeometry",
    "rating": 1.0,
    "comment": "-Another play revealed to me (i'm kinda slow on the uptake sometimes) that one of the options in one of the asymmetrical player powers is 100% poison newbie bait. That's a 100% dealbreaker for me. Dropping my rating to the bottom.\n(earlier) After more plays of each version i dropped this a half star to 7 & raised the original a half star to 8. The worms are great themetically but mechanically the game is better without.\n(earlier) After 1 play i've rated it the same as original DI. That might change, but i'm kinda glad it doesn't make its predecessor totally obsolete, seeing as i grabbed a used copy of the original when Uprising came out, not realizing it was being nudged out. Gotta admit the sandworms seem potentially excitingly swingy once the battles with bigger payoffs show up. Dunno for sure, tho... maybe TOO swingy? First time they were actually used in battle they ended our game suddenly & unexpectedly, maybe kinda too early for everybody's engine-building satisfaction (& inside the nuked shield wall, so at least it was perfectly thematic!) Extra frustrating for me tho, because i'd just given up on waiting for better rewards &shot my military wad on the previous battle, so never stood a chance that round in either phase because i'd also had a lousy draw. No biggie... it happens!",
    "timestamp": 1761519600
  },
  {
    "username": "zmartianov",
    "rating": 1.0,
    "comment": "This game glorifies European colonialism",
    "timestamp": 1754604000
  },
  {
    "username": "sykano",
    "rating": 1.0,
    "comment": "too many expansions\nawful to force people to buy the same game again\n======\nTherefore \"Dune Imperium\" is the last time I bought a game from Paul Dennen or Dire Wolf. :/\n======",
    "timestamp": 1753567200
  },
  {
    "username": "Esyhpe",
    "rating": 1.0,
    "comment": "Toujours nul, mais un peu moins que celui de base",
    "timestamp": 1745964000
  },
  {
    "username": "SDmitry",
    "rating": 1.0,
    "comment": "Once and never again. Where is the theme? It’s not readable. Completely random battles. Where is planing and draft? Top deck intrigue card? That’s it? Broken cards, some combos will win a game for a reasonable price while many of them are useless. Market is small to compensate and create meaning. Area control with small cubes, literally the smallest component? Are we talking about 2023 game or 2013? Worker placement with 2 max 3 workers? No, really?\n\nIs there anything except the name?",
    "timestamp": 1741302000
  },
  {
    "username": "Mystic_Mouse",
    "rating": 1.0,
    "comment": "This is what Dune: Imperium should have been from the beginning, minus the Harkonnen using the worms. 1 means best, right? Didn't make enough money the first time around I guess.",
    "timestamp": 1737586800
  },
  {
    "username": "cotomel",
    "rating": 1.0,
    "comment": "Way better than the original.",
    "timestamp": 1736636400
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "I'm glad they didn't SAND off the edges here!!! just kidding, no game can be worse than that horrible sanding metaphor that's so overused among nerds.",
    "timestamp": 1727388000
  },
  {
    "username": "sybrwookie",
    "rating": 1.0,
    "comment": "Took a VERY good game and made it SO much worse.",
    "timestamp": 1723068000
  },
  {
    "username": "KAR42",
    "rating": 1.0,
    "comment": "They should have focused on the original for at least a decade before committing to another iteration. Feels like they just want to cash in as much as possible.",
    "timestamp": 1707865200
  },
  {
    "username": "larrydurbin",
    "rating": 2.0,
    "comment": "The OG is better imo. We're not falling for the Wyrmspan , Finspan trick.",
    "timestamp": 1759183200
  },
  {
    "username": "pluviometer",
    "rating": 2.0,
    "comment": "I've become a bit of a Dunehead after watching the Villeneuve movies, so I tried out this game with 5 friends since the rulebook had a scenario that allowed for 3v3. Big mistake. I don't know if my side got super unlucky or the scenario is just inherently unbalanced but it was a hopeless steamroll. On top of that, I don't like area control and \"deck building\" where you only add a couple cards to your deck via a small, buy-one-and-it's-gone market. I'll have to stick to the movies for this franchise.",
    "timestamp": 1744840800
  },
  {
    "username": "Tanka91",
    "rating": 1.5,
    "comment": "На двоих играется плохо",
    "timestamp": 1739660400
  },
  {
    "username": "Nijoth",
    "rating": 2.0,
    "comment": "A bloated version of a mediocre worker placement deckbuilder. I prefeer D:I without the expansions, its snappy and clean. Uprising just made an okish game worse.",
    "timestamp": 1726351200
  },
  {
    "username": "redguard21",
    "rating": 2.0,
    "comment": "Too swingy because of worms. Spy mechanic is meh",
    "timestamp": 1723154400
  },
  {
    "username": "Domi4",
    "rating": 2.0,
    "comment": "Just old game in new coverup\nMarcet workers want to sell us identical game one more time.\nIf u have original game - dont buy, it almost the same",
    "timestamp": 1720994400
  },
  {
    "username": "Musuh",
    "rating": 2.0,
    "comment": "Imbalanced, boring.",
    "timestamp": 1719871200
  },
  {
    "username": "GhostInside",
    "rating": 2.0,
    "comment": "Played a handful of games, one of them 3v3 mode.\n\nPersonally, I think this game is a mess and I have zero desire to play it again.\n\nSure the worms are iconic, but the double-rewards mechanic feels lame AF. It is so completely over-powered that it collapses the decision space as soon as one enters the fray. In 3v3 mode only one team gets worms, and that leads to a ridiculously one-sided affair.\nThis all feels like lazy design to me.\n\nThe \"deck building\" aspect of the game is still non-existent. If there isn't a sweet card (that you can afford) in the first two rounds, then the market stalls out because nobody is buying anything.\nExample, in 2 standard games I might have purchased 5 cards. In the 4-hour 3v3 game I think I bought 3 cards total.\nThe market didn't change for the last 1.5 hours of the game.\nThe combination of low deck cycling and limited board access means that clogging your deck with anything less than amazing just doesn't make sense.\n\nAnd let's say that an amazing card does appear... If an opponent grabs it and the market goes back to junk cards then you probably just lost the game.\n\nEvery game I played had a surprise upset moment (usually because of worms or intrigue cards) that ultimately decided the game... But we still had to sit around for one or more hours to wait for the conclusion.\n\nAgain, lazy or bad design in my opinion.\n\nThe spies... I was excited about this one, but they ultimately feel flat. The fact that they stay forever leads to a very stagnant board. In 2 games of 4p and one of 6p, spies were used maybe 6-8 times? But the number of minutes consumed by AP deciding where to place a spy? More than 30. Spies add game length for something that is rarely ever touched.\n\nSpies are worthless if you don't have access in that particular moment, or when your larger strategy demands that you go somewhere else in this moment.\n\nThe leaders are ok, except that mua'dib is significantly more powerful that the others. That also feels lame/lazy design.\n\nI just don't get it how so many people become enamored with this mess, but I'm glad they find something they enjoy.",
    "timestamp": 1705273200
  },
  {
    "username": "juriel1",
    "rating": 2.0,
    "comment": "I put 2 instead of 1 what you have deserved...",
    "timestamp": 1699657200
  },
  {
    "username": "Nnfazwu",
    "rating": 2.0,
    "comment": "Game is good and i dont consider it a cashgrab but smug and dismissive forum posts by someone from the publisher just dont sit well with me",
    "timestamp": 1699570800
  },
  {
    "username": "Deathron123",
    "rating": 3.0,
    "comment": "Rating low due to broken mechanic of worms and double reward. It is designe flaw that in game when 10 points finishes game, 1 battle can swing and provide 4 points (40%)…",
    "timestamp": 1761865200
  },
  {
    "username": "thrasymedes",
    "rating": 3.3,
    "comment": "Not the worst case I've seen but still feels like modern-euro-itis run rampant to me. Dozens of special actions, special cards, special powers, extra tokens, etc, means that you are not really interacting meaningfully in a shared decisions space, you don't know what other players are doing or can do, you're just waiting for their turns to end so your own turn can start. And then on your own turn, optimal play involves reading all this special power, special exception, one-off stuff and seeing if you can find an exploit in there somewhere which is going to combine with your other special powers to give you an oversized advantage. And if you don't join the AP-arms-race, you're not really in the game. If you do join... the winner will be the player who randomly drew into the best broken combo.",
    "timestamp": 1761429600
  },
  {
    "username": "PJV666",
    "rating": 3.0,
    "comment": "Encore une extension sortit à la va-vite pour plaire au fan... Un moment, il faut arrêter d'exploiter la licence comme pas possible... Vous devenez ce qui est de pire dans les jeux de société comme les jeux vidéo qui sortent des DLC, car le jeu de base n'est pas fini.\n\nAjout après avoir joué un peu mieux que celui de base, VITE FAIT. Mais toujours pas équilibré, le deck building chiant, les spy qui avantage avec certaine carte (qui ne sont pas toujours présents du par l'aléatoire de la rivière qui ne se renouvelle pas assez) et putain les VERS en + dans les conflits, pires idées du monde, vraiment. Trop facile de win avec ça et encore + avec les cartes qui te les donnent. Les cartes intrigues devraient etre supprimé. Le jeu est plus aléatoire qu'une partie de Yatzee. On est dans l'abus des pires 'jeux expert'.\nAh oui, le jeu a toujours la médaille d'être le PIRE DECKBUILDING qu'il existe XD. Le créateur devrait vraiment jouer à d'autre jeu dans sa vie avant de nous pondre un autre jeu SVP. (et les joueurs qui aiment ce jeu devrait arrêter de jouer au jeu de société aussi).",
    "timestamp": 1761256800
  },
  {
    "username": "Forgeforgeforge",
    "rating": 3.0,
    "comment": "I can't remember the last time I hated playing a game more. Maybe root? Every moment I was either bored to tears, or extremely frustrated. I wanted to scream.\n\nLike most bad worker placements, there is absolutely no reason to pay attention when it's not your turn. Other people act with total impunity on their turns, you cannot respond, and every thing they do cuts a firewall across your decision space. There is no reason to plan ahead. Start your thinking over on your turn.\n\nWhat cards/contracts are available on your turn is basically random. All the tiles and cards in this game come out in the worst way. They are the dreaded \"situationally good\". Some cards are fucking phenomenal for only one player.\nA few cards are fucking phenomenal for anyone, but you will not be allowed to buy them, because they were drawn randomly right before your opponents purchase phase. Has there ever been a good game with a card river but no future market?\n\nThis has all of the bad things about deck building with none of the good (the good requires control over the contents and the cycling of your deck, trashing/cycling/frequent shuffling, eg dominion). There's really zero efficient deck management actions on the action board, the trashing spots are not worth an entire worker action. (Factions that trash with their signet action, especially when randomly served with efficient powerful cards they can afford, dominate here).\nYour randomly drawn hands limit your actions the same way the draw bag controls War Chest (aka chess but ultimately bad right when it matters), you might just be dealt an awful round at key moments, which would be fine if the game were shorter, but one bad hand sticks with you for half an hour in dune. Dominion works because the deck control is extremely high, the market is equally available to all players, you shuffle dozens of times, and the game is over in fifteen minutes. This is a shambling 3 hour monstrosity.\n\nThe point scoring system is as bad as they come. Like most limp modern euros, the game artificially creates a close end-game point spread then has a wild final turn. The majority of the points in the game (the faction bumps) are participation trophies. The remaining points have wildly differing costs. Some combats are hard fought, and others just showing up is enough, and you can't predict the mood. The intrigue cards award points basically at random. No one sees enough intrigue cards to have truly chosen a set that matches their intentions, but then end game comes and people pull 3 points out of their hat like a magic trick, with cards that score otherwise half-completed objectives which you couldn't possibly have counter played. The new uprising mechanic of worms doubling combat scoring just makes the ending even sharper and more arbitrary.\n\nAnyone who likes modern board games can find fun in pulling levers and collecting resources on their turn, especially if they win. There are two criteria I look at with every game\n1. Am I still having fun when it's not my turn? Do I care what other people are doing? Does it create new opportunities in the gamespace? Do I have agency to respond? Are we negotiating? Are we even just laughing about what people chose to do? Absolutely not in this game.\n2. When the game is over, does the whole table agree the player who won played the best? Can we examine the choices they made and understand what they did well that we can emulate in a future game? No, not really.\n\nThe art direction chose to use the faces of famous actors from the godawful recent movies, and just instantly dates the game to the era. Oh, look, it's Lil Timmy Mumbles, Christopher Walken, and the jock from the goonies.\n\nThe acclaim this inane game gets make me feel sad and alone in the universe. I had to listen to the soundtrack from 'There Will be Blood' from start to finish to process the feelings of isolation and despair.",
    "timestamp": 1761084000
  },
  {
    "username": "Klausi300",
    "rating": 3.0,
    "comment": "Klassische Verschlimmbesserung in fast jeder Hinsicht.",
    "timestamp": 1756159200
  },
  {
    "username": "Gshegosh_B",
    "rating": 3.0,
    "comment": "Not my type of game, thus will not play again.",
    "timestamp": 1751234400
  },
  {
    "username": "p00q",
    "rating": 3.0,
    "comment": "Slapping on score from original Dune Imperium.",
    "timestamp": 1744668000
  },
  {
    "username": "Generalkhun",
    "rating": 3.0,
    "comment": "Played after Dune imperium. Same feeling. not at all finding this playable. Zero enjoyment. Can this game can even be strategized? See some improvements but somehow neglectable, not seeing it fixed anythings I see was an issue.\n\nAfter plays of this and Dune: Imperium. It somehow turn to very interesting conclusion about how diverse people 's game tase can be",
    "timestamp": 1736377200
  },
  {
    "username": "shakaysloupe",
    "rating": 3.0,
    "comment": "The huge problem are the conflict cards, because they are unbalanced, they can't be predicted, they depend on your luck with the draw, and they change everything. They needed to add something to create uncertainty to the game, but this is a very very bad way to do it, because you can do whatever you want, if you draw the bad cards and your opponents good ones, you will fauil in a lot of your attempts.\n\nVery very very bad sensations here",
    "timestamp": 1736290800
  },
  {
    "username": "ryushin95",
    "rating": 3.0,
    "comment": "Decided to sell it, just not a fans of DBG + Worker Placement, nothing wrong with the game, but just not my type of game.",
    "timestamp": 1735858800
  },
  {
    "username": "Mayasty",
    "rating": 4.0,
    "comment": "My impressions from its predecessor are intact. It’s still the same chaotic and strongly luck dependent game. The two main elements: Spies and Sandworms don’t help much. Spies look like a patch to irritating and disrupting rule: one Agent per space. You may now place your Agent to the occupied space but …. first you need to place a Spy there. So, the same in a different way. Sandworms are a nice flavor gadget and add some new strategies but they are not able to improve the combat which is a pure luck. So, nice theme but the game system doesn’t convince me. The merge of deck building (luck dependent from its nature, best for adventure games) and euro game worker placement + resource planning is a fatal choice. It’s neither good euro nor adventure.",
    "timestamp": 1762383600
  },
  {
    "username": "Fragasnap",
    "rating": 4.0,
    "comment": "The worker placement is pretty alright, though the relationship between it and the card market feels tenuous at best. Because the game takes a maximum of 10 rounds and likely only 6 or 7 you just never get to do a lot with your deck.\n\nThe card flowing market is absolutely terrible. Cards are of wildly situational value and different cost: it is easy to randomly have good cards show up or just have only bad cards that gum up the market forever (especially because acquiring mediocre cards causes better cards to appear for other players).\n\nSolari feels frustratingly limited compared to other resources, with only two spots on the board to acquire it where one costs a prohibitive 3 Spice. The CHOAM module gives contracts you fulfill in order to get Solari, but the actions which give Contracts aren't very good, and Contracts themselves require you to go to spend yet more time going to specific places, so your access to Solari feels too distended and swingy.\n\nI like conflicts, especially the new addition of conflict symbols making every won conflict worth half-a-point. It makes most conflicts feel more impactful. Less good is the way worms are added to the game in confluence with the arbitrarily rotating turn order. Doubling point rewards to accrue 4.5 points in the final rounds of the game seems overly centralizing, and one's access to this is strongly affected by going early in turn order over which one has no influence. (Spies of course address the issue by allowing you to spend more resources after unlocking worms to also Observe the space, but it would've been better if you were just early in turn order by chance, wouldn't it?)\nIntrigue cards are a frustrating amount of randomness to fold on top of the rest of this, considering how important the end-game conflicts seem to be.",
    "timestamp": 1762297200
  },
  {
    "username": "toorwell",
    "rating": 4.0,
    "comment": "What this game adds to the original Dune: Imperium, mostly dilutes the experience for me rather than improve the experience.",
    "timestamp": 1758924000
  },
  {
    "username": "ksmith78",
    "rating": 4.0,
    "comment": "OG is better. I didn't find much reason to revisit this. The combat felt a lot worse this time around.",
    "timestamp": 1757973600
  },
  {
    "username": "IceBearchen",
    "rating": 4.0,
    "comment": "I tried to like it but I stopped playing halfway through my first play. This and Arnak just aren't my genre of games.",
    "timestamp": 1749160800
  },
  {
    "username": "schrifterz",
    "rating": 4.0,
    "comment": "Plays a bit like Arnak (worker placement and deck building) but lighter. However I played it once and there didn't seem to be a reliable way of getting to the required amount of victory points. Seems to be in the end card luck if you are actually allowed to win.",
    "timestamp": 1747605600
  },
  {
    "username": "smurfodeth",
    "rating": 4.0,
    "comment": "Weak deckbuilding combines with milquetoast worker placement for a whole that is even lesser than the sum of its meager parts. As an added bonus, it takes forever with nothing interesting ever really happening. The combat mini game is slightly cute, but, boy howdy, it’s a tiny piece of candy buried in a big turd. How is this so popular?",
    "timestamp": 1745791200
  },
  {
    "username": "marcuslind1",
    "rating": 4.0,
    "comment": "2025-03-26\nBGG rating after first play, 4p, with Bloodlines and maybe Ix and/or other expansions: 4/10.\nPerhaps a too generous rating. DIU has an interesting mix of worker placement, area domination and deck building, but I felt it was way too long and swingy, or, this much swinginess is not ok in such a long game. Lucky draws from the intrigue deck can have a big impact in combat, and you need the right cards to come up and not be taken by others in the shifting card market to use your cards- and faction combos.\nMaybe my rating can (up)rise with faster play, but it might also go down if my first experience is repeated.\nThe thematic integration is ok unless you expect to play out the plot from the book.",
    "timestamp": 1742943600
  },
  {
    "username": "norberts",
    "rating": 4.0,
    "comment": "Let's put it aside the fact that this should've been an expansion as it adds less than the other two actual expansions.\nThe OG had 2-3, even 4 strategies with expansions to win. This has exactly one. A player can have a 5 points combat phase, half the points needed to win. Intrigue cards are swingy as ever, deck building is weak.\nDune Imperium used to be in my top 10, this version kinda soured me on the series. The only good part is that some of the green spaces are more interesting. I'd port them back to OG. That's it. I came to this with low expectations, and even those were not met. Glad I didn't buy it.",
    "timestamp": 1738796400
  },
  {
    "username": "johnclark",
    "rating": 4.0,
    "comment": "The sand worms are cool but the rest of the additional stuff is awful. Spies and contracts just add downtime. Spies add more tactical options but who cares? I don't want to sit and watch people think. I don't want to watch people do complex sequences of actions they have been carefully planning for an hour. Its just dull. The core game is still good which is why it gets 4 rather than 2. I will stay with the original game even if this version is more balanced.",
    "timestamp": 1737846000
  },
  {
    "username": "realityfoible",
    "rating": 4.6,
    "comment": "I don't quite understand the hype around Dune Imperium. Regardless of which version or expansion I play, I always come away feeling that it's a fairly shallow and luck heavy affair that long outstays its novelty.\n\nSucceeding at Dune reflects the random opportunities given by the game more than any cleverness shown by its players. It's a game that you can play poorly, but not one that you can play well. Success is entirely governed by drawing what you need when you need it.\nThere's quite a bit of luck in whether the right cards become available in the markets at the right time to reward any particular strategy, and lucky draws from the Intrigue deck handily king-make. This is on top of the luck of the draw already inherent the deckbuilding genre, where what you draw and when completely dictates play.\n\nDune is a light card game with precious little player agency wearing the costume of a serious multi-hour dense euro. The disparity between how the game presents itself and how it plays would be comedic if it weren't so frustrating.",
    "timestamp": 1759960800
  },
  {
    "username": "Yuri",
    "rating": 5.0,
    "comment": "Improved version of Dune: Imperium (except the worms). Still unbalanced and under-developed. +1 with house-rules",
    "timestamp": 1758578400
  },
  {
    "username": "Incoming_Yellow",
    "rating": 5.0,
    "comment": "Переосмыслил. сбалансированная во всем кроме червей - итог. Дрисня",
    "timestamp": 1757887200
  },
  {
    "username": "Traconis",
    "rating": 5.0,
    "comment": "Terrible watered down original Dune experience. Almost everything changed was in favour of players who prefer RNG and Oomph moments over the deep strategy/tactic of the original Dune with expansions. Huge disappointment .",
    "timestamp": 1757282400
  },
  {
    "username": "bggmatje",
    "rating": 5.0,
    "comment": "[April 2024]\nDune: Imperium is one of my favorite games. And Uprising is a nice variation of the standard game.\n\nWhat I liked most was the way how the Mentat is replaced with a Recall Agent action. I also like there is a way to cycle through your intrigue cards.\n\nI understand the introduction of spies, but it is a mechanic I can live without. Same for the contracts. The actions on the worker spots have changed slightly too and I am indifferent about. Personally, I slightly prefer the ones from the standard game.\n\nWorms look cool, but is what I actually like least in this version. It feels like you almost cannot ignore them, and they introduce huge swings.",
    "timestamp": 1755036000
  },
  {
    "username": "Weirdsalmon",
    "rating": 5.0,
    "comment": "5/10: Dune imperium is a very refined deckbuilding, worker placement, combat game with many interesting choices throughout the game. I think I see why so many people like it, but it is simply too tense for me.",
    "timestamp": 1751925600
  },
  {
    "username": "Iron_Salamander",
    "rating": 5.0,
    "comment": "Would rather play Clank! It's fine, but Dune is not an IP I like at all, and Clank! is just more fun and varied, with similar deck building mechanisms.",
    "timestamp": 1747605600
  },
  {
    "username": "tscox87",
    "rating": 4.5,
    "comment": "One play. 4P. 3.5 hours.\n\nWhat I liked:\n- combat was tense and exciting, and fighting over the reward card gave me fun Blood Bowl TM vibes. The combat intrigue cards felt a bit like Kemet and kept it exciting.\n- I liked allying myself with a faction, and feeling like I was the Emperor's pet (up to the point where continuing to invest there didn't give me any further returns).\n- Hand management and choosing what to play vs reveal. Except on those turn where I drew a hand that didn't facilitate me going the only place I wanted to go, that sucked.\n\nWhat I was less keen on:\n- The open river of market cards, and it refilling after every player's turn, meaning every turn involved stopping and re-assessing a new set of options and costs. Also, sometimes having heaps of money but nothing good to buy was lame.\n- The board pretending to offer dozens of options, then your hand dictating that there was really only a few places you could go, and heaven help you if you were late in turn order and those were already taken accidentally.\n- Incredible downtime waiting for other players to analyse the game state then take their actions.\n- Pretty much every turn every player forgetting to activate something (\"Oh wait, last turn I should've got an extra spice because of XYZ...\"). Too many easy to overlook rules, edge cases, exceptions, that interrupted any sense of flow.\n\n\nOVERALL:\nA crunchy, ambitious game that offers a big, dynamic game space to explore, and will appeal to players who like to parse lots of open information, and analyse their ideal path forward on a highly tactical level. I, however, am just not one of those types of players.",
    "timestamp": 1747605600
  },
  {
    "username": "TheWrongTrousers",
    "rating": 5.0,
    "comment": "Some tweaked board spaces make the core mechanics feel better than ever, but a lot of what’s added doesn’t quite hit the mark for me.\nI'm not a fan of the new conflict deck. When 2nd place has a better immediate reward than 1st, it's not a fight. Matching icons is a thematic miss for me. I used the old deck and 5-strength worms for a while (no reward doubling).\nCHOAM module is pretty good, simple but satisfying.\nSpies are cool in concept, but in reality add a lot of AP for what you gain, since they’re so multifunctional and potentially crucial for late-game strategy. Not to mention they take away some crucial competition for space.\nGreat value for a standalone game, but I wish it was a modular expansion. Never going to play this 6 Player.",
    "timestamp": 1745272800
  },
  {
    "username": "mi_de",
    "rating": 5.0,
    "comment": "Not really a Dune feel.",
    "timestamp": 1745100000
  },
  {
    "username": "Alsribeiro",
    "rating": 5.0,
    "comment": "I don't understand why people love this game so much. It manages to take two great mechanics and making each worse.\nThe deck building aspect suffers more, I think. It is slow, meaning the number of cards you add throughout the game is relatively small, and the number of times you get to shuffle up your deck is very limited (it's a ten round game). It has few opportunities to draw cards, even fewer to cull them. The cards themselves don't feel super consequential because you see them three times in the game, at most, and their powers are very swingy (from useless to broken).\nThe worker placement suffers because it is tied to the tags on your cards. This means that you might be locked out of the action that will win you the battle at the end of the round because of the luck of the draw (bear in mind you have the cards in your deck, just not in your hand when you need them). I like the aspect of worker placement in which you prioritize and hope people don't take your spot, but that's player driven. The randomness of the cards always annoys me. And lastly, the worker placement spaces don't feel super interesting and you're never more able to do stuff at the beggining of the game or the end, and it leads to the final problem:\nThe bidding / battle system. Whether you win or you lose you have to crawl your way over to a decent position and it feels like a drag. No engine building at all or something that makes you feel more powerful at the end. Even classics like Agricola give you a sense of progression over the course of the game.",
    "timestamp": 1744668000
  },
  {
    "username": "Experte",
    "rating": 5.0,
    "comment": "A simple Mainstream Version from the original.\nPlaying one time ok, playing more to boring.",
    "timestamp": 1744581600
  },
  {
    "username": "dusteppe",
    "rating": 5.0,
    "comment": "Stiff mix of worker placement and deckbuilding, none of which are done well, with relatively little interaction and limited decision space.\nAwfully incremental, fairly long and ugly to look at. Luck is indeed present and can screw you over on a decisive turn, but I am sure if you play the game enough you can overcome it.\n\nMy friends like it, so I'll play it if they ask for it, but if I have to go deckbuilding I'd rather play Core Worlds, Tyrants, Dominion or The Hunger than this.",
    "timestamp": 1743544800
  },
  {
    "username": "Jrtolf",
    "rating": 5.0,
    "comment": "You do this stuff and or that stuff, and sometimes you do stuff that lets you score a point, but sometimes you still do this stuff or that stuff, even though it doesn't help you score a point. But you're still doing stuff, even though none of it scores you a point. And you end up hoping that someone else scores enough points to end the game.",
    "timestamp": 1743544800
  },
  {
    "username": "Johnathan Ray",
    "rating": 5.0,
    "comment": "My favorite implementation of Dune Imperium.\nI was talked into playing this game, and it was my 5th time overall playing some kind of Dune Imperium version. I think my favorite version was actually the first one without any expansions. I could see why others around me were able to enjoy this game as we were playing- I just wasn't one of them.\nI truly need to stop allowing myself to be talked into playing games that I know I won't truly enjoy.\nOn Saturday of March 2025, I was forced to play Dune, the original, for 8 hours, and it was so boring that I'm giving this one a few less stars.",
    "timestamp": 1741474800
  },
  {
    "username": "mrbunkers",
    "rating": 5.0,
    "comment": "4 player game. Felt the worms were overpowered, but I'm sure this is less of an issue with repeated plays. Also, once again, this is not really a deckbuilder and you get punished for being greedy in the card market.",
    "timestamp": 1741302000
  },
  {
    "username": "Mueckerling",
    "rating": 5.0,
    "comment": "I only played this under the worst circumstances the first time, in 6 player team mode, but the milk has been spilled now and I need to write how it tasted. I see why this game is so popular. It is an engaging system of resource efficiency puzzling, but not a very thematic game in general. I like that it isn't a point salad game though. Every VP matters. The worker placement part has good player-to-player tension. The battlefield bidding and intrigue cards make it even more interactive. I like! The deckbuilding game on the other hand was super lackluster to me. The card market is a simple card row, quite random and uninspiring in comparison to other even lighter deckbuilders like The Quest for El Dorado, where you can buy cards much more strategically. If you're trying to build an engine through the combination of cards in your deck, literally good luck with that! It's quite easy to bloat your deck, but it's not that easy to keep it lean or trash cards. Actually the game kinda punishes you for building your deck, which isn't the best thing for a deckbuilder. I would try it again, but only with 3-4 players. Until then it's just ok.",
    "timestamp": 1739401200
  },
  {
    "username": "DeadJumper",
    "rating": 5.0,
    "comment": "Great game. Getting a 6 in comparision to the OG Dune:Imperium, as the OG achieves the same game with less bloat. Comats are now the main focus on the board compared to being just one strategy out of many and are quite swingy. The points scoring does not feel as much like a always close race anymore like in the original. Without the OG this would probably get a 8.",
    "timestamp": 1739401200
  },
  {
    "username": "Daniel109",
    "rating": 5.0,
    "comment": "I only played this once, and am open to trying it again to adjust my score.\n\nIn my eyes, it was a pretty standard \"place-workers, get resources, spend/convert resources\" with some half-baked deckbuilding grafted on. The \"battles\" were a nice addition to an otherwise unexciting game, but overall this just feels like a greatest hits collection, smashing together every mechanic that makes your average hobbyist gamer salivate.\n\nDI: Uprising does do a couple of things well: particularly, I like how hard it is to earn points. The game feels a bit more focused than the average euro for that reason.",
    "timestamp": 1736895600
  },
  {
    "username": "invervegas",
    "rating": 5.0,
    "comment": "Complexity √",
    "timestamp": 1736377200
  },
  {
    "username": "Joel_L",
    "rating": 6.0,
    "comment": "Another deck-builder like Dominion, except this one has worker placement on top. I didn't find the market cards that interesting. The worker placement spots remind me of Lords Of Waterdeep. The theme is pasted on - the end result of your actions is the usual \"take this resource, draw this card\". It's a bit long.",
    "timestamp": 1762662720
  },
  {
    "username": "metapone",
    "rating": 6.0,
    "comment": "Played 1 4-player game. It was brain-burning, and I couldn't find a proper strategy for my engine with so many types of resources but only 1 or 2 ways to earn each type, and you need all of them in different times to get to the VP part. Paths to VP being a bit obscure also contribute to high thinking time per turn and some card effects are a bit confusing (Double Agent in particular).\n\n1-4 and 6 players.",
    "timestamp": 1762038000
  },
  {
    "username": "xfrgux",
    "rating": 6.0,
    "comment": "The balance is much better than Imperium. Still bad if bloodline excluded, especially for 3v3.",
    "timestamp": 1761429600
  },
  {
    "username": "Hinmatt",
    "rating": 6.0,
    "comment": "The game is a mix of worker placement and deck-building with a combat element. If you like the world of Dune, there will be a good chance you'll have some fun with this game. The theme is surprisingly strong for a game that's very much about mechanisms.\nIt's cool that there are a lot of story elements from the books in the game and not just from the movies.\nFor me, it has some weak spots\n- It can be very long. I don't think it needs to be. It feels dragged out.\n- There is a lot of downtime.\n- There is a lot going on. It can be confusing for players who are not used to games with so many options.\n\nI am not a worker placement fan, and although I find this game more interesting than many other worker placement games, its weaknesses keep me from really liking it.",
    "timestamp": 1760738400
  },
  {
    "username": "shackleford",
    "rating": 6.0,
    "comment": "Was fun initially, but I've found no interest in getting it to the table after the newness wore off. I'm not a huge fan of the IP, and without that, there's not much here to keep me interested in the long term.",
    "timestamp": 1759960800
  },
  {
    "username": "GameplayerOfTitan",
    "rating": 6.0,
    "comment": "I was looking forward to this but I don't think it loves up to the hype. It's dry, repetitive, lucky, take-thaty, and the aesthetics are bland.",
    "timestamp": 1758664800
  },
  {
    "username": "Beefy79",
    "rating": 6.0,
    "comment": "Played Mike's Copy",
    "timestamp": 1758146400
  },
  {
    "username": "phoofstix",
    "rating": 6.0,
    "comment": "must play sometime soon",
    "timestamp": 1758146400
  },
  {
    "username": "Ionside",
    "rating": 6.0,
    "comment": "More or less a card game with resource management.",
    "timestamp": 1757455200
  },
  {
    "username": "heathbarATL",
    "rating": 6.0,
    "comment": "(TTS) I'm not as enamored with it as others, but it's a good game. The card market and intrigue cards are too volatile for my taste.",
    "timestamp": 1757368800
  },
  {
    "username": "mikex4511",
    "rating": 5.5,
    "comment": "Mechanical soup that I'm glad to say I've tried it, but this game is too long. Likley more suited to a game group who play the same game many times. Sadly it didn't land at 2 or 3 plays for me. There are lots of great parts in this package it's just a little to stop start for me and it never feels like it get fully going in the 120mins+",
    "timestamp": 1757023200
  },
  {
    "username": "SeerMagic",
    "rating": 5.5,
    "comment": "On it's own, it's a good game. Compared to Dune Imperium, it's a pretty big step back.\n\nSpies are an unnecessary addition that just allows everyone to go where they want late game, destroying the core of what makes worker placement great. This also greatly devalues the previous expansions spy mechanics, which I felt where much better. Worms are OP. Last 3rd of the game everyone is sitting on a pile of spice and cash. It's not fun or interesting. Neither is the little loop you do to get these. Uprising board is super focus on the same loop you HAVE TO DO every game. The new combat deck is a miss twice. More people limping in for the stronger 2nd place rewards. And the icon matching is yet another unnecessary addition that just wasn't needed or fun. The liked idea behind contracts and they had potential, but it's yet another unnecessary addition that isn't fun or interesting. The new board I'm down on. The new city council is great, everything thing else is a step back and way too much card draw. I do like a lot of the new buy cards, and some of the leaders.\n\nOverall this is a less great game. With a bunch of extra stuff that works but isn't added fun or interesting decisions. Thankfully most of the new cards can be used, which still makes this worth while for me. But I think Dune Imperium is one of the best games ever made. Not everyone is going to want to pony up this much doe for some new cards, if you find the same things I did meh.\n\nUPRISING\n New addition to council seat area\n A lot of the new intrigue cards and buy cards can be used on old DI\n New rival system works great for 2 players (haven't played solo)\n Some fun new leaders\n\n Spies are lame, I preferred the old ones\n Contracts good idea doesn't pan out for more fun\n New board, and how it plays out the same every game\n New combat deck misses twice, with icon matching and bigger 2nd player rewards\n Too much card draw\n Worms OP\n Last 1/3 everyone has piles of resources, ruining the tighter economy of the original.",
    "timestamp": 1755900000
  },
  {
    "username": "TheMiddleAgedGamer",
    "rating": 6.0,
    "comment": "board is pretty ugly and whwartever. it jsut didnt really click for me. i didnt reallt like the whole needing the right card tto go to a space. timothee is cool thogh.",
    "timestamp": 1755122400
  },
  {
    "username": "sparker",
    "rating": 6.0,
    "comment": "It's fine. For all the different mechanics and paths available to players, it tends to favor a pretty narrow path to victory. While I'm delighted by the idea of a high-interaction deckbuilder, I was never eager to play this and traded it away.",
    "timestamp": 1752530400
  },
  {
    "username": "dnmdk",
    "rating": 6.0,
    "comment": "Not as good as the original",
    "timestamp": 1752530400
  },
  {
    "username": "Ketanest",
    "rating": 6.0,
    "comment": "Played twice.\nWhile it seemed to be a great game, it somehow doesn't really catch me.\nCan't point a finger on why, but would need to be convinced to play again.",
    "timestamp": 1752444000
  },
  {
    "username": "NavayaTCG",
    "rating": 6.0,
    "comment": "Surprisingly good, normally anything with a brand name is trash.",
    "timestamp": 1750024800
  },
  {
    "username": "Eiska",
    "rating": 6.0,
    "comment": "With three players, everyone gets rewards from fights. More players, more tight. Maybe insanely tight. There is continuous shortage of everything. It was quite hard to get any good card combos to my hand. Usually it was only possible to make quite small moves during one turn. As players have only 2 or 3 turns before fighting, players cannot do very much during one round.\n\nMechanically this game works, for at least players who like scarcity. Still I cannot really see why is this game so popular, even if the success of tv-series and movies can have some effect on that.\n\nAlso, the game looks quite unattractive to my eyes, as I've became so accustomed to (overproduced) present-day games with lots of frills.",
    "timestamp": 1745013600
  },
  {
    "username": "hlorraine",
    "rating": 6.0,
    "comment": "Shared library item.",
    "timestamp": 1745013600
  },
  {
    "username": "demuxer",
    "rating": 6.0,
    "comment": "I prefer the original Dune Imperium. If I'd like more wargame feeling I have War for Arrakis to play instead, with bigger and cooler worms.\nOther engine building or area control games are better in the sci-fi category.",
    "timestamp": 1744322400
  },
  {
    "username": "jnharr",
    "rating": 7.0,
    "comment": "DI:U is fun and well designed, but it feels superfluous vis-a-vis DI. Spies are nice, but DI handles this just as well (perhaps better) with the infiltrate mechanic. Worms seem cool, but half the battles don't allow them to participate. I was curious about this, but I'll stick with DI + Ix & Immortality for my peak Dune experience.",
    "timestamp": 1762611780
  },
  {
    "username": "RMroz",
    "rating": 7.0,
    "comment": "Well, this is a bit complicated.\n\nI love the abundance of choices here. I can imagine that with pro players everybody could end up gunning for the worms, but in my casual group you can pull off a win in various ways. After a few sessions, I'm still putting together how all the gears interact and it's a very fun puzzle. It's also good to introduce some conflict to conflict-averse gamers, since fighting here is really just bidding and much less in-your-face than in, say, area control games.\n\nAnd yet it's not quite as exciting as I'd want it to be. I can see a few reasons for that. One, there's not enough blocking for a worker placement game. You can almost always go where you want to. Two, there's not enough ways to trash your cards. Three, even though the conflicts ramp up and it's satisfying to win big with 4 points from one conflict, it doesn't feel like it tells a captivating story. It's thematic alright, but somehow it always ends as \"aaaand I've got 10 points thank you very much\" and not as \"hahahahaha I just wiped the floor with you you filthy Harkonens!\".\n\nIt’s a good game. But it isn’t great.",
    "timestamp": 1760824800
  },
  {
    "username": "ourainbows",
    "rating": 7.0,
    "comment": "Played only a solo game",
    "timestamp": 1760738400
  },
  {
    "username": "LittleIskender",
    "rating": 7.0,
    "comment": "only for 3v3 otherwise 6",
    "timestamp": 1760565600
  },
  {
    "username": "vdwoord",
    "rating": 7.0,
    "comment": "Like this game a lot. Don't need to have it in my collection because I can play it with others.",
    "timestamp": 1760392800
  },
  {
    "username": "piofernix",
    "rating": 7.0,
    "comment": "Issues:\n- Broken box",
    "timestamp": 1759788000
  },
  {
    "username": "achkomm",
    "rating": 7.0,
    "comment": "Spielgruppe",
    "timestamp": 1759269600
  },
  {
    "username": "dougfoolery",
    "rating": 7.0,
    "comment": "A perfect mix of deckbuilding and worker placement, with just the right amount of player interactions from combat to make it a uniquely tense experience. I enjoy the tightness of the new board and all the new elements in this iteration. There are more paths to victory though combat cannot be ignored. With the Sandworms, games often come down to 1 or 2 large scale battles. Given how much it takes to set them up, deploying sandworms becomes a Hail Mary type of play and forces more players to join in, making late game combats more high stake and unpredictable. Fantastic game with a lot of depth that reveals itself with repeated plays.",
    "timestamp": 1758492000
  },
  {
    "username": "Dunklezahn",
    "rating": 7.0,
    "comment": "DTW 99A",
    "timestamp": 1758492000
  },
  {
    "username": "Kroomiester",
    "rating": 7.0,
    "comment": "Dune Imperium Uprising is an impressive game. It manages to be a tense and tight tug of war on so many fronts. It does not let you pick a road and ignore the rest, but if you fail to specialize in anything, you will surely be left behind.\nThe game’s scope is wide, but the lack of resources keeps it grounded.\n\nThere are few flaws with the game, but it does not spark anything for me when I play it. The theme is wholly pasted on, so the game itself feels very abstract. I wouldn’t mind playing this again, but there are other worker placement games that excite me more.",
    "timestamp": 1757023200
  },
  {
    "username": "un_amiral",
    "rating": 7.5,
    "comment": "Unsere erste Partie dauerte, obwohl wir Vielspieler sind, über 4 Stunden. Es gibt durch Deck Building, Worker Placement und leichte Asymmetrie der Anführer verschiedene Wege, die Zielpunktzahl zu erreichen. Das Regelwerk ist leicht verständlich, die Regeln sind nicht zu komplex. Thematisch ist es nicht so mein Ding. Die Spielzüge waren mir zu mechanisch. Spielmechanik: 9/10, Artwork: 7/10, Spielspaß: 7/10.",
    "timestamp": 1762124400
  },
  {
    "username": "SoloGamingDad",
    "rating": 8.0,
    "comment": "The same as the original with two new mini-expansions built in. One actually called a mini-expansion and optional, the other (the spies) woven into this \"new\" base game. As new versions go, it seems pretty disappointing and unnecessary.\n\nI also think it’s unfortunate that so many of the cards promote the use of spies. It feels like I have fewer choices to make in this game, I’m so often pushed in that direction. and those cards don’t do enough else. As a result, this game feels much more limiting than the original, and not in a tight crunchy, thinking way. In a more tilted, confined and less engaging way.\n\nMixes nicely with Immortality. And overall still fun to play, just not sure it's worth it. And I probably won't keep both because I don't want to have to shift Immortality or Ix components back and forth.\n\nBig worms are better than dreadnaughts.",
    "timestamp": 1761951600
  },
  {
    "username": "ElRonPivo",
    "rating": 7.5,
    "comment": "Got what we needed out of it. My wife constantly wiped the floor with me, only to find out she didn't really care for the game. Good game, surprisingly easy to let go from my collection.",
    "timestamp": 1761692400
  },
  {
    "username": "Kartenhouse",
    "rating": 7.5,
    "comment": "want to try",
    "timestamp": 1761692400
  },
  {
    "username": "Zhod",
    "rating": 8.0,
    "comment": "4p\n6p, Teams",
    "timestamp": 1761343200
  },
  {
    "username": "Corwin007",
    "rating": 7.5,
    "comment": "Some parts are more exciting than in the original, others are just as annoying (the intrigue cards). Still a good game, but yeah, neither of them is something I'm actively going to seek out, this third play (one with Uprising, two with the original) convinced me of it.",
    "timestamp": 1761256800
  },
  {
    "username": "Noboe",
    "rating": 7.5,
    "comment": "More interesting and thematic than original base game. It is opportunity festival. Exciting and with random swings, especially regarding intrigues.\n\nAlso more random than the original.",
    "timestamp": 1761170400
  },
  {
    "username": "Mestail",
    "rating": 8.0,
    "comment": "A fight-priority Dune Imperium, especially with bloodborne expansion, A good game even though i prefer imperium+Ix+immortality",
    "timestamp": 1760652000
  },
  {
    "username": "DevOpsProDude",
    "rating": 8.0,
    "comment": "44x67 - 65\n63x88 - 194\n102x146 - 9\n\nPlayed on board game night.",
    "timestamp": 1760047200
  },
  {
    "username": "Shade_Jon",
    "rating": 8.0,
    "comment": "Worker placement, combat game, nicely balanced. A little more balanced than original game, but more complicated, perhaps excessively so. Frustrating that it makes the original game essentially obsolete.",
    "timestamp": 1759960800
  },
  {
    "username": "bullfrogggy",
    "rating": 9.0,
    "comment": "Players: 1-6\nBest: 4",
    "timestamp": 1762611840
  },
  {
    "username": "carlzzzjr",
    "rating": 8.5,
    "comment": "Great worker placement/deck builder. Awesome dune theme.",
    "timestamp": 1762297200
  },
  {
    "username": "Wasylus",
    "rating": 9.0,
    "comment": "Genre=strategy\nPlayers=3-4; b4\nTime=3h\nExpansions=standalone\nThemes=SF; adaptation(book), adaptation(Dune)",
    "timestamp": 1762210800
  },
  {
    "username": "damaga",
    "rating": 9.0,
    "comment": "▪︎ JUGADORES ÓPTIMO: 2(con bot)-4\n▪︎ DURACIÓN APROX: 2-3 horas",
    "timestamp": 1762210800
  },
  {
    "username": "tungufoss",
    "rating": 9.0,
    "comment": "Effectively Dune Imperium 2.0 which replaces the original.\n\nHas a team variant play mode, where you have 3vs3.",
    "timestamp": 1762210800
  },
  {
    "username": "jennazaid7",
    "rating": 9.0,
    "comment": "Mine\n+ Bloodlines expansion",
    "timestamp": 1762210800
  },
  {
    "username": "Bozok",
    "rating": 9.0,
    "comment": "Includes deck building and worker placement mechanisms. A lot of people consider this one of their favorite games of all time (NPI's 2nd favorite of all time). This is an updated version of \"Dune: Imperium\", and reviewers generally agree new players should get this game over the original. Doesn't work great with the first two expansions (Rise of Ix and Immortality), but works great with the Bloodlines expansion (balances out the end-game focus on worms) and the revised Folded Space insert for DIU will fit base game and Bloodlines.\n\nI prefer this over the original Dune Imperium. My favorite way to play is Uprising + Bloodlines.",
    "timestamp": 1762124400
  },
  {
    "username": "lbar_430",
    "rating": 9.0,
    "comment": "Assosiation",
    "timestamp": 1762038000
  },
  {
    "username": "Aatalos",
    "rating": 9.0,
    "comment": "A wonderful game like to play it and with an insert its as well a nice setup time",
    "timestamp": 1761865200
  },
  {
    "username": "ditterio",
    "rating": 9.0,
    "comment": "Rulebook: https://boardgamegeek.com/filepage/266714/duneimperium-upris...\n\nGreat euro with fun interaction!",
    "timestamp": 1761778800
  },
  {
    "username": "Raffaelo",
    "rating": 10.0,
    "comment": "Just great and as soon as you understand the rules it is even more fun",
    "timestamp": 1762470000
  },
  {
    "username": "alexdin95pay",
    "rating": 10.0,
    "comment": "great game",
    "timestamp": 1762383600
  },
  {
    "username": "A1ain",
    "rating": 10.0,
    "comment": "Preparación y Explicación: 0.7 / 1\nDuración Ideal: 1.6 / 2\nTemática y Arte: 1 / 1\nDiseño y Componentes: 0.8 / 1\nMecánica y Jugabilidad: 2 / 2\nDisfrute: 2.8 / 3\nTOTAL: 8.9\n\nTiempo de juego: 2.5 horas\nComplejidad: Media Alta\nRejugabilidad: Alta\nNúm. Jugadores Ideal: 3 y 4\n\n+Minis pintadas, Miniaturas, Tokens 3D, Micas y Guía",
    "timestamp": 1762297200
  },
  {
    "username": "arnwei",
    "rating": 10.0,
    "comment": "Sleeved + 3D Insert",
    "timestamp": 1762210800
  },
  {
    "username": "marek_orsulik",
    "rating": 10.0,
    "comment": "Base: 1648\nExp.: 1030\nAcc.: 690",
    "timestamp": 1761865200
  },
  {
    "username": "rywoods",
    "rating": 10.0,
    "comment": "I love the decision space and the gameplay arc of Dune Imperium (Uprising especially with its more flexible and cooler options).",
    "timestamp": 1761778800
  },
  {
    "username": "New_Zealand_Neil",
    "rating": 9.5,
    "comment": "\"The Hand of God be my witness, I am the Voice from the Outer World. I will lead you to Paradise!\" - Paul Maud'Dib Atreides\n\n\nLEADERS INCLUDED: (9)\n\n●○○○ Gurney Halleck (House Atreides)\n●○○○ Feyd-Rautha Harkonnen (House Harkonnen)\n●○○○ Lady Amber Metulli (House Metulli)\n●●○○ Lady Jessica / Reverend Mother Jessica (House Atreides)\n●○○○ Lady Margot Fenring (House Fenring)\n●○○○ Maud'Dib (House Atreides)\n●●○○ Princess Irulan (House Corrino)\n●●○○ Shaddam Corrino IV (House Corrino)\n●●●○ Staban Tuek",
    "timestamp": 1761692400
  },
  {
    "username": "timori",
    "rating": 10.0,
    "comment": "First impressions from a TTS playthrough... This felt clunky and pretty unfun to learn. Since Dune: Imperium - Uprising is a mishmash of worker placement, deck building and area majority, what happens is that you probably default to your old euro game habits. You end up being somewhat successful in one of those areas, but have nothing close to an engine that churns out points.\n\nSo the game ends and you think... that's it? The mechanics don't tie well into the theme. And despite eventually figuring out how to get resources, you don't have anything remotely resembling an engine that turns your goodies into points.\n\nBut then you keep thinking about it. Huh, considering you often need to play a worker to get some card draw, then it's actually reveal powers, not agent powers, that might matter more on the card. And is there a way for me to squeeze out 8 coins by the 2nd round so I can get my 3rd worker as early as my 2nd turn? And if I only need 10 points to win, then I can actually count exactly where I am going to get each of those 10 points from... And I didn't even touch any spys in my first playthrough-- but on second thought, they would have been real nice once everyone caught up to me and I went from being the only one interested in the worms space, to \"oh no, I'm last in turn order and am going to miss out on 3 points because of the newly revealed conflict\". So now I have to be hyper fixated on my opponent's resources rather than my own (and if you know me, that's the kind of player interaction I love). So maybe Dune: Imperium is less about engine building, but more about opportunity building. I have my resources, how do I get setup so I am ready for the points at any given moment?\n\nAnd now I can't stop thinking about this game. If you are the type to really dedicate putting time and thought into repeat plays with a similarly skilled group, this game could be great. It's not often I want to play a euro game for the competitive aspect. Usually I just want to play some simpler game with funny shenanigans.",
    "timestamp": 1761519600
  },
  {
    "username": "JGMTFreedom",
    "rating": 10.0,
    "comment": "Players: 2-4, 6",
    "timestamp": 1761519600
  },
  {
    "username": "Grayle27",
    "rating": 10.0,
    "comment": "Extremely strong - beautifully blends many different strategy options in ways that are enticing and clear to new players. Fulfills its promises of tricky \"plots within plots\" by allowing players to set up and execute fulfilling plans.",
    "timestamp": 1761519600
  }
]