[
  {
    "username": "Aurelian_Magnus",
    "rating": 1.0,
    "comment": "About as dry as a math class and almost as much fun.",
    "timestamp": 1754344800
  },
  {
    "username": "ubRtstcl",
    "rating": 1.0,
    "comment": "Players engage with the mechanisms but there is no game... This is a game for robots",
    "timestamp": 1749938400
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "Kind of okay, you can see the train-game influence if you squint enough. Hadn't played it in forever so I was surprised how fiddly the game is in some places (counting money), and how amazingly smooth it is in others (bidding and resources).",
    "timestamp": 1725400800
  },
  {
    "username": "dakotamassie",
    "rating": 1.0,
    "comment": "The most overrated game ever made, repetitive, slow, boring, too much math\nThis is my most hated game, and if i don't like it then you should agree with me",
    "timestamp": 1692741600
  },
  {
    "username": "geekasauras",
    "rating": 1.0,
    "comment": "I’ve tried to like this game and have played it a few times. People in my game circles love it. I just don’t enjoy it. There no game I hate more than this one. I’m an avid gamer, but this sucks all of the fun out of the room. It’s hard for me to focus on because it’s so boring.",
    "timestamp": 1691359200
  },
  {
    "username": "hugebison",
    "rating": 1.0,
    "comment": "I wish I could get the hours I wasted trying to enjoy this game back.",
    "timestamp": 1675724400
  },
  {
    "username": "Clwe",
    "rating": 1.0,
    "comment": "One of the first games I played besides Lost Cities/RFTG...and it probably helped cement my deep hatred of dull-looking, boringly-themed euro games. Screw the Boring Bastard Brigade that praise this game and all of it's wretched offspring! (Agricola, Caylus, Le Havre, Puerto Rico...)",
    "timestamp": 1674428400
  },
  {
    "username": "rubendijkstra",
    "rating": 1.0,
    "comment": "I have played this game 3 times. Every time the rules were not clear and we could not end the game because of that.",
    "timestamp": 1666389600
  },
  {
    "username": "eriksundberg",
    "rating": 1.0,
    "comment": "The incitaments between phases kill the game with the stall. Only pleasent with poor play.",
    "timestamp": 1649368800
  },
  {
    "username": "ujat",
    "rating": 1.0,
    "comment": "Can't rate this. Definitely not the kind of game i will play often!",
    "timestamp": 1604962800
  },
  {
    "username": "eagerbeaver",
    "rating": 1.0,
    "comment": "Classic, but there are just so many better games out there, there would be no reason for me to ever play this. Too light for the amount of time commitment required.\n\nWould have probably rated it a couple points higher, if not for the silly undeserved 10 ratings for this game.",
    "timestamp": 1557612000
  },
  {
    "username": "Frozen Flesh",
    "rating": 1.0,
    "comment": "I came here, because of all the people rating mature themed games like KD:M or Hate with a 1, just because of their mature theme.\nThis games theme is boring!",
    "timestamp": 1547074800
  },
  {
    "username": "NicCage4President",
    "rating": 1.0,
    "comment": "quite possibly the worst game ever made",
    "timestamp": 1541890800
  },
  {
    "username": "Conotar",
    "rating": 1.0,
    "comment": "The game was boring...overly long and not engaging at all.",
    "timestamp": 1519513200
  },
  {
    "username": "Callid",
    "rating": 1.0,
    "comment": "The last player to place down his first city is forced to either select his starting location for strategic balance between the other players, putting themselves at a significant disadvantage (which therefore few people will do), or place it as it is best for them, almost certainly leaving one other player with a huge advantage in the starting position.\n\nAny game where you can usually tell who is going to win with an 80% chance after the initial setup isn't really an interactive experience, and hardly qualifies as a game.",
    "timestamp": 1512428400
  },
  {
    "username": "Tall_Walt",
    "rating": 1.0,
    "comment": "Fiddly. The last turn overwhelms the rest of the game once you get the timing down, so zero staying power as a game. You may as well just deal some random power plants, give people a lot of money, and skip right to the pain of the last turn. Then endure the last turn.\n\nAdditionally, the game fails as a realistic simulation or an interesting playing experience for so many reasons. The fuel market has an unreasonable limit which can allow a player to king-make (or king-veto) when it is \"better\" to play towards his own interest. A poor player has too many opportunities to destroy other players' games. Far too many, \"Acceptable compromises for playability,\" lead to complete idiocy. Auctions are far too long a period of \"team counting\"--insipidness does not begin to insult this game as much as it should be insulted.\n\nI feel no success at winning; I feel no failure at losing. I feel a total waste of time. Worse: playing two-piece jigsaw puzzles for the same period would be a better use of time. Contemplating the lint in my navel would be a better use of time.\n\nI may actually loathe this game more than blah-blah-blah-magic-carrot, as difficult as this may be to believe: I'm having difficulty devising an adequate way of gaining pleasure from burning PG.",
    "timestamp": 1506463200
  },
  {
    "username": "Biscotti",
    "rating": 1.0,
    "comment": "Nothing wrong with game. I'm sure its a splendid affair. However after watching run through and or reading reviews, absolutely no desire to play.",
    "timestamp": 1481238000
  },
  {
    "username": "Ovaldo",
    "rating": 1.0,
    "comment": "So over-hyped - ugly feel",
    "timestamp": 1465423200
  },
  {
    "username": "natureslayer",
    "rating": 1.0,
    "comment": "Auctioning? Lots of basic math that take people a long time to do? A lot of analysis paralysis in the last 2 turns because people need to calculate exactly how much they need? No, thank you.",
    "timestamp": 1454281200
  },
  {
    "username": "Captain Murdercasket",
    "rating": 1.0,
    "comment": "For me personally, this game is dull as dishwater. I thought a game was supposed to have at least some element of fun? Nope. No amount of persuasion will ever result in me playing this game with anyone, not even strip Power Grid with Claudia Schiffer...although...no, not even then. Having said that I was introduced to this by a board game club who thought a 40 second explanation of the rules and then playing the game in total silence was a great way to introduce a potential new member to a game... Also the game was handed to a lesser player because another player thought it'd be fun to king make. Needless to say I haven't been back.",
    "timestamp": 1444687200
  },
  {
    "username": "muzfish4",
    "rating": 1.0,
    "comment": "Played it a few times - it's just not that exciting. Is it me?\n\nOne of the few games I have ever sold.",
    "timestamp": 1440540000
  },
  {
    "username": "Robrun",
    "rating": 1.0,
    "comment": "Brain-burningly dull. It might have just enough interest for 45-60 mins - but it lasts 120-150 mins! Why is this popular?",
    "timestamp": 1439071200
  },
  {
    "username": "AdmiralCrunch",
    "rating": 1.0,
    "comment": "Bought on trip to Kansas City -\n\n3/28/13 - Finally played. not that great.\n\nVery mathy. Each player on their turn has to make sure to have enough money to buy a power plant, raw materials, and a new city network, while at the same time trying to figure out the most efficient and economical way to do all three. This definetly favors those who are good with numbers.\n\nThere are also lot of ways to screw other people over. You can block people off from expanding their network, force them to overspend, or dump plants on the in the auction. Force them to overspend on resources.Frustrating for a game that will run over an hour to play.\n\nThe Board and the cards look great, but the money is terribly cheap and flimsy. All the other components are functional if lackluster, (the oil bits are annoying though. They're round and tend to roll everywhere.\n\nOverall, I could really take or leave this one. The only reason I have to hold onto it is because I got it in KC.\n\nGift",
    "timestamp": 1421535600
  },
  {
    "username": "lynx1998",
    "rating": 1.0,
    "comment": "Too long. Too boring. Too mathematically minded. Urgh! Soulless Euro.",
    "timestamp": 1390258800
  },
  {
    "username": "corkysru",
    "rating": 1.0,
    "comment": "Boring game. And the user Spleen made me rate it this low.",
    "timestamp": 1384815600
  },
  {
    "username": "Montblanka",
    "rating": 1.0,
    "comment": "Long, boring, simple. I had a napkin and a pen next to me, so after my third turn I did some literal napkin math and ended up winning. Didn't feel satisfying at all, and the game dragged on forever.",
    "timestamp": 1374789600
  },
  {
    "username": "jayjon",
    "rating": 1.0,
    "comment": "excruciatingly boring.",
    "timestamp": 1362092400
  },
  {
    "username": "Yargh",
    "rating": 1.0,
    "comment": "The game goes much too long with the early play doing little more than set the stage for later play and causing people who make a mistake to be out of the running but still forced to waste their time playing.",
    "timestamp": 1359241200
  },
  {
    "username": "willok",
    "rating": 1.0,
    "comment": "Bidding should be PART of a game, not ALL of it. And for three hours, no less. Balls.",
    "timestamp": 1348610400
  },
  {
    "username": "Silent Horizon",
    "rating": 1.0,
    "comment": "I rated this game a 1 primarily because I think it should be rated a 5 and it defies comprehension that this game is number 3 on the list.",
    "timestamp": 1263769200
  },
  {
    "username": "Soul_Turtle",
    "rating": 2.0,
    "comment": "Boring, mathy, no thanks. Where is the joy?",
    "timestamp": 1748469600
  },
  {
    "username": "Mushmo",
    "rating": 2.0,
    "comment": "Watch number go up the game. Very basic and super repetitive. Just hit 1x2 on the calculator for an hour and you can have the same experience. 2 points given for the fantastic automata included though. Econ is just not for me I think.",
    "timestamp": 1740351600
  },
  {
    "username": "Adam Szieberth",
    "rating": 2.0,
    "comment": "Being an economist, I appreciate that this game intends to simulate market mechanisms. However, it does that with a huge flaw. As an euro boardgame, the rules do their best to make everyone motivated by favoring the weak. But real economy does the opposite: the advantage is at the strongest. Based on our last game, it would be a lot better if the game would follow the real mechanisms which would push some players to work together against the leader. We played with four players and there was three rounds in step 2 without power plant purchase as all plants on the actual market were crap. Rules should at least discard one of them if all players pass. On itself, this would be not a problem as stagnation is a real economic situation. Anyway, we waited for the STEP-3 card badly. Finally, at the beginning of STEP 3 all players had about 250-350 Electros in pocket to buy anything available. But resources were not available. The leaders had no chance and the winner was the second last player. Could be the last one if we would play aggressively as he alone could buy almost all resources to block others' electricity production and built the necessary amount of houses to end the game instantly.",
    "timestamp": 1723068000
  },
  {
    "username": "Erik_G",
    "rating": 2.0,
    "comment": "Fast math and analysis paralysis: the game.",
    "timestamp": 1716588000
  },
  {
    "username": "Euroman",
    "rating": 2.0,
    "comment": "Unforgiving engine builder. Hate it!\nDull and monotonous and far too long.\nBeware of any game that has a catch-up mechanic.",
    "timestamp": 1707951600
  },
  {
    "username": "rickg15",
    "rating": 2.0,
    "comment": "Please, please don't ask me to play Power Grid. Seriously.",
    "timestamp": 1705964400
  },
  {
    "username": "asfhgwt",
    "rating": 2.0,
    "comment": "Too long, and I didn't enjoy getting blocked out (with no possible placement) just before \"phase 2.\" A little dry. Homegrown graphics and migraine-inducing board. Game heated up unexpectedly and ended suddenly.",
    "timestamp": 1696370400
  },
  {
    "username": "nconc",
    "rating": 2.0,
    "comment": "もうなんて言うかこのゲーム全体から醸し出す人工的な雰囲気がとにかく嫌悪感しか覚えない\nあの資源トラックとか、仕込まれた発電所の登場とか、あの気持ち悪いマップとか\nチューペットに味の素かけて頭に電極付けて味覚操作しているかのようなプレイ感がなんとも言えないです\n無理",
    "timestamp": 1694469600
  },
  {
    "username": "x3000gtx",
    "rating": 2.0,
    "comment": "Soooooo boring. Literally just doing math the whole game. I imagine people who are coming from Monopoly might enjoy this, but if you've played other heavy weight games this is a total snooze fest. The auction isn't fun and the game is so anti-climatic by phase 3 that you can do the math and figure out who will win before the end pretty much. Will definitely never play this again.",
    "timestamp": 1659477600
  },
  {
    "username": "PSouth",
    "rating": 2.0,
    "comment": "Very long, two big catch-up systems. Random who gets the best plants vs the end. Awful experience.",
    "timestamp": 1645138800
  },
  {
    "username": "nicksquatch",
    "rating": 2.0,
    "comment": "This game is ugly and nonsensical. It pushes laughably wrong environmental practices, and is basically a slog until someone obviously finishes the task in front of them.\n\nIt requires constant reference to a chart because nothing is intuitive, and the deck of cards needs to be reset in the proper order every time because nothing can be simple in the game.\n\nFor a game recommended as a replacement for Monopoly, and a game that is a \"classic\" I was exceedingly frustrated in all of my playthroughs of this thing.\n\nTicket to Ride and Settlers of Catan are far more enjoyable.",
    "timestamp": 1637362800
  },
  {
    "username": "JacobCStephens13",
    "rating": 2.0,
    "comment": "Power Grid: The New Power Plant Cards (2007)\nPower Grid: China/Korea (2008)\nPower Grid: France/Italy",
    "timestamp": 1637276400
  },
  {
    "username": "andrebr",
    "rating": 2.0,
    "comment": "-WEG\n120 Min 2–6 Players p2 p3 p4 p5 p6 Weight: 3.27 / 5",
    "timestamp": 1632002400
  },
  {
    "username": "Speedy_new",
    "rating": 2.0,
    "comment": "This game is so boring. But it could be used to help teaching basic math for kids.",
    "timestamp": 1626040800
  },
  {
    "username": "GaiaHero",
    "rating": 2.0,
    "comment": "Super boring not my cup of tea at all.",
    "timestamp": 1623967200
  },
  {
    "username": "toothygrim",
    "rating": 2.0,
    "comment": "It has some interesting mechanics, but the game drags and you spend too much time just evaluating the math of your situation. I like math, I was a math major, but just recalculating what you can afford to bid isn't fun to me. Those cool mechanics need to be put in a fun game rather than this yawn-fest.",
    "timestamp": 1591567200
  },
  {
    "username": "Hoodiini",
    "rating": 2.0,
    "comment": "Boggles my mind that this game is rated so high. May as well just roll a dice, see who gets the highest number, and save yourself 2 hours of pointless boredom.",
    "timestamp": 1555192800
  },
  {
    "username": "sunburn18",
    "rating": 2.0,
    "comment": "i liked the bidding aspect and maybe the first few turns but then it basically became about who can math the best..",
    "timestamp": 1547766000
  },
  {
    "username": "Derivatus",
    "rating": 2.0,
    "comment": "It is impressive that someone has succeeded in creating a game which is overly dry and at the same time utterly luck dependent. People are counting for every turn through the whole game, and it escalates in the last round when you are hitting yourself and just want the real pain to end. But it doesn't matter, since if anyone draws a good kraftwerk as the last player in a round nobody else will stand a chance.",
    "timestamp": 1544310000
  },
  {
    "username": "NoxMortem",
    "rating": 2.0,
    "comment": "Update 11.11.18 to 2: I really won't ever play this again.",
    "timestamp": 1541890800
  },
  {
    "username": "Glamdryn",
    "rating": 2.0,
    "comment": "Stolen from: http://boardgamegeek.com/geeklist/66085/real-games-of-genius\n\nToday, we salute you, Overly-condescending game player\n\n(Overly-condescending game player!)\n\nWe ask you to play and you say \"Sure, I could use a laugh\". Clearly your mountains of skill tower over us, but you let us marvel in your awesomeness.\n\n(You guys can play for second!)\n\nEven when things go bad for you, you're not afraid to let us know it was just luck. You tell us your only mistake was assuming we had a deeper understanding of the game. Clearly we witnessed a fluke.\n\n(Come on, what are the chances!)\n\nSo crack open an ice cold bud light, Master of the Game, because without you, we might develop the false impression we were good at something.\n\n(Overly-condescending game player!)\n\nSold in Make room for baby 2016 auction.",
    "timestamp": 1510873200
  },
  {
    "username": "apalmer225",
    "rating": 2.0,
    "comment": "I can’t comprehend why this game is rated so high. I have played it 3 or 4 times and the gameplay seems contrived. It takes “runaway leader avoidance” to an extreme. The board adds a isolated element of unnecessary complexity to the game. Throw out the board and repair the Rochester purchasing system and you might have a decent bidding system. Play Princes of Florence instead.",
    "timestamp": 1506463200
  },
  {
    "username": "bluepenguin",
    "rating": 2.0,
    "comment": "If I'm going to spend this many hours playing a game waiting and waiting on others to make their \"perfect\" strategy move, it had better be a much more interesting game.",
    "timestamp": 1499637600
  },
  {
    "username": "bigbenmeaige",
    "rating": 2.0,
    "comment": "I do not like the system that rewards players in the third phase for having played poorly by giving them first crack at the top power stations. The game gives incentive to mediocre play, and for me, that is not a rewarding gaming experience.",
    "timestamp": 1494453600
  },
  {
    "username": "guardianz",
    "rating": 2.0,
    "comment": "Pretty sucky. Imbalanced. Long. Annoying.",
    "timestamp": 1482966000
  },
  {
    "username": "rayzg",
    "rating": 2.0,
    "comment": "December 2015: I don't want to play this game again.\n\nJanuary 2015: Bought this game for my aunt because she requested a 4-6 player game that was \"strategic.\"\n\nWhat surprised me after not playing this after six years is how relatively light this game is compared to Euros of today!\n\nI played two 2-player games with my non-gamer aunt and cousin to teach them the rules. It went surprisingly smoothly! Now I think I'm more confident suggesting this game others new to Euro games!\n\nNow, to me Power Grid is just a card drafting game!\n\nUpgraded from 5 to 6.\n\n2009-04-28: I tried this game again with six players, the new deck of power plants, the expansion board that features The Netherlands, and alternate rules that shorten the game.\n\nI preferred this game over my last playing because the game did not drag at all.\n\nIt seems that the winner is the one who doesn't screw up rather than cleverly manipulating your opponents.\n\nWay of screwing up:\n* Paying way too much for a power plant\n* Choosing a part of the board too hotly contested\n* Ending up focusing on a commodity that everyone else wants.\n\nWhat I like:\n* The planning: It's a bit pathetic how I play this game. I require small bills so that I can group them into small piles representing each city I want to expand to, the commodities I want to buy, and my budget for my next power plant purchase.\n* The way which power plans of increasing power come into the game.\n\nWhat I don't like:\n* The game's interaction is a bit too subtle for me. It's difficult to directly attack people in the lead. It's risky to attempt to screw an opponent over in the commodity market because that means you'll have to compete directly in the same commodity, which is risky. And it's difficult to effectively block opponents on the board (but that might change depending on the board you pick, and which sections you choose to include in the game)\n* Personally, I don't like auction games very much.",
    "timestamp": 1449097200
  },
  {
    "username": "subomnik",
    "rating": 2.0,
    "comment": "I really dislike this game. So repetitive a with not many hard decisions to make",
    "timestamp": 1448751600
  },
  {
    "username": "megasycophant",
    "rating": 2.0,
    "comment": "As exciting as playing a spreadsheet.",
    "timestamp": 1430517600
  },
  {
    "username": "farmergiles",
    "rating": 2.0,
    "comment": "SOOOO much book-keeping which has to be constantly updated in your head, a boring auction system, no theme at all, and takes far too long. Most of the map never gets used unless you're playing with 6 players at which point the game drags for so long. I really hate this game.",
    "timestamp": 1404165600
  },
  {
    "username": "nkorppi",
    "rating": 2.0,
    "comment": "Optimising two digit sums is not a fun puzzle nor fun mathematics. Mechanics are fine, but the game is clearly designed for robots (who would easily solve the game and play perfectly). Turn order manipulation on the last two turns decides everything, so the rest is a waste of time. For fans of a dry and humorless time.",
    "timestamp": 1392678000
  },
  {
    "username": "SoloGamingDad",
    "rating": 3.0,
    "comment": "This feels like a wind up toy: set it in motion and just watch it go. At first it was interesting to ponder through spending enough money to grow, keeping enough money for the future. But very quickly you start to generate enough money each round that you're going to be fine, so any tension--and the most interest part of the game--just goes away. I'm sure it was a very interesting exercise for the designer to make but it would not be interesting to play a second time. Very amusing, like many amusement park rides on rails.",
    "timestamp": 1754690400
  },
  {
    "username": "khepriq",
    "rating": 3.0,
    "comment": "bad rulebook",
    "timestamp": 1751839200
  },
  {
    "username": "TForever",
    "rating": 3.0,
    "comment": "I enjoyed the last 2 games I played, but I feel like this game is already predetermined. If you know how to play, you already know what power plants are valuable. Finding the cheapest spot obviously helps this notion. I feel like there aren't that many things you can do to swing the game in your favor, and the game is very light.",
    "timestamp": 1744408800
  },
  {
    "username": "morrisdata",
    "rating": 3.0,
    "comment": "I will need to try this again someday to see if I like it. First few times playing it were not that fun, but like gin sometimes your tastes change.",
    "timestamp": 1713132000
  },
  {
    "username": "raitoning",
    "rating": 3.0,
    "comment": "Pretty dull in theme and gameplay - there's not enough to it to justify the tedious calculations and long game length",
    "timestamp": 1704495600
  },
  {
    "username": "Entropology",
    "rating": 3.0,
    "comment": "I understand that management of your turn order is a 'part' of the game, still just feels bleh to have to limit yourself on purpose just to not have the game limit you harder.\n\n[Edit]: Played this again for the first time in a decade. The turn order is still a fatal flaw. The game was decided because of the random flip of a 41 power plant followed by a 40. Second person continued to go last and snowballed to victory easily.",
    "timestamp": 1700434800
  },
  {
    "username": "zerratt90",
    "rating": 3.0,
    "comment": "Didn't like the design, mechanics. Action was Ok, resource cost change was Ok.",
    "timestamp": 1697666400
  },
  {
    "username": "duodora",
    "rating": 3.0,
    "comment": "I just...do not enjoy this game. I tend not to like energy/power themes, and dread the kingmaking/blocking one-two punch in this game.",
    "timestamp": 1694642400
  },
  {
    "username": "naclsweet",
    "rating": 3.0,
    "comment": "Used to be a favorite but last time the lack of good power plants was very limiting and I wondered why I ever liked it.",
    "timestamp": 1694296800
  },
  {
    "username": "mknzm",
    "rating": 3.0,
    "comment": "Beautifully designed and thematically coherent. If you love counting numbers, this game is for you! For the rest of us however the world is full of better options.",
    "timestamp": 1680040800
  },
  {
    "username": "iber",
    "rating": 3.0,
    "comment": "It’s too easy for somebody to be left out.",
    "timestamp": 1679007600
  },
  {
    "username": "kraedy",
    "rating": 3.0,
    "comment": "I have never seen an early leader lose this game. Feels like the winner is decided 5-10 minutes into the game, and then it takes 1-2 hours before the game ends.",
    "timestamp": 1674342000
  },
  {
    "username": "Mockerre",
    "rating": 3.0,
    "comment": "My nemesis - the game with such an exaggerated leader-bashing mechanism that I can't bear myself to play it.",
    "timestamp": 1671490800
  },
  {
    "username": "Bilb",
    "rating": 3.0,
    "comment": "Analysis paralysis seems actively invited by this game's mechanics. Double the play time if you're with anyone likely to fall into that trap",
    "timestamp": 1667775600
  },
  {
    "username": "Sildric Stormwind",
    "rating": 3.0,
    "comment": "Power Grid is another one of those games that in my opinion is too simple for what it is. There is a solid game mechanic that is flavored well, but when it comes down to it all it's just math. As a guy who has a degree in math this gets boring really fast. Within two games of Power Grid I was done with it. I see why people like it, but it just does not appeal to me as much as it does them I suppose.",
    "timestamp": 1648504800
  },
  {
    "username": "finke67",
    "rating": 3.0,
    "comment": "After one game I don't understand what all the fuss is about. Too heavy handed on catch-up mechanism. I felt like there was no way to pull ahead of the pack. Almost as if I played willy-nilly I would still only be 2 or 3 points back of the leader.",
    "timestamp": 1628287200
  },
  {
    "username": "Norman1nz",
    "rating": 3.0,
    "comment": "Once a player starts getting ahead it's hard to stop them from winning so becomes a drag for everyone else",
    "timestamp": 1601503200
  },
  {
    "username": "marcelogno",
    "rating": 3.0,
    "comment": "Boring game...",
    "timestamp": 1591567200
  },
  {
    "username": "BurnBabyBurn",
    "rating": 3.0,
    "comment": "I just dont like this game, its just to mathy.",
    "timestamp": 1588456800
  },
  {
    "username": "SCOBYBryant",
    "rating": 3.0,
    "comment": "{ P - 3 [4] [5] 6 }\n\nGoldilocks: The Board Game. It seems like once every blue moon I play the game Power Grid was intended to be, where nobody gouges the supply/demand economy (increasing the price for everyone reliant on the resource) but remains at the bottom of the lineup, and the map doesn't produce overcrowding at the start - effectively eliminating those players - while allowing backyard properties for others (prefer France, U.S. with Brown/Yellow/Red/Green, Benelux, mostly hate the rest), and some crap pull doesn't stagnate the power plant market, usually trash plants or low plants after a glut of high ones - and players sit around with little to do. (Especially bad if someone lucks into a 5-6 THEN the crap hits, more or less giving the game away.) Even the instances where those three elements coincide still seem problematic. Every game I can remember has always had a must-gamble-to-win situation; because players are always aiming for the best/highest plants, low ones accumulate near the bottom and sooner or later every replacement is gambling. There's also a fiddly dilemma where players are required to \"know their roles\" in order to play a good game, and if someone doesn't realize he or she should be the person pushing the enevelope when it comes to city expansion the game can balk while waiting for Stage 2. (Many times, nobody wants to actually trigger Stage 2 for fear of getting blocked in, and as money accumulates this fear only worsens.) Still probably the best gateway game ever, unless you think Settlers and Carcassonne actually qualify as games.",
    "timestamp": 1581894000
  },
  {
    "username": "fangorrn",
    "rating": 3.0,
    "comment": "Just a boring optimization task.",
    "timestamp": 1579993200
  },
  {
    "username": "benjaminehlers1",
    "rating": 3.0,
    "comment": "Blegh, tried playing one time and didn't even make it through one game. Not a game for me, whatsoever...",
    "timestamp": 1578524400
  },
  {
    "username": "Tamae",
    "rating": 3.0,
    "comment": "Borrowed",
    "timestamp": 1574982000
  },
  {
    "username": "shizzane",
    "rating": 3.0,
    "comment": "Not a terrible game, but not a great game either. Of the few times I've played it, my feelings of Power Grid were:\n\n1st - Interesting game. Could be fun. A little drawn out in the middle.\n\n2nd - Okay game. The game seems to slow down too much during play.\n\n3rd - Good God this game takes forever. And I lost by not being able to buy ONE barrel! The first 2 players bought extra to block me and even though I had the most $$ I'm stuck. There should be a reserve rule. Seems like bad game design to have all of those unused barrels sitting in the reserve if you can't buy them. Even if you had to pay $20+ or a penalty it would make more sense. Talk about a horrible way to lose the game. KINGMAKER GAMES SUCK! Can you tell I'm bitter?\n\n4th - How did I get talked into playing this again? I'm still bitter from the last game.",
    "timestamp": 1554069600
  },
  {
    "username": "Cschiewetz",
    "rating": 3.0,
    "comment": "Owned this one for a while and still haven't played more than once, found the mechanics quite dense and confusing",
    "timestamp": 1552518000
  },
  {
    "username": "mgreen02",
    "rating": 3.0,
    "comment": "Well worth playing a few times, but it's dry and the auctions can be a large proportion of the game on some boards.",
    "timestamp": 1552345200
  },
  {
    "username": "benshever",
    "rating": 3.0,
    "comment": "WAY overrated auction game. Too much rides on initial placements of houses and deciding which direction to expand offers virtually no decision making (Just find the cheapest neighboring route). If power grid came out today it would be quickly forgotten.",
    "timestamp": 1551740400
  },
  {
    "username": "atalie",
    "rating": 3.0,
    "comment": "Too much brute force math to optimize paths which isn't fun to me. Tough to not fall into slow turns from several moves ahead. Probably gets better with more play-throughs after becoming more familiar with the board.",
    "timestamp": 1545865200
  },
  {
    "username": "SaittaMicus",
    "rating": 3.0,
    "comment": "The low score is very unfair, but I have my reasons!\n\nThis mostly involve people decieding to ruin the game for me rather than actually play it.",
    "timestamp": 1539036000
  },
  {
    "username": "Nole747",
    "rating": 3.0,
    "comment": "Laborious and too much dependency on a single mechanic to win",
    "timestamp": 1533679200
  },
  {
    "username": "JalexBroth",
    "rating": 4.0,
    "comment": "Played twice at 2 player. I bought purely based on rating and theme as I develop power electronics for a living. This was just not fun for me. After two plays, my girlfriend and I agreed we would rather play any other game we own than this. I will try 1 more time at a larger party size but I'm not really excited for it.",
    "timestamp": 1746223200
  },
  {
    "username": "L__B_____",
    "rating": 4.0,
    "comment": "Very unbalanced",
    "timestamp": 1745532000
  },
  {
    "username": "ccederlof",
    "rating": 4.0,
    "comment": "Runaway leader problem and feels like I'm just running a logic script.\nThere's not enough randomness and I find I can accurately predict the winner early into the game. Hence, these issues makes it a game I don't seek to play, but I will play if others want to.",
    "timestamp": 1738364400
  },
  {
    "username": "repear",
    "rating": 4.0,
    "comment": "4 - Could be talked into it on occasion.\n\nHomework - The Board Game",
    "timestamp": 1736031600
  },
  {
    "username": "BoardGamingCouple",
    "rating": 4.0,
    "comment": "4/5\n\nPower Grid is a fun game that for us replace Monopoly. It is easy to learn rules wise and feels like the next step up from Monopoly. It is also the next step up from Ticket to Ride. The auction mechanisms here work so much better, the economics work well, and there is more player interaction, with less randomness. This a good game that will most likely become a modern classic, but we feel Ticket to Ride & Concordia are both better.\n\nthe expansions add some fun cool new boards and unique aspects. The new deck of power plants is really solid and the tax promo gives monopoly vibes.",
    "timestamp": 1735254000
  },
  {
    "username": "aaj94",
    "rating": 4.0,
    "comment": "I've played Power Grid once before, but it was not my copy and I only vaguely remember it. I found it quite mathy, though interesting, and didn't particularly want to play again. Would like to revisit it from the perspective of someone who's now played many more games.\n\nOct '20: Rated 5\nDec '24: Rated 4",
    "timestamp": 1734562800
  },
  {
    "username": "tolhs",
    "rating": 3.5,
    "comment": "2024:+1",
    "timestamp": 1733958000
  },
  {
    "username": "b4b8",
    "rating": 4.0,
    "comment": "Similar to Agricola, everyone seems to plan/battle for the last turn where they can grab nuclear. Dislike this style of game play",
    "timestamp": 1722722400
  },
  {
    "username": "MissP1ggy",
    "rating": 4.0,
    "comment": "Sold\nA bit long and complex, didn’t like the auction aspect, because it can create a run away leader and makes you sit out the long game.",
    "timestamp": 1722549600
  },
  {
    "username": "Chaliz",
    "rating": 4.0,
    "comment": "Excel sheet with auctions",
    "timestamp": 1721685600
  },
  {
    "username": "joelee",
    "rating": 4.0,
    "comment": "My rating is for Power Grid. It's nice that the fixed routes exist in this game since it seems that Funkenschlag bogs down while each player is counting out routes in order to find the cheapest one. PG simplifies that and in a good way. A good economic game that can be played in 2 hours.\n\nUpdate: I'm done with this one. I've really come to hate the stall that happens with players as you get further into to game. I feel that with experienced players the winner is going to be determined by the way the power plants come up and who gets the most \"keeper\" plants at or slightly above cost.",
    "timestamp": 1718402400
  },
  {
    "username": "MachineEpsilon",
    "rating": 4.0,
    "comment": "Auctioning, money management, network expansion",
    "timestamp": 1718316000
  },
  {
    "username": "mcrstar",
    "rating": 4.0,
    "comment": "Понравился выкуп ресурсов, но с торгами пока не донца понятен кайф (играли вдвоём, их там мало). Вроде ничего так игра, но не понимаю почему у неё такая высокая оценка. Тот же Гавр мне нравится намного больше. В итоге продал, потому что каждый раз, когда кидал взгляд на коробку, — становилось очень скучно.",
    "timestamp": 1709852400
  },
  {
    "username": "Taateli",
    "rating": 4.0,
    "comment": "Great mechanics but the theme is too boring to inspire to play.",
    "timestamp": 1703890800
  },
  {
    "username": "staressent",
    "rating": 4.0,
    "comment": "It's not awful, but it's a pretty boring game in my opinion. I recall it being long and tedious.",
    "timestamp": 1702335600
  },
  {
    "username": "arma666",
    "rating": 4.0,
    "comment": "It seems good. It ends with only two players still in play to win from about the middle of the game.\nI'm subjective because I don't like bidding so much.\nI gave it 5 because it still has an interesting gameplay, bidding aside.",
    "timestamp": 1700953200
  },
  {
    "username": "tracylin",
    "rating": 4.0,
    "comment": "競標發電廠，再購買能源，接著設置變電所，讓自己能發揮最大的能源效益以賺取收入。過程中須不斷計算手中經費是否足夠，來判斷接下來的計畫該如何執行，是個需要計算能力、頭腦清晰的遊戲。",
    "timestamp": 1700348400
  },
  {
    "username": "Thane13",
    "rating": 4.0,
    "comment": "Just pick the player at the table who's best at math, declare them the winner, then play something fun.",
    "timestamp": 1699570800
  },
  {
    "username": "Desigual",
    "rating": 4.0,
    "comment": "Could easily replace the monopoly of people's homes. They are clearly different games but with a slightly similar presentation. Easy to play and nice gameplay. I will certainly play more often.",
    "timestamp": 1697839200
  },
  {
    "username": "SleeveMcDichael",
    "rating": 4.0,
    "comment": "Economic game with heavy focus on math. Certainly not for everyone, but anybody that enjoys squeaking efficiency out of a system will like this game. Factories are balanced in such a way that which ones will be valuable vary from game to game, depending on which factories other players take. If you get a factory or two that uses resources nobody else is competing for, you can save a lot of money. Others will then, in turn, begin to buy into factories which use that resource, and so other factories will become more efficient as they get rid of their old ones. This creates a constantly changing economy in the game, shifting around other players' decisions. As such, this \"economy\" will be different every time you play the game.\n\nMy problem with this game: on the european board, germany has lots of cheap connections that are extremely valuable. I believe this is supposed to be balanced because it's in the middle of the board, and thus others should be expanding in on you from all sides, but even at full player count you don't use the full board. Because of this, if germany is ever made to be in the corner, whoever starts there, assuming they play well, will win. This can be combatted by ensuring germany is never in the corner. Still, it seems an odd choice to balance the board as if the entire thing will be in use all at once, given that such a situation is impossible. Even at a full 6 players, you only use 5 out of the 7 zones on the board.",
    "timestamp": 1697148000
  },
  {
    "username": "juuzzom",
    "rating": 4.0,
    "comment": "At first glance this seemed to be a game where whoever able to put his or her stuff on the board fastest wins. However, we soon discovered that a high level of tactical skill is needed which is typical for train games. Everything works smoothly and nerve control is important. All of the good things come unfortunately crashing down because turtling is the only way to play. Yellow vs. wooden houses are a slight minus in darker lighting. There's also way too much downtime included while others are doing the math considering what you get out of this. Therefore the process of the game isn't fun.",
    "timestamp": 1691964000
  },
  {
    "username": "Misiodziej",
    "rating": 4.0,
    "comment": "Bw:4,5",
    "timestamp": 1689717600
  },
  {
    "username": "HowitzerBug",
    "rating": 4.0,
    "comment": "I did enjoy this game quite a lot. Balancing your plants with the power needed and the fuel you can get was a fun challenge. The auctions are good depending on the group you are playing with (as auctions often are). As the game progressed it became a bit too mathy for me (I had to get out a pen and paper) which really slowed the pace of the game, and put me off somewhat.",
    "timestamp": 1676415600
  },
  {
    "username": "Dr_Relato",
    "rating": 4.0,
    "comment": "Я не знал, что я покупал, когда брал эту коробку. Да, прикольная механика. Да, классная ротация денег. Да, аукцион и споры. Но как-то пресно. Не моё.",
    "timestamp": 1675983600
  },
  {
    "username": "phsyrik",
    "rating": 3.5,
    "comment": "I really just dont enjoy this game, however my friends all love it. I won't downright refuse to play, but I strongly try to avoid it on game nights.",
    "timestamp": 1673391600
  },
  {
    "username": "hi1hi1hi1hi1",
    "rating": 4.0,
    "comment": "Count money to bid on power plants. Count money to buy resources. Count money to light cities.\nPlayed in: 2022",
    "timestamp": 1672700400
  },
  {
    "username": "eadred",
    "rating": 4.0,
    "comment": "The game is fair but very dry. Much better if you use poker chips rather than paper money.",
    "timestamp": 1669849200
  },
  {
    "username": "Victoria_hermit",
    "rating": 4.0,
    "comment": "This is a much better game than what I've rated it for, but it is math heavy which is a massive turn off for me. Not very interested in playing this even if someone else is scoring for me.",
    "timestamp": 1667602800
  },
  {
    "username": "flawed",
    "rating": 4.0,
    "comment": "When I lose this game, I feel like it’s because I made a simple arithmetic mistake. That feels more like work than fun",
    "timestamp": 1663538400
  },
  {
    "username": "LUDACHRl5",
    "rating": 4.0,
    "comment": "Ticket to Ride/ Monopoly had a baby.",
    "timestamp": 1663538400
  },
  {
    "username": "dtmoney75",
    "rating": 5.0,
    "comment": "1 Play\n\nPlayed at: 5",
    "timestamp": 1761692400
  },
  {
    "username": "kataclysm",
    "rating": 5.0,
    "comment": "I like improving my power plants most. The connecting cities part is meh.\n\n(Lost in the fire)",
    "timestamp": 1761519600
  },
  {
    "username": "Fevin",
    "rating": 4.6,
    "comment": "J'ai rien contre les jeux calculatoires. Le thème est bien retranscrit mzid lr mzyo minable. Mais ça ne prend pas vraiment. Pas assez de soufle épique, des calculs monodimensionel plus comptables que de réels choix.\n\nCe n'est pas nul; juste pas réjouissant à jouer.\n\n2e, 3e, 4e et 5epartie : confirmé en pire. Strictement calculatoire mais avec une certaine élégance.",
    "timestamp": 1760392800
  },
  {
    "username": "alfonzo54",
    "rating": 5.0,
    "comment": "Power Grid seems like a game I should really like, and I initally did, but I cooled on it quite a bit after a few plays. I think other games have better auctions and better route building, and the novelty of the resource mechanism isn't enough to make up for that.\n\nI also find the regional imbalances to be annoying rather than interesting, and the removal of regions based on player count, which the rules provide no guidance on, to be intensely awkward.",
    "timestamp": 1755208800
  },
  {
    "username": "zasizo",
    "rating": 5.0,
    "comment": "A téma és a mechanizmus tökéletes összhangja jellemzi, teljesen logikus a játékbeli fejlesztés iránya, ahogy egyre modernebb erőművekre váltunk a játék során.\nBizonyára ezért van ennyire túlértékelve, pedig ez a tematikusság egyben a játék hátránya is: mert csak egy-két út vezet győzelemhez, amitől a motorépítésnek hála a végjáték már elég unalmas és mechanikus.\nMi csak két fővel játszottuk, így a licitálás izgalma valószínűleg nem volt az igazi, és erősebb élménynek bizonyult a kiszámítható törvényszerűség, mint a szabad döntések érzete. Az, hogy az erőműhálózat építése vizuálisan nem különösebben szemet gyönyörködtető, minket önmagában nem befolyásolt.\nA hangsúlyos engine building mechanizmus viszont nem a kedvencem, mert azzal jár, hogy az elején hozz jó döntéseket számottevő pozitív visszacsatolás nélkül, mert csak a végjátékra fizetődik ki a befektetett energia, akkor meg már csak a hatásokat nézed minimális döntési lehetőséggel. Ezáltal pedig maga a mechanika a játék elején és végén egyaránt megfoszt egy-egy fontos élménytől.\nA döntések és hatásaik kiegyenlítettebb viszonyrendszere talán jobb játékélményt adna, de a hangsúlyos motorépítés itt tényleg nagyon jól illik a témához, csak ettől még nem lesz szerethető.\nSzámunkra a vége felé ezért túl egyértelművé és mechanikussá válik a játék, a motorépítés miatt pedig önműködő jelleggel uralja el a végjátékot. Több fővel biztosan nem ennyire unalmas, mint két fővel, de ketten rendkívül unalmas és felejthető játék .",
    "timestamp": 1753221600
  },
  {
    "username": "boardgamegirlpaints",
    "rating": 5.0,
    "comment": "This took a bit to learn, then was not played for the longest time so our group had to relearn it. Never really went over well enough to want to keep.",
    "timestamp": 1752703200
  },
  {
    "username": "peteg1001",
    "rating": 5.0,
    "comment": "Great idea, but too complicated for me (I work in the electricity industry). Definitely min 12 years old\n\n\nUpdate SOLD",
    "timestamp": 1752444000
  },
  {
    "username": "PCSADavis",
    "rating": 5.0,
    "comment": "My daughter really liked this game and introduced it to the rest of the family. We tried playing it, but never completed the game. The rest of us did not care for it. It is too long. The reason I do not like it is because it penalizes the one who is winning in an attempt to equalize the game, so strategy goes out the window; no one ever takes and keeps a lead; it will just be a crapshoot as to who wins a very close game at the end.",
    "timestamp": 1752098400
  },
  {
    "username": "Mueckerling",
    "rating": 5.0,
    "comment": "If you're horny for math, come enjoy Power Grid! I respect the design, but the game is not that much on the fun side of things. Most of the time you are calculating. You are calculating A LOT! The auctions, the thing that would make this game the most interactive, are practically non-existent. It mostly feels forced to buy a power plant and you usually buy it for a price close to the minimum bid anyway. The moment you could have some sweet blocking interaction on the map, new building spots become available and it doesn't matter anymore. The thing which matters the most on the other hand is turn order, but not in an interesting way, where you have different benefits for going first or last, no. Turn order in Power Grid is a simple catch up mechanism where going last is always better (cheapest) and going first always sucks (most expensive). So what this game actually motivates is a competition for the last turn order slot.",
    "timestamp": 1747087200
  },
  {
    "username": "Ghost CoD",
    "rating": 5.0,
    "comment": "I guess that was amazing back in the days when it was published... When I played it, there were lots of better euros, and better alternatives. I didn't have any fun despite winning.",
    "timestamp": 1746741600
  },
  {
    "username": "Laslow",
    "rating": 5.0,
    "comment": "A tábla elég szép, a szabályok pedig nem túl bonyolultak: már az első játék is élvezhető ha akad aki ügyesen el tudja magyarázni a lényeget. A játékban a fizetőeszköz gyakorlatilag írólapra nyomtatott papírpénz, ami roppant sérülékenynek tűnik, ez nem tetszett.\nA játék témája nem fogott meg (erőműveket vásárolni és hozzájuk fűtőelemeket, majd a megtermelt árammal ellátni a településeket, és beszedni a szolgáltatott áram árát, amiből újabb erőműveket lehet építeni és újabb településeken elkezdeni az áramszolgáltatást). A játékosok cselekedetei elég nagy hatással vannak egymásra, de nem lehetetlenítik el egymás játékát. Megfelelő mennyiségű és nehézségű választási lehetőség elé állítja a soron lévő játékost: nem egyértelmű, hogy mikor épp mi lenne a leghelyesebb lépés (azaz a játékos nem csak statiszta szerepet tölt be), de nem is kell perceken keresztül gondolkozni a kiválasztásán (azaz nem várakoztatja sokáig a többi játékost). A kelleténél szerintem többet kell benne számolgatni.\nNem tetszik benne, hogy a játéktáblán az ország bizonyos megyéit le kell takarni ha nem maximális számú játékos játssza. Folyton megtévesztett, mert a piacon lévő erőmű-lapokkal takartuk le a nem használt térképrészleteket, ami nem tökéletesen takar és emiatt többször is olyan városokon kezdtem el gondolkozni, amik épp nincsenek is játékban, valamint zavaró az is, hogy az erőművek alatt egy zsúfolt térkép van háttérként.\n\nSzóval így elsőre: könnyen elsajátítható kiegyensúlyozott játék kicsit száraz témával és sok számolgatással.",
    "timestamp": 1741906800
  },
  {
    "username": "Moneycopy",
    "rating": 5.0,
    "comment": "Deep. Hard to gather 4-5 geeks in real life.",
    "timestamp": 1741561200
  },
  {
    "username": "tbrofromspace",
    "rating": 5.0,
    "comment": "more like poop grid, amirite?\n\n---\n\nI just never want to actually play this, the idea of it is better than the reality of just doing a number search paired with boring arithmetic",
    "timestamp": 1741215600
  },
  {
    "username": "Jamesmcm84",
    "rating": 5.0,
    "comment": "Best with 3 or more.\n\nNEED TO PLAY AGAIN",
    "timestamp": 1741129200
  },
  {
    "username": "Col Hogan",
    "rating": 4.5,
    "comment": "Too repetitive",
    "timestamp": 1739574000
  },
  {
    "username": "Faguss",
    "rating": 5.0,
    "comment": "I enjoy buying power plants, buying fuel and powering up cities. However, spend too much money in an auction early on and you're out of the competition. As it progresses two players will come up on the head of the race and the game will be decided between them. Others are just wasting air. Constantly recalculating house prices is tiresome. One region is clearly better than others and whoever starts there will probably win.\n\nEdit: raised score because it plays better with fewer players.",
    "timestamp": 1739574000
  },
  {
    "username": "Inconmon",
    "rating": 5.0,
    "comment": "Very boring, probably more exciting for people that find basic math challenging.",
    "timestamp": 1738710000
  },
  {
    "username": "EllikTheren",
    "rating": 5.0,
    "comment": "Really fun economic game.",
    "timestamp": 1738623600
  },
  {
    "username": "dopebones",
    "rating": 5.0,
    "comment": "When I finally got to play a real game of this I was very surprised by the heavy area control aspect of the game, and also surprised that even though there is money and an energy market it didn't seem like much of an economic game, especially since the winning condition isn't most money. The rules were a bit difficult at times and the gameplay occasionally inelegant, yet till it felt distantly similar (same universe different galaxies) as Winsomes, Splotters, and 18xx.",
    "timestamp": 1734908400
  },
  {
    "username": "Zeusman",
    "rating": 5.0,
    "comment": "Non-Library Copy",
    "timestamp": 1732230000
  },
  {
    "username": "Scifi66",
    "rating": 5.0,
    "comment": "The real problem is the weird meta play of manipulating turn order and the game can literally be all about that. But otherwise lots to like!",
    "timestamp": 1729807200
  },
  {
    "username": "Geoboffin",
    "rating": 5.0,
    "comment": "OH GOD NOT MORE BLOODY PROJECT MANAGEMENT.",
    "timestamp": 1729720800
  },
  {
    "username": "kareds",
    "rating": 5.0,
    "comment": "The rules are a tad opaque to start off, but it flows very nicely once you get the hang of it. What makes this game special is how your personal bank is constantly skyrocketing and crashing like a sine wave -- this game absolutely nails its core gameplay loop.\n\nThere is something so satisfying about running your power plants and raking in tons of cash, only to see it all disappear minutes later, and then make even more, and then disappear, and then...\n\nI have a feeling that I would play it a lot more if it were a bit shorter.\n\nEdit: Age of Steam killed most of my desire to play this.\n\nEdit 2: More and more I find this pretty uninteresting. What I said above still stands, but my tastes have diverged enough that I no longer find those qualities as desirable. Power Grid plays out much the same way each game, and is more a game about not messing up than one about making your own victory.",
    "timestamp": 1727647200
  },
  {
    "username": "CorumCoram",
    "rating": 5.0,
    "comment": "Not an auction fan and this kind of clinches that",
    "timestamp": 1726696800
  },
  {
    "username": "MrOrient",
    "rating": 5.0,
    "comment": "It's been a while when I played it the last time but I'm happy for the next opportunity.",
    "timestamp": 1725919200
  },
  {
    "username": "candoo",
    "rating": 5.0,
    "comment": "I like the original theme. It's generally a good game.\n\nThe rules are poorly laid out and the info is not easily accessible. Some finickiness to the rules.\n\nThe end game can get very mathy.\n\nThe boards are dull and unattractive.\n\nSome stalemating, as players don't want to take the lead and jockey for positions or no body wants to initiate Step 2. Also not liking the mathy ending when some players ask for a calculator. And in general, I don't like punish the leader mechanisms.\n\nUpdate from July 2008 to May 2012: 7.5 -> 8.0\nDespite the above concerns, I'm appreciating this game more after several plays.\n\nJune 29, 2012. Germany is a 7.5. The game dragged.\n\nUpdate Aug 2024\nDropped to 5\nFirst play in 11 yrs and our group won’t be revisiting this in the future again.\nThe random luck of which power plants come up can be deterministic.\nSnowball economics make the rich get richer.\nFeh.",
    "timestamp": 1723327200
  },
  {
    "username": "Ambriel",
    "rating": 5.0,
    "comment": "Quite good. Very highly regarded by many and the decisions on which power plants to invest in are interesting and well designed. I enjoyed playing it but for me it lacks an engaging theme and the reliance on having to do quite a bit of basic math to play this well reduces the fun and flow of the game.",
    "timestamp": 1722204000
  },
  {
    "username": "Pekuis",
    "rating": 5.0,
    "comment": "Jun 2021: 7\nJul 2024: 5",
    "timestamp": 1721685600
  },
  {
    "username": "Bal_505",
    "rating": 5.0,
    "comment": "I remember it being decent.",
    "timestamp": 1719698400
  },
  {
    "username": "DannySteve47",
    "rating": 5.0,
    "comment": "6/25/24 - Played only one time waayyyy back, maybe 2015. Not a very fun game from what I recall. Giving it a 5 rating right now. May give it another shot someday as so many others love it.",
    "timestamp": 1719266400
  },
  {
    "username": "properplay",
    "rating": 5.0,
    "comment": "Great resource/economic management game with networking building elements. Bought it mainly because I got a really sweet deal on the Portuguese version for 25€ with shipping cost included. My only criticism regarding the game is that I don't find the way you expand your cities to be much relevant (give or take 5 elektros here and there) since you end up having to occupy most of the spaces available on the board. Also I've had a couple of games with lots of dead rounds mid game where none of the plants mattered to anyone which caused everyone to just hoard up on money until decent plants came along or we hit phase 3. Those dead rounds when they happen are enough to kill the game and make it feel like a chore.",
    "timestamp": 1713564000
  },
  {
    "username": "Felipe71",
    "rating": 5.0,
    "comment": "Ticket to ride with power plants. And counting. It even has the collection of expansions focused on different maps with nothing innovative just like TTR.",
    "timestamp": 1710802800
  },
  {
    "username": "hnrklssn",
    "rating": 5.0,
    "comment": "Easily turns into a spreadsheet simulator",
    "timestamp": 1710025200
  },
  {
    "username": "Nexoult",
    "rating": 5.0,
    "comment": "Tuve una mala experiencia y no he vuelto a jugar, quizas en el futuro dandole otra oportunidad cambie mi opinion",
    "timestamp": 1706396400
  },
  {
    "username": "Bechara",
    "rating": 5.0,
    "comment": "I am on the fence with this one, bidding and resource purchasing are great but the area control and development feels rather lacking",
    "timestamp": 1703286000
  },
  {
    "username": "marriedcouple",
    "rating": 5.0,
    "comment": "Not my favorite game. Long but dull.",
    "timestamp": 1702854000
  },
  {
    "username": "JoshuaStarr",
    "rating": 5.0,
    "comment": "A good game that usually is just not good enough to see play. Even ignoring the issues I have with the power plant auction, most of the map and turn order tension is better-handled in Age of Steam. Given the similar game length, Age of Steam will typically be picked.",
    "timestamp": 1700262000
  },
  {
    "username": "pridurki",
    "rating": 5.0,
    "comment": "this game is well designed, but it is very straightforward. you don't do a lot or make many interesting decisions imo. i like ra better.",
    "timestamp": 1700175600
  },
  {
    "username": "ApeChild",
    "rating": 5.0,
    "comment": "I didn’t play it much. I've enjoyed it, but then have found over time that the auctioning of plants isnt as often contested as I'd like, the catch up mechanics don't really change the outcome of the game, and the game is a bit bland. The leaders tend to lead until they win.",
    "timestamp": 1699225200
  },
  {
    "username": "Sh0rtz",
    "rating": 5.0,
    "comment": "Decent strategic game. Slightly old school, but still fun. It has a bidding component, which you have to enjoy.",
    "timestamp": 1696629600
  },
  {
    "username": "Lowengrin",
    "rating": 5.0,
    "comment": "Great intertwining of mechanics, but I just find it dull.",
    "timestamp": 1693519200
  },
  {
    "username": "rbrunen",
    "rating": 5.0,
    "comment": "Calculator in hand and go adding points every two by three. It's not a bad game but it's not for me.",
    "timestamp": 1691704800
  },
  {
    "username": "KingofLions",
    "rating": 5.0,
    "comment": "I had and sold this game for years... but only recently played it for the first time in 2019. I enjoy it a lot, but can't get my wife to play it again. It's not her favorite.",
    "timestamp": 1691100000
  },
  {
    "username": "Olafslomp",
    "rating": 5.0,
    "comment": "I still don’t understand what my wife likes about it (she says she can’t explain either, sorry!), but I guess this is staying in our collection.\nIt doesn’t get played a lot (it took me a LONG time to get to ten plays), but I’ll never say no when she asks to play it.",
    "timestamp": 1689631200
  },
  {
    "username": "unluckyprimes",
    "rating": 5.0,
    "comment": "FallCon",
    "timestamp": 1688853600
  },
  {
    "username": "vip_chicken",
    "rating": 5.0,
    "comment": "Dank.",
    "timestamp": 1678057200
  },
  {
    "username": "papergames",
    "rating": 5.0,
    "comment": "Some of the mechanics are genius (plant auction), some are terrible (choosing starting positions).",
    "timestamp": 1675810800
  },
  {
    "username": "DeltaHuluBWK",
    "rating": 5.0,
    "comment": "It starts out pretty slow, then the middle is a lot of fun, but it's the most anticlimactic ending game I've ever played. You know who's going to win before they actually do, and it just ends. No secret stash or other mechanics/strategies you can use to eek out a win. Just...fin",
    "timestamp": 1674428400
  },
  {
    "username": "Aelical",
    "rating": 5.0,
    "comment": "Fairly bland euro game. Players generate resoursed to buy and maintain powerplants.",
    "timestamp": 1672786800
  },
  {
    "username": "muldor",
    "rating": 5.0,
    "comment": "After years i gave it a second try, there is no fun in this game at all for me and my group.",
    "timestamp": 1672700400
  },
  {
    "username": "SaraM99",
    "rating": 5.0,
    "comment": "For a while it was on my top 10 list, but i guess it is outdated.",
    "timestamp": 1671145200
  },
  {
    "username": "disposable.superhero",
    "rating": 4.5,
    "comment": "Didn’t have the right group to play this with so I got rid of it… to get more games that I haven’t played either. ?",
    "timestamp": 1668466800
  },
  {
    "username": "realityfoible",
    "rating": 5.0,
    "comment": "Power Grid is ok.\nIt's decent. It's fine. There's room for shrewd skill and strategy, and a handful of interesting decisions to make.\nAnd yet... I was bored out of mind.\n\nThe auctions that form the game's beating heart are straight forward and predictable, while the rest of the game boils down to simple arithmetic and action optimization. At no point was I surprised by a friend's cunning plan put into action, or the folly of my own hubris.\nWhat you see is what you get.",
    "timestamp": 1667257200
  },
  {
    "username": "jwent2",
    "rating": 5.0,
    "comment": "6 players",
    "timestamp": 1666735200
  },
  {
    "username": "reyla99",
    "rating": 5.0,
    "comment": "This game is a lot like real life. Plan out your budget, adjust to changes in prices, use up all the oil in the world and destroy the environment. I can see why people like this game, it feels like chess with planning moves in advance. It just wasn't fun though, too much like work and too much math.",
    "timestamp": 1666303200
  },
  {
    "username": "LucileV",
    "rating": 5.0,
    "comment": "I felt too much like a calculator",
    "timestamp": 1664488800
  },
  {
    "username": "willbeplayin",
    "rating": 5.0,
    "comment": "I quite liked the idea and the mechanisms but overall don't really like auction/bidding games. Play Medici instead, or the card game version of Power Grid.\n\nOne thing I don't like in Power Grid games is the victory condition. It just feels iffy.",
    "timestamp": 1661810400
  },
  {
    "username": "TheGingerDuck",
    "rating": 5.0,
    "comment": "Played, not owned.",
    "timestamp": 1657404000
  },
  {
    "username": "littlemute",
    "rating": 5.0,
    "comment": "I remember playing this once and remember I never wanted to play it again.",
    "timestamp": 1656021600
  },
  {
    "username": "KingD7W",
    "rating": 5.0,
    "comment": "Fun but too long and slow.",
    "timestamp": 1655935200
  },
  {
    "username": "Rafa44",
    "rating": 6.0,
    "comment": "Keeping it only because it's Daniel's second favourite game next to Andromeda's Edge, Barcelona, Chess and Galaxy Trucker.",
    "timestamp": 1761778800
  },
  {
    "username": "Auroric",
    "rating": 5.5,
    "comment": "Power grid just bores me, what can I say. A drab and dreary math puzzle. I can find a bit of fun here if someone really wants to play. I'm sorry to the power grid lovers out there, there's definitely a well designed game here, it just isn't for me.",
    "timestamp": 1760565600
  },
  {
    "username": "BeansForTrade",
    "rating": 6.0,
    "comment": "On paper it's a great game, with tight auctions, player-driven supply and demand, and variable turn order via the \"catch up\" mechanism. I put catch up in quotes because it's so powerful that the main focus of the game becomes properly timing when you want to be behind the other players and when you want to pull ahead. The player-driven endgame trigger means you can never be certain how many rounds are left, keeping it tense.\n\nHowever, I don't actually enjoy playing it that much because of several issues that compound together. Way too much bean counting means far more puzzling out the ideal turn and less reading player intentions. This combined with lots of upkeep makes the game run long, and there usually there isn't much to think about between turns due to how tactical many elements are. I wish the map play was more cutthroat, it seems too forgiving to just be able to build over someone else if you get blocked. Also suffers from the dreaded random card market that can really hose you if you get unlucky. I had high hopes but I wanted much more interaction than I got. I would play it more but I don't think I'd ever take it over Age of Steam.",
    "timestamp": 1760565600
  },
  {
    "username": "manman1",
    "rating": 6.0,
    "comment": "Game play becomes somewhat boring. It is very hard to affect the course of a game after someone gets ahead",
    "timestamp": 1760220000
  },
  {
    "username": "DarthMisster",
    "rating": 6.0,
    "comment": "I have to read the rule again",
    "timestamp": 1759442400
  },
  {
    "username": "mhinto",
    "rating": 6.0,
    "comment": "2-6 players",
    "timestamp": 1759096800
  },
  {
    "username": "PiecesOfToast",
    "rating": 5.5,
    "comment": "Solid map extension game. Much like Ticket to Ride but better. Early game is key and if you make a mistake early on you can quickly lose",
    "timestamp": 1758146400
  },
  {
    "username": "AndBobsYourUncle",
    "rating": 6.0,
    "comment": "First learn/play with 5 people took 3.5 hours. Ahh!\n\nDid I make a mistake buying this? Will need to try again with sand timer and calculator at the ready.",
    "timestamp": 1757541600
  },
  {
    "username": "iplaybgnaked",
    "rating": 6.0,
    "comment": "Classic economic Euro that holds up quite well compared to the modern slop people try to pass off as interactive. Clean set of rules makes it easy to get into, the auctions remain tense and interesting throughout the game, and the house placements can be delightfully rage inducing. Only downside is that it's best with the higher player counts and can run a little long for what it is.\nStill love the game but given the length and my preferred player count I find myself asking \"why aren't we playing an 18xx instead?\" every time I play it which is a sign to me that it's time to let Power Grid go.",
    "timestamp": 1757282400
  },
  {
    "username": "mrfixsimmons",
    "rating": 6.0,
    "comment": "It’s a good game. It’s just too fiddly and too long to want to come back to it.",
    "timestamp": 1755208800
  },
  {
    "username": "gmcnish",
    "rating": 6.0,
    "comment": "Played a bother it was new but it never grabbed me like it did other people. Solid game of timing and balancing cost/benefits. Lots of fiddly calculation.",
    "timestamp": 1754085600
  },
  {
    "username": "AllieAngel",
    "rating": 6.0,
    "comment": "This was good with 5 players but a bit too predicatable at our usual 2 player count.",
    "timestamp": 1752444000
  },
  {
    "username": "Idiot_for_Life",
    "rating": 6.0,
    "comment": "Best at 4-6\nMid length\nAuction and route building game where players try to power as much of a city as possible.",
    "timestamp": 1752357600
  },
  {
    "username": "selvalabelva",
    "rating": 6.0,
    "comment": "Brainburn         Longevity    \nLuck impact       Rules/Setup  \nInteraction       Involvement  \n\nAftertaste           Enthusiasm   \n\n Played at 3+6 player count\n Best at 4+ players\n Replayability will improve with additional maps\n Confrontation: direct\n\n Planning requires lots of mental maths",
    "timestamp": 1751320800
  },
  {
    "username": "Ostropol",
    "rating": 6.0,
    "comment": "Max/Fam",
    "timestamp": 1750629600
  },
  {
    "username": "sirensong1986",
    "rating": 6.0,
    "comment": "Its pretty straightforward and intuitive. build connections to cities, use resources to power them, upgrade cards to power more cities. Solid classic but too light for my taste is all.",
    "timestamp": 1750370400
  },
  {
    "username": "mmychal",
    "rating": 6.0,
    "comment": "Good interaction and thought processes. It's a great game even for non-gamers. The six player version takes a bit too long and the English rulebook is awful. The components, mapboard and gameplay make up for these little nuisances, however.",
    "timestamp": 1750024800
  },
  {
    "username": "melterskelter",
    "rating": 6.0,
    "comment": "Played twice and I understand the appeal. Great mechanisms. Fun too. UPDATE: Latest game I did not enjoy. Will try again someday though.",
    "timestamp": 1749592800
  },
  {
    "username": "mausoleo",
    "rating": 6.0,
    "comment": "Power Grid is a really simple yet complex game. Learning and understanding the rules while playing for the first time may be though, but once a single player completely understands how the game works, anyone can be taught how to play.\n\nUp to 6 players will be able to compete against each other to build the biggest energy infrastructure and provide energy to the biggest amount of cities. There are no dice at all in this game, and the interactions between players are minimal except for one of the phases in each round. The design of the game is really good: the map/board provided with the base game allows the players to build their infrastructure on either Germany or the United States. It also contains a really clever market system that emulates the functioning of real markets by introducing supply and demand: resources bought by too many players will become more expensive throughout the game, while those that are not will get really cheap by the last rounds.\n\nPower Grid is definitely an acquired taste. It is not only strategic, but also very oriented to resource management. If you do not really enjoy the game and also are not in the mood to play it, you will hate every minute of it. Otherwise, it will easily become one of your favorites.",
    "timestamp": 1748383200
  },
  {
    "username": "hououinKyoumaa",
    "rating": 6.0,
    "comment": "played this a long time a go, felt very mathy, but willing to give it another shot",
    "timestamp": 1746914400
  },
  {
    "username": "AfarOca",
    "rating": 6.0,
    "comment": "JUGADORES: 4-5\nTIEMPO: 120\n\nPARTIDAS GANADAS/PERDIDAS\nNavir 4/4\nJose 2/2\naludarc66 1/0\nFina 1/0\nManolo 1/1\nOca 1/9\nPepon 0/1\nConchi 0/1\nAntonio Rocio 0/1\nJose Intercambio 0/1\nRyDeRwInD 0/1\nAlvaro 0/1\nCarlos 0/1\nJosé (Carlos) 0/1\nPatri 0/2\nAngel (Patri) 0/2\nLoli 0/3",
    "timestamp": 1743976800
  },
  {
    "username": "Gumstep",
    "rating": 6.0,
    "comment": "The design has lost its luster over the years.",
    "timestamp": 1743372000
  },
  {
    "username": "DanKill",
    "rating": 6.0,
    "comment": "Love it. Can't justify buying it.",
    "timestamp": 1742857200
  },
  {
    "username": "FigMonger",
    "rating": 6.0,
    "comment": "This efficiency game is a great brainteasers. Usually the game flows the same way everytime with everyone pretty neck in neck unless you mess up then your left behind. But is a fun game with great mechanics, rule book could be better.",
    "timestamp": 1742684400
  },
  {
    "username": "wardster",
    "rating": 6.0,
    "comment": "{\n\"Played\":\"Library\"\n}",
    "timestamp": 1742252400
  },
  {
    "username": "RienMoeyaert",
    "rating": 6.0,
    "comment": "Bevat uitbreiding Benelux",
    "timestamp": 1742166000
  },
  {
    "username": "keytolife",
    "rating": 6.0,
    "comment": "6-7",
    "timestamp": 1741215600
  },
  {
    "username": "PARTYTANK",
    "rating": 6.0,
    "comment": "Pros:\n- Easy to learn/teach\n- Expansions bring about some cool boards/maps.\n\nCons:\n- Components could be better (like the paper money)\n\nI don't really have anything negative to say about it. It's a fun game. One that's easy to pull off the shelf and set up for a game night.",
    "timestamp": 1740956400
  },
  {
    "username": "GameraGamer",
    "rating": 6.0,
    "comment": "Another one of these games that are too luck based for how long and complex they are.\n\nI managed to crush everyone because I got two cards at the start that made me basically unstoppable. It was not a very fulfilling victory.",
    "timestamp": 1739228400
  },
  {
    "username": "robinmaypanpan",
    "rating": 6.0,
    "comment": "I absoluately love playing this game and figuring out how to organize the power plants. Sadly, I feel that the calculation/math heavy aspect of figuring out how to get from one location to another leads towards a slow game, especially from players that try for optimal plays.",
    "timestamp": 1736204400
  },
  {
    "username": "sup3rdan",
    "rating": 6.0,
    "comment": "Is math- great for a while but I am done after 10 years as it has gotten repetitive.",
    "timestamp": 1736031600
  },
  {
    "username": "goatofgoats",
    "rating": 6.0,
    "comment": "Not sure if we ever played the right way, but I saw the potential.",
    "timestamp": 1735340400
  },
  {
    "username": "Deyannira",
    "rating": 6.0,
    "comment": "Only played once but didn't care for it. It's revered by many so I would give it another shot but no desire to after my first experience.",
    "timestamp": 1735167600
  },
  {
    "username": "TrentonTron",
    "rating": 6.0,
    "comment": "I like the concept of upgrading the plants, but I dislike the fact that players deliberately build less cities to stay in last place, just because turn order is so important. I consider games where turn order is so important to be flawed. I also dislike how toward the end of the game, it degrades into computing connection costs repeatedly in order to find the cheapest way to place 5 or so cities on the board. I enjoy tense, strategic decisions, not tedious mathematical exercises with an optimal solution. It makes my head hurt--- not in an enjoyable, cerebral way with agonizing decisions, but in an annoying way that is most similar to taking a long, pointless math test.\n\nEdit: I played this again more than two years later and raised my rating from 4 to 7. Most of my previous concerns were significantly less significant than I remembered them, but what's more, I actually had fun! Although I am pretty sure that I was praying before with some of the rules wrong, Power Grid seemed like a completely different game.",
    "timestamp": 1733612400
  },
  {
    "username": "porcine",
    "rating": 6.0,
    "comment": "Kétségtelenül jó játék. Nekem a megjelenésével sincs problémám, igaz, tényleg nagyon randa. De egy kifejezetten jól összerakott, magas interakcióval megfűszerezett cucc. Azonban engem sajnos nem fogott meg.",
    "timestamp": 1733612400
  },
  {
    "username": "Elysian1196",
    "rating": 6.0,
    "comment": "The depth is there for sure, but I just don't think this is what I'm looking for in a board game.\n\nThe guy who taught me the game brought a spreadsheet of the entire deck and calculated exactly how much money to spend each round with occasional sandbagging to get ahead in turn order. Lots of quiet calculating and not so much socializing despite a bit of meaningful player interaction. I feel like I've played enough similarly crunchy games without all the math involved that I'd rather play those instead. Not to mention I'd also prefer to play a game where the theme doesn't seem to glorify fossil fuels.\n\nIf you are someone who likes the math and spreadsheets type of thinking, where you can calculate an exact plan and reliably follow it, then I'd guess you will LOVE this game. I also do like how well it scales to 6 players.",
    "timestamp": 1733353200
  },
  {
    "username": "Headlex",
    "rating": 6.0,
    "comment": "okay economy game\ndid not work that well for me and my playgroup or wife",
    "timestamp": 1731798000
  },
  {
    "username": "_teece_",
    "rating": 6.0,
    "comment": "I particularly like the resources system with things in demand getting more expensive and unpopular resources getting cheaper. Very nicely designed",
    "timestamp": 1729980000
  },
  {
    "username": "polm23",
    "rating": 6.0,
    "comment": "I enjoy this game but unless everyone knows what they are doing and is careful the playtime balloons, so I never suggest it.",
    "timestamp": 1727647200
  },
  {
    "username": "alexdesouza",
    "rating": 6.0,
    "comment": "A favorite to introduce to those new to modern board gaming (who prefer competitive games). Hoogspanning has a finely tuned balance of accessibility and strategic depth, and with its built-in \"catch up\" mechanisms, both inexperienced and experienced players alike can remain engaged throughout. Best with 4+ players.",
    "timestamp": 1726696800
  },
  {
    "username": "skipaoff",
    "rating": 6.0,
    "comment": "Игра на лучшего математика.\nСначала ты считаешь, потом ты считаешь считаешь, потом считаешь считаешь считаешь. и так далее.\nТолько аукцион ты торгуешься. А хотя нет, тоже считаешь.\n\nТут буквально вся конкуренция в том, кто лучше просчитает все, хотя просчитывать тут можно ограниченое кол-во обьектов.\nВсе эти вот скупки нужных другим ресурсы, все аукционы, все выборы стартовых позиций - это все сухой просчет.\n\nНо я такое люблю )))",
    "timestamp": 1726351200
  },
  {
    "username": "rexmundus",
    "rating": 6.0,
    "comment": "- ponad 20 rozgrywek\n- piwnica",
    "timestamp": 1725746400
  },
  {
    "username": "Kiro",
    "rating": 6.0,
    "comment": "2 - 6",
    "timestamp": 1725228000
  },
  {
    "username": "gidorah",
    "rating": 6.0,
    "comment": "08.2024\n\nGAMEPLAY\nPower Grid is a procedural game where players bid for power plants; buy resources to spin up said plants; build power station locations to form a network; and make energy bucks. The game ends when a player builds their 17th station; the player able to power the most stations wins the game.\n\nTHOUGHTS\nThere’s a lot to like about Power Grid.\n• The resource market is a compelling supply and demand model that forces you to consider (again) initiative and forecast what opponents will or won’t want.\n• The networking is maybe not the most interesting in and of itself but the constant income calculations and planning are extremely crucial to doing well. Knowing how and where to cut off an opponent is likewise key, but you’re never truly trapped as you can pay to build “through” an opponent but for a hefty price.\n• Next to the resource market, the victory condition is my other favorite part of PG. I love the fact that not only is the game clock player driven, but the winner is not determined by who crosses the finish line first or who has the most money but who can power the most stations. It feels both thematic and clever.\n• Finally, the variability provided with the expansion maps and their unique twists is extremely cool.\n\nAs for the negatives, PG can be a real slog, especially when I’m staring into the third hour and have to once again go through all the phases. You could say that’s your group and that would be fair, but I’ve played this with many different people in different settings and, even in my 3P games, it’s longer than I want it to be. Part of this is due to the procedural nature and the admin that’s folded into that. PG has a lot of upkeep and a lot of little rules, meaning constant reminders are necessary. Not a big deal in a one-hour game but much more onerous in longer ones. A final thing adding to the length is how player initiative affects game play: PG disincentivizes players from getting out into the lead early as those later in turn order strike first in buying resources and building stations. They’re also rewarded when the Step 2 floodgate is broken.\n\nWhile I was initially quite high on PG, each successive play has emphasized the aspects I don’t care for while those that I like recede into the background.",
    "timestamp": 1722981600
  },
  {
    "username": "kiwipaul",
    "rating": 6.0,
    "comment": "Was great back when.",
    "timestamp": 1722463200
  },
  {
    "username": "captaincomic",
    "rating": 6.0,
    "comment": "A tense game based around a resource market and auctions for power plants. It's a nice combination of interaction and optimization.\n\nBut it's an unforgiving game, and it involves a lot of basic arithmetic, which makes it feel more serious compared to other auction games. It sucks when you miscalculate in this game.\n\nI find it a bit strange that all the micro-optimization that you do on the board matters so very little, except for turns where you are just short a few electrons to build another house or resource.\n\nThere is something strange about the rules (and the rule book). For the most part, it's not a complex game, and the rules make sense. But there are many little exceptions and special situations (when to remove power plants from the market, the transitions and differences between the phases) that we always seem to forget about at least one of them. And that can really ruin a game, because these rules are needed to keep the game going smoothly. Overall, it doesn't feel very elegant to me.\n\n\n\n# of players: 2 3 4 5 6",
    "timestamp": 1722376800
  },
  {
    "username": "LitheLyricist",
    "rating": 6.0,
    "comment": "Play w revision 3 rules. It suffers from 2 major defects as far as I can tell so far. 1) the catch-up rubber banding is so strong from benefits of having later turn order (those losing get later turn priority which is way better bc the important steps operate in reverse turn order) that the early and midgame are a snooze fest until you arrive to the inevitably tight endgame. 2) the leaders going into the 2nd to last turn have strong incentives to sandbag taking the house count lead bc it will lead to a worse turn order on the final critical round. So it's a weird game of jockeying for that final round of having a good turn order, and that's the determining factor for the game. The game was still pleasant for me since it's an economic game and I love economic games, but hansa teutonica fires power grid for me in all circumstances since it doesn't suffer from those defects, and then if you want to go heavier than hansa, there's a ton of better choices too.",
    "timestamp": 1721599200
  },
  {
    "username": "Philgamer",
    "rating": 6.0,
    "comment": "Good game",
    "timestamp": 1720994400
  },
  {
    "username": "stephembee",
    "rating": 6.0,
    "comment": "Runaway leader problem",
    "timestamp": 1719352800
  },
  {
    "username": "Innsbruck",
    "rating": 6.0,
    "comment": "Player Count: 2 to 6\n Competitive Game: One player wins alone.\n\nDesigned by Friedemann Friese.",
    "timestamp": 1719266400
  },
  {
    "username": "abdbla",
    "rating": 6.0,
    "comment": "mid quite honestly",
    "timestamp": 1718488800
  },
  {
    "username": "Procyon_lotor",
    "rating": 6.0,
    "comment": "Strategy shelf\nThrifted $3",
    "timestamp": 1715551200
  },
  {
    "username": "klebinaldo",
    "rating": 6.0,
    "comment": "broken with 3 players because cities have space for 3 players.\n2 to 3 Dead rounds when no one wants to buy the plants.",
    "timestamp": 1714255200
  },
  {
    "username": "headlessman",
    "rating": 6.0,
    "comment": "Very streamlined and I like the auction phase, but the network building was a bit too flat compared to Brass Birmingham. I wanted more interaction as well rather than just blocking. I think overall I would just rather play Brass than this.",
    "timestamp": 1712872800
  },
  {
    "username": "reswob",
    "rating": 5.6,
    "comment": "not my theme. not my artwork. it didnt age so well... but i would play it again.",
    "timestamp": 1712786400
  },
  {
    "username": "sully5927",
    "rating": 6.0,
    "comment": "A solid game of bidding and building. It does not scratch a particular itch for me, but I enjoy it.",
    "timestamp": 1712700000
  },
  {
    "username": "Forgeforgeforge",
    "rating": 5.8,
    "comment": "Only played it a few times for the first time in 2022 with groups who already understood the stable meta, so I missed out on the fun of learning this game.\nHow on earth did this get a reprint without a totally new rulebook !?!?\n\nI think the Mexican standoff around phase changes is actually not that cool or fun. I'd prefer a pure network / pricing game. What would that game look like? Cities would have all three spots open at once but you'd pay other people who built there first, and your link build cost would be from the closest city you had at the start of your turn instead of chaining. And you'd be able to buy any number of power plants in a round if you can afford it.\n\nThe new powerplant deck mostly fixes the standoff issue, except when it doesn't. The randomness of surprise powerplants coming out is what makes the game variable and interesting, but it also makes some plays of the game just bad.\n\n\nThe most important decisions of the game on most maps is where your starting cities are. I do like impactful starting position selection, but I prefer if it also kind of washes out throughout the game. Certain maps and certain player behavior can totally eliminate people before the games even starts, which is frankly dumb. A lot of the most important decisions in the game cannot be understood forwards: Is it right to bid on this plant right now? Totally depends on what gets flipped blind. This is true of other friese games (faiyum, fresh fish). You cannot go back and look at key moments and say \"I had the information I needed to make the right call here\". The rightness of a call is determined after the fact by chance. It's weirdly calvinist.\n\nI totally enjoy this game and find the amount of arithmetic and calculation a non issue, but for a game to both be so arithmetic and so incalculable is pretty weird.\n\n\nEdit: Overall its disappointingly stale and new maps add little shake-up compared to what's done in Age of Steam. Do the rules not support it? Is there a sanctioning body that only approves utterly milquetoast inneffectual rule variants? It's often impossible to recover from early mistakes. get tunnel vision and overbid for an early auction, you're out. Fail to balance the starting position, a player can be out from turn 1.\n\n\nTo actually play this game well among equally strong players, smart people need to stop and do ten minutes of arithmetic at various stages, to drive the game to an equilibrium where the outcome is decided by the flip of the deck.",
    "timestamp": 1712613600
  },
  {
    "username": "Walex",
    "rating": 6.0,
    "comment": "Marcin >> Pumba / Piotr P",
    "timestamp": 1711922400
  },
  {
    "username": "Hwesta",
    "rating": 6.0,
    "comment": "Very tight interconnected design, if less riotously fun than other games. Prone to analysis paralysis. Would do well as a computer game (to handle money & building cost calculations).",
    "timestamp": 1710802800
  },
  {
    "username": "Rudrahorn",
    "rating": 5.5,
    "comment": "[--#--] Complexity\n[---#-] Immersion\n[-#---] Production\n[---#-] Replayability\n[-#---] Interaction\n[---#-] Depth",
    "timestamp": 1710543600
  },
  {
    "username": "smurfodeth",
    "rating": 7.0,
    "comment": "Tense auctions and slap-fight route building make for a game I can always count on. The fact that it is a system with so many varied maps, and that it scales so well across its player counts, just further adds to its value.",
    "timestamp": 1762210800
  },
  {
    "username": "davidxiang",
    "rating": 7.0,
    "comment": "经典重德",
    "timestamp": 1762124400
  },
  {
    "username": "ultimoratio",
    "rating": 7.0,
    "comment": "Update: Nov 2022\n\nInteresting game of exploiting the rubber banding and how players push the game and accumulate money. While, not an Imperial or Chicago Express, it is interesting in its own way.\n\n================\n\nVery fun and engaging economic game. Nice mix of auctioning for the power plants, flexible resource market, and route building.\n\nSomeone mentioned that it is a \"train game but without the trains\". And this is its downfall. Playing Power Grid feels a bit rigid and too procedural. Indeed, the resource market is so stale and predictable that it makes turn by turn plays tedious and predictable too, which results in a race for efficiency/snowballing - first to snowball wins.\n\nIt just makes me want to just bring out a proper Cube Rail train game, than to play Power Grid.\n\nAlso, Power Grid: the Card Game is much more preferable.",
    "timestamp": 1761951600
  },
  {
    "username": "Joerie",
    "rating": 7.3,
    "comment": "+T. Faster\n+fast alle Expansionen\n\n+Sugar",
    "timestamp": 1761519600
  },
  {
    "username": "keekohmygod",
    "rating": 7.0,
    "comment": "Mayday Standard",
    "timestamp": 1761256800
  },
  {
    "username": "Hori16",
    "rating": 6.5,
    "comment": "Joguei somente 1 vez",
    "timestamp": 1761170400
  },
  {
    "username": "joeyLiu",
    "rating": 7.0,
    "comment": "3d printed upgraded resource tokens",
    "timestamp": 1760911200
  },
  {
    "username": "Gazuo",
    "rating": 7.0,
    "comment": "Excelente juego de administración y economía. Representa de manera sublime la industria de suministro de energía electrica, con subasta de centrales, manipulación del mercado de los recursos energéticos y planificación de las redes de distribución.\n\nLas partidas son ágiles y nada tediosas, alta interacción entre jugadores en las subastas y el tablero. Inconveniete el uso de los billetes de papel incluidos en la caja del juego.",
    "timestamp": 1759615200
  },
  {
    "username": "Bkoons",
    "rating": 7.0,
    "comment": "w/ New Power Plant Cards",
    "timestamp": 1759269600
  },
  {
    "username": "Ideology",
    "rating": 7.2,
    "comment": "Played multiple times before logging plays",
    "timestamp": 1759269600
  },
  {
    "username": "mjhm",
    "rating": 7.0,
    "comment": "in wpg",
    "timestamp": 1758319200
  },
  {
    "username": "wpolka",
    "rating": 7.0,
    "comment": "The auction is fun and the nework building maintains the interactive aspect of this game. Endgame scoring is refreshingly simple. I guess I just wish it was a tad shorter",
    "timestamp": 1758146400
  },
  {
    "username": "kmaho",
    "rating": 7.0,
    "comment": "2011 edition. punched but unplayed.",
    "timestamp": 1757887200
  },
  {
    "username": "GusiX",
    "rating": 7.0,
    "comment": "- Base -",
    "timestamp": 1757628000
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 7.0,
    "comment": "BGG:HoF\n\nWith over 50 plays, Power Grid has proven to be a great startegy game for player counts from 3 - 6.\n\nExpansions in the collection:\nFrance/Italy\nChina/Korea\nBenelux/Central Europe\nBrazil/Spain & Portugal\nVariant Power Plant deck\nThe \"Fabled\" deck\n\nKeep",
    "timestamp": 1757628000
  },
  {
    "username": "pauldavis92",
    "rating": 7.0,
    "comment": "For trade",
    "timestamp": 1756936800
  },
  {
    "username": "adel9591",
    "rating": 7.0,
    "comment": "I've only played it at 2,3, and 4. Each time it was just a race to build the required number of cities to end the game. Once you fall behind there does not seem to be a way to get back into it, so it's a real \"rich get richer\" kind of experience.\n\nEdit: It is more than just a race, it is a game of crucial decisions that occur occasionally and noticing when those occur. The factories that power 7 cities are game winners; there needs to be more options to generate power to cities, as you stand no chance if your opponent has a 7 and you don't. I think I will try the new plants deck soon.",
    "timestamp": 1755986400
  },
  {
    "username": "GeminiWeb",
    "rating": 6.9,
    "comment": "I like the way it all fits together - the city connections, the auctions, the resource management. Satisfying.",
    "timestamp": 1754863200
  },
  {
    "username": "Phija",
    "rating": 7.0,
    "comment": "Needs more plays.",
    "timestamp": 1754690400
  },
  {
    "username": "lemonhead634",
    "rating": 7.0,
    "comment": "Power Grid is a game I have owned since 2013. When I first decided to start a game night, I asked a former co-worker for recommended games and Power Grid was on his list.\n\nI have never done very well at Power Grid, and I usually come in close to last. I struggle to get my engine going early and I haven't yet figured out why. Part of the problem is that my plays of Power Grid are so infrequent that I have forgotten details of previous plays by the time it makes it to the table again. So I likely repeat some of my same mistakes every game. I honestly don't care enough to go read strategy guides in between sessions. I'm not that kind of gamer.\n\nIt seems that if you can get two cities powered early, then you are on the right track. I probably overbid on power plants during the first turn, which makes it hard to buy fuel and build new routes. I end up with payment from powering a single city while others are reaping more. There's a balance that I just haven't figured out. In the past I've complained about a runaway leader problem in Power Grid. In the half dozen plays of the game I've had so far, I don't know how you catch up to someone when they are bringing in more money that you every turn. They can outbid you for new plants, and they can build up their route more quickly than you can. Perhaps one tactic is to stockpile the resources they need to drive prices up, but then you are spending money on resources that just sit.\n\nI recently looked at Power Grid on the shelf and thought about selling it. I know it is a good game, I just haven't had a ton of fun with it because I am terrible at it. Is it okay to dislike a game simply because you are really bad at it? I can imagine my friend Jon rephrasing this question: \"Do you only like games if you win them?\" In some cases, I think the answer is yes. Winning certain games is where I find the enjoyment from that game. But there are certainly others, like For Sale or Modern Art, where I have fun regardless of the outcome.\n\nSo in the end, I am still considering selling my copy of Power Grid. Though I will probably keep it around for nights where we have 6 at the table and want something with a bit more depth.\n\nUpdate 8/2025: sold on GeekMarket.",
    "timestamp": 1754604000
  },
  {
    "username": "big_booboo",
    "rating": 7.0,
    "comment": "Played it, saw what all the fuss was about, but it's just not my kind of game",
    "timestamp": 1754431200
  },
  {
    "username": "Mestail",
    "rating": 7.0,
    "comment": "dont really like auction, but this game is kind of OK",
    "timestamp": 1754431200
  },
  {
    "username": "mantooth012",
    "rating": 7.0,
    "comment": "Meh, it was ok. Some good decision making, but just never really fun. Fairly dry theme.",
    "timestamp": 1753394400
  },
  {
    "username": "DaSnow",
    "rating": 7.0,
    "comment": "I've played this game a couple of times and remember enjoying it.\n\nI found this game for $5 in my local marketplace. It's a little dinky but I'm excited to play it.",
    "timestamp": 1753135200
  },
  {
    "username": "chunky56",
    "rating": 7.0,
    "comment": "Feb 2019:\nIt's well designed. Turned off by some weird player interactions at the end. Seems like it is easy for someone who cannot win to decide who does.\n\nOriginal:\nIt's deep and strategic like Puerto Rico and Agricola, but in the end, it just doesn't feel as enjoyable as the other two.",
    "timestamp": 1752703200
  },
  {
    "username": "Zozobaltazar",
    "rating": 7.0,
    "comment": "Sukhy 7.5",
    "timestamp": 1752530400
  },
  {
    "username": "Brother Abe",
    "rating": 7.0,
    "comment": "April 2020-Played it with the Australia expansion. Excellent game. Holds up great.\n\nJune 2019-Resources management game that keeps you bidding and scheming to outdo your fellow energy companies. There are a lot of counterbalances built in, often you are rewarded for laying low, but pouncing when you get close to the end, but don’t let your neighbors buy all your resources!!\n\nMarch 2016\n$29.99",
    "timestamp": 1752444000
  },
  {
    "username": "gabdewulf",
    "rating": 6.7,
    "comment": "Limited choice and the majority of the game is centered around the auction but that's not the game goal.\nRule book feels like missing a lot of the game.",
    "timestamp": 1752357600
  },
  {
    "username": "Major Geek",
    "rating": 7.0,
    "comment": "6/15/24 inventory\nOpen, Robots expansion in box",
    "timestamp": 1752184800
  },
  {
    "username": "Sorp222",
    "rating": 7.0,
    "comment": "Where did my comment go? Used to be a favourite, love the the rhythm of the game and the need to not be or seen to be winning. Oddly reflects reality in theregulatory economics of the power industry.",
    "timestamp": 1752098400
  },
  {
    "username": "shadowjump",
    "rating": 8.0,
    "comment": "Storage Box W",
    "timestamp": 1762210800
  },
  {
    "username": "clawp1995",
    "rating": 8.0,
    "comment": "Sleeve Kings Square Card Sleeves 70 x 70(110) SKS-8812\n3D Insert\n3D Printed:\n- Resources",
    "timestamp": 1761951600
  },
  {
    "username": "Derianhorgen",
    "rating": 8.0,
    "comment": "SpielboxRating 8-8, av. 8,00",
    "timestamp": 1761606000
  },
  {
    "username": "juanitogan",
    "rating": 8.0,
    "comment": "\"'Advanced' Ticket to Ride.\" Great opportunity for extra strategy in a game with a surprisingly slim rulebook... but hampered by a disappointingly overpowered catch-up (nerf the leader) mechanic. Thus, plays like a fun and deep strategy game... but is just another pretty good Eurogame in the end.",
    "timestamp": 1761519600
  },
  {
    "username": "dahntheboss",
    "rating": 8.0,
    "comment": "Unboxed, packed in Conan The Strategy Board Game",
    "timestamp": 1761519600
  },
  {
    "username": "WhatUpRob",
    "rating": 8.0,
    "comment": "with china/korea, japan/russia, and benelux/central europe maps",
    "timestamp": 1761429600
  },
  {
    "username": "Zoozolissimo",
    "rating": 8.0,
    "comment": "THe grafics are kinde of old, and many of the mechanics result outdated and tedius too, but the min betting feature and grid expansion remain as fun as ever beafore. A really great game that can use a little modernisation",
    "timestamp": 1761429600
  },
  {
    "username": "Kream45",
    "rating": 8.0,
    "comment": "brzydka jak CHUJ... ale super gra :/",
    "timestamp": 1760997600
  },
  {
    "username": "toarukun",
    "rating": 8.0,
    "comment": "A good bidding and resource management game",
    "timestamp": 1760997600
  },
  {
    "username": "fazermozg",
    "rating": 8.0,
    "comment": "+",
    "timestamp": 1760652000
  },
  {
    "username": "StupidRatCreature",
    "rating": 8.0,
    "comment": "",
    "timestamp": 1760565600
  },
  {
    "username": "Kveld",
    "rating": 8.0,
    "comment": "Evergreen de FF, jugado ágilmente proporciona una experiencia satisfactoria, subastas con mucho bluff.\nEl sistema compensatorio puede ser al mismo tiempo el defecto y la gracía del juego.",
    "timestamp": 1760392800
  },
  {
    "username": "theryanstorm",
    "rating": 8.0,
    "comment": "ALPHA",
    "timestamp": 1759701600
  },
  {
    "username": "BoGidley",
    "rating": 8.0,
    "comment": "Played at AOB. Enjoyed it but needs three players to work well",
    "timestamp": 1759701600
  },
  {
    "username": "hiimjosh",
    "rating": 8.0,
    "comment": "Good, but I expected more. I was underwhelmed by the interaction - there aren’t many opportunities to interact substantially with someone who lands good power plants. My big issue is with the board play. The fact that you can’t do much blocking or bullying. The map design seems off too. I like the idea of jockeying people into missing timing windows, but it all was so accounting heavy and finicky - I was craving the clarity of a Santiago or a Specherstadt. The resource market played less of a role than I expected it to. I liked how the plants coupled players together.\n\nI don’t know - tactically, Power Grid is a full knife. I was really hoping for more of an emphasis on opportunistic play and meddling, but this was a lot safer than I shooting for. Age of Steam and 18xx are similar but better. PG is even drier than those games somehow. 90m though for 5 people? Not a bad choice at all even if it’s unlikely to become a favorite.",
    "timestamp": 1759528800
  },
  {
    "username": "Adri_corr",
    "rating": 8.0,
    "comment": "(2, 6) #players",
    "timestamp": 1759010400
  },
  {
    "username": "Alhegard",
    "rating": 8.0,
    "comment": "Nice Design. Nice bidding system",
    "timestamp": 1758578400
  },
  {
    "username": "Jadlak",
    "rating": 7.5,
    "comment": "Do I need these updates/corrections?\nhttps://boardgamegeek.com/filepage/17128/powergrid-correctio...\nhttps://boardgamegeek.com/filepage/17723/power-grid-errata-a...\n\nhttps://www.thingiverse.com/thing:2725003 Coal\nhttps://www.thingiverse.com/thing:2069567 Oil & Garbage\nhttps://www.thingiverse.com/thing:4964442 Uranium\n\n3d Print Poker chips:https://makerworld.com/en/models/1031055-power-grid-poker-ch...\n\nMaaaaybe\nhttps://boardgamegeek.com/filepage/102342/power-grid-money-w...\n\nAcquire/PnP Power Plants 1 & 2 (2 looks best?)\nhttps://boardgamegeek.com/boardgameexpansion/29416/power-gri...\nhttps://boardgamegeek.com/boardgameexpansion/344429/power-gr...\n\nGet updated reference sheet for Power Plants 1 & 2\nhttps://boardgamegeek.com/filepage/36078/power-grid-plant-li...\n\nInclude a D12 and print this: https://boardgamegeek.com/filepage/119023/area-randomiser-ta...\n\nUseful aid on power plant market:\nhttps://boardgamegeek.com/filepage/11322/power-grid-plant-re...",
    "timestamp": 1758492000
  },
  {
    "username": "stofke",
    "rating": 8.0,
    "comment": "R001",
    "timestamp": 1758405600
  },
  {
    "username": "superwai28",
    "rating": 7.5,
    "comment": "It's a classic game but I'm still quite new to auction game. The recharged version makes the 2-player games interesting. I think the games is the best at 3 to 4 players. The turn order system is smart and keeping a great balance among the players. A lot of ways to mess up with others' plans! Solo play is an option with some variant on BGG but it has no way to mimic the fun part of the auction.",
    "timestamp": 1758319200
  },
  {
    "username": "peterlevi",
    "rating": 8.2,
    "comment": "(open)\n\nGreat bidding game. The economic aspect with the market is also very strong. Supply and demand feel real. High levels of player interaction with the bidding, the map, the market.\n\nIt is on the long side, especially with more people, but I feel it's been worth it.\n\nGameplay feels smooth, not too many edge cases.\n\nOne downside I see is that the catch-up mechanic is probably too strong, to an extent that whatever players do, up until the last houses, everyone moves in a pack, which means the game is decided almost entirely in the last couple of rounds.\n\nHave had great plays at 4 and 6, haven't tried 5, with 3 it didn't work so well.\n\nEdit: More plays. I'm not sure this plays significantly different game to game. The overall arc seems repetitive. Reducing to 8.2.",
    "timestamp": 1758060000
  },
  {
    "username": "kwhite1",
    "rating": 8.0,
    "comment": "P",
    "timestamp": 1758060000
  },
  {
    "username": "rharn",
    "rating": 8.0,
    "comment": "This really impressed me. Somehow the game combines auctions, network building, economic management, and market demand evaluation into a very cohesive experience. And it manages to feel interactive and engaging throughout! Only criticism: the last couple turns can be Microsoft Excel Spreadsheet: The Board Game",
    "timestamp": 1757800800
  },
  {
    "username": "janglemangle",
    "rating": 8.0,
    "comment": "this is THE economic game\n\nauction then math then auction then math and on and on... is there anything more satisfying?\n\nbut like power grid, concordia, agricola, it's just so goddamned German that no one wants to play it. such a shame",
    "timestamp": 1757714400
  },
  {
    "username": "Indy500sr",
    "rating": 8.0,
    "comment": ".compleet\nEAN 8717249193340\nGL2",
    "timestamp": 1757628000
  },
  {
    "username": "Dasoogle",
    "rating": 8.0,
    "comment": "Preliminary rating. One play at 4 players. Definitely needs a second play. It's one of those games where one wrong play, you'll never catch up. It reminds me of Concordia weirdly enough.",
    "timestamp": 1757541600
  },
  {
    "username": "gildorn",
    "rating": 7.5,
    "comment": "",
    "timestamp": 1757196000
  },
  {
    "username": "yaofengze",
    "rating": 8.3,
    "comment": "284.67",
    "timestamp": 1757109600
  },
  {
    "username": "Anllelgp",
    "rating": 8.0,
    "comment": "Vinted 13e",
    "timestamp": 1756850400
  },
  {
    "username": "Rubeus",
    "rating": 8.0,
    "comment": "Otro \"eurogame\" sencillo de explicar, aunque con una profundidad estratégica grande, y donde vas a tener que hacer cálculos matemáticos todo el tiempo. Si te gustan los números, este es tu juego. Lástima que a mi mujer no le agrada precisamente...",
    "timestamp": 1756764000
  },
  {
    "username": "RVW0711",
    "rating": 9.0,
    "comment": "Saw the beauty of this game the first time I played it. The auction is key in this one, and I appreciate the catch up mechanic that allows the last place player to buy resources first. Great game.",
    "timestamp": 1762383600
  },
  {
    "username": "ditterio",
    "rating": 9.0,
    "comment": "HOOGSPANNING (2-6 players)\n\nSolomode: https://www.boardgamegeek.com/thread/315521/article/2342180#...\n\nAutoma solo:\n\nhttps://boardgamegeek.com/thread/3367402/frida-an-unofficial...\n\nA true classic!",
    "timestamp": 1762297200
  },
  {
    "username": "goldengamer",
    "rating": 8.5,
    "comment": "+ China / Korea Map\n+ Québec/Baden-Württemberg",
    "timestamp": 1762210800
  },
  {
    "username": "unjugon",
    "rating": 8.5,
    "comment": "A bit too much number-crunching specially in the later rounds, but other than that really great.\nLately I am discovering more pure euros like Troyes and Lorenzo Il Maginifico, and probably prefer these. It's amazing how all these designs flow though.",
    "timestamp": 1761429600
  },
  {
    "username": "bomberleung",
    "rating": 9.0,
    "comment": "BGG62\nEconomic",
    "timestamp": 1761256800
  },
  {
    "username": "Nerdvik",
    "rating": 9.0,
    "comment": "Great game with a fair amount of people.",
    "timestamp": 1761170400
  },
  {
    "username": "tag995",
    "rating": 9.0,
    "comment": "Power Grid is a great addition for 5p strategy game options. best at 4-5p.\n\nIt's old and classic,thus having some flaws, some of the rules are fidly like adjustment during step transition and refilling resources every turn, but the actions are very straightforward and thematic, beyond that it's not an opague game so everyone can easily figure out how to play but hard to master, btw it's very mathy.",
    "timestamp": 1761170400
  },
  {
    "username": "thegreatbandini",
    "rating": 9.0,
    "comment": "Even with the auction element, this really seems like an accountancy exercise.",
    "timestamp": 1761084000
  },
  {
    "username": "Ajohnny101",
    "rating": 9.0,
    "comment": "I'm assuming this is basically the same as the Deluxe edition, so i'm giving it the same score.",
    "timestamp": 1760911200
  },
  {
    "username": "Fat Tony",
    "rating": 9.0,
    "comment": "We got this from our 2010 Secret Santa, and of all the heavier Euro games that were big in the mid 2000s, I feel like Power Grid is one that's stood the test of time. We've accumulated PG maps irrationally quickly, and here's the order in which I'm interested in playing them (only maps we own so far - no buying any more maps until we've played all of these at least once):\n\n1) Korea\n2) Italy\n3) Central Europe\n4) Japan (played once)\n5) Germany (played twice)\n6) France (played once)\n7) Benelux (played twice)\n8) Spain & Portugal\n9) Brazil\n10) United States (played four times, now essentially reserved for new players)\n11) Russia (hard mode - saving for later)\n12) China (hard mode - saving for much later)",
    "timestamp": 1760565600
  },
  {
    "username": "liga",
    "rating": 8.5,
    "comment": "Probably one of the best games in the last years. Deep, intriguing and with a simple but really weel thinked ecominic mechinism. A game, I think, a gamers must have and play!",
    "timestamp": 1759960800
  },
  {
    "username": "wangwei726",
    "rating": 8.9,
    "comment": "最佳5人 不想玩",
    "timestamp": 1759788000
  },
  {
    "username": "Kroomiester",
    "rating": 9.0,
    "comment": "Power Grid is simply in a class of its own. It’s elegant, relatively short, infinitely re-playable, and infinitely expandable. The game is procedural, so it flows very nicely. It can cause AP if you play with people who want to calculate everything, but with reasonable people the game is extremely smooth and quick.",
    "timestamp": 1759788000
  },
  {
    "username": "TheFrizzyOne",
    "rating": 8.5,
    "comment": "This is a lovely game. Somehow the mixture of mechanics works really well together. There are always hard decisions to make and never enough information to plan to far ahead. The end game mechanics are abrupt and never feel totally right but more often than not produce a nail biting end game. With higher numbers of players there can be a problem with down-time, but you can always use this time to consider your plans and adjust as people make their moves.",
    "timestamp": 1759701600
  },
  {
    "username": "LL81",
    "rating": 9.0,
    "comment": "Also digital (Steam)",
    "timestamp": 1759701600
  },
  {
    "username": "MorelliBuendia",
    "rating": 8.5,
    "comment": "Expansions: New power plants 1 & 2, Russia-Japan, China-Korea, Europe-North America, Australia-Indian Subcontinent.\n\nBrilliant game. Really tense auctions, always tight on money, and the resource market is such a simple but brilliant representation of suply and demand. So far, this is how I rank the maps I've tried:\n\nKorea\nAustralia\nGermany\nJapan\nUSA\nNorth America\n\nMogul Scale: 2/C. Easy to teach, can even be played with non-gamers as long as an experienced player should be doing the maintenance phase. Very interesting decisions with the auctions, resource market, and city building. How much should I bid? How much should I buy? Should I get extra stuff to mess with the prices? Should I build these cities and go first in turn order, or stay last and risk being blocked out?",
    "timestamp": 1759528800
  },
  {
    "username": "dotneko",
    "rating": 9.0,
    "comment": "en Málaga",
    "timestamp": 1759183200
  },
  {
    "username": "colinthil",
    "rating": 8.5,
    "comment": "Kind of exhausting to play, especially in the end game which is very mathy, but a very engaging experience nonetheless. It is an interesting system to puzzle out that isn't so hard to grasp, but challenging to master. It's a bit long, and some elements are a bit fiddly, but I have to give credit to the game for succesfully representing such an unusal and contemporary theme.",
    "timestamp": 1759010400
  },
  {
    "username": "gr9yfox",
    "rating": 9.0,
    "comment": "Excellent economic game about building up a power grid. The goal is to power the most amount of cities in a network. To do that the players will buy power plants, expand their network and buy resources to run those plants. For a game of this scope the rules are very streamlined, which makes it fast-paced.\nIt has a great feeling of progress and momentum.\nThe game is very interactive because all of the other player's actions change your options: which power plants are available, where they're expanding to on the map, which resources are going to get scarce (expensive) or run out.\nCan be heavy on the math on the last few rounds, but nothing a calculator app can't help to keep things moving.\nThe rulebook makes the game seem more complicated than it actually is, but fortunately players have made helpful player aids and rule summaries.\nA classic.",
    "timestamp": 1758837600
  },
  {
    "username": "gianlucadario87",
    "rating": 8.5,
    "comment": "B_C3",
    "timestamp": 1758751200
  },
  {
    "username": "spencyrrh",
    "rating": 9.0,
    "comment": "2023-05-17 (2 plays at 4): Phwoar. Much tenser and funnier than I thought. Maybe a bit too long and opaque, given that it seems to come down to the final play. I actually think it might be too balanced. I can see myself playing this a lot, though. I don't think I'd ever turn it down.\n======\n2025-09-22 | 4 plays at 4&5p | various editions | FiSw teaching:  9  \n\nYou bid on power plants, of which you can have three and which take either one of four types of fuel or none, and then you buy types of fuel from a dynamic market affected by demand, after which you pay to build connected power stations on a map, and finally spend the fuel to power them according to your plants' capacity. The player who can power the most stations at a fixed point will win. Turn order is manipulable by number of built stations.\n\nHopefully, this game will live on as one of the enduring legacies of this hobby. Power Grid has it all: hardcore crunch, evocation, the prospect of an arc, sometimes comebacks, an accessible skill floor and a pretty high skill ceiling. The randomness and rubberbanding mean that, even though the 'best' player will usually win, they still have to perform consistently to win by any significant margin. And the game gives room to different valences of skill. If you dominate decision-making in the auctions, you will do well. But if you master the timing and turn order, then you can fuck everything else up and still have a lot of control.\n\nThe production does everything it needs to. I love the look, especially with the hardcore green of the box. Germany and the USA work fine, but many of the expansion maps sacrifice readability, usability and table space to geographic verisimilitude. No I do not want to play Scandinavia or Japan.\n\nThe rules offer almost no friction. Everybody knows how an auction works, how to pay for buildings, and how to do basic purchase arithmetic.\n\nYou want 4-5p, I think, but I'd play at any player count. I dunno if 2p would work.",
    "timestamp": 1758492000
  },
  {
    "username": "Odukla",
    "rating": 8.6,
    "comment": "Auction/Network",
    "timestamp": 1758232800
  },
  {
    "username": "Straddllw",
    "rating": 8.5,
    "comment": "I really liked this one when I first played. But then the ratings drop after each subsequent play as people started mathing out their auctions. It was a much more exciting game before that. Definitely has its flaws. Also ... paper money was a shame.",
    "timestamp": 1757973600
  },
  {
    "username": "blaklyte",
    "rating": 9.0,
    "comment": "Maps:\n- Benelux/Central Europe\n- Northern Europe/United Kingdom & Ireland\n- Russia/Japan",
    "timestamp": 1757887200
  },
  {
    "username": "jerevinan",
    "rating": 8.6,
    "comment": "파워그리드 재밌다",
    "timestamp": 1757455200
  },
  {
    "username": "BubbleheadAmber",
    "rating": 8.5,
    "comment": "PROS:\n- Very interactive with the auction, resource buying and route building\n- The changing resource market refresh adds a lot of nuances to the strategy and changes what the demand dynamics of the power plants\n- Having the future market gives you some interesting dimension of planning\n- The three phases of the game add enough wrinkle to keep the game feel refreshing and helps cycle the market along\n- The gradual 3 spaces to buy cities + the differing costs of the routes adds a dynamic routing\n- Money is quite tight and requires a lot of planning\n\nCONS:\n- Game feels like a min-max Euro game\n- Very mathy and doesn't invite a lot of funny moments\n- There's not a lot of hard blocking in this game, does feel quite solitary when crunching the numbers\n- The optimal route can be found easily given enough time\n- With all the math, game can get quite AP prone\n- The game can get quite repetitive without much variability between each game\n\nFINAL THOUGHTS:\nGreat interactive game but is quite mathy and not a lot of exciting moments for me to own",
    "timestamp": 1757368800
  },
  {
    "username": "Fuzzcrumbler",
    "rating": 9.0,
    "comment": "The Essence of a classic economic euro, with simple rules but deep strategy combined with some head scratching number crunching. Certainly, there are more entertaining games out there today, though, but this is always enjoyable. Great supply/demand mechanic.",
    "timestamp": 1756936800
  },
  {
    "username": "CptSteveRogers",
    "rating": 9.3,
    "comment": "2-6 / :3-6: / [4-5]",
    "timestamp": 1756936800
  },
  {
    "username": "Bozok",
    "rating": 8.5,
    "comment": "I like the auction component. Lots of good interaction. The problem is it can become a huge math problem, which is a bit of a chore. Does tend to have epic finishes with many cities being built all at once.",
    "timestamp": 1756764000
  },
  {
    "username": "Nonoku",
    "rating": 9.0,
    "comment": "3-6 B 4-5",
    "timestamp": 1756677600
  },
  {
    "username": "HerbertML",
    "rating": 9.5,
    "comment": "/*stay*//*#W2*/\nGreat game. Rules are quite easy but the game has great deepness. Playable as family game too.",
    "timestamp": 1761865200
  },
  {
    "username": "Rogue128",
    "rating": 9.5,
    "comment": "Highest Rank: 2 in 2006",
    "timestamp": 1760997600
  },
  {
    "username": "Josev",
    "rating": 10.0,
    "comment": "Very fun optimization game",
    "timestamp": 1760392800
  },
  {
    "username": "pibastro28",
    "rating": 10.0,
    "comment": "IL GIOCO di ASTE",
    "timestamp": 1760047200
  },
  {
    "username": "s6polska",
    "rating": 10.0,
    "comment": "Zabrze",
    "timestamp": 1759874400
  },
  {
    "username": "shmonkey",
    "rating": 10.0,
    "comment": "Another game that is easy to learn the basic concepts, but hard to execute due to the human factor. You have to change up your strategy based on available cities, available power plants, and available resources. The supply/demand resource market is an amazing mechanic.\n\nThe expansion maps and power plant decks change things up considerably. One of my all time favorites",
    "timestamp": 1759874400
  },
  {
    "username": "n4m3l3ss0n3",
    "rating": 10.0,
    "comment": "One word:clean.",
    "timestamp": 1759788000
  },
  {
    "username": "logopolys",
    "rating": 10.0,
    "comment": "Excitingly realistic optimization game. Everything is thematically perfect, and the game contains a lot more than doing math for two hours. Great catch-up system, makes runaways nonexistent. Highly recommended.",
    "timestamp": 1759356000
  },
  {
    "username": "Franckiboy",
    "rating": 10.0,
    "comment": "The best rule to bring people back in a game. Love this game. Simple to explain, difficult to master.",
    "timestamp": 1758837600
  },
  {
    "username": "Normal_st",
    "rating": 10.0,
    "comment": "Huge surprise, I've expected boring, slow game. But it's anything but boring, it's relatevely fast, auction is straightforward and amazing, area-control is again, basic, can be very punishing if you chose bad initial position.\n\nGreat game, we've played \"new\" USA map, older map looks too trashy, want to play more of it.\n\nThe only \"bad\" is obvious one, you need to calculate price of your expansion, and it can be tiresome, but not too much.",
    "timestamp": 1758751200
  },
  {
    "username": "na_wspak",
    "rating": 10.0,
    "comment": "Ping me if you're interested buying this copy. I might answer with delay.",
    "timestamp": 1758578400
  },
  {
    "username": "OGRussHood",
    "rating": 10.0,
    "comment": "My 2025 Top 250: #6\nMy 2024 Top 250: #5\nMy 2023 Top 250: #2\nMy 2022 Top 250: #1\nMy 2021 Top 250: #3\nMy 2020 Top 250: #7\nMy 2019 Top 200: #59\nMy 2018 Top 100: #85",
    "timestamp": 1758492000
  },
  {
    "username": "AlPacino11",
    "rating": 9.5,
    "comment": "Best streamlined economic game! Simplicity and market rules at their best. Maybe the best catch up mechanic!",
    "timestamp": 1758405600
  },
  {
    "username": "stephenstover",
    "rating": 10.0,
    "comment": "Love this game. We played two rules slightly wrong wo it made the game longert but long is okay with me.",
    "timestamp": 1758060000
  },
  {
    "username": "mrange",
    "rating": 10.0,
    "comment": "This is one of my favorite games of all time so that makes it a 10. I like bidding, the market is clever and I learnt a bit how markets behave from it so educational as well. The endgame is the weakest link of this game where you spend lot of time computing cost of the the optimal expansion and that is why it doesn't come to the table as often as I like. Our group uses some tweaks to the bidding phase to speed it up and make it make it less swingy.",
    "timestamp": 1757109600
  },
  {
    "username": "tiagoramosvideos",
    "rating": 10.0,
    "comment": "O jogo que mais joguei em 2024",
    "timestamp": 1756418400
  },
  {
    "username": "VickdaReaper",
    "rating": 10.0,
    "comment": "Very interesting mechanics, a nice and very balanced game. I like the depth of it.",
    "timestamp": 1755554400
  },
  {
    "username": "7RollsTheRobber",
    "rating": 10.0,
    "comment": "This is an acquired taste for many, but boy do I love it. I call it Accounting: The Game because you honestly need a ledger to play. They really should do away with the paper money.",
    "timestamp": 1755554400
  },
  {
    "username": "nysmoke",
    "rating": 10.0,
    "comment": "Fantastic game for any number of players between 3 and 6, with an acceptable amount of downtime between turns and some clever mechansims built into the game to keep things close without totally hosing the leader. ***UPDATE*** The new version, Power Grid, is a great improvement to an already awesome game. The biggest complaint of Funkenschlag - the components - has been addressed beautifully, with a gorgeous board that replaces the old charts, as well. The reduced playing time is welcome, as the feel of the game remains almost exactly the same. This is how updates should be done - great job Friedemann! ****UPDATE 8/13/04*** Open mouth, remove foot - that's what happens when you judge a game based on only a couple of plays, especially one with the depth of Power Grid. With Funkenschlag, I found myself enjoying the game more each time I played it. Power Grid is just the oposite. With each play I see more things I just don't like about the game, most notably its pace. Unfortunately, I doubt I'll convince my group to return to the aesthetically inferior, but gameplay-superior Funkenschlag.",
    "timestamp": 1755468000
  },
  {
    "username": "cheshire_cat",
    "rating": 10.0,
    "comment": "One of my all-time favourites. It is the game that brought me to the hobby. I was on a university trip and bought it to play with other students, and it was a blast. I prefer a 4-5 player count, as the map has to be a little bit tight.",
    "timestamp": 1754604000
  },
  {
    "username": "TriathlonTodd",
    "rating": 9.5,
    "comment": "Played with Jeremy, Amy, and Matt. I liked the economic aspects of this game. Very engaging.",
    "timestamp": 1754517600
  },
  {
    "username": "Doctor_Cowboy",
    "rating": 10.0,
    "comment": "Nearly perfect game, IMO. The player interaction of auctions and area control are fun and thinky, and you can definitely math every single decision out to the exact dollar, but also, you can just go with a \"feel\" for it and do fairly well at the game. Last 2 rounds are always people counting their cash and making exact calculations lol.",
    "timestamp": 1754344800
  },
  {
    "username": "Shaolin88",
    "rating": 10.0,
    "comment": "neverovatno pametno implementiran redosled igranja po fazama; jako tesna i taktički bogata igra gde se pobednik često odlučuje kroz TB (novac na kraju igre)",
    "timestamp": 1753912800
  },
  {
    "username": "Pabl0",
    "rating": 9.9,
    "comment": "Expansiones que tengo:\nEuropa/Norteamérica ()",
    "timestamp": 1753480800
  },
  {
    "username": "rafaelpaz",
    "rating": 10.0,
    "comment": "A mid-range classic with plenty of brain-twisting and a well-themed gameplay.\nIt's brilliant how it simulates the economy and the market.\nIt's exciting and climaxes in the final rounds.\nThe \"negative\" point: it takes much longer than it should for 4+ players.\nEven so, it's worth every minute.",
    "timestamp": 1752444000
  },
  {
    "username": "ravn1ca",
    "rating": 10.0,
    "comment": "Best game ever",
    "timestamp": 1752357600
  },
  {
    "username": "Wassail Games",
    "rating": 10.0,
    "comment": "Resource management, auctions, area control - a refined mix. Looks good too. The market feature demonstrates supply and demand fantastically. I really like this game - and it has extra boards - what more could you want.",
    "timestamp": 1750888800
  },
  {
    "username": "fishfoo",
    "rating": 10.0,
    "comment": "Learning the game aint easy. The rulebook is crap. Made mistakes on upkeep and set up despite having already a few games under our belt.",
    "timestamp": 1749074400
  },
  {
    "username": "thereisabird",
    "rating": 10.0,
    "comment": "Very fun, need friends who have stamina",
    "timestamp": 1748988000
  },
  {
    "username": "cagriggs",
    "rating": 10.0,
    "comment": "Includes BGG Promo Card Set, Taxes, Robots, the Stock Companies, and the New Power Plants Set 1 and 2.",
    "timestamp": 1748556000
  }
]