[
  {
    "username": "cotomel",
    "rating": 1.0,
    "comment": "Same old, same old MPS.",
    "timestamp": 1732748400
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "The starting advisors were amusing, at least.",
    "timestamp": 1722463200
  },
  {
    "username": "jrsquee",
    "rating": 1.0,
    "comment": "Too long, too dry, too fiddly. too much squeeze not enough juice",
    "timestamp": 1641596400
  },
  {
    "username": "Mayasty",
    "rating": 1.0,
    "comment": "This is a model example of the rate 1. Loooong, boring, repeatable and iritating pure abstract. I saw yet hundred times all these elements and mechanisms combined in identical way without any substantial logic. It's just a product of unleashed and improvised designer's ride through the palette of available tools in order to create as complex and bizzare ideas as only possible. I didn't find any single element that could grab my attention and raise positive feelings. Plastic domes, which are indeed rare element in games (e.g. Santorini) are far too little to stand out the whole game. For example „Pulsar 2849” of the same designer, another pure abstract game, had very interesting, intriguing and innovative mechanism of median calculation thus standing out the game. This one is a clone of dozens identical games of no intellectual value for me. I’m really tired of playing this kind of abstract stuff again and again where all players do their solitairs muttering to themselves with no interaction. Waste of 3h of my precious time.",
    "timestamp": 1640991600
  },
  {
    "username": "Glanzmuecke",
    "rating": 2.0,
    "comment": "Suchy and I will not become friends. Never ever",
    "timestamp": 1756332000
  },
  {
    "username": "iplaybgnaked",
    "rating": 2.0,
    "comment": "Dull multiplayer solitaire card driven worker placement game with card play that’s too random and a brainless broken strategy in a game already rife with obvious linear strategies.",
    "timestamp": 1711148400
  },
  {
    "username": "johnnytruant",
    "rating": 2.0,
    "comment": "Overrated, copycat, with worker-placement spaces that are too tight. Also, there's far too much RNG involved for a game that's (supposedly) strategic.",
    "timestamp": 1669849200
  },
  {
    "username": "kotgaf",
    "rating": 2.0,
    "comment": "This is not game, but a set of mechanics. Theme is almost abstract, interaction between players is minimal. Awful quality of cards and player city tablet.\nDowntime is included.",
    "timestamp": 1582758000
  },
  {
    "username": "jaw6",
    "rating": 3.0,
    "comment": "Oh, how I did not like this. It’s Worker Placement, but there’s basically no player interaction besides place blocking, just silently and efficiently turning resources into points. There’s a huge deck of cards, hope you draw something you like. It took us >2 hours with 3, two of which had played before, which is too long for a game with so little happening. There are decisions to be made, but nothing interesting here.",
    "timestamp": 1751320800
  },
  {
    "username": "darkfinale",
    "rating": 3.0,
    "comment": "Very fluid game that flows smoothly (no pun intended)\nCards seem balanced, need more plays. Theme not my type.",
    "timestamp": 1744495200
  },
  {
    "username": "wpolka",
    "rating": 3.0,
    "comment": "The decisions were not interesting enough for such a long game that's also mostly multiplayer solitaire, maybe I'm missing something but I am not looking to play this again",
    "timestamp": 1743544800
  },
  {
    "username": "Cosmitz",
    "rating": 3.0,
    "comment": "Tl;dr, don't buy it, don't even PLAY it, unless you play boardgames purely to solve a puzzle in front of you in silence for hours on end. Oh, there may be other players present, they don't matter.\n\n----\n\nA three hour and change slog that has everyone absolutely ignoring everyone else and what they do. Blocking spaces and maybe picking up end-of-game cards is the only interaction. During my game players weren't even caring about if other people were taking their correct production or what they were spending, just sitting with their actions preplanned in hand waiiting to play. There is very little reason for me to gather 3 other players at the table if this is the experience.\n\nYou'd think the solitaire puzzle aspect of it would make up for it, but it doesn't. 3 hand card limit, matching colors/abilities to placement and then figuring out triggering all the effects in the right order should be fun, like any good combo-game (see Aquatica for similar theme and good comboness), but it feels stuttery and annoying, and watching everyone stumble and take back actions to do them in a different order just to get the thing they want done out the door is just adding extra time to something that doesn't need to be longer than maybe an hour, MAX two. Also there's relatively little 'engine' happening, given the very rare three production steps throughout the game, it's mostly just scraping by. The action slots also seem unbalanced. they feel either mostly unappetizing or unquestionably good at any given time for you which makes the decision often moot. Also same for resources, it can feel like you can't build anything sometimes, and others like 'how did i get 8 science and haven't used them yet?'. Same with the cards, which also require 3 separate decks which feel mildly 'samey' with some clear 'better' between even the same age, like getting end of game scoring from the random draw.\n\nI played a version with deluxe/etsy bits and all the trimmings, and those were fun, but i can't imagine if the base game came with cardboard bits... would have made a bad experience worse.\n\nThe only neat thing is spreading out and making your little cities, but the scoring is so abstract for them and production sets make them so cumbersome that one would rather just.. not playing them, there's definitely avenues to score without caring too much about what you placed where.\n\nAll in all, no thank you. There's few games i won't replay if someone sets them up for me and just says \"let's play\". This is one of them.\n\nPS: People mentioning TM.. this has NOTHING in common with TM other than maybe the engine building aspect which is worse compared to TM. It doesn't have TM's draft, common board, quick generation production, 'race' flexible timer for game end. All things which make TM a more interesting game to table. A slightly more apt comparision is to Dune Imperium, but it very much lacks the tightness of the decision making that Dune has and ofc, Dune also has much more interaction even aside from blocking spots, between combat and faction swinging. Just don't buy or play Underwater Cities.",
    "timestamp": 1740870000
  },
  {
    "username": "cromagz",
    "rating": 4.0,
    "comment": "Standard contemporary play a card from a massive deck, swap some resources, low interaction worker placement engine builder. Inoffensive but no desire to pull it out. Cities look like you should put them in your washing machine. Only played at 2p and can imagine it drags at higher player counts",
    "timestamp": 1750629600
  },
  {
    "username": "redisher",
    "rating": 4.0,
    "comment": "Cool conversion of resources, good drawing and theme, but i can't enjoy this game.",
    "timestamp": 1717279200
  },
  {
    "username": "tolhs",
    "rating": 4.0,
    "comment": "2023:+1",
    "timestamp": 1701558000
  },
  {
    "username": "Arnaud3013",
    "rating": 4.0,
    "comment": "Lack deepness. Lack fun, combo, etc.. Going from terraforming mars, maybe didn't help.",
    "timestamp": 1699743600
  },
  {
    "username": "dale12",
    "rating": 5.0,
    "comment": "It felt so meh that we didn't even feel like finishing it. To be fair it was our first time playing it. I'm sure there must be a great game in here, but I'm not willing to search for it when there are so many other games I'd rather play than this.",
    "timestamp": 1762124400
  },
  {
    "username": "Iraperkins82",
    "rating": 5.3,
    "comment": "Really great game, almost always keeping, although has meaningful complaints as to what takes away from the experience....\n\nIf Ark Nova hadn't come along I would have definitely kept this.",
    "timestamp": 1758060000
  },
  {
    "username": "Zaungast",
    "rating": 5.0,
    "comment": "Resource conversion through worker placement.",
    "timestamp": 1751925600
  },
  {
    "username": "properplay",
    "rating": 5.0,
    "comment": "During the first play I must say I didn't like the game that much which was disappointing given its rank and how much it's hyped over here but I should know better and take these ratings with a pinch of salt since most people seem uncapable of having criteria and giving honest negative reviews when necessary. The game was way too long for what it is, a tableau builder with huge similarities to Terraforming Mars, Ark Nova, Earth and all that bunch. Changing through three decks seemed quite pointless and annoying as the cards didn't become significantly better over the three eras. All the accounting during the production phases was a pain, especially giving the correct income for pairs of upgraded buildings, vs. single upgraded buildings vs. single non-upgraded buildings, I'm pretty sure we made mistakes calculating the whole thing properly. The cards that have production effects made this even more complicated and annoying. With two players blocking action spaces on the board seemed to have little to no impact, there should be much less spaces available, there seemed to be always something decent enough to do which broke that part of the game. The theme seems quite plastered on and building things on your separate player board instead of a common board where you can fight for spots and affect each other's plays seemed like a missed opportunity. I will give the game another try with 3-4 players but it already took us 3 hours to play with 2, I'm afraid we'll need 5 hours to finish with higher player counts so I'm sort of afraid to do it. Let's see.",
    "timestamp": 1740697200
  },
  {
    "username": "Tygrone",
    "rating": 5.0,
    "comment": "A friend thought i would really enjoy this game.\nI hated proving him wrong but i didn't enjoy any aspect of this game.\n\nIt was a session filed with locations that we're already occupied so nearly any of my turns was wasted. Plus the superlong downtime, even with just three players.\n\n\nCan't see how this game is in BGG top 100, i really can't... There's other games in the top 100 that weren't hits for me or that i didn't like gameplay-wise or didn't vibe for whatever reason but where i can objectively see how others might like it.\n\nWith this, i don't. It's the worst game in the BGG-100 (of those that i've played).",
    "timestamp": 1740351600
  },
  {
    "username": "jaluth",
    "rating": 5.0,
    "comment": "Tried once. Not at all for me.",
    "timestamp": 1739401200
  },
  {
    "username": "ubRtstcl",
    "rating": 5.0,
    "comment": "A slow resource-churner that's too dependent on drawing the right cards.",
    "timestamp": 1733526000
  },
  {
    "username": "ScotchYeti",
    "rating": 5.0,
    "comment": "This is a tight worker placement game with a tough solo mode. Every action counts and there is not much room to idle around to score 100+ points. Creating the underwater network is fun and satisfying. I am using my wooden board from Terraforming Mars to track the resources, which works well and efficiently.\n\nDifferent strategies are possible with a focus on any of the resources (incl. tunnels) or using a mix. Synergies with cards are important. Definitely a keeper!\n\n=====\nUPDATE May 2022\n\nIn solo games I don't think different strategies are possible. You have to build 4-5 cities with all 3 types of buildings. For the other cities you have some freedom. I think this is where the comparison with Terraforming Mars is valid. You have a clear goal and depending on the cards the route will be different. I am still loving it. The rules are clear, games are fast and my brain gets a good workout.\n\n=====\nUpdate April 2023\n\nAfter a longer break I had a tough and frustrating time to cross 100 points again. It looks like you need the right opening for era 1 (an upgraded pair of desalinization plants, 2 cities), only then you are free to chose your own path. Now that I figured this out again, the tactical options with the cards is fun.\n\n=====\nUpdate March 2024\n\nDon't like the tightness anymore. I have played more than 40 games and it's time to move on.\n\n=====\nUpdate October 2024\n\nI guess this was it. \"Hallertau\" does everything better and doesn't have the point salad where you only know at the end how big you have scored. I will use the material for my PnP projects.\n\nRating dropped to 3 (Nov '24: increased to 5)",
    "timestamp": 1732230000
  },
  {
    "username": "abaloo",
    "rating": 6.0,
    "comment": "Expert, opportunités",
    "timestamp": 1760479200
  },
  {
    "username": "xorsyst_uk",
    "rating": 6.0,
    "comment": "Quite enjoyable take on worker placement, but suffers from the same problem as most in that genre ... you can plan all you want, and then someone takes the space you needed and you have to replan to do something different. I guess some people like that; but I find it frustrating. I much prefer WP variants where spaces aren't completely blocked.\n\nAlso a bit too long really, and nowhere near as good as Ark Nova. Better than Terraforming Mars though, imo.",
    "timestamp": 1759442400
  },
  {
    "username": "TheSlov",
    "rating": 6.0,
    "comment": "After a couple plays, I'm seeing more cracks in what I thought was a solid foundation. Changed ranking from 7.5 to 6.\nThere are many repeat cards, for example \"Black Ops\" card for each color (green/red/yellow) all with the same mechanism but different rewards. I know the rewards of the cards are to compensate for the rewards of the board actions (ie. yellow has great board action, but lack luster card rewards, with green being the opposite). Still, it gets a little boring getting the same type of card often through the play.\nThe game still \"feels\" great, as if you're building something and progressing but that definitely doesn't mean you're going to win the game. It's very unclear who is more or less ahead, and similar to Agricola you have to do a little of everything to do well.\nMy ranking is of just the base game, and I don't really see a lot of re-playability. With 3 players you run through most of the decks and probably see everything there is to offer. Hopefully the expansions add to it but I think over more plays this would get tedious and boring rather than make me want to explore more.\nT'zolkin, for example is a game that captivated me more and more each time I play and always want to try new strategies. There is not a lot of that here, and the \"politics\" in the description is severely overstated as there are basically no politics in this game.\nEDIT: Changing to a 5/10 after a bunch of solo and 2 player games. It's definitely not built well for lower player counts and only shines at 3-4. It's also next to impossible to beat as a solo game (100 points + 7 cities?), and I don't think it was designed well for that at all. I'm a little disappointed in my boy Vlad...\nUPDATE: After playing maybe 20 games, I think the game is \"good\" but not great. The card variety is definitely lacking, or lack interesting effects. It's pretty small and incremental effects rather than cards to strategize around. The solo game is still garbage and difficult, it's more for \"practice\". I wish the S-cards were a bit different or more wild, and I'd like to see actions that let you build different buildings with a single space rather than 2 of X/Y/Z. I think replay-ability is my sticking point, it more or less is the same game over and over, which you can say about many games BUT something like Agricola offers so many occupation cards that become central to the strategy that it's interesting to explore with more and more games. I don't really find that with this game, it could use some more individual powers, maybe a pre-game draft sort of like Prelude for Terraforming Mars. I play this a lot so it's hard to say if it's a good game, but I do find less and less joy each time this hits the table.",
    "timestamp": 1758146400
  },
  {
    "username": "bfrizb",
    "rating": 6.0,
    "comment": "Fun game, but the individual randomness is too impactful. I won my July 2025 game by a large margin, but felt it was mainly due to me drawing better cards than average.\n\n========\n\nDecent game, but it can last much longer than advertised (my game in March 2023 lasted ~5 hours due to AP by one player in particular).\n\nThe game has some unintuitive and easily forgettable rules with regards to building pipes/cities, and when metropolises & cities are active/producing vs not. It seems like these aspects of the game definitely could have been better designed.\n\nI think I first played Underwater Cities with Vera (+ maybe Fattig) back in 2019, but not sure.",
    "timestamp": 1753048800
  },
  {
    "username": "Bthomps4",
    "rating": 6.0,
    "comment": "Very complex to learn, need to play again and see if I can get back into it.",
    "timestamp": 1752962400
  },
  {
    "username": "Barthi",
    "rating": 6.0,
    "comment": "Bought in May 2021",
    "timestamp": 1746914400
  },
  {
    "username": "OMD56",
    "rating": 6.0,
    "comment": "Card-play worker placement with a nice engine progression while building your own city and tableau in the process. Various routes to victory. Still unsure if any one way is the main way to win. As for the cards, they all have great art with fun abilities that can be useful at the right moment without bloating your hand with too many. Really looking forward to a second play.\n\nInitial Score: 9",
    "timestamp": 1740351600
  },
  {
    "username": "Versifex",
    "rating": 6.0,
    "comment": "Tuckboxes created.",
    "timestamp": 1739919600
  },
  {
    "username": "Beru",
    "rating": 7.2,
    "comment": "#WTPextension",
    "timestamp": 1762383600
  },
  {
    "username": "CantWakeJake",
    "rating": 7.0,
    "comment": "Worker placement, where your choice of actions are limited by what cards you have. I enjoyed the tactical nature of having the cards limit you, and you had to find the best way to achieve your goals with what options you had, or change your goals.\nEdit: from 8 to 7. The game wants you to plan strategically, but the worker placement + cards means you have to be more tactical. I like tactical, but here it feels like it gets in the way more than adding fun tension. Plus it runs pretty long.",
    "timestamp": 1760997600
  },
  {
    "username": "wooloo1",
    "rating": 7.0,
    "comment": "Provisional.",
    "timestamp": 1760824800
  },
  {
    "username": "NVRAM",
    "rating": 7.0,
    "comment": "TL;DR: Another \"lots of small text on every card\" game, so not playable if lighting isn't great. Better than many in that genre, but I'm not a big fan of the genre.\n\nPro:\n- most cards are pretty self-explanatory,\n- iconography is consistent,\n- game play is fairly quick after a handful of rounds (other than deciding what to discard!).\n\nCon:\n- lots of small text, good lighting is an absolute requirement,\n- luck in card drawn can cause uneven progress, though not sure if this is common or just my experience,\n- felt too restricted at 3P, would not want to play at 4P - so this would probably never make it to my table.",
    "timestamp": 1760824800
  },
  {
    "username": "Alien3000",
    "rating": 8.3,
    "comment": "+ Underwater Cities: New Discoveries (2019)\n+ Underwater Cities: Data Era (2025)\n+ Upgrade Kit - 147 Pieces",
    "timestamp": 1762210800
  },
  {
    "username": "sima16",
    "rating": 8.0,
    "comment": "Played just in two player game",
    "timestamp": 1762124400
  },
  {
    "username": "Anarchosyn",
    "rating": 8.0,
    "comment": "Solid game. Tricky decision space. Would rate higher, but the design feels a bit old (classic, if you will). Solid, but not pushing any boundaries.\n\nNot a big fan of the stingy feeling in the tableau building (single use action cards per era, limit if four, etc), but enjoy the early game resource scarcity, and playing around that.\n\nEdit 11/01/25: Raised to 8 after multiple plays (from 7.5).",
    "timestamp": 1762038000
  },
  {
    "username": "joecool42",
    "rating": 8.0,
    "comment": "- New Discoveries\n- Biodome Promo\n- Cooper & Flexible Friend Promo\n- Mini-expansion\n- Data Era",
    "timestamp": 1762038000
  },
  {
    "username": "disobedientlib",
    "rating": 8.8,
    "comment": "+ New Discoveries expansion and 3d printed resources, tokens, and coins.",
    "timestamp": 1762383600
  },
  {
    "username": "Marcymaru",
    "rating": 8.5,
    "comment": "Includes Biodome promo\n+ New Discoveries expansion\n+ Cooper & Flexible friend promo\n+ Mini-expansion (Essen 2023)\n(Everything is base game box)\n+ Data Era expansion",
    "timestamp": 1762297200
  },
  {
    "username": "ditterio",
    "rating": 9.0,
    "comment": "UNDERWATER CITIES (1-4 players)\nNEW DISCOVERIES (1-4 players)\n\nRulebook base game: https://boardgamegeek.com/filepage/169831/underwater-cities-...\n\nRulebook expansion: https://boardgamegeek.com/filepage/189532/english-rules\n\nComplete iconography, including the expansion: https://boardgamegeek.com/filepage/191165/action-andy-comple...\n\nQuickstart: https://boardgamegeek.com/filepage/248057/quickstart-underwa...\n\nSummary: https://boardgamegeek.com/filepage/303631/underwater-cities-...\n\nFAQ: https://boardgamegeek.com/filepage/187558/underwater-cities-...\n\nMy solo topscore: 109\n\nSolo:\n\nOfficial Solo\n\nKind of solo: Bear your own score with condition (100 points and 7 cities)\n\nTime: 60 minutes\nSetup: Medium\nDifficulty: Hard\nAutoma management/Upkeeping: None\nRequirements: None\n\nOpinion: Card placement game with tight decisions. The replaybilitity is given by the big number of cards and the tough winning conditions\n\n+ Rules are quite intuitive explained well in the rulebook\n+ Triggering winning conditions are quite challenging\n+ Great and well applied theme\n+ Very thinky\n\n- it might be difficult to track the abilities of all played cards and you might forget to trigger a bonus\n- Blocking actions are predictable\n\n\n\n------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\nUnofficial Solo Variant - Rob McDyver\n\nKind of solo: Automa\n\nTime: 70 minutes\nSetup: Medium\nDifficulty: Medium\nAutoma management/Upkeeping: Easy\nRequirements: Solo board and 16 cards (PnP)\n\nOpinions: Great solo variant to play against an automa that is easy to manage and provide a solid challenge. The automa is compatible with the expansion Underwater Cities: New Discoveries as well. solo.\n\n+ Compatible with the expansion\n+ Behave similarly to another player\n+ Limited amount of cards to be printed\n+ Different scoring ways at the end of the round\n+ Three different levels\n\n- Require a solo board\n- The playtime is slightly longer than the official solo\n\n\n\n-------------------------------------------------------------------------------------------------------------------------------------------------\n\nUnofficial Solo Variant - Enhanced solo\n\nKind of solo: Beat your own score with condition (100 points)\n\nTime: 60 minutes\nSetup: Medium",
    "timestamp": 1762297200
  },
  {
    "username": "larryonov",
    "rating": 9.0,
    "comment": "Best: 2, 1\nSolomodus v. Sir Ann unknowns",
    "timestamp": 1762038000
  },
  {
    "username": "posterchild21",
    "rating": 10.0,
    "comment": "with New Discoveries and Data Era",
    "timestamp": 1761951600
  },
  {
    "username": "sharkboy666",
    "rating": 9.5,
    "comment": "+New Discoveries Expansion\n+Essen Mini-Expansion\n+Data Era Expansion\n+BGG Metal Coins",
    "timestamp": 1761692400
  },
  {
    "username": "Yonger",
    "rating": 10.0,
    "comment": "Wow Wow Wow, this one is great. I've only played it once but looking to play it more. Feels a little like Terraforming Mars? A little like Everdale? Worker placement where you get resources/do actions based on spaces. You also play out a card and if the color of the action space and card match you get what's on the card. Cards are immediate effect, or production, or augments, or action cards. Cards are wildly different, and you can really go in different directions. There are also special cards in the center that do cooler things you can get... Players have their own boards where they build up domed cities with cool plastic domes that people kept stopping at the table to play with, factories, and tunnels between domed cities and surface cities. Connecting to surface cities provides bonuses, building factories and other things produces resources. Many different ways to go... solid game!\n\nThis is from my blog...",
    "timestamp": 1760911200
  },
  {
    "username": "bdavid0127",
    "rating": 10.0,
    "comment": "H",
    "timestamp": 1760738400
  }
]