[
  {
    "username": "Alyssa Oolacile",
    "rating": 1.0,
    "comment": "The game is good and \"elegant\". You have to take into account various factors with each choice.\n\nHowever, I just don't find what it proposes interesting or fun. I feel like I'm just \"moving and placing houses\". I know there's more to it and would even recommend it to certain people, but it just isn't for me.",
    "timestamp": 1736118000
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "More like Discordia.",
    "timestamp": 1724191200
  },
  {
    "username": "sgosaric",
    "rating": 1.0,
    "comment": "Spread Sheet Victory Point Matrix the Game.\n\nI really wonder what happened to Gerdts. Imperial is a true classic, the new ones were just euro puzzles with a rondel. And now he is here - same thing with no rondel. More or less MPS game with some leeching (yay!) and \"soft blocking\" (you have to pay more!). The key is building your deck of actions - it works kinda similar to Havana (having a special action to take discard back to your hand).\n\nGraphics are hard to read and pretty generic. The game is about optimising your way through the spread sheet with some luck and randomness included as is in fashion these days. Both Brügge and Ginkopolis are better versions of card play with the board.\n\nBasically it's a generic JASE amidst the ton of other JASE games, but somehow gamerZ find this one distinctive. Huh?",
    "timestamp": 1642719600
  },
  {
    "username": "christhomas226",
    "rating": 1.0,
    "comment": "Boring",
    "timestamp": 1641337200
  },
  {
    "username": "ingedico",
    "rating": 1.0,
    "comment": "Euro",
    "timestamp": 1629669600
  },
  {
    "username": "Kushu",
    "rating": 1.0,
    "comment": "only for score maximalists. cryptic scoring, no way to gauge your progression against other players. Strategies are impossible to counter.",
    "timestamp": 1576278000
  },
  {
    "username": "turbodiedas",
    "rating": 1.0,
    "comment": "Very bad",
    "timestamp": 1549321200
  },
  {
    "username": "Frozen Flesh",
    "rating": 1.0,
    "comment": "I came here, because of all the people rating mature themed games like KD:M or Hate with a 1, just because of their mature theme.\nThis games theme is boring!",
    "timestamp": 1547074800
  },
  {
    "username": "Ievy",
    "rating": 1.0,
    "comment": "I really want to like this game, but playing it is a slooooooow form of torture. Gave it several tries, but it's first and only game I just truly dislike.\n\nThe mechanics and the game design are great, but Concordia is incredibly low on player interaction. Since I enjoy games with a lot of player interaction, this game is regrettably not for me.",
    "timestamp": 1520722800
  },
  {
    "username": "Biscotti",
    "rating": 1.0,
    "comment": "Nothing wrong with game. I'm sure its a splendid affair. However after watching run through and or reading reviews, absolutely no desire to play.",
    "timestamp": 1481238000
  },
  {
    "username": "apollak10",
    "rating": 1.0,
    "comment": "Like a loooong slog through thigh deep mud, only to arrive just as someone beats you to it. Which wouldn't be so bad if it didn't take several turns to set up for every move. Then you can try something else if you have the correct resources, or go on with your plan if you have the money to pay double. Cards cannot be counted on as by the time your turn rolls around it may be a completely new set and not ones you can afford or even use. Locations may favor the start players and that may or may not be mitigated by the \"double prizes\" for the last player. Almost no way to plan ahead. Given the random board setup and rotating cards, I would argue there is luck involved. Luck in turn order vs. board lay out and how the cards come out. Played 2 games, one 4 player and one 5 player. Won one, lost one. I don't hate Euros by any stretch, but you could not pay me to play this one again! Pure torture.\n\nSold at JVMA - making lemonade...",
    "timestamp": 1435960800
  },
  {
    "username": "gw guy",
    "rating": 1.0,
    "comment": "loooong game, fiddly",
    "timestamp": 1407448800
  },
  {
    "username": "tectactoe",
    "rating": 2.0,
    "comment": "Having played this around a dozen times now, I'm convinced that there's more to it, some \\thing\\ that I'm clearly missing that shifts the turn-by-turn gameplay from largely aimless and opaque to honed and purposeful. As of right now, I play the game, I (mostly) have an enjoyable time playing the game, I do things that (I think) should be good/smart moves, and then when the game ends sometimes I am near the top (and have even won a few games), other times I am dead last, and I couldn't begin to tell you how or why my performance varies so wildly because my overall strategy hasn't drastically changed from game to game. Something keeps drawing me back, though, even if it's just determination to \"figure it out\".",
    "timestamp": 1762297200
  },
  {
    "username": "Glanzmuecke",
    "rating": 2.0,
    "comment": "Certainly not my type of game. So much headache. Considering which card should be placed in your deck, planning ahead. hell no",
    "timestamp": 1756245600
  },
  {
    "username": "PrintandPlayPirate",
    "rating": 2.0,
    "comment": "Mind numbingly boring",
    "timestamp": 1739487600
  },
  {
    "username": "neiglib",
    "rating": 2.0,
    "comment": "+ 간결한 룰에 5인 플레이가 가능한 유로게임이라는 특이한 위치\n- 게임 중 테마를 일절 느낄 수가 없어서 몰입이 떨어짐\n- 오래 된 게임임을 감안해도 구린 아트웍과 당최 의도를 알 수 없는 박스 사이즈\n- 덱빌딩 요소가 있지만 기존 카드의 강화 버전 구입뿐이라 만칼라 특유의 반복적인 느낌을 해소하는 데는 실패\n- 승점 파악이 어려워 게임 중간에는 긴장감이 없고 내가 잘하고 있는지 어떤지 의식도 어려운데다가 게임 끝나고 나서 왜 이겼는지도 모르는 허무함이 큼",
    "timestamp": 1733094000
  },
  {
    "username": "latschediwes",
    "rating": 2.0,
    "comment": "Learn the rules & how to score points, make plans and see plans come to fruition. As if the indoctrinated lip services of real life should be applied to the realm of gaming. For good measure, add inexpressive and bland visual design.\n\nPlaying the game makes you feel like a logistics officer wearing a toga. It's dry as a cracker, low on player-to-player interaction and high on bureaucratic optimisation. The actual process of play is self-centered and passive. It's the same back and forth without flexibility. There is nothing really to talk about during the game or after the game. It reminds of those tedious deckbuilding games, but without the shuffling.\n\nThe goal of the game is initially opaque. It's neither complicated nor complex. It's just so that persons can memorize a handful of scoring options beforehand and show the noobz which side their bread is buttered on. There is points for everything, but all matters more or less depending on the right cards. Main interaction takes place in form of a race betweeen players for the cards that will reward their strategy most.",
    "timestamp": 1725573600
  },
  {
    "username": "Poptech",
    "rating": 2.0,
    "comment": "A non-intuitive, headache inducing mix of arbitrary and convoluted resource allocation rules to optimize your final score. It is so easy to feel like you just did something wrong and wasted a turn which will likely cost you the game. When a game feels like a grueling math exam and hard work all at the same time, it is no longer fun. Euro gamers love obtuse spreadsheet calculation games that would bore the average person to death and for them this delivers.\n\nNot only is this the epitome of a \"trading in the Mediterranean\" game, the game is not even about wealth accumulation since the trading goods part is just subterfuge for getting your pieces on the board and acquiring more god cards that optimize your final scoring using those pieces. But you cannot even focus on a single strategy and hope to win, you need to focus on 3 or more at the same time. How is this fun?\n\nAs with most euro trading games the prices are all apparently set by some commie czar and do not fluctuate as they would in a real economy. This is why players who enjoy these games usually cannot handle actual market based economies. They instead \"play\" command economy games like this fooling themselves into thinking they are clever.\n\nThe game includes nonsense-euro mechanics where you add another colonist to the board and now your individual colonists have the ability to travel farther. Wait what, how does that make any thematic sense? Or that when you put out more colonists you now have more warehouse space. Huh? Were your colonists living in your warehouse? How come you can keep building new trading posts but you cannot build a bigger warehouse? And why can you only build 15 trading posts? Did the Roman Emperor set a limit on these? The game makes little sense and for that I see little sense in continuing to play it.",
    "timestamp": 1716328800
  },
  {
    "username": "Epidemius",
    "rating": 2.0,
    "comment": "Rating after initial play. Very multiplayer solitaire with minimal interaction. The pseudo historical theme saves it from a 1. I love historical war games and this makes me think about those.",
    "timestamp": 1712872800
  },
  {
    "username": "hammerthyme",
    "rating": 2.0,
    "comment": "I could not get on with this game, unfortunately. I found it very, very dry, with no dramatic moments, very little meaningful player interaction, and almost every available action was dull. Played twice at 4 player on the Italia map and it felt interminably long. The end-of-game scoring was opaque, which meant that nobody was invested in the competition, just carrying out efficient actions and converting goods almost by rote. Without doubt, after enough plays, the scoring would become intuitive, but I don't feel in any way compelled to invest the time into more plays in order to get to that point. Disappointed as I'd heard such good things. Just not a game for me.",
    "timestamp": 1683064800
  },
  {
    "username": "SlikkRikk",
    "rating": 2.0,
    "comment": "Everyone seems to like this one a lot. I'm so-so on it. There's some clever things but not enough to make me want to like it. And when we're playing a dry euro with water printed on the board and shipping goods, the mechanics better be FREAKING AMAZING. I wasn't as impressed, unfortunately, with this one as much as others are. *Update* I tried it again. It failed again.",
    "timestamp": 1673737200
  },
  {
    "username": "HermanDupre",
    "rating": 2.0,
    "comment": "Literally painful to play. Will give almost all new players a headache. No redeeming theme or artwork.",
    "timestamp": 1659304800
  },
  {
    "username": "farmergiles",
    "rating": 2.0,
    "comment": "Mostly pretty boring really - not much replayability, you don't interact that much, it's cookie cutter Trading in the Med with a titchy deck building mechanic pasted on. Losing those multiplier cards to someone else can also cost you the game and you won't always have control over that.",
    "timestamp": 1606086000
  },
  {
    "username": "Revangavator",
    "rating": 2.0,
    "comment": "Trading in the Mediterranean 2 hours. No thank you, I would rather watch opera 2 hours! My god is this game dry...",
    "timestamp": 1527199200
  },
  {
    "username": "SoloGamingDad",
    "rating": 3.0,
    "comment": "OK. Not sure what all the love is about. I'd like a little more variation. It's dull. It seems like you can just do any action your cards make available, build whatever you can, and it all comes out in the wash. I'm not a fan.",
    "timestamp": 1762636260
  },
  {
    "username": "jdtaylor",
    "rating": 3.0,
    "comment": "A sandboxy game where you can do anything, and anything you do will give you points.\n\nThe decision space is so vast, the turns are so long, the game is so slow... and there's no feedback. No friction. No consequences. Just do stuff for hours, until it's time to fill out the big spreadsheet to discover who's stuff earned 112 points and beat someone else's stuff that earned 108 points.\n\nMore tedious than I can tolerate. Power Grid is action-packed by comparison. It keeps you on a strict agenda, hands you the levers of interaction to outmaneuver other players (auctions, map blocking, turn order manipulation), and delivers immediate consequences. Gimme more of THAT.",
    "timestamp": 1762210800
  },
  {
    "username": "royalty_valens",
    "rating": 3.0,
    "comment": "The game as presented is pleasant, but the rules do not enforce ideal play and rewards players with a min/max mindset who do not engage with most of its mechanics. Plus, at any player count it goes on way too long.",
    "timestamp": 1761343200
  },
  {
    "username": "Scifi66",
    "rating": 3.0,
    "comment": "A rondel design on cards which double as scorers. Initially loved it but now find it unexciting. The design should appeal to many though and worth trying.\n+ Elegant design, with good game \"flow\"\n+ Can be quick have played a 3p game in 1 hour which was satisfying\n+ lots of maps for different numbers you need Aegyptus/Creta/Cyprus maps for 2p to create some tightness\n– low interaction\n– scoring is hard for new players to understand",
    "timestamp": 1761256800
  },
  {
    "username": "X4_Commander",
    "rating": 3.0,
    "comment": "After playing 75% of Game time, going too hard",
    "timestamp": 1756072800
  },
  {
    "username": "ultimoratio",
    "rating": 3.0,
    "comment": "including:\nSalsa\n8 forum tiles exp\n\nUPDATE: Jul 2024 - \n\nI'm growing old and getting more mellow. Concordia is easily the mid-weight efficiency Euro that I will gladly play out of all its peers. Sheer elegance and the game is surprisingly colourful without it being an absolute eyesore like so many of these new modern Euros that looks like someone puked on them after drinking a bottle of food colouring\n\n====================\n\nUPDATE: Mar 2022\n\nThe game is just too linear for me nowadays. It's easy to just pick a combo of gods as your strategy, max it all out, and win with it.\n\nConcordia is now Mac Gerdts' least interesting work from his ludography. Anything (other than Hamburgum) is better than this. Yes. Transatlantic is better.\n\nImperial/Imperial 2030 is still Gerdts' best one for its sheer depth and opacity.\n\n==============================\n\nUPDATE: Aug 2021\n\nConcordia is still a Mac Gerdts design: simple, strategic. has sufficient player interaction. However, I am cooling with Concordia. I have perhaps played it for approx 25 times and the strategy is no longer as deep as I thought it is now that I am exposed to other games by Mac Gerdts too, but also more Cube Rails and 18xx.\n\n========================\n\nThe tightest mid-weight Euro I've ever played. On your turn, you play a card and you do what it says. End of turn. Fantastic Euro game that doesn't stop other players from being blocked, but rather just make it more costly for them.\n\nConcerns of the lack of player interaction seems to be mooted with experienced players. Experience players will make sure to leech on your actions.",
    "timestamp": 1755640800
  },
  {
    "username": "RollToReview",
    "rating": 3.0,
    "comment": "I know this is heresy, but Concordia left me completely cold.\n\nIt’s elegant, yes. Streamlined, sure. A Euro classic, absolutely. But after a few plays, I walked away feeling like I’d spent 90 minutes organizing a spreadsheet in ancient Rome—with no idea if I was winning until the final tally blindsided me.\n\nI get why people love it. The player interaction is subtle but sharp, and the decision space opens up nicely with experience. But for me? It felt like playing in the dark, with no feedback loop and no spark. Maybe I’m too impatient, maybe I need more plays… or maybe I just don’t enjoy sweating over Roman logistics in total silence.\n\nRead my full grievances in my review https://rolltoreview.com/concordia-board-game-review/",
    "timestamp": 1748037600
  },
  {
    "username": "Xquarky",
    "rating": 3.0,
    "comment": "Just a race to the card market for the multipliers! Strange end game scoring. Hand management is not interesting. All you do is move, go the the market, do prefect, build, grab cards, rinse and repeat few times.",
    "timestamp": 1730847600
  },
  {
    "username": "precastwig",
    "rating": 3.0,
    "comment": "We played this quite a few times and couldn't find the fun. The scoring never clicked with anyone.",
    "timestamp": 1723068000
  },
  {
    "username": "Nicolas Weiss",
    "rating": 3.0,
    "comment": "Concordia was all the rage in the mid-2010s and often described as the best mid-weight Eurogame. Plus it was from the designer of Imperial, which inspired confidence. Knowing this was probably not my jam anyway, I bought a box as a gift for a friend who had proven a bit more optimisation-happy than I was. His copy is to my knowledge still in shrink, and now that I've had the opportunity to play the game, I'm now wondering whether he'll find anyone in his family/friends whose enthusiasm will not have taken a nosedive halfway through the rules teach.\n\nTo be fair, the points of player interaction in Concordia are non-null, but more of less limited to the following:\n• Players can't stop movement on the same road segment.\n• Depleting an increasing amount of regions makes it more tempting for another player to refresh them all for a massive cash injection.\n• Triggering resource generation does so for all valid players.\n• The later you are to build in a city, the more expensive.\n• Additional action/VP cards are first-come first-served.\n\nOnly the latter two really qualify as relevant to your thought process, so, what we're having here is essentially a race of converting resources into resources into victory points (*my favourite*...) through the acquisition of specialised personal scoring conditions. And that race is somewhere on the spectrum of a half-convincing attempt at justifying not being multiplayer solitaire. But the level of mathematical obfuscation of the final scoring (the lifting of which would slow down the pacing to an excruciating level) means that in practice other players’ positions don't really matter outside of the cards they're likely to snatch first. Frankly, I just felt like I was playing a long and complicated version of Splendor with needless additional steps that have little upside. If Concordia is the best in its genre, I fear my personal taste has nothing but expletives for its genre.\n\nModern Eurogamers will love it, though.",
    "timestamp": 1709506800
  },
  {
    "username": "fenadoruk",
    "rating": 3.0,
    "comment": "very weird scoring system",
    "timestamp": 1677452400
  },
  {
    "username": "Peter Loftus",
    "rating": 3.0,
    "comment": "Too euro for me. Some of the mechanics are vaguely interesting but no need for me to keep this.",
    "timestamp": 1644620400
  },
  {
    "username": "SecretSauce275",
    "rating": 4.0,
    "comment": "- After second play with Salsa expansion: a little better as scoring was clearer but did not make me come around on this game. Pens out, calculators on, let's start counting it all out because nobody knows nothing about what the others did the last two hours - except for the one or two special cards they obtained.\n\n- let me start good things: quick turns, very clear and few rules (entire rule set was taught to me in 10 min). Liked the hand management aspect of it and that everything happened on a shared board, no individual tableaus (easier to parse all the information), also the \"copy and paste\" cards made it very interesting\n- neutral: art and theme. Do not understand complaints about the art style. Not overwhelmingly beautiful but totally fine. While the theme does little in terms of immersion it at least provides a coherent framework. Also do not understand complaints in that department.\n- negatives: at its heart Concordia is a spreadsheet game that rewards computing as many of your turns in advance as possible. Most of the time you are chaining your actions to achieve a state of resource wealth to be able to build or buy a set of cards (produce in province x, then swapping resource x for money to buy resource z, then buy the card to be able to…). If you love efficiency programming, this is your game.\nVp scoring is somewhat convoluted (during first play) and I assume it must be hard to keep track other players' scores. Only indirect interaction through going to places first (increasing cost for others) and snatching cards. What ultimately lead to my contrarian overall assessment of the game: It was a pretty dry heads down business for me. And there was little feeling of achievement. In spite of the rather quick turns I got bored and impatient quite fast. In spite of my admiration for the slick game design, it did not create much engagement or above average fun.\n\nOn 2nd play with Salsa expansion it was more fun but still not my cup of tea.\n\n\n\nApp",
    "timestamp": 1752703200
  },
  {
    "username": "TheWrongTrousers",
    "rating": 4.0,
    "comment": "Played with 5, and solo. Felt pretty similar. Take that as praise for the Solitaria expansion bot, and criticism of the game.\n\nI just don't get the appeal. There is no theme, just trading goods to the bank and building houses. Sure, but the gameplay doesn't make up for it. Repetitive, little interaction. You're deck building, but largely buying identical cards to ones you already have, so there is little sense of progression. The concept of buying these cards for scoring is ok in concept, but was fiddly and underwhelming.",
    "timestamp": 1743372000
  },
  {
    "username": "Jonathanvito",
    "rating": 4.0,
    "comment": "It wasn’t really my group’s cup of tea. While it has some interesting mechanics, we found the overall experience to be a bit too slow and, unfortunately, boring for our taste. We couldn’t even finish the game!",
    "timestamp": 1740351600
  },
  {
    "username": "dopebones",
    "rating": 4.0,
    "comment": "This is a good Euro game, I like that all the action happens on one central board as opposed to player boards, the map is really important, and the card market is reminiscent of Pax Porfiriana.",
    "timestamp": 1735426800
  },
  {
    "username": "BoardGamingCouple",
    "rating": 4.0,
    "comment": "4/5\n\nconcordia is a fantastic game at all player counts. the secret scoring keeps everyone engaged and on their toes for the entire game. turns are fast and short. the smaller maps are tighter and provide more interaction which is lovely. the newer maps offer unique gameplay compared to the older maps which offer nothing new. salt as a wild resource is a wonderful addition, the wine/cloth board is a great addition as well, & the fish market is a nice way to change things up from time to time. the rondel in this game is amazing. the artwork is great, but the theme could definitely be WAY BETTER. 100+ plays.\n\nHouse rule: no forum board. Just deal 2, keep 1 of the powers to players. They have that ability for the whole game (player power) & they can use the 1 time ability once during the game. Streamlines gameplay - SUSD.",
    "timestamp": 1735254000
  },
  {
    "username": "klebinaldo",
    "rating": 4.0,
    "comment": "Despite the random cards and random cities, the game cannot be replayed even in the second game.",
    "timestamp": 1729461600
  },
  {
    "username": "NormandyWept",
    "rating": 4.0,
    "comment": "Whilst cleaner and more coherent than many other popular contemporary Euros, I find the player interaction (largely a race for locations) unsatisfying, and the scoring largely disconnected from the gameplay - as well as a nightmare to explain to new players.\n\nThe game is also starting to suffer from an array of unnecessary and terrible expansions being released, which completionists insist on playing with. Forum tiles work entirely against the idea of trying to efficiently play your cards before recalling them, salt isn't an interesting addition, and the Venus team play was underwhelming.",
    "timestamp": 1710284400
  },
  {
    "username": "Adverb",
    "rating": 4.0,
    "comment": "I really want to love it, but I'm just not wowed by the 2p game. The board was loose, even on so-called 2p maps, and interaction therefore minimal, although the ability to use your opponent's cards is a nice touch that extends your deck. Experience thus far has been \"s/he who nabs the 7-point Concordia card wins.\" Which is decidedly Not Fun after 90 minutes of gameplay.\n\nDecent game. Not magical, and probably better with 4-5, which would surely make for a tighter, more competitive board. However, I'm unlikely to see that player count very often, if ever.\n\nNow Also With: 2 expansion boards. Hoping this will tighten up the lack of interaction that plagued the base game maps. (NARRATOR: It doesn't. Yes, it's an easy-to-grok, puzzly little piece of multiplayer solitaire. Just not one that I want to continue exploring. Ultimately murdered to death by our 2024 2p 10x10.)\n\nImperium (base): 5p\nItalia (base): 4p\nGermania (exp1): 6p\nBrittania (exp1): 2-3p\nCreta (exp3): 2p\nAegyptus (exp3): 2-3p",
    "timestamp": 1705186800
  },
  {
    "username": "Joaof",
    "rating": 4.0,
    "comment": "I played a 5-player game of concordia and found the game flat. The idea of choosing the card to play from all your available deck is nice, i would like more games to use this mechanic but the rest felt very dry.\n\nThe card market is not exciting, there isn't much card variability. And the game strategy seems to be to put as many houses and pieces on the board as you can before switching to grab any card you can from the market for points.\nI'm baffled to find some many high ratings for this. The hobby is blessed with so much more and better games that i think i won't be playing this one again.",
    "timestamp": 1700521200
  },
  {
    "username": "JasonSaastad",
    "rating": 4.0,
    "comment": "strategic contest\nmoderate skill:moderate luck\nmain course\n\n deterministic hand-management\n public drafting\n\n manic market\n prolonged playtime\n:thumbdown: dizzying downtime\n incidental interaction\n\nThe more I play it, the less I like it. I like the strategic potential deck building games provide, but so few get them right. The game gets longer and longer with more and more downtime inbetween turns, with no ability to interrupt my opponents, and being a gut player, I don't waste my time constantly re-evaluating my strategy as my opponents take their turns, so the game becomes less interesting with each subsequent turn, and despite the strategic path drafting specific cards allows you to take, you still have to adjust your tactics every turn due to minor mathy annoyances rather than intentional player dickery. I stopped playing my copy, and gave it away once I realized the type of players that gravitate towards it weren't interested in the more interactive games I actually want to play.\n\nThis variant would convince me to play it again.",
    "timestamp": 1695333600
  },
  {
    "username": "Starcadian",
    "rating": 4.0,
    "comment": "The rating is for two players, base game, Italia board.\n\nIt's a decent game, to be sure, and has a fair amount of stress in its decision making, but it is ultimately too predictable and boring/dry. It is like the map section of Orléans, but with some more detail. Better to just play Orléans and have more dynamism and fun.\n\nAdmittedly, my partner and I enjoy games with an element of ongoing chance/luck that, like life, affects our decision-making. If Concordia had a chance mechanism it would be more fun for us. We really wanted to like it.\n\nAlso, the scoring system is kind of dull. You don't know until the end how many points players have. We like games where there's more obvious scoring tension as the game goes on.\n\nThat said, it would make a solid second or third Euro game for people new to the genre.",
    "timestamp": 1691445600
  },
  {
    "username": "brownsound",
    "rating": 4.0,
    "comment": "Meh. Nic wielkiego w moich oczach.",
    "timestamp": 1690063200
  },
  {
    "username": "shmonkey",
    "rating": 5.0,
    "comment": "Decent decision space in a game that doesn't have a ton of rules overhead",
    "timestamp": 1759874400
  },
  {
    "username": "adi_venturer",
    "rating": 5.0,
    "comment": "Surprise, surprise - another \"all time classic\" board game glorifying colonization. On the positive side, this game features one of my favorite mechanics - hand management/action retrieval. On the negative side, this game is beige, has a painted on theme, has no visibility into scoring, and takes too long to play.\n\nIf you're looking for a much better gaming experience with a similar card mechanic - try Aquatica!\n\n(Plays: 1)",
    "timestamp": 1759010400
  },
  {
    "username": "sunibd",
    "rating": 5.0,
    "comment": "I don't think I'm a fan of slow paced tight resource trading games. The game is a bit of slog - costs a brick and a wine to get a wine - wait you can buy stuff next to every meeple not just the one you just moved.",
    "timestamp": 1753567200
  },
  {
    "username": "USSRocker",
    "rating": 4.5,
    "comment": "It's a kinda dry, and kinda soft eurogame. There are some good ideas, but they are not fantastic at all.",
    "timestamp": 1751320800
  },
  {
    "username": "JoshuaStarr",
    "rating": 5.0,
    "comment": "The definition of elegance and the quintessential mid-weight game. Just a handful of actions and a board to use them on. If this was just a touch more interactive it would see far more play at my table. Unfortunately, this game tends to lose out to Hansa Teutonica when the table is up for a mid-weight Euro.",
    "timestamp": 1750111200
  },
  {
    "username": "zenmester",
    "rating": 5.0,
    "comment": "købte det da det var højt anbefalet af shut up and sit down, men jeg har svært ved at se fidusen.",
    "timestamp": 1749074400
  },
  {
    "username": "apkendrick",
    "rating": 5.0,
    "comment": "It is compelling and surprisingly tricky. But overall it’s too procedural for my taste and lacks excitement.",
    "timestamp": 1748988000
  },
  {
    "username": "wanne",
    "rating": 5.0,
    "comment": "bei Frank gespielt",
    "timestamp": 1743544800
  },
  {
    "username": "staszek",
    "rating": 5.0,
    "comment": "Essen 2013",
    "timestamp": 1730070000
  },
  {
    "username": "Zaungast",
    "rating": 5.0,
    "comment": "Gameplay matches artwork: ancient.",
    "timestamp": 1729461600
  },
  {
    "username": "sbowlds",
    "rating": 5.0,
    "comment": "I was surprised when I saw how high this was on BGG. It’s not a bad game by any means, but the gameplay feels kind of dry and the card method of gaining victory points doesn’t help feel like you’re in the world of the game you’re playing in.",
    "timestamp": 1724277600
  },
  {
    "username": "HirsuteZombie",
    "rating": 4.8,
    "comment": "Haven’t opened need to play",
    "timestamp": 1721685600
  },
  {
    "username": "graybeard76",
    "rating": 5.0,
    "comment": "Played it twice, and there was just something about it that kept me from liking it. Perhaps it is the fact that you always seem to be struggling with getting more goods you need for transactions.",
    "timestamp": 1720562400
  },
  {
    "username": "pingus",
    "rating": 5.0,
    "comment": "It's solid, but there is not enough excitement and tension",
    "timestamp": 1708038000
  },
  {
    "username": "Hegiel",
    "rating": 5.0,
    "comment": "Only mediocre. When I see this game my mind starts to wander. I will play it only if I must and if friends would bring it to the table with no altenative.",
    "timestamp": 1702767600
  },
  {
    "username": "halbert82",
    "rating": 5.0,
    "comment": "Essen'13\nMolt eurogame, mezcla diferents mecàniques (construcció de rutes, set collection, gestió de mà) amb un mecànisme de deckbuiding similar al del Lewis & Clark. Té un sistema de puntuació final per bonus de cartes (en funció de les cartes que hagis comprat, multipliques un cert tipus de recursos per un factor) que em sembla massa exponencial. Tema sec i poca interacció. Em sembla poc interesant, no aporta res nou...",
    "timestamp": 1695160800
  },
  {
    "username": "shrimpyp",
    "rating": 5.0,
    "comment": "Overrated strategy game to me and my group",
    "timestamp": 1693864800
  },
  {
    "username": "The Pirates",
    "rating": 5.0,
    "comment": "Smooth gameplay with the perception that you are making good progress all along allows forgiveness that it lacks dynamic scoring.",
    "timestamp": 1693519200
  },
  {
    "username": "salkind",
    "rating": 5.0,
    "comment": "For a eurogame without individual player boards it somehow feels more solitaire than an Agricola or Burgundy, or even multiplayer puzzlers like Cascadia. Those games have either stronger indirect interaction, or at least I can look over at your board and appreciate what strategy you're going for and that it is different than mine - in Concordia we are all doing slightly different flavors of putting little houses on cities. Because of this it lacks any highs or lows or moments you'll talk about a month after playing. This places it in a weird area where it's too breezy for the heavy gamers in my life but too long for the more casual gamers to get into it.\n\nIt's a good puzzle for sure but has felt like it has fallen a little flat every time I play. The near-universal acclaim keeps me coming back to see if I am missing something but I'm not sure I am.",
    "timestamp": 1693346400
  },
  {
    "username": "dakotamassie",
    "rating": 5.0,
    "comment": "This game would be better if it wasn't so long, and also its a game where you are stuck a lot of times without much to do\nA bit too much planning ahead for how long the game is\nProbably won't play it again\nDefinitely shouldn't be top 30 on bgg",
    "timestamp": 1693173600
  },
  {
    "username": "Delphinium",
    "rating": 5.0,
    "comment": "Whilst an interesting puzzle. this never grabbed me - I've played it a few times and keep thinking I'm going to peel back new layers that will show me the heart of a game I should embrace, but even though comprehension of the mechanics and strategy increase each time. I'm still left a little flat - there are many other games in the top 100 (and below that) I'd rather play.",
    "timestamp": 1692223200
  },
  {
    "username": "edubvidal",
    "rating": 5.0,
    "comment": "Un juego de construcción de mazos con presencia en el tablero para conseguir recursos que te permiten construir y comprar cartas. Esto último es la clave porque tu puntuación aumenta exponencialmente con las cartas del mismo dios en función de la estrategia seguida.",
    "timestamp": 1683410400
  },
  {
    "username": "DrFunkyBeats",
    "rating": 5.0,
    "comment": "Played 3 times. Components and board in great condition. Box has some minor dents and scuffs.",
    "timestamp": 1679526000
  },
  {
    "username": "FuzzyLlamaReviews",
    "rating": 5.0,
    "comment": "Super dry euro. I went into this one expecting great things due to all the hype and unfortunately was let down. Just couldn't get into the theme or actions or general gameplay. Nothing about it was engaging to me. I still recognize how euro players would enjoy it and don't think it's a bad euro game by any means, just not one that I really enjoyed.",
    "timestamp": 1675897200
  },
  {
    "username": "adamscott",
    "rating": 6.0,
    "comment": "An excellent design and it deserves its popularity, but a game I find a bit dull.",
    "timestamp": 1761951600
  },
  {
    "username": "Lowengrin",
    "rating": 6.0,
    "comment": "Concordia has grown on me over the years. At one point, I was ready to sell it, but was persuaded to give it another go. So far, so good. It's a streamlined Euro that's quick to play and has just enough theme to match with mechanics/actions. But as clear as the game play is, the scoring is like mud. It isn't done until the end and because it requires knowing what cards each player holds, during the game, there isn't a clear sense of who is winning and of who is losing.",
    "timestamp": 1760652000
  },
  {
    "username": "Janseti",
    "rating": 6.0,
    "comment": "It’s a good game, just not enjoyable for me",
    "timestamp": 1760220000
  },
  {
    "username": "hendecatope",
    "rating": 6.0,
    "comment": "w/Solitaria and Venus.\n\nReacquire 9.10.25",
    "timestamp": 1757455200
  },
  {
    "username": "magdalencox",
    "rating": 6.0,
    "comment": "Singapore",
    "timestamp": 1756936800
  },
  {
    "username": "Auroric",
    "rating": 6.0,
    "comment": "A well designed game for sure. I enjoy the mix of area control, and building up both my deck and economy. There's many different paths to victory, and I like that points are obscured, meaning players can pull off surprise wins. Elegant certainly, this game flows very well.\n\nEnd of the day though I just find Concordia very bland. There's little interaction besides blocking; I wish there was some form of direct trading/conflict. Without that it's just a pure resource conversion efficiency puzzle. Players making a territory more expensive does slightly change the math, but that's it.\n\nA fine game, and one I'll play if requested, but it doesn't excite me the way I hoped it would with all the praise it receives.",
    "timestamp": 1756504800
  },
  {
    "username": "Sorp222",
    "rating": 6.0,
    "comment": "The ugliest box cover to don a top 100 geek game? Because it will make top 100' possibly top 20. A natural and lovely progression from the rondel to a quasi deck builder. The scoring feels like Navegador but integrates into actions selections as every card provides points as well as actions. It's not quite a deck builder as you don't havea random card draw - you re always in control of what cards you have to play. Simple rules but loads of options - ultimately tricking a balance between the engine and the VP. Need to explore more and I expect familiarity will led to more focused strategies and a little bit of counter drafting. One of the best games I have played from Essen 13 and proof that there is still life in the middle weight Euro\n\nThe card action mechanic is quite like using the rondel at the start of the game as you can not select the same action till the cards come around again. Where it changes (and becomes more interesting) is in purchasing new actions. As its not really a deck builder in the random draw from a deck is not there is no no down side (other than opportunity cot of resources and actions) to filling your deck.\n\n\n2nd play not so keen. A disguised point salad? With a lot of min max. Poor heuristics. V difficult to see how others are doing.\n\n\n3rd play heuristics better and enjoyed more.\n\n4th Play after many years....and interesting to play after a few plays of Navegador which I prefer because its its a little more obvious how other players are doing.",
    "timestamp": 1755986400
  },
  {
    "username": "uoonsek1",
    "rating": 6.0,
    "comment": "Not bad, however, low replayability.",
    "timestamp": 1752962400
  },
  {
    "username": "Dornroschen22",
    "rating": 6.0,
    "comment": "7/17/25 - If it's not pulled off the shelf to a top 3 within the next year, it'll be chopped.",
    "timestamp": 1752789600
  },
  {
    "username": "Sprydle",
    "rating": 6.0,
    "comment": "Not a bad game at all, and does several very interesting things with the cards which are both special VPs and action cards. We don't like the noodle connections between cities--they're neither historical nor graphic, so end up being just a pain to look at. Note this is not a deal breaker, nor that bad, just a small negative. The biggest problem is that there are just so many better games (for us) that play in the same time. It just wasn't coming off the shelf, so someone else should have chance to see if it fits their group better. Traded away.",
    "timestamp": 1751493600
  },
  {
    "username": "Nalex222",
    "rating": 6.0,
    "comment": "Concordia is a masterclass in minimalism. The depth of this game, considering its simplicity, is truly impressive and it rightfully deserves the accolades it's received. There isn't an ounce of fat on this game; the rules are straightforward, yet the decision space is vast. However, like many euros, Concordia makes no real attempt at theme integration. At no point did I feel connected to the idea of building a Roman dynasty or honoring ancient gods, which left the experience feeling distant and mechanical. Additionally, the actions you take turn after turn remain largely the same from start to finish, resulting in a gameplay flow that feels less dynamic and engaging as the game progresses. Given the choice, I would take Troyes or Tzolk’in over Concordia any day as my top-tier euros.",
    "timestamp": 1750888800
  },
  {
    "username": "couchlife",
    "rating": 6.0,
    "comment": "I really don't love games where everything is so opaque until the end when the six different points scoring methods are revealed. It makes me feel like I'm just bumbling around and not able to really react to what people are doing. Concordia is at least smooth and elegant but I'm a particular kind of guy",
    "timestamp": 1750629600
  },
  {
    "username": "xenon219",
    "rating": 6.0,
    "comment": "Digital edition very fun. I don't find the theme that overly exciting. I think this might be a bit hard to teach though.",
    "timestamp": 1750024800
  },
  {
    "username": "watoop",
    "rating": 5.5,
    "comment": "Same as my comments in Concordia Venus. Minor variation on game loop (expand, get resources, get money, get cards, get action cards back) for over 3 hours. Not enough drama or manipulation possibilities makes for a rather dull and low stakes affair. Antike II is a much better game IMHO.",
    "timestamp": 1749160800
  },
  {
    "username": "ggruetze",
    "rating": 5.9,
    "comment": "Okay I guess. Not my idea of fun. Will possibly play if someone else wants to but will not be my suggestion",
    "timestamp": 1748728800
  },
  {
    "username": "hf774",
    "rating": 6.0,
    "comment": "I played it 3 times.\nThat's will too scarce.",
    "timestamp": 1748124000
  },
  {
    "username": "Eliya84",
    "rating": 6.0,
    "comment": "This game is ok but i don't understand why it is rated so high. It is ok but not more. Easy to learn and play.",
    "timestamp": 1747692000
  },
  {
    "username": "Double Dan",
    "rating": 6.0,
    "comment": "This is a semi-economic engine game that reminds me of Navigador. You have to get your income up so that you can generate goods and money to allow you to build more factories to generate more goods. All along while buying cards to give you VPs. VPs are not tallied until the end of the game so it is hard to know how well you are doing.\n\nI like the card mechanic to determine action selection. It's been done before but still feels fresh.\n\nThat said after 1 play I wouldn't say it wow'ed me. Solid, but nothing spectacular. It might drop a point but don't see it going up.\n\nThis is probably deserves a 7 rating but am dropping it to a 6 based on my eagerness to play again...it's more of \"in the mood to play\" game as opposed to \"usually willing to play\".",
    "timestamp": 1746136800
  },
  {
    "username": "Lightspeed_aust",
    "rating": 6.0,
    "comment": "Played this once and it did not resonate with any of the players, boring as hell and slow.",
    "timestamp": 1746050400
  },
  {
    "username": "Cultofluigi",
    "rating": 6.0,
    "comment": "played twice and we all agreed we didn't really feel like playing it much more",
    "timestamp": 1745704800
  },
  {
    "username": "zgienger",
    "rating": 6.0,
    "comment": "It has replaced Catan in my friend groups and I could be more happy!",
    "timestamp": 1745186400
  },
  {
    "username": "Sesch77",
    "rating": 5.5,
    "comment": "Verkaufen",
    "timestamp": 1744495200
  },
  {
    "username": "black_daveth",
    "rating": 6.0,
    "comment": "The quintessential dry euro? The hand management is cool, but to ends that feel a bit aimless and boring.",
    "timestamp": 1744495200
  },
  {
    "username": "semprini_",
    "rating": 6.3,
    "comment": "I have only played Concordia solo.\n\nThis is very much a \"gamer's game,\" not a gateway Euro as some have claimed. I respect the mechanics of Concordia, but it sadly fell way short of my expectations. It's drier than the Sahara, but the biggest issue for me was the unnecessarily obtuse scoring conditions that make it nigh impossible for new players to strategize. I tried to persist until it clicked, but the game is too long for what it is, and I simply wasn't having enough fun after half a dozen plays to justify continuing. I have far more engaging games in my collection that I'd much rather play.",
    "timestamp": 1744322400
  },
  {
    "username": "Xyt4n",
    "rating": 6.5,
    "comment": "PLAYED AND NOT INTERESTED ENOUGH\n\n+++ different maps are available which offers different strategies\n++ scales very good, which also offers different strategies\n+ does have a learning curve, but not sure how deep\n+ playing is relaxing\n+ point calculating is interesting solved, but mars is underpowered, while other are overpowered\no is interactive for an euro, but sadly not much mean, cutthroat\no ressources are tight\n- components and board is ugly and demotivating before play\n- unthematic abstract play\n- - does not have any memorable moments in the game\n- - - do not feel fulfilled after playing, just a \"good\" board game",
    "timestamp": 1762682340
  },
  {
    "username": "DaneTheBeast",
    "rating": 7.0,
    "comment": "Played (TTS)",
    "timestamp": 1762038000
  },
  {
    "username": "Derianhorgen",
    "rating": 7.0,
    "comment": "SpielboxRating",
    "timestamp": 1761778800
  },
  {
    "username": "Kroomiester",
    "rating": 7.1,
    "comment": "Understandably a classic, but one that wasn’t immediately gripping the way Power Grid, Agricola or Puerto Rico were for me. I did finish my first game with some insight and interest in trying it again. Who knows, maybe I will end up being a big fan of Concordia shortly",
    "timestamp": 1761692400
  },
  {
    "username": "ditterio",
    "rating": 7.0,
    "comment": "CONCORDIA (2-5 players)\nCONCORDIA SOLITARIA (1-2 players)\n\nRules: https://boardgamegeek.com/filepage/95551/rules-english-publi...\n\nConcordia solitaria:\n\n- The reactive nature changes the way to play giving a different feeling of the game. In the end, it gets an optimization puzzle.\n- Building locations are not easy to be identified\n- Point counting is a chore\n- The different difficulty levels are just based on the starting points of the player\n\nMultiplayer game: good!\nSolo game: just ok.",
    "timestamp": 1761692400
  },
  {
    "username": "Parzival1979",
    "rating": 7.0,
    "comment": "I've only played this once in real life, and I remember it being fun. I don't remember loving it though.",
    "timestamp": 1761606000
  },
  {
    "username": "Ryyva",
    "rating": 7.0,
    "comment": "Like a cozy, lazy Sunday afternoon kind of boring.",
    "timestamp": 1761343200
  },
  {
    "username": "purplecow55",
    "rating": 7.0,
    "comment": "A classic euro game where players are playing cards each turn and executing its action (trading resources, buying more cards, moving on land/sea and building, inducing income for all players who in a region or collect all coins placed, copy a prior player's card, pick up all cards and place another meeple on the board, etc. Scoring is influenced by what players have done and points only come from cards they have (initial and any cards bought). Once all cards are played, the player with the most points wins.",
    "timestamp": 1761256800
  },
  {
    "username": "wooloo1",
    "rating": 7.0,
    "comment": "Mostly played at 2p on the Corsica and Creta maps. Concordia gave very good early impressions with its clean, accessible design. I tend to like the action retrieval mechanism, and here it works well. Unfortunately, the shine wore off a few games in. The gears in this efficiency engine became all too visible too quickly.\n\nConcordia is that nice girl/guy, pleasant but lacking oomph and a little bland. A great casual friend perhaps, but not someone to take home to mom and dad (unless, of course, that is your type).\n\nThat said, Concordia is staying in the collection for now, in part because it achieves the rare feat of scaling well from 2 to 5 players. Maybe a little salt will help.",
    "timestamp": 1760824800
  },
  {
    "username": "abaloo",
    "rating": 7.0,
    "comment": "Conquête, production/gestion de ressources, gestion de main (cartes).\nIntéressant, à approfondir",
    "timestamp": 1760479200
  },
  {
    "username": "SteoanK",
    "rating": 7.0,
    "comment": "Would like to play this more!",
    "timestamp": 1760392800
  },
  {
    "username": "Apos",
    "rating": 7.0,
    "comment": "All time classic. Quite easy with some nice decisions and interaction.\nOverall I enjoy it, just I'd like Concordia to be bit faster euro - it takes a bit too long with 5 players.",
    "timestamp": 1759874400
  },
  {
    "username": "KummiRub",
    "rating": 8.0,
    "comment": "Concordia is a good game and also one of the 'nicest' and most 'relaxing' competitive games I have ever played. However, it has been sold as I now find it bores me as my tastes have developed into different directions.",
    "timestamp": 1762470000
  },
  {
    "username": "Noboe",
    "rating": 8.0,
    "comment": "Simple and good game.",
    "timestamp": 1761865200
  },
  {
    "username": "VikingBurger",
    "rating": 8.0,
    "comment": "Egyszerű szabályok, nagyszerű döntések.\nKártyahaszálat akcióra és pontozásra nekem tetszik, de ez megosztó lehet.\nTéma lötyög sajnos, valamint alapból sem annyira érdekes.\nSokkal szebb élőben, mint a képeken.",
    "timestamp": 1761606000
  },
  {
    "username": "pezpimp",
    "rating": 8.0,
    "comment": "The mechanics in this game are very well thought out. The theme of course is just added on but the game play is great. You move your units around to build cities and collect resources with the end goal of collecting scoring cards which are also used to perform actions. There are several ways to score so you can focus on one type and multiply or spread out. Lots of player interaction also as you can block paths, everyone is collecting the same set of cards and production is shared by region. At 5 it gets expensive to build out so the game feels slower and you need to adapt your strategy.",
    "timestamp": 1761606000
  },
  {
    "username": "Rasdel",
    "rating": 8.0,
    "comment": "One of the simplest ruleset ever hide a really deep and interesting gameplay. It was not love at first sight but the more I play Concordia, the more I love Concordia.",
    "timestamp": 1761519600
  },
  {
    "username": "Telaz",
    "rating": 8.0,
    "comment": "My rating(50%): 7.5\nMy “want to play-again” rating(50%): 8.5\nMy averaged rating: 8\nPlays: 1\n\nI could see this one going up! and I could see expansions making this feel more complete. I feel this is just a core mechanism to a larger game - I do love this core feel though just needs something more to it. More interesting cards, buildings, starting hands, etc.",
    "timestamp": 1761429600
  },
  {
    "username": "LannisterCrimson",
    "rating": 8.0,
    "comment": "Bling Status ✓\n\nExpansions: ✓\nPromos: ✓\nSpecial Edition: -\nUpgraded Components: ✓ metal coins, tile bags",
    "timestamp": 1761256800
  },
  {
    "username": "ExcellentRaven",
    "rating": 8.0,
    "comment": "one of the few euros I like. enough blocking to not purely be a boring race game. satisfyingly emergently complex.",
    "timestamp": 1760911200
  },
  {
    "username": "bdavid0127",
    "rating": 8.0,
    "comment": "H",
    "timestamp": 1760824800
  },
  {
    "username": "Medikus81",
    "rating": 8.0,
    "comment": "Vérbeli klasszikus. Szép, letisztult, időtálló. Van amikor szívesen, van amikor kevésbé szívesen játszom vele, mert vannak jobb játékok is nála. Azonban biztos a polcon marad, mert a középnehéz játékok között egy igazi kincs. Egy gateway játék a komplexebb játékok világába. Kevés szabály, nagy mélység. Ez az egyik nagy erőssége.",
    "timestamp": 1760479200
  },
  {
    "username": "Jumicorinbo",
    "rating": 8.0,
    "comment": "It is greater than the sum of its parts. If you see it on the shelf but it even though it looks like the most boring game in the shop. It’s a master piece every gamer needs to tick off their bucket list.",
    "timestamp": 1760479200
  },
  {
    "username": "Narieto",
    "rating": 7.5,
    "comment": "Probably to go",
    "timestamp": 1760479200
  },
  {
    "username": "griffinritmire",
    "rating": 9.0,
    "comment": "Move to south Africa",
    "timestamp": 1762670880
  },
  {
    "username": "yaofengze",
    "rating": 8.5,
    "comment": "烤鱼的",
    "timestamp": 1762383600
  },
  {
    "username": "smobolob",
    "rating": 8.5,
    "comment": "I love the action selection system in this game. Such an elegant and easy-to-teach game. The game works well at all player counts, and the player interactions are very interesting.",
    "timestamp": 1762210800
  },
  {
    "username": "teriyakiprince",
    "rating": 9.0,
    "comment": "feel like it's a mix of catan and splendor\n\nthink it's well balanced -- need to revisit and think about making my own game like this",
    "timestamp": 1762210800
  },
  {
    "username": "W1LDH0R53",
    "rating": 9.0,
    "comment": "6 metal Coins\n1 Card Sleeves\n33 Special Organizer Multiple Use\n5 Coin Capsules",
    "timestamp": 1762124400
  },
  {
    "username": "glsonn",
    "rating": 9.0,
    "comment": "Got in trade, March, 2018.\n\nMac Gerdts. Great game.\n\nH = 50",
    "timestamp": 1762038000
  },
  {
    "username": "Eugeniosaracino",
    "rating": 9.0,
    "comment": "Esp) Juego absolutamente supremo.",
    "timestamp": 1761865200
  },
  {
    "username": "Nuvium",
    "rating": 9.0,
    "comment": "Awful cover but great game! simple and effective! One of my favorite games !",
    "timestamp": 1761692400
  },
  {
    "username": "cinnzel",
    "rating": 9.0,
    "comment": "Me parece un diseño magistral porque, con muy pocas reglas y sin apenas excepciones ni casos particulares en ellas, se establece una dinámica de juego muy competida y bien equilibrada entre todos los jugadores. Expansión territorial y optimización de recursos mediante selección de acciones.",
    "timestamp": 1761692400
  },
  {
    "username": "sorcretic",
    "rating": 8.5,
    "comment": "Feb. 2025 #46: One of my early favorites in the hobby, Concordia continues to squeak into my top 50. It's practically ubiquitous now, but Concordia's \"play one or pick up\" hand-building continues to be one of my favorite action selection mechanisms. The Diplomat is also fascinating at higher counts; you'll need to keep an eagle eye on what other players do to grab another Architect or Senator action. Concordia also lets players choose how they'll score, through card purchases, another favorite mechanism. It's just so solid, and works well at all player counts, assuming you've got a tight enough map.\n\nJul. 2024 #47\n\nJan. 2024 #46: Concordia was also a top game for me early in the hobby. I still really enjoy it, particularly on a very tight map. Racing for cities, clever timing of the Diplomat, using the Prefect at the perfect moment--these are all points of interaction that I love. And the hand management is excellent. It's just been surpassed by the more substantial interaction in some of the above \"cubes on a map\" games.",
    "timestamp": 1761606000
  },
  {
    "username": "quetzal513",
    "rating": 9.5,
    "comment": "P: 2-5, T: 100 min, KenSdJ-N\nOwn Digital app and physical copy\n\nPeaceful expansion and economic development (Euro style interactions). Card drafting/deck building to take actions; clever mechanic to decide when to recall your deck (rather than just as it runs out like most games). Card drafting simultaneously provides lots of scoring options (set collecting). After random board seeding (replay variability), luck influences very little. Scales well with two maps for higher or lower player counts.\n\nMedium weight; simpler rules than you might expect, probably not a gateway but not terribly difficult to teach. Fairly classic, but emotionless/thinly themed Euro (blocking, resource management, puzzly, number crunching)\n\nRemind me a bit of Stone Age (different resources, civilization cards that give tangible benefit and end game scoring, various viable strategic approaches) + Power Grid (area control, more expensive to move into occupied regions)\n\nUpdate, now that I've played it a bunch: I see it's classic euro, hall of fame worthy appeal. If I was starting a collection from scratch, I would definitely consider Venus + Solitairia for cornerstone additions. However, adding the physical game to my collection at this time is unlikely for a couple reasons: Shelf space is really tight and it's competing against any game I'm adding and weighed against games it would have to push off the shelf. I don't think this game is best at 2, although the automa seems nice to add the co-op variation (haven't experienced that yet). These types of games with minimal luck, lots of subtle interaction have great appeal to me, but I don't have the group to play this with that would make it sing. I have a few minor concerns with gameplay and longevity, but some of that is due to not playing against enough experienced players. Also, saw the physical game at the store, the box is huge! Discouraging to get knowing it will be tricky to find it a spot on the kallax.",
    "timestamp": 1761519600
  },
  {
    "username": "bkevans",
    "rating": 9.0,
    "comment": "Love this game! Slightly repetitive after multiple replays, but that speaks to how much I enjoy it.",
    "timestamp": 1761519600
  },
  {
    "username": "madtimmy",
    "rating": 9.6,
    "comment": "w/ salsa\nsleeved",
    "timestamp": 1762383600
  },
  {
    "username": "maple107",
    "rating": 10.0,
    "comment": "Might be THE perfect game. Very well designed and balanced. so enjoyable even if you're far behind everyone else. It'll play differently every single time. There's so many strategies you can use with almost 0 luck involved yet they're ALL very balanced.\n\nFirst game will take at least 1hr/player but goes down to around 30min/player",
    "timestamp": 1761951600
  },
  {
    "username": "szycha_gracz",
    "rating": 10.0,
    "comment": "Imperium 5p / Italia 4p",
    "timestamp": 1761606000
  },
  {
    "username": "fourquartets",
    "rating": 10.0,
    "comment": "Expansions:\nBritannia / Germania\nSalsa\nGallia / Corsica\nVenus (Venus cards not stored in boxes)\nBalearica / Cyprus\nAegyptus / Creta\n8 Forum Cards Mini Expansion\n\nInsert:\nFoamcore by mholzma\n\nNotes:\nStill one of my favorites, if not my favorite game, of all time. Doesn't get played enough. Never getting rid of it.\n\n[SF]",
    "timestamp": 1761429600
  },
  {
    "username": "el_crosso",
    "rating": 9.9,
    "comment": "Played a bunch online and played the new Solo expansion.\n\nIt is the most euro game you will ever encounter, but it is also one of the greatest ever created. Most people will not be blown away by the looks, but the gameplay makes up for it in spades.\n\nThe fantastic card play is where the magic happens. Make sure you maximize your turns and also build out your scoring opportunities at the end by picking up the cards from the market.\n\nWith tons of maps, with small new rule changes, this system has an endless life before it.\n\nI applaud you, Mac. This is your Magnus Opus.",
    "timestamp": 1761084000
  },
  {
    "username": "Andres_VPB",
    "rating": 9.5,
    "comment": "Menudo pepinazo de juego",
    "timestamp": 1760738400
  },
  {
    "username": "C Thompson",
    "rating": 10.0,
    "comment": "Concordia is a quintessential Euro game. If you like to generate resources and convert them into points, it is the best of its kind. Since the action cards double as your scoring incentives at the end of the game, the core challenge of Concordia is balancing a broad, well-rounded action economy with a narrow, focused point-scoring strategy. The puzzle is maddening and counterintuitive, and I love it.",
    "timestamp": 1760565600
  },
  {
    "username": "Jbroots",
    "rating": 10.0,
    "comment": "Base box contains expansions & maps.\n- Concordia: Salsa\n- Concordia: Aegyptus / Creta (2017)\n- Concordia: Britannia / Germania (2014)\n- Concordia: Solitaria (2021)",
    "timestamp": 1759788000
  },
  {
    "username": "Tannerd",
    "rating": 10.0,
    "comment": "Fantastic game. Either with or without expansions.",
    "timestamp": 1759788000
  },
  {
    "username": "Farfi55",
    "rating": 9.5,
    "comment": "It's very satisfying building your trade empire and deck, we sometimes get stunned by decision paralysis, but if you can plan ahead everything goes much smoother.\nIt's the heaviest game I play with my family, and games can get pretty long (4h sometimes, yes we are slow) but I enjoy every minute of it.",
    "timestamp": 1759615200
  },
  {
    "username": "Elocution Safari",
    "rating": 10.0,
    "comment": "What a joyful semi-crunchy euro. Plenty of opportunities to feel clever and powerful. I love the main card play mechanism, and all of the game elements click together. Also surprisingly easy to teach as everyone just reads along on their cards as you explain the actions and all the information is open. Salsa expansion included.",
    "timestamp": 1759356000
  },
  {
    "username": "timkrysko",
    "rating": 9.6,
    "comment": "+ Venus Expansion\n+ Salsa Expansion\n+ Forum Cards\n+ Folded Space Insert\n+ Geek Up Bags\n+ Sleeved Cards",
    "timestamp": 1759010400
  }
]