[
  {
    "username": "Floating World",
    "rating": 1.0,
    "comment": "Expansions should not be ranked.",
    "timestamp": 1754172000
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "It's okay, but.... such a sour atmosphere, it's one of those games where your teammates complain that you didn't play optimally. And it's co-op so that's everyone at the table. I can't get that out of my mind.\n\nComparing it to Fellowship, there's a lot of things I like less about this game's approach. Some are trivial like lots of trumps, random missions, the communication token. But the biggest difference to me is how everyone says they're pretty much the same just because they're co-op. To me they feel like night & day because of the theme (and the lack of one in The Crew) but to everyone else they're the exact same game? I guess that reveals a lot about boardgamers and how they see theme.",
    "timestamp": 1752098400
  },
  {
    "username": "CourtJesterCowboy",
    "rating": 1.0,
    "comment": "I genuinely believe some sort of psyop is occurring with this game, or they purchased their ratings. I bought it because it is rated #1-2 for \"family\" and has VERY high reviews in locations like Amazon...\n\nWell, I ran the game with my mom, dad, and grandma... and let me tell you, we were all confused at how BORING and OPEN the game is... You literally just put cards down and put some more cards down, and you either do objectives or you don't... YAWN. I WOULD RATHER NOT EVEN PLAY A GAME, it was that stupid.\n\n... and for some extra info, I have played probably 200 board games in my life and another 3000 video games which are somewhat similar in the understanding of mechanisms in gaming as a whole. I love many classic titles and am an avid MTG player who wins events, even.\n\nMy point is, I know complexity. I know simplicity. This was some washed experience that accomplished neither and left us questioning if we even ran the damn thing correctly. (we did, it's just lame. Will probably try to sell it to someone at the game store for $5)",
    "timestamp": 1747519200
  },
  {
    "username": "jedirahl",
    "rating": 1.0,
    "comment": "Campaign Game",
    "timestamp": 1740265200
  },
  {
    "username": "tectactoe",
    "rating": 1.0,
    "comment": "I wanted to like this more but after a few games with my group, we felt like that was enough and haven't had much desire to return to it. I love what it's trying to do but for whatever reason it still seemed a bit bland after just a few games.",
    "timestamp": 1736204400
  },
  {
    "username": "markveerman",
    "rating": 1.0,
    "comment": "Extremely boring",
    "timestamp": 1654466400
  },
  {
    "username": "Wolcik",
    "rating": 2.0,
    "comment": "Digital version available (BGA)",
    "timestamp": 1758751200
  },
  {
    "username": "distanceovertime",
    "rating": 2.0,
    "comment": "I am not a card game person.",
    "timestamp": 1732921200
  },
  {
    "username": "Carlcast",
    "rating": 2.0,
    "comment": "Juego de bazas cooperativo en el que para conseguir unos objetivos comunes no puedes hablar. Me pareció un juego bastante aburrido y sin gracia. No entiendo su primera posición entre todos los juegos familiares.",
    "timestamp": 1729548000
  },
  {
    "username": "AmstradHero",
    "rating": 2.0,
    "comment": "I mean, it's better than \"The Mind\" as far as \"latest card only game generating buzz\", but that's saying almost nothing. If I want to play a trick taking game, I'd rather just grab an ordinary deck of cards and play 500 with four people. Because I know I'll enjoy that every time, rather than the tedium that this game provides. I wish Mike from the Dice Tower was right on this one and it would have just been a flash in the pan. Seriously, just get your three friends and learn 500. It's infinitely more fun than this game.",
    "timestamp": 1677970800
  },
  {
    "username": "jb78580",
    "rating": 2.0,
    "comment": "Not my cup of tea",
    "timestamp": 1673650800
  },
  {
    "username": "gragatrim",
    "rating": 2.0,
    "comment": "I was super excited for this given how much we love the original. We were sorely disappointed. What you get now instead of an interesting puzzle to try and solve with your partners, is a deduction puzzle that you get to try and decipher before each and every game with the random objectives that get flipped over. There were numerous times where the choice for who could take what objective wasn't actually a choice. The number of times that it was literally impossible to achieve the results was also far greater than it should have been, and it certainly didn't help that often we would be half way through the game before we realized it was impossible.\n\nWith the original you could almost always accomplish all tasks, and there was some actual interesting decisions on who could take what. In this it seemed more of, well I can't do 3 of the 4, so I guess I'll take the one I can do, and hope that it doesn't end up making an impossible situation occur(spoiler alert, it almost always did for us).",
    "timestamp": 1633212000
  },
  {
    "username": "Ginewra",
    "rating": 3.0,
    "comment": "bga",
    "timestamp": 1739660400
  },
  {
    "username": "BearableEnd",
    "rating": 3.0,
    "comment": "I bought this as it was on offer and had great reviews. But not for us sadly, thought the trick taking element would be something fresh and interesting, but we couldn't get invested in it. Shame.",
    "timestamp": 1737846000
  },
  {
    "username": "Eightfingers",
    "rating": 3.0,
    "comment": "I prefer the original because impossible mission constellations happens way too often (e.g. two or more players must win the first or last trick or more tricks must be won in different ways than the total number of tricks available).\n\nThe game is seriously broken. Interesting games are a rare exception. Usually the missions are either way too easy or impossible to win. The game should rather be called \"The Crew: Mission Reshuffle\".",
    "timestamp": 1735167600
  },
  {
    "username": "hisashirockzzz",
    "rating": 3.0,
    "comment": "2023-03-24",
    "timestamp": 1694815200
  },
  {
    "username": "BallenFam",
    "rating": 3.0,
    "comment": "Played first time at Treehouse in Sheffield, UK. We did not play it and will probably not since the 2-player variant is just a \"dummy\" player. Rules seem to be more complicated than the game needs to be.",
    "timestamp": 1679094000
  },
  {
    "username": "jimterr",
    "rating": 3.0,
    "comment": "game just not for me",
    "timestamp": 1655762400
  },
  {
    "username": "vdwoord",
    "rating": 4.0,
    "comment": "Didn't like this game. Not my kind of game",
    "timestamp": 1757628000
  },
  {
    "username": "Flatirons",
    "rating": 4.0,
    "comment": "On BGA premium.",
    "timestamp": 1753135200
  },
  {
    "username": "Hinmatt",
    "rating": 4.0,
    "comment": "The concept of a cooperative trick-taking game with limited communication is quite interesting.\nUnfortunately in every failed attempt to win a level there is one person who makes the decisive mistake. If it's the same person several times, it can be quite demoralizing for that person and can make them feel stupid. And the other players can get annoyed towards that person or even blame them for having to play the level again.\nI don't like that dynamic.\nThe concept itself is interesting for a short while, but in my opinion competitive trick-taking is just much more fun.",
    "timestamp": 1752962400
  },
  {
    "username": "BBorneo",
    "rating": 4.0,
    "comment": "This game is really not for me. Most setups play themselves, verry uncreative and even when you succeed you dont feel that rewarded bc you collectively won an uno hand.",
    "timestamp": 1752703200
  },
  {
    "username": "SteveLambo",
    "rating": 4.0,
    "comment": "A lot of people seem to like this game. It just felt like work to me. I guess I'm just not a co-op gamer.",
    "timestamp": 1751839200
  },
  {
    "username": "Qyks",
    "rating": 4.0,
    "comment": "Kartenspiel (2.02)\n2-5 Spieler\n20 Minuten",
    "timestamp": 1750629600
  },
  {
    "username": "Ephorus",
    "rating": 5.0,
    "comment": "Nothing against the game, I just don't enjoy cooperative games.",
    "timestamp": 1762038000
  },
  {
    "username": "dmwainw",
    "rating": 5.0,
    "comment": "BGA - Cooperative trick-taking campaign. No thanks.",
    "timestamp": 1759356000
  },
  {
    "username": "Josh123212321",
    "rating": 5.0,
    "comment": "This game has 'infinite replayability' but not in a fun or interesting way. You're able to pile on objective cards which result in massive swings in difficulty just due to the other cards that you have to achieve along side them.\n\nCompared to The Lord of the Rings: The trick taking game, where each mission has a curated set of criteria that offer interesting interplay, I just don't understand why you'd play this version.\n\nHaving the most possible permutations in the gameplay isn't a bonus. I'd much rather play 20 varied and interesting rounds than 100 random ones. This game is bad, and anyone who rates it highly Is a bad boy",
    "timestamp": 1755640800
  },
  {
    "username": "Kantai",
    "rating": 5.0,
    "comment": "A fun trick taking game with more flexibility than its counterpart.",
    "timestamp": 1754776800
  },
  {
    "username": "Arnar146",
    "rating": 5.0,
    "comment": "Gulli",
    "timestamp": 1754431200
  },
  {
    "username": "Malt3999",
    "rating": 5.0,
    "comment": "Game not well tuned for 3 players, either too easy or too hard. The decision space is deceptively small.",
    "timestamp": 1753826400
  },
  {
    "username": "sykano",
    "rating": 5.1,
    "comment": "second edition of the cooperative trick-taking game\nsurprisingly awkward and boring\n\nhas a bit more replayability than its predecessor\nand even the theme makes more sense (with the can't communicate thing)\nstill very abstract, not thematic at all\n\nI don't like the very strict process of assign mission cards. Could be improved for the case when there are more mission cards than players by doing one round at a time and allowing to pass when in the last round there are fewer mission cards than players.\n\nbasically replaces the first one, which is also awkwardly annoying\n\nreminds me a bit of \"Hanabi\"\nI hate coop games where you are not allowed to communicate.",
    "timestamp": 1753567200
  },
  {
    "username": "papa_bear_is_asleep",
    "rating": 5.0,
    "comment": "I really wanted to like this. I think the disconnect between the mechanics and the theme was just too high for me, personally. I couldn't get into it.",
    "timestamp": 1752962400
  },
  {
    "username": "syphon",
    "rating": 5.0,
    "comment": "I played with a group of 5. It...didn't strike me as super difficult, but I also realize we didn't take on the more difficult challenges.\n\nIt reminds me of playing Hanabi.\n\nUpdate: lowered from a 6 to a 5. I realize now what gave me a sense of unease the first time I played. I'm not fond of games that have a chance of coming with a lecture of how I have played 'wrong'. My life is too short to put up with that kind of thing. I have better things to do.",
    "timestamp": 1751752800
  },
  {
    "username": "purplecow55",
    "rating": 5.0,
    "comment": "A follow up to the crew with the biggest change is that each mission have a difficulty rating and goal cards are drawn equal difficulty rating.",
    "timestamp": 1748296800
  },
  {
    "username": "Xokiru",
    "rating": 5.0,
    "comment": "The mechanics are interesting and unique, but that’s all. I tried playing with many different groups, but none of them wanted to play again. It's just boring.",
    "timestamp": 1747605600
  },
  {
    "username": "tbrofromspace",
    "rating": 5.0,
    "comment": "This is the game to play with your bridge-playing father, but has been nearly completely eclipsed for me by The Gang.",
    "timestamp": 1747346400
  },
  {
    "username": "Nanferun",
    "rating": 5.5,
    "comment": "And ok game that play like older card games but with a twist, i dont get why the high praise.",
    "timestamp": 1762124400
  },
  {
    "username": "Alex_P_",
    "rating": 6.0,
    "comment": "One of the best introductions to trick-taking in an interesting cooperative twist.",
    "timestamp": 1761519600
  },
  {
    "username": "MatroidX",
    "rating": 6.0,
    "comment": "Good, but I'm not enjoying it as much as the original so far (reached level 10). I think the issue is that the individual card missions (that you pick) are a bit too convoluted. It helps with variety, but...\n\n- I find I'm spending more brain power on tracking mission statuses than on coming up with mission strategies (i.e. one mission card = player has to win tricks with all four 3s, and I know they've won three 3s but are we missing suit A or B?) Of course it's not hard to remember one such mission, but if you've got 10 complex missions it's overload, and honestly not as much fun. I want the parts to be simple and generate depth, not have complex parts. I want to concentrate on the strategy, not the status.\n\n- Because the mission cards are usually combinations (e.g. do these 2 or 3 things), I find I have far less choice in practice. For instance, many mission cards even state \"this is impossible if X\" / \"reshuffle and re-deal if X happens\". We had one round where there were 5 missions out there, but 4 were 100% guaranteed impossible for me to do (i.e. I can't win exactly 2 trump when I have no trump in my hand; if I only had the lowest trump in my hand it would also be impossible) and the last remaining mission was highly unlikely but I had to choose it.\n\n[The owners of this game, who we played with, felt same way and were surprised because their previous games with others had gone better. So maybe just really bad luck?]\n\nSo it feels like the mission deal is determining our success far more than our playing skill, because of what combinations arise. Sometimes they are near-contradicting and restricting mission allocation to almost no choice (which is not really that fun), or they provide synergies and it is a cakewalk (which is also not really that fun).\n\nIt's far from a bad game, I'm just frustrated because I felt it took a step back in its evolution. I think greater variety was a great thing to aim for, but the cards as-is feel over-constrained, providing less agency to the player. (Which missions you picked used to convey significant information and be a key choice; now it's often out of necessity / no other choice.)",
    "timestamp": 1760911200
  },
  {
    "username": "ginkhoma",
    "rating": 6.0,
    "comment": "Gift F. Don ludothèque",
    "timestamp": 1760824800
  },
  {
    "username": "mlm67",
    "rating": 6.0,
    "comment": "S E L L ??",
    "timestamp": 1760824800
  },
  {
    "username": "VioletSquirrel",
    "rating": 6.0,
    "comment": "feb 2025: played it few times in person and BGA and decided I have to have it, so that I can play it even more since I'll be the one bringing it to our gaming meetup too \n\nI love the game, I love limited communication, and we allow for so much wiggle room about it because we're all still learning it. Like, we'll allow repeating mission out loud, or confirming which colors are gone, or discussing strategies in vague terms at the beginning. Just not talking about cards or plans. I think I wouldn't like the game if it would be done in complete silence, because I'd be lacking that team part of it.\n\nFailing several times same mission in a row and then finally succeeding brings huge dopamine rush  I'm yet to find another game with such huge and repeatable effect",
    "timestamp": 1760565600
  },
  {
    "username": "TheRonman",
    "rating": 6.0,
    "comment": "I'm not much of a fan of the trick taking without talking.",
    "timestamp": 1760479200
  },
  {
    "username": "Lord Heisemberg",
    "rating": 6.0,
    "comment": "C’est exactement le même principe de jeu que le premier opus, avec des missions différentes dans le fond et la forme. C’est toujours agréable à pratiquer et toujours aussi difficile à avancer dans les missions (qui ne sont plus que 30, contre 50 dans la première boîte car elles sont plus difficiles).",
    "timestamp": 1755986400
  },
  {
    "username": "TheTroublewithForest",
    "rating": 6.0,
    "comment": "Honestly this series is lost on me. It’s not bad, in fact I can agree it’s well made. I just have no engagement in the puzzle. It’s dull.",
    "timestamp": 1755208800
  },
  {
    "username": "Monolithian",
    "rating": 6.2,
    "comment": "Clever trick taking game, understanding over players intent with limited communication. Fun at the end of game trying to understand some of the decisions made by players.",
    "timestamp": 1753567200
  },
  {
    "username": "onceplayed",
    "rating": 6.0,
    "comment": "my problem with this game is that the win state progression is binary, meaning you either help your team win or you actively make your team lose. combine this with no table talk means stronger players cant help weaker players and weaker players cant help the team -- you either get it or you dont. since i have problems remembering whats happening, i will be completely useless as soon as we hit 4+ objectives.",
    "timestamp": 1753567200
  },
  {
    "username": "Angelcollector",
    "rating": 6.0,
    "comment": "Okay. I don't see why you should want this, if you have Search for Planet nine. Otherwise, it is basically the same game.",
    "timestamp": 1753135200
  },
  {
    "username": "CarsonChandler",
    "rating": 6.5,
    "comment": "Hot take: the crew is too hard to teach and play. I'd rather do something else.",
    "timestamp": 1762652040
  },
  {
    "username": "JaredEagle",
    "rating": 7.0,
    "comment": "Kosmos\nThomas Sing",
    "timestamp": 1762210800
  },
  {
    "username": "THE_GODFATHER",
    "rating": 7.0,
    "comment": "X",
    "timestamp": 1761951600
  },
  {
    "username": "Rasdel",
    "rating": 7.0,
    "comment": "This theme and the missions work better for me than the original.",
    "timestamp": 1761519600
  },
  {
    "username": "tjbizzle",
    "rating": 6.5,
    "comment": "The ruleset just didn't click for me and it's more complicated to teach than The Gang. No one cares about the \"campaign\" elements in my friend group, so the tension and simplicity that comes from a game like The Gang is more interesting to us.",
    "timestamp": 1761519600
  },
  {
    "username": "johngarrison",
    "rating": 6.5,
    "comment": "Trick-taking games in general don't click in my brain. This one is admittedly clever, but relies too much on everyone being up to speed and focused. Not much table-talk. It also takes too long. Technically a great game, but not one I enjoy the actual experience of playing.",
    "timestamp": 1761429600
  },
  {
    "username": "Lillisi",
    "rating": 8.0,
    "comment": "good game totally depending your game group.",
    "timestamp": 1762690920
  },
  {
    "username": "yaofengze",
    "rating": 7.5,
    "comment": "116.11",
    "timestamp": 1762383600
  },
  {
    "username": "Xonmalkari",
    "rating": 8.0,
    "comment": "A great cooperative card game with improvements concerning the original game. The tasks are more defined and the aspect of evaluating one's own hand gets more prominent. With the right group, even several failed attempts in a row cannot keep you from trying and winning, and with each new card distribution there is a new chance.\nFor beginners, the original \"The Crew\" might be necessary to get into the strategy thinking, but players with more experience might just skip it and go straight to this game.",
    "timestamp": 1762124400
  },
  {
    "username": "paimon616",
    "rating": 8.4,
    "comment": "트릭테이킹을 이용해 미션을 클리어하는 협동 게임. 최소 3인이 필요하다.\n플레이어간 커뮤니케이션 할 수 없다는 규칙이 답답하지만, 이 규칙이 결국 긴장감을 유발하는 핵심이라는 점이 재미있다.\n근데 잠수부들은 기본적으로 무전이 되는거 아닌가? ㅎ",
    "timestamp": 1761778800
  },
  {
    "username": "austintehguy",
    "rating": 7.5,
    "comment": "3-5; 20 min",
    "timestamp": 1761519600
  },
  {
    "username": "sosajoe",
    "rating": 8.0,
    "comment": "There are various levels of tough goals to meet. Makes a private, cooperative game very interesting and strategic.",
    "timestamp": 1761256800
  },
  {
    "username": "Kaldau",
    "rating": 9.0,
    "comment": "Fun and very good. I was doubtful when buying it, but it deserves the hype. Would play it any time. Provides quick playtime, meaningful decisions, tactics. Easy to carry with you. Only problem is that the family is a bit less enthusiastic. The miss the theme. I hope to change it and play more. Note: maybe try LoTR trich taking?",
    "timestamp": 1761778800
  },
  {
    "username": "ditterio",
    "rating": 9.0,
    "comment": "(2-5 players)\n\nSolo: you deal out four cards face up to each of four hands, making sure to include the highest trump card, and choose your missions as in the original game. Play one round. Then deal out four more face up cards, one to each hand, and play another round, etc. None of the hands are specifially the \"player\" hand or \"bot\" hands; instead you're playing all four hands. You have complete informations for the cards on the table, but there are more cards in the deck and you don't know when they'll come up, or where they'll land. For each new round, everyone gets one new card, which means that throughout the game there are always four cards in each hand, until all the cards have been dealt out, and then you play the last four rounds with the cards that are left.\n\nEven better than The Crew: The Quest for Planet Nine",
    "timestamp": 1761692400
  },
  {
    "username": "opti_mind",
    "rating": 9.0,
    "comment": "Trick taking mechanic taken to it's most excellence level. This special 2nd iteration of the game makes the game even more varied and dynamic than ever!",
    "timestamp": 1761606000
  },
  {
    "username": "VoteForPedro",
    "rating": 8.5,
    "comment": "Almost the same as the first game, but the goals are more interesting, they create a value system on the back that randomizes goals in a much more interesting way than before. Still remains a great game",
    "timestamp": 1761606000
  },
  {
    "username": "BoardgameBriBri",
    "rating": 8.5,
    "comment": "PERSONAL LIKES\nCategory: Mythology\nMechanism: Communicaton imits, cooperative game, deduction, hand management, trick-taking",
    "timestamp": 1761519600
  },
  {
    "username": "TommyBolinFreak2112",
    "rating": 9.0,
    "comment": "Sleeved",
    "timestamp": 1761429600
  },
  {
    "username": "Dr_IJ",
    "rating": 10.0,
    "comment": "Amazing game",
    "timestamp": 1762562460
  },
  {
    "username": "Rogojine_",
    "rating": 9.5,
    "comment": "Best trick-taking game i've played, feels like a better version of bridge: more variety, and keeping everyone involved. The fact you can basically choose your difficulty is very nice",
    "timestamp": 1762038000
  },
  {
    "username": "SaraCV",
    "rating": 10.0,
    "comment": "A strict upgrade from the original space version with much more variability in tasks which makes replaying the earlier missions when teaching the game still interesting for everyone regardless of their experience.",
    "timestamp": 1761951600
  },
  {
    "username": "steinsucherin",
    "rating": 10.0,
    "comment": "Stichspiel, 3-5 Personen",
    "timestamp": 1759960800
  },
  {
    "username": "totalhenshin",
    "rating": 9.5,
    "comment": "I really can't think of another co-operative game that gives this Vulcan mind meld with you and the other players. Maybe this is what bridge partners have been having for years and are scoffing at nerds like me finally catching on, but I feel like this game DOES give that on-ramp of just a smooth journey to understanding your fellow players, through the limited communication and also a clearly defined goal. This version is superior to the QfPN version just due to the greater variability in mission structure and goals, but both are great. The best trick-taking game I've ever played.",
    "timestamp": 1759701600
  },
  {
    "username": "hylian_marq",
    "rating": 10.0,
    "comment": "Even better than the 10/10 original",
    "timestamp": 1759615200
  }
]